{
  "Hhfub73N5_-56AO8VxfbCA": {
    "date": "5/19/2015",
    "text": "Not what I expected. Poor service , to many in experienced wait staff , did not offer any specials , did not know drink menu ,",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DghQe6hJStuSv6DHL6VI1A"
  },
  "sJalZM7Nw9c0IC-6U1fcvw": {
    "date": "9/9/2015",
    "text": "Sunny Jim's never disappoints!!!! Can't go wrong with their amazing smoked wings and all of their sandwiches are great too - a regular joint for me and my friends :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hPxRaWAfFTW1L05cP4Vsg"
  },
  "99BRaYGfCQBeI8xysVZvhw": {
    "date": "8/20/2015",
    "text": "Love this place!! Close to home, great food, in a nice family setting. The wait staff are always friendly and attentive. Prices are reasonable with large portion sizes. My kids (5,9,12) always request Sunny Jim's when we have a family night out. Large, clean and spacious dining room. Have yet to be disappointed. The wraps are delicious and my personal favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QYKYQIKAofUv_4bpEJC2jw"
  },
  "nwXGte3DRfGLBhuPwEJmzw": {
    "date": "3/30/2014",
    "text": "Worst dining experience of all time. Waited 75 minutes after ordering until the food came. Waiting staff was inattentive and several times promised \"food would be up in one minute.\" I will never return and I beg all people to avoid at all costs.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gTbqg3OakGBESmUbq-O5rw"
  },
  "X8-1MrRhMzd_AjqxRG_qOg": {
    "date": "8/6/2012",
    "text": "A relaxed sports bar with plenty of TVs, a decent beer selection, and good food. I've eaten their hot wings twice (very good and actually pretty hot) and their buffalo shrimp, which came with a side of celery and bleu cheese. After three or four times there, I'm yet to have a complaint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "siXk1tMpQHQwpyAcpKNw5A",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/siXk1tMpQHQwpyAcpKNw5A/o.jpg"
      },
      {
        "img_id": "ebk1x52bU6WNAO1mcE9VIg",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ebk1x52bU6WNAO1mcE9VIg/o.jpg"
      },
      {
        "img_id": "KeDKeYtI4Uhg6oPA-ME6Bg",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KeDKeYtI4Uhg6oPA-ME6Bg/o.jpg"
      }
    ],
    "user_id": "HgNh03VoiCYQCM5zOJMwWg"
  },
  "JfHCRmOpvmwfrGzht1yjIw": {
    "date": "7/10/2016",
    "text": "Missed the occasional on brunch on an earlier review. They had one ham egg and cheese sandwich but it came on a hamburger bun.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9xJ-7-A96wBa-08eRImKlg"
  },
  "rf53Fipz7xaGWgVs7mH70g": {
    "date": "6/4/2016",
    "text": "Fun times!  They have NTN Buzztime games available to play. Lots of tv's to watch our local teams.  They have IC Light specials for the Pirates games.  They have lots of seating and plenty of nice servers.  Food is tasty!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yvSs0inP4iGJo3_3sJ4iJg"
  },
  "PZA4C4ZsRrIlyIyPRwgPPA": {
    "date": "8/21/2011",
    "text": "Sunny Jim's is a great little place to go for the bar atmosphere.  We went to catch the Pirates game on Saturday.  The hostess was friendly and seated us near a TV.  Our waitress was great as well.  She kept the drinks coming and was timely with her service.  We ordered wings which were delicious.  Their hot wings are HOT!!!  If you don't like HOT order mild.  The prices are reasonable as well.    They have an outisde patio which is beautiful.  The furniture is a bit uncomfortable but the atmosphere is nice.    If you are looking for a local bar with good food and reasonable prices give this place a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "htcbcv878nz2uiLkK1-yUA"
  },
  "wNBgJvWy0Fumfi8BYyRY0w": {
    "date": "8/16/2015",
    "text": "This was my first time to Sunny Jim's Tavern and it is a local restaurant I will surely come back to. I am told that it's been here for a good while, but heard that management has since turned over. The servers that we had were exceptionally polite, respectful, and overall very nice. The manager frequently checked in on us which did not bother my girlfriend and I due to his optimistic and enthusiastic aura that permeates the workers and the restaurant itself, all of this being 9:30 on a Sunday night too, after what I'm sure was already a long days work. The food came out with nothing to complain about and only enhanced the ambiance that is being revived in this establishment. It is good to note that this restaurant is a \"seat yourself\" place, which made our experience a comfortable one, enjoying the secluded outdoor patio surrounded by the peaceful forest and a gentle artificial waterfall that does not distract, only enhances. I was extremely pleased with everyone, the food, the timing, and will certainly be back again. Hats off to our server Kelly and Manager Patrick. Keep doing what you're doing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tBhbjVjjBFJ5ZXkqL7hbqw"
  },
  "wRBvr82R0n3w6uFdxYGGpg": {
    "date": "8/9/2015",
    "text": "This is a neighborhood-type place to which you can bring your family, catch a game on the 15+ big screen TVs, or just sample the wide selection of beers. And the food is very good for lunch or dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "94s59PA3rme_PQXF-In4pg"
  },
  "kYpVah9iKCED8fDknGCA5g": {
    "date": "7/9/2013",
    "text": "very disappointed in wings and yings! It used to be a decent deal! what happened? Thursday night, wings are now charged at menu prices. They have big wings @ .69 a wing,scrawny and dry. It took 2 1/2 hours to get 2 orders of wings and they were not very busy. Sunny Jim's and wings forget about it!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4kOoT9i_ON4cdI7LPa5Gng"
  },
  "cEtdQx3OJ_hOcpT4C35ASw": {
    "date": "12/31/2015",
    "text": "Have been here during the summer and the pulled pork / Pierogie dish was good, BUT WHAT HAPPENED?   Ordered same dish but  had more onions than pierogies and BBQ sauce was ketchup at  best.  Not consistent in food quality",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I0x6dLNBMZecfXa2tQgZ4g"
  },
  "mOlbAxEW7aocG3koaxM3vg": {
    "date": "5/16/2015",
    "text": "I have been to this place three times and each time they had a loud band and there were lots of people.  Sounds like the place to be, right?  They could not have made my family of 5 feel more uncomfortable and unwanted (see some other reviews).  They catered to the \"bar\" type customers and really made us feel they didn't want out business.  We are there once and the food was good, but the service was horrible! Wait was way too long!  The other two times we left after they made us feel unwanted.  Do NOT eat here unless you are into bands and extremely poor service.  Again, food was good, which is what made me give them 2 Stars, otherwise it would have been one!  I will NEVER VISIT THIS PLACE AGAIN!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7XXcCSOP1j6Kz2A2EZpaew"
  },
  "DaPmOLWdVfGq5eAYUgypNQ": {
    "date": "4/30/2012",
    "text": "Decent food. So/so service. Kinda got the idea that we were bothering them by being there. We were served ice cold soup. I had to ask if it were supposed to be served cold. She said no, and microwaved it. It was lukewarm at that point. When I got the bill I was shocked at their prices. It will be a last resort for a dinner. The bar is better than the restaurant but how hard is it to sell beer am I right guys?",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "LrqytyCCw_qFjpomyRXlcw"
  },
  "ziWxjQUno8MFCvzHAZOMZg": {
    "date": "2/5/2015",
    "text": "This place is great! The wait staff is amazing also! I would go here over any place in Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fdlg0nMZjb18Qaw3rFRd5A"
  },
  "wFY8Qp-3chSTrs0IpU1jXQ": {
    "date": "9/15/2014",
    "text": "The outside seating in the summer is impressive...you would never expect is when you walk in the front doors. Burgers are great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LIHlbBXL5LsOyNpQVAU3lg"
  },
  "08qozDCATCK0X0pVU615xw": {
    "date": "3/31/2011",
    "text": "My family visited on a Tuesday night; NOT busy yet impossible to get service! Server ordered wrong entree' for me AND my son and was upset we wanted it fixed right! Mine was entirely wrong; my son TRIED to eat the HOT wings he was given even though he ordered BBQ! Refills were non-existent. Too bad the food is pretty decent bar food for the $$$ but if you get bad service it is tough to consider going back when you have similiar restaurants locally that you can go to from where we live. I contacted Sunny Jim's but was ignored; so they have lost three customers with their lack of customer consideration.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "3k2r145akirQKCgWSr4ICQ"
  },
  "1RzGy6SyKMnZQgSgh3BfnQ": {
    "date": "5/27/2011",
    "text": "Sunny Jim's is a great neighborhood bar/restaurant: good food, cheap drinks, non-smoking.  Excellent place to catch a sports game, play pool, and grab some wings.  I've watched a few Pens games here and there always seems to be some kind of drink special going on.  There is a patio, but I haven't been there when it's warm enough to use.  Probably the only bar in the North Boros worth going to.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yOSZ1nMH_z9ESQIftaQSLw",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yOSZ1nMH_z9ESQIftaQSLw/o.jpg"
      },
      {
        "img_id": "J34KrpHWl8UGinVq_AW9HA",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/J34KrpHWl8UGinVq_AW9HA/o.jpg"
      }
    ],
    "user_id": "xDYZjoE02HNXMH9dZXVlig"
  },
  "kenyK4JhO7luwL0EzS_vmA": {
    "date": "4/30/2013",
    "text": "Food was decent, service so-so, but the worst is when the owner SCREAMS at customers for making noise, AFTER a band has played there, at 2 am.  It's a BAR WITH LIVE MUSIC.....it's going to be a little noisy.  Maybe your precious neighbors should be aware of that.  Not the first time I've encountered this here.  Ridiculous.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E958xRaxVl_ndAaA8nmwVA"
  },
  "aZ2lmOD--5QSbUOv6L7Bcg": {
    "date": "9/18/2011",
    "text": "We waited 35 mins for a fried platter appetizers ... and then waited some more... fried food takes maybe 3 mins, right??... So, while our waitress and the staff were very nice, apologetic, and generous with the drink refills, the owner was down right insulting: she came by and offered to \"take a couple dollars off our check for the wait\", walked away and proceeded to publicly treat her staff like indebted slaves, pulling on their shirts and openly demeaning them. Final insult?- our check came and she had taken off exactly $1.75. Enough to buy a pack of gum-maybe. Truly hope her staff find a better employer and that she learns it is better to not offer compensation at all than to give something so pitifully insulting.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xWj6aDjuCbS5SzXUpUSOmA"
  },
  "yOLN4Ch8WK7JHMXcTBVkuQ": {
    "date": "1/13/2017",
    "text": "This is my go to place for suds, food and Steeler football.  DELICIOUS food.  One of the best hamburgers, reubens and fish sandwiches around.  Try the smoked wings.  Fast attentive service.    Always a good time at Sunnys. Lots of tv's.  Enjoy the 34 foot outdoor tv in the summer!    The owner Mike is quite a fixture and character and adds some fun and silliness when he's there....just follow the sound of the booming laughter.   Wear your black and gold on game days.  A genuine pittsburgh sports bar  and restaurant.  Ok for kids too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vx9CLEEww7tEiu5hZ7JPyw"
  },
  "pvV90Hwhg1I7mQnQYgNH2A": {
    "date": "9/11/2012",
    "text": "I ate here this past Thursday night for dinner with my girlfriend.  I have been here a few times in the past and we often drive by the place and it always seems packed so we figured that we would give it a try.  The inside of the restaurant is actually much more spacious that you would expect and has a fairly open design with an area for bands on one side of it.  It also has what looked like a nice outdoor patio with a bar that straddles both the inside and outside.  For dinner I decided on having the Turkey Devonshire sandwich with a side of potato pancakes the while my girlfriend decided on the steak salad.  Even though the menu stated that my sandwich was going to be open faced, I was disappointed at the size of it and my whole meal in general.  It tasted decently enough with the turkey being moist and the bacon, cheese and peppers being nice toppings for it all while sitting on top of the fairly large slice of Italian bread.  The potato pancakes were the highlight of my meal as they were both crispy and had a nice spice pallet.  My girlfriends salad was also decent and the steak was satisfactory, especially for being at a bar type restaurant.  The bottom line for me is that I will probably head back here in the future but more for the convenience of it to my house than anything else.  It has a cool atmosphere and I imagine it would be an awesome place to catch a band or watch a game.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "iXaZKvmYaX3uEV5u5zDo_A": {
    "date": "4/16/2015",
    "text": "Please go here for the burgers.  They are the BEST!  Otherwise, the menu isn't anything special.  Some seats inside are bad spots to watch a TV, but the patio area is really nice.  Service here tends to be pretty good.  We go to this place when we need a break from Rochester Inn, or when we are hungry for burgers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gFa8dYEIMw5hbFvYlcY7VA"
  },
  "tCO33itXC1n02lJYXTubQA": {
    "date": "8/20/2017",
    "text": "Really disappointed.  The menu for dinner is not impressive at all. I got the Smoked Pork and pierogies. The pierogies were dry and so was the pork. It was like eating leftover. The service was fair. My husband had the Sausage Casserole.  He said aid it was fair. All in all not great. Will not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bI9wGaTMq8qwwkmRmDAYig"
  },
  "Zrk75seGqoaWoUb5KBEjuQ": {
    "date": "2/10/2016",
    "text": "I highly recommend getting their wings. Very nice size priced right. I had hot, chipotle, ranch. The bartender (Lisa) was very friendly and drinks were priced right. Great place to go if your not from the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1vHU2w9x7kDGZd7tHYeYxg"
  },
  "RjM1cvfMvxgG2cF_uE19Vw": {
    "date": "9/14/2017",
    "text": "Michelle, our bartender, is always so attentive and makes sure we have enough to eat & drink (and keeps us laughing)! She's truly the reason we make our weekly visit to Sunny's! It also doesn't hurt that the food is great and the patio is beautiful!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "54JvYh-tH7BgKzwdaWmiqw"
  },
  "A4NPOyANyPSj2Opp_rLhGw": {
    "date": "7/29/2017",
    "text": "Sunny used to be great. Now there are a lot of drug Addicts that are working there. Where the old crew???",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PmcOVQ52qTLIrS2tTf1ndw"
  },
  "O5ddy70Z5hSw-sQtmGADkg": {
    "date": "7/23/2017",
    "text": "Exceptional wings, some if the best I ever had. They are smoked and not deep fried. I've been told the Chipotle Ranch sauce is purchased and not made, not sure how this is possible as some days it's more on the Chipotle side and others it is straight ranch with a slight hint of Chipotle. Would give 4 stars if the Chipotle wasn't always hit or miss and would give 5 star if the \"wing special\" didn't just go up almost double and isn't a deal anymore as they are wingdings and not full wings. I'll stick to places that offer full wings for 10 cents more in the area....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6qOlIzbp1ZPiXVM3r-369Q"
  },
  "E8nRkxsw8fxWv9HMlCnvyw": {
    "date": "7/15/2017",
    "text": "Stopped again tonight and had a great brisket dinner and service was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HGaXgnwB5zVPG9S_lkGeaQ"
  },
  "EEXzKs8niW7IStbH7W3ceg": {
    "date": "12/1/2013",
    "text": "I love this restaurant. Nothing on their menu is spectacular but I have never had anything there that I did not like. Their fish is great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ollys7cMKb4VKgHS69Bhrg"
  },
  "wF-Ik7q6H7mZUMBIOZU95Q": {
    "date": "8/17/2015",
    "text": "Full disclosure, I am not Pittsburgh native, so I am not accustomed to living in a food desert.  The atmosphere is good enough for a local bar and resturant, but that's where anythhing good about this place ends.  Remember we are talking about a place where they serve you a hamburger and fries and feel OK charging you over $10 to do so.  The burgers are not fresh, they are not hand packed, they are simply frozen patties put onto a cheap bun, no matter what the staff claimed.   The fries were limp and had been sitting around.  Getting the attention of our server was nearly impossible. It was a Saturday night, but not busy, which probably reflects the general opinion of this place.  Even the soft drinks tasted extremely watered down and had to beg for extra napkins.  This is not to mention the horrible parking available.  No reason to go here other than Wendy's unless you want to meet a few neighbors for a beer, then in that case I could see why this place would fit the bill.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4AGhpZ48oFVtWxVK51MXFQ"
  },
  "ccd-UMHaOXddj54okUsFqw": {
    "date": "9/12/2013",
    "text": "Just moved to the North Hills and decided to try Sunny Jims.  Our party of 3 started with the fried zucchini. They were cut thin like fries and quite good. The meals that we ordered were the black n bleu burger, the roast beef sandwich, and wings. The burger was cooked perfectly and tasty. My bf got the roast beef sandwich and it was full of flavor, however there was a bit too much gravy for my tastes.  My mom got 12 wings prepared mild. They were nicely sized and pretty good. The only complaint (which some people might like) is that they had a bit of a sweet taste. The service was excellent and our waitress was very nice.   We have since ordered takeout twice from there. I had the buffalo chicken salad both times and it was delicious and consistent. My bf ordered buffalo parmesan garlic wings both times and he loves them. The only bummer is that it seems as though there is no price differential on \"wing night\". Overall good food and cool atmosphere! We will be back!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FrCFfkO3gif7RkFy67aeYw"
  },
  "N2nX1l_MNkF00pK25Ba_7g": {
    "date": "8/2/2015",
    "text": "This place has good daily drink specials, friendly staff, really nice patio/deck seating and the best , Pet Friendly!. General Manager brought us dog treats and a water bowl, Front of The House came to greet, it was like she was another guest, definitely recommend this place to relax have some drinks and food with good price overall.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oZQHPapaEdqy5c09tfm4iw"
  },
  "3hFZrsjT7qT9zAePWnw1WA": {
    "date": "12/16/2015",
    "text": "Service was extremely poor for a week night with a small crowd. It took 10-15 minutes after ordering drinks to actually receive them. The waitress was nice, and we asked to speak with the manager. The manager acknowledged that we wanted to speak and never showed up to the table. I will not be coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n0-UuVWY5LmsYikq70mpdA"
  },
  "EskWoPz-GK2SFUzCE-q7Fg": {
    "date": "11/18/2015",
    "text": "This was my third time here and decided to try something aside from the burger/ wing fare talked about by other reviews. After waiting about 25 minutes the brisket burrito came out cold covered with a slice of American cheese. The brisket inside was tough, almost grisly, with no distinctive mesquite sauce. Also the seasonal pumpkin draft beer was delivered flat as a pancake... The waitress didnt know what I meant when told about it.  My buddy's patty melt was equally disappointing, sandwiched between two stale pieces of marble rye and well done after he had requested medium. The only satisfied customer was our friend who had an ample mixed green salad with the house vinaigrette, pretty hard to screw that up. I think it will be a long time before we visit this joint again, they just don't seem to pay attention to how the food is prepared or presented.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TdkhJ3q4iWpWPbfhKBMKeQ"
  },
  "x7RPq8mURKr-jlQ1JjwVmg": {
    "date": "4/20/2015",
    "text": "Yesterday my husband and I stopped there for dinner, arriving at 5 pm.  We were promptly seated in the last booth by the young host.  They weren't overly busy, a few empty tables.  Once seated we were ignored.  No water, no server saying \"I'll be with you in a moment\".  I couldn't even make eye contact with a server.  After 10 minutes, we picked up our menus and left.  We gave our menus to the young host and said we were leaving because we didn't get service.  He just said \"OK\",  No apologies, nothing.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kkcsBWqUR3Exx-IF7QEloQ"
  },
  "DnPotBPv-pGAkMTJlV19Zw": {
    "date": "5/15/2015",
    "text": "Food is ok (some things are great, some are meh) and prices are reasonable. Outdoor seating is nice. They have lots of seating and TVs. Sometimes they have live music. Not a bad place and reliable. Truly is 3.5 star kind of place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3RCyqHVXIgUFZbUVgr73A"
  },
  "5ihFfHFQhCAr89Dk1OzTJw": {
    "date": "7/21/2015",
    "text": "Sunny Jim's has always had great food but I think that soon we will see it turn into a place for the working professionals to hang out for happy hour or to have a few beers on Friday and Saturday nights. The owners are the same but they have an awesome new GM named Patrick who has some great ideas and I think under his management the restaurant and bar will be seeing a new kind of clientele that will add a new life to an already amazing atmosphere. There outdoor seating area is reminiscent of a laurel highlands bar, with a peaceful setting filled with trees and a small creek. The spot is not to be missed. My partner and I are from the North Side and have been searching for our new go-to bar and we have definitely found it at Sunny Jim's. I am confident that it will only get better as Patrick's ideas come to fruition.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ia99l901uzYJzh-8ivjtHQ"
  },
  "hTBFG_wJi3TadTa0lDp2dQ": {
    "date": "8/11/2015",
    "text": "Love it!! My favorite is the chicken tortilla soup! My family and I come here all the time great atmosphere!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhN_9rFP3ocHZb9goPpuXQ"
  },
  "9kKxAzcUmKVmAIy5r3Ivqw": {
    "date": "5/27/2015",
    "text": "Ok so not a fabulous place but we were in the area and in desperate need of something to eat. This place hit the spot. Their own smoked meats, decent beer selection, and a variety of other choices. The wings are good as was the pulled pork however both were a bit dry. Burgers were decent as well. Outside seating for the kids made the experience more pleasant.   I would go back but only if in the area and it being close to an hour away I am not sure how often that will be.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M1dCGsH1cAppC8LpFo26Pw"
  },
  "RYWSroux69NdSaf8DnnG2A": {
    "date": "8/7/2017",
    "text": "Went here for the first time. Everyone in my party loved their meals. Together we got the smoked turkey open faced sandwich, patty melt and fish tacos. I got the smoked wings with honey garlic sauce. Really liked them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Of_gD6Le2hkfUjyzO3eWmQ"
  },
  "R_lIpjbEEc2hMv5tC_q9yQ": {
    "date": "4/1/2017",
    "text": "Normally  like this place but today the food was horrible. We ordered 2 buffalo chicken salads ( normally don't come with fries) we ordered fries on our salad but they only put maybe 4 fries on each salad. Food took forever to come out. No silverware. Had to ask for that. Also had 2 kids with us, one 6 the other 1 yr old. Waitress kept putting things on front of the baby. Salad lettuce was wilted and watery and the buffalo chicken was cold. Igrilled cheese was cold also and the cheese was not melted all the way. Pjust need to take better care in how food is cooked and presented to patrons. Just a bad experience today.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WKD5HqlyK_JEWb8pqGZTrQ"
  },
  "HjfBaDMVshJv-_9T0LdMNw": {
    "date": "7/9/2017",
    "text": "There is one reason for me coming here, aside from proximity - it is Michelle, who is a fucking incredible bartender and s purveyor of lost souls. She is the best!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0479gHlSKzqJMi0pN1oZQ"
  },
  "ZXQ4tzYmmHpBgmc2pWMz2g": {
    "date": "8/21/2017",
    "text": "Great atmosphere, wonderful servers and wait staff great place to hide in the storm. We were greeted by the bartender like an old friend.  Food was good and reasonably priced.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_wZwFdOaNEP5KJbLjb1KJA",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_wZwFdOaNEP5KJbLjb1KJA/o.jpg"
      }
    ],
    "user_id": "JgGYX6_AxH6yAQ4Jn2-qKw"
  },
  "3Wplojpzx4CO3IZqi3DEfA": {
    "date": "9/30/2017",
    "text": "Terrible service, servers flat beer and the live band plays 50's music and isn't very good at it. I ordered the buffalo chicken dip and it had a puddle of grease with no flavor. Won't be going back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pN86mhoVR_-W9YUEd9JQ6g"
  },
  "5N_js-fzYMryF6sIynOAnw": {
    "date": "6/9/2017",
    "text": "Working in Pittsburgh area.  Recognized from previous visit.  Location kinda odd but remembered it was good.  Well was right.  Just had a burger but fresh and they can cook correctly, it was medium.  They make from scratch, moist and taste.  If I lived in area I would hang out here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DUuw2bkDcxhyt5Q61vdidQ"
  },
  "Y4WZpU0KFIe71-fw6XLBzQ": {
    "date": "12/31/2016",
    "text": "Sunny Jim's has always been a good time whenever I go. The service has always been good and the food has always been good. With that said, it's never been anything more than good. There aren't a lot of veggie or vegan options, but you are able to change ingredients to suit your dietary needs. The space itself is huge and on certain nights they have live music.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yRt1Re2IHd9ks-xan7LW-w"
  },
  "q_p6sNP-hAs3fhcKdH_5KQ": {
    "date": "5/20/2017",
    "text": "Great service, tasty food and good vibe. We came for an unplanned, casual family dinner and had the good luck to have a fabulous server (Jason), a menu to please the carnivore to vegetarian and live music as a bonus! The fried chicken is fantastic, as are the ribs.  CLassic bar food done well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bel18UpKJtt44aUqsbaL-A"
  },
  "LUC57FjiJWCCAX_BxwuIyQ": {
    "date": "5/13/2017",
    "text": "Another great meal at Sunny Jim's.  New server named Jason did an excellent job taking care of our every need.  Didn't have a burger this time but those are always super!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKVZjpRyWd5enHHjQRzXHg"
  },
  "76qPiVjOP71whocN7ACtqg": {
    "date": "1/14/2018",
    "text": "Michelle was awesome!! Great Time, Great Food, Lots of TVs, Big Dance floor, Great Atmosphere, Fun ! Will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3diwtnbjRd4duc3UH4Mm9g"
  },
  "XGQVRtBEeSr-oxy_SUnhjA": {
    "date": "8/17/2016",
    "text": "I had asked the locals for a recommendation for a mom & pop place to eat dinner. They didn't hesitate before saying Sunny Jim's. I had high hopes. As we were walking up to the door there were two men standing there who said the air conditioner was broken. We should have turned away and gone somewhere else. We went in any way. Bad choice.  When you walk in you are in the bar area. We walked through it to the dining room and you could feel the heat. YUCK!  So we went back to the bar area which felt cooler. We sat down and waited for a waitress. It was at least 20 minutes before a waitress came. She took our order for drinks and left. When she finally came back our glasses were empty and we gave our order. We ordered smothered fries as an appetizer. When they finally arrived we were disappointed. The fries were steak fries so they were huge. There was a small bit of melted cheese on a few of the fries. The bacon bits were scare. The ranch dressing on the side was good but the serving was tiny. We had to ask for more. Our waitress was scarce so it took forever.  I had ordered a burger and my husband ordered the fish tacos. My burger was cooked to the medium that I had requested. The cheddar cheese was melty and delicious. My Coke slaw that came with it was tasteless. The slaw on my husband's fish tacos tasted funky, as in Mayp going bad funky. He took out the pieces of fish and just ate that.  No air conditioning, bad service, and questionable food. We survived it once and that was more than enough.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 4
    },
    "photos": [],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "hAqVkUk9PBbA5thVgRJjjw": {
    "date": "5/21/2017",
    "text": "Sunny Jim's is a great secret treasure of the North Hills.  Tucked between 65 and 279 on Camp Horne Road, this place serves phenomenal food, delicious drinks, and a great welcoming atmosphere.  I've been here for many events, including a filming for a local film (Croaker) and have not once been disappointed with the food or service.  Sunny Jim's hosts many bands and musical acts so there's entertainment for everyone when the sports are wrapped up!  Wish I could get here more often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "544a0PnmgiafLWrpmNBZbA"
  },
  "dU0WogQdHzk_ugQj3ajrPw": {
    "date": "4/26/2017",
    "text": "So I came into town to visit some family I haven't seen in a very long time. I stumbled upon this jem on yelp and was more then satisfied with my experience. Mostly because of the incredible service from Jenna. I will be back to see her and this company the next time for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RqyKEiSGRDbrs9JRcuZsRQ"
  },
  "egEKBAXjiSU30XlAEpWuTQ": {
    "date": "9/11/2015",
    "text": "Definitely the best value/price restaurant northeast from Pittsburgh. We really love it here. They have great number of beers on tap and you need to try smoked wings (buffalo or BBQ sauce, 20 wings for $12.99) and burgers. Cheesburger or Red Zone Jalapeno are awesome. We also like Buffalo Chicken Wrap or Chicken in a Basket. They also have nice patio/garden with a small pond and fish and ocassionally they do fantastic brunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VoWoyyCfzfbdz-gPD94APA",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VoWoyyCfzfbdz-gPD94APA/o.jpg"
      },
      {
        "img_id": "5B13eNvPulXpKe6_QgKQcQ",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5B13eNvPulXpKe6_QgKQcQ/o.jpg"
      },
      {
        "img_id": "SiJZk6k82LqqOVPzAnimcA",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SiJZk6k82LqqOVPzAnimcA/o.jpg"
      }
    ],
    "user_id": "GXGMauv7Fo9ft9NDxOTLeA"
  },
  "FCopllEBoxVCxynn_as4hA": {
    "date": "7/10/2016",
    "text": "My dining partner and I decided to give this place another try after being thoroughly disappointed during our last visit, roughly a year ago. We ordered the zucchini fries as an appetizer, which showed up at the table precisely 30 seconds before our meals.  They were okay, but not really \"fries\", more like a mangled blob of fried zucchini.   My dining partner ordered the open face turkey and mashed potatoes.  The menu described the turkey as smoked carved turkey over sour dough bread with a side of mashed potatoes and gravy.  What was presented was instead a small mound of dry turkey bits piled on a single piece of Texas toast.  Accompanied by an extremely small portion of tasteless mashed potatoes with tasteless gravy.   I ordered the Reuben sandwich and fries which I ate two bites of and immediately decided that I could not finish.  The sandwich consisted of two pieces of stale rye bread drenched with bland Russian dressing, so much so that the bread fell apart when picking up the sandwich.  The corned beef was extremely thick and tough, almost impossible to chew.  The sandwich was cut in half with most of the meat on one side and the sauerkraut on the other.  The fries were soggy and old, probably sitting under a heat lamp for a while.    Both meals should have been sent back, but instead we just asked that the Reuben be taken off the bill.  When I explained to the manager how bad the food was, he made a comment that I had ordered it before.  I attempted to correct him and explain that we haven't been there in over a year because our last experience was so awful, but before I could finish speaking he walked away from our table without saying another word.   It took another 10 minutes to get the bill adjusted.    I completely regret giving this terrible restaurant one more dollar.  It's disappointing especially because it's very close to home and has a cute outdoor patio. NEVER AGAIN.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4njPRbMFcImsouco3pJ9Fg"
  },
  "GPpMnKc36lzFuXMVfUccrQ": {
    "date": "12/24/2017",
    "text": "Good, reliable bar food in a no-frills environment. We usually order the smoked wings and they are delicious. Always have great service at the bar and it's down the hill from our neighborhood!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WjuoxmykLfxPtqHQXG-plA"
  },
  "2bI4yrYLlRq2_wMcuLQCJQ": {
    "date": "3/2/2015",
    "text": "My friend, who lives up in the North Hills, and I were tossing around dinner ideas last night and decided to head over to Sunny Jim's Tavern for a bite to eat. It had been a long time since I was last here, so I figured why not.  Given the miserable weather, I was surprised to see any life in the place, but there were others (like us) that had to get out of the house.  There's pretty much something on the menu for just about anyone. That said, I was surprised that we both decided to order the grilled chicken breast sandwich with fries. The chicken breast was juicy and large, but really lacked in flavor. I had even asked Cajun spice to be added, but barely noticed it was present. I, however, added some Franks hot sauce every couple bites which kicked things up a notch. The fries were delicious and perfect for dipping in ketchup and mayo.  Overall verdict? Don't go here expecting anything more than some better than average bar food. Service 3 stars, Food 3 Stars, Ambiance 3 Stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "dRTZgTVahakFKkQJdyDX4Q"
  },
  "i4a5xCKZTBwl5WXlE5YLfQ": {
    "date": "2/23/2017",
    "text": "We went for wing night and the atmosphere was great. Plenty of TVs and seating. The parking was misleading because it seemed busier than it really was by looking at the parking lot. We didn't wait at all, so that was great!  Our service was ok. We weren't sure if our server didn't like us or just didn't really want to be there, but we kept smiles on our faces in hopes to win her over. We got nachos grande for an appetizer which was pretty good! The salsa was a nice, cool salsa that complimented the rest of the toppings.   We all got wings and each of us got different kinds. All of them were delicious. I would definitely recommend the wings. I can't wait to go back and try the burgers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5JUfpM10LpTUd8GN7yxxGA"
  },
  "K65h1q6uaXP1FHVSttgJlA": {
    "date": "9/19/2015",
    "text": "Solid boneless wings. Real chicken not processed. Habanero sauce was tasty, with a nice kick but not too spicy.   Try the Cajun fries with cheese and bacon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WUeXlUjg_caEjL-U5lZHsg"
  },
  "5NM2UzEc7BXp_4hgoztArw": {
    "date": "7/9/2017",
    "text": "I've been coming to sunny jim's for years and it used to be my favorite place...until recently. Lately the food has not been up to standards which is highly disappointing considering their smoked wings were my favorite in town. The past few times I've had \"Chelle\" (I'm assuming this is her name because she never told us, it was written on the receipt) I thought she just had an off night but she has an attitude, has forgotten to put in our food, and hardly refills drinks. Overall I'm super disappointed that my favorite spot now has a bad taste left in my mouth.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dWhpkG6X2OwH7mqBv2XWow"
  },
  "CO1M9vV8UbPZlJk2R29-kw": {
    "date": "5/26/2018",
    "text": "The patio looks like it can be a great time but we went because it's listed as dog friendly - we came with our dog on a leash. Someone started table hopping with his 'service dog' not on a leash - asked him to please keep him on his leash and guy got belligerent -  we left - management did nothing and that dog was still wandering around that patio off his leash - nice!  This is a local gem??? In other words stay away if you are not a local. You are not welcome. The manger made that clear when it was obvious a big party of drunk idiots and a dog wandering around off leash was more important than an out of town black and white guy with a pit bull (on his leash and well behaved).",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ljRTqE_mIjYYqEs-xz8Jog"
  },
  "pFbq5Vgqs0WVUYqUBqVBwA": {
    "date": "8/24/2018",
    "text": "First time there.  We left after watching 4 tables seated after us get their drinks served before we even saw a server.  Won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KWkpejly-2NJf62QyDv-5w"
  },
  "AUa03ALVtrxK_RP-0WruOQ": {
    "date": "7/25/2018",
    "text": "Great food. Good sized portions. Staff very friendly and accommodating. Highly suggest it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MQizQytT0GEVjNiisjD8hA"
  },
  "mfuqRIGVgGAXgSLUBNqQyg": {
    "date": "11/2/2017",
    "text": "We came here for a friends birthday with a very large party. The staff was super friendly and on top of their game. Our server was really great with handling the party. I ordered their smoked wings. Good golly were they amazing. Some other got sandwiches and they also looked really delicious. I will definitely be going back and trying more on their menu.  The place is very kid friendly and a wonderful spot to watch a game with a group of friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qb0ZfVOe33QVjNHGoGBabg"
  },
  "ozr2ikfBebgZyEefX0iN_A": {
    "date": "12/5/2018",
    "text": "Great food, large portions and plenty of cold beer.  Great place for a group to enjoy food and conversation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XPI3F0ceiLZJ7n7EhKJBfA"
  },
  "ydbTuaBRkGqyfT9MgHK4wA": {
    "date": "9/29/2017",
    "text": "I was part of a large group, making my first visit.  Food was very good. My companions and I had similar experience. Food was good, not the very best I've ever had, but very good. I had a smoked chicken panini, which was excellent. Smokiness present, but overpowering. Moist, great flavor. I recommend it. Other meals near me...Rueben was very good.  Chicken in a casket. Great name, was not greasy or overly battered.   Very large and diverse menu. Great variety of choices for most any taste. Even Potato Pancakes! Burgers were a hit! We had about 32 in our group...bunch of old men out for dinner. Ribs were also enjoyed.  I am a craft beer aficionado, and on tap selection mars meager tonight. Best available a staple Southern Tier 2xIPA. Bottles available, but nothing special or notable.   This place is out of the way, but celebrating their 40th year of same ownership.  Worth going out of your way to try- especially for those that enjoy smoked entrees. That is not very common in this area. Well worth seeking out. Great place to watch a game for certain.   Service was excellent, I will go again, with friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SOVhyA5K4VxSp7mSS1yHXA"
  },
  "lw9yIghvzJyjEe4yLAMCrQ": {
    "date": "6/9/2018",
    "text": "My mother and I stopped in after today after shopping around 2:15 pm , Lorie was our server, we both had the Burgers, she ordered basic Cheeseburger w/fried onions. I ordered Burger w/cheese, bacon and egg . both were on Marble Rye from Mancini's ....the  FF's were perfect, not burnt, they must change the oil regularly !!!  we will return... and recommend to others...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KApXtDq83j5muTXl4lSq_A"
  },
  "92FOfYhwNcz27xfqSrtCsw": {
    "date": "9/9/2017",
    "text": "1st time here. Will be coming back. Grilled shrimp salad was great, and my son loved his burger. Friendly and fast service. Thanks Sunny Jims for the great experience",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FAjdZCU9xkM_aQDXYpflPQ",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States. Grilled Shrimp salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FAjdZCU9xkM_aQDXYpflPQ/o.jpg"
      },
      {
        "img_id": "1GveBa2spyXOZaV55IaBAw",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States. Garlic Parmesan cheese Sticks",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1GveBa2spyXOZaV55IaBAw/o.jpg"
      }
    ],
    "user_id": "NR_ZWCpha1vZEB7wSIqu0Q"
  },
  "Mtf7hloUQe7WT6Ht5_5b1A": {
    "date": "3/4/2016",
    "text": "I work near Sunny Jim's so it often becomes our lazy go-to for drinks and a quick bite.  It's nothing fancy.  I'd describe it as somewhere between a dive and neighborhood bar that serves food.  The beer selection ranges from some good craft beers to specials on buckets of IC Light.  The food is mostly your typical bar food with a few twists and surprises.  I usually go with a sandwich and/or appetizers.    Most recently I ordered a burger (ordered medium) that was cooked exactly the way I wanted it.  I expected it to be overcooked but it was a beautiful pink in the middle.  Messy but delicious.  I had been craving a burger and was glad Sunny Jim's was able to deliver beyond my expectations in this case.  Service can be hit or miss, regardless of the time of day, the day of the week or how busy they are.  Lots of TVs all around the bar and dining area, so a good place to watch a game.  The whole place could be a bit brighter and welcoming, though.  But it's dependable.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "WoKCLSctS7G2547xKcED-Q"
  },
  "0M7W6xKWiVcM1HUhwRk-XQ": {
    "date": "9/25/2018",
    "text": "This is my favorite spot to go they're awesome people and very friendly, food is amazing and great beer choices!! Be sure to request the best person working Sam!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ghd2MMnXfVZL8d67Om0GiQ"
  },
  "cgp-JZRBhpgN4YuXQIPsPQ": {
    "date": "2/28/2018",
    "text": "Great happy hour especially when Michelle is working. Great prices and she is very attentive and makes sure that your order is taken care of, your glass is gull and always smiling @",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cYV2_hRExtDz5sI48NfYRg"
  },
  "4S951RtTMed5BF85jKpEDQ": {
    "date": "2/23/2018",
    "text": "Was good 9 years ago, now it's practically inedible. I'm pretty sure they used canned chicken in my entree last year. The only thing I would order here is fries.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iFjBnm9w_5sl-nN5-58-MA"
  },
  "48mghjitBnanl9h_nqS7PQ": {
    "date": "10/20/2017",
    "text": "Jim is a great tavern good food we've had group share dinners it's great Kelly was a fantastic help and server. Prime  rib Friday @ 15.00. Well worth the it  We have enjoyed many dinners especially Fridays @ Sunny Jim's",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-ooWyoPjY1jVqAFqKB4i-A"
  },
  "8IIjhOROJEiYxvjsem4A6w": {
    "date": "6/18/2015",
    "text": "My wife have been here about 4 times in the past 6 months and living in the North Hills for over a year. We've had good weather on all occasions and have been able to sit on the deck twice.   Some of the best food I've had include their wings that are fairly large and I believe wood-grilled. They had a smokey flavor and just the right amount of sauce. We pretty much always order them as an appetizer. I've also ordered the rib special, also wood-grilled, that were great. I don't typically order wings I just saw someone eating an order on our walk back to the table.  My wife has had a burger on two separate trips but I never did get to try it as she finished the whole thing. Lots of different sandwiches I've been wanting to try.  Beer specials are pretty basic, but that's all I'm usually looking for. It's comparable to any trip I've had to North Park Lounge in terms of quality and imagine it will be a staple restaurant for us moving forward.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhQOA8-FdpA6D0hNhXEYIw"
  },
  "oveuq-KjUKIvBJ0GCtzn5g": {
    "date": "6/24/2018",
    "text": "I have been here many times and the food was always good. My husband and I went there today and we both had their chicken in a  basket. It was awful. I think the bird died from old age. It did have an odd taste and was very dry. We did bring the left overs home, but I decided to throw it out.  I didn't even want to give it to my dog. When I want chicken I think I'll go back to  Monte Cellos in Cranberry their chicken is excellent.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z8cU8XmiPYUrpjB2aAIiVg"
  },
  "v3RSZOsXa1763n0cDXuboA": {
    "date": "10/6/2017",
    "text": "Their boneless buffalo wings are the main reason I visit here! If you want a quiet place to talk, then this is definitely not the place. However, if you want decent food and a bustling atmosphere then you'll love this place!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1oQoCRDcBUmEn5ttM_YoZQ"
  },
  "PzBZwsbZSA5F5P5xvQmmVg": {
    "date": "3/24/2018",
    "text": "A lil dingy inside but service was great. Food was nothing special, wings and oven-faced turkey were good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UUy_9N-XN-t7A56WbQXPzA"
  },
  "RswX_BUV8rSn9CKhIT8Nyw": {
    "date": "6/28/2017",
    "text": "I've tried this place a few times and they just can't seem to get it right. One decent meal is followed by an awful one. Take out isn't any better. The last time I was there, I found a fly in my food.  Nasty.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wdVuI6HJf0z_3xXuZkSp5Q"
  },
  "-dQHP00-3LpAtav5I42fLg": {
    "date": "7/14/2017",
    "text": "Salmon entree was amazing! I brought my dogs out to the patio and everyone was super inviting. Adam was the most welcoming, amazing Bartending so courteous and thoughtful . Will definitely be back every weekend that Adam is here!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7QslxdGK56UvMh_bUzlOyQ"
  },
  "RlcXCAZByezI3Ja0wo3Ybw": {
    "date": "7/3/2017",
    "text": "I have heard so many good things I decided to take my girlfriend and her two sons. 2 hours later we are still here, even after grabbing a waitress that was not ours. She got ours moving for about 2 minutes and now gone again. Kids eat free on Monday and Tuesday but only when you remind the waitress, after she gives you the bill...when she comes around. Do NOT order dessert, very expensive and was tasteless. How can you ruin dessert? Ask Sunny Jim's. This was such a disappointment I can hardly believe that others talked highly of it, I will not, I will tell others of this very poor experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FsM_Fl6k4IJ1iUVDxABh2A"
  },
  "DCSCN7Dgrm4uv3q_wHmffA": {
    "date": "8/2/2019",
    "text": "This place is so good! The menu is full of all types of food options, from light bites to larger portion dinners. Great atmosphere with lots of TV's, which is great for sports game! Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r35IgvyOy-6A30ieweQUGQ"
  },
  "NV3r74QlU0-Qn2vFmSZXVw": {
    "date": "9/10/2019",
    "text": "Interesting location. It's about halfway up camp Horne road between I 79 and Route 65. Nice large parking lot so parking will not be a problem. They have an OK selection of beers but nothing fantastic. If you're looking for a craft beer outing this is not the place. They have TVs for watching sports mainly the Pirates and Steelers.I did not try their food but other patrons say it's pretty good. When I did not like about the place was the level of noise. During busy hours do not expect to be able to hold a conversation in a normal tone of voice. That makes it a bad choice for a first date or intimate meeting. The service was OK, definitely not speedy or overly friendly.I would not say don't go to this place but it definitely would not be my first choice to go out and have a cold one with friends.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K6zAKgnJlifFn9KnLRUvvg"
  },
  "trhb_v5f4KIhrW5X8Bddpw": {
    "date": "8/23/2019",
    "text": "If your looking for a local hangout, this is the place to dine or stop for a cold brew.   Typical bar food with a few entrees to choose from.   Nice variety of appetizers.   Large portions.  Will not leave hungry.  Will return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n8Y5Ut7GWDe7kYv8PjUoJw"
  },
  "oh-nhiAh7wQopTQC8QQDew": {
    "date": "4/27/2019",
    "text": "I've ordered Sunny Jim's through Grubhub once in the past, but today was the first day I've dined in at their restaurant. Upon walking in, you get the impression that it's kind of a sports bar, with lots of sports posters and TV's all around. My boyfriend and I were seated immediately after walking in, which was nice. We sat down, ordered our drinks,  browsed the menu, and ordered an appetizer. We got the Bavarian pretzel with beer cheese. I thought it was pretty good. It came out within minutes of us ordering it, and it was piping hot too. It was a bit greasy, and came with more salt than my liking, but I still enjoyed it, and so did my boyfriend. For our entrees we both ordered a burger. My boyfriend got the Wild West Burger, which came with BBQ sauce, bacon, cheddar cheese, and onions. He enjoyed it, although he did pick off a huge chunk of onion on this burger, looked a lot like the very center of an onion when you'd cut one up. I also ordered a burger, the Sunny Cheeseburger to be exact. One thing I thought was strange was that you had to order regular burger toppings separate for them to come on your burger. If I had just ordered the Sunny Cheeseburger as is, I wouldn't get any lettuce, tomato, or pickles on it. Just something to keep in mind here if you order a burger here. Our order came to our table very, very quickly. Couldn't have been more than 5 minutes after our order was taken when the food came to our table, I was impressed! The service here is very speedy, we even ordered an Italian hoagie to go and got the hoagie before we were halfway through our burgers! For dessert we had their cheesecake, which was very delightful. I ate everything on my dinner and dessert plate. I thought the food was pretty good. My burger was so juicy that it actually started to make my bun soggy, but to me personally I think the meat could have been seasoned more. Overall I think the food is good, and next time I go I'll have to try a different entree, but their burger wasn't anything over the top you know? Very good and juicy but not the best burger I've ever had. The service was phenomenal, and dessert was spectacular along with our appetizer. Great spot for a quick bite and a beer or two for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4MZJR192BB9nuOUu8ObI1g",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4MZJR192BB9nuOUu8ObI1g/o.jpg"
      }
    ],
    "user_id": "I4wplanZZZbL7rYPA7RVrQ"
  },
  "tu1xFhXivZZrTTyvBL2ofQ": {
    "date": "3/18/2019",
    "text": "Sunny Jim's is an institution for a lot of locals, but it's very hit or miss for me. Sometimes the food is great, other times it's overcooked or otherwise off. Service is alternately great or subpar. Beer selection is decent!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VmRRY6ecwc1UqDwIfwwfnQ"
  },
  "nvgK37iCaid4IL3EAtfi8w": {
    "date": "1/25/2019",
    "text": "So I've written reviews previously that weren't great.   What ever they have done is a game changer!!! The onion rings were SO good, obviously hand breaded , the burger was perfect     I can keep going!! For the $, SunnyJims is awesome !!   A must do or try again in the North Hills.  Our waitress, Gina, was awesome",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Oyp_r6ll7sTeWBPyWs9OWg"
  },
  "N-PRG6F-jbjGfvtL184Ikg": {
    "date": "4/13/2019",
    "text": "Service was great. Drinks great. Only down fall was their barbeque sauce tastes like applesauce. Not a fan. Everything else was great. Very friendly server. They have buffalo chicken dip. But please get better barbeque sauce",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UxSZ17kiHK31Q-mNPHdrTg",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States. Chicken Ranch flatbread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UxSZ17kiHK31Q-mNPHdrTg/o.jpg"
      }
    ],
    "user_id": "bLUVfPj1W2K63FIkhdiBlg"
  },
  "6MICMBmm6CIYm5LQ_rV88Q": {
    "date": "7/14/2019",
    "text": "We loved Sunny Jim's food and atmosphere. We were very disappointed last night in the service, food and menu changes. I have always enjoyed my experience there but last night was horrible. The place is usually packed, but there were 4 tables in the whole place. Our waitress got our orders wrong and she didn't seem to care. Their food was subpar last night and have never said that about this place. Disappointed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ffDGGijzYiR5qOxbYF5ezQ"
  },
  "0yEnPMNlZbdpbyTONAJs2g": {
    "date": "3/27/2019",
    "text": "I had pork pierogies and they were the best I have ever had!!!! Pork was super smokey and tender and my boyfriend had a steak hoagie that was huge and soooo yummy! Def recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iLOPGMmoE6_I8C6De1zc6Q"
  },
  "pFvpXjNCICzb1l3oXHxEZQ": {
    "date": "6/24/2019",
    "text": "I've passed this place many of years. This place exceeded what I expected reasonably priced. There surf and turf kebabs with the grilled watermelon was great and had smoky taste. I've tried grilled watermelon before and really didn't care for the taste. But here it was so tasty and the smokiness went well together with the kebabs. Had the black and gold wings they were also awesome had a couple other items as well and everything was very pleasing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DklpuVsd8Ofon_IBt_CRqQ"
  },
  "jYRlGs3B_u0MIgMcL2lZhA": {
    "date": "4/13/2018",
    "text": "I'm a huge fan of Sunny Jim's. Not only is their food great, but they have a dog-friendly patio where my pup and I have enjoyed many a summer day.  When I moved into my house and my parents were coming from the north and helping me with painting and other projects, this was our go-to dinner spot. It's affordable and has something for everyone, and it's easily accessible for them coming from the north and me living in Brighton Heights.  My dad likes their wings - especially the smoked wings. He always orders onion rings and my mom and I have to steal one every time because they are GOOD onion rings.  They have lots of good sandwich and salad options. I like the buffalo chicken salad. Good burgers. It's just a nice little spot, hidden away that you wouldn't go to unless you knew about it already. I'm a fan!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "jaij3nmMTFFguC67URtcxA"
  },
  "D8LY0dAiu1J28039_Ssr0g": {
    "date": "2/11/2019",
    "text": "3rd time I've been here. First two times were good but not great, I had the patty melt one time and wings the other. I don't know who is in the kitchen today, but I just ate the best buffalo chicken sandwich I have ever eaten. And I went to school in Buffalo, so that is saying something. The chicken was perfectly fried, crispy on the outside and moist and juicy meat. Buffalo sauce was tangy with just the right amount of heat. I put some ranch on it, because that's how I roll, but blue cheese dressing would have been good, too. You also get a lot of food for not a lot of money. The interior is spacious, you never feel jammed up by other tables.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yp4F1LclDOcUygzFzujYhw"
  },
  "AkqXxxma2evThvSKFP7SEA": {
    "date": "1/25/2019",
    "text": "Good place for a few beers, or maybe a casual lunch. Just have right expectations for food quality and you'll be fine. Better watering hole.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLat6c23qhZKLjyFhUvjSA"
  },
  "V5MR4XysI17hkd313im3rA": {
    "date": "5/21/2019",
    "text": "Great food and relaxed atmosphere with my dog out on the patio with live music playing jnside. Wait staff friendly and attentive. Delicious food and large portions. Will be back again and again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tHoYCK28ijudqHT7Y6QjEA"
  },
  "WOe9_F5I41RYLUWIlDlHxg": {
    "date": "7/10/2017",
    "text": "I have patronized Sunny Jims countless times.  From live bands to Steeler Games.. it's always a good time!  The food is always on point.  I have never been disappointed with anything I have ordered.  The menu offers a large variety of items - from Ribs to even Pizza.  The dining room is always packed.  Since the renovation new tables have been added so there is even more seating available.  During my recent visit - yesterday I tried the \"Ginger Mambo Habanero\" smoked wings.  They were delicious -Not \"hot\" at all - sweet and tangy.  My favorite time to visit the restaurant is for Steeler Games.. always fun and always great specials.  Thanks Sunny Jims!!  See you again real soon",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "tuPYNI0-rtj2aLa8svwa7w",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States. smoked: hot wings and ginger mango haberno wings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tuPYNI0-rtj2aLa8svwa7w/o.jpg"
      }
    ],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "IBFUg27gC4K5DTuqAoJ5rQ": {
    "date": "10/10/2017",
    "text": "This place is great! I found it while on the \"bring fido\" app because we had our pup. The outdoor seating area is beautiful and well kept. There is even a creek running under the building! So awesome. Our server (Samuel) was great, and obviously passionate about his job. What a surprise! This place is really a hidden gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GhAcI5suwiAdEtvpNet7jw",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States. Pup allowed!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GhAcI5suwiAdEtvpNet7jw/o.jpg"
      },
      {
        "img_id": "16BSrjde1uXVnzQoZsy9Rg",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States. Spicy Kielbasa Special with kraut. So yummy!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/16BSrjde1uXVnzQoZsy9Rg/o.jpg"
      },
      {
        "img_id": "7kf1blAumCJartr_n7Ueyg",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States. Veggie Pittsburgh salad (extra veggies,no cheese)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7kf1blAumCJartr_n7Ueyg/o.jpg"
      }
    ],
    "user_id": "q7kb0GVCWOdORhOrRfkxbw"
  },
  "eOf7JYUVyi7dP7fmmxvUdg": {
    "date": "11/3/2018",
    "text": "Nice place and enjoyed the smoked wings.  Fries were very good also.  Service was excellent and a good selection of beers. Looking forward to going back and exploring more of the menu options",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GcYao8ugtrbLESgajrwNRA"
  },
  "eX0Xj2sur4lIL_-Ck8Zy0Q": {
    "date": "2/18/2018",
    "text": "Went here for the first time yesterday with family. They had been here many times over the years and always enjoyed it. So I was excited to try a burger. The burger was cooked well to the order, but didn't have much flavor at all. On the contrary, everything else that we ordered was so salty that no one really ate much of it. Our server told us that they had a new kitchen manager, but who knows if that had anything to do with it or not. We ordered a pizza, and while I know that is probably not their specialty, it tasted and looked as if it came out of a freezer, but then was heavily salted on top of that. And I usually like a lot of salt! Not sure that I would go to your again unless I heard that some things have been changed. The restaurant and bar area were nice inside though. Just pretty disappointed in the food for wanting to go here for so long.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CHDDECBLR-FJ02FeR6eKig"
  },
  "JW70AV3NbXE2CKCxJPRqqA": {
    "date": "3/10/2018",
    "text": "The wings are amazing! The food is so good !! I absolutely love this place!! The salad was so good and the calamari was amazing!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LE9--dxkFG9mLNHAJ-ktFQ",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States. Buffalo chicken salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LE9--dxkFG9mLNHAJ-ktFQ/o.jpg"
      },
      {
        "img_id": "9DTOCQqk8mcDpuuW4dV0jQ",
        "caption": "Photo of Sunny Jim's Tavern - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9DTOCQqk8mcDpuuW4dV0jQ/o.jpg"
      }
    ],
    "user_id": "PRFNlFWSvjCrZ98ge9ayqg"
  },
  "wc12-5oDML-DWwZkeH3kbA": {
    "date": "1/19/2019",
    "text": "This place has gone down hill. We haven't been there in about a year and the last time we went the food was good but when we returned today, it was barely passable. One of us had the pot roast special and it was basically a lump of meat on a plate, another diner had the spicy turkey bacon wrap and there wasn't anything spicy about it, someone had the 10oz sirloin which was passable but the side of steamed veggies were actually raw! The smoked wings were so dry that they stuck in your throat. In a year, we obviously haven't missed much and it will be years before we return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yy_W4tSQXcWIUnRhbobGTg"
  }
}