{
  "7ecJU8Awbh3WlvgJ9R0qfg": {
    "date": "4/4/2011",
    "text": "Love, love, love the Beehive!!    This place gets a really rough reputation of being a hipster coffeehouse/bar when it's just a great, locally owned and independent alternative to Starbucks across the street.  Prices are reasonable, even for beer on East Carson!  I love their specialty teas and coffees and somehow their chai seems like it's the best in the city.    They serve assorted pastries and sandwiches and ice cream too!  Their bathrooms are the best in the city. :)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hsgbgJgJp3JOD1-_UvUabA"
  },
  "DVQUZVM59n3uFMpcK2UcVA": {
    "date": "7/21/2011",
    "text": "I don't know how the beehive has escaped me for so long. For years I thought Carson Street was just one big frat party, then I stumble in to this place.   Its huge! 3 big rooms with one you can smoke in. Coffee prices are average and you booze too if that's your thing. The set up is great, plenty of tables and the music they play isn't too bad either. When I've been there they play albums in their entirety which is cool.   Ive been to coffee shops all throughout the country and this is definitely one of the best. A great alternative to all the 'roided up bars in the Southside area.   And to all the haters who don't like the people who patronize the place because they are \"weird\", \"freaks\", \"hippies\", you obviously need to get out a little more. If you are looking for something a little more corporate and square there is always Starbucks across the street.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4IlFpxJ-HU1iBKo89WV7IQ"
  },
  "feRue7poURbUfKWzTKwwVg": {
    "date": "6/22/2010",
    "text": "The Beehive used to be a hub for southside dwellers and city folk. It's turned into a half nightclub for 21+ during the night, and during the day you'll find yourself amid a slew of young and obnoxious goth kids, hippies, and straight up tools.   I have nothing good to say about this place. Avoid. Go down to Caribou on 27th St instead!",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "J_unOBzD_BpKoRjPy-SkVQ"
  },
  "m2JFgXzE8_fom2v10KqCWA": {
    "date": "9/28/2013",
    "text": "I love the fact that you can get good coffee and strong drinks in the same place.  In fact, like to combine them!  The espresso martini is excellent, and the house whiskey Irish coffee is frequently on happy hour. They have free WiFi and eclectic music, but no television, don't come here to watch the game. My girlfriend asked if I was high from the caffeine, or from the alcohol.  Yes!!!  Ready for the rest of the night on the South Side!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eVB6qRCCfuT2NIuLi3Bb8A"
  },
  "E9JSd-6yAqUpegponoKP_w": {
    "date": "9/9/2010",
    "text": "Huge coffeeshop with extended vegetarian menu!  We wandered in here after walking from Station Square and through a somewhat sketchy neighborhood, but I am so glad I did!  Everything on this street is fantastic!  I loved my vegetarian tofu, spinach wrap touched with a sass of peanut siracha glaze.  It was divine!  It is definitely a very hipster looking place, but don't let the exterior fool you.  This coffee shop extends the length of three store fronts, so you have plenty of room to sit, set up your laptop, put in your headphones, and click away at your work for a good three-four hours.    The menu is extensive and goes beyond the regular sandwich and paninis.  They even have soup!  Stop on in!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "sadqGSZaFMXboG6N39CDtQ"
  },
  "trHjkBYqwZW97iVA1g8AuA": {
    "date": "11/19/2015",
    "text": "The young lady working today was a delight, I had great service and left with a smile on my face she started my morning off right.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4wEj-S3g-LWohM42sHuEnw"
  },
  "76p_2nvjTUWge65JNPOZeQ": {
    "date": "11/24/2010",
    "text": "In the 'Burgh for Thanksgiving and had to stop in for coffee.  Met Johnny, a local character, that has called the Beehive home for many, many years.  Heard through the grapevine that there is a bar in the works and then the coffee shop will return to it's original smallish 1 room setup ( Beehive now occupies 3 storefronts connected internally ).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RxEIgoTAJLAdBmH0nM2xGw",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. bathroom at the beehive",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RxEIgoTAJLAdBmH0nM2xGw/o.jpg"
      },
      {
        "img_id": "bcTNI081xVi7ByLmQs44yQ",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. By Karl Mullen.  This art piece was in my livingroom at one time.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bcTNI081xVi7ByLmQs44yQ/o.jpg"
      }
    ],
    "user_id": "PAeEkjrXTub0ENa4rZiWvA"
  },
  "6W5EvJNkhqwJacb-dT9uPw": {
    "date": "3/26/2011",
    "text": "They have a very \"hippy\" vibe here. They have some pretty great drinks, but I must say, the real reason I come here is because of the pinball machines in the back. I may be terrible but I sure can waste a lot of time trying to win a game of pinball, or at least beat the boyfriend! =)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eiiS0rrIN6orvf4PmsKe-Q"
  },
  "DHOvAQTrNuYl57j6WTfPhQ": {
    "date": "9/10/2010",
    "text": "I'd give it a two, but I'd rather see this place succeed than Starbucks on carson street.  The food is subpar.  The drinks are made well, depending on who you get.  I strongly dislike the owners of this place (personally).  The staff isn't exactly the most friendly.  The crowd usually consists of kids ages 12-17.  The older people there get their coffee and get out.  Non smoking, the out back area is cute but could use a lot of work.  The decor is interesting, though it's rare to see any half decent art hanging on the walls.   All in all it's not completely detestable.  Oh, it's also cash only, but there is an ATM.  Not sure if the vending machine still sells cigarettes and japanese candies, but it used to.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EWkQxKg-KOzujC38Z_40wg"
  },
  "Nhnbj_vyuOZA5URe1T_pzQ": {
    "date": "4/3/2012",
    "text": "Can you stop looking at me like I conquered your nation and burned its villages?",
    "rating": 2,
    "rated": {
      "funny": 5,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "-Q4bjWlbxmb1yKP4U7OODg"
  },
  "614a8X_eL2uUIYFsKHIaqw": {
    "date": "1/28/2012",
    "text": "Beware customers of the Beehive. Things have changed for the worse.  Up until a couple of weeks ago the Beehive was my favorite coffee shop. I have been a frequent customer for nearly 10 years. But, I think tonight is the last night I will be going. Things literally changed overnight from good to bad.  About ten minutes after the four of us bought our drinks the music suddenly became obnoxiously loud and the lights were turned off. Not turned down, off. We asked for the light above our table to be turned back on, but we were firmly told no, that they were \"setting a mood\" to sell their shot specials.  At least five other tables cleared out almost immediately. A few were replaced by girls buying cheap shots in dixie cups. It was rather pathetic to be surrounded by tarted up girls buying their own bottom shelf shots.  I thought I'd never say this. But, next time I'm in the Southside I'm going to Starbucks. Even during the day the Beehive has lost my business. Its become just another cheap and trashy bar in the Southside serving cheap drinks in plastic cups",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "mEDn833IEhIbslkq_FyxJg"
  },
  "8yQVo_qUkpdfAtoaJKcljQ": {
    "date": "7/31/2015",
    "text": "This is hands down one of the coolest coffee shops in Pittsburgh. Though Commonplace Squirrel Hill holds my heart as best quality coffee vendors, Bee Hive has its own unique feel. It's vast artworks and antique oddities offer a creatively stimulating environment that is very characteristic of South Side's alternative style. It's like a South Side dive bar transformed into a coffee shop. The clientele consists of all types, but most commonly the heavily tatted, rock'n'roll influenced peoples and reminds me of South Side's day time personality, contrary to its bro-centric weekend crawlers. The best part about Bee Hive is that it is QUIET! There's never too many people inside and they're open as late as all the other bars (2 AM)! This is the prime spot to get work done on the weekends without worry about distractions. And finally, the coffee is superb! What makes it different from other cafes is that you can order alcoholic drinks or get a shot of espresso combined with alcohol in a variety of drinks. My favorite is the Irish coffee. Productivity, idiosyncrasy, and quality drinks gives this place five stars!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J9jE5hzjFj_P74mKNqitFA"
  },
  "6r3ptrkwClHz21O7Pd3MiQ": {
    "date": "8/11/2010",
    "text": "My buddy Drew, who runs the ETC at Carnegie Mellon, suggested we meet for coffee at this local Pittsburgh establishment on Tuesday. My first thought: it felt like Austin.  Well, my first first thought after I traversed the very narrow roads and worried - for just a moment - as I parked my car in front of two women sitting on the ground smoking cigarettes at 830 am. But clearly they had other things to do because despite the sketchy neighborhood, everything was cool.  The coffeeshop is eclectic, definitely a hot seventies kitsch to  it. But not gaudy like grandma's fake jewelry. More antique-y. And there were tons of drink and foodie/breakfast selections. And the young woman behind the counter couldn't have been nicer.   (Plus, after being subjected to 2 weeks of English cappuccino just before I arrived in Pittsburgh, it was nice to have coffee made right again.)  If you're looking for something a bit funky, a bit real and complete with personality...this is your place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MRQL87mqMrLgLBNYE97ahg"
  },
  "Phjh1H8Xa9p99QdffQDNxg": {
    "date": "4/6/2015",
    "text": "I would rather get a coffee from here than across the street at Starbucks but they could definately update their menu with more natural items like smoothies and juices.  Coffee isn't that good but it is better than Starbucks.  I like that they are a Pittsburgh institution and I generally go here on Saturday mornings which I don't think is the typical angsty-teenager time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g3V76Ja0XgWS1rqx0gxL_A"
  },
  "Wv0bLlHK3DHegWAuSvGckg": {
    "date": "8/1/2010",
    "text": "This is the hipster haven of hipster havens. Everything about it is pretty alright but it's more for people watching then anything else. I have yet to see a group of people sit here mostly people by themselves reading or internetzing. It's probably a great place to get stuff done during the day.  edit 12.19 Their beer garden's pretty groovy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LFN_cQRCZfIlA_vn0bJtwA"
  },
  "dIG9GvH05P-NYHhckXjXjw": {
    "date": "10/21/2012",
    "text": "I fell in love for the first time at the beehive.  I will never forget this place......  Love and all good things to you and all who make this business work!!!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JZC86ZWWBbf8UuMTYV4ZFA"
  },
  "-42qLSltgmCOR4E-Imw9Cg": {
    "date": "1/21/2010",
    "text": "I spend a lot of time in coffee shops. Let me clarify this, I spend the majority of the time that I'm not at work or sleeping hanging about in coffee shops. One of the first things I do when visiting a new city is seek out the local coffee house, I feel these establishments are a great indication of the type of gritty art/music scenes I enjoy submerging myself in.   Pittsburgh has it's share of commercial, chain, and small/independent coffee shops. The Beehive has long since been one of my favorites. Located in the middle of the full on pandemonium of the Southside and East Carson Street, this place is constantly a hub of activity.   It specializes in more than just (hot & cold) coffee drinks, they also offer an array of breakfast/lunch/dessert food items too. The prices are low compared to most chains and while they only take cash they do have an ATM on premises.  Multiple rooms make it big enough to find a spot to sit with friends to talk or just grab a seat to read/write/sketch. This is one of my absolute favorite places to go for an afternoon/evening.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "yfK0Od09W_D5jzXBzRgnlA"
  },
  "RAN8qEgPatfWFZBY05lTLg": {
    "date": "5/3/2010",
    "text": "I love the beehive!! I really miss the old one in Oakland though :(  I live out in California now, but everytime I go back to visit Pittsburgh, I always make a point to stop by. The atmosphere is fun and laid back, great furniture and art all over the place and free wifi. They have a wide variety of food, sandwiches, teas, etc... and its just a really great place to spend an afternoon and catch up on some reading!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aZ7mxYh8niIIsX6_HPb2mQ"
  },
  "rfC-8S4hRsObm6-OZ6NiQQ": {
    "date": "12/17/2009",
    "text": "I lived in pittsburgh from 2004 - 2006, for a bit I lived on Carson St, and I was seriously at the Beehive every day.   The prices are fantastic, definitely better than any other coffee shop I've been to. The people that are regulars are fairly friendly, and you can always meet new people here.   They used to have these amazing spicy peanut noodles that were seriously the best fucking thing ever. I was obsessed. So obsessed in fact that when I moved, I asked for the recipe and they gave it to me!  I don't think they sell them anymore though.   Another thing that's great is how many different varieties of tea they have, plus you get a cute little teapot for more than one cup.   Ahhh I miss it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "8WzFNiQZbUJjvHoT2Jp5rg"
  },
  "kPqpMHqcRzEVo7zE9Hyzag": {
    "date": "11/2/2009",
    "text": "This is what a coffee shop is supposed to be like.    Cool.  Quirky.  Bohemian.  Coffee that tastes better than Starbucks.    Friendly people.  Really, though, this is an awesome place.  I haven't een here in years and it has actually gotten better.  I am a tad square for the Bohemian atmosphere, but I will continue to return in the hopes of some of the atmosphere rubbing off on me.  The coffee was smooth and had only a hint of bitterness -- quite nice.  It was a bit weak, but I expected that considering it was a medium roast.  Since the last time I was here, they have cordoned off the \"third room\" where all of the smokers congregate.  I have nothing against a smoker, it's just that my nose cannot handle the fumes without going into a sneezing fit.  You can be as square or normal as you want in person, but you must leave any preconceptions you may have about others at the door.   Good Times.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "rnfgjemszUlQx6U_-PO63w"
  },
  "onhkTjg1_wkNerXL-QPDcg": {
    "date": "7/18/2014",
    "text": "Hip decor, but don't know their espresso. I was in from out of town and I checked on Yelp for a local place to get a great espresso and relax a little bit. Beehive appeared to have the right atmosphere yet the reviews here were mixed on the barista skills. I'm not a espresso/coffee snob, but if I'm going to order a nice drink and relax I'll like a confident barista and a quality pull.  Entered the hip local place on a Friday morning around 10:00 AM looking to get a great drink and relax. Walked up to the counter and requested a \"Quad Shot Mocha Breve.\" The response from the Barista was, \"Hugh\" as if they just woke up. Then they said, \"What's that?\" I followed with the question, \"Do you know what a Breve is?\" Answer \"No\". My response, \"What Barista doesn't know what a Breve is?.\" I then explained what a breve was.  Then I asked \"Do you know what a quad shot is?\" Barista, \"Um, hugh.... Is it four shots of espresso?\" My answer, \"yes!\"  Preparations of the quad breve began. As I watched the espresso being pulled I noticed the barista pressed the 4 oz button on the machine, I thought ok maybe they have a special 4 shot portafilter. But then I watched the pull end in a watery stream. Followed by the barista pressing the 2oz button on the machine a second time with the portafilter not changed. This pull was nearly straight water. I commented to the barista that the quad shot was actually two doubles and that the espresso that was just pulled was all watered down.  At that point I decided my lofty dreams of a breve and relaxing in the hip local joint wasn't going to be the experience I was hoping for. I told the barista that I was going to pass, part ways, and go across the street to Starbucks where they knew how to make a quad breve. As I was leaving some local hipster looked up, called me an \"a$$&ole\" as I walked out. I can't remember the last time I was called that, maybe 20 years. Not sure if I was called that because of questions to the barista or because I said I was going to Starbucks.  I walked across the street, ordered a quad mocha breve venti and was quickly served a quality drink with quality espresso pulls. This is where I promptly sat down to write this review.  Some people complain about the large multi-national chains being cookie cutter and destroying local businesses. Sorry, I can't subscribe to that train of thought. I tried my best to support local business and was really hoping for a great experience.   The failure here is in fact NOT the barista. The failure is the establishment for not properly training them and educating them on something that they might be passionate about.   If you want a hip experience and maybe a cup of coffee or a beer, this might be the place for you. If you want a quality pull of espresso, please go some where else. Based on other reviews, clearly this place varies in experience and consistency. I encourage the ownership to get their training down pat and deliver a consistent quality experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K29SA5bx_P6hlMN7wCI_5g"
  },
  "qxTbz4pbgPl_QH02z-5sww": {
    "date": "2/29/2016",
    "text": "An artsy/hipster coffee shop. My cappuccino was good, my boyfriend ordered the mocha latte and enjoyed his drink as well, but the atmosphere had a grungy feel and a strange aroma (not a coffee smell). It was nice and quiet but also dark, so it was difficult to read/study. Drink was good, fair priced compared to the avg mainstream coffee shop! I would recommend trying it out if you are looking for a new hangout or wanna try something off the beaten path of typical coffee shops! Definitely unique.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u-khmdKJvZbrdSBAqLACkw"
  },
  "OUaJPtYIqaXU3P340Y9IhQ": {
    "date": "8/20/2016",
    "text": "Five stars for variety and vegan options! The vegan banana bread is great and the almond milk lattes are delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J6UsTcOwhsJAfr2iWse3XA"
  },
  "sqPnUEPPO8q-WCHulf2AQQ": {
    "date": "12/8/2015",
    "text": "Great neighborhood hangout that stays open late.  Good place to get work done.  Tasty snacks too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LJfc03blK_-qzwWztBqUcw"
  },
  "5T8GEm1kuBBtjFdfx3mozA": {
    "date": "4/4/2013",
    "text": "Okay, it's a little grungy, but that's how a coffee shop in a grungy neighborhood should be.  The employee that helped me was a bit hippydippy, which fit in perfectly with the atmosphere of the place.  It's about as genuine and unpretentious of a hole in the wall hipster coffeehouse as I've ever been to.  I mean, according to a conversation that I had, Beehive hosts a periodic dance party where customers bring in vinyl and they just kind of play whatever and have a good time.  Perfect.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OxE0QBa6m1399S8BXigIsg"
  },
  "RV-pbe8gw1vOFYd1Xwro8Q": {
    "date": "11/16/2013",
    "text": "The Beehive would be at home on any boardwalk in NJ, or in the bowels of the Chelsea District or Soho in Manhattan, the Short North in Columbus, Collage Town in Ithaca and Pittsburgh's  South Side.   Good coffee, 60's flower child atmosphere, think post atomic war bomb shelter design. Vegan baked goods along with normal pastry, sandwiches and smoothies. A great place to duck into when you want to escape the southsiders on Carson. Props to the Beehive for staying in business with a Starbucks right across the street. That means they are doing something right.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UsmTxWbobLsI6WR1Db0W7A"
  },
  "jH2Xs-24xyhjBNg_1NGSQw": {
    "date": "9/28/2012",
    "text": "Aaah, this is my kind of coffee shop. A bit of a hole in the wall with lots of character and DELICIOUS coffee. This place is the anti-chain coffee shop, with old chairs and cool art (the welded sculpture hanging from the ceiling is bad ass).   And the soup? Well their soup rocks. I've had a few different soups and they're what a soup should be...hearty, bursting with flavor, and oh-so delicious.  I'm so glad I live around the block from this place.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "EsxkDINZtNW3JLNpromHGw"
  },
  "IqeCKgqaXr2rhgdeW5jw1Q": {
    "date": "10/21/2012",
    "text": "I used to love going to the Beehive when I lived in Pittsburgh three years ago. I went recently and was given a coffee mug with sugar left over on the bottom and a sticky goop of god knows what inside of the mug. It was filthy. I then asked for a clean mug and was given a mason jar that was also filthy and the teas was served in a rusty tea pot.  The woman behind the counter acted like it wasn't a big deal.  Are you kidding me? You're going to get people sick! Next time I will go to Starbucks, at least they will give you a clean mug.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "B_6zujMDXCbFElr7b50_Sw"
  },
  "cwJYMf8F-jNl43HISHP_4A": {
    "date": "7/24/2012",
    "text": "I love The Beehive! Living in DC now, it's nice to be in a city that actually has coffeehouses that don't bear the Starbucks name. I grew up in Pittsburgh, and was back recently to see what's changed and what's stayed the same. Well, some of the great things about The Beehive have changed (the extra rooms, the courtyard, the pit), but the coffee is still great and the atmosphere is still welcoming and, as cheesy as it sounds, freeing.  I have to say, though, that we went on a Saturday night and if I still lived in Pgh, I wouldn't be going here on a Saturday night. The lights were turned off and replaced by a horrible club-like lighting effects in an effort to sell cheap shots to the droves of college kids. I feel so old just saying that (I'm 30), but my how the times have changed. When we arrived, around 9:30/10, we were the only customers. It wasn't until around 10:30/11 that the place picked up a bit and almost every table was occupied by bar-hoppers pre-gaming before moving on to the more popular bars and clubs. I totally understand that The Beehive needs to compete with the other businesses on E. Carson, but damn.   Frankly, I'm just glad that this place still exists and that the coffee is still good and the youthful spirit is still present. But if you're just looking for a great coffeehouse where you can sit and read, do some work, or hang out with friends, I'd probably avoid it on a weekend night.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ay8M7jWsLwJ1PCMsXrBzSw"
  },
  "FoXUqqZTKzbjiA5fYVquYg": {
    "date": "9/11/2016",
    "text": "I gave Beehive another chance and had the best experience.  This time we had Adrianna as our barista and she gave us the best customer experience.  I am really glad it was better this time around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-7F6OHJBogdLn5eQcMesfA"
  },
  "H8D8TyaqdN4Cg6n_NMu5tA": {
    "date": "2/22/2010",
    "text": "We just wanted to find a place for coffee and space to play bananagrams. Enter, The Beehive!   The place is really cute and offers a wide range of epicurean delights for you to snack on while doing work or playing games. We were going to Primanti's after so we just got drinks.  I got a medium latte (<a href=\"http://www.yelp.com/biz_photos/5h7ra0kJKswSZEzbFSIpaw?select=NaiWLIXPytGJWqAhr_co7w\">yelp.com/biz_photos/5h7r...</a>) . It was served in an \"I love Mom\" mug (<a href=\"http://www.yelp.com/biz_photos/5h7ra0kJKswSZEzbFSIpaw?select=7gCF-FZnhrz3vYW4Ammhnw\">yelp.com/biz_photos/5h7r...</a>).  I hate to be buzzkill at the Beehive but I wasn't terribly impressed with my chosen espresso drink. It paled in comparison to the latte I had at Enrico's the day before. It tasted more bitter/burnt. Perhaps I should have gone with one of their teas instead which both of my friends really enjoyed.   So aside from my so-so latte, I think the Beehive is a great hangout spot. Plenty of tables to plug in and get wired and a section of boardgames if you feel less inclined to do work. The employees here are very friendly and won't scoff as they re-direct you to their on-premises ATM when you find you have no cash in your wallet to comply with their cash-only policy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "NaiWLIXPytGJWqAhr_co7w",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NaiWLIXPytGJWqAhr_co7w/o.jpg"
      },
      {
        "img_id": "7gCF-FZnhrz3vYW4Ammhnw",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7gCF-FZnhrz3vYW4Ammhnw/o.jpg"
      }
    ],
    "user_id": "s2c7-9bqMhjA8POuKIHm8g"
  },
  "4jPUwSiQhwiD5ThbLrMoxg": {
    "date": "12/10/2012",
    "text": "Loved this little hole in the wall coffeehouse.  Even though it was a weekend afternoon there were plenty of places to sit, unlike the coffee houses closer to the universities.  They have a couple of cute elevated seating areas in the window where it's great for people watching.  The coffee is good (not amazing, but good) and the staff were very friendly.  I like how they serve their coffee in unique mugs.  And it's decorated cute inside.  They had free wifi that worked consistently, so it was a good place to get some work done.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3bo1FXvQnxw2hmO0CHH4Nw"
  },
  "NPJm7LQ7Aw-KZ_b1qCtcnA": {
    "date": "7/12/2015",
    "text": "Really good coffee, I tried the hazelnut latte iced and it was smooth and creamy! Also got a tomato-pesto-mozzarella panini. Delish",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A8WHBko_aULQGokvcFm9Gw"
  },
  "oL21JPOXpuXMRPWxoYwfhw": {
    "date": "8/5/2006",
    "text": "Skip the starbucks across the street and head on over to the original Southside coffee shop.  This hip and eclectic coffee shop has been serving up Pittsburgh's finest coffee and panini since 1991.\r \r Funky mismatched tables, great music, and free wifi internet access.  Swarm here if you live on the southside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lJYMw4jNXeEzY3O69zq9mw",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Bzzzz",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lJYMw4jNXeEzY3O69zq9mw/o.jpg"
      }
    ],
    "user_id": "k6Y8yT_EJtL5hhwnYPDUfg"
  },
  "88Ylj-ouB3JkxCy0ywof_A": {
    "date": "11/26/2013",
    "text": "I have lived in the Southside a year and just now discovered this place!! I've been missing out!!! The venue is pretty cool, but the best part - they serve alcoholic coffee beverages! This will probably not be my go-to coffeeshop when I'm trying to get work done (because I'll be too tempted by the alcoholic coffees), but I will be back at least weekly!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "iJp3Wu-pYl7osiYqz1Gv7A"
  },
  "4VZObbuMOUBZ1QMQyXgIwg": {
    "date": "3/7/2014",
    "text": "Used to be great, until it became a cruddy bar.   Just a note. If you want a decent review don't advertise your drink as having Baileys and Jamesons and then pull out the Banker's club Whiskey  and some generic off brand cream based liquer (no, not even Carolyns) and pour that into my drink. Don't advertise brand names of liquor as being in a drink and then subbing in low shelf brands. That's just fraudulent. Even most dive bars wouldn't pull this sort of nonsense.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AldO43g6W69VG0rlAFsczQ"
  },
  "UeGRc6SAAwGoI4Tk1Bql7w": {
    "date": "11/29/2013",
    "text": "Good strong fresh coffee. Cool but still friendly staff. Unhurried vibe. Super cute decor. Love it here",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hDZZNfCiiNQT-UxpxCUpNw"
  },
  "ii8aelTjq_Ve2SdVDqSP7A": {
    "date": "7/23/2014",
    "text": "We stayed in the hotel down the street and frequented this coffee shop just about every day for breakfast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u6JWn8ez6etRVTJb4vTNMA"
  },
  "tQM_khYOsS9REqCAWiMiAg": {
    "date": "10/20/2014",
    "text": "This place is really cool. I don't remember what I bought here, but I remember how eclectic this place was. Coffee-shop by day, bar by night. What more could a college student ask for? ;]",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CMjjwZ43THQpVS9VwbpWOw"
  },
  "s4SXu4yLxsIeG75N2UTEDA": {
    "date": "7/12/2012",
    "text": "I've been to Beehive a few times, and I know I'll be back... but I also know that it's definitely not my favorite coffee shop in the Burgh. This place is so kitschy it's overwhelming, and the staff is not very inviting. Some guy who I think is the owner is almost always around and for some reason he just makes me uncomfortable. He kind of exudes the same \"better-than-you\" vibe that most of his employees also have.   That being said, the coffee is great and the treats on the counter are delicious. I've tried a wrap from their little fridge and it was okay, nothing special. They play decent music and there are a good number of neat retro tables where you can sit and work as long as you want.... though it's hard to focus sometimes -- Beehive regulars are a rowdy bunch (coming from a 20 year old who likes to party).  I wish I could give this place more stars, but I've tried so many other better local coffee shops in Pittsburgh that I'm not sure how often I'm going to visit the Beehive anymore. That being said, there's a Starbucks across the street, and if you're in the mood for coffee, you should definitely live a little and go to Beehive instead.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NI3GxHGx-3QXJFlGk-TofA"
  },
  "HH4umZ-tj0E8-rIXfwvWuQ": {
    "date": "9/12/2016",
    "text": "Best tea I had and great chocolate flour less cake. Husband loved this mocha as well and the chocolate cake!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AMT39xVq1b2KS0PVaaon_w"
  },
  "oroWh0kw6qnewlUhe22szA": {
    "date": "2/24/2016",
    "text": "Yes, it isn't what it once was. The glory days of 90's grunge are gone. Some owners have exited. The size expanded and shrank back. It's different. And once upon a time I practically lived in the back corner sucking down coffee at a rate that now alarms me, while making friendships with others who sucked down coffee and cigarettes at a rate that really alarms me now! Those friendships have lasted a lifetime. We've grown up, friends stopped smoking, people reproduced, and as we changed- so did the Beehive.   10 stars for the BeeHives past and legacy!   Now, onto the BeeHive of today! I have to view it as a separate entity. It's grown. It's changed. It's matured. It's regressed. It's became a different place but it's former self has molded its current shape. It's matured and grown again into a new and unique space for the current neighborhood. It fulfills the current taste for vices. Gone are the cigarettes and game room. Patrons no longer need carry a flask to add whiskey to the coffee. (We all know those neighborhood regulars that did back in 1996)  the Beehive is grown up. They offer nutritious food selections and mature coffee blends. Mature as in- bring your ID, because they'll check to see if your 21 before gladly spiking your coffee from the bar!  Chardonney, goo balls, warm delicious sandwiches, and a toasty almond coffee- never in my wildest dreams did I imagine it in the 90's but I'm more than happy to have the Beehive grow along with its patrons.  And yes, sometimes I miss people gathering to camp out to play games in the side rooms or buying art work from an old cigarettes vending machine. But, I like who the Beehive is now. It's a great place to stop and indulge.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 9
    },
    "photos": [],
    "user_id": "Jk0AcqPCVMfc_DTWO3SzwA"
  },
  "T_H6w7mfg61LVxlSaQuhYw": {
    "date": "10/20/2015",
    "text": "Favorite coffee shop in the Southside, great for people-watching, getting some work done (if you're so inclined), and/or catching up with the day's news.   The coffee is fine... look, I'm a coffee snob, okay? And when I lived in Boston, I lived within walking distance of George Howell's ONLY cafe in the entire U.S. of A., needless to say, I am spoiled and used to excellent coffee. Overall, Beehive makes the cut, the coffee is decent and the space is more than interesting. All in all, a fine coffee shop.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hnBzgVoRoqLrGVSxO0ilg"
  },
  "EBrfXGNKN9Z761iP9vTdbw": {
    "date": "3/31/2011",
    "text": "The Beehive made me inner hippie smile! After getting a recommendation to go here from some Pittsburgh Yelpers, I was stoked to check it out. I absolutely love the interior of it with all of it's sunshiney colors, painted  flowers on the walls and clouds on the ceiling. It reminded me of coffee house meets thrift store. Two of my favorite things commingled into the one? Yes we have a winner!  For being an independent place, I was expecting the prices to be higher but they were quite reasonable for a latte (cheaper than the Bucks and Crazy Mocha) so that just made the experience even better. Drinks came up in funky mugs and mini mason jars and the people watching was superb.  I wish I would have visited on an empty stomach so I could have gotten a chance to enjoy the veggie treats that everyone keeps yelping about.  Plus, who doesn't love reading inspirational (and some non inspirational) quotes on the graffiti walls in the can?? Oh Beehive, I have a feeling I will be hitting you up again next time I'm in the Burgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HooNaJZqGoHgrSAvEuL-mg",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HooNaJZqGoHgrSAvEuL-mg/o.jpg"
      },
      {
        "img_id": "uZIs8s8WxrUiYJ5r7wZOfQ",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uZIs8s8WxrUiYJ5r7wZOfQ/o.jpg"
      },
      {
        "img_id": "Nzw1j-8PN1z0VJ6tfL04hw",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Nzw1j-8PN1z0VJ6tfL04hw/o.jpg"
      }
    ],
    "user_id": "l-tDF960t9BakjyH34XfTA"
  },
  "iO3gELh7J6jtoweidM2h1g": {
    "date": "1/5/2017",
    "text": "Stopped here for a quick espresso and a break from the snow! The atmosphere is incredible here, so unique and fun! We got espresso shots which were great and the barista really knew a lot about the coffee and the brand. Would love to come back here in the morning!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "edMydk5z49OA4XiR08RoAw"
  },
  "C7B7oXBcrKd31rDQQEWENQ": {
    "date": "6/29/2015",
    "text": "This might be one of the funkiest places I've been to in my time here in Pittsburgh (going on 5 years here!) and I mean that in the best way possible. Loved the decor and the random disco ball. Every time I looked up from my reading, I saw something new, which I really enjoyed.   Speaking of reading, I was able to read a very dense scientific article with ease while here. The music wasn't distracting nor was it too loud, lighting was perfect. Disco ball may have been a little distracting but that's because I like shiny things :) Atmosphere at Beehive is wonderful to get work done or to catch up with someone over a quick coffee drink (with or without ALCOHOL! oo ahh oo ahh).  Speaking of coffee, I ordered their coconut mocha and found it to be actually a little too sweet for my tastes. It did the trick though, kept me up until very late that night! Reasonably priced as well.  Bottom line: definitely worth coming here. Whether you want to get work done or just wanna hang out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xr2uuQJ0q7lXLSk_Rdcj2Q"
  },
  "ZBXq2maIvMc6E-PC8L6Z0A": {
    "date": "7/4/2015",
    "text": "Great coffee, great shop and location. Love the window seating facing East Carson St. They have a great selection of beverages and food other than coffee and plenty of seating. Good place to study or sit down and have a good kibitz. Enjoy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3r-Lr_VRjrkcMgSRnNHzdw",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Outside on 14th.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3r-Lr_VRjrkcMgSRnNHzdw/o.jpg"
      },
      {
        "img_id": "g3ZCMBlX3oGO6-eIn0V86g",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Looking into the shop from the entrance.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g3ZCMBlX3oGO6-eIn0V86g/o.jpg"
      }
    ],
    "user_id": "rwDMkAYPnkCrQsXIITCvHg"
  },
  "DIvXP3gkAt8m9Y1epnJCwA": {
    "date": "4/9/2014",
    "text": "I love a good eclectic cafe where the people and the walls are colourful!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KcFxhQFcVlr4urPTsJAVXw"
  },
  "4T-g5iLoHFGrim_Y0wIV-w": {
    "date": "6/3/2014",
    "text": "You only make it half way with me, Beehive. Atmosphere: literally is the best part about this place..it has eccentric decor, and is a very large place! You walk in and see people busy on their lap tops and sipping their drips, the ceiling looks like a story book sky...very neat artistic works throughout. Their also the only place I know of that has a cigarette vending machine and a smoking section-the huge room on the left. Negatives: usually clouded with hipsters and drunkards.  Coffee/Tea:  (this is where you have everyone fooled, except me...I'm from Seattle and know my coffee and tea.) On the plus side, they have a wide variety of options for both.  After a certain hour, they also serve alcohol. *Everything I've tried, in their range of coffee, is WEAK. Watered down, flavorless, cheap tasting. Very sad. Their...\"baristas\" give shame to calling themselves as such. They don't know how to pour an epic shot of espresso much less soak a tea bag. They're also very prudish 85% of the time. So good luck asking them about menu items.  Overall, I'm not impressed.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RvIMoCfTNAU3S1LqVD3TSQ"
  },
  "g66HVSefy4GMcYkVI2IVEg": {
    "date": "9/10/2014",
    "text": "If you love coffee.  If you love alcohol.  If you love bohemian atmospheres. If you love chachkies. If you love Pittsburgh people.  If you love cool people.  If you love local places.  If you love anything that's worth anything, you'll love Beehive Coffee.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_rzWblYVpnzTA0-yKgNblg",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_rzWblYVpnzTA0-yKgNblg/o.jpg"
      }
    ],
    "user_id": "5X0DTPCFkQEt5Nr0YCMO_w"
  },
  "fLsDBKqYG8Yx_knlSZADvQ": {
    "date": "8/13/2016",
    "text": "A few weeks ago I came with my deaf friends and let me tell you, I LOVED the atmosphere of the place. It was friendly, the drinks were so so delicious and the staff were so nice!   It was reasonably priced, considering that I wasn't very favorable of spending so much money that night. However I loved the lime drink, I forget what it was called but it was really good! I love sour alcoholic drinks :) citrus is my favorite. But anyway  If you want to go to a place that has an artsy, relaxed, hippie vibe.. This is the place to go! I love it here. I'll definitely come more often :) thanks for a great service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y5EiQ3PDvFe5Ex_eNnZKuQ"
  },
  "qCJny_AlEcPHR5a0PCA8Vw": {
    "date": "6/8/2015",
    "text": "The food is delicious and they have great options for anyone who is a vegetarian. Apparently it gets quite rowdy on Fri-Sat, but when I went Monday evening it was the perfect place to come and get work done.   A++, would come again. :))",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OyGQoaIqTAc68zu69F-BXw"
  },
  "TboZwc67Gy4E51cHIfiHXQ": {
    "date": "8/30/2011",
    "text": "I won't say this a lot....but I felt slightly out of my element here.  I feel like The Beehive has probably hosted many area teenagers over the years.  Most of those teens have probably made their mark, literally, on the walls and tables of this place.    But alas, I am a teen no more.  Just trying to keep \"hippity hop\" like the rest of those youngins.  So for me, it's just not that type of place I can get into.  For others I'm sure it is.  Possibly a place that gets better at night...when you involve a dimly lite room, alcohol and karaoke.    Keeping it old school...like way old school...they do not take credit card.  A little irritating but I do understand that those transactions cost the owners money and I want to support the local biz scene.   I did appreciate the incredibly friendly service I received from the Barista and the delicious Apple Cinnamon Iced Tea I drank in like five seconds.  I'd come back solely based on the service and to try the food.  I just don't know if I'd spend an extended period of time to say work...I may be too distracted people watching!",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "unKLAq3BoF8GXRboQ15KSw": {
    "date": "1/21/2014",
    "text": "I stopped into the Beehvive today for lunch. They always have a variety of soups, I knew, so I wanted to try one out.  I had an amazing Spanish bean soup with pulled beef.  It was SO good.  They also had some tasty-looking sandwiches in the cooler.  I was also happy to get a coconut water after a long yoga class!  I used to study at the Beehive back in the day, and I love the hippie/hipster vibe there.  The cashier was really nice and fun today.  I'd recommend this place as a hangout, For food, or even just for coffee!    I think I spied some cute hipster guys in there, too...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JswXx1-subdh8g1O78YOpA"
  },
  "hw1eQJbYrcwWrmS8edURkA": {
    "date": "3/10/2012",
    "text": "I forgot how amazing their house blend coffee is.  I have to admit it.  It's been awhile.  I stopped by on a whim while walking up and down East Carson Street.  It was late morning on a weekday.  I was immediately greeted by a friendly barista.  No mistake, she likes what she does.  I browsed the menu but ultimately decided to just go with the basic, small house blend with enough room for cream.    Being there made me remember the old Beehive over in Oakland where I saw great movies like The Clerks and great concerts like Nelly Furtado just as she was gaining popularity.  I have fond memories of the Beehives and maybe that small coffee just tasted like nostalgia to me.  I can see how some people might feel out of their element here lately.  I suppose I'm not intimidated because I spent many a night at the Beehive in high school enjoying everything from coffee to tea to milkshakes.  Sometimes I would even get a sweet treat.  As long as I now avoid the late night beer and obnoxious music scene and just go for coffee early in the morning or during the day, I will continue to go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WoKCLSctS7G2547xKcED-Q"
  },
  "n5wNWgfigmb-mkDrmMOEeQ": {
    "date": "5/26/2017",
    "text": "A cute little spot with $3 alcoholic coffees, a good food selection, and music that doesn't make you want to slit your wrists. I don't usually go to coffee shops to work, but was able to get quite a bit done here. It got pretty busy, but everyone was respectful and quiet, so it never really felt too crowded.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "alnhm9aLKlXasfduTVr3Sw"
  },
  "siktEA3xckWoUXOVF5-GaQ": {
    "date": "5/25/2017",
    "text": "One of the best places in Pittsburgh. Such a cool atmosphere. Amazing food. Great drinks. Outrageous vegetarian and vegan options. Even the bathrooms were graffitied with inspirational quotes and the decor of the entire location instills this eclectic environment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MqQpSOe0PJFVG6EgTE2uwQ"
  },
  "UJRZ1QUa0vDnj2rK-IWqXg": {
    "date": "7/2/2017",
    "text": "Stopped by after visiting the Duquesne Incline. Their decor is hip and cozy, with lots of eccentric art and stickers (complimented by a bathroom with sharpie all over the walls). I'm vegan and got a soy iced chai; my friend got an iced coffee. The first sip of the iced chai was pretty good, but afterwards the ice melted really fast and it tasted watery. My friend's iced coffee was okay. What I liked was that they made it right away, and gave it to us before we paid. My expectations were met for ambiance and decor, but not for the drinks. Would be willing to come back to try something new and sit in for a little while to read a book or study. Overall, 3 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-wChmsRI9Uh8WkYm6kelIQ"
  },
  "MMIwpbEj7LIO8KYbFGjCgw": {
    "date": "12/26/2015",
    "text": "Coffee and booze? Certainly not a common combination, but they are pretty creative when it comes to it. Didn't get any of the cocktails this time, though we had a couple of lattes instead. I love how they have so many different syrup flavor options available. We had a maple and an Irish creme, both of which came out very smooth and just a tad creamy. The large cups were indeed large, and the place had a quirky enough environment in which to sit back and relax while sipping away. A great place for coffee oriented drinks, even though it's not a traditional cafe.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "cIUVCFXvMkpFRDms3uQ_1g": {
    "date": "10/20/2015",
    "text": "My fave coffee place in the 'burgh.  Downright bold and delicious coffee and a kitschy cool interior with vintage decor.  Don't you dare even think about going across the street to Starbucks.  The better cup of joe is here.  Trust me.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xxvz5g67eaCr3emnkY5M6w"
  },
  "4btxLlk1MrwXZPO6oA4hlA": {
    "date": "6/9/2017",
    "text": "Update: beehive is back! Over the past couple of months the place has improved significantly. Very competent staff! Once again a great place to hang out.   Used to be great but management has allowed it to go down the tubes as of late. Most of the good workers are gone, and it is sometimes randomly closed for \"personnel issues\" (that was the latest reason).  Bathroom facilities were never the most sanitary but again, lately worse than ever. I'm hoping that the downturn is temporary and will gladly rewrite my review when and if the upturn happens. I miss the great, funky place of a mere 9 months ago!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RURSO6qVwx0Skug1hGw9Zw"
  },
  "oXSiBQO_yf8Qh6xyjf6P7w": {
    "date": "7/28/2016",
    "text": "This is a great little coffee place on Carson on the South Shore. The decor is interesting (though the bathrooms look like someone dropped them out of a 1970's punk rock video). The coffee was tasty and the staff were friendly. The service was a little slow but it was just one person so she was trying to do everything.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "uY6IugXeRcM2ky2feCAZgA"
  },
  "aXQzqvqq48oes8-vXBHxIA": {
    "date": "1/1/2016",
    "text": "First coffee of 2016.    I went into Beehive after an interesting New Years in the Southside and on my way to work. Their POS system was broken. Immediately I thought, \"they were right about the computers and Y2K.\" They were just a little early. The very squirrelly barista let me know it would be cash only and it would take a painful amount of time for her to add up the total.    I got an almond latte and jalapeno pretzel. Which were satisfactory except I think she was really frazzled and burnt my espresso and under toasted my pretzel. Still it was an interesting experience.   The uniqueness of this place was only accentuated by the patron who rolled in after me and ordered a dirty chai with a shot of Tequila. Happy New Year.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-ECg2HYj2lEULjEWxwtu7g",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-ECg2HYj2lEULjEWxwtu7g/o.jpg"
      }
    ],
    "user_id": "kb36ZHxGLdPU5p63Mj5u4w"
  },
  "C9d2oDV_lG9t62ezjCu9Xg": {
    "date": "10/2/2015",
    "text": "Cool funky, unique coffee hangout with interesting art and usually good music.  Free wifi and quiet enough to work.  Check Out the back wall for the best local events and art exhibits.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "crN_d2vL98vOc2r6AvW72A",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Great mix of casual, cool music  art vibe.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/crN_d2vL98vOc2r6AvW72A/o.jpg"
      }
    ],
    "user_id": "rp007n5XVLGJwIOTh9U0-g"
  },
  "TbQ0PBd5w-ovRAbjiyW_tQ": {
    "date": "6/28/2017",
    "text": "The Beehive is the most unique coffee shop in the neighborhood. The artwork inside is existential. I would often times come here to write papers on grad school because of the creative atmosphere. I regularly go out of my way now on my way to work to purchase the peanut tofu wrap. Try it, and you'll be doing the same.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8B3hGCIDhKlK34EdDQUKEA"
  },
  "UQz7BniviBJ40xT3C-cRNw": {
    "date": "11/5/2017",
    "text": "Walking into Beehive Coffee is comparable to entering a portal to another dimension. With its electric and eclectic interior, it's hard not to love this tiny cafe. While some patrons come to the  Beehive for a small snack, I gravitate toward the alcoholic coffee cocktails. I can't say that I have a favorite because they are all truly delicious. I would highly recommend one of their coffee cocktails if you need a pick-me-up before a night out on the Southside.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ubrpx1SynLst5rvf6DHs_g"
  },
  "0-nizWBV6Bu__lgaS29TVg": {
    "date": "2/29/2016",
    "text": "Stopped in so Big Red could get and espresso to go and souvenir shirt.  Guess she used to be one of those mopey coffee shop people who sit there all day and smoke...all the while looking cool.   People were very nice and they sell beer so I have that going for me.  I would rather get a hot mustard colonic than spend more than 5 minutes in a coffee shop just kicking it but I HAD to I would kick it here for a spell...",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Dnwh2EFg8tMIDuf0uElHvw",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. They have beer mofo&amp;#39;s!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Dnwh2EFg8tMIDuf0uElHvw/o.jpg"
      }
    ],
    "user_id": "hy4uEHgITEfzxrXzyDhCRg"
  },
  "V7Yf2pWfIq3r9l4tkpPmNg": {
    "date": "3/26/2015",
    "text": "The Beehive was the hangout spot most frequented by my roommate and myself when we first came to Pittsburgh. We were living in Regent Square and trying to decide which parts of Pittsburgh we liked best. Inevitably we'd end up here, drinking coffee and eating stuffed grape leaves. The walls are purple, the staff generally friendly, and the atmosphere is just funky enough...any more and this place would feel a wee bit forced. In short I love The Beehive, and I know I'll be back plenty of times in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cxuZ16fQE9IzdMZwgUlJOA",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Espresso and stuffed grape leaves...the perfect little dinner!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cxuZ16fQE9IzdMZwgUlJOA/o.jpg"
      },
      {
        "img_id": "6gIKg-fvsEnOj_v5O7KdNA",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Love the look of these lights!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6gIKg-fvsEnOj_v5O7KdNA/o.jpg"
      }
    ],
    "user_id": "zPwZQEVmFg9cbmsEwLpA6g"
  },
  "OjwyE7bh4_SyOHr0Sv75VA": {
    "date": "1/5/2017",
    "text": "Great espresso, wonderful service and fun quirky atmosphere. Definitely a place to try for a quick coffee!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aI09XKEXGRFLddzHyc2LsQ",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Awesome spot!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aI09XKEXGRFLddzHyc2LsQ/o.jpg"
      }
    ],
    "user_id": "KuyOkbZFM0vmKcIjKvW3ZQ"
  },
  "R8OJNf2upbRcOlxHcYh7eg": {
    "date": "12/16/2016",
    "text": "The atmosphere is excellent. They keep it warm, the music is usually pretty good, and the espresso and drip are really outstandingly good. The coffee places they get from are high-end local establishments.   The food and snacks are also pretty good.   Really, this is a place for two - four friends or family or friends and family, to get together and while away an afternoon, in winter with a bean drink, and in summer with an iced version of a bean drink.   The two friends option does imply this, but I will explicate: Excellent for coffee dates.  They also serve cheap hot mixed coffee/booze drinks  - so if you like day-drinking/brunch-drinking, this may be your temporary home for those occasions. I value the times when I've had a few there with family more than most other social occasions.  Not rowdy. Never too busy to find a seat, never empty.   5/5.   p.s. customer for 10 years, late in getting to write the review. p.p.s. I am aware that it has changed from a kind of sprawling, hyper-edgy substance-abuser haven into a compact hipster coffee joint. Love it just the same. The coffee is excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FD36gUY-9Fqy5a5089-7jg"
  },
  "LaVLAK27OXY9M2egdtERdQ": {
    "date": "4/21/2016",
    "text": "I love this place. Great vibe and atmosphere. My only complaint is that it's not closer to where I live!  Free WIFI. Tasty lox bagel. Awesome iced coffee.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KBvwyWPKHegQ4zatLl8OZQ"
  },
  "qU5MufQsHp5wnsXtj9UgTQ": {
    "date": "5/20/2016",
    "text": "Nice little spot.  Not a huge coffee person, but the drinks were good enough.. we came in during off hours and the place is nice and charming.  A few people were there working and casual chatting took place.  A very nice barista gave us tips on some places to check out while we're in town.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GMeYzbl_kvY0dGZeA4Lfvw"
  },
  "4PupkudVPjVLlWlxzd6EVg": {
    "date": "10/31/2013",
    "text": "In my right, cynical, blue-collar, anti-bohemian mind, I would resent The Beehive as I did back in the 90's when it stood in a more spacious Oakland locale where movies ('Forbidden Planet' for me) and even live concerts (a past-expiry Nazareth gigged at the old 'Hive!) and indy pro wrestling cards could be caught there. I came to the South Side incarnation with a date 6 years ago in an attempt to escape an early May heatwave. An expensive phosphate beverage rinsed my throat of an arid panini that took far too long to reach my table. Service was provided by a duo of detached, indolent hipsters.   However, today, I'm forgiving them for a sole reason: The Beehive provides quiet, eclectic refuge for those who are stranded on Carson Street on an insane Saturday night and refuse to booze it up in any of the infinite bars that infest the area.  I didn't care that my brownie (brought in from elsewhere according to the...barista?) was a tad stale. The purposely chintzy interiors, which looks to have been decorated by Fred Schneider of the B-52's after ransacking my deceased grandmother's kitchen and living room, only amused me as did the attention-seeking, pink-haired patrons who were trying very hard to appear self-absorbed or engrossed in whatever they were looking at on their laptop computers. The graffiti that overwhelmed the bathroom walls made me chuckle whenever I wasn't reading something bigoted and hateful, which thankfully was outnumbered more than sufficiently by the witty and the blithe.   The ennui of the heavily-inked gal bothered me not a bit, either. I'm sure it is boring to work at the Beehive during a time of the week when people party stupidly, and for that, she should be thankful. Knowing what I know, I would be.   Hey, it's better than 'Buck's, y'know? After all, what national coffee chain has a Heavy Metal Vinyl night. Oh, I got some of my own, rarities that is, and I'm headed down one of these Wednesday evenin's with somethin' like this under my bicep...  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D-P5GwgvCx2c&s=3f5d0bb701f3554fc63a3d5749ce95c51850e68c6b6ca6dc8590257a72eb0b5d\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=-P5G...</a>  P.S. Happy Halloween to yinz all. I used to have this on vinyl, but it was reissued on CD, and my tradin' fingers were itchin'...  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DOEEHvdGCmsw&s=079266dd3192d60d8c051b6f6a19bebb3da2d468e7d149728b87688633b16608\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=OEEH...</a>",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 10,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "OndNtPXMsqMPuwbf1WmdVA",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Italian Watermelon Soda. Refreshing.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OndNtPXMsqMPuwbf1WmdVA/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "zZFY0AerKB1U2pYIjrMNug": {
    "date": "9/4/2016",
    "text": "Short answer:  Avoid at all costs.  Terrible service and terrible patrons.  Long Answer: I came on a Sunday of Labor Day weekend with three friends.  We had (one each) their coffee liquor drinks and stood in an empty space due to there being no tables available, despite most of them being occupied by single patrons.  After 5 minutes one of my friends observed that another patron was staring at us.  I suggested to not worry about it since we were in a coffee shop atmosphere after all, which is expected to have a level of chatter.  That comment resulted in curse-laden verbal abuse from said patron, which we subsequently handled with calm converse.  If you'd like absolute silence, please seek out one of the many libraries Carnegie invested in.  I reported this abuse to the host, who told us to leave.  This is unacceptable behavior.  Were we non-paying neer-do-wells this would be reasonable, but the reality was far from that and our treatment was accordingly absurd.  If you love being accosted by asshats with macbooks for saying hello and kicked out by the establishment, please consider spending your hard-earned dollars here.  They'll probably throw in arbitrary BDSM for free.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Aw5vDEscbDzABHxkCFOLGg"
  },
  "cvRl6EyNCM5ELVlRa4CVzw": {
    "date": "3/26/2015",
    "text": "I always hate to do this, but I feel the need to update my previous review and deduct a star in light of my experience here this past Sat.  Although I'd been to the Beehive several times before, I never realized that this coffee shop has a split personality. How, you ask?  Well, as I learned this weekend, past 10pm on Sat. (and presumably Fri., as well), the Beehive serves as overflow for the bar next door (the Rowdy Buck), which is presumably owned by the same owners.  I learned about the Hyde side of the Beehive's personality when CM and I, who'd been there since around 8:30pm, were unexpectedly carded by a bouncer from the bar next door at 10pm.  CM, confused, pointed out that we were sipping on hot (non-alcoholic) beverages, to which the bouncer responded that he had to card us, per the rules of the establishment.  We obligingly got out our IDs, but were confused as to the purpose of the carding, since we'd already seen the barista ID someone who ordered a beer at the counter when we ordered our beverages shortly after arrival (the Beehive serves some alcoholic beverages--not sure if this is only during certain hours--but regardless, they were serving long before we were carded).  Soon enough, the reason for the generalized carding became evident, as noisy revelers from the bar wandered in via a doorway between the two establishments to hang out by the barista stand.  Unsurprisingly, as more of them graced the Beehive with their presence, the noise level rose exponentially, driving the people trying to get work done out to seek a quieter and less chaotic refuge.  As for the drinks, CM and I were unimpressed.  I ordered the mate latte, which sounded interesting, but tasted rather bland and monotonous.  CM ordered his coffee shop standby, a cafe au lait, and was not a fan, placing it at the bottom of the ranking of the four indie coffeeshops in PGH he's tried it at to date.  I also ordered a slice of the flourless chocolate cake, which, in contrast, was excellent--very moist and chocolatey, without being overly sweet.  However, I'd guess that like most coffee shops, the Beehive procures their desserts from elsewhere--although I may be mistaken, given that their name is actually Beehive Coffee and Dessertery.  To make a long story short, I'd recommend avoiding the Beehive after 10pm on Fri. or Sat., when if effectively serves as an overflow hangout for revelers from the bar next door.  At other times, I'd still recommend checking it out for its characteristically quirky ambiance and delicious baked goods, even though it may leave something to be desired in the hot beverage dept.",
    "rating": 3,
    "rated": {
      "funny": 7,
      "useful": 11,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "3H9GEeQhP9P4x9kDl38rwA",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Mate latte and flourless chocolate cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3H9GEeQhP9P4x9kDl38rwA/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "ZULgZckxhDDmviKtgY7bFw": {
    "date": "10/29/2015",
    "text": "I don't understand why people give this place a good review, unless they are all fake.  Beehive used to be a good place in the early years until the greedy owners added rowdy buck to make more money selling alcohol. This is not a coffeehouse and \"dessertry\", more like smelly dumpster next door to a bar with the attitudes to match.  The people working are short-changing bartenders than baristas.  Unfriendly, often talking to each other instead of helping the next customer. The seem to be the high school dropouts that steal to make tips. I got the same type of medium tea four different times and was charged a range of prices.   The same 1 Medium tea went from 2.00, 2.43, 3.00 to 3.25   When questioned, different ladies said things like \"Oh that's always been the price.\" to just a shrug and \"Sorry\". It was completely unprofessional for any business owner to allow such poor customer service and unethical practices.  I'd argue that the Southside Chamber of Commerce and the community should get involved to stop places like this from spreading.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S9QkLLuT6svf3PeMBK2B-w"
  },
  "-8PftN7f2nPuvZ2ecWe94w": {
    "date": "2/14/2016",
    "text": "Cool coffee shop (right across the big brand coffee) this place is great to hangout, have good time with good coffee. Love the music, Love the art inside. I had \"Maxican Hot Chocolate\" for the first time here and it was fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-cDVTA9W4MTdlTFX9LQCzw",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-cDVTA9W4MTdlTFX9LQCzw/o.jpg"
      }
    ],
    "user_id": "lt9sIta4UkOZgztPuClxfQ"
  },
  "_yv9YdQyVRp67EvOpT0Yww": {
    "date": "6/20/2013",
    "text": "Coming from Boulder, CO... This place immediately felt like home. With added street toughs patrolling the alerts outside by the river. Awesome.  In the later evening, the place converts from hip-artsy coffee shop into a veritable rave club/low key chill out place.  Sam is amazing behind the bar and whipped up imaginary drinks with ice cream, espresso and various and sundry spirits.  While working away on my laptop the vibe and energy of the place was amazing.  This should be a required stop for anyone needing a place to chill out in the evening while travelling to Pittsburgh.  Trust me, you won't regret it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "46xL4wj2XzoMbBTDnzcVUg",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. View from the window alcove table looking into the bar area.  photo doesn&amp;#39;t do it justice, this place is just amazingly chill.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/46xL4wj2XzoMbBTDnzcVUg/o.jpg"
      }
    ],
    "user_id": "z-XlA8-SQZsWfVNqXbtvYg"
  },
  "CvvzHiIMCKL6_s7RxiTgnw": {
    "date": "12/30/2013",
    "text": "We saw an open coffee shop late Friday night and thought it'd be a great place to let our ears relax a bit from the loud music in all the bars.  Well, someone carded us at the door, hah. It's attached to the Rowdy Bar next door and they serve alcohol past like 9pm.  So that made for an interesting experience. Not surprisingly the place was mostly empty - thank goodness! They had $3 irish coffees, so my friends and I split one. It was pretty good.   I actually am pretty biased against mismatched furniture and whatnot, but this place had nice tables lined up and the decor was kinda retro and quaint. Seemed like they tried too hard for the effect, but I guess in the end it works okay. I'd enjoy getting work done here during the day for sure.   Wish they closed the door on that loud music next door (It's attached to the Rowdy Buck). But otherwise very unique place to have tucked between all the loud bars, if you need a minute to hear yourself think.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jXX-G_goCYZZrLSDY8qXdg"
  },
  "aQuoV3oCnGjk0J3wDLiArg": {
    "date": "8/29/2015",
    "text": "After hearing so much about this shop, I decided to wander in with a few of my friends on a summer afternoon. The decor is eccentric and a little outdated but it has personality and charm for a younger crowd and I liked the dimly lit atmosphere. The barista working that time was attentive and very kind, willing to help with recommendations. She Also was very quick at cleaning up tables and multi tasking which was super commendable since it appeared she was the only worker there. I was attracted by the gelato dome desserts but opted to get a honey pesto spinach wrap instead since we hadn't had lunch with a cocoa to follow suit.   First the wrap was very large they really don't skimp on the spinach but they lacked chicken and the dressing was super sweet. Way too much honey and the pesto was barely tasted. Wraps also can't be pressed very well (it was quite huge) so it was a bit cold.   The hot chocolate I received was also not very chocolatey at all. It was mostly milk and cream, but this is my fault since I should have specified I like it chocolatey. It was also not very hot? It was just a long period of warm which had me quite confused and would have been fine if the drink had more flavor.  The sofa we also sat in on the round corner table had a large rip in it. Did someone get hungry after hours? I was also expecting a larger cafe but it was adequate I suppose.   I'll probably update this review very soon though, since I didn't get the gelato this time around and I heard it's the dessert that makes this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ObFg3cZX6wexRBlAXE_G7A"
  },
  "rrwUC7RIDWv_JlEVA19dnw": {
    "date": "1/8/2019",
    "text": "Beautiful atmosphere. I was in the area on business and found the previous yelp reviews highly rating it.  I am sad it is closing but glad I got to visit. I got a latte and gunpowder tea which were both excellent. I sat in one of the comfy chairs and just read and people watched for an hour. The paintings were interesting and wish I could have been able to see it more in the 90's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "imeeSvooO_suAmk2zNGUSg"
  },
  "t4fksdoUbFVnb9NCIuzvLw": {
    "date": "12/15/2018",
    "text": "I'm absolutely heartbroken that we're losing the Beehive later this month. While I wasn't a regular (just due to its location vs. where I live), any time I did stop by it was a delightful spot to be in. We're talking good cafe-style food options, summer smoothies and specials, great coffee and tea mixes...all served in a brightly colored, cozy little shop that almost looks like it belongs in a movie. Hollywood loves a fancy/eclectic coffeeshop set, right? Complete with a separate cocktail menu, I might add!  During my last visit you could admittedly tell that the place needs some TLC, probably because its close date is approaching and the staff isn't really fixing every scratch and crack in the shop. It's a shame, but it's understandable. It certainly didn't get between me and my enjoyment of an amazing mocha. And I made sure to sit in a window seat while drinking it - because in all coffeeshops (but especially in South Side), people watching is half the fun!  Seriously though: I think I speak for many of us when I say thank you for the memories, Beehive. The coffeeshop market may be oversaturated these days, but you were truly a unique option on that market, and you will be missed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "c6PhpOnZAXBMdwLwDQOHqA",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/c6PhpOnZAXBMdwLwDQOHqA/o.jpg"
      }
    ],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "SuXAmEUdfnoTrv2r1U6qCw": {
    "date": "2/10/2019",
    "text": "Delicious coffee, eclectic and cozy atmosphere. The staff is always friendly and accommodating. This place is a little wonder for sure. I enjoy that the place celebrates so much art work and quirk. The place is supposedly closing soon though and that's a shame, get here while you can!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H_kLuU1AlusIt6uUML8M9Q",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. My cafe au lait and a little bit of the atmosphere.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H_kLuU1AlusIt6uUML8M9Q/o.jpg"
      }
    ],
    "user_id": "O9sVTwjknS_JEIizg11MMQ"
  },
  "zAD6DshrmOrnvFpqGgCYJQ": {
    "date": "8/20/2018",
    "text": "I love this coffee shop. I go here to study multiple times a week and it is the perfect place to do that it stays pretty quiet and the drinks and snacks are reasonable. I usually get the black iced tea and I love it. I've got the pepperoni rolls and feta spinach pies which were both delicious. They changed their restrooms to gender neutral which is awesome because the 'guys' bathroom is way cooler than the girls bathroom I definitely recommend checking it out haha!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xRFPqnPbOrZAkoomXqRW-Q"
  },
  "Z5HNBE7EKrnmjuWhQuArvQ": {
    "date": "11/27/2017",
    "text": "Great latte. Staff friendly.  Cool interior, nice seating. Unique bathrooms. Good coffee on Carson.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QKqayQOesGYUEk9B16O6sQ",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Latte",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QKqayQOesGYUEk9B16O6sQ/o.jpg"
      },
      {
        "img_id": "--Ow6QdoDHT4nY16fzq5Vg",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Interior",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/--Ow6QdoDHT4nY16fzq5Vg/o.jpg"
      },
      {
        "img_id": "nLQls60qicIzYYZyJRTFcw",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Bathroom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nLQls60qicIzYYZyJRTFcw/o.jpg"
      }
    ],
    "user_id": "ic-tyi1jElL_umxZVh8KNA"
  },
  "mVwK6C_pE0g_Z_s34r4BbQ": {
    "date": "3/1/2017",
    "text": "Living in Pittsburgh, we all know that you've got to take advantage of warm weather in February! Last weekend we had some unseasonably nice and sunny days, so my boyfriend and I decided to stroll around the South Side. Beehive is an awesome place for a light lunch and coffee or for cocktails. We did a little of both this past weekend, ordering pepperoni and egg paninis and a couple drinks. Their food menu isn't extensive, but there are some decent options that'll fill you up.  I've been here several times before this last visit, and it's such an eccentric and cool place! One of the most notable things about the place, I feel, is the artwork on the walls and ceiling. You will always have something interesting to check out while visiting!  Aside from the cool scenery, the vibe Beehive gives off is pretty neat. You can sit in comfy chairs at small tables, or you can sit at wider tables or booths to accommodate a larger party. I've seen people there that are doing work on computers while sipping a coffee. We ordered some Irish coffees, which were hot coffees with Bailey's and Jameson. Next, we got a couple toasted almond coffee cocktails. All in all, my only suggestion would be that the staff were a little friendlier. They are never rude, just could be a little friendlier! Beehive is a great stop for a date, hanging out with friends, or just for a quiet night to read or get some work done. I'd recommend it to anyone passing through the South Side looking for a unique spot to try out!",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 11,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "1QHXiarUeaD-OymvJZMljw",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Love the art",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1QHXiarUeaD-OymvJZMljw/o.jpg"
      },
      {
        "img_id": "JYGEmTpmnmZebYt4eJAw4g",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Toasted almonds! Not sure what kind of liquor is in there but it&amp;#39;s good",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JYGEmTpmnmZebYt4eJAw4g/o.jpg"
      },
      {
        "img_id": "G5Yj-iaJWOOAjIhtHBVFJQ",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. Coffee cocktails and egg, cheese, and pepperoni paninis!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G5Yj-iaJWOOAjIhtHBVFJQ/o.jpg"
      }
    ],
    "user_id": "1VVHf1BvtGC0aSCCIjQyiA"
  },
  "LG6bPCLe8z4kYbtooGP4UQ": {
    "date": "8/23/2018",
    "text": "Cute unique coffee shop with bakery items, a lot of tea options, and great coffee selection too. Great staff there also. Right at the end of South side!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N657YsSiqLXd-FAGXHB--w"
  },
  "mHev725KejHQem7aLRE7wg": {
    "date": "6/3/2018",
    "text": "I stopped in here for coffee on a Saturday evening. The ambience of the place is cool and there's some interesting art displayed. I ordered a cappuccino. The barista was not very friendly and the cap tasted burnt so I doubt I'll be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gH144bG_roPadHLjHag-cQ"
  },
  "YEbjx-0e7OxZGyf0va6sbQ": {
    "date": "8/7/2017",
    "text": "Great coffee house!  Here's what I like: - The COFFEE is excellent.  You have many choices, and mine was full-bodied, but not bitter.  The milk in my latte was properly steamed, and not too frothy.  I've had a mocha-latte, and the chocolate is a great, semi-sweet, dark chocolate, not the super-sweet syrup some coffee houses use.  It's the best mocha I've tasted in maybe years.  - The setting is great, comfortable, and inviting.  I like the mismatched mix of chairs, which includes some office side-chairs.  The employees are very comfortable with my settling in to have a long chat with a friend or colleague, without that rushed feeling I get in some places.  - Employees and service are great.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 8,
      "cool": 8
    },
    "photos": [],
    "user_id": "yVMvS4Q7JTxHALm8CTwSZQ"
  },
  "xiM-VTSOT1_jDQZqY88wHw": {
    "date": "7/29/2018",
    "text": "This place is the tits. Their drinks are all carefully made and well executed. I have a tendency to ask the barista to make me whatever is their favorite (I know, I'm that asshole lol). He recommended his current favorite drink which was a latte with almond flavor. Excellent choice kind sir. We also got on of the beehive honey macchiato, and a raspberry pastry that were excellent as well. Happy to stumble upon this place. It has a great vibe, very artsy, and comforting. Reminds me of my hometown.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "m3xwVvirZao9_CMkVsHY_A"
  },
  "_VC3lzqhoRonrgJpUI26pw": {
    "date": "4/13/2017",
    "text": "I've been frequenting Beehive since I lived in the southside during my crazy college days. There's been a few changes throughout the years, but it still remains a quirky, chill, hangout spot. The decor is eclectic garage sale chic. The laid back vibe plus the right amount of seating options and electrical outlets make this an ideal spot to get some work or studying done. They do serve alcoholic beverages, so I'm guessing it gets a little more rowdy as day turns into night. I've never been here past 7pm so I can't actually attest to that, though.   Beehive serves up mate lattes, one of my favorite hot beverages, so bonus points for that. Not the best mate I've ever had, but pretty darn good.   They also offer up a pretty good selection of food, sandwiches, soups, wraps. A lot of vegetarian options!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "DtzguIRjy-oRbrwVidAxQQ"
  },
  "Ta-rBNsZEpqy3V6VlkIf8Q": {
    "date": "5/25/2017",
    "text": "Jeez I've never reviewed? Swear I have. Been coming here since they opened in the 90s. Anyway what can I say? I'm a lover! The coffee is always spot on as is service.  Great spot in the heart of South Side.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "iS1B4V8G-NbiVvr8o2XtIQ": {
    "date": "2/13/2017",
    "text": "Super chill place to meet or work. Staff is friendly.  The hot chocolate is super awesome. Everyone likes the coffee and they have beer and some alcohol. I love the vibe at this place.  I pretty much hang out there at least once a week.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SHyWxJxb-mKiNgHPUSu3_g"
  },
  "9_wVQ4CGbPkuiDTAKTSvzA": {
    "date": "12/31/2016",
    "text": "Stopped in for an Irish coffee. 5.50 is a great price, and it was made with Jameson. Fast service, tasty drink. Review edited. Bathroom had shit all over the seat. Dropped from 4 to 1 stars.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a2I6poXbSvOu4nxtfrFSSw",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/a2I6poXbSvOu4nxtfrFSSw/o.jpg"
      }
    ],
    "user_id": "qPBjzaanyz4jQKDpzA47UA"
  },
  "TC8BTDsMQBewDfYbWibAYQ": {
    "date": "3/12/2018",
    "text": "This is a neat place. Very chill atmosphere and eclectic decor. Coffee menu is basic, which is refreshing. They have alcoholic drink menus about. I didn't have any of that. Just a hot cup o' joe and sat at the window table to watch the city.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J43IUa9TjjEKFbyTSZALCg"
  },
  "23NTLinaNy6CiMve8Qb7iA": {
    "date": "1/2/2016",
    "text": "I remember the days that the Beehive was double its size. Even though it's a little smaller than it once was, it's still just as delightful to stop by.  On my way to a meeting I stopped in for a quick lunch, ordering a chai tea and a tomato mozzarella sandwich. The chai...man, I haven't had a great one of this in a while but this one was it! The sandwich was also a pleasant surprise.  Great vibe, pleasant staff--I can't wait to plan a work session here soon!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "NxtYkOpXHSy7LWRKJf3z0w"
  },
  "vrDKunvpKjKZQyKRiJwZmw": {
    "date": "10/9/2014",
    "text": "The Beehive was hands down my favorite coffee shop in college. That's certainly not the case anymore.  Back in 2006-2008, there were three spacious rooms to sit in, eclectic furniture and art on sale, a great mix customers, with older locals alongside college kids, and reliable Internet access. It was a go-to place whenever a few friends and I needed to get school work done. We'd sprawl across a table with our laptops, sipping on coffee and picking up snacks.  I can't see it being a really effective study place now.  The quirky decor hasn't changed, but a lot else has. Two of the three rooms that were used for seating were closed off, so that a bar could take its place. (As if there weren't enough bars on East Carson Street.) The remaining room is very long and narrow, and feels crowded. The decor, which has always had 90's bohemian feel, just seems kind of dated. They've also gotten a liquor license, which I think brings in the wrong kind of crowd for a coffee shop.  Of course, a place like this should really be rated on the coffee and food, but my two visits there this year were sub par.  One of those times I got a veggie hummus sandwich that was pre-wrapped on display in the fridge, but it was squished and didn't taste very fresh. The other time I got an iced coffee, which I immediately regretted buying as soon as I took a sip. It was extremely watery and had a peculiar aftertaste. I wished I had just gotten a drink from Starbucks or Big Dog Coffee on Sarah Street instead.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0JIiQelaItruoV6F9pWHvw"
  },
  "tT-54AZMqdxwbJkdnhFiqQ": {
    "date": "12/29/2015",
    "text": "I've been to Beehive a few times.. mainly because rowdy buck would get crowded during a night out, we'd sneak over to Beehive for some peace of mind. I never had their coffee at that time.. only mixed drinks.  Bobby randomly said it would be fun to get a nice coffee last night around 930pm. We literally live a block away from 2 of south side's popular shops, but they were both closed. Thanks to my trusty yelp app, i found out beehives hours and we headed to get some coffee!  Initially, i planned on getting a nice latte.. you know large coffee cups with art in the whip cream.. but then we remembered Beehive had coffee cocktails (and spiked milkshakes)   Bobby ordered a traditional Irish Creme. You get to choose if you want well whisky or brand. (only a dollar or so difference) I went with the Toasty Almond (coffee, amaretto liqueur, hazlenut liqueur.. The barista asked if we wanted more coffee than alcohol. We asked her to make it normal.   After trying the drink, we were both surprised how strong both drinks were. To be honest, mine was so strong i could only enjoy a few sips. Bobby ended up finishing mine. Next time i'll be sure to tell the barista more coffee! lol  The reason im still giving Beehive 4 stars is because its honestly pretty cool. The vibe, atmosphere, drink menu & barista made up for my drink-- im not gonna complain that a drink was too strong. im just a f* lightweight! haa",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "_0bczSyoD36fl4110UtnOA": {
    "date": "4/20/2016",
    "text": "Very nice little local coffee shop. I have had some of the muffins and treats, but never ordered a meal there. The food I have had there was always good, but I go for the coffee.    If you are looking for a nice little local coffee shop in South Side, this is the place you are looking for.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9ofvsq_VFSpdLeKrH5CZA"
  },
  "ovRJQ8mspPu8yxD22e6_TA": {
    "date": "3/4/2018",
    "text": "There are very few restaurants that I like to complain about, but my friends and I went one day and no sooner did we leave...my friend and I got food poisoning. We called to let the people know, and they said it was impossible and it wasn't their fault. Their customer service was ridiculous, and I will never be visiting this place again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uc68QR1WQk0kwhNrFa-K_A"
  },
  "y7CYRvirQkHz-aDqJJNMNQ": {
    "date": "11/1/2011",
    "text": "The Beehive is one of my favorite coffee houses in Pittsburgh.  Such a relief to come here - so unique and quirky compared to Char-bucks.  Great place to get work done.  Today I got a small house coffee (dark roast) and one of the best chocolate chip cookies that I have had in a long time.  Current renovations are going on - this place is huge with big mulitple rooms.  Pinball machines and board games and interesting lamps are scattered throughout the place.  Great music also.  Thanks for the buzz, Beehive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DRM55UkBHkjt-1CQSky9TQ"
  },
  "F4ygDNfkQdQiCLT8424KRA": {
    "date": "6/27/2009",
    "text": "Spacious local joint serving the typical coffee shop fare to an eclectic mix of folks.  Comfy atmosphere with lots of art and bright colors.  A great place to sit and study or to stop and relax while walking down Carson Street.  Cash only.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iNV_dTKaxit6ZkvbRfERdQ"
  },
  "fghhRcx3uuZDkrKJ7L7aGg": {
    "date": "1/15/2008",
    "text": "Staff is cute and friendly. Coffee is meh. If you sit anywhere near the smokers, the coffee starts tasting like cigarettes.   It's definitely \"cool\" and has that vintage retro hipster thing happening.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dHKq-j3rNwNDKQ0xGXRCdw"
  },
  "gmXhq0FsqTQUtdYH-VzS4A": {
    "date": "3/27/2010",
    "text": "Time for another update.  I went to the movies at the Manor with three of my girlfriends last night.  Two of them have kids and had to go home afterwards, but Sherry and I were still up for something else.  And with all the great coffeehouses right by the Manor, naturally we trekked down to the Beehive!  It's still a cool place as ever and we got an intense game of Candyland up!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "UtkjXTiMfGRz4R1zDF3Kxg"
  },
  "R4bdP-8FKEXQrMzTEVfrUw": {
    "date": "3/11/2009",
    "text": "Hipster Haven.  Doesn't open early enough ... coffee shop for those without real jobs.  Cold Service.  So-So Coffee.  .... but hey, we all need a cup of joe sometimes, just try not to let the jobless hipsters up set you.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SNKK5eiIjMYiPqU5BcAfJg"
  },
  "-Ma1-NWIikF-_UtCGdfJ9A": {
    "date": "8/20/2011",
    "text": "Tied for favorite coffeehouse in the Burgh.  Great place for meetups.  Love their hand-squeezed lemonade.  Great tea.  Quirky and fun, with plenty of wifi to boot.  A tad bit grungy, but that's kind of part of the experience.  Street parking can be challenging, and stop at the ATM because this place is cash only.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y81808aeGu5YuZSaDiFC8A"
  },
  "VPieEaCnLD9__S0HhQc7bQ": {
    "date": "2/8/2011",
    "text": "Last summer in Pittsburg I stumbled upon this gem. Imagine a 90's punk coffee house with pinball and beer. Snacks and coffee also. 3 pinball machines for your enjoyment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7j2qu1qaO5H3p3Eshpxo7w"
  },
  "ncBJ0cKQ7-IPHWMyzV9-cQ": {
    "date": "3/11/2010",
    "text": "the beehive, like for so many, holds a wealth of memories for me. it'll never grow old.  it's one of the only/best coffeeshops in the southside. it occupies three large rooms and a lovely little backyard area. the third room you can smoke in if you're 21 (they now sell alcohol which is a little weird but I guess gives them another dimension). the bathrooms have lots of grafitti for that lived in and loved feel. it's generally quiet and a good place to get work done during the day. they have good sandwiches and snacks. free wifi. a vending machine with cigarettes. lots and lots of seating and old tables and chairs that I love.  this place is really splendid.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RMrWegRjr3gn_g7fOLxHRA"
  },
  "p20VDrJLCY-4MQZteG1nEA": {
    "date": "12/11/2012",
    "text": "You're a coffeehouse.  You charge almost $2.50 for a cup of coffee.  It should not taste like Maxwell House that was brewed seven hours ago.  Period.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DOa_TMWFib5ISs7cpQHANA"
  },
  "2pY_AzVavpQwT_ZVXmgdOA": {
    "date": "1/6/2007",
    "text": "we are blessed by the beehive. so much character and so many tables. a quiet room too.   definitely a great place for hanging out with friends or studying alone. this place ups the coolness factor of pittsburgh and the southside by like 20 points at least.  smoking is allowed here so bear that in mind.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "s9m1lSJyedtZRJSuQBE5HA"
  },
  "fVfkyuGS4PoFsiQGsoHu3A": {
    "date": "1/19/2007",
    "text": "The Beehive is like a hip community center for the South Side.  This is a great place to have informal meetings since there is a lot of space and tables to sit around and talk.  There is a bookshelf with some board games in the middle room which I confess I have never actually played.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "E2zjGaZpywKNUbNYdcrxmA"
  },
  "b01lA2jpgJPueo60G1nhIw": {
    "date": "7/28/2008",
    "text": "If it weren't for the obnoxious high-school hipsters that hang out here, this place would be perfect. I love the way it's decorated, even going to the restroom is a fun experience when you read what has been written on the walls... It's colorful, a fun place to hang out with friends. My only other complaint is that I wish  they would only serve what they are really good at making / specialties... I once saw that thai ice tea was on their menu and when I ordered it the cashier told me that it wasn't that good, or wasn't home-made or something... which really strange because I didn't even ask...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "swhSaoVpqti8k3rOPF-uvw"
  },
  "XX3HV0XEGyGm9pwxtaaXEQ": {
    "date": "6/12/2009",
    "text": "OK. Seriously just OK. Coffee was luke warm. Service was icey cold. Maybe if I had dreadlocks or piercing in multiple orifices I would get a \"hello how can I help you\".  The poor attitude is offset by the free WIFI. Nice large table make a good work surface to study off of plus there are many tables and three rooms. So for studying or computer stuff it's great but coffee and service is lacking quality.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "bDGC2QHZ6t_is1olLGgoWg"
  },
  "_qKigwjpKV-SnbU9Jxpgzg": {
    "date": "2/12/2010",
    "text": "I would like to give this 3.5 stars, but I round up. The Beehive is everything a quirky, eclectic coffeehouse can be and should be. Their prices are really good, and I can usually get drinks under 3.50. The trustifarians make me seem square (cuz I always thought I was somewhat hipster), but it is a pretty legit hangout place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CzKDjQdYk2j0ZFxxWspwIQ"
  },
  "dRqSXcO2w0E8edC-kuWe8g": {
    "date": "5/3/2010",
    "text": "I made my first visit to the Beehive today and was very happy that I stopped in. I am visiting from Chicago where the indie coffee shop is close to extinct so i was happy to find this place as it reminds of my old, long gone haunts.  Keep up the good work Beehive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vv3cnVRyr-5GX4aiZRIUcw"
  },
  "XzKAq4lcUB1qqpx7gTF2wA": {
    "date": "9/26/2008",
    "text": "yeah not bad.  very Haight/Ashbury-ish, every corner to this place has got something interesting to look at and observe.  a lot of colorful characters, if you don't mind that sort of crowd.  the guys behind the counter are very cool, the tea was excellent, but the coffee was so-so.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fbRMmFednuhoWTM_Tgr54w",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fbRMmFednuhoWTM_Tgr54w/o.jpg"
      }
    ],
    "user_id": "XE-shfXSAOcLZGS14j48YQ"
  },
  "PPuMf7pVaD2jfbp3vsqQiA": {
    "date": "12/16/2008",
    "text": "We tried this very neighborhood coffee shop on a Sunday morning during a quick trip to Pittsburgh.  Gee, we wish we had a place like this closer to home.  (Well there are places like this close to home but it's a good line anyway)  My wife is the coffee expert and she pronounced the triple shot latte just to her liking. (aromatic and smooth and smoother than that chain place across the street) Of course it was 25 degrees outside and the coffee cooled off quickly upon take out. But inside it was warm and cozy.  The shop occupies a corner plus about two storefronts more, making it quite spacious.  They also sell food items, prewrapped sandwiches and pastries... and t-shirts and mugs and coffee beans by the pound.  I especially liked, ambience wize, the little table and chairs in the window, and the \"circular\" couch which I imagined would be good for group meetings while sipping coffee.  Also humorous was the other funiture, a mix of every decade it seems, and one table just like the one I had in the kitchen when I grew up in the 50's and60's.  Nice artwork on the walls, so , go to the Beehive, they deserve your patronage.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wAl4uDus-xDPXw_8zfxFDw",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. eclectic tables Beehive",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wAl4uDus-xDPXw_8zfxFDw/o.jpg"
      },
      {
        "img_id": "EnDTms-nSwjmFxdXnu55xg",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. be seen in the window",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EnDTms-nSwjmFxdXnu55xg/o.jpg"
      },
      {
        "img_id": "MDO7rJDPHvTbjXx8u9jYXA",
        "caption": "Photo of Beehive Coffee - Pittsburgh, PA, United States. food in display case",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MDO7rJDPHvTbjXx8u9jYXA/o.jpg"
      }
    ],
    "user_id": "wWb3VOtFD2zI9ileM_ulBw"
  },
  "t114zee8OI5COd-qDtaLLQ": {
    "date": "12/31/2010",
    "text": "what a cool place! I spent many happy evenings here drinking coffee on a visit to Pittsburgh. There was always music playing and the most interesting people to people watch! Oh and the coffee is great too - and not overpriced like more commercial coffee shops.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WtOhr0v13Qmas9rIbrK5SA"
  },
  "29Y3GCtaGW3k90SjfAyjWQ": {
    "date": "8/3/2011",
    "text": "NUMBER ONE CHILL SPOT!   Ever since my glory days as a \"guitar god\" at Duquesne, this place has been a home away from home for me and my homeboys...and girls!   Pinball Machines? Check! Funky Wall Art? Double Check!   Oh and have you ever bought cigarettes...out of a VENDING MACHINE!?   Whether you're chillin' with some Palahniuk or just scopin' the many indie/goth babes who frequent this artists' enclave, you're bound to be smilin' all the way home on the T!   My one complaint is that they got rid of that circular couch cushion area which was my jam zone back in the day. That was TRULY the epitome of chilling!   Did I mention the funkilicious and wonderfully wacky waitstaff? Well, I'm going to now! THEY ARE THE BOMB. Once, the guy working called me \"chief\". I laughed my butt off. It literally fell off and I had to get butt surgery. (J/K ;) ...looks like the comedic stylings of these bodacious baristas rubbed off on yours truly).",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "HBxpcQjR_1K91UJSDkP1Xg"
  },
  "IO3Kbft5UEAAuDGCYamA1w": {
    "date": "1/6/2011",
    "text": "Totally luv the Beehive!     I do like the coffee but the best part about the Beehive are the pinball machines in the back.   They have a spiderman game.. some Twilight Zone game and some Martian invasion game.. but my favorite is the  Medieval Madness one.  hehe.. its actually quite a riot.    Im saving up my quarters for my next visit.  I also love how there are a bunch of games like Scrabble, Boggle, Stratego, or Risk on the bookshelves too.  Aside from the pinball and games, coffee is good.  Their menu is somewhat expansive for a coffee shop with ice cream, soups, food et al.   Although they dont have apple cider which would be nice to have...  Beehive is pretty large for a coffee shop and great place to get some work done on those large kitchen looking tables or catch up on some reading.    Its not smokey anymore as there is a separate smoking room.    There are a lot of coffee shops but arent too many places like the Beehive (large coffee shop with tons and tons of boardgames, pinball machines, computers) anywhere. My favorite places in the VA area are/were Buzz coffee, Murkey (now gone) , Dremos (now gone) & Galaxy Hut (the last 2 are bars..).  Each have elements of the Beehive but miss the entire package.  Would love for a place like the Beehive to open up somewhere in DC area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c4J8yzlAYmTUap0TWicofg"
  },
  "p1xwwC6iVqxeHS-0DrjxvQ": {
    "date": "4/5/2010",
    "text": "I have been going to the Beehive since I was in high school, but it's not where I would go for a cup of coffee. The atmosphere is creative, but I find the staff to be a bit pretentious and the coffee to be mediocre. The crowd that usually ends up here are the ultra so hip so indie so hipster so unique and different and therefore better than you. The kind of folk that are more interested on the paintings on the wall and the cool layout than actually enjoying a quality cup of coffee and a friendly staff.   I must say the place has a cool layout. There are swings inside and they have a large space, which is good compared to the typical small coffee shop.   Wifi isn't free, so get that out of your mind. That being said, if you're trying to actually accomplish something, I wouldn't go to the beehive because the crowd is pretty young and has a tendency to be distracting. There are other coffee shops in the South Side that offer a better experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yahPcmffLfJawrtjTqKzdQ"
  },
  "8y4PwwlpfknylX9HJoQ19A": {
    "date": "3/29/2015",
    "text": "The food and the coffee was great. The real star was the bathroom. The TP was substantial, Felt like 3 ply. The action on the toilet handle was the most satisfying I ever felt. It felt like I was pulling the trigger on a launcher. You have to try it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zv0uaR7lyfqPDdq371TWPA"
  },
  "9E9m81Wqr7EG_U8RI6MEgQ": {
    "date": "5/12/2007",
    "text": "Been coming here off and on since high school!  A real South Side institution.  One of the best coffee houses in the USA, no doubt.  Three separate rooms, each with their own appeal/personality.  Wifi as well.  I do wish that the Oakland location was still around as that was the COOLEST coffee shop in the world, with the movie screen, bar upstairs and the building (now an American Apparel).  i still cannot believe that people would rather sit in the characterless charbuks  across the street and pay for sweet crappy drinks and expensive wifi-idiots.  Support Pittsburgh  business, especially the ones run by Pittsburghers!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "otCGq7DjX08YJFChnRhLaQ"
  },
  "5q_ksnGD5vtA_G8s_ZAU6A": {
    "date": "3/28/2009",
    "text": "I first came to the Beehive 3 years ago - wow! the E. Carson area changed a lot since then - traffic, parking meters everywhere, and a zillion people (where do they all come from??). The Beehive has changed a bit with wireless, more tables and chairs... but it's still a fun atmosphere with good music, coffee, and food. Excellent for sitting around with the laptop, maybe reading, people watching, and conversation eavesdropping. And yeah, some of the clientele may be \"without real jobs,\" (whatever that means...), \"hippies,\" (sorry, I live near Woodstock, NY and the people here are not hippies...) and \"goths,\" (like Marilyn Manson and the Columbine kids?) but that's what makes it fun and interesting. If you want something a little less bi-polar maybe one of the cafes near Shadyside is a better choice.   I'm just bummed that I didn't buy one of the Beehive t-shirts the last time I was here as they no longer have them. :-(",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "-PGD0QpgJyoucfviKB6Y-w"
  },
  "BDwfCmaEIaCr2CTqyWYJKg": {
    "date": "11/8/2012",
    "text": "Enjoy the \"art house\" feel and quirky aesthetic. People are interesting too. Love the name. Hate the metered street parking.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pTBL-Wq-PPcTnkb3mffIIA"
  },
  "vX3G7g5G73HO36ijgQwfnA": {
    "date": "6/2/2010",
    "text": "After a night of going to mostly so-so bars and lounges, we were in the mood of getting something to eat.  We just happened to walk past The Beehive with loud dance music inside and signs that said \"desserts.\"  It was interesting enough for us to go in to check out the quirky place.  And we got exactly what we saw: loud hip-hop music with tea and smoothie (they had cookies, brownies, and cakes as well).  People were reading and using wifi there.  A unique place for this nightlife area but it was a nice diversion compared to the rest of the bars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jw4OHr6HibJeEIMfAxc1_Q"
  },
  "NOhsqrMqvCtJUmwQNIhZQQ": {
    "date": "9/6/2008",
    "text": "If only we had a place like this in Chicago...3 big rooms, diverse crowd, fun kitsch/pop art, lots of chair/table configuratinos, computures, laid back atmosphere.   Unfortunately lot of smoking, which I guess would drive out the hippies and goths there if it were banned....so maybe it would be a bad transplant.    I could live and work in a place like this were it not for the smoke.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bs_FiiqQNyUg6Fh_WqyLyQ"
  },
  "-o-ii9xaYGYQQQO8tqV8pA": {
    "date": "10/18/2008",
    "text": "Came to the Beehive for a bite and looking for a place to get some work done.   Food: Okay selection of food. Mostly light meal oriented w/ panini and sandwiches. Lots of cakes and baklava.I got spinach pies- which are decent.Beehive roasts their own beans and coffee is pretty good.  Atmosphere: ranges from eclectic to careless and haphazard. I wish  I hadn't come here to work. There are very few places set up for a single person and way too many mismatched, klunky chairs in this place. I almost never say something like \"I wish I had gone to Starbucks\" but that's the lash back response I'm having to the overly quirky set up of this place.  Price: reasonable. I bought two spinach pies and a cup of coffee for $4.70.  Payment Method: watch out! Cash only.  On the scale of one to ten (ten being way too much quirk) of coffee house chaotic-ness this place earns a 9. If you're ten years younger than me (I'm 27) you might get into it though. it seems like a reasonable place to go after you've bought some punk gear, had an underage-beer, and need to spend that last 5 bucks of your allowance.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5sPUDsdIxNNGfjsLrdLuCA"
  },
  "nR6oz9t_Jen4MqPo2Tcztw": {
    "date": "5/31/2012",
    "text": "The inside of the cafe is neat, very artistic..and according to our hotel shuttle driver, the owner is the artist. It's look like they have some good baked items but we didn't have any..we both ordered iced lattes...we weren't impressed...wasn't very good but doable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NpXYHTX4oB1TD1SBOWdgVg"
  },
  "Z7owcSC0u4HJJi4jt-e3tQ": {
    "date": "2/17/2012",
    "text": "Check to see if your computer picks up their wifi first. It is very frustrating to buy a beer and sit down and the wifi doesn't work. It wasted my time and a couple other people's time who had the same problem I did. When I asked him to reset the router, he replied with, \"if the music is working, the internet is working.\" and handed me the password. I didn't need the password because it was saved in my computer from visiting this place. I think I will take it off of my list for a while. Open late was a huge attraction for me, but with wifi not working, that all goes to hell.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "49SXsLMeH_Py2vC8F9ZHRg"
  },
  "9qhRJ3IWg2ywUITHop6QKQ": {
    "date": "2/3/2008",
    "text": "A South Side institution that couldn't even be deterred by a Starbucks moving in across the street. The coffee and hot chocolate are top notch, the daily soup selections are vegetarian-friendly, and the wireless access is free. I come for the cheap prices and its convenience to my work, but everyone else is there for that hipster cool vibe and kitschy decor.   Do note: Beehive is cash only, but there is an ATM located inside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PhA1ulUsy1CkMzBIDjGKpQ"
  },
  "ndvuPGFDvR6Zbcm3rq6ZZg": {
    "date": "3/22/2010",
    "text": "I've been going to The Beehive for about seven years now, and anytime I am back in Pittsburgh and hit the S.S I'll stop in. Place is great. It's definitely a huge hipster/punk/nutty natured kid hang out. Very eclectic mix of comfortable furniture, local artists' work on the walls, big rooms, plenty of space to get cozy or hang out with friends.   Love the back yard area, I much prefer smoking out there than inside. It's very quiet back there and you usually don't run into many people.   The Beehive has a very friendly staff, so be nice to them! This isn't the kind of place where you should go if you're just trying to grab a quick cup of coffee and head right back out the door. Take your time, look around, enjoy yourself. I'll bet you that you'll run into someone you know! I always do!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z7ghqh14j920qv2kcbncqA"
  },
  "-0NYCQYS4nB0D1xQv-G3aA": {
    "date": "12/29/2007",
    "text": "I remember The Beehive when it opened up in the mid 80's. I grew up on Southside and this place is kind of a historical now. When I come back into town I swing in there. Their espresso drinks are all pretty good and the food is ok.  The main reason to visit this place is the atmosphere. It is very urban and hip in nature, and has a lot of personality. Each of the 3 rooms has its own feel for sure, however the last room is a smoking room and if you are not a smoker you do not want to go in there....it is gross as hell.  Check it out for sure, as it is very Southside in feel.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FtrPXpzmQCYu1zFLhKWv1A"
  },
  "dYs2M1sB8fq7kjAXlihDfw": {
    "date": "10/17/2013",
    "text": "I don't live in Pittsburgh, but I spend a few months a year here, and I've been looking for the right place to adopt as my \"finish the dissertation\" hangout. Tonight, I popped into the Beehive, and I thought I had found my place -- great prices, laid-back vibe, and really awesome spiked coffee drinks. So, I ordered my Irish coffee and settled in to get some work done. All was great until about 9:30 pm, when the music and noise from the attached bar officially reached the \"obnoxious\" level. Seriously, am I that old?!? I mean, it's a Thursday...and it's a COFFEE SHOP. It's totally cool to have a bar next door, but why must the door remain propped open? I even closed it at one point, and then they opened it back up again. It totally killed the vibe of the room I was in. If I wanted a \"thirsty Thursday\"-style dance party complete with horny and drunk college kids in heels they can't walk in, I would have gone next door. So, now I have to re-think my first impression. I would have given this place five stars if it weren't for that issue. Can someone who works there explain this, please??",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UMS0cw3IY6wVKrLH4F2hVw"
  },
  "xOsviIwSok8AMnJDJOw1QQ": {
    "date": "2/5/2007",
    "text": "Oh how the high school Beehive memories come flooding back. When grunge was in and then out, drinking coffee and bucking the budding Starbucks trend was hip and driving was a novelty.  And now....   Coffee shop culture never really hit the 'burgh, at least not to the extent that the San Francisco cup o' joe became a meeting place for great minds and stoners alike.    But the beehive tried to untie the intellectuals, academics, stoners and laymen, and did a fair job.   They used to have movie night at the Oakland location, which is pretty fucking cool for Pgh.  I never went.  Probably because i lived in the suburbs and hated my life - but that was high school and you're supposed to hate your perfect little life at that point - no?",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l7MIIt0YoMVWAKa_QTCYkg"
  },
  "P9xEYJO34uhN1YR4unOueQ": {
    "date": "2/2/2012",
    "text": "Relaxing place to enjoy conversation or sit alone with your cup of coffee. Friendly staff, cool vibe. Great tasting Coffee in a mason jar. If I make it back to Pittsburgh, I would definitely stop by.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gSDkhYBIAJIE5sKB_AVZyw"
  },
  "SAdcvVHofdk0fAHn3J64Cw": {
    "date": "1/15/2012",
    "text": "Cool place to hang.  Last time I was there they were renovating the second room and turning it into a bar.  Things are looking up!  Coffee & bar combine to make an ultimate hang out spot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H2cLVQillJNf8KBxpLNKaQ"
  }
}