{
  "ZFc2H47N-_n6d_3SNMwc0g": {
    "date": "11/18/2016",
    "text": "Great job today - Food was wonderful and service was top notch... love your smoked wings and the donuts are amazing!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nCsH5FYeS2CHjoS5TonvZg"
  },
  "6V6Vevg6gdrEJ_snb5xn4A": {
    "date": "7/27/2015",
    "text": "My 3 friends went to robinson Smokeys and it was Amazing! One had a huge salad- i had the smoked turkey Cuban style sandwich and my other friend opted burger The food was so good! The fire roasted corn sweet fresh that after hearing about their bag of doughnuts I ordered that and coffee Oh my Gosh! Hot fresh old fashioned doughnut w choc or rasp dip sauce! I should of ordered a bag to go home! The waitress said people come in just for the doughnuts! No wonder!mmm! I had 2 left and I got home made coffee and enjoyed them. Great lunch great price & doughnuts to die for!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HgORY_l-za-s4_uwsvybFg"
  },
  "DNuuwdoiHoYzf-KXZ6wuuA": {
    "date": "9/23/2012",
    "text": "The service and staff were great - awesome.  So nice to find in today's world when not everyone seems to enjoy dealing with customers.  The ribs were disappointing - not tender and tasty - tough and chewy is not what I expect from baby back ribs.  The smoked wings were great - a different take on wings - meaty and yummy",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GcYao8ugtrbLESgajrwNRA"
  },
  "ldV8XVUFQiWMPJuwdbTgcA": {
    "date": "7/13/2012",
    "text": "I went here about 10 times when I lived in Pittsburgh.  Believe me here in Connecticut there is nowhere to get barbecue.  There was one Smokey Bones in our area and it closed up.  It was awful and should have closed, lol.  I remember this location well and miss it soooooo much!  A full rack of ribs every time, good drinks, awesome service, enjoyable bar area also.  I heard they don't serve the Texas style garlic bread automatically with your meal anymore, otherwise I'd give 5 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P0AhWEmFdfEzw-93ws61cg"
  },
  "JZnH37l2b5jOamS6wBCnrA": {
    "date": "7/23/2016",
    "text": "I often meet people here for lunch mid-week, since it is easy to get in, service is quick and food always tasty.   I find the loaded baked potato (topped with brisket) and salad combination to be a perfect meal.  I get some of the bbq brisket which I enjoy and can top with one of their four sauces while still not feeling like I've overindulged.  When I do want indulge, their half-pound burgers are great.  The smokehouse bbq burger gets me that same bbq feeling, but with the added plus of some onion straws on top and fries (or other) on the side.  Soft drinks are a bit pricey, so I usually stick to water.  They have a loyalty card program (bones club) that earns you a $20 reward after 200 points, as well as coupons (e.g. $5 off $15) pretty regularly.  Makes you want to go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3s477oiVHvdYEOmReHYmcA"
  },
  "OkYeWyfKXIeHcr4qHncX7Q": {
    "date": "12/28/2014",
    "text": "We went here on the day after Christmas, and it was a great experience. My husband and I split a meal, and they brought it on separate plates...even going so far as to split up the piece of bread. Our food was delicious, and the service was fantastic. If I lived in the area, I'd definitely go there again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aPILB3X0z3kMSmikuCwdxw"
  },
  "eTz_b8H0lRL6aw9MH3IPIA": {
    "date": "6/5/2011",
    "text": "Man does Smokey Bones work really hard on its image, harder than a teenager that just transferred to a new school even. Instead of going with a soul patch angle, as BBQ joints are wont to do, Smokey Bones sort of wants to catch some of the suburban faux hipness that TGI Friday's and Applebee's co-own these days. I mean, there ain't nothin' bluesy 'bout Robinson, a place where a dynasty of chains rule with an iron...bowl of spinach artichoke dip.   Signs with somewhat witty sayings and double entendres are all around you as are a dozen televisions, which on this night were showing baseball games, music videos, and shorts from The Three Stooges, Laurel and Hardy, and one of my heroes, Mr. Bean. I was having flashbacks of the TV room at the Andy Warhol Museum!  Hey, Kay wanted to come here, I didn't. However, being out of ideas at the moment and feeling kind of slummy and discombobulated from a busy work week, my will was as bendable as a Gumby action figure.   The Pretzel Bones were rather excellent, shockingly enough, and you get a newspaper-lined basket of 'em. They're buttered, soft, steamy, and are served with 3 dipping sauces: Sweey Honey Mustard, Creamy Queso, and Garlic Parmesan. Of them all, I kept going for the garlic most often, although the others were solidly delectable. These are the kind of pretzel rods that need to conquer the malls, ballparks, and arenas of the Americas in order to spare us from the banality of Auntie Anne's.  Wanting ribs badly, madly, I went with the Double Trouble platter, which will getcha 1/3 of a rack each of their Smoked St. Louis Ribs and their Baby Back Ribs. I tried one with the Memphis Dry Rub and the other with the Original glaze.   The Smoked St. Louis Ribs were insurance seminar-dry. They purport to marinate them for 4 hours and then smoke them for another 4. My mother makes better ribs than these, and they take her no more than half as much time to make. What is it with low-and-slow anyway? Whenever I have any kind of meat cooked that way, it often ends up losing flavor and moisture. Is a lack of proper technique to blame?   The Baby Back Ribs were much better and pulled from their bones easily, my teeth tearing through them without resistance or hesitation. I can't remember which flavor I got on which, but I had no problem with either. Both were sweet, rich; your typical BBQ sauce.   My 2 sides stole the show. The Loaded Baked Potato was as loaded as a senator getting kickbacks. The requisite sour cream, butter, chives, bacon particles, and cheddar cheese were all there in spades. The inside of the potato was ideally lush, humid.  My Creamy Cole Slaw had sass, freshness, snap, sugar, and loads of color. I could have made a perfectly fine meal out of the appetizer, sides, and some of the baby back ribs.   SB has some desserts that sound really interesting. One was a Bag of Donuts. Another was Apple Wontons. Kay wanted to share a slice of their huge chocolate cake that comes with vanilla ice cream. The ice cream was from heaven. If they don't make it themselves, I'd love to know where they get it from. The cake was rich enough but tasted a day or so old.   For a Friday night, this Smokey Bones wasn't exactly teeming with activity. We were given a large corner booth, and there were only 2 of us. I guess it ain't the place to be.   P.S. We had no issues whatsoever with the service. Our server Ash was competent, polite, friendly and brought out everything on time. We were also seated immediately upon arrival. I don't remember using the bathroom, so I cannot comment on that.  P.P.S. I'm trying to break the chain habit, I really am. They have a hold on me, though...  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DN8WGH4hc4pQ&s=e792a12f43363a17eff70e6a5c76047c80a83d0bf9ea4ba85e44ad705a382537\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=N8WG...</a>",
    "rating": 3,
    "rated": {
      "funny": 14,
      "useful": 9,
      "cool": 10
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "plQ2cF7vs32qYYD6Z2zPvg": {
    "date": "3/12/2016",
    "text": "I had the stacked baked potato and salad. Menu misrepresented item served. This restaurant has been in death spiral. Do yourself a favor and avoid.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "706LIacfILMTmX3m4ksIKQ"
  },
  "TEiDe5Qvh6_7PYNIjEM8-Q": {
    "date": "4/3/2011",
    "text": "I generally like the kind of food that Smokey Bones has to offer.  I have reviewed them previously for another location, so I wont go into too much detail.  BATHROOMS:  dirty The bathroom at this location on 4/2/11 @ approx 6pm was a trainwreck.  Paper everywhere and one of the sinks didn't even work because the faucet was so broken that it was rotated all the way back and was facing the mirror!  THE WAIT:  long (but it was a Saturday) They *told* us 20-25 minutes and we waited a total of 45 minutes.  FAIL.  THE SERVICE:  bad We waited so long at our seats to be greeted by our server that another male server came over to check on us because we hadn't had drinks yet and were there for a while! Our waitress had ZERO personality and didn't want to be working at all. She was a b!tch, to be quite blunt. She wouldn't make eye contact with myself or my husband and we're very friendly and make it very easy to be waited on.    **Another point to be made about the servers... Dear Management @ Smokey Bones,  Please tell your servers to wear belts and that an inch and a half of ass crack hanging out of the backs of the girls' pants is not appropriate in the food service industry.  This is a restaurant, not a club.  I have sanitary concerns when I'm watching you stick your thumb into your pants to hike them up and then that same thumb is over the edge of a plate with food on it.   FOUL.  FOOD TIMING:  quick!  Someone else delivered our food though, both the appetizer and the entrees and thank god bc of the above mentioned issue with cleanliness concerns of our waitress.  THE FOOD:  is pretty consistently good! Appetizers:  BBQ Chicken Nachos and Smoked Wings, both were fantastic. Dinner:  Pulled Pork and the newer Pork Tenderloin with Teriyaki sauce. Again, both were very good. Refills and Pre-Bus?  These were the only two things that our server did right.  WILL WE BE BACK?   Maybe, but this particular Smokey Bones is not going to be a destination location. The next time we're in Robinson, we'll just go somewhere else!!!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "E73xr_twLJZemdGrXWQobQ"
  },
  "gmTz0kLCPmq9wLj25kM5RA": {
    "date": "7/16/2014",
    "text": "Two stars may be generous.  The cornbread is pretty good.  Last time I was there I got the brisket that they said was smoked for over 4 hours.  I should have known better.  Good brisket takes 10 hours or more to smoke properly.  They slice it thin so you don't notice that it is chewy.  I think there are lots of other places that are better if you are looking for good barbecue.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m9tPYl77eABXl9YWTmJ4dg"
  },
  "R5EaZmfZ4p2fYReNV07E_w": {
    "date": "11/5/2014",
    "text": "Thought I would stop in for a quick lunch between meetings. Have been to other locations and had a great experience. But today not so much. I sat at the bar, and the bartender was more worried about eating her food at a dining room table rather then attending to her customers at the bar. I came in and knew what I wanted but had to wait to order. Then had to wait to have her close my check out. Disappointed in the service and the lunch was mediocre.  I'll stick to other restaurants when I need a quick lunch.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hZECCIzWAIyMo6Iscm3_w"
  },
  "-8mhPC-nwilBcnG2fhkGnw": {
    "date": "9/10/2013",
    "text": "Great food with excellent service and attentiveness to the small details. The burgers were fantastic and the pulled pork was fantastic!!! Highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FodQH9Uk0TL08iQl8FWKfQ"
  },
  "m4Ui4gM00ZdsCmN1YhJPpA": {
    "date": "5/15/2013",
    "text": "Smoked wings for sure and the Mac n cheese is surprisingly flavorful too. Not to mention the coldest beer I've ever had! (Only $3)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HPhYrc-kLB6ewv6yojOt5Q"
  },
  "1mH0DplYMlkOcnSo64VuIw": {
    "date": "12/23/2015",
    "text": "Amazing food!!! My husband works up in Robinson & I visit him often; on one of my visits we both were craving BBQ & we made the right choice. Anytime I'm up there & we want good BBQ we always make a stop here!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSEsUV6z78bEHItRnXTWHg"
  },
  "uq0B4kC3S6vGYFfy_r9Slw": {
    "date": "1/4/2013",
    "text": "Good food and decent pricing makes this an alternative to the other \"chain\" options in the Robinson area outside of Pittsburgh.  The service was helpful and professional.  The food came out relatively fast (it was a busy night) and it all tasted great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B-60XQ_fR72PevFzHM-ieQ"
  },
  "zIngKAZ6OOzXhFsKv7Dxwg": {
    "date": "11/5/2010",
    "text": "Not very good brisket...it tasted like reheated meat...pulled pork was ok but not great. Baked beans were crunchy and my fire roasted corn was somewhat warm not hot just warm.  What is really embarrassing is I told one work friend who never tried brisket to try it too...I told him that brisket when cooked low and slow is excellent but this was not good...I told him later I'd take him to the harmony inn for the way a brisket is suppose to taste, or I'd smoke one myself on a day off, to make up for the reheated dryed out brisket we had here.   I wont ever get the brisket there again...maybe a pulled pork sandwich if I get a real BBQ craving and I'm close by there for lunch break.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hlK-U-vFwrnoJd4oRN4n5g"
  },
  "vWOLcLErBcJBPA88FrHiKA": {
    "date": "4/12/2011",
    "text": "Excellent choice for barbecue. I love BBQ Ribs and our server J.C.was very helpful in my making a choice of entrees. He explained many things on the menu and showed us his personal favorites. He was very friendly and outgoing and we had a good time with him. What Ever you do you got to get the Kettle Chips they are slamming !!! The rest of the food was great, too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sgiRw7OCJj9GHrUlCgE55A",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sgiRw7OCJj9GHrUlCgE55A/o.jpg"
      },
      {
        "img_id": "1hu6Sk9D43QtWCfGhCkevQ",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. Very Nice and Helpful Waiter  ask for J.C.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1hu6Sk9D43QtWCfGhCkevQ/o.jpg"
      }
    ],
    "user_id": "Br_Smhj4sBAwXDm5G-a8tg"
  },
  "rJQkaSrw8lPaFxedUVPX1w": {
    "date": "11/11/2015",
    "text": "This was my 3rd time ever here. .we decided to have a birthday dinner for my boyfriend...Not only did we have to wait a extra 40 mins for a table because they don't have many tables to accommodate larger parties...but we did not receive  our food for 1 hour 50 minutes later...we asked our server several times about our meals around 40 mins  of not getting them...1hr passed and talked to 2 different female mangers. ..we got so many different stories as why still no dinner...finally after we got our food, we got the right reason..which was our server forgot to  put our order in..you would think our food would be hot and appealing to eat...I had a burger which was charcoal both sides ordered it medium....ordered chicken tenders for kids and they were raw...this is the most disorganized restaurant I've ever been to. ..after all this they took $40 off a $110.00 check...very unprofessional....will not be back here at all",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sbr0nlbKAbFiNwjdt9VEJw"
  },
  "5DrEdt2EYQKm2zVM0OWDQA": {
    "date": "1/4/2015",
    "text": "I don't know why the reviews are so low . Me and my girlfriend went their new years day. Food was great not bad prices. Clean",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xd5MMRAg4iprGMwos2ho0A"
  },
  "IKrNO8GgWUm7ZtwWbIbbXg": {
    "date": "10/3/2010",
    "text": "We generally like Smokey Bones. Got there about 7::45 last night, Sat. evening. Busy, told it would be about a 1 hr. wait. Okay, we're hungry, and love BBQ. Buzzer went off in about 20 minutes, yippee! This makes a good evening out even better, right?   Waitress was somewhere else that night, just said what was necessary to take our order. Smiling wasn't an option for this girl.   Everything came as ordered, and nice and hot. (almost a rare commodity at some venues). This is a good start. Appetizers good. Entree arrives. Looks good. Pulled pork; tasty. Cut into the ribs; uh oh! Tough, no semblance of wanting to come off the bone. Did I say tough, really tough. Bad chewing texture, flavor almost nonexistent. Something is not right. Ugh! Can't eat them.   Because I had enough to eat anyway, and waitress was distant, I just let it go. Left them virtually untouched on my plate; no question or concern expressed from waitress. It will be awhile to get over this experience.   If it weren't for the faster than expected seating and the good appetizers, this would have been 1 star.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TIkAuUm1-Aq_YgHVqG_tyw"
  },
  "qAHoQmr4DUkNQfUIOnIAYg": {
    "date": "5/17/2015",
    "text": "Great tasting BBQ for a chain, join the club for regular discounts. I am a sucker for their smoked wings.  The only caveat is be early because they can get a little crowded. Try each of the sauces I like them all for different reasons. Don't forget the fresh donuts for dessert too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jd7jVvEanZjheJTB0Ow9NA"
  },
  "eGDfV5fILYqV8hL_fzoTkQ": {
    "date": "5/9/2016",
    "text": "The only thing that saved this place for me was the chicken wings.  They are spot on.  Crispy, great flavor, good size.  I'd recommend the wings.  The rest...not so much.  This place seems like it's over priced for the quality you get. I paid $4 for a side of Mac n cheese that was just okay.  We also had the pretzel bones appetizer.  The pretzels tasted like the microwaved pretzel you get from the Walmart snack bar, with a side of cheap canned cheese.  I just was not a fan, at all.  I'd come back, but only for the wings.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "z1dWMDS-gLd2R9YP8YMxYA"
  },
  "rgzJ2q9Wyr3_c_gqz6BEBg": {
    "date": "8/5/2015",
    "text": "Always good. Love Smokey Bones! Great wings! Good chicken nachos! Not a fan of the buffalo chicken dip. They use breaded chicken and more blue cheese topping than I like.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wE6F9G-MQERDDVuuUVP17g",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. Chicken salsa nachos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wE6F9G-MQERDDVuuUVP17g/o.jpg"
      }
    ],
    "user_id": "EpXUpwebSyhhGX7mnJrFng"
  },
  "q4v9IiFk2FXprX5K71wcMQ": {
    "date": "12/31/2016",
    "text": "Haven't been there in a few years and now I know why. My son's portion was quite small for the price. My food was either cold or warm. Server just ok. Manager was great. Not happy once again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ixeALmgJ1aBAYIh0F3cnJQ"
  },
  "rOGq4dzWCUwAILouH7AknQ": {
    "date": "3/22/2017",
    "text": "Stopped in today for lunch.  Haven't been for a very long time - years, since I visited.  Ordered the $9.99 'Power Lunch' I think it was called.  One meat, and two sides.  Ordered Pulled Pork, dirty rice and broccoli.  I also ordered an Arnold Palmer as my beverage.  I think there were a grand total of 15 people in the entire place (very telling on a Wed, at 12 noon-ish, for Lunch).  Food came very quickly (good), but I immediately noticed that I got a grand total of, maybe, three ounces of pulled pork, two slices of overdone garlic toast, rice and broc.  My issue was with the amount of pork.  First, I do not ever require a ton of food for any meal, so this is not your typical, 'I didn't get 2 or 3 meals out of my meal' comment.  What I'm saying is, the serving of pulled pork was much too small for any means.  Why didn't I ask my server about same, you ask?  Well, I really do not go out to lunch with the idea that I will need to call out problems like this.  I have no desire to be a restaurant operations consultant.  The food was o.k. - nothing special - Chipotle sauce with very little chipotle.  An overiced, overpriced drink from a kid sized mason jar mug for $2.99?  Seriously?  Basically, I'm done with Smokey Bones - and so are most people, as I can see the place was almost entirely empty regardless of the many large nearby office buildings.  Adios.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EUKyydrnh8wTvwtuACsUTQ"
  },
  "U48F3m6jee4SG1NOhduakg": {
    "date": "7/16/2016",
    "text": "Everything was amazing, the customer service, the food quality and flavors. I would definitely recommend going here (I went to the Robinson location), it's a pretty big restaurant and a great overall experience! I had the smokehouse chicken with broccoli and a loaded baked potato, price wasn't bad either!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VxGY82kfsU4YnHOsl2dK6w",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VxGY82kfsU4YnHOsl2dK6w/o.jpg"
      }
    ],
    "user_id": "dahbN08U85CHJNpCazrTrQ"
  },
  "7_MsjYOj3X4ZWYX7xHawlw": {
    "date": "3/4/2017",
    "text": "No server came for awhile however we stopped a server, Lora, and she immediately stepped in and did a fantastic job making sure my meal was gluten and dairy free. She took excellent care of us and the food was very good and reasonably priced. Would definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jDsoMSztUiCq-lhbf2fysA"
  },
  "hGgBt-0U1mqC3yhVHlgkNw": {
    "date": "6/7/2016",
    "text": "Hard to have a bad experience here. Always order the smoked wings. They're a mix between dry and wet. Slightly sweet but packed with flavor. The bar is always clean, or at least every time I come (once or twice every two months). Decent beer selection. Not huge, but satisfying.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4-K7SMS8Ro7SMkAcaGsNDg"
  },
  "MA28vzRC0A-cxEHCbphwpw": {
    "date": "11/10/2014",
    "text": "This seems to be the place my work crew likes to frequent when I come to Pittsburgh. I gotta say, it was better this time. Not great, but better.   I still will say the bbq itself is sub par, however, the meals that include bbq'd meat (like the pulled pork burrito I scarfed down today) do a good job concealing the quality. Let's face it - Smokey Bones is a chain with okay service, okay food and meh atmosphere. No need to avoid our seek out this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ybBda5iCGEYWYXAgbug2Pg"
  },
  "CX_pX3CYO51aEcSDvbLzmA": {
    "date": "7/25/2016",
    "text": "One of the best meals I have had in a long time. I had the salmon with butter sauce. It was very delicious. My fiance had the pulled pork. It was very flavorful. Along with the sides. Mashed potatoes, broccoli, and Cole slaw. Thanks for the great service as well and the 10$ coupon was a bonus.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dyJeQm97lEZ1LgrUFp_kSA"
  },
  "Z5QCt2XyF0e8dVJu9B6a6w": {
    "date": "6/7/2014",
    "text": "They do BBQ well. The pulled pork and beef brisket are excellent. Love the cole slaw. They have a huge selection on their menu. Burgers, Salads,  Wings, Pasta,  Salmon. Nothing beats the bag of hot homemade donuts!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oOlMgklBa6IhZrCn5-a3yA",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oOlMgklBa6IhZrCn5-a3yA/o.jpg"
      }
    ],
    "user_id": "KqItBIJXO_UhZ6MktvuI0Q"
  },
  "i90ii9kPTw-tBOAhw5MBKA": {
    "date": "5/28/2017",
    "text": "Ordered the Hawaiian ribeye medium and it came VERY rare. Our server was MIA for 10 minutes so I just ate the sides and told her to take it off when she finally came. Will not return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7dWP8X5ZwJlHcJz76hIlDw"
  },
  "7bmgAA8TorDDWLx6nbymSA": {
    "date": "2/6/2016",
    "text": "Our food was spectacular, from the skillet cornbread to the smoked wings.  Hillary was our waitress and she did an amazing job taking care of our needs and recommending choices.  What a pleasant experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N9SrCh_Nm0e-3V9iuIgtaQ"
  },
  "Dn4Q565tF83BewdZH3-JlA": {
    "date": "2/8/2016",
    "text": "Dashon was our waiter and he was very attentive to our needs! My wife ordered the brisket sandwich and I ordered the Texas style brisket which was to die for. Portions could be larger though. Nice place for a gathering!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lPdFQjCh8lIdmGwDLF9rJw"
  },
  "g_MncH1_m-JdYbsj2uEOxQ": {
    "date": "4/11/2015",
    "text": "Well I can honestly say the bbq was absolutely phenomenal!!! Although maybe a little bit overpriced. On a much sadder note, the sweet tea was was totally lacking sweetness whatsoever which is unfortunately an important necessity with bbq. And I would like to see this place have a little more of a country-style atmosphere although that is subject to every humans opinion. But I love all the boneisms (quotes) on the wall especially in the bathroom they are very entertaining!! Also another cool thing is they have free wi-fi.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HrPSQs4Nr4u_dt1M9-O-Qw"
  },
  "qNsaCQN3-NpjEywmad-7ow": {
    "date": "1/20/2014",
    "text": "We were In the area. My boyfriend was craving BBQ and I a margarita. We decided on smoky bones and it was a great decision. The food was delicious, portioned nicely and priced appropriately.  Our server Alyssa was delightful. We were seated in the bar area and the bartender stated she didn't want to take us. So Alyssa swooped in and made the transition seamless and a lot less awkward then it could has been.  We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oQ6DuOueHR97F3MJ0QwUqQ"
  },
  "4RE9n32htr1GTV3CULuPRQ": {
    "date": "8/8/2015",
    "text": "My brother and I were so pleasantly surprised by Smokey Bones! We chose to dine here because we were waiting to pick our parents up from the airport late one night.  The service was excellent and extremely friendly. We ordered the fried pickles to start.  Most restaurants serve them kind of mushy, but they were crispy like chips here, and we loved them!  I ordered the southwestern Mac and cheese.  It had the perfect amount of kick, was a great price, and most importantly, was delicious. My brother did the build your own burger.  After he was done with the add-ons it was a little pricey, but he enjoyed it, so I would say it was worth the money. I would definitely dine here again and maybe next time I'll try their drinks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y4PuxA3yRL-j02kDMhy1zQ"
  },
  "EakGEqh9JWcMBD-53_qF7Q": {
    "date": "6/1/2015",
    "text": "Honestly last time we are at Smokey Bones had to be 4+ years ago. We decided to not go back because our spinach dip appetizer bowl was 1/4 full when we received it and we asked the person that brought it if it shouldn't have more in it, she said no looks like a correct serving. We thought overpriced for their food and just not worth what you get, etc...   Memorial Day this year I take my brother, so just the two of us. Food was okay, again, their food or at least what we get isn't worth what you pay for food. Seems almost always over priced for small portions. Our food was okay, nothing special, however I thought almost $3.00 for an ice tea was a bit much, thought I ,now free refills, etc.. Ice te costs pennies compared to soda, but okay. I order my Dad 2 piece BBQ chicken to go with sweet potato. I guess I should have checked it at the restaurant, my dad loves sweet potatoes, he is 80 yrs old. When we got to my dads, I opened the container and thought everything was packaged nicely, the sweet potato was literally slightly larger than a TATER TOT. My dad looked and looked and could t believe they could even grow sweet potatoes to be that small....   So I guess Smokey Bones is off the list. Not the best place to go, for almost a $60.00 meal really not worth it... Simply my two cents, and I haven't missed anything not going for all these years. There are WAY BETTER places out there, where the quality and price are in check with each other.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qli_gtwCNJ9vZaQBwxxiXA"
  },
  "a1Hu2N_yezAdSr18SB4bGA": {
    "date": "4/16/2013",
    "text": "Outside of the annual Rib Fest, I've never had much luck finding good BBQ food in the area so maybe thats why I like it here. Their pulled pork sandwich is pretty good and they have a variety of sauces to try. Also, their baked beans are delicious.  Now for the negative: This place is never over-crowded and they seem well staffed, but every time we visit we end up waiting forever for our food. This isn't normally something I get upset about but it happens every time we come here.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vuH41CWzOYlwKmMmZnjV7g"
  },
  "TPLjrREzFU_72ml-r6l8ow": {
    "date": "7/22/2015",
    "text": "Poor service.  Called 2 hours before closing on a Saturday night. Never mentioned that they were serving only fried foods.  Took 10 minutes just to put our drink order in.  Waitress was very rude!  Only half the order came out. Probably won't visit again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xqxRJlHgUbjZfjGpwGgiPw"
  },
  "hKhoYZqtoyPHSQiU9uScvw": {
    "date": "1/24/2017",
    "text": "Update: it has probably been a year since I've eaten here before and I can say it's a night and day experience. I had the create your own combo with the BBQ chicken and the grilled chicken breast with baked beans and loaded mashed potatoes and mannnnnnnnnnnnnnn it was tasty! The chicken was moist and tasty. I'm a BBQ sauce person, so I added extra sauce to my chicken but honestly it isn't even needed. The bartender, Liz was exceptionally nice and the manager, Natalie, walked by every table to check on the service. I'm impressed and will definitely be back! Extra star earned. Try the BBQ chicken and let me know if my experience was just a fluke.  Came here on Monday night for the wing special. Sat at the bar. The bar was sticky/dirty from various sauces of the people that sat here previously. The bartender did wipe it when we asked so I guess that means something.   So let's talk about the good wing deal: it's 10.99 for 8 wings and fries (but I think you have to order a drink... Did not confirm if it had to be alcohol... BUT it's unlimited wings on Monday after 9 pm. I highly recommend the smoked wings. It by far tastes the best and its lightly drizzled with a bbq sauce. After you're done with the first 8 wings you may order the next ones in batches of 4 (any flavor you want).    I don't know if I can recommend any of the sauces that are tossed. I had the garlic parmasean but it was chunks of garlic and parm clumped together on some dry wings. And it falls off easily. Mind you I only ate a total of 12 wings.   I do like the fact they give you hand wipes because things will get messy. I also like the fact they had dogfish head 90 minute IPA. Yummy! The bartender was really cool and gave good recommendations.    I would've given an extra star, but my mood was greatly diminished by the obnoxious girl with the sleeve of tattoos on her left arm (I assume she works here too because she knew most of the staff by name) who drank way too much and grew louder with each beverage. She seems like a regular. Let's just say if I entered the restaurant and saw (more like heard) her there, I would leave immediately. Do not pass go. Do not collect $100. Will I come again? Maybe next month. But only under that stipulation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PY5d0AoH2yQV84pOqodjBA"
  },
  "i7xOSpbHh_-8mLZlqTGWvg": {
    "date": "9/20/2016",
    "text": "I haven't actually ever disliked anything I've gotten here.  Lately it's been mostly takeout, and my go to is the pulled pork cuban.  Filling and tasty.  The service here is sometimes spotty, but I think it has less to do with the competent (in my experience) wait staff and more to do with the face that every time I've visited it's been a ghost town.    Plenty of good seats still (always) available during the weekly lunch crush.    Good things here: pulled pork wings ribs sweet potato stix  Nice break from my usual seemingly perpetual asian-inspired menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "DCAKyYwrhKEbxT8XIfPIeQ"
  },
  "z3tomO2zmy9-UyFvfPhQdw": {
    "date": "1/25/2018",
    "text": "Carlo is without a doubt the best bartender/waiter. I make Smokey Bones a regular stop when I'm in Robinson because I appreciate his quick and amiable service. He always has a recommendation and is more than willing to talk me through the menu. Go to Smokey Bones, and ask for Carlo!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JmqakSXSc58dWwfwgQ6j6g"
  },
  "lCW9X_Pz8NbUz8NCxcR4YQ": {
    "date": "3/29/2018",
    "text": "My dad has a debilitating bone disease and cannot sit in a high top or booth. The hostess spoke loudly about us (mocking us) after putting up a huge fight to let us sit at a table. She was unbelievably rude. This was a Thursday night and there was literally nobody in the restaurant. I'm sure we had spit in our food. Hint!!! When you talk crap on someone make sure the entire restaurant can't hear you.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IETCFH8F463123Eq3CPpqQ"
  },
  "lSKs34OX_w3MhuDYOmQS4Q": {
    "date": "9/1/2017",
    "text": "Glad this chain is not local to my city figured I'd try this place since it was mentioned several times in the past as a place that might come to my city.    Major disappointment. Figured I'd eat light and have soup and salad soup was cold there is no excuse for that.  It literally had ice cold spots in the center of it.   Salad had no tomatoes and was loaded with croutons,  baked potato was the only thing that didn't let me down",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0U90C_yjmmn383d5jnlGSA"
  },
  "uMzz9i9QH20wqPYU593jyQ": {
    "date": "8/8/2016",
    "text": "It was so nice as a gluten free diner to have so many delicious options! There had to have been roughy 20 entrees to choose from as well as a decent list of gluten free sides and tips on what BBQ sauces were safe.  I ordered the 1/2 BBQ chicken with loaded mashed potatoes and broccoli. My server, Dustin, was fabulous, even noting aloud \"no garlic bread\" after seeing me order and ask a few questions about the menu. Clearly, servers are well-trained. When my meal arrived, however, there was garlic bread on the plate, so Dustin immediately pointed this out, apologized, and said he would fix it. My new plate came within minutes and was fine. I did not get sick.   Overall, I had a great experience. Mistakes happen; mine was corrected, and the wonderful service made up for the small mistake.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "pKifJg2M1APWDEmqDSStzg"
  },
  "5WXUT9_Ygvem7oowJypH1Q": {
    "date": "7/6/2016",
    "text": "I went here tonight with a former colleague after being a regular at the Smokey Bones of Cranberry. SB is my favorite restaurant in Cranberry, so expectations were high going in.  Val was our waitress, and she was nice enough but definitely not interested in serving (who would be?). When she took our beverage order, she informed us that there was no raspberry (or sweet) tea. We both ordered water and she rambled on about the Coke and alcoholic products they sold. It took three or four times  of saying \"just water\" before she took the hint.  We ordered the cornbread as our appetizer, and it came out almost instaneously and was quite warm. I think I got my $6 worth there.  My friend ordered chicken tenders and mashed potatoes (his usual everywhere we go, I swear) and had no complaints.  I had the Texas-style brisket with broccoli and fries. The broccoli was nice and hot but was steamed to death, no flavor at all. The fries were perfect. The brisket, however, was on the verge of cold and was very fatty. It was nasty; I might actually never eat brisket again. I may have gotten eight ounces with the fat, but only two of meat. The garlic bread was also overcooked for my taste, but still edible.  Smokey Bones is hit-or-miss; tonight was a miss.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7onIyxJxSkUOTq5Plmn9Pw"
  },
  "wfUrhrayLSWmEVeOoyt7dw": {
    "date": "8/19/2017",
    "text": "We went here because they were open late after a concert. The service was slow and I almost felt like a burden to the server. We ordered the Philly mac and cheese, burgers, and wings. Everything was bad except the wings. This experience was a waste of time and money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nwgRJukJa8plc-mVM0Mpyw"
  },
  "gI-Hevf5yQeWLq5UXwDn4Q": {
    "date": "5/15/2012",
    "text": "Smoked Wings are the way to go...  This is my new Chicken Wing place to go - Forget BW3's and Quaker Steak - get the wings.  The atmosphere makes me feel that I am in AXE Deoderant commercial.  The beer was cold and the wings hot (smoked, grilled taste versus deep fried).  Not much to say - I don't think I will eat the BBQ here.  I have had it before and not a fan.  Atmosphere - Okay - nothing special.     Service - Great - No waiting - recieved my food and beer on time :-)  Cost - $10 - Wings were about $7, Beer $3   I will go back :-)",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "JgOcyMF1lTwSVCarSZrrrA"
  },
  "kv8STSFq4m3rNdZP2FwEMw": {
    "date": "4/5/2018",
    "text": "Excellent food, specialty Mac & Cheese entrees and the coolest waitress in Pittsburgh (Michell) excellent service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3JbdMkYYilvjfCWIekG58A"
  },
  "BhvSKKGT3QUxIB2E-pR5SA": {
    "date": "1/2/2016",
    "text": "We went to dinner with our oldest son. He picked Smokey Bones. It was the late afternoon so there weren't many people in the restaurant.  My hubby ordered the Southwest Mac and Cheese. My son ordered the \"Pick Two\"-smoked wings and dry rub ribs. I also ordered the \"Pick Two\"-smoked wings an pulled pork. I chose fire roasted corn and coleslaw.  Our meals came out quickly which was nice because we were so hungry. I ate the smoked wings first and they were incredible. They had a smokey sweet sauce that went perfect with the smoked wings. I think I had the sauce all over my hands and face. Thank goodness they gave us wet wipes. The pork was was tender and moist. There were 3 different types of BBQ sauce-mustard base, spicy, and sweet. I went for the sweet. It didn't disappoint. Both the corn and the coleslaw were good. The Texas toast that came with it was soggy and inedible.  The restaurant and the bathroom were very clean. Our server was very nice. It was a good dining experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hOv5rjZsJLaE-1PO5MBUTw",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. Pick Two-SmokedWings and St Louis Ribs with dry rub. Coleslaw and Baked Beans.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hOv5rjZsJLaE-1PO5MBUTw/o.jpg"
      },
      {
        "img_id": "vR8EabAcIkzcIr5VgxPXWA",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. Pick Two-Smoked Wings and Pulled Pork with Fire roasted corn and coleslaw",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vR8EabAcIkzcIr5VgxPXWA/o.jpg"
      },
      {
        "img_id": "c1KWzRmS2244bwB86tCh9g",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. Southwest Mac n Cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c1KWzRmS2244bwB86tCh9g/o.jpg"
      }
    ],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "HsOIj6RMIGs115vF8r7MSg": {
    "date": "3/21/2016",
    "text": "Here on a Monday night. I sat at the bar. I ate the baby back ribs. They were very good. They were slightly over cooked as they fell off the bone, but they were not dry. Baked potato was as it should be. Otherwise the side taste pre made, including the precut garlic toast. All in all, good bbq option for Pittsburgh. Bar staff was spot on, the rest of the wait staff seemed a bit out of focus. Although they only had about 15 tables filled right now. Kind of busy looking and discussing the employee message board, which oddly enough is on a service floor wall.   Food and bar staff gets them the four stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LzBhuoH9RfspY7ukwJ7qzA"
  },
  "KRfstsy6yIT9XIOIfKBdqA": {
    "date": "5/18/2016",
    "text": "Intended to eat at Bahamas Breeze but turned around and went to Smokey Bones due the wonderful smell that was permeating the air from the BBQ grill. I went there with my Supervisor to catch up and decompress from a busy mid-work week. . The atmosphere was great for conversation. Our server was really friendly and attentive to our needs. I created my own combo ordering the spicy sausage, brisket, mashed potatoes with gravy and cole slaw. Menu price was $15. The meat was very flavor and cooked just right. The sausage was good but I was expecting something a little more unique. Overall I had a great dinning experience ! They brought fresh homemade sugar coated donuts with chocolate and grape dipping sauce after our meal(complimentary). I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qbCV8l1rZlar0FpO1a1Q4Q",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. Fresh donuts with chocolate and grape dipping sauce. So good! Nice and warm!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qbCV8l1rZlar0FpO1a1Q4Q/o.jpg"
      },
      {
        "img_id": "_t0_Zmhj53AkUpHWdPug8w",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. 2 meat combo. Spicy sausage and brisket.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_t0_Zmhj53AkUpHWdPug8w/o.jpg"
      }
    ],
    "user_id": "AxTns0HrHKzxyJ0YCV1AaQ"
  },
  "BkVh76i1PX_CzS27c1FDYg": {
    "date": "11/6/2016",
    "text": "We ordered the nachos which were awesome.  They are in my opinion HOW nachos are supposed to be.  Ample cheese, salsa, cheese on almost every chip, and a dollop of sour cream.  I ordered a burger medium rare.  On the second bite I confirmed that 75% of the burger was raw and not cooked.  I would easily classify it as rare, the absolute minimum that you can serve ground beef at with a sear on the exterior.  I told the waitress that it was under-cooked and she took it back to the kitchen.  Either the manager or the expediter came out and discussed it.  She said it was perfectly medium rare, I disagreed.  The subtle difference between medium rare and rare is up for debate...  I did not like the fact that she said I was off on the ordering of it but she took it back.  The burger that was returned was WELL-done.  That irked me a little since all I wanted was a little pink in the middle, not beef jerky.  And the original order was no onions...this had them.  No big deal.  The napkin roll had a dried piece of something in it...pretty sure it was a jalapeno.  Did it kill me?  No..but that coupled with the under-cooked burger, over done fries and onions on the replacement sucked.  To her credit she removed the burger from the bill.  This saved my opinion of this place and will give it another try.  And also because the nachos were a 9/10 in my humble opinion.  Wait staff is attentive and quick to rectify any issues.  The bartender makes solid drinks and listens to requests like \"easy on the sweet and sour\".  I also see efficiency from the hostess to ordering to fixing the order to refills to getting the check.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FIt6aTdK_iWsxoBqGVHaFg"
  },
  "xPDg7ErVn1IARcBET6gWGg": {
    "date": "1/25/2018",
    "text": "What a fantastic BBQ place!   We went for the ribs and they were delicious!  Carlo, our bartender/waiter was AMAZING and kept the drinks flowing all night.  Definitely worth stopping in! We will be back the next time we're in Robinson!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m_NiYDiuL2tskYIHuvAGLw"
  },
  "NO-W-ItqqclJnEylKUNLvQ": {
    "date": "1/25/2018",
    "text": "Carlo is the <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>! Gave great recommendations and crafted the most delicious mixed drinks to help us start a weekend binder off right! We knew him so well by the end of the meal we asked him to join! (he politely declined)...Next time Carlo! Stay Beautiful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "enkQHpuclO9TU3OWKNBwHg"
  },
  "ecdyFMXwY6A1lI0-Hr3hsQ": {
    "date": "7/19/2015",
    "text": "I met a friend during lunch break . We both ordered salads with the potato soup.  The soup was not served hot.  It was  barely warm.   The salad was over-dresseed.  With all the other options in Robinson, I rather eat elsewhere.   We both agreed we liked our Friday's lunch better. I will say though thay the price was right! $8 is a steal!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UAu2YHF-nByxbJoGhrYUFA"
  },
  "_O_lRNDrH7HnltNEZcPSbg": {
    "date": "9/5/2015",
    "text": "Went here last after not having been here in a few years. It was a Friday a little after 6, and wasn't too crowded. I noticed that they had moved most of the TVs to the bar area and beyond. You used to be able to select which channel you could hear from your table from among the multitude of TVs, but no big loss. If you really want to watch sports, there's plenty of room, and if you really want to have dinner without the distraction, now there's more of a place for you.  I ordered the combo platter of baby back ribs and smoked chicken wings, the ribs with their dry rub, and a side of baked potato and baked beans. My companions split a full slab of the same baby backs, and had a baked sweet potato, baked beans and grilled veggies.  Our orders came in a reasonable amount of time, and everything was pleasantly hot. And have to say, the ribs were perfect! They were just the right char and doneness, and didn't even need sauce, though they offer 4 differing recipes in squeeze bottles on the table. I was surprised at how good the smoked wings were, having never had them before. They were reasonably crispy, maybe a tad dry, but nothing bothersome, and had an excellent flavor. Baked potato was fine, the beans were maybe a bit too sweet, but nothing a squeeze of their mustard sauce couldn't fix.  My companions agreed that the ribs were just right. They thought the marshmallows and pecan butter was a little overkill for the sweet potato, but luckily they ordered it on the side. They also thought that the grilled veggies should not be in the tomatoey sauce they arrived in. When you think of grilled veggies, you think of slightly drier veggies with maybe a smokey flavor.  But the stars here are definitely the meats (sorry Arbys), and they delivered on all accounts. It's a very spacious restaurant, and the service was right on, keeping tabs on the table and drinks filled! Keep up the good work!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IOYbJgL67pkodqDGr1rIXg"
  },
  "2QE94ig1Li9SrqJm8C2Sbw": {
    "date": "5/11/2013",
    "text": "This place is OK, but it is not A-OK, but 3 stars for the very friendly service provided by our waiter, Carlo.  The interior of the restaurant is very cool and kind of cozy, like you are in a cabin full of bbq and there is NOTHING wrong with that.  My friend had the baby back ribs and said they were very good.  I got a hamburger and I do not know how a piece of meat can completely lack flavor.  There was even cheese on it--how was it not good?  I dont know.  I just know that poor cow died in vain for my crummy burger.  :(  :(  Also, avoid the blue bbq sauce...Carolina or Lousinana Mopper or something?  It tasted RANCID.    I'll be back but maybe just for appetizers and drinks.  This would be a good, manly place to watch a sporting event.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PD3X7S70zXHeOx1NjeicjQ"
  },
  "nDJuAlSa1_sdUFTEA8Peag": {
    "date": "3/2/2017",
    "text": "Josh on the bar and Natalie in the kitchen are an awesome combo!!! Drinks are always on point and the grub exceeded all expectations",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wu67RzHBGqkkLoa9sA1iHw"
  },
  "OGiwlxH9fCNwvMiuPXX37A": {
    "date": "11/24/2018",
    "text": "Ambiance was good. Food was okay. Despite being a meat place, can be hard for those who are keto or low carb as almost everything has the BBQ sauce pre-applied. Bit expensive for the quality but portion sizes are large (excessive I think). Likely a 2-star for me as I'm super healthy but I think it's probably a 3 star for the average person.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h1bkwhXCdIxrq6XhW8hZ2w"
  },
  "et9HCZ0esi3H_Tyosf97ng": {
    "date": "11/13/2018",
    "text": "Some co-workers & I ordered take out from the Pittsburgh Mills location for lunch about a week ago. We ordered our food an hr before the pick up time we requested. When we arrived our food was not ready. We had to wait almost 20 mins to get our food. I ordered smoked wings. They were rubbery and extra chewy. It was a waste of money. I don't think I'll order from this location again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p0ZBTSNZv9ef7y0InKdZAQ"
  },
  "TWiFdfuOuIYuDPFa2oipDw": {
    "date": "3/1/2018",
    "text": "We went here for my boyfriends birthday dinner last night. This is one of his favorite places to go to twice a year or so. I originally ordered a passion lemonade, which I have never tried. I wasn't crazy about the taste. Luckily we had a super friendly waiter who understood and took that off our check. She gave me a fruit punch instead which was very nice! We ordered the fries as an appetizer and these were great. I ordered the build your own burger which had Mac and cheese on it-this was delicious! My boyfriend ordered the combo special, with St. Louis ribs and beef brisket. He was real jazzed about the brisket and said it was one of the best he has ever had! He loved the entire meal minus the cole slaw. It was lacking a bit. We had a great time and will definitely be returning. It wasn't very busy on a Wednesday night and the food took a little while to come out-that is our only complaint. Our waitress was friendly and very accommodating. Management came around to see how our meal turned out as well, which was nice. Can't wait to return again to try something new :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gpWNIVJxb9MkO3rsXzzD1A",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gpWNIVJxb9MkO3rsXzzD1A/o.jpg"
      }
    ],
    "user_id": "XVTqV_zHUWC6BOfOsq3nRg"
  },
  "fJpcYSboetto_9oFNOCSeg": {
    "date": "2/23/2018",
    "text": "In lobe with this place good food great employees beautiful environment love the fire outside",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gmrsn7wJ9j3cYFLQbYlxjw",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. The bar area is spacy and clean so coming back",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gmrsn7wJ9j3cYFLQbYlxjw/o.jpg"
      }
    ],
    "user_id": "qgHFmflpy8P9g1D8LHO1gQ"
  },
  "Gd8k7Pkx39Du5VZv9dnkBg": {
    "date": "7/4/2018",
    "text": "Wish we had not tried this place. Even though our waitress was nice the food service was slow. My chicken salad was tasteless and didn't have the avocados in it. My husbands burger tasted like cardboard. Not clean either.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "NXMbSbcXYMh_2g07pwWowA"
  },
  "9DFctayvBnGrS-nGS4Zl3w": {
    "date": "3/4/2018",
    "text": "Can't remember what it was called, but it came out on this little grill and included wings, chicken, steak, sausage, ribs, peppers.  Was very good, especially the wings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ko9BoS6Zp-R7g0FdPmLgQA",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ko9BoS6Zp-R7g0FdPmLgQA/o.jpg"
      }
    ],
    "user_id": "m2uTGkOKcXqQJSmvsYvtMg"
  },
  "rNGlcdSlpmvCig_jKX_B-A": {
    "date": "8/27/2018",
    "text": "This was my first time visiting this location but when I am back in the area, I will definitely order from them. I placed an online order and it was ready on time. It's a spacious environment. I cannot comment on the service per se, as I ordered to go. However, my food was delicious - warm and tasty. I ordered the smoked wings and pulled chicken combo, loaded potato and broccoli. The wings had an amazing rub and sauce. I loved it. My order also came with garlic toast, toppings for my potato on the side, utensils and...a menu! I think that's the first time I've received a menu with a to go order. Smart marketing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mJDzNreOn0ceNjdkpzkBGw"
  },
  "iQFC6kL9XAa51T6lTwSxpg": {
    "date": "11/6/2017",
    "text": "I'm going to jump right in here and give Smokey Bones a 3.5 star rating... It is what it it is, a chain BBQ restaurant with a shack feel in a good way! For those familiar with Famous Daves you'll appreciate this place. They smoke their own meats, aren't pretentious, and if you leave hungry it's your own fault.  The service was pleasant and our waitress answered all of our questions while providing recommendations when we asked. We ended up splitting a full rack of Baby Backs (dry rub finished) with three sides including baked beans, fire roasted corn, and onion rings. Sharing was definitely the way to go unless you're really hungry.  I've had Q from all over the country and this is neither the best or worst thats crossed my lips but holds it's own when you're jonesing for smokey sticky goodness. I'm still a one off hole in the wall kind of guy but in the absence of that Smokey Bones takes care of the craving.  Some things to keep in mind are the beef brisket and beef ribs are only available after 16:00 (4:00 pm for those not familiar with the 24 hour clock) while the smoked prime rib is only available Thursday through Saturday nights...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "MGosljVoqpTcvxHueXI-EQ"
  },
  "wYIuQC35i559Or1HcHE7sA": {
    "date": "9/10/2018",
    "text": "I had an amazing experience here. My server Steven was an absolute delight. He was very quick,efficient and an outgoing and sweet person. He made us laugh and made the entire dining experience so enjoyable. Absolutely love him and I will gladly return because of him. The food was fantastic the cooks really know what they are doing. All around great job guys. Thank you so much.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YhudBw7rdiTAX7tW89H7uQ"
  },
  "bU7MyEUfMd_H88wP4h-yiA": {
    "date": "8/28/2018",
    "text": "Good place. Great service. Food was fast. Pretty much what I would expect.  I would definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1lsv45pIM9aX-k7gPBm1YQ"
  },
  "I4aKfYa13nBberDwMBolfA": {
    "date": "5/11/2019",
    "text": "This meal was very much a mixed bag.  The hostess is unfriendly: no smile, no warm welcome.  She quoted a 25-minute wait for our party of three.  We were seated in about fifteen minutes, placed in a booth in the more noisy part of the restaurant, by the bar. There were open booths elsewhere.  The napkins are paper, not cloth. We did not receive utensils until we were able to flag down our server after our entrees were delivered.  I was taken aback by the high prices for a casual restaurant like this and everything is extra: one does not even receive mayonnaise on a sandwich without a charge. Menu cocktails start at $9.50.  There are some reasonably priced beers, champagne, and mimosa.  There are eight-ounce and sixteen-ounce hamburgers on the menu. A hamburger can easily rise to almost $20 if one tops it with a number of items. What particularly galled me was that I confirmed with the server that cole slaw with my sandwich would be 99 cents as is indicated on the menu.  When the check arrived, I found that it was $2.59.  I was told upon questioning this that $2.49 is the price when a side order of cole slaw is delivered rather than the cole slaw being placed on the sandwich: I did not ask for a side order.  I asked to substitute swiss cheese for cheddar on the barbecue hamburger and the server said \"sure\" without telling me that substituting a cheese incurs an additional charge of $1.25.  Our food did not arrive for more than thirty minutes after we ordered, not a pleasant situation, particularly when a party is dining with a hungry child and no bread nor anything to munch on is brought to the table. The food runner who brought our entrees apologized for the long wait and he knew who was receive which dish: very good.  My stepson's grilled cheese sandwich and fries, and my BLT burger with baked potato ($12.49) were very good.  My wife ordered tomato cavatappi ($11.99) which was tiny and had hardly any sauce on it: unsatisfying.  I was glad I ordered a more hearty item with enough on the plate to satisfy me. Our server, Steven, was a delight: friendly, funny, and charming. He was extremely apologetic for the wait and his inability to be attentive to us due to the restaurant being extremely and unusually busy on this Friday night.  He told us that he appreciated that we were very nice and patient customers, and we were.  He offered us dessert, which I had the impression was going to be on the house.  We declined.  When I questioned the charge for the cole slaw, I did not get to the charge for the because he responded that he was going to do something for us to take into account our less than ideal experience.  He came back with a $20 adjustment to the check, which was generous, and which delighted us.  Despite being served by a standout of the staff, I am not planning to return any time in the near future.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1jXmA4__4UWIplZk6MJMQ"
  },
  "Xm0vT7QIlw6f3N9xhMFh9w": {
    "date": "5/10/2019",
    "text": "I had a few good experiences here in years past, however it's clear in the last 1-2 years something has changed. On a Friday night, the entire place was maybe half full at best, and despite having a reservation the table still wasn't clean when I was brought to it.  There was no silverware, no plates, no water and all the drinks and entrees took forever (over 30 minutes).  The menu has many options that look fantastic, but 4 of our 5 orders were missing something or wrong, and both my mom's salmon and my burger were badly over cooked.  The two tables around us also had things wrong with their orders.  I will give our waitress credit for being considerate and thorough with an allergy concern we had, and fortunately that was the order that wasn't messed up.  All that being said, I was very disappointed in this experience and will likely not be back, I can see why the restaurant was only half full on a Friday night.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FWi-nMMR9XCplq5GU2IpYA"
  },
  "hMF4M5jxbLu7GWK8goHu8w": {
    "date": "1/22/2018",
    "text": "I went in hesitant as I have a very restrictive diet that doesn't allow me to eat out much. My family wanted to go so I agreed assuming I would just eat when I got home. The bartender, Megan Shannon, was AMAZING! She was able to help me navigate the menu and communicate with the kitchen for my dietary needs before I placed my order. The food was delicious, the drinks were amazing, and Megan made my experience one I won't forget. I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_OlmF4kCYI1aUMO2MYibJg"
  },
  "HeuhlDQ0XpQ305C9rsEKww": {
    "date": "8/4/2015",
    "text": "They have late night specials and their loaded fries are the bomb!!!   I got ribs with smoked wings and there was a lot to eat! The rib wasn't really fall off the bone but it was tasty and tender! The smoked wings were juicy and were piping hot!!  The dining area was huge and on a weekday night at 10pm, it was peaceful and quiet. Or waiter was attentive and refilled our drinks quickly",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "eo-J8c1lBLRFP9V56UV4hg",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. I loved their smoked wings!!! :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eo-J8c1lBLRFP9V56UV4hg/o.jpg"
      }
    ],
    "user_id": "H8mXfh5XgGCqmMLwVH7k5A"
  },
  "5Jw1gMs5EiJz0beDTDowwg": {
    "date": "3/13/2018",
    "text": "Just left without even getting our food.  We were there over an hour just for 2 orders of wings (which we never got) and an appetizer.  We paid for our drinks an appetizer which took a long time to get.  We had to flag down the waiter every time we needed him which was to ask where our food was.  The service was awful and the manager never came near our table even though we saw the waiter talking to him when we asked for our bill for drinks and an appetizer. He actually walked around the bar on the other side our table seemingly avoiding us.  I would post a pick of our food but we never got it...",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SsMw4Udr1cW5Kmc0GofaXA"
  },
  "HvpFfUqb2pYrVg8HFoN4BQ": {
    "date": "6/16/2018",
    "text": "Live this place really miss eating here since we have moved to Florida. The service is great and the food is amazing. Pulled pork and brisket are my favorites.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W2xaUHea6b0PovpYtdM0TQ"
  },
  "3G_ts8HmimsLb34kItL43Q": {
    "date": "9/16/2018",
    "text": "As a server, I usually hate corporate chain restaurants. I never have a good experience with service, the food usually pretty mediocre. We decided to try this place because we were in the mood for a good hearty meal and OH MY LORDY. Let me tell you, this is the only restaurant you need to go to in Robinson. Ask for Kirsten if shes working. This 5'2\" firecracker reminds me of myself as a server, very casual and personable with her guests, immediately makes you feel welcome and at home. And the food.... holy crap. We had the cornbread app - best cornbread I've ever had. Did the combo specials, all amazing. This place is seriously such a good spot and has so many options, I dont think we will go anywhere else when up here for shopping or dinner. Yum!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K_BcrsvuaT_KVklxf9ToiQ"
  },
  "QrKcSWPcDJeaIKW2zyalJg": {
    "date": "4/6/2018",
    "text": "It was my first time and last. Had a coupon was the reason to try this place. Should of known as only one other couple in the whole place. Had to wait 10 <a href=\"/redir?url=http%3A%2F%2Fmin.to&s=2130e0f157b0af43dc9bc9170a3492c8b42208cd6b3a9466bf6fa493d986b9a2\" target=\"_blank\" rel=\"nofollow\">min.to</a> be seated , the front desk was filthy and dusty.  We ordered the same thing. Barbecue chicken. Awful , it was brought out so fast, probably cooked it early and let it sit in a warming oven. Chicken, dry, potato was cold ,broccoli cold ..told the waitress she never apologized just asked if we wanted something else...Very disappointed. Will never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cMCr-EFtxDcJE3sFhGKa0Q"
  },
  "yfvOoe4XxJZK3u5CW0RT7A": {
    "date": "4/11/2014",
    "text": "We stopped in last night for an appetizer and a beer with some friends. I'm not sure what happened to the late night special priced menu after 10pm, but i guess they dont have it anymore. They used to though, our party chatted about on our way home & we all remember it.  Bobby & i shared the crowd pleaser appetizer which is loaded nachos, loaded fries, onion rings & 3 chicken fingers-- along with ranch & honey mustard. Its funny because the reason I wanted to head to Smokey Bones is that i had a wiff of someone's hot wings earlier in the day & then didn't even end up getting wings.   I believe during late night the seating is just in the bar area. There are also a few high-top tables near there. Speaking of seating, i didn't realize until last night how large this restaurant is and how many booths there are. It's way larger than what it looks from outside.   We sat at the bar & ate/drank. The bartender was such a sweetie. She was kind and conversated with us, asking what we do for a living and just general conversation. Some bartenders arent so friendly.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s7iM0U7mVo2hYW8hcLLctg",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. the &amp;#34;crowd pleaser&amp;#34; appetizer; loaded nachos, loaded fries, onion rings &amp;amp; chicken fingers. [bye bye potential beach bod]",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s7iM0U7mVo2hYW8hcLLctg/o.jpg"
      }
    ],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "MrhSWloQmJI8di-zwURV-Q": {
    "date": "9/29/2018",
    "text": "2 stars for this location. 15 minute wait at 7pm on a Saturday night so not too bad (Tons of tables were open not sure why the wait-but no big deal) Food and drinks were good! Didn't take very long to get the food. Rating it 2 stars because the awful awful wait staff. From the hostess to our waiter to watching the bar tender. At one point the bartender broke off the pull out freezer door and dropped it on the floor after walking away-it made a loud noise and everyone looked. She then proceeded to pick it up and place it back on the cooler after it was laying in the floor for a few moments-EW. No one really seemed happy. Our waiter just kept saying \"k\" when we ordered. It was like we were BOTHERING him. At least fake a smile or conversation with your tables! He got a little better after we got our food, checked in on us twice and got our check quick. Maybe he was overwhelmed when we arrived? Also they have bottles of BBQ sauce to add to your food, they are all SO sticky. I understand dinner crowd does a toll on the bottles but at least wipe them down every once in a while. I couldn't even use them. Sigh. Upsetting experience here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9aQRb9BoCpF4sIQA_O5dlQ"
  },
  "Wv5rZgfUm3D7QJw9n1OZsQ": {
    "date": "6/1/2019",
    "text": "I LOVE BBQ. Smokey Bones is awesome. I work at the Olive Garden right across the parking lot so this place is convenient. Food is good, full bar, lots of cool cocktails, and really good sides to go along with your choice of protein. The cinnamon apples are essentially apple pie filling. So, delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ezs3j80vY8pmDKFJWfT1tA",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. Cinnamon Apples, Four Cheese Mac &amp;amp; Cheese, Smoked Baby Back Ribs",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ezs3j80vY8pmDKFJWfT1tA/o.jpg"
      }
    ],
    "user_id": "u7XixsmPh-1sfjGvkuJOcA"
  },
  "72Hii5T6SferA9XO6VcgQg": {
    "date": "4/4/2019",
    "text": "Real poor management and kitchen manager? Weird.. no one in restaurant and entire staff trying to figure out where cold food at counter who to deliver to after 1/2 hour waiting. Sat at bar; I was told list of what they've out of? Brisket , chicken, other items? Weird place for that looks so screwed up? Franchise? Or corporate owned ?  How much money losing? Either way a mess...  clueless staff walking in circles  Waited a hour for over priced entree... $4-8 bucks cheaper at Longhorn across street or anywhere else? Menu says 29.99 for steak there??? What are they nuts... 30.00 bucks for a frozen steak at barbecue place that serves no one other steak or does not specialize doing?  Got worse big time! Food arrived  19.99 for 3 meat combo Smoked wings looked liked 3 times cooked pigeon wings ... ain't ever seen you his puny sized wings. Cooked 3-6 hours earlier and reheated to cold temperature.  Worse was the sliced chicken... cold dry crumbling pieces or chunks... not moist hot slices... real gross The other meat was the refrigerator cold pulled pork that was so over cooked maybe 5-6 times or sat all day... had nasty taste and dry, cold, no sauce Even the cold slice of garlic bread was microwave to a chewable texture and over heated 2-3 tines... real garbage served me... broccoli was savior as I heard it is a good colon scrubber as it passes to get this other food out of me I hope with just one unpleasant bath visit in am... never be back. Board of health needs a visit. Corporate needs a visit .owner or owners need deeper pockets to keep this money losing place going..  This joke ain't worth another visit. Yelp needs to allow zero or negative stars or thank reviewers for alerting eating health hazard establishments.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ZBH0vw3N67ortzcl7J7Sw"
  },
  "PBukbA-swS2nSIssenCCgg": {
    "date": "6/24/2019",
    "text": "Maybe I  am spoiled by the plethora of great  rib and barbecue places father south. This place is a soul-less chain that has mass produced posters to \"educate\" you about barbecue. The baby back  ribs were tender but the sauce was bland and lacking  in character. The coleslaw featured lots of mayonnaise and lacked the bite of real coleslaw. I got the  fire roasted corn. It did have  black markings on  the corn pieces but it tasted canned or poorly frozen. I asked the server how they prepared the corn. She came back and said that it came in a package. I sent  her back again and asked her specifics about if it was really roasted and whether it was canned or frozen kernels. Apparently the cooks there do not know this except that it comes in frozen prepared packages as do other items.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q7wVXjWXDT4Sy-NHNyPS5w"
  },
  "qyNJcgOz4PHEJlvvyAW0vg": {
    "date": "1/11/2019",
    "text": "Came to this location for the first.  Have been to other Smokey Bones locations before.  We ordered the pretzel bones appetizer, the combo platter with pulled pork, ribs, and smoked sausage with sides of fries and corn, and the prime rib dinner with corn and broccoli sides.  Had a coupon of $10 off with a tab of $25 or more.    What's Hot - Quality.  Their pretzel bones appetizer (which are soft pretzel bread sticks) are super good.  Hubby and I liked that the best.  Warm, soft, chewy, sprinkled with salt and came with a yummy cheese sauce.  Hubby liked his baby back ribs and the pulled pork.  He said they were flavorful and moist.  My prime rib was good, but it was somewhat dry.  At least the prime rib comes with au jus and horseradish sauce, which helped with the dryness and added to the flavor.  Good BBQ sauces, as well.  Each table has 4 different types of BBQ sauces.  Their unique and flavorful and come with a kick.  Hubby and I both had the corn as a side dish and it was yummy.  Slightly sweet and not overly seasoned.   - Service.  This may be hit or miss, especially based on the other reviews.  Our waitress was new and being trained, so her supervisor made sure to explain there was another wait staff member and why they were asking our waitress questions, etc...  We had no prob being guinea pigs in the training process, especially because they explained the situation.  Overall, our wait staff was funny, polite, and helpful. - Coupons.  I address my issue with their pricing below.  However, Smokey Bones offers coupons that come in the mail, which is cool.  So be on the lookout!  Just be aware of the expiration dates.  There are 3 coupons on their single page mailer, but each coupon has different expiration dates.    What's Not - Kinda pricey.  To be fair, it's not that the entire menu is pricey.  However, my prime rib dinner was $29.99 with 2 sides.  The total was over $70.  With the coupon, it came out around $60.  This isn't somewhere to go just cuz.  In other words, I would only return with a coupon. - Quality.  While the food we had was mostly good, we've had better.  Again, my prime rib was a bit dry and we've definitely had better prime rib.    Final Answer Am willing to come back again, but with a coupon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VsSBd8qyOzCyfkFYTCwo1A",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. Prime rib with corn n broccoli",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VsSBd8qyOzCyfkFYTCwo1A/o.jpg"
      },
      {
        "img_id": "TdHt6_3D45AcwH8XJb4oig",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. Build your own platter with sausage, baby back ribs, and pulled pork",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TdHt6_3D45AcwH8XJb4oig/o.jpg"
      },
      {
        "img_id": "DwgWIg4vKSnYFcoqoZFVZA",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. Pretzel bones appetizer",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DwgWIg4vKSnYFcoqoZFVZA/o.jpg"
      }
    ],
    "user_id": "eYUt3Va-5w-NrCBxD_PrFA"
  },
  "v2CeZhXeCgNpO_t6exE0rQ": {
    "date": "1/22/2018",
    "text": "I am still a fan of smokey bones.. love the spacious seating and square large bar.  New bar stools now at this bar... cool red color.   Instead of ribs we tried the cuban sandwich this time..  yes it was good but the portion size lacked. I don't expect the sandwich to be monstrous but we were both still hungry after the sandwich and a side.      The service was on average.  A young man came to the table and couldn't answer any of our questions - said he was new. Then a different  woman came and couldn't answer them either.   I know not every visit is spot on ..  but this type of visit you do remember.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FZJmULpHHvCsP2diluvELA",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FZJmULpHHvCsP2diluvELA/o.jpg"
      },
      {
        "img_id": "0Efdv9VaCp2rIZccC-nYwg",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0Efdv9VaCp2rIZccC-nYwg/o.jpg"
      },
      {
        "img_id": "DQ-8p02XMOpx68lTJDBzIQ",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. Cuban!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DQ-8p02XMOpx68lTJDBzIQ/o.jpg"
      }
    ],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "og-nmFIvts3J8OOY6rp7CQ": {
    "date": "1/8/2019",
    "text": "I've been here maybe three times in the last year and I hate to say it but each time has been so terrible. A few years ago I use to come all the time and it actually use to be one of my favorite places to eat at. But anymore it just seems so down hill. The last two times I've been here the service was decent but for the food both times everything was actually cold like no warmth to it. I understand food sits in the window but I take it they don't use warming lamps if the server can't come and grab the food right away. I'm a big lover of prime rib but I would not recommend ever coming here to it. If you've ever seen steak that looks like it's been sitting out for awhile and starts to turn colors that's what this looked like. Then they took the steak and dumped it in there beef broth I'm assuming to mask it up but that didn't work. I wish a place like this that I use to really enjoy had a team that actually cared about the food but I know that's extremely hard to find and on top of that at a giant chain restaurant almost impossible. For the fried green tomatoes it was a disgrace to southern style cooking. It was like they weren't cooked all the way and just filled up like a pocket of oil and fell apart on trying to eat them like mush. On my last visit I could not even eat my food and the manager came over and tried to apologize about everything but You would think they wouldn't allow that to be served from the start. He tried to offer me something else but I was in a rush to leave and the food I did order took almost 45 mins to be served. I highly doubt I'll ever be returning here again. Bring back the pool table and the 3 sauces they use to include with the pretzels and I'll be back for sure but anymore it's not worth it to me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ypXrfydBSTOmXY8V9R5Kog",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. This is what they call prime rib",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ypXrfydBSTOmXY8V9R5Kog/o.jpg"
      },
      {
        "img_id": "NegW-XyH1604qmc_G1cvng",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. Prime rib",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NegW-XyH1604qmc_G1cvng/o.jpg"
      },
      {
        "img_id": "QuIVTJHGcw5Ks26_80nSNw",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. Seating area",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QuIVTJHGcw5Ks26_80nSNw/o.jpg"
      }
    ],
    "user_id": "NQBQj7tHxETHf4PDkAtKUA"
  },
  "ayV6_HoJoFnj8jfZ0O6txA": {
    "date": "2/10/2019",
    "text": "I was forced to go here for a work event and was pleasantly surprised.  The amount of food you get for the price is a bargain and it's pretty tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ios18hfxQhzrIaCffTmUuA"
  },
  "EMt1FbUZP2u4xqZTMfULFw": {
    "date": "5/15/2018",
    "text": "Lunch visit. Restaurant generally clean and well kept. Waitress friendly and attentive. I had 8 smoked wings. Very good , great favor .  Make sure you ask for no sauce if you are Keto , as they do squirt sauce on them before they serve them.  Coke products, good.  My only complaint is the wings could have been hotter. I do not know how they could do that without drying them out since BBQ and smoked meats are cooked ahead of time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "0LBzIPKT8KE7GV9VWVmnlQ"
  },
  "Grx2Mjq0M6yURRQ0oDKcPA": {
    "date": "11/10/2018",
    "text": "This is to mostly review the takeout service. The food is decent, maybe 3  stars... I've done takeout here now three times. Each time is the same story..at least 30 minutes after it says it will be ready, I'm finally walking out with my food. This time I thought I would give them every chance to get it right. I put in the order early, and arrived 15 minutes late. Before I left to pick it up (I live 15 min away) I called to make sure they had my order and had started on it. I was told \"yep we have you taken care of\"  Surely it will be ready when I get there this time! Nope. They hadn't even started on half the order. The best part is the \"to-go specialist\" had to go get the order from where the cooks place it for the dine In wait staff, walk back around into the kitchen, and box it up. Lol. Does the online order system not go directly to the kitchen? Does the \"to-go specialist\" have to put in the order and box it up every time? I thought maybe calling would help out but it didn't.   I had some gift cards to use up or I wouldn't have given them a third chance. Anyway, I won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "n0m5GeJMkbLspD2Gj3LetA"
  },
  "XZsxC1krbz7JVZb9Llj70g": {
    "date": "4/18/2018",
    "text": "First time here, & I'm in love!  The best corn bread ever and the honey pecan butter is to die for!  Absolute must order!  I had the brown sugar glazed baby back ribs, very tender & flavorful.  House baked beans are slamming, and the onion rings were perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f4GFiHjpggJuR-ImTCI2_Q",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/f4GFiHjpggJuR-ImTCI2_Q/o.jpg"
      },
      {
        "img_id": "gmkXaau-dusfDbm7fNMmeA",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gmkXaau-dusfDbm7fNMmeA/o.jpg"
      },
      {
        "img_id": "sK0E5WbPsctQ__MU_l7GUw",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sK0E5WbPsctQ__MU_l7GUw/o.jpg"
      }
    ],
    "user_id": "AjHY16sAzY8khEhQjGOcIA"
  },
  "TFIOi7IsR2PgVX1mx1aIyg": {
    "date": "9/6/2018",
    "text": "WORM /LARVA / NATS / FLIES   So where do I start ..?  They should get no stars.. Got there about 730 on a Thursday maybe about 7 family's in there eating, 3 waitresses working running around and more waitresses sitting at a few different tables taking care of what to look like their own children... Really...   Fruit flees and flys all over the place... asked the daughter to pass the hot bbq sauce from the rack on the table and it seemed like a swarm flew from the bottles ...  one or two and I wouldn't say anything but it was ridiculous how many their were...   So come to the food it was horrible when we got it and especially the WORM / LARVA / MAGIT my wife found in her broccoli (wish we took a picture of it ) we asked for a manager and it was like they couldn't find her...  by then the daughter and even myself (which is unusual) lost our appetite... she came to the table... finally... I just handed her the plate and pointed at it.. her response was ..\" What's that?\" I Answered \" I don't know... you tell me!! \" she apologized and said she would tchanceake care of it... dam* right she was... she took the plate away and didn't hear or see her again ...as we were sitting contemplating on what just happened... 10 mins or even longer gone by and the waitress returned saying we can leave whenever we want she picked up the whole check... we left at exactly  9 PM ....    Worst out to eat experience EVER....  I will be calling the health department tomorrow... Sorry to all those who love this place but this is the last straw for me with this place... I use to love this place but it's just been gettin worse and worse... I keep tryin to give it another chance but this was it.                      I'm done Smokey Bones and LARVA..........",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "-h4nHEPASpo_vL5cUvdQxA"
  },
  "iYI2qv4WX6ND4PIdDSUanA": {
    "date": "5/21/2019",
    "text": "Ordered delivery with pick 3 favorites plus an extra favorite. Portion sizes were super small, a few bites per \"favorite\". Food quality was poor, Bourbon BBQ chicken was very rubbery, brisket was mushy without much flavor. I could not have been more disappointed. Wish I had taken a picture as proof, the amount of food for a 30 dollar order was comical. Even the sides were pitifully stingy. I'm honestly bewildered, I can't imagine them ever getting repeat customers if this is how they operate. Hopefully, this was just a bad night, but I'll never risk it again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hseO9Ul4iBH2qg5ImklOzg"
  },
  "T3bEYXUFu9mkelah0nLTLA": {
    "date": "5/16/2019",
    "text": "I ordered  the fish and chips . The fish was so greasy I could have squeezed out all the oil and dried up another batch of fish . My margarita was decent , the kids liked their meals , and my husband ordered the ( I forget what it's called ) big meat sampler for two . He said it was ok - but liked the sauces . Our server Jim was really nice though .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ByEyLcpAY3POh5UkbaDDAg"
  },
  "79zaUdQgljLvf7gMdiXzag": {
    "date": "5/12/2019",
    "text": "After 11pm the booth and table area is closed so you have to sit at the bar with a bunch of drunks and loud folks. I just wanted to eat wings and watch the boxing fight. The server was nasty and rude. She took my order, brought my food and gave me my bill. Never checked back on me. Never asked if i needed a refill Nothing. After waiting 20 minutes after i was done eating for her to come get her tip and take the bill I had to go around the bar to give it to her. Service was horrible but food was great. I'm sure i could've tipped more than anyone in that bar but i didn't because her service sucked. So to the bartender/waitress you did a great job at making the establishment money and forgot to make yourself money. Next time check on everyone and not just the ones your drowning with shots and beer",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YOqjVlydRxAViXf6wweXNA"
  },
  "3oVKRxtEdgFbbFrdE4HtlQ": {
    "date": "5/31/2018",
    "text": "I'd really like to give it 3 stars just for the point but the food was fine, the service sucked though. They're open until 2 am and we were the only table yet we sat many times with empty drinks and no one checking on us. The people I was with loved the tacos and ribs. The chicken fingers are fine, and the fries are good. It's just a mediocre place. The atmosphere is fine, kind of loud.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1-iM4wbphbzXqw6UC1TpTw",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1-iM4wbphbzXqw6UC1TpTw/o.jpg"
      }
    ],
    "user_id": "DsQ73z9FNzcbRkAirOiHoA"
  },
  "S0-lGCpJb2hQn0FAN72nzA": {
    "date": "1/24/2019",
    "text": "Our waiter/hostess was so kind. I couldn't figure out if I wanted to try the beans or the corn so he said hey why not try both they were both equally as good but the corn was way better. I ordered the half rack of ribs I don't remember the name of it but it was really good there were three different sauces you can choose from and I chose hot because I like spicy. I decided to top that off with a double jack and Coke which was yummy. It was a cool vibe cool atmosphere and amazing customer service. I don't remember the hostess/waiter's name who was there at 3 PM today but shout out to you you're freaking awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "okG0-Qvyv5EozHLN8jXiag"
  },
  "GP6CNwU24BvuWHRoa73l5Q": {
    "date": "2/7/2019",
    "text": "It was ok , it's a local BBQ chain. I'm a Texas resident where BBQ is king. This is chain BBQ , its sustenance and palatable.  It was ok .",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mrzf3LwfoEsDS6_Ld64F4w"
  },
  "blTpwKqh2V6HfJzjPFeRug": {
    "date": "1/8/2019",
    "text": "Disgusting food. Most certainly a freezer to fryer restaurant. The ranch dressing tasted like chemicals and the chicken breast had the consistency of a sponge laced with a heavy dose of preservatives.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CRvoZiL3vmMatsBCnuuhpw"
  },
  "d3QPvwrb3KdOy6ZBdZEsKQ": {
    "date": "1/21/2019",
    "text": "Good food. Great pulled pork sandwiches. Nice bar. Friendly people. Plus, they stay open late. I recommend eating here if you like BBQ.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WrnUDgCUoiaMlb_bCUNrmQ"
  },
  "d8JgFdzBIfucFcNuviOv0A": {
    "date": "3/16/2019",
    "text": "This place was our favorite place to eat when shopping in the area, but has been steadily getting worse over time. Tonight was absolutely the worst experience I ever had at a restaurant. After waiting for an hour and a half after we ordered, they couldn't tell us how much longer it would be. Manager stopped by and had excuses but when there were many empty tables, and customers waiting, something is very wrong. We ended up leaving along with many other customers. They actually stopped seating customers. Our order was the smoked wings and ribs, which are both prepared already, not sure why it would take so long to prepare some sides, coleslaw, onion rings and fries. Also from previous visits, the smoked wings were a nice large size and very meaty. Now are very small wing. Won't be back until the reviews get better and this place gets back to the way it was. So very sad :(",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ssfhZ2ljk1HEK9zRhyPkHQ"
  },
  "TRCp1DHoJ3nf58l51hJuaw": {
    "date": "3/24/2015",
    "text": "Lunch doesn't seem to be a good time to come to this location.  I chose the bar because it usually has good service - not the case today. Single bartender had to wait tables as well.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e0pWvys61b8D9rxS7MayGg"
  },
  "B8qbfEW-jsgVYNeoZwXeQQ": {
    "date": "3/1/2010",
    "text": "We had a BOGO entree coupon from this place (which I presume means they aren't doing so hot lately...) so figured we would give it a try.   The log cabin decor is just weird, not my style at all. I got the 1/3 rack of ribs, mashed potatoes, and roasted corn. The ribs were decent, nice and moist. Their barbecue sauce is nothing to write home about though...pretty boring. The roast corn was a little too smoke-flavored for my tastes. The potatoes were pretty decent. $13 for a 1/3 rack of ribs is too pricey though, IMO. I was pretty much still hungry after eating here.   Mr. had the chicken fingers...pretty hard to mess those up, so they were fine. Fries were pretty good. All in all, this is just a boring chain place. The servers were friendly and prompt. I might go back if they give me another BOGO coupon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M9MXoSsb193m1g0QmmUYBQ"
  },
  "XUWKg-7R716LnmLn6VzXYg": {
    "date": "2/18/2009",
    "text": "Why do I waste my money at places like this? After a trip from Cleveland to Ikea--to purchase a couple 'kids furniture storage items'--the family was desperately hungry. We were trapped in the middle of a bunch of power centers and a mall. There may have been a decent restaurant somewhere nearby, but we wouldn't have known. The idea of going to Chipotle--again--was giving me very dark thoughts.  So we tried this place. Oh, why do I let myself forget what experience has told me over and over and over again: these chain restaurants all taste the same. Butter, fat and salt. Bar-B-Q? Yeah, I tasted some of that. But I had to keep reminding myself that I was at a BBQ place and not an Applebees or Fridays or Bahama Breeze or Outback or whatever. They're all the same; they all use the same cooking techniques, they all have similar menu items with a few 'special' dishes thrown in for variety. I think we're approaching chain restaurant singularity.   A couple times a year we give a chain a chance--with a gift card to redeem, or caught in desperation after a shopping trip. Every time, I leave feeling that I may as well have set fire to the money I just spent. Please friends, help me remember to plan more carefully next time.",
    "rating": 2,
    "rated": {
      "funny": 5,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "_8ch-8X97NRtLwdtSd-XrQ"
  },
  "YQH_QD7gvYgRrjePDNoGVQ": {
    "date": "8/31/2012",
    "text": "Their cornbread w/pecan butter (appetizer) is awesome! Majority of the menu is somewhat comparable to applebee's, but w/more bbq-type food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MEz7IFB2sI8DmDfW0YgzJg"
  },
  "6BgPpI-8cwX3oIniRTrKmg": {
    "date": "5/19/2013",
    "text": "First of all my friend and I didn't really realize it was mother's day weekend. That said we were seated promptly even though it was busy. Our waitress , however, just couldn't seem to think that we didn't need to be pushed out of the restaurant. I have never been this rushed in my life. I was a server at one time , so I always make sure to leave a good tip. This is the first time in many years I only left 10%. Guess that will confirm her suspicion that women out together do not tip. *sigh* My baby back ribs were good, but the other rack of I'm not sure what they were called were awful. Tough, and had an odd taste, they were more like prime rib than I am used to ribs being. My friend ordered all baby backs but was served a section that looked exactly like the section I received. Fifty dollars for two people without cocktails nor appetizers is way too rich for my blood, ecspecially for ribs. I will not go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RL7HLEBCuD5a-qFneAigeA"
  },
  "1qkar3mUSoOt3F_fAUrH2A": {
    "date": "5/18/2010",
    "text": "I had the pleasure of attending a friend's wedding this weekend- it was one heck of a party.  The bride and groom were happy, the music was hoppin', and the guests were ready to eat after an hour of drinking and socializing.  My girlfriend and I sat at the head table (not sure how we managed that) and began asking the happy couple questions...  How many people are coming?  Where did you hire the bartenders?  Who's doing the food?  To the last question, the bride answered, \"Smokey Bones.\"  I had heard of this restaurant in passing, but hadn't actually eaten there before.    Dinner was being served buffet style, and we were ready to eat.  As we watched the plates of food pass by, our eyes grew larger and larger, our stomachs growled, and the sweet scents of barbecue permeated our senses.  Finally it was our turn; we took our place in line, and began placing mounds of fresh barbecue on our plates.  There were many dishes to choose from- a nice mixed greens salad, barbecued chicken, pulled pork, braised brisket, corn, beans, garlic bread, and two different BBQ sauces.   I tried the pulled pork first; it was amazing.  The meat was succulent, a little smoky, and extremely tender.  As I chewed the slowly cooked meat I looked over at the groom and bride- they were equally amazed at the juiciness of the meat.  Glancing around the room, I noticed the same look on the other guest's faces- complete food ecstasy.  I grabbed a pork rib next; it too was soft.  The meat had been cooked so thoroughly and slowly that the bone had even started to become soft.  The brisket was next; it was sliced paper thin, and loaded with tang and zest.  The meat from the flat cut of meat was soft and sweet; my taste buds welcomed each piece with enthusiasm. I have to admit, I probably never would have considered stopping into Smokey Bones for dinner.  Now, I'm going to make sure to make plans to go enjoy some more of that authentic, delicious barbecue!   Congratulations Lisa and Billy! Chef Chuck Kerber",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_303WoQHBxMMQ5wU13GAnQ",
        "caption": "Photo of Smokey Bones Bar &amp; Fire Grill - Robinson Township, PA, United States. Barbecue!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_303WoQHBxMMQ5wU13GAnQ/o.jpg"
      }
    ],
    "user_id": "nHxQfB9CRettoPKJmkDx_A"
  },
  "_AcipnCPsbLa1ek_xb96sA": {
    "date": "5/26/2013",
    "text": "Horrible Service! Today My Mother and I have some disiness and sickness. We think the waitress that was very rude had put something in our food. She also brought us the wrong items with the wrong condiments on them. We were very dissapointed",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TGU_wA66QP402VtXegI3kA"
  }
}