{
  "upFwacLWt1OPtnqlHa_Avw": {
    "date": "7/27/2013",
    "text": "Loved the service like all the Jimmy John's I have gone to. I have been to places in Vegas and St. Paul, but this one is the best so far. Fast service, very clean, nice and big, last but not least amazing sandwiches!!!  I had the club lulu with hot peppers!! BOOM!!!! It was great!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rPVEP8H3I5f_OmBewoULAA"
  },
  "cFQhg2uvcxqw4GiRkviXhw": {
    "date": "6/23/2013",
    "text": "I could not be more thankful for these guys.  They handle large orders like True professionals.  Anthony, Victor, and Newcome were outstanding with costumer service.  I cannot thank these guys enough.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ukDkXW-uZHDQMUuRct17pg"
  },
  "vGazhL1XrCt0b1blKEDiAw": {
    "date": "6/8/2015",
    "text": "I needed lunch in 15 minutes or less and I ordered, stuffed my face with a Turkey Tom, and was on my way back to the office in 10 minutes.  Freaky Fast indeed.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j5OsEnHzKuhenSrllS9qPQ"
  },
  "7eF9zaKyaEXuFgvBY_5WVA": {
    "date": "7/5/2014",
    "text": "The excitement over the proliferation of Subway's less health-conscious cousin  is hard for this writer to comprehend.  It's been 31 years since the first Jimmy John's franchise operated from out of a garage in Illinois. Today, Jimmy John's is almost becoming as embedded and saturated as The House Fred DeLuca Built (at least one other JJ's is located in the same zip code), and it's not an entirely despicable development based on a recent visit brought about by an evening without my Kay. \"Heck, I might as well try one out,\" I said to myself as I casually hoofed it up Grant Street in search of a cheap, expedient dinner.   I did find that my Jimmy John's Billy Club vaults over anything Subway manufactures (I was told by one employee years ago that Subway refers to their foods as 'materials' to be 'assembled.'), but I'm still getting the impression that like DiBella's, something special was lost in the transition from local mom-n-pop gem to national fast-food powerhouse.   My Billy Club (#8 on the menu) consisted of \"medium rare\" roast beef, smoked ham, provolone, Dijon mustard, lettuce, tomato, and mayonnaise. While the meat was ample albeit a touch dry and the bread was chewy and faux-artisan, I kept feeling as if this was something one could concoct at home with minimal effort, particularly as the mild-mannered proteins slid from out of the grinders other end with each chomp, and I pushed them back in. .   Jimmy John's tries valiantly to trick the diner into thinking he or she has stumbled into a shiny, new, independent sandwich shop. The white tiled walls, gleaming railings, spacious layout, wooden seats, glossy, black takeaway menus with the ironic fonts, and the impeccably friendly staff all indicate a willingness to replicate what a Jimmy John's would be like if the entire chain started up in whatever city you're currently in.   Wait 'til one opens in Grand Forks, North Dakota! Marilyn Hagerty will be in for an experience!   As for me, I was just moderately impressed with their selection which seemingly features the same ingredients in interchangeable configurations. There's the aforementioned roast beef and \"real smoked ham\" along with tuna salad, the usual Italian delicatessen meats, turkey breast...and I'm yawning as I write this. Chain sandwich joints such as these are sapping my patience and interest.    Oh, I had dessert too.  That shrink-wrapped cookie I had was basically a squishy Little Debbie lunchbox treat magnified in size. I'm sure I could find something of similar quality in my employer's row of vending machines.   Nonetheless, I liked that bread enough, and for two quarters per day-old loaf, I almost took some home...to make an even better sandwich for myself.   For me, Jimmy John's just ain't got it goin' on.",
    "rating": 3,
    "rated": {
      "funny": 10,
      "useful": 14,
      "cool": 12
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "fwOo87Kk4HySH6Az1rwq8w": {
    "date": "10/2/2017",
    "text": "I always get food here at prime lunch time. Even if there is a line out the front door, I am out of there in 5 minutes. Fast service, friendly staff, and enjoyable food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r_1LMf4PULba0HUfox0Lew"
  },
  "umFCfD-aiHVd3byjNH0NBQ": {
    "date": "3/11/2014",
    "text": "I have developed recurring cravings now for their Big John sandwich (salty roast beef, yummy bun, great mayo... YUM), so I frequent their shop on Grant Street when I have an audition in the city or an appointment after work.   If you'd like to go when absolutely no other customers are there, 6pm is a pretty good time. They're open late (9pm, I believe) even though their neighbors often close early, given that the business crowd has gone home to families.   One curious thing about the chain (not particularly this one location) is that they don't offer a 'toasted' option. I'm aware it's because their gimmick is \"fast\", but I'd salvage 90 more seconds of my time to have a warm sandwich. I couldn't believe they survived competition when they handed me a cold-cut sandwich... though it is a DARN good cold-cut sandwich.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "4juAamRW_cMcSa_VPU6yqg"
  },
  "7QsMxIMoRPwA5rFS2e4hbw": {
    "date": "9/29/2012",
    "text": "I unfortunately did not enjoy my sub.  I got the #5 Vito which rang up to $5.98 that's a good price for an 8in sub, but the bread was flat and little hard. Signage in the store read it's fresh baked but really it could have been  shipped in 3 days prior and I wouldn't have known the  difference. The bread for me really makes or  breaks the sub.  I want a soft bread that's gentle on the gums lol.  I don't want to be made to feel that I am working through hard bread to get to the inner goodies of my sandwich and that's exactly how I felt.   Jimmy John's Vito as I remember it was lettuce, tomato, salami, ham,  and capicola. Your standard three meat trio hoagie, but really no care what into making the sandwich at all.   The only two saving graces for this location is that there is amble sitting and also they sale day old loaves of bread for .50.  I purchased two day old loaves and made french toast the following morning.    I'll be back for more day old bread, but certainly not for meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qoU1tpAUIlPvw5jkXbopYg",
        "caption": "Photo of Jimmy John's - Pittsburgh, PA, United States. # 5 Vito",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qoU1tpAUIlPvw5jkXbopYg/o.jpg"
      },
      {
        "img_id": "qGhH_8FI_clnrzFn5yalnw",
        "caption": "Photo of Jimmy John's - Pittsburgh, PA, United States. Day old bread signage",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qGhH_8FI_clnrzFn5yalnw/o.jpg"
      },
      {
        "img_id": "WZ7-JFcovWPMimm1Vp3oRw",
        "caption": "Photo of Jimmy John's - Pittsburgh, PA, United States. Jimmy John&amp;#39;s Signage",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WZ7-JFcovWPMimm1Vp3oRw/o.jpg"
      }
    ],
    "user_id": "V7uS5US4oTf-S9u36HJQCQ"
  },
  "mnPzvhLaZ_uvx-FHYYS3gg": {
    "date": "7/24/2017",
    "text": "While Jimmy John's is fast, I just don't think their sandwiches are that great sadly. I've tried multiple sandwiches from the menu but haven't liked any of them. I've heard of multiple people getting food poisoning from the food here too.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "deHgmqaKc2HctB9uTJsvDA"
  },
  "lTfTjOx2E9zPGqsfa0-x-A": {
    "date": "12/9/2015",
    "text": "I know this location has been open for a while now, but let me start out my review by saying that my co-workers and I were PUMPED when we heard that JJ was opening up across from our office!  Since then, I've visited many many times, and I love how solid JJ is.  You know it's going to be fast and delicious every time. Even if there is a long line, you get through pretty quickly.  The cashiers are helpful too!  There's plenty of seating inside and out.  JJ chips are super delicious too, so don't make the same mistake I just made, add them to your order!  Lastly, I love the building this location is in, the Union Trust Building, thankfully it's undergoing renovations and will be back to it's old glory very soon.  There is scaffolding in front of JJ but don't let that deter you, it's no big deal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJQTqW0Uf4V9MNX1ogtw6g"
  },
  "3stbemsx9t3xUBWrZU_3Og": {
    "date": "12/1/2013",
    "text": "This is my favorite Jimmy John's in Pittsburgh. I work nearby, so it's easy to stop here and grab a quick lunch. Though the lines are enormous at lunch time during the week, the lines do move quickly. There is ample space inside as there is a lower level as well.  The veggie club is my absolute favorite. I'm sad that they have done away with the alfalfa sprouts, but at least the avocado spread is delicious and adds more to the sandwich than just an assortment of raw veggies. I enjoy getting the wheat bread instead of the usual roll (which is also delicious). The wheat bread is dense and has a delicious crunch to it because it is so stuffed with grains.  Come early during the week for lunch, or else after 1:30. This will ensure that you get a seat if you'd like to sit down rather than carry lunch back to the office.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xsZ4s7a4MaBIh48MdMkkPw"
  },
  "-KQqpDV_Z5FWVfsV3SVvOg": {
    "date": "8/20/2015",
    "text": "Average subs. Very fast good for delivery downtown. Not worth going out of your way but if you are in the mood for a sub and in the area it will do.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XWEbLpANMuEajGXWZ3_CEQ"
  },
  "lruf87g2xlWtcxnCu5tyOw": {
    "date": "7/25/2015",
    "text": "Fast.... Very fast.... Line was outside the door. I started to kind of panic but it went down very quickly.  We were at the counter ordering in under 10 minutes. This company is opening up new locations everyday. I can see why. Always a good experience at Jimmy Johns!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ZB3S82Bwktd-XuwRFRPTw"
  },
  "SJ-YYsNDjERkmR-8JMIMUQ": {
    "date": "4/9/2012",
    "text": "Jimmy John, where have you been all my life?!  I'm not a fan of chain subs.  Subway ruined subs for me a long time ago.  THIS IS NOT SUBWAY!!!!  Thank God.  This is REAL, fresh sliced meats and cheeses, fresh baked breads, crispy fresh lettuce and veggies.  Those are SMILES on the faces behind the counter, folks!    My favorite?  The Unwich.  My favorite Unwich?  Anything with the avocado spread.  And real turkey!  And bacon.    This location is clean, bright, fresh and stylish!  Look for the seating in the back with windows looking out into the marble interior of the Union Trust Building.  Nice spot to enjoy the best chain sub in town.    Thanks, Jimmy John....you've restored my faith in fast food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "ca___2Qaf5FFyPCf6T2eZA"
  },
  "Cr8fK1T5nCNcXYonCnEHhQ": {
    "date": "4/9/2015",
    "text": "I have ordered delivery from this Jimmy John's location multiple times. They are always extremely fast in delivering my order to my apartment downtown. The delivery person thanks me for my business. The food always tastes good. My favorite sub is the Club Lulu, which has turkey, bacon, lettuce, tomato, and mayo on French bread. The price is inexpensive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FW5F5QzzMoeRdIib1OyNOw"
  },
  "vb4OM4_rmuGiT6d0j1j2sw": {
    "date": "9/15/2016",
    "text": "I thought they were a little skimpy on the amount of meat they put on my club sandwich,  otherwise it was okay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4FzWqikJPk-f-YNNqOm8gg"
  },
  "sel-ncL6fix8uugd_1poUg": {
    "date": "7/17/2013",
    "text": "Very speedy service and a well-made sandwich. I'm frequently in the Burgh for work and my office is super close to here. Most days, I try and do a \"working lunch\".  I can get a tasty, healthy and filling meal here for cheap - in and out of the store in (at the absolute most) 10 minutes.  For what I'm looking for, this is as good as it gets.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W3WBZkzthDaFxFmMD_t9Kg"
  },
  "iNr8mIhfGmgQKKvzpZvQYw": {
    "date": "1/30/2012",
    "text": "There are several Jimmy Johns downtown.  This is a new location.  It is fairly crowded at lunch.  Good variety of sandwiches to choose from on french bread.  Sides consist of Chips or Giant cookies.  I'm a fan of the JJ Gargantuan.  It consists of a little of everything.  It is huge!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DEFk299pEBqKgUgQ703V9g"
  },
  "kGS0WI6yT6xh1bMjaUaiWw": {
    "date": "1/23/2015",
    "text": "This is the first time I stopped in to eat here. The service is very fast and the sandwiches are great. The sandwiches are made to order and are worth the cost",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sMm9HOXmBgsBmCKnOmLwyA"
  },
  "sv7zJn518ntnslEVdiyOFg": {
    "date": "10/4/2014",
    "text": "I've been to a few different Jimmy Johns locations but this is my favorite. Maybe because it's very close to my work but also maybe because it's very clean and the service is always friendly. I get the same thing every time, the beach club, and I'll continue to get this item every time. The bread is soft and addicting and I've never received a bad order. Even when my order is delivered I still get delicious sandwiches in a freaky fast amount of time. Great job guys!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2S61ofO9qwiaFbVb6cCNpw"
  },
  "l_pnXnQMpucsqKEUZk3Rsw": {
    "date": "1/26/2015",
    "text": "We were visiting from CA and decided to go in for a quick meal.  We both had the #5 Vito.  The sandwich was fresh and delicious.  This was and definitely a step-up from Subway and similar.  The staff was nice and the service was quick.  We will definitely go again on our next visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Sso7MP-DqvBCH5xidBqlA"
  },
  "-Jojl-WkOEXevHwG0KuymA": {
    "date": "11/11/2015",
    "text": "Not sure what the fascination with this place is.  I got the Vito Sub.  It was an italian sub.  The bread was hard, and not great, and I do like French Bread, so that wasn't the problem.  Saw them make it, it was just pre-portioned meat that they slapped on the bread, then added some lettuce tomato, cheese, and dressing.  I would say this place is about on par with Speedway (the gas station) subs.  But Speedways subs are $4 for 12\", so I'll pick speedway for price.  If you want really good subs, try Penn Station East Coast Subs, Firehouse Subs, or Dibella's Subs.  They're all a lot better than this place.  Even Subway is better, and it's cheaper.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Gn52HDDe_aYUN2lYHLQWQ"
  },
  "FboYExfTqegmDM5vJy_FbA": {
    "date": "4/8/2013",
    "text": "Jimmy John's is a chain store sandwich shop.  We've eaten at a few all along the east and west coast.  Prices are adequate for the selections.  Although this little store was crowded during lunch time, service was quick!  Will be returning here alot since it's very close to work.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Eu_9lumAGZ1HHf3OP3hag"
  },
  "829xdKKDwr-rGLlgg9G-KA": {
    "date": "11/7/2018",
    "text": "Super quick service, reasonable prices, nice selection of toppings and overall tasty sandwiches. I would go here again for sure!  The first time I tried this place I wasn't even hungry but the second I started to taste these sandwiches I couldn't stop eating. Before I knew it the sandwich was gone when I originally didn't even think I was hungry! They are THAT good. The bread and toppings are particularly fresh and the meat/bread/dressing ratio is well balanced. We were particularly impressed with the Italian hoagie - they must use higher quality meat. You can tell that a LOT of effort and thought goes into how each sandwich is crafted.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "cgecfJZ46npwKX2iOIbVWg"
  },
  "UKOHV_tMBoLuyTGuCYmJ8Q": {
    "date": "6/21/2019",
    "text": "Why do you scoop all the good white bread out of my roll and throw it away? Please don't say it's so you can fit the measly 2 slices of roast beef. I think I'll stick with potbelly from now on.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hs5TxoTaXencA0I3j6UDIg",
        "caption": "Photo of Jimmy John's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hs5TxoTaXencA0I3j6UDIg/o.jpg"
      }
    ],
    "user_id": "eCRmrH5sR6zexbg5RiQX9g"
  },
  "rzjRhiMNmJlG72q-Cz3s2g": {
    "date": "4/2/2018",
    "text": "Jimmy John's has the best bread for a quick sub. That's all there is to it.  Are there better sandwich shops? Sure there are but nothing a quick and convenient with what I'll call above Subway quality subs.  In fact, for a franchised sub shop, this is probably my favorite.  It's all about that bread which you can get a day old loaf of for  .50 (fiddy) cent!  I don't know what it is about it but I love it!  Now I normally grab an Italian Night Club but tonight I decided to try a Country Club.  You know I added the hot peppers by request too.  This was a solid choice and I'd get it again but it is not replacing that #9 as my favorite. One thing I really missed was the Italian dressing.  That would have been a nice addition.  And don't forget the pickle!  It's totally worth it if you are a dill pickle fan.  The location is nice on Grant St. and easy to get to from most places downtown.  As for service, I can't say much because they were so freaking fast! No joke there guys!  It took me longer to debate what to get rather than them making it and me being out the door.  I don't even think the crosswalk light changed!  I guess they are living up to the name.  You won't go wrong stoping in here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WlHhsuYdBPNbvjZHwYoCJA",
        "caption": "Photo of Jimmy John's - Pittsburgh, PA, United States. #11 Country Club and a Pickle",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WlHhsuYdBPNbvjZHwYoCJA/o.jpg"
      }
    ],
    "user_id": "wzItnkHTHKNqJESMSTEYJg"
  },
  "icQImWawMcZEgPqCoXfQtA": {
    "date": "8/30/2018",
    "text": "\"Freak Fast. Freaky Good.\"  The Fast part is 100% correct.  They get you in, ordered and a sandwich in your hand as quick as possible.  Kind of get the feeling that if you don't order fast enough or want to take time to check out the menu you get dirty looks from the cashiers, but it is what it is.  Good sandwiches with fresh deli meats.  My only big gripe is that no matter how many times I ask, I never get the extra mayo I order on the sandwich.  I have found a loophole and if you ask for some of the to-go mayo packets once your sandwich is done, you can save yourself the disappointment of biting into your sandwich only to discover that they didn't add the extra mayo you requested.  Maybe it is just me, but when you get a big sandwich on thick, fluffy bread, sometimes you need a bit more mayo than the standard helping of mayo that is provided.  Its good for a quick lunch, especially when your office is right across the street from it and you have very limited time to get lunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BPfyOyh3zUvWYRTp9ZY5Tw"
  },
  "s5UsKnviUlAui23m-FpEkQ": {
    "date": "7/19/2019",
    "text": "If i could give a \"0\" rating....i would....Stay with me i think you'd all agree. Walked into Southpointe JJs, kid was blowing his nose...No big deal right...Wrong ...came to register, took my order, then proceeded to put on gloves and make my sandwich...Ahhhh....NOOOO...i asked to please wash hands before putting on gloves and making my sandwich....Kid looked at me like i was being unreasonable....Now, I feel like a goof for making a big deal about it,but, how could i eat or enjoy this sandwich...I couldn't...I just simply asked for my money back...Minute or so later 2 more employees are now involved to get my money back....Simple fix would've been 1 of the other 2 employees just offer to make the sandwich....I guess that was to simple, silly me....Sorry,  JJs last time you see me at that spot!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KejpcomcMREiqwDRhFF3Jg"
  },
  "a2ejjkHfkueAN-oQqWQ9Jg": {
    "date": "10/24/2018",
    "text": "I've come to this particular sub joint twice in the past week, and I was pleased on each of my visits. They make fresh, juicy, and thick subs you can't even wait the time it takes them to prepare them to devour.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-rHhQyQJtQsPSFuKFNQnqg"
  },
  "F5Zm7ZQNOKRFR5gk5JkuaQ": {
    "date": "1/16/2018",
    "text": "Love Jimmy John's and this is a great location.  They keep the customers moving even during the busy lunch rush.    Every morning when I walk into work you can smell their bread baking.  I don't know how they make it taste so good, but I don't think any sandwich place has better bread.  My favorite sandwich is probably the Vito.  It is their version of an Italian hoagie and has great flavor.    I do wish they would add some more options to their menu or maybe have a sandwich of the month.  But they are great at what they do so I guess that is why they stick with what they know.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "HjTAeQzi55amz5IxMXEJSw": {
    "date": "11/14/2018",
    "text": "Every time that I've come here, I've had a great experience! There's always great music playing, the employees are super friendly and very helpful! It's amazing on how fast they are!! You will literally be in and out of here and the food is great! I always know when I want a tasty hoagie I make sure to go here for lunch",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pAF0N2AJ8ZV0RlXsUhj9rw"
  },
  "9--BeFdWLN3mFqTTRw76nw": {
    "date": "3/30/2017",
    "text": "The sandwiches are ok here. I've had better. They put way too much lettuce on the subs, even when you ask for less. Maybe the key is no lettuce? The bread is good though and I do love the pickles.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "1GiKceZwKkFyweyx9DGm3w",
        "caption": "Photo of Jimmy John's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1GiKceZwKkFyweyx9DGm3w/o.jpg"
      },
      {
        "img_id": "cBEy4BlCUIOvd2cA_kRwQA",
        "caption": "Photo of Jimmy John's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cBEy4BlCUIOvd2cA_kRwQA/o.jpg"
      },
      {
        "img_id": "yPHwiwQW8S4h8c4VdHhZZA",
        "caption": "Photo of Jimmy John's - Pittsburgh, PA, United States. Pepe no mayo.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yPHwiwQW8S4h8c4VdHhZZA/o.jpg"
      }
    ],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "QKtcqXeXTLtJcaVvjfcRPw": {
    "date": "11/22/2017",
    "text": "Location: Few options to get a quick sub on Grant Street in Historic District. This is one of them.  Restaurant: They always shut down the bottom floor when they can. This place gets hit in waves due to business crowds.   Food: It's Jimmy Johns. They're philosophy is fast food. It is established under a quick productivity system. The food comes out slow for the design. The toppings are basic and they get edgy when you ask for cucumbers or to sit on the bottom level.  Service: These people aren't infused with a drive and desire to make your sandwich with a smile. They seem lethargic and unhappy. It's a bit depressing to go there and I recommend delivery which takes a while.  Overall: If you have to but don't go out of your way.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WqcLRN3fFAk0fI94xBnpCA"
  },
  "H9ThvS_2T6JRhTansR3MfQ": {
    "date": "6/8/2018",
    "text": "Jimmy Johns is a great franchise. Downtown Steel City ordered a big Italian,8 in, no mayo, hot peppers, pickle on side. Fresh as usual, but could not even taste the peppers. So, minor disappointment in an otherwise good meal. Pickle excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ckd5oA7Zv75xOeSaUlkl7Q"
  },
  "DzsTLCpOv5kzjA01eTgZwg": {
    "date": "2/13/2018",
    "text": "I was there during the peak lunch rush and my gosh, I was impressed by how quickly they got everyone ordered, fed and back to their daily grind!  Their prices were really low for such quality deli sandwiches. The bread was nice and fresh, as were the deli slices and veggies. Definitely try this location!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "_O5ajREINPG9zeyhW5Dmqg"
  },
  "UA1J-1qjI76GVh6hLr_Evw": {
    "date": "5/14/2017",
    "text": "What can I say, it is freaky fast.  This particular location makes good on that motto even during the lunch hour rush.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B-60XQ_fR72PevFzHM-ieQ"
  },
  "gTd3_ymCfdsPq4VJ36b7jg": {
    "date": "2/22/2016",
    "text": "Stopped by for lunch last week and ordered my usual.. Club Lulu. It was delicious, affordable and staff was friendly. I stopped by around 1pm and it wasnt too crowded.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "zRhMKN7LZGeeWql97bFKYA": {
    "date": "9/3/2014",
    "text": "Freaky fast! Ok so I enjoy Jimmy John's the food is good and a great quality. As far as sandwiches go you can find cheaper but the fresh ingredients here are worth the cost. It's all about the bread and if you go in grab a 50 cent day old loaf for the road. With that bread as your sandwich canvas you cannot go wrong in your own sandwich creations.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2YVGKKcup6mjQmDQ6arEg"
  },
  "YlNNdDsrDZWekbE2nx6Xzw": {
    "date": "3/13/2017",
    "text": "My husband got food poisoning here 2 days ago. So bad he had to be hospitalized because he was throwing up for over 24 hours. Dont stop here like we did. Keep walking.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EgWkjMiC_xhv1Skfz63N4A"
  },
  "oU40B2gRkAzqoyLjIIUu7A": {
    "date": "1/28/2018",
    "text": "Driest sandwich I've ever had. No cheese? Won't return. This place makes a very boring sub",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vS1k3-UfVKHgl1lnGrmiSg"
  },
  "O4P_VG4RG03khGuAdvUyPg": {
    "date": "2/27/2016",
    "text": "My favorite place for sandwiches whenever I'm going back home.  Love their services, always fresh food .  tuna sandwich is my favorite, best breakfast ever!!!  Alll in all their fast , no matter what time..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KBM9SE0AsnU9qvNod8DKPg"
  },
  "fPp0lFqG6Es5aS0TqNp6DA": {
    "date": "2/22/2017",
    "text": "Best Sandwich shop ever!  Huuuge  subs.  Quality is A+",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nDJgBrK6pLG3jj_PYcYzDA"
  },
  "sptcfy--hoKxOwjyZsTs-g": {
    "date": "12/6/2017",
    "text": "If you don't like mayo, don't order from here. They put mayo on every sandwich, even when you specify not to! My order has been incorrect 9/10 times. Whatever you ask them not to put on the sandwich, they put on the sandwich. Whatever you add to your sandwich, they leave off. This is the absolute worst place I have ever ordered from. I am writing this review just as my 2 coworkers are receiving their Jimmy John's order. One coworker's sandwich has mayo on it and it shouldn't, the other coworker doesn't have peppers on his. Yesterday, a third coworker got the entirely wrong sandwich. It was so bad, she had to throw it away and go without lunch!!! It's not rocket science!!! COULD YOU PLEASE READ THE SCREEN WHEN YOU MAKE THE SANDWICH???!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nP8HCR4fhnGwetV6Kk1dVQ"
  }
}