{
  "sr6TnVR7L4j-y3YhQ7vqCQ": {
    "date": "4/28/2016",
    "text": "Food tasted good and service was excellent. Within a few hours me and my 3 coworkers were all on the potty though so that kinda killed the review. We all had different dishes and compared notes and couldn't come to a consensus on what happened.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "twFGUPUZ5Q0nFzE9Tjs_bg"
  },
  "1vVVKXuMi9-EycwXH6QWiQ": {
    "date": "8/31/2013",
    "text": "If you like a traditional pizza, this is the place. With crusts in three thicknesses, fresh ingredients, and pleasant atmosphere, Vincent's of Greentree is one of the better pizzas in the Pittsburgh area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XcxtzTjBwKMxgaaQNtho9w",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States. One word for you: mmmmm",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XcxtzTjBwKMxgaaQNtho9w/o.jpg"
      }
    ],
    "user_id": "ZQce9O-8-D8NvnsY66qMAg"
  },
  "nqFOgLeCSOEHrnh3PE034Q": {
    "date": "3/24/2012",
    "text": "The inside of Vincent's has the distinct smell of wall-to-wall carpets and fried food - not necessarily 'bad,' but certainly pungent.  I'm glad we came here on a nice afternoon when the deck was open.    We split fried zucchini, which was delicious, sliced really thin with homemade marinara for dipping.  I got the buffalo chicken sandwich and my dining companion got the italian calzone.  Both were good - fresh ingredients and lots of them.  The portions were absolutely huge.    Overall, the service was fine - no major issues.  Good place for casual dining and good bar food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eO4ioSRw269n5g1A2kd6Ug"
  },
  "nYEr47FQsc6pTrreYlvdkg": {
    "date": "11/24/2015",
    "text": "Had spinach ravioli in Marinara.  Homemade Marinara.  Excellent Marinara!   Ravioli cooked perfectly al dente.  Garlic rolls were good, but not nearly enough garlic.  House Chianti rates a C.   Atmosphere of a road house.  Service was peachy.  Prices good.  Would definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aVAFBf7ywvQChcBAjcdWOg"
  },
  "KloIrv_RBYA4ze4pQuwt2A": {
    "date": "10/31/2013",
    "text": "Food is mediocre service is lousy. I'm sitting here right now and have been out of water and done eating for 20 min...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h2u6zWZSAnwVg28I2AmPZw"
  },
  "c2JhwbURzuD6oQahemtWjw": {
    "date": "7/16/2012",
    "text": "I don't know what anybody sees in the pizza.  And it's expensive... The cheese can't be real cheese (it tastes like margarine, because fake cheese is just oil).  A cheese pizza should not be greasy if that's all there is on it.  Crust (if you want to call it that) is the consistency of what you get at the mall foodcourt or a fair.  No thanks.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "P0AhWEmFdfEzw-93ws61cg"
  },
  "rP1uPjWpmrZI6xakXpoPFg": {
    "date": "12/19/2014",
    "text": "We stumbled on this place on a Friday night. The place was moderately busy, but we were seated right away. The server was friendly, but service was pretty slow considering how many servers were working. We ordered the artichoke hearts to start - I recommend staying away from those! They were around $9 and had obviously just come from a can and had some Parmesan cheese sprinkled on top. The rest of the food, however, was delicious! We ordered the spinach pizza with white sauce and an Italian calzone. They were both HUGE and the pizza was one of the best I've had.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wUn3QApvMozO1ddPgfrUKg"
  },
  "wF80LknO8_5T4d-K9aQbRw": {
    "date": "7/19/2013",
    "text": "Although the food is wonderful the service makes this a place to avoid.  Three different waiters still could not get the food to the table correctly. We did not receive drink refills. No plates were brought out with the appetizers. Hard to eat the artichoke hearts without a plate.   One member of the party did not receive her salad until everyone else was finished eating. Manager was absurdly rude and down right rotten. Waitress had a bad attitude.   One of the best calzones I have ever had but I will never have another from there. No matter how good the food there is no reason to be treated badly at a restaurant.   My recommendation - AVOID THIS PLACE!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4eEJ4CtM2lB9lxlzPfkHJA"
  },
  "ulQqODilqYp9j9UeUP_Tww": {
    "date": "5/28/2013",
    "text": "Expensive, slow, but good food if you don't mind the wait or check.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5cuAGCmSZrT510080HNGWA"
  },
  "Waa_WYMuTFUshD4D591xzw": {
    "date": "4/16/2015",
    "text": "Well don't look at the menu online and think those are the prices. Each item we ordered was more than the item listed on the online menu. That's ridiculous. Honor the menu prices online- period. When I called about it, I was told \"sorry I don't handle the online menu.\"  Ummmm- ok. The starter combo platter came with 2 provolone wedges. I mean- for $12 you couldn't have more? And it was extremely soggy. The salad was average. For $14 for a steak salad, I expect more. I will never order from here again. Lower your prices- the food is less than average. And I've never left a review before for any restaurant but felt compelled to do one for this.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GDKQFUmJuRQyvU431hXsGA"
  },
  "txS3r5o_uE1Luib1tnQ4mA": {
    "date": "12/5/2009",
    "text": "After a long enduring 12 plus hour trip to Pittsburgh, my shuttle driver told me about the delivery service at Vincent's and suggested their food was worth checking out. Overwhelmed with work at that time of the night and unfamiliarity with the area prompted a quick call for their Ad's Rockin' Pasta ($17). I was initially told the delivery would arrive in 45 minutes to an hour, but the food came knocking on my hotel room sooner than expected.   The complimentary mini garlic buns were cooled by that time. It was over-buttered but yummy nonetheless. It was a delight to see the whopping serving of pasta after not having anything to eat all day. Thankfully it was kept warm by the plastic container and comforting with every bite. The generous servings of angel hair was filled to the brim with juicy chicken slices, very few shrimps, mushrooms, roasted and hot peppers drenched in a mild marinara sauce. The flood of sweet and semi-savory marinara was not the ideal and the peppers also did not make an impression. The quality of the pasta was overcooked and oversoaked, but the pieces of chunky chicken were tender and delicious. The side salad did not look very fresh and was not newsworthy.  I didn't get a chance to visit the venue to get a better impression of the establishment, but as a delivery service I thought it was fast while portions were very generous. Value wise, kudos to them for having a $5 children's menu for those at the ages 2-10. For my dish however, I still consider it overpriced for what was supposed to be their fanciest pasta dish. 2.5 stars for the experience.",
    "rating": 3,
    "rated": {
      "funny": 9,
      "useful": 12,
      "cool": 12
    },
    "photos": [],
    "user_id": "0juzbrgcLHqobdK-OZAyiw"
  },
  "0MlgqCeznOq6fTw_yZXLeg": {
    "date": "8/18/2013",
    "text": "Vincent's has excellent food and awesome service.   On my recent, second, trip to Pittsburgh I ate there all three nights I was in town because I was blown away by the food and especially the servers.  The restaurant was clean, inviting and felt uncrowded even though it was busy.  I will definitely eat there again on my next trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vh5i32HG7dfEQVqwVMIPiA"
  },
  "0Xk9StPR7UvseRgouSJerQ": {
    "date": "9/11/2014",
    "text": "So I walked in 20 minutes before closing and the waitress welcomed me right in with no problem.  I tried their pizza that i enjoyed mainly because of the fresh ingredients and hard crust.  They had a nice size patio which I will be back to sit with my friends next time I'm in Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hTB902kgzq5WC4vVx6NbDA"
  },
  "2yM_Lt53Wz3U2qaxd3vMHA": {
    "date": "8/28/2012",
    "text": "Had lunch there today. Nice deck, fair service. A+++ for the muffaletta. If you go there and don't try this sandwich it's your loss.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HtiKpiuQ2xeN0Bg4b0e2Rw"
  },
  "AT9ekjbTeBRMY2kR411tUg": {
    "date": "10/14/2015",
    "text": "The pizza was good, but come on that was no medium pizza.  I know I'm a big guy, 6'2\", but when my entire hand can cover the entire \"medium' pizza someone is pulling someone's leg. I almost called the waiter back to tell him we did not order the small. Oh, and did I mention there is an upcharge for salami, $2.00 more for a medium pizza. Here is my take on the pizza. No, its not a medium, its a small pizza. Don't upcharge on the salami then hide it under the cheese so I can't see how may pieces you actually placed on the pizza. The pepperoni was about the size of breakfast sausage and tasted ok. The price, as others have mentioned, is high for a pizza and salad.  The wait staff were friendly and on the day we went the place was very busy with a party upstairs. The wait staff apologized for delays and served us as quickly as they could. Next time I am in Pittsburgh I will try another pizza place.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UiVH3--QrnIYyYCXWLw8rQ"
  },
  "qcJCp5haXHrjK4W7sEMLrw": {
    "date": "5/7/2013",
    "text": "I ate here two days in a row because its the only place close to my hotel. First day Pasta Siciliano(sp), OMG so good!!! I never take anything go, but with this I had to. Soooo, good. Second day, I decided to order a pizza for delivery. Delivery took 45 minutes, the pizza was soggy. I called Vincent's told them and they took care of everything. Offered to send another pizza, but I don't have time to wait another 45 minutes so they refunded the charge. Great customer service and friendly. I give them 3 out 5 stars simply because the pizza was soggy, but the Pasta Siciliano was delicious(should have ordered it again).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nwRJ7wP51VFVSsNhqSO6zQ"
  },
  "AyxS-MtgyxFnkY0Xc0T3xg": {
    "date": "1/9/2015",
    "text": "Best pizza in the area Italian subs are good quality Service was A1 but ya gotta watch out for the Psycho dishwasher or busboy every 2 minutes this guy comes strolling past our table cracking his knuckles giving us the Evil Eye really weird",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uR9h4uJY0iMhd7PZfd0B5A"
  },
  "4dTwX9jc_46yldHi_io5cw": {
    "date": "6/27/2012",
    "text": "There are no words i can use to truly describe just how great this place is!!!! Genuine popular italian food, that will easily send your taste buds into the best orgasm youve ever had!!!! I got the Italian Calzone, and WOW it was huge and stuffed full of fresh meats, sauce, ricotta, and i think it was mozzarella cheese. All fresh, with dough made from scratch, and seasoned to perfection!!!! The service was good, the place was clean, and the smell, made you hungry for the food!!!! Vincent's of Green Tree is  more than worth eevery dime!!!! If you want a taste experience that will take you straight to Italy get there fast you'll thank me for it!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l0rDg4rxmeGsVlxgL7614w"
  },
  "8G5mf3hrK40V34i33o_Avg": {
    "date": "8/16/2010",
    "text": "I'm usually in Pittsburgh once a year and each time I come to town I typically have Vincents. Their NY Style thin crust pizza is just awesome and the service is typically pretty good. Regular crust is good as well if you want  something a little bit thicker.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "q1LBgpVth9NbvTqXTg32Ng"
  },
  "u7YjEvczshYDW3Xc3qshfQ": {
    "date": "3/11/2010",
    "text": "Just read my review of Bados and you got this place . No breakfast here though but this place has two things Bado's doesn't . 1. a great deck to eat and drink 2. Free parking .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vaNvEgtznFwSPDNkbM7hjA"
  },
  "9DIrt6_KoemcoVTweLyuEQ": {
    "date": "2/3/2017",
    "text": "Worse service ever!  I have. We have been here a couple times and everything has been great,  but the service we received today was deplorable.  The waitress needs to be retrained on how to speak to customers.  She was rude!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nw6YuEESuNn037ZSCHSMtw"
  },
  "OrMiFzZMMBpBbUMlKATM5A": {
    "date": "11/7/2014",
    "text": "Just moved to the area so I am looking for a go to spot. Vincents isn't going to be it. The food wasn't great it was just ok. I had the italian sausage. The prices are reasonable and I got my food in a timely manner but no personal customer service. I sat at the bar and literally no attempt to have any dialogue except get my order. No other options ill go back but that's it. Or I may try pizza and have it delivered.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PzNcdJaz0ld6TaTD43S4cw"
  },
  "7xBvKBG-JfEOJkcKBJ-tNA": {
    "date": "11/27/2016",
    "text": "Overpriced for the quality of food. I had the thin crust pizza - soooooooo soggy we ate two slices and threw away the rest - $20.  Burger was good, but at $10- not worth it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cnc8_E9P85jnOKlCo4qKxA"
  },
  "6EzL5Du3OKphe9w5XvJ-cw": {
    "date": "11/25/2016",
    "text": "We have been told to try this place for a couple of years since moving into the area. People raved about the food. So, we had a friend in from out of town and decided of all places in the Pittsburgh area to go - we'd try this. It's was underwhelming. The salad was awful - how do you make an awful side/garden salad you may ask. By giving your customers the gross parts of the head of lettuce, mixed with bitter veggies and the wrong salad dressing for both. The pasta on the other hand, was good perfectly and the sauce was decent  - it was good enough for me to take home the leftovers. This place has a ridiculous amount of potential between it's location and aesthetic appeal but yet, disappointed all three of us. It came across like a dive bar and not in a charming way. I truly hope the owner(s) begin to catch up to 2016 to reap the rewards of this potentially amazing restaurant. And, I hope the staff starts to take pride in where they are working. There is nothing like this in the area but that doesn't mean you slack and settle - it means you create and evolve with the changes in food, dynamics and demographics. We'll try again but, maybe when the weather is better and we can enjoy the patio.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4HWG2E7pIweFJNJ0LNzBOQ"
  },
  "xzm2q7Oo6eiS8EbOZbDcUQ": {
    "date": "9/16/2015",
    "text": "Enjoyed a dinner with colleagues at Vincent's in Green Tree.  Nice evening outside on the deck and service was quick and courteous with good recommendations.  The two favorites at the table were the Mediterranean Salad and the pizza.  I would definitely recommend dinner at Vincent's if your looking for a sports bar atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RNA6gFmedRx9rK1O8_QmtQ"
  },
  "wJwMGKOO-gqaeLh_A_3CKQ": {
    "date": "8/21/2014",
    "text": "I had the buffalo chicken pizza and really enjoyed it! Good quality cheese and chicken.. Hearty proportions.. No complaints !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pXFbXy_8S36V5kzicY15uQ"
  },
  "6fmTC-kpMGfhCjL5NetP1A": {
    "date": "8/4/2015",
    "text": "3 stars since the food Italian food was quite good. Stay away from the burgers. We recently ordered take out 2 nights in a row. Fast service, but the orders were incorrect or missing items both nights. The lessen here is, the knuckleheads in the kitchen are unorganized. You would be smart to take the time to look things over before you leave. Once you get home, \"oops, we're sorry\" doesn't cut it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AGelv_lDrTP98wcpt0pgxg"
  },
  "huXCK9YJIX89kLoWkU0qRg": {
    "date": "7/29/2015",
    "text": "Went there tonight after being in the road for hours. Didn't get there until 10pm, and they treated us like it was prime dinner time. Food was delicious- all three of us had pasta dishes with salad. Their little rolls are the best. Homemade food. Our waitress was great and treated us wonderful. Would go back again- next time we won't have to be so late.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bx-JNvhV7XobFQFf_rIRVw"
  },
  "IYeRfDLK9evoqRmIhcT6zQ": {
    "date": "4/12/2015",
    "text": "Pizza was good but really expensive. I also got a 6 pack that cost 14 dollars. The same 6 pack cost 7.50 back in my hometown.  When it was all said and done our pizza, wings, soup, and 6 pack cost 50$.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JWtCmVYFFcAa8AsLi01moQ"
  },
  "LvBZtjenSZJvMn8iRsJWaQ": {
    "date": "5/1/2016",
    "text": "Pizza isn't just pizza. Everyone has a different standard for it. For those that like Sbarro's or pap johns. You will enjoy this place. Why a 4 and not a 5? It lacked topping substance. I ordered a meat lovers but instead received a lackluster meat lovers pie. I expected loads of meat and cheese. Was a bit disappointed. I suggest, pile on the toppings and give folks what they pay for. May or may not try this place again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m5s9XVp0M0QGdCtCOjJmjg"
  },
  "ft1PYO9E1C_yDlR13ZYKHg": {
    "date": "5/30/2016",
    "text": "Ordered pizza for takeout around dinner time. The pizza was ready on time (probably because there was nobody at the restaurant).  The pizza was ok, the crust was soggy, and it was kind of plain and could have used more toppings.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a-9l7BRysSwMITLQtPHLrw"
  },
  "h3_TECKgf2O3Npvd2WVg2g": {
    "date": "9/14/2014",
    "text": "Great place!! Tried a different bar in town and was highly disappointed by it so we tried this place and we love it!! The only problem is, they close too early on Sunday, lol. We didn't have the food to eat, but everything they have brought out for other customers looks and smells great! But definitely good drinks, great atmosphere and super friendly staff!! Oh! And they have carry out beer!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hNc8ruA6VD2zD_kKPRW_1Q"
  },
  "q9iTAmNrlW0IbrZfSzroyw": {
    "date": "1/18/2015",
    "text": "We love their pasta fagoli on Fridays.  There were 6 of us and the staff was very attentive.  All of the food was great and we liked sitting upstairs.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O5yWp-s_GDqpIER9efmjxw"
  },
  "1S_FVzwURSqnKtW251_l8Q": {
    "date": "9/18/2011",
    "text": "Vincent's of Greentree is nothing like the castle of horror known as Vincent's Pizza Park. This safe, suburban pizzeria is akin to a large family's home, complete with decks and commodious dining rooms on two floors. I nearly expected to be greeted by the Bradys or the Bradfords. At Vincent's Pizza Park, you might be greeted by Vincent...Price!   He's dead...I knoooowww...  Instead we were met by a bartender who told us \"Anywhere's fine.\"   And more than fine was the food. Baked Artichoke Hearts began our meal in a tart, juicy, savory manner. Dusted with bread crumbs and Romano cheese, each morsel of this simple, elegant appetizer positively bled garlic butter and white wine.   As I stated in a seminal review that has become a cult classic in Yelp circles, Vincent's Pizza Park is a beast that crawled up from the Netherworld to hunt, kill, and devour saner pies like the ones Vincent's of Greentree serves.   VoG's held its own however, pulling a sharpened holy artifact from its satchel and plunging it deep into VPP's hide at precisely the crucial moment, making the evil monstrosity of a pizza cry out in agony to ensure a narrow escape.   VoG's pizza is the Neon Knight to VPP's Thing That Should Not Be, the errant warrior-cleric to the depraved troll that is a VPP pie.   <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DXZkIkTxgu4k&s=6ec3c69214117908dfb7919c45e43be7a827fc1a465107940deb61e95b4bd8ea\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=XZkI...</a>  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DLIj60VJQ8Wo%26feature%3Drelated&s=39b65462b3b79d1b9783745b4c0589b39d56af786f8fa1dd701975d9d3c567f0\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=LIj6...</a>  VoG's pizza has a crust with a luxuriously plush yet chewy and gently crisp texture that makes arriving at the end of each slice a pleasure in itself. A Manna of a mozzarella/provolone blend coats a layer of tomato sauce so ruddy, so succulent, it may cure vampirism by providing an alternative to blood.   Making this pizza all the more special was that it was a Seafood Pizza. Topped with a medley of scallops, clams, and shrimp, everything came out of the oven unscathed, not one thing at all lacking in undersea flavors. Seafood pizzas are a risk-taker's pizza. They're not always bad; they're not always good. VoG's was a victorious oceanic feast on a bed of dough.   Having had enough food, we skipped dessert, but don't skip Vincent's of Greentree. They are worth a fly-by.   P.S. I'm knocking off a star for a server that was inattentive at times.   P.P.S. That seafood pizza can be had with either white or red sauce.   P.P.S. They are open late most of the week, closing at midnight from Monday through Thursday and 1AM on Friday and Saturday nights.",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 8,
      "cool": 9
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "tDQLCIGDS1hKhdqRh5cl1w": {
    "date": "9/13/2011",
    "text": "Who knew french fries came on salads? Pittsburgh did.  Salads are good. Pizza looked tasty. Service is helpful (when you can find it).  The pepper steak salad is pretty good - get it with ranch. Or instead, just get a plate of those garlic knots. They're the best thing there.  And the comment about helpful service - when I went to pay the bill it was too windy for me to leave it out on the table. Instead I went inside and it was a no-man's land. No person working could be found for a good three minutes while I stood there with my bill in hand. I mean, what kind of place is dead empty of all wait staff, bartenders, or any person who worked there for that long during the lunch rush? Seems odd.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "zesQ28ZSEF0P6vueSne0gg"
  },
  "6q9wsPpjG71-ugGIFtIfxw": {
    "date": "6/27/2016",
    "text": "Sat outside and had a great dinner.  The food was delicious and the service was very good.  It's very close to hotels, so a really nice change from hotel food when you're on business travel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8esVzh4CCzMdyaXponSOIw"
  },
  "2U9PkSNsivW_uGQKoHuh0g": {
    "date": "3/13/2014",
    "text": "The portions are Huge. I ordered half of the antipasto salad and it was still enough that I was satisfied. They should cut up the meat as it was slices of deli meat thrown into the salad though was a very good salad overall. I also ordered wings and was very impressed with these. It is hard to find the right wings that have the right amount of meat to breading mixture. They even make for a good treat on day 2. A friendly patron bought me a cannoli which was amazing. This was my second visit to Vincents and I look forward to a third.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pdz4l3jZDbLdhML3P6H1mA"
  },
  "cOX9452NbkY4BWG2VXObaA": {
    "date": "8/9/2011",
    "text": "Have mixed Vincent's.  My meal was good (spicy pasta) but service was spotty.  Another in the party had the homemade gnocchi and it was not good at all, \"tastes like dishwater\", was the quote.  Naw, that couldn't happen to homemade gnocchi, after a taste, I agreed!  Just goes to show, it depends on what you order.  Oh yea, the parking lot, very big but some customers parked in the entrance on both sides to make it one lane and of course when we were leaving we noticed that one guy was taping his car where it had be hit.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "luah3KjrlRtyl3kAoyEQKQ": {
    "date": "1/9/2015",
    "text": "One of my standby restaurants when I'm in the Green Tree area of Pittsburgh. Small Italian calzone would be plenty to share between two people. Their wedding soup is very good and I recommend it. Good Italian food for those that tire of Olive Garden or Fazoli's.  In nice weather, you can dine al fresco on their deck. Casual atmosphere, no dress code. Never had a bad meal here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A9SaanMMAHwUArNIDMQnYA"
  },
  "xe0X0qfF01I1GpTsoUTSzw": {
    "date": "3/20/2014",
    "text": "Service was good but probably the worse pizza I've ever had.  We couldn't eat it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KXnM96aJKAT8Gaz1P6auTg"
  },
  "heF8dkx7tCPE2079wegd5Q": {
    "date": "4/30/2017",
    "text": "Take out was . Food was fresh and hot. The family loved the Chicago crust. Definitely going to try dine in to get the full experience",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HL4cUIpYcDegPl8WZtr6Mw"
  },
  "hj4CzmRyXFVNQ6BKmJfQXA": {
    "date": "1/26/2017",
    "text": "Great prices. Vincent is a nice guy. I love the Buffalo chicken pizza. The portions are huge. Easily shareable. And the draft beer is nice and cold. Good place for a slice or sandwich and a drink.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "91kobM-jjYrLudkrfIPz3Q"
  },
  "eRqDfLilDlyWcjwXms-ovg": {
    "date": "6/26/2016",
    "text": "Vincent's is a solid local pizzeria. Everything I've ever had here was above average. I love their spicy pasta with sausage instead of pepperoni, and my Girlfriend could eat their beans and greens 3 times a day. But to me, the thing I love the most is the crust on their calzones. Most of the time at other pizza joints your calzone is soggy in the middle and the crust is overdone on the bottom. Somehow at Vincent's they have perfected the art. I once got a to go box, just for the leftover crust. Delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bleyhN--91eJmPyJpXr9Mw"
  },
  "Or74x5u1jb7caRifFbVzdg": {
    "date": "2/13/2017",
    "text": "Over priced, food is of low quality. I will not be coming back! Word of advice, spend your money elsewhere",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dbjkb6ZzH2Wv4x7nJb1DnQ"
  },
  "JAVYOH-Qssh-2fMUJ4s-AQ": {
    "date": "9/14/2016",
    "text": "The pizza was one of the worst pizzas I have had in awhile.  We ordered a large and it was the size of a small/regular elsewhere.  We have been ordering from Mineo's instead and it is much better.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f-VFuyiqWrd-hxi_zXBeNw"
  },
  "2DDS3rOXoo0_XFVx3-ZXpg": {
    "date": "10/16/2016",
    "text": "The pizza here is amazing, but you're better off carrying it out. Wrote them off years ago due to slow service, but gave them another shot when some family wanted to meet there for dinner. Still amazingly slow, like 45 minutes to get a pizza and some pasta.  And no one checks on you while you are eating, or cares how long it has been. After all that, one dish was cold, and one was wrong.  Had to get up from the table and find a server just to get some service. We complained, but our server did nothing but blame the kitchen. Wont be going back as a restaurant, but maybe get something to go.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2N4VBte7Pn9joYiGSj21QQ"
  },
  "HpTjS-tjwjEAsiRrK7f8MQ": {
    "date": "6/9/2016",
    "text": "We love Vincent's. We got married in Scott and wanted something close, convenient, and laid back for our rehearsal dinner. My family and I went here growing up and it seemed like the perfect fit. The food is awesome, the service is great, the price is right, and it's just overall a really nice place. We were so happy with our rehearsal dinner at Vincent's. We had the upstairs dining room all to ourselves and it was the absolute perfect place. Did not disappoint at all. In addition to great food and service, the outdoor deck is really enjoyable for summer dining.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UaNIHnSMiUOcR3qwKe5_0w"
  },
  "d00Wc7-SrC8a6mpGUMPYtw": {
    "date": "4/7/2016",
    "text": "I must say I was not hating this place. Located super close to my hotel I ordered take out one night and ate another night at the bar. The food is classic, nothing fancy. The pizza was great and they have a decent selection at the bar. This place is just what i needed close to survive a week alone on business.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RkJOXXgXPCPgSneAGVUNxw"
  },
  "uGm-SzBWmGBEsx1Iou9WaQ": {
    "date": "10/12/2016",
    "text": "This is the third time that I have been at Vincents. Since I am out of State I do not have the opportunity to visit Vincents on a regular basis but if I lived in the area I would be a regular. We placed an order to go for a party of 8 and we were so impressed with the quality of the food. The salad was excellent, the antipasto was fantastic and the pasta was great. The portions were very good and when I am in the area again I will be sure to visit VINCENTS.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6jMeqm_-UH0koAYi81WqOg"
  },
  "KPCQ2z2VXKULMBO-ILn48A": {
    "date": "1/15/2017",
    "text": "My wife and her friend were in town for a function on the way home they decided to stop at Vincents of Greentree.  It was a Friday night about 8:45pm when they went into the restaurant.  My wife said that she ordered the pasta fagioli soup and a pizza.       She said that the soup was the worst soup she had ever had.  The pizza was fine.  After taking one spoonful of the soup she handed it back to the waitress and told her it was not good.  The rude and ignorant waitress told my wife \"I told you it wasn't good\".  She was not offered anything else and it was not taken off of her bill.     My wife was not sure what was worse the pasta fagioli or the waitress.  They sat upstairs and it did not seem busy possibly giving an excuse for the poor/terrible service from he waitress they had.        My wife and I USED to frequent Vincent's of Greentree when we were in the area.  After this episode we will NOT be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1TdG47pE29g99G0e-THrSQ"
  },
  "IO08LwGfFrGKqm8y8MYFzw": {
    "date": "10/17/2014",
    "text": "My mom and I went here for dinner while visiting Pittsburgh. It is a pretty small building, maybe about 15 tables total plus a bar. You can sit wherever you want. It's a casual, bar type environment.   Our waiter was friendly and prompt. We both ordered the pasta primavera with chicken. The portions are huge-- I have enough leftover for two more meals. The sauce was creamy and flavorful, and there were enough veggies. The side salad was a bit lacking-- it's just iceberg lettuce (my mom says there seemed to be romaine too) with some olives and a couple grape tomatoes. They give you these awesome little garlic knots with the salad and entree. The dessert was the highlight. I ordered the homemade cannoli. It was a good size, plenty to share between two people. Delicious crispy shell, amazing ricotta filling with chocolate chips, covered in powered sugar. It was just as good as the cannoli I'd had from an award-winning bakery in New York City!  The prices are around what you'd pay at Olive Garden, but the food here tastes homemade and fresh, and the portions are large. Nothing pretentious about the place, just good food!  We drove past twice trying to first figure out where the restaurant is (from the address you think it's on the other side of the street) and then how to enter the parking lot. But we found a spot okay once we managed to get there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDx3Ga0TURVCtJqW19iUQQ"
  },
  "VydvRiI-HIzNv746qtMquw": {
    "date": "11/14/2015",
    "text": "I thought the order I received was pretty dang good. I was staying at a local hotel and ordered the calzone. It was so big I had to have it for lunch the next day. The hot sausage was nice and spicy.  They told me 45 minutes on a delivery and it was here in about 35, which is always nice when you're on the road and hungry.  I would definitely order here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q5TnAPZ5HFWV4xB1BrlJvA"
  },
  "A4OCMIDRFMOUtrPmKAyFsg": {
    "date": "8/4/2017",
    "text": "Food is typically very good but we have been waiting 45 minutes for a hot sausage sandwich and pepperoni bread. Absolutely unacceptable service. I have been a lifelong customer and it will be a very long time before I return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KwfNQMTcH6TgwZ8IdmLzTw"
  },
  "QR0vsjMi5g5xKzHPASYtew": {
    "date": "2/23/2016",
    "text": "Seriously let's all get a grip, gnocchi homemade that is, isn't this soft little pillow pasta, the stuff your selling isn't homemade, it's bought in. I've eaten gnocchi from coast to coast my grandmother made it for us, my aunts, made it for us, right here I in wintersvillle at da peppino they make them home made. Delicious, your gnocchi is crap, your sauce is bland, I can open a can of sauce and pour it on anything, doesn't mean it taste good, do you taste your creations before your send them out?  Epic Fail.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YbjCagpr9soEGJnjc6Mg3A"
  },
  "cUOfu6GboCvDjk8PZVKFFA": {
    "date": "8/7/2017",
    "text": "Pizza is really. Service is HORRIBLE! So slow and the restaurant is empty. Sat at bar, bartender could care less about waiting on customers.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E1LJEnecyBg1kV2m3bp4WQ"
  },
  "hqr9n8hVipxCxClHT550Pw": {
    "date": "11/12/2014",
    "text": "We've been here twice and the first time wasn't so great. We started with baked artichokes which were super tangy and swimming in oil. I had Pasta Siciliano and hubs had Pasta Mafaldo. He ate more of mine than his own. The Mafaldo tasted pretty bland. The pasta Siciliano was better but nothing to write home about and I wouldn't order it again. The bread at Italian restaurants is normally something I look forward to but this was like a regular roll with olive oil and Parmesan cheese on top - ehh. The cannoli was the best part of the meal.   Visit two was much better! We started with the homemade hot stuffed peppers which were phenomenal! I had to make myself stop eating to save room for dinner. We ordered spaghetti with meatballs and pollo divino pizza. The peppers were the shining star of the meal! Second would be the pizza because it was interesting and delicious. We ordered with white sauce and it perfectly complimented the chicken and cheddar. The overall spaghetti was okay but the meatballs really made it slightly above ordinary.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sGXM9dLm2X_JlYFLRpqyPw"
  },
  "cSYnkVIA8ymd4sdjYdnVwg": {
    "date": "7/10/2014",
    "text": "I went for dinner July 10.  Tight quarters inside but nice outside covered porch..Small inviting bar. Parking lot is full of potholes. It wont take much to fill with small stones but nothing has been done for years. It would be nice for customers to the fill potholes.  Friendly staff . I ordered a Italian Hoagie and my wife had Spinach Ravoli. Waitress was nice but never asked to refill our drinks. My hoagie was dry with min meat. Bun was OK. My wife liked her salad. Both was very avg food in tight spaces and service could have been more attentive. Probably wont go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lXEPwm3S6iILKljoeYmWiA"
  },
  "92-s_U1b58e_cVEfPz0vaQ": {
    "date": "10/19/2013",
    "text": "Visited for a meeting on a Thursday evening... upstairs in a flexible space for groups.  Greeted promptly by an experienced server. Beer arrived quickly in an icy mug.   Our group ordered a bit later and the food came rolling in. I had wedding soup and spinach ravioli. Both were very good and served hot. Our server was attentive and personable... no problem with all of the individual checks. (That's rare!)  All-in-all, a very nice experience. Tasty food, fair prices and great service. That works for me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8cxlAgkDaQk5hYPZhTQe5w"
  },
  "W72p_qclPA5xI5nYqhlXhw": {
    "date": "11/28/2011",
    "text": "Not a bad place to grab a bite for lunch. Their service can be kind of slow so dont plan on having a quick in and out lunch.  Greentree does not have many options for food, which is surprising since there is so many office complexes.   Overall not bad.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cxbNoom5vXFvQZKHKtE_Dg"
  },
  "jJ3XJMz-IAkiOI-NIDC8vA": {
    "date": "2/21/2017",
    "text": "Well, I was hungry one day, so I decided to order a pizza from Vincent's.  Being a pizza guy, I'm always looking for the best in town.  I called in the order, and they were very nice over the phone.  As soon as I walked in the door, my stomach began to growl, as it did earlier before I called them.  As soon as I paid for the order, I opened the box and ate a piece right away.  Good flavor!  I just wish they put basil on it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PVQsaSq8z2L7FqFgjfqhpg"
  },
  "ITpVnRbge7vR4u499FhvWA": {
    "date": "1/22/2019",
    "text": "Recently placed LARGE takeout order from Vincent's while staying at a nearby hotel with my hockey team. Food was amazing, on time and friendly staff. Manager even called the day before to confirm our order.  Totally recommend it to anyone looking to bring food back to one of the many local hotels. Never set foot inside the place so I can't comment on that at all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TUeaSS17GYfRb3xsxJ5hSw"
  },
  "JKbmqIIO0eLTWtNmtcb69A": {
    "date": "5/26/2015",
    "text": "A work associate and I came here for lunch one day a couple weeks back.  It is super close to the office and I have heard pretty great things about Vincent's of Green Tree from others and of course Double M on the X gives them plenty of raves while backing up his story with \"When I wasn't on a diet.\"   We arrived shortly after noon.  The place is small, and it was busy.  There is a small bar but we opted for one of the two open tables left.  We were waited on quickly, a couple waters for each of us, then after perusing the menu we decided to split a pie.  We ordered the Italian Steak Fresh Italian steak, green peppers, onions, mushrooms, cheddar, mozzarella, and provolone cheese.  He also ordered a cup of Italian Wedding Soup.    Now I am not the biggest pizza lover.  I like pizza, but typically I am disappointed in one way or another.  So that being said I thought that I would probably think it was pretty typical, however I was definitely wrong.  I can't say this is the best pie I have had locally but it is up there in the top 5.  Even with all the toppings the pizza stood nice and firm.  The crust was delightful and I don't typically like a thicker crust.  I would say their crust is probably traditional, I prefer thin, but this was so light and airy that the texture was about perfect.  I am not sure about the steak they use.  Couldn't tell with the array of toppings if it was more of a steakum type of meat or not, but together it all tasted delightful.    Between the two of us we finished the medium pie no problem.    My only suggestion to people coming here for lunch is it is busy and you will wait.  So if you only have 30 minutes for lunch, I would call ahead, because it took almost 40 minutes from the time of order to get our pie.  Otherwise bon appetit!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 15,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "3FPLFGgjD94-90MYif-pOQ",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States. Medium Italian Steak Pie",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3FPLFGgjD94-90MYif-pOQ/o.jpg"
      },
      {
        "img_id": "X-sTrU9wq6hH87yyUlohkA",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States. Slice of Italian Steak",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/X-sTrU9wq6hH87yyUlohkA/o.jpg"
      }
    ],
    "user_id": "_5fx5gexi9OeZIuukV2gHQ"
  },
  "IWs76uXKfyH_PCPQs5USxw": {
    "date": "2/8/2018",
    "text": "I'd say it's your average italian restaurant. While there wasn't anything particularly wrong nothing was outstanding. I've had delivery too and that was quick and food still hot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xYzTiXmbQoz8BOns0V6iuQ"
  },
  "xMSrRcRgFwuUJRZsP_1d4A": {
    "date": "7/31/2017",
    "text": "Had a great lunch here today on the patio! Nothing better than a little sunshine and a good bite to eat.. had the deluxe steak salad loaded with healthy veggies & tried a slice of pizza.. everything was great. Service was also excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RDwjMJ-SB3ysZ1p0PRpQkg"
  },
  "pbeNUum11jxYkzjbeTP20w": {
    "date": "6/29/2018",
    "text": "This place sucks.. I have no idea how their food taste because THEY KICKED US OUT!! But it can't be good because we went right at lunch hour and they was only 2 people there! We tried to enjoy a nice day on they're patio with our well behaved dogs sitting outside of the restaurant not even near or bothering anyone and some jerk of a waiter came out and yelled at us to \"get our dogs off the premises\" the waiters were VERY RUDE!! I saw many reviews about the terrible service and I definitely agree! We will never go back. I DO NOT RECOMMEND.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oAtZ15ljLJQlDpyS3LWA5g"
  },
  "zWQZJKNq4Ysi_8g3shluZw": {
    "date": "11/15/2018",
    "text": "Hadn't been in years. Popped in recently.  Thin pizza has too soft of a dough. Not baked correctly.   Sauce really tastes jarred.  Way too sweet. Steak hoagie is decent but Italian dressing again is jarred and too much balsamic in it.  Cheese sticks are average at best.   Greatly disappointed.  Many better options in the area than this place.  Has really gone down hill.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4dj21AGoZ9Pki77RktKHqg"
  },
  "4y7bHuLRlcPUIiJrYfNmGg": {
    "date": "2/15/2018",
    "text": "Mediocre Italian food. Ordered take out and didn't realize they gave me the wrong sauce til I got home. Nothing terrible but nothing great.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9JGaK7K8pXDwpKjPIsu08Q"
  },
  "XRoNFvP1j_CkqpijgDdy-g": {
    "date": "7/25/2017",
    "text": "Very nice dinner tonight at this local spot.  A comfortable and casual place with good food. I will be back next time in the area.  FYI. Stuffed peppers are ridiculously good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vow95MB2DLkJQ3wzIzVmnw",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States. Chic parmigiana",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vow95MB2DLkJQ3wzIzVmnw/o.jpg"
      },
      {
        "img_id": "w2uXhP06Y9jMBSug57Lc2A",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States. Stuffed peppers = awesome",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/w2uXhP06Y9jMBSug57Lc2A/o.jpg"
      }
    ],
    "user_id": "b7buFY84DvvDBeW5Wxy2EA"
  },
  "vBHXiXVJm-XfqQR3nImsJw": {
    "date": "1/18/2018",
    "text": "I used to come here a few years back and it was top notch.  I came back after a few years and the place has gone down hill significantly.  Shall i say thin soggy chuck e cheese pizza, without the balls and pedophiles.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MW8AuDJ-9Bw4qW5SHjrg8Q"
  },
  "ysZgr4Y7YoD1NuHqwMkg1A": {
    "date": "1/13/2018",
    "text": "After a very hairy- in both the literal and figurative sense of the phrase- night with my party of five at Vincent's of Green Tree, I faced an inner dilemma on what exactly to do next as we exited the establishment.  As I debated on whether to phone in to the Department of Health and Human Services, order takeout, or head to the internet to vent my frustrations, I finally decided to log in to Yelp to post a review of my unbelievable experience.  If you are looking for a time to remember, this bar and restaurant will not disappoint.  One thing I can say- my first dinner at Vincent's was truly a time I will never forget.    With two other adults and two other children, our group headed in after a long day, hoping for a nice meal with pleasant atmosphere. However, the excursion missed the mark in all categories.  As I headed to the ladies' room, my dinner-mates entered the upstairs area to discover where to sit, as it was their first time as well.  I was greeted by a paper sign with \"OUT OF ORDER\" taped to the solitary hand dryer en route to the toilet.  As I entered, I soon also realized that the lock on the stall door was broken.    When I headed back to my family and friend, I was soon informed that when they inquired about where to sit, the staff member upstairs was extremely rude.  Sans friendly greeting, the waitress at the area bellered in a sarcastic, disturbed, and raised manner: \"There's no seating up here!  You gotta go downstairs!\"    There was no room to seat a party of five at any of the tables downstairs.  They were all extremely small, and so close together it was nearly unsafe to walk and move around.  My father volunteered to sit out in the aisle so we could all fit, as it was admittedly very busy, and we did not want to be an inconvenience.  The waitress quickly served us our drinks, and they were all very good!  However, things soon went downhill once again.  As we looked at the menu, we noticed that everything came with gravy- pizza, breadsticks, sandwiches, and more.  We soon found out that \"gravy\" was some sort of code name for red sauce, originating from New Jersey.    Five minutes passed.  Then ten.  Then fifteen.  Eventually, nearing the twenty minute mark, the waitress sprinted to our table at top speed, obviously in a frenzy.  She asked us if we would like to order any appetizers, and we told her we were interested in the breadsticks.  The waitress then explained to our table that the pizza oven was backed up, and it would take 20-30 minutes for the appetizer to arrive.  Collectively, the table decided to order all our food together, so perhaps we wouldn't have had to wait so long.  Off went the waitress, moving briskly towards the small kitchen, which we could see into through a clear glass window on the door.  I was looking forward to my long-awaited calzone.    During our wait for the breadsticks, I couldn't help but spy what looked to be two cooks coming in and out of the kitchen.  They each were wearing ball caps, without a hair net to be seen; the first had a long beard, while the second was sporting dreadlocks.  In the most flagrant example of cross contamination I have ever had the misfortune of observing, the pair touched dirty glassware, clean glassware, wiped down and set the tables, collected napkins and menus, and served food and beverages, without washing their hands or wearing any sort of gloves.    In a record 25 minutes, the breadsticks (which were not actually breadsticks) arrived.  Albeit the appetizer was actually a flatbread sauceless pizza masquerading as a breadstick, it was still pretty good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k459lgEBx35uvnrl4sBIKw"
  },
  "iqX-b1IFXDMTGoM4GLy1fQ": {
    "date": "11/10/2016",
    "text": "How does this place survive in a city like Pittsburgh. The pizza is tasteless and mine was cold. The Greek salad was good but how do you m as up s salad. The rigatoni casserole was less than you could get anywhere in Pittsburgh.  The sauce is only slightly cooked. It was not the slow simmer sauce \"gravy\" a food love would expect.  Forget this place.  Bob",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nzM6euW3_8T477rmifePPQ"
  },
  "Q31Vo9V1JePDBI2fx1fJww": {
    "date": "8/25/2016",
    "text": "So I was staying at the Holiday Inn in Green Tree PA to watch the Steelers game. On 8-11-16 I wanted to try the local pizza spot so I walked to Vincent's of Green Tree to try out their pizza. Not being familiar with Vincent's I walked into the bar area to see if I could place an order. The bartender I believe her name was Katey placed the order.   While I was waiting Katey asked if I wanted anything to drink and I just wanted some water because of the walk from the hotel. We had some friendly banter and she asked why I was in town. I told her I was here to watch the football game and she said she had been to the football stadium before and that I was going to have fun. During that time she refilled my water. When I payed for the bill I gave her a tip for the friendly service, and for making me feel comfortable while I was sitting there waiting for my pizza order.   Took the pizza back to my room. The crust and the flavor of the cheese with the sauce and the toppings made me say \"Yeah...this is good, I like this\".  Thank you Katey and Vincent's Pizza I'll see you next year for the next Steeler game.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HfVITrHwLU4NRzq4LE7caA"
  },
  "iD-GAiy2rEM-IZTKPJ3Shg": {
    "date": "5/5/2015",
    "text": "On the plus side, this bar & grill offers a decent gluten free pizza. It's not on the menu, so you have to ask (why?), but it's a pretty good pizza, with fresh-tasting ingredients. It's the only kind I can eat, so it was appreciated. I sat at the small bar for dinner, and service was prompt if not all that pleasant.  You just get the feeling that this is a business that may be resting upon reputation, and has stopped trying very hard. Restaurants are a \"people business\", so I feel as though it's a good idea to hire people who act like they like customers and want to make them feel welcome. I did not feel the love here. The wine & beer selection is very narrow, with a few good choices, but not even one sauvignon blanc? Okay, thanks. I'll try someplace else next time. Are you getting the idea that without the decent GF pizza I might have gone with two stars?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Ko1CajA-khSe6OZH4AtDA"
  },
  "TSGtG4Vk3z3ASVaKcHFYKg": {
    "date": "3/13/2016",
    "text": "Never order pick up from here! I have given it 3 chance and each time it has been a complete and utter waste of my time! Each time I have been given a time estimate. I got there on time and had to wait 20 more minutes the first two times. The 3rd time (today) I went there I was told 25 minutes. I get there (25 minutes later) and am told it will be out in a minute. 25 minutes later (now 50 minutes after I ordered) I'm told they have to remake my pizza!!! It shouldn't take over an hour to make a plain pepperoni pizza (plus I was sitting there waiting and they weren't busy at all)! To make this 3rd time even worse, while they were \"remaking\" my pizza, they didn't remake the other parts of my order.  So not only did I have to wait 40+ more minutes to get my food than I should have but half my food had been sitting and was cold!   Terrible customer service and terrible communication between front of house and kitchen! Save your money AND TIME and go elsewhere!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "KlJLlVmCy3OaxNHbGUIj1Q"
  },
  "awnklbGkU5s0-bMNE5r--Q": {
    "date": "4/27/2018",
    "text": "We had the pasta dishes (spaghetti & penne), the gravy had no flavor whatsoever.   It could've at least tasted like tomatoes.   Disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PKr-wgjRGxfkYoZ5IsNi4A"
  },
  "nz0qDTXNkfnpNzHmV7xDzw": {
    "date": "5/1/2016",
    "text": "Basically, it's ok. The food is good, not great, but consistent. Unfortunately, I've found the service to also be consistent in that when I've dined in they are very slow (even when not busy) and uninterested. I've had this same experience when ordering take out. They seem like I'm bothering them when I go in and ask for my order.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xwecV1wwnA_2oZH0GkpZOw"
  },
  "UuAxnDvHFx5mH-8YUilKUQ": {
    "date": "4/6/2018",
    "text": "I've never been to the actual restaurant, but just ordered dinner through  DoorDash and the food is excellent. Delivered in about half the estimated time, very courteous and the food is excellent quality - I got the pasta primavera. This is far better food than most of the crap being offered through the delivery websites.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SIi9C0VRcGtcFHtKb9YAhw"
  },
  "UV4X7oxHXSwtjaNEaBDL1w": {
    "date": "6/21/2017",
    "text": "As someone who travels for work, this restaurant is truly a good place to eat. They have a very welcoming staff and brought us a great dinner. Unfortunately I didn't take a picture as I am at dinner with a business purpose but I will say that my boss and I truly enjoyed this restaurant. I ordered the Italian foot long sub and ate every bit of it. My boss ordered a pasta and said it was amazing! Overall a great place to eat if you looking for good italian",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SPu9cJv159dt9QA08-KCCg"
  },
  "2HDZOe1N-DFHvixPoWbvtQ": {
    "date": "8/26/2017",
    "text": "Homemade spinach ravioli and homemade gnocchi were fantastic with fresh homemade rolls. Service was quick and friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bZDiBl1PUT5pqVgzv68aYg"
  },
  "L7xChbsGHCl0yUTDUCJS5w": {
    "date": "3/30/2017",
    "text": "Great food, prices  very good - quality  and quantity.  Servers super and  always very  pleasant, efficient. My favorite  apps are the zucchini,  mushrooms, artichokes. Pizza...very good. Like the choices for the crust -thin, medium, thick.  Toppings  always fresh & tasty.  A rather informal joint. Some TV's, a small bar.  Also, super for  delivery. Visitors  staying nearby in local hotel's...please  consider Vincent's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hqCCI4v-2ozjyIUXNzFLKg"
  },
  "BMU8SSSMM9DIbGUAiI0Pxg": {
    "date": "5/21/2019",
    "text": "My daughter wanted seafood pizza, so her craving took us to Vincent's. This place had been recommended by friends for some time, and I'm sure glad we finally tried it. It was low key, staff was very friendly, and the pizza was great. Can't wait to go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vT1wVt0FyJW_redctWnoVw"
  },
  "-5rKL4-0EI2GjqgjLqdQ5g": {
    "date": "7/24/2019",
    "text": "Never have been a fan, I only done here when others want to go. I was here today with a group and service was very lacking. We had to ask for the server several times.    The atmosphere is comfortable and clean. Pizza and food are average, nothing spectacular. I ordered the artichoke appetizer and was quite disappointed, they tasted as if they were canned artichokes with a pre-gtr Parmesan cheese. $3 for an iced tea is not very reasonable, especially when served in a chipped up plastic glass. Several plates also had big chips. Prices were above average for the class of restaurant ($12 hoagie).    I know this is a very popular restaurant and all the power to them, it's just nothing special and there are so many other places to choose from that are better values, have better service or have better food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z-x16ARrjP5aUDHytR8gJw"
  },
  "mGRoG2npf1_1NYWZ6T4V8g": {
    "date": "4/11/2019",
    "text": "Always good food.  I tried the fried provolone and it was very delicious!  I love the dipping sauce.   The cheese steak was also quite good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "_xveZmMlB9beN7g-AipKxQ",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States. provolone = excellent",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_xveZmMlB9beN7g-AipKxQ/o.jpg"
      },
      {
        "img_id": "1P6OBLSqb880ntz9btaGCw",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States. Cheese steak",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1P6OBLSqb880ntz9btaGCw/o.jpg"
      },
      {
        "img_id": "gqNEsdqpX6-jlYWlxwCakQ",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gqNEsdqpX6-jlYWlxwCakQ/o.jpg"
      }
    ],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "_lhzi21s229KGrY7KltO3Q": {
    "date": "1/21/2019",
    "text": "Good spot for lunch in Greentree. Lots of seating downstairs and upstairs. Service was quick and friendly. Price very reasonable with my husband and I sharing a salad, breadsticks and large pizza for $32 with plenty of left overs. The pizza and bread sticks were tasty. I love the fact that the breadsticks came with plenty of sauce and they didn't skimp like many places do. The dinner salad was basic. Everything was hit and fresh and you can tell it was brought out immediately. My only complaint is that it was freezing in the restaurant! I think they just opened and the heater hadn't had a chance to get the place warmed up yet. Also, I will ask for extra toppings on my pizza next time since there wasn't enough for my liking. I've also had take out pasta before which was also good and I'd order a pasta dish again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "prP75FD4UWOhlyxJzbeX3g",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States. Dinner salad with balsamic vinaigrette on the side",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/prP75FD4UWOhlyxJzbeX3g/o.jpg"
      },
      {
        "img_id": "Sd4zAWznMPxXZlxtkag_LQ",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States. Cheesy bread sticks",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Sd4zAWznMPxXZlxtkag_LQ/o.jpg"
      },
      {
        "img_id": "xrZ4U7JjNIK5gqGZWfC0SQ",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States. Large pineapple with regular cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xrZ4U7JjNIK5gqGZWfC0SQ/o.jpg"
      }
    ],
    "user_id": "mm9WYrFhiNqvHCyhQKw3Mg"
  },
  "uCPt5OiCBBtdA9XH2Er1AQ": {
    "date": "8/2/2018",
    "text": "On a recent trip to Pittsburgh, we wanted pizza in a location that wasn't traffic filled and parking was difficult. We found Vincent's right by the hotel we stayed at, and honestly, I could have gone their several more times.   We went at lunch time, and it was empty, with maybe a person or two. The parking lot was easy to access and plentiful. We were quickly seated and served by someone who you could tell that he loved working there and was excellent at his job. He was the right mix of helpful and not pushy (and I feel terrible I don't know his name). We ordered the garlic knots (truly addictive) and onion rings (huge and delicious) to start and a Chicago style pizza. The pizza crust was full of flavor and cheese was gooey. Perfect.   Don't make the mistake of missing out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "syEP0iT1VnxQlb0Wgpfhow",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/syEP0iT1VnxQlb0Wgpfhow/o.jpg"
      }
    ],
    "user_id": "isLsi0PLfP-5ICwVcsBS4w"
  },
  "wIV0KSfsm7WhB8JgiHobxg": {
    "date": "8/4/2019",
    "text": "Great place for comfort food, the last time I ordered from them, the hot sausage sandwich tasted funky.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YI0DvCu21-tcdeMyeHo-Hg"
  },
  "7Qvg4onTnychjGPwPuQ4_Q": {
    "date": "6/13/2017",
    "text": "A solid lunch spot that a bunch of us from Parkway Center visit when our bosses are in town.   The downstairs is cramped if it is busy and it is a bit dated (though it does have TV's and a bar area if you are into that), but now with the nicer weather they have a nice outdoor patio area with seating, and an upstairs dining area that is spacious and clean.   Last time I went we sat downstairs and like I said it was cramped. I decided on a small pepperoni pizza which was very good and a nice size for a lunch meal! I would have had leftovers if I had eaten breakfast, but I ate the whole thing!   Yesterday we sat upstairs I got a side salad and a half steak hoagie. The salad was very good (iceberg mix w/ veggies and croutons), however they add a slice of raw zucchini (instead of cucumber?) which I found a little odd and I didn't eat it but to each his own!   The steak hoagie was fantastic and a good price- the bread was soo good and the steak was actual sliced grilled steak (not the 'steak-um' type steak) and there was a nice handful of lettuce and tomatoes and homemade Italian dressing which was also delicious- very herby and definitely complementary to a submarine sandwich.   I also have to comment on our waitress, Joyce. She provided service equivalent to a ritzy steakhouse- she served food from the left and picked up the empty plates from the right, always said pardon my reach, can I get you anything else, etc. She also had no problem when we all had to get separate checks as some were traveling and needed receipts for reimbursement. She was absolutely fantastic and I hope she is my waitress next time I visit!  I will be back! The food has always been solid and the service has always been excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3xSglGfW0ZxtJp0vbv3NhQ"
  },
  "a59-YAEpNYyz3JQxGy66xg": {
    "date": "1/12/2018",
    "text": "This was our first visit to Vincent's and we were very happy with our experience. We were greeted as soon as we walked in and we didn't have to wait for a table. Our server was very friendly and provided us with great service throughout our meal.   Vincent's menu has a lot of great options and I love that they offer three different crust-types. We started with the hot peppers for our appetizer- they were delicious and my husband raved about how amazing they were. For dinner, we ordered a pizza because I read other reviews about how great Vincent's pizza is. The pizza was definitely delicious. I give it an 8 out of 10.   All of our food was timed perfectly and we were very happy with the food, the atmosphere, and the service. I highly recommend Vincent's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UMg9Tink-OSe-M5Hw_RhCg",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States. Hot Peppers",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UMg9Tink-OSe-M5Hw_RhCg/o.jpg"
      }
    ],
    "user_id": "ka9vXFMz1lqNftOkN5wkvw"
  },
  "lUtjdlQ6oNb1x03I8JXinA": {
    "date": "3/28/2018",
    "text": "Oh Vincent's. Delicious salads, poor service. My office is a 2 minute drive, but I can't come over my lunch break because they are extremely slow. In theory, this place would be a great place for larger parties with all the seating upstairs, but the service is even slower with larger groups. If you go, get the chicken salad.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bcf5X_2LTrCw-s4YPsCmKg"
  },
  "KC8m272QZVs9XHjIzbVTWg": {
    "date": "4/14/2018",
    "text": "Waitress was nice.  Environment was cool.  Food could have been seasoned more but overall not to bad.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SEX8LFigtWaJRKsRyq64gA",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States. Chilling with my lady...  our first trip to pitt!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SEX8LFigtWaJRKsRyq64gA/o.jpg"
      }
    ],
    "user_id": "Is1LBIAGJmjVOvvLYg0OMQ"
  },
  "l-e9nmjYW3npfSXX1sc4YA": {
    "date": "2/19/2018",
    "text": "Tomasine's Mediterranean Salad. I ordered directly from menu, made no changes and I didn't even get what the menu described. There were no carrots. No zucchini. No tomatoes. No croutons. $14.00 for half an over cooked, dry chicken breast & lettuce that half filled a take out container.   We made a rather large lunch delivery order, and the quality and quantity of the food left much to be desired.  Definitely priced too high for what you're getting. Vincent's of Greentree has been Removed from our list of lunch options. I won't be going here again at any point. Nope.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FbkXsWze6pRpGcQAeLmLIA"
  },
  "rx4BAdGI70coGpdMDR6ApA": {
    "date": "8/12/2018",
    "text": "They have indoor, outdoor and bar seating. Food came out relatively quickly during lunch time. Hot pepper steak salad was mediocre and I expected more since it's supposed to be a favorite. Asked for the steak rare, some pieces were medium while other were almost medium rare.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8GtUybhMBK64gjgEU0kgDg",
        "caption": "Photo of Vincent's of Green Tree - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8GtUybhMBK64gjgEU0kgDg/o.jpg"
      }
    ],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "aexCwyFKT2NjFBsOBr0SUQ": {
    "date": "10/13/2018",
    "text": "Large portions and decent food.  Price was a bit steep. Vincent's came up  from a gluten free search; however the only gluten free option was pizza.  I would not recommend it as a gluten free choice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5iySNia79B3UG5rrvGni3w"
  },
  "vMrx-N4gBR6aOhtAOwuWig": {
    "date": "8/15/2018",
    "text": "Very good food great quality and service was good. I would recommend it to try out its right near hotels and great food",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oGvs4aDSHrd76hPo073F1g"
  },
  "UXbNXCQe9LISLf0ZpT_wBg": {
    "date": "9/26/2018",
    "text": "Tried this place because it was near the motel we were staying in. The beer was cold and the highlights end there. Ordered the chicken and dried tomatoes with penne. There may have been six pieces of over cooked chicken smaller than a postage stamp in the oil drenched pasta. Might be a good hangout for a few beers. The food needs work.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1d_3qaY6u6wY4hcNG51t0A"
  },
  "_KLit2BL7ETtizj2WozlCw": {
    "date": "6/25/2018",
    "text": "Very nice outdoor patio and friendly staff. Reasonably priced, good portion and quaulty food. Location is good and parking is easy amd plenty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V0rqgn0fzuQVlAVAFPcEnA"
  },
  "hLdgxr0w3ILp3BvKgWmEQA": {
    "date": "11/16/2017",
    "text": "Solid place. Staff is friendly and very efficient. Sat in the bar area for this meal and watched some football while eating. Several draft selections which is nice. Ravioli was excellent and their bread rolls are awesome. Prices are fair and it was a good value to me. Would definitely eat here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WwaO4ziW19HnXRJQB7eiag"
  },
  "rCm_hIqky78GDhfuVKe4VQ": {
    "date": "6/9/2018",
    "text": "A local favorite in the Greentree area for many years. Every dish I've ever had here has been great. The hoagies are the best! The rolls are why, and they prepare them to a perfect crispiness. Bar has a decent beer selection too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rkkUOuBOHuVrPui1vLC_IQ"
  },
  "TgSCv3syCJJwOx7EaQ0DwQ": {
    "date": "2/1/2019",
    "text": "Not a bad place at all--good atmosphere downstairs imo--only been upstairs once over a year ago...usually get same things...pizza, garlic buns...cheese sticks...greens and beans--all very tasty.  Quick.  Always hot...had wings once & they were good, too.  I think the Italian dishes are good--portions are good/big--Great location imo.  Again....not much else out there if you are at a hotel...or if sports training at the Greentree Complex--so works for us!  Better prices, portions, and better taste than Olive Garden, unless you like chain food (shipped frozen on the delivery trucks).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gINBy5fb6azFKdCuof5Big"
  },
  "RLsr0QaIUwZp4QIMfJdKMw": {
    "date": "12/26/2017",
    "text": "We had a party of 6 adults and 3 kids all our first times.. I wandered into the bar seating area and asked if the upstairs was open, this server was rude to start off the experience, he said if there's 5 you can sit here after I told him there were more than that he scoffed couldn't  even look at me and said no you'll have to go upstairs. That's what I wanted to start with but okay. We get up stairs same guy now hurries is thru our drink orders. No friendly how are you no specials nothing. A girl brings us our drinks kids cups are simple plastic party cups with no lids. Turns around and huffs as she's walking away, I mean if you don't like your job do something else I get we were a large party with kids but we hadn't even had time to make a mess and the kids were well behaved.   Overall poor service! The food was decent but it was a very unpleasant atmosphere",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4M3zG8NpJ7d6_0IaWEMmkQ"
  },
  "XGv8U6Z6g0WKC90ov0MZvw": {
    "date": "4/4/2013",
    "text": "Place is a joke.  Ordered a burger and onion rings... after an hour and a half with no food or call to let me know the status of my order, I call to find out that they \"hired a new driver and he's running behind\". The manager calls the driver and then lets me know that he's accidentally given my food to another customer so I can either cancel my order or wait for them to prepare new food for me.  YOUR JOB IS TO MAKE FOOD AND THEN GIVE PEOPLE THAT FOOD!  I threw the menu away.  This is Pittsburgh, if you're incapable of providing people food, there's 100 restaurants that can.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S8awhy-J2lpIUO3z3fIhMQ"
  },
  "boXTKlYLKQnBq6bjio7UYA": {
    "date": "9/19/2011",
    "text": "OK, I'm going to be honest. I am SICK and tired of pizza. There are only so many ways to throw stewed tomatoes and cheese on bread. This being said, it is difficult to impress me with pizza. It was Darren's turn to pick a place to stop for dinner, and I groaned when he mentioned ANOTHER pizza joint. \"They have more than pizza \"he protested, but pizza we got anyway. And WOW! Enter a seafood variation on the detested entree. I have tried seafood pizza at various places before and received imitation \"crab\" and some mini shrimp sauteed in butter, but THIS pizza blows them away! Clams, scallops, and sliced shrimp of the larger variety covered a perfect crust that was both crispy and soft. If you are a seafood lover, this is the perfect pie for you! This was an inexpensive way to cure my \"ocean tooth.\" As stated in other reviews, the service is lacking, but I'd still come back here. Maybe next summer we can eat on the large deck under the stars. :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7AGLlj5YzqdBfCPiZCa1mQ"
  },
  "HsvO1YST2e_ARfDbTKr2YQ": {
    "date": "2/24/2010",
    "text": "Vincents is a solid, consistantly decent local Italian restraunt. Affaortable and casual., plus they deliver.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "za3mUDYnofvUwwPyHm_4Ng"
  },
  "2zjyCsIgDBu1l29kZtzNpw": {
    "date": "4/11/2009",
    "text": "Super fast service NY style crust pizza was great and crispy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ccfYicnJienP1eZa86m-Vg"
  },
  "K_ks2gl_Ls3_B0H-ATWEUg": {
    "date": "8/7/2010",
    "text": "Service wasn't very good, and their (advertised) delivery was not available (because the delivery drivers car broke down). Maybe as a sit in it would be ok but I was not impressed",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eZl14McsGNKuk_D-0t2stA"
  }
}