{
  "JQvX2tni5-AbRjmCDhNYpA": {
    "date": "12/27/2016",
    "text": "If you have never been to China this is more authentic than a place that serves General Tsao's Chicken.  If you have been to China this is not authentic.  2 stars for kind and attentive service!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UDLvSlptCYCdKx3dJ90j6Q"
  },
  "2YX2nqvHOAVYyQqcfDZbhQ": {
    "date": "9/7/2015",
    "text": "Very inconsistent. The first time I are here it was some of the best Chinese food I have ever had. The next two times, the food was below average.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QXiNv2LNESbP8X5xeiRsgQ"
  },
  "LdSdb45gYjKqszr1MUrjOQ": {
    "date": "2/21/2016",
    "text": "Very authentic Sichuan food, personally I like fish fillet in boiling spicy broth most. Highly recommended if you are a really chinese food fan",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HaPhMrfK-s0SAIaM6AP8FQ"
  },
  "jC2yTkph-6AjU40W8WfKMw": {
    "date": "10/21/2012",
    "text": "A large Szechuan menu with many different dishes (including your ususal Szechuan fare) at a reasonable price. The portions are very large, and two dishes for two people is more than enough.  Our two dishes (traditional fried green beans with port and a spicy duck) were tasty and satisfying, although they fell a bit short of being excellent. The duck did not have this nice bite of Szechuan pepper, as I had expected. Based on our two dishes, I'd say 3 stars rather than 4, but many dishes on the other table looked very appetizing.   We will be back to try more dishes, and perhaps update the rating.   Finally, I'd say that the quality of the food compares to the quality of the last page of How Lee menu.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "LMl9Z43ZVPh5wrz4LeYd6Q"
  },
  "Gj8ubkw9k6Niga0CUwtKXg": {
    "date": "4/28/2013",
    "text": "My first impression with this place is not a great one.  I ordered the sauteed conch with basil, and was vastly disappointed. It was almost 19 dollars for a half full take-home container of one of the blandest dishes to my mouth's recent memory.   I have a gut feeling that this place can serve up good food, but don't you dare have something on the menu at that cost if you won't own up to it.  Also, it's kind of embarrassing that we now live in a world where there is literally a \"American\" chinese menu and a \"Authentic\" menu. True, New How Lee does it, but they don't blatantly label it as so, and feels a bit like coddling to label one menu as American..as if to say \"hey, come here and eat something that doesn't resemble Chinese food at all\"  My interest is still there though..as PGH only has a very small selection for real-sh Chinese food, but I will put out a warning:  There's a reason this location has switched owners 3 different times in the past few years.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RsgcXHipYKv5QVjSpAy2-A"
  },
  "K9dCycEWTPYC3pXU5tz_hQ": {
    "date": "2/27/2016",
    "text": "Excellent and authentic Chinese food.  Order from the Chinese menu for the best food here.  Currently my favorite Chinese food I have tried in Pittsburgh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dyBMJBKpt1hL5-lPIbBABQ"
  },
  "PWmaXFJTr5L_VitMGFAJcg": {
    "date": "9/28/2012",
    "text": "They changed the name, but kept the deliciousness.  Sichuan Gourmet (formerly China Star) offers authentic and dishes in addition to the American hybrids most locals think of as \"Chinese food.\"  The spicy Sichuan pantheon nicely complements what I grew up thinking of as the classics, so Sichuan Gourmet is a top tier choice for any type of Chinese meal.  Favorites on the authentic side include chengdu style diced chicken with dry peppers (sauteed with hot peppers, oil, and some amazing spices) and the double cooked sliced pork belly (a more unusual, almost woodsy, taste for some American palates, but this thin sliced meat with green peppers has never disappointed).  Excellent dishes that might look more familiar include cumin lamb (which is particularly good here) and the also excellent Singapore style curried rice noodles.  The worst part of a trip here is choosing.  Do I pick an old favorite, or try something new from the extensive menu?  Do I go Sichuan style today, or opt for a more American taste?  Do I share with the table, or horde my precious preferred delicacy all for myself?  These are real dilemmas, which deserve careful deliberation before a trip (personally, I like to go with a group and share, so we can order all kinds of cuisine and try new things in addition to old standbys).  Another drawback might be the servers.  Occasionally you'll get an off day on the service side, and more often than that there may be some language barriers (if you're like me and don't speak Chinese).  But don't let that stand in the way of a fantastic culinary experience that seems to be truly unique in Pittsburgh.  Bottom line: Great quality and recipes make this establishment a taste leader among Pittsburgh Chinese restaurants, and it's certainly worth a detour, or a special trip.  In fact, I'll go out on a limb right now and declare: this is my favorite Chinese restaurant in all of Allegheny County.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "D-_yG-XuT_-gf3six6a7mg"
  },
  "8ER46cXdJGReMRq4gPDFEA": {
    "date": "1/5/2015",
    "text": "One of the better Chinese places in Pittsburgh. Consistent meats, delicious sauces, and good enough service. I've also gotten takeout from them, and it's just as lovely.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "C371u4yqZEGJN9iTETml4A"
  },
  "yrnzblwy-ziu27ZaMp2p2w": {
    "date": "5/27/2011",
    "text": "Huge menu of authentic Chinese dishes. Best experienced family style.   I had the half Peking Duck which took 20 - 30 minutes to prepare (I was warned when ordering). It was perfectly sized for me and the manager made the first couple of wraps for me and the waiter finished off. I probably should have just done it myself to back off the sauce a bit. They tossed in some steamed rice for free. Not quite the quality of those stands you find in Taipei, but a decent rendition that borders on roast duck (dryer) as opposed to my idea of Peking duck where the skin is crispy with a layer of fat and tender meat. At under $20 with tea, this was pretty good bang for the buck.  You could probably try a different dish for a whole year here with something for everyone. Everyone seemed really happy in a mid-week packed house. Service can be a little slow as the ration of customers to waiters seems to be a bit high.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "x9rkVoNB92HR_bFOe6MFTQ"
  },
  "W6-kOnZApydL9UAcixiw6g": {
    "date": "9/4/2015",
    "text": "I think this is one of the best Chinese food places I've ever been to. Definitely the best around the CMU area, and my friends agree!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0kV7R4WI6n2Nx_8_mgapxg"
  },
  "up4J7NtFuXb25jDuH4dhOQ": {
    "date": "3/17/2016",
    "text": "Vegetarians and vegans beware. I dined at Sichuan Gourmet on 3/16/2016.  I ordered the \"ma po tofu\" from the vegetarian section of the lunch menu.  What I realized when I got home and started becoming violently ill, was that this dish was not vegetarian as advertised. A quick Google search confirmed what I already knew, that \"ma po tofu\" is made with minced meat, yet Sichuan Gourmet lists it as \"vegetarian\". I returned to the restaurant around noon on 3/17/2016 and asked to speak to the manager. I was told the manager was not in, and forced to  deal with one of the rudest women I've ever had the misfortune of taking to.  She chastised me for not calling in the previous night. I told her I was busy being violently ill the previous night, and that I would rather speak to someone face-to-face. She kept blaming me, and even admitted that their \"Ma Po Tofu\" has pork in it!  Yet this rude woman would only refund the cost of the meal and not the total charged to my credit card.  She outright ignored my concerns and comments that dishes with meat should NOT be listed in the vegetarian section, and refused to take any kind of accountability for it, let alone heed my suggestion to remove such dishes from the vegetarian section of the menu.  It's clear Sichuan Gourmet doesn't care about their customers, and they especially don't care about vegetarians. I shouldn't have to Google ANYTHING listed in the \"Vegetarian\" section of a menu to find out if it has meat on it or not.  How they could even list such a thing as vegetarian is incomprehensible. That coupled with the HORRIBLE treatment I received when asking for a refund will ensure I NEVER eat at Sichuan Gourmet ever again.  Vegans and vegetarians stay away from this place, unless you really enjoy being deceived and getting sick from that deception.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "wUpwkGM2y7wbMevEtGyYHA"
  },
  "3rjod8PIYsD9BZfvw54xZw": {
    "date": "12/23/2012",
    "text": "Like chengdu la zi ji !   I probably added  more laziji  pics than anybody over here!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oOqD2y4lytd9b2OPhxEaTw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oOqD2y4lytd9b2OPhxEaTw/o.jpg"
      },
      {
        "img_id": "HszsQu-WHRkJa_mC2f8jmg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HszsQu-WHRkJa_mC2f8jmg/o.jpg"
      },
      {
        "img_id": "Z1nqcGPJzQxK6qK4fs7YWQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z1nqcGPJzQxK6qK4fs7YWQ/o.jpg"
      }
    ],
    "user_id": "k2MoFys9o84hjIC0TPbgGw"
  },
  "yjViZiQ_yDWBfX3DwmKqxg": {
    "date": "9/30/2016",
    "text": "The General Taos was a tiny portion and mostly breading very disappointing. It did have a nice flavor though. The eggplant with garlic sauce over cooked, very soft. The extra star was for atmosphere. The service was slow.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oe9Zlx8RCrvITBl_a36KRw"
  },
  "CsLp0xGkUgaUqKlV6dPjhQ": {
    "date": "12/13/2016",
    "text": "What an amazing place. It's been here a long time but it's new to me. Best Chinese in Pittsburgh by far. Alice my server did a great job as well!!  Make sure you ask for and she won't let you down. Tell her frank said so. I live in Coraopolis and can't wait to come back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tYMHFx5ppCLc55kKQO0LnA"
  },
  "FgBl6FWA32HjfaOTUZWsZQ": {
    "date": "2/8/2015",
    "text": "The best Sichuan food in Pittsburgh. Hands down. The selection is huge, with a decent amount of vegetation options. Dishes can range from mild to \"ma la\". I have been twice and enjoyed everything I have had, though standouts are the Mao braised pork and the Chengdu jello noodles.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "d8qB4gMilbxFG6vy9RS3CQ"
  },
  "QqwUl0pjr4gipetCK5AImQ": {
    "date": "5/31/2015",
    "text": "Everything was nuanced and well-priced. The roasted garlic in the chili dumplings was delicious, and the dan dan mien and sesame noodles were tender and seasoned impeccably. Delivery was quick and efficient. Not sure what happened with the 8% discount.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gpKrnCN6WMC6MC4JIJFI3Q"
  },
  "NFVc6Wr22OOsD2b5_c5sFw": {
    "date": "12/17/2012",
    "text": "Loved this place.  My friends and I went on a Saturday night and we got hot pot.  I knew it was authentic when they brought out a menu that was only in Chinese for the hotpot.  Fortunately one of my friends knew a bit of Chinese and 2 of the servers came over to help us translate.  We got the rib broth which was delicious and spicy.  As 3 Caucasians, we were all in tears over the spiciness but it was so good.  The rest of the menu is also extensive with many interesting options and seems to be pretty authentic.  One of my friends used to live in China for a year and was very impressed with it.  Atmosphere was nice and family friendly, with plenty of seating room.  Servers were all very nice and friendly, though we had a hard time communicating as their English was somewhat limited.  Prices are very reasonable and portions are generous.  I'll definitely go back here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3bo1FXvQnxw2hmO0CHH4Nw"
  },
  "HP3rZxdbAZLr6-Q2F_U-4w": {
    "date": "8/23/2015",
    "text": "I'm from Shanghai, China. I have to admit Sichuan Gourmet provides genuine Sichuan Style food, and it's one of my best hang out place. The price is moderate. And they can accommodate large crowd as other traditional Chinese restaurant. It can get quite crowded in weekend nights so come early is my advice. In all, if you want some hot and spicy food, this is your best shot in Squirrel Hill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dKc7QFA55WKxPmT2oGV0yA"
  },
  "KRT5OWJBdNz0_JH8nJ8nGA": {
    "date": "11/22/2015",
    "text": "One of the nicest Asian restaurants in the neighborhood - great food great service.  You can not go wrong.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8g41T51VJNA1mt3lFA-9zA"
  },
  "G_rWnQ_0FXMzMZdsfI3kuQ": {
    "date": "5/2/2012",
    "text": "Coming from Baltimore, a city void of palatable Chinese food, I was very surprised (not to mention skeptical) that a great  Szechuan restaurant would be found in Pittsburgh.  I'm glad I was wrong.  The braised pork shoulder is a conversation piece, beautifully prepared and tender to the bite.  I also tried the spicy beef noodle soup and the crispy pork noodles.  If you don't like spicy, stay away, but this stuff was delicious.  I was literally sweating with elation.  Gross and wonderful at the same time.  Next time I want to try the whole fish or the hot pot.  So much to look forward too.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "MRw1yT9BChejK1lSwVc43w"
  },
  "NMt_gFUzAkAbSINWgvxcow": {
    "date": "9/4/2016",
    "text": "Decided to dine here after the recommendation of some locals. When we arrived on a Saturday night it was busy but we were able to get a table right away. The crowd seemed to be predominately Chinese students. They have a couple of rooms for private parties.  Coming from Philly, we've never had to pay for hot tea so that was a surprise. Stir fry vegetables was a whooping $11.99! If you're looking for some authentic Chinese food, you can find it here but you'll pay the price. We got a few dishes to share and they were flavorful but pretty oily.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "z7Fd9GM8_fESYUSFSKCvGQ"
  },
  "cQIgZT5RIlkgfIpCqQkWHg": {
    "date": "5/10/2018",
    "text": "I have been a regular at Sichuan Gourmet, and it's usually been really good. My favorite is the Chongqing style fried chicken, which is fantastic with white rice. But today I came with my family here for dinner and had a very disappointing experience. Everything we ordered came out extremely salty, and the pork we ordered tasted funny like it's not fresh. I can vouch for the quiet ambiance and nice waitresses here, but can no longer recommend the restaurant for their food. The quality of food really follows their main chef, who rotates between the Oakland location and the Squirrel Hill location. The word on the street is that their only main chef is at the Oakland location on weekdays and at the Squirrel Hill location on weekends. So I would still check them out but only when the main chef is there. Hope this is helpful for future patrons.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vMbm6cgDy0GVI_xVaW7y-A"
  },
  "dAjOUuCF6io5KdlrusJPDw": {
    "date": "6/4/2015",
    "text": "This really is a 4.5 star review. I took off the 1/2 star for the slightly high prices and lack of parking. Everything else was almost perfect.  The food here is YAS so tasty. My server Tom was fluent in both Chinese and English so was able to give some great recommendations. He was the nicest server I've ever had; all smiles! The menu itself is a work of art. Laminated in frosted matte paper, includes pretty pictures, hardbound and in both English and Chinese.   I ordered the Flaming rabbit and my hubs ordered the Sichuan lamb. The Sichuan heat is real, you guys. We used up probably 6 napkins between the two of us to mop up sweat and sniffles. But it is not just plain hot--the authentic \"mala\" flavor really comes out. The prices are high and the portions are medium sized, but the variety and taste made up for it. It's a good sized restaurant for its cramped Squirrel Hill location and some of the art pieces are really beautiful. I will definitely be back to try Mao's pork belly in taro and many other amazing-sounding/looking dishes.   Also, everyone else who was eating here was Chinese so I knew this joint was authentic. Usually, I am the only Asian person slurpin' my noodles at many a Thai, Chinese or Japanese restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "8DclOINSPldMTgiEbuCdoA"
  },
  "vsQtCv60LBu_CKKUx32p_g": {
    "date": "6/14/2016",
    "text": "I visited Sichuan Gourmet with a friend for lunch last Sun. at 1pm.  Having heard that the food there is quite authentic, and given that my friend is Chinese, I suggested that we check it out.  After a bit of confusion regarding the location (she initially thought I meant the one on Atwood in Oakland, rather than the one on Murray in Squirrel Hill), we met there and were seated.  Having perused previous reviews, I knew that the best dishes here were on the authentic menu, so I decided to order one of them.  Although I'd originally planned to order a spicy Sichuan dish despite some trepidation concerning the spice level (I enjoy some heat but not a huge amount), I decided to order the duck noodle soup ($10).  In a similar vein, my friend ordered the beef ho fun noodle ($10).  The noodle soup consisted of a bowl of duck flavored soup containing pieces of bone-in duck (noted on the menu), cabbage, and udon noodles.  Despite its thinness, the soup was quite flavorful, and the duck and cabbage were well-cooked--not under- or overdone.  I only encountered a few pieces of bone in the meat, which I was easily able to avoid.  Because I'm not a beef eater, I didn't sample my friend's ho fun, but it looked similar to a Singaporean dish known as char kway teow which is usually made with pork.  Although she expected it to be spicy (it wasn't), she enjoyed it and finished the entire serving.  Service was rather slow and inattentive.  Fortunately, this wasn't an issue for us as we didn't have any pressing time constraints, but keep this in mind if you choose to eat in.  The decor was more upscale than that of a typical Chinese restaurant, and the prices reflected this.  During our visit, no lunch specials were offered, and most of the prices were somewhat higher than I prefer to pay for lunch (our dishes were among the least expensive on the menu.)  Despite these shortcomings, we enjoyed our lunch, and I'd be willing to return--though next time, I'd probably go for dinner instead, as I believe the prices are the same. 3.5 stars.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 15,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "S2f6R6xlOg8yvsCvAXmMHQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Beef ho fun noodle",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S2f6R6xlOg8yvsCvAXmMHQ/o.jpg"
      },
      {
        "img_id": "oSCEbxN5FJ1zCahcNKPIfw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Duck noodle soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oSCEbxN5FJ1zCahcNKPIfw/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "4a7uhZqlJ6hrPzbpGpQWBg": {
    "date": "9/20/2017",
    "text": "I ordered youngchow fried rice, egg rolls and thin rice noodles,  everything is so delicious. Im very picky when it comes to fried rice, but this place makes a very good one; rice is soft and seasoning is just perfect. Service is nice too. Will definitely reorder",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gY33K2wfcaoXy1-7RPM6Kg"
  },
  "OpZwQE3SXkYv_FsBmMJL7g": {
    "date": "11/7/2017",
    "text": "Tried this place for delivery on a cold Tuesday night. Ordered egg rolls, sesame chicken and the \"amazing chicken\". The egg rolls were mysterious, not sure what was in them, some shrimp to be sure, they were ok. The entrees were soggy and somehow still not saucy enough. Bland flavors, sad broccoli, not a hint of crispiness left in the chicken. The only amazing thing about the chicken was the multiple pieces that were not in fact chicken but pure breading. We will not be ordering from here again and have no idea how this place had such a high rating.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L-BbaMG6-cngV3S_8MSmGQ"
  },
  "RnecLndoaLsg593b3Fr_qw": {
    "date": "6/13/2015",
    "text": "The food is really authentic- it really was like the food I was craving from Chengdu when I visited a few years ago. It wasn't as spicy as I thought it would be (no peppercorn bombs), but there was definitely a kick, but not enough to totally numb your tongue, which is good.   The food is spicy and greasy- that's just how it is. I like the Flaming Pot dishes because I like eating my spicy food really hot as well, which makes me think that I like pain sometimes. The Chongqing chicken was a little disappointing- though the texture and flavors were there, the pieces of chicken itself was miniscule, and at some point, I felt like I was just eating battered fried bits. I loved the stir-fried Chinese watercress- great flavor without the veggies being overdone. The Dan Dan noodles were OK.  The biggest pros of this place is its authenticity, Yelp check-in discount and coupons in Clipper Magazine (also Groupons) and fast service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "N7NnC6-q0O-Gq2n_7YJkNg"
  },
  "OFuvZ2wgjJtIzOdYNUjFXA": {
    "date": "8/9/2016",
    "text": "My experience with this restaurant was awful. I ordered a spicy beef soup and received an oily, half empty container. It was definitely not a soup. I called the restaurant and they refused to give me a discount for the mediocre food. The walnut chicken was also very oily. Stay away from this place.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Wq7D2Krjgg2I7qGUB1Puuw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Half-empty and oily spicy beef soup. Shown as received.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Wq7D2Krjgg2I7qGUB1Puuw/o.jpg"
      }
    ],
    "user_id": "P7wUAzzpkyeo1AbkqJB2gg"
  },
  "nERzFCvuGezcQj04rtaxeg": {
    "date": "10/27/2017",
    "text": "I ordered their food with Grubhub and I was disappointed with the food received. Secondly, they refused to refund my order. I received General Tso's Chicken and it was mushy all around. It tasted soggy and there was no bite to it, it was just like eating slop. I'm used to eating General's Tsos that is a bit crispy, so this entree was totally off to me. I had ordered Chow Mein and it didn't come with noodles. I checked back on the Grubhub site and it says that it didn't come with noodles. I'm sorry, but I saw the name and assumed a noodle dish came with noodles. I understand I made the mistake, but why even put it under noodles if it doesn't come with noodles? There are a ton of other Chinese restaurants in Squirrel Hill, you would be wise to spend your money elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MKBlCLZedX-w7AUP4jMGIw"
  },
  "MkyG3DafgFno9dz_ieBbkA": {
    "date": "8/2/2016",
    "text": "Heavens to Betsy. This place screams authenticity to the max. Thankfully a friend of mine is married to a Chinese native and they scout out all the best Szechuan restaurants in town. This is a winner winner, chicken dinner! We had the shredded beef, asparagus and fish soup...all family style. The soup, SO good. The flavors were amazing and the fish very tender. The beef was not served in an over-cornstarched sauce and it was divine. We left fat and happy and I will be back here as soon as I can be!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HBMAxsiTdnq_XCF_r13LCw"
  },
  "vO-6w4VHD8CJjfkMVEPO2w": {
    "date": "2/10/2015",
    "text": "Authentic Chinese Squirrel Hill. I personally was not a fan of the pepper used however the portions are large enough for 2 and the food is served promptly. I was slightly disappointed that many of the items on the English menu were out [which is fine for the authentic Chinese menu]  The Tea served could have been of a better quality, however, as I was severely under the weather at this point of time, I was happy it made me feel better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2AiYF7z32_0Oitl4aYXwg"
  },
  "DurQsJm1jxm82nzHwpJbaw": {
    "date": "8/2/2016",
    "text": "Very good restaurant!  Pros: The food here is authentic Sichuan food. It's spicy and flavorful.  The restaurant is spacious, so if you need to hold a huge party, this restaurant can do that. They also have larger tables for 8 people or more.  Cons: How Lee across the street makes some dishes better than Sichuan Gourmet in my opinion (my friends disagree though).  TOO NOISY. Just like other Chinese restaurants, this one is usually noisy and packed with people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S7NMT-Q_PwRynwyUsiSYeA"
  },
  "ZiZFadoy0RO4_pgqHMtYQA": {
    "date": "10/5/2016",
    "text": "We came here because I had a local flavor coupon. We were seated right away around 5:50 and the place quickly filled up. I ordered the general tso's DARK MEAT. I must say it was the best I've ever had besides a few mushy pieces. The all white meat General tso's, tried by everyone was not very good. Very dry. My problem mostly was the pricing. If you order a soft drink they are a whopping $1.75 and you get a 12 oz can with no refill!! My other friends got hot tea and when it was empty they just put more hot water in with no new teabag. My wife got the shrimp and it was just okay. The flavor was a little off. Also the the orders came out slowly, 45-50 minutes. I don't think I would come back to dine, maybe just take out for general tso's chicken.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PFBGb4_AXvXsuhQt1F9DQw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. The general tso&amp;#39;s DARK MEAT. Best ever",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PFBGb4_AXvXsuhQt1F9DQw/o.jpg"
      },
      {
        "img_id": "UlMPBvUM3Gp4L5tmmBKBhg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Pork",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UlMPBvUM3Gp4L5tmmBKBhg/o.jpg"
      }
    ],
    "user_id": "dP4QFy7Hk-jFh4EU6W1eQw"
  },
  "SmN1A5CuUvSWZMMh22WYmg": {
    "date": "10/11/2017",
    "text": "Was craving Chinese food and passed this place many times.  Finally gave it a try and glad I did.  Ordered Chengdu style diced chicken with peppers.  Not overly hot, but enough zing to satisfy me. I bet if you wanted spiced up, all you would have had to do is tell them and you would end up breathing fire. And a nice sized portion, although at first I thought I might have some leftovers, I wound up eating every delicious bite.  Perfectly seasoned.  Perfectly sauced.   The service is a bit slow, but very pleasant.  Wasn't overly busy.  Lots of Asian people eating food and I didn't see anything but empty plates going back. So the other dishes must be that good also.  Surely there are enough intriguing dishes for me to give this a try. I saw this enormous bowl of noodle soup at the next table.  Looked like enough for 6 big eaters.  Maybe next time.....And I definitely want to try Pork Belly.  C'mon now....how can something called Pork Belly be anything buy heavenly delicious because we all know Pork Fat Rules!!!! I did not think the prices were overly expensive, however, they are a bit pricier than some of the other Chinese restaurants.  However,this is REAL Sichuan style food.  And they have an American menu too for those who don't want the spicy stuff with the usual suspects...sweet and sour and General Tso's Chicken (the Chinese equivalent to KFC).   The food here stacks up with most of the other Asian type restaurants so prevalent in the Squirrel Hill area.  Along with Everyday Noodles, Chengdu Gourmet, Bangkok Balcony and New Dumpling House, one could eat Asian food every day and not get bad meal on the Hill.   And not go broke doing it, either.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PXVt6mYWYhiCPooXpoeORQ"
  },
  "8tiu0ijXPChDoDbXTGo_Zg": {
    "date": "6/29/2016",
    "text": "My family and I decided to try this place for dinner on Sunday night. The restaurant is quite large, and though it was already busy, we were quickly seated.   We ordered from the Chinese-style menu: scallion lamb, spicy beef tendon, sweet and sour fish, and Chinese spinach. The meal was very satisfying, especially paired with tea. My dad had a lot of rice, which is usually a sign that the food is good (or that he's hungry, but I think it was the former in this case). The lamb was tender and flavorful. The spice of the beef tendon was tolerable, even enjoyable, for me, and it was paired with a numbing sensation. The fish was breaded in strips, and I enjoyed that the coating held its integrity and a little of its crisp instead of becoming mush in the sauce. The Chinese spinach hit the spot as well.  It's a little pricey for me to eat here often, but it's definitely on my list of places to get Chinese food when I'm missing home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Up4UO-1piizQ5Kjs5MMo7g",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Clockwise from top right: scallion lamb (葱爆羊), spicy beef tendon (麻辣牛筋), sweet and sour fish (糖醋魚), Chinese spinach (空心菜)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Up4UO-1piizQ5Kjs5MMo7g/o.jpg"
      }
    ],
    "user_id": "Figs8mO8s_aPRq2W7W0cYQ"
  },
  "PYiI1geBSgNzOcN0L08dmQ": {
    "date": "9/16/2017",
    "text": "This is one of two Sichuan/Chengdu cuisine restaurants in Squirrel Hill, the other being Chengdu Gourmet.  I've lived long enough in Squirrel Hill to see this restaurant go through several reincarnations as a Chinese restaurant. This latest is not bad as far as cuisine is concerned. I would suggest ordering from the Chinese menu.  The reason I'm giving this review only 2 stars is the service. I ordered a take-out and I ordered it online.  By the time I arrived, some 20 minutes later, the food was packed & ready to go. I picked it up and quite fortuitously mentioned the two items I had ordered. And of course, they had messed up the order, even though I had received a written confirmation of my order. So now I was faced with a wait.  I expected the manager lady, dressed in a white Mao style shirt to offer apologies. None were offered. She sent the pack back to the kitchen and quite impassively rang me up. And here I was expecting some apology, perhaps even the offer of a discount to make up for the inconvenience of waiting. Nope. Nothing. Nada. Just an impassive, almost icy, condescending look. Thank you very much. That is it for me! Bon appetit!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RyfWmy_uAfc0pb_MF5oIww"
  },
  "t19OFoN5guF_wZpFxldJPw": {
    "date": "4/30/2017",
    "text": "It took a while to be seated when it wasn't that busy, even longer to order food and only half the table was served while my food did not come the timer stopped at 17 minutes 22 seconds AFTER my friends were served. Food  was sub par not with the wait.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UB4vZonoI3NLQMgljTFczw"
  },
  "IZqDlj8ZYa3G7rKF2O8yaQ": {
    "date": "10/6/2017",
    "text": "Most dishes are really outstanding like the Triple Green vegetable chicken, and the dumplings.  However, some of the Pittsburgh flavor menu just aren't that great, General Tso is one of these, as is the Lo Mein, the worst is the Pepper Steak was just steak with two inch chunks of undercooked peppers & onions. Stick with the more authentic, you will not be disappointed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0hbygKEk876xL9CeRwbo5g"
  },
  "ZQo0F1gOjIHc_d9VTV5pcA": {
    "date": "12/9/2016",
    "text": "This is definitely my favorite Chinese restaurant in Pittsburgh. I love the food, which is pretty authentic in my opinion. Sometimes the wait is a while because they're always crowded, but I think its definitely worth it. Their hotpot is also amazing, tastes like what I had when I was in Shanghai. They also deliver so that's nice. The staff is friendly, especially if you speak some Chinese because they get all excited about speaking in Chinese, its actually really cute. Also, they recently renovated their restaurant so its pretty clean! The only downside of Sichuan Gourmet is that its a bit pricy so I can't eat it everyday. But i definitely recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "PQPDV6w0qWDzcdNRILkz1g"
  },
  "Y_7uVXy8jkPiMj1-dqAgDQ": {
    "date": "4/11/2016",
    "text": "The food was good, but too oily. The service was absolutely horrific. My boyfriend and I went there around 2 pm, and the restaurant was empty. I asked for recommendation on their lunch special, yet the waitress told me that she didn't have any recommendations on these, because these were cheap food. She could only suggest something from the main menu. She was very condescending, and did not bother to apologize when she knocked over things on the table. She never bothered to come over during the meal, and we had to ask a few times to refill our water. Again, it was at 2pm while nobody was in the restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Os0htjQHtj5NEGj4apuKmg"
  },
  "m2fwL78pcPldCAotSIzTRw": {
    "date": "1/15/2015",
    "text": "Great restaurant for authentic Sichuan cuisine.  I highly recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KG0u9M3ELP1T09KP5WA7OQ"
  },
  "I1l0Sv3VByCq4rGCrlSBUg": {
    "date": "1/24/2012",
    "text": "I'm a huge fan of Sichuan food, so I tend to love all Chinese restaurants that serve authentic Sichuan dishes. And I tend to be nice and give pretty good reviews in general because I know how hard the restaurant business can be. However, given that I had just tried How Lee the week before, China Star was a bit of a disappointment. We ordered off the Chinese menu and most of the food was just so-so. The tofu in the ma-po tofu was definitely spoiled and on it's way to being fermented tofu although I couldn't make a big deal about it because everyone had eaten it already. The spicy fish in chili oil was not nearly as good as How Lee's. Some people wanted to be adventurous and ordered the frog and a rabbit dish. The flavors were decent but it was all bones, and I've had plenty of meatier frog and rabbit before.   The service was terrible, even for a Chinese restaurant. They got mad at us because 3 people cancelled last minute and we had 14 people instead of 17, and half the dishes were already eaten before everyone got even a glass of water. We asked for tea and they gave us TWO tea cups. The rest of the tea cups came with the dessert oranges....unbelievable. The first thing you should get at any Chinese restaurant is tea...and it wasn't even like we didn't speak Chinese...  On top of that, the party next door to us was getting wasted and they had people stumbling to the bathroom to puke. There was literally puke in the sink of BOTH the men's and the women's restroom and no one bothered to clean it up. Gross.   Maybe some day I will be forced to come here again with a big group of people and maybe I'll have a better experience then, but this was a terrible first impression.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a2Sgn4a0H9uiXBijRK0Khw"
  },
  "mePMfDJEM0DEpAYqmbgSNw": {
    "date": "11/22/2011",
    "text": "My entire notion of Chinese food was imploded and then rebuilt here - for the better and grander. The flaming fish was the bomb! Literally. It is not for the timid. My mouth was on fire, and I will go through that again and again. It was that good! The other dishes on our table were good but nothing compares. Oh, order from the Chinese menu. General Tso's is not worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jFY8cEqe8JPPUoCuFqB7_g"
  },
  "9AWdWIF8KC4_3RmaoB1w8Q": {
    "date": "4/20/2014",
    "text": "Great food, if you are a Chinese looking for an authentic Chinese food, this is the best you could expect... Even better than most of Chinese restaurant in China...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mDwDdmu62XlkE3ZrwSnNbQ"
  },
  "DfqcSQ-alSGUpdaYWJw3pw": {
    "date": "7/20/2013",
    "text": "They have a waitress with the worst attitude I've ever seen in any restaurant. The manager even argues with costumers for giving less tip to that waitress. The only star is for their food, average Chinese around Pittsburgh.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wVSwLCJyAluQuuQwiSwv-w"
  },
  "2NGtJ9Vx7jdgamptQ_j8Lw": {
    "date": "4/13/2014",
    "text": "not your average chinese takeout or eat in restaurant. stopped here a while back for my uncle's birthday and he ordered from the Sichuan menu. let me tell you it is VERY SPICY! we ordered the fish hot pot, pork intestines and a few more dishes. food came out nice and hot, staff was nice and friendly and wasn't hesitant to explain each dishes on the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZFeSFlfrQASkdojcxrZWBA"
  },
  "6BIZib0byI4VTpT7akGOTA": {
    "date": "1/17/2012",
    "text": "Had dinner here on Friday night and I'm so happy I finally got to try this place. At first I was a bit confused by the two menus but our waiter nicely explained how one listed their Chinese-American dishes and the other authentic Chinese. My husband ordered from the American and I decided to go with the Chinese Kung pao chicken. The orange chicken was the best I have ever had! The Kung Pao was pretty good too. The ginger gives it a very unique taste but it was way to spicy for me. Right away my whole face was flushed and my nose was runny. Our waiter was so nice and attentive, I really enjoyed my dinner and will definitely be going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Ra43bbUQNYkBCOUQtxYnA"
  },
  "wZdSfvLgQR8A-JWH8EROLw": {
    "date": "11/3/2011",
    "text": "This is definetely the best authentic Chinese food in town, no doubt! I have been trying out authentic Chinese food for 5 years in town, this one is the best, make sure you ask for the authentic menu which is black( the american chinese food menu is white), they usually don't automaticly give you the authentic menu if you dont appear to be speaking Chinese, I had steamed perch fish, spicy lobster, spiced fish filet in broth, they all extremly delisious, for the appetizer I recommend the beef tripe. Anyway, this is wonderful",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jJQm8Kq3xZ7YjDnVI0J68w"
  },
  "7yHIXNfHhnlRJ1GBa_P-rQ": {
    "date": "12/27/2011",
    "text": "Man, how I love china star. I misses my time in Pittsburghs sooooo much.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZjaEJuuPldbwZz4TS3e65w"
  },
  "GIADGPidsgQaAC6lFLZRBQ": {
    "date": "6/26/2011",
    "text": "I would just like to point out that there are two different China Star restaurants on Murray Ave.  The one across from the Giant Eagle is the good one.  They just opened a few month ago.  This is their second restaurant, so you know they're pretty good.  Their first restaurant's on McKnight Road in McIntyre Square.  I recommend reading a few of the review for their other restaurant if you want get an idea of what they're about.  The good China Star serves authentic Sichuan style Chinese food.  You can tell they're authentic and good cause when you walk in, many of their customers are Chinese.  For those of you who like the general tso's and lo meins, not to worry cause they have all the \"fake\" Chinese food too.  Some of my favorites are their tan tan noodles, scallion pancake, shrimp in chili sauce, double cooked pork, garlic egg plant and they have hot pot!  So, if you don't know which China Star to go to, pick this one.  It's just a few minutes away and the food is much MUCH better.  I would give this restaurant a 4.5 out of 5 stars just because the serves could have been better (not to say it was bad).  I've actually tried the other China Star too.  No authentic food there, but their \"fake\" Chinese food wasn't bad...it wasn't very good either.  It's kind of funny but I think the non-authentic Chinese food from the other China Star is better.  In short, if I feel like some good old general tso's, I'd rather go somewhere else.  I would give this restaurant a 2 out of 5 stars because the food is edible but nothing special at all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jUC110N2Y34h-4GNij9gsA"
  },
  "0dJpD_47XNkUTPvTHASfJg": {
    "date": "8/7/2011",
    "text": "Very yummy.  I got to try a huge variety of dishes with a big group of friends who knew what they were ordering.  All dishes were great!  My favorites were Beef in Hot Broth, Shredded Pork w/Seasoned Tofu, Braised Pork Shoulder, Mao's Pork, and Double Cooked Pork Belly.  Off the appetizers, one of the Bean Jelly Noodles was delicious, and Honey Pork Ribs were also great.  I know I just listed a ton of dishes, because they were all awesome!  I'm actually not great at handling spicy foods, but everything was very flavorful with the right amount of spice for me, and I didn't have too many problems afterwards :).  Of course, you might want to steer clear if you have acid reflux, but they do have some good non-spicy dishes available, like the Braised Pork Shoulder & Honey Pork Ribs.  Finally, the prices may seem a little steep, but they offer many dishes in two sizes.  The larger one is HUGE and the smaller portion is fairly regular-sized.  The appetizers are pretty big as well.  They also put out a complimentary little plate of either fried wonton skins or Chinese style boiled peanuts for you to snack on before your meal.  Definitely recommend ordering family style and sharing dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8heSpevri02f06W9VeNz0g"
  },
  "id8-f7qCsl5dXw3B00eOJA": {
    "date": "4/2/2012",
    "text": "I've always had nothing short of a wonderful experience here.  First, their cooking style is unique and delicious. It is oil-based as others have said, so it is not too heavy or greasy, and all of the ingredients taste incredibly fresh. I usually order off the Chinese menu so I'm only speaking from those dishes, but I'd imagine anything you get would be pretty solid.  The service is prompt and friendly.   Excellent Sweet N Sour soup, some of the best I've ever had. I also definitely recommend getting dumplings of any variety.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jViaKaDqInYlTm8iMFDWDA"
  },
  "oKq8o2piPdqgYWPLla6ZDw": {
    "date": "11/13/2011",
    "text": "I'm not planning on being overly elaborate in my praise, but this was seriously the best chinese food I have ever had. I wasn't even particularly in the mood for chinese, but my brother was in town and was craving some. This was the first time yelp played a role in my choice, and I am so glad I listened to the reviews. I'm pretty sure I have finally found the chinese place to go to in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "15tAFpe3XFUSqS9uRjie8w"
  },
  "ut_bKWkhMhH2G8tvJhgNfA": {
    "date": "9/27/2015",
    "text": "So my husband read the rave reviews and opted to order from here tonight. 2 hours later and multiple phone calls to the restaurant asking where our food was and still no food. It literally took over 2 hrs for our food to arrive. From the first time we called, we were told our food would arrive in \"15 minutes\", later told \"5 minutes\", and finally \"10 minutes\". At no point were we told that there would be a significant delay and we should consider our options. There were numerous times tonight when we considered ordering from our staple restaurant but after reading the reviews, didn't want to give up on trying the food from here. When the food did arrive, not so much as an apology was offered. So after all that, we finally eat and my husband and I both looked at each other and had the same comment. \"Bland\". We ordered 5 different dishes and all  had the same bland flavor profile. Although the ingredients used may be good, the dishes are very one note. I was sadly disappointed by my hunan chicken which did not taste significantly different from the Beef Hor fun or my beef noodle broth. There seemed to be little spice and very little garlic taste. The only thing that I did enjoy were the dumplings in that they were not dough-ey but rather very thin dumpling shell. Suffice to say this was a tremendous disappointment and the service was truly abysmal. We will not be ordering from here again especially when there are so many really good asian food restaurants in the proximity with far better service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_EhB381lawH0dAAP867WdQ"
  },
  "GasUfXTQi-SxgQCGEjP7Dw": {
    "date": "3/8/2012",
    "text": "In general I'd rather explore somewhere new than go back to an old familiar spot.  Not so with China Star, i went 2 weeks ago and have been back a total of 3 times since.  Yes it's that good!  They have an american chinese menu and a traditional chinese menu, so be sure to request the authentic one if you have a taste for the exotic.  All their food is good, but I LOVE spicy food and their Szechuan food doesn't pull any punches.  The hot pots in a sizzling pepper broth, are brought out still boiling and are as good as any Schuzuan I've ever had.  They have a huge selection in general, and vegetarians won't have any trouble finding a ton of great options to choose from.  Ordering from here always takes a while, not because of anything wrong with the service, but because it takes so long to scan through the endless menu and narrow it down from all the amazing choices!  Reasonably priced, friendly service and authentic delicious Chinese food.  LOVE IT!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "MDeA-Gx8NScCyAdziq7IeA"
  },
  "8LS28prSNWVvx4wXc7RT-Q": {
    "date": "12/8/2011",
    "text": "I don't know if I just ate there when they first opened up and didn't have their sh*t together, but it boggles my mind that this place has gotten so many great reviews!  The service was HORRIBLE.  Our server basically ignored us, never refilling drinks or asking how the meal was, which made sense, since she ignored us while we were ordering anyway.  Wrong appetizer and missing chicken from the sesame noodles...with chicken.  The Pacific Rim was much better!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hj9Ls-7MRbzJ4TaFM27ZXQ"
  },
  "B39rIE3sPJOvO_njyKF0Iw": {
    "date": "10/14/2012",
    "text": "I found this restaurant by accident on Yelp and had to try it. The food was delicious! We got our food quickly and the service was great. Their menu is very diverse and you can get actual Chinese courses if you prefer. I would definitely recommend trying this place out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KM9_K-zfILo5EWwKxKbhCw"
  },
  "k0t2aOuoQXx_OBiOcHNp2A": {
    "date": "4/20/2012",
    "text": "very spicy and tasty chinese food :)  friendly waiters who didn't seem to know the food !!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yeQ_7p0DoGcHtRC71mE60w"
  },
  "GhwzXAZM7WKmEp_lB8xpMw": {
    "date": "1/1/2012",
    "text": "I took my daughter there today and it was pretty good, the steamed shrimp wrapped in rice paper was delicious. Her wonton soup was exceptionally tasty, the wontons were filled with huge amounts of meat. My dish was shrimp, scallops and vegs in a mildly spicy peanut sauce with brown rice, very tasty. The only reason I gave it 4 stars is the general tso chicken wasn't that good that my daughter ordered, the chicken I tasted was dry and the sauce was too thick, kind of stringy. They need to work on that dish, try chunkier chicken meat and thinner sauce.  I will go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6QXeCkkenKagYeuH9ixQA"
  },
  "QmG5IGz4seHcqRCQzefQVg": {
    "date": "10/28/2011",
    "text": "I was not sorry to see Pacific Ring go and so was excited to try a new restaurant!  All I can say is wow!  We ordered off of the authentic Chinese menu and really enjoyed our choices.  My husband had the beef soup which was very flavorful and a huge serving.  I ordered a dish with fish and tofu in a spicy sauce.  Yummy, yummy, yummy!  I also had a cold beef tripe appetizer.  Also very good.  As we live around the corner we will definitely be working our way through the menu on a regular basis!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q8wAjdilbynYlWU8Jx592g"
  },
  "j2QqAQTCrsiWPkyqr4HDOw": {
    "date": "10/26/2018",
    "text": "It takes them two hours to deliver to a place within 3 miles. Do not offer deliver services if you are not able to manage it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GTfa_HH5lrxdMvjJuSfzpQ"
  },
  "LMYwxITIr1lIYsEEAk_UjQ": {
    "date": "2/12/2017",
    "text": "Braised Pork Rib Noodle Soup- the best thing I've eaten in months. And hotttttttt. Slurp, sniff, blow nose, slurp. This broth is the real thing x17.   How long has it been since I had to blow my nose throughout the meal? Oh my gunness.   And the noodles. I've never been much of a noodle-raver but these puppies know my name.   Also in my favor is an eight percent discount with Yelp check-in.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "G3PE8NM7wfYDUcLwRs4pyQ"
  },
  "HBtn3rY1JlTKmfvxnO0V9w": {
    "date": "1/2/2017",
    "text": "Those other places can keep their stir fried rice and General Tso's chicken- which admittedly can still be good at times. But this stuffffff... Oh my.   We were six people. We got five dishes. One had lamb. One had chicken, with a flaming ember still underneath. Another had pork. I think there was a beef, and one of green beans. And we set them all in the middle of the table and devoured them like a pack of hungry family members. Our waitress had helped us decide on what to order. She spoke broken English and yet was so helpful and nice and even helped with gluten accommodations. There are so many possible ways to prepare such ingredients, and yet with Sichuan Gourmet's way of cooking, I simply could not ask for a tastier meal.   And then, complimentary orange slices at the end of the meal. The option of ordering pork brain. Eight percent off total bill when you check-in with the Yelp app. Inviting atmosphere, borderline almost upscale, unlike the bland food-getting place it could so easily be. I will return to Sichuan Gourmet forevermore when I need real Chinese food.   ***With credits to my Malaysian friend and my Taiwanese friend for having previously introduced me to such a way of eating.***",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 7,
      "cool": 8
    },
    "photos": [],
    "user_id": "EOkVeJW7QV5vtD_fhiVXhg"
  },
  "AWm7pXmM1qEQYJOzTJuTww": {
    "date": "8/24/2017",
    "text": "The food was not impressive. The service was bad. The waitress was mute!!! She did not greet us at all. Threw the menu on the table. Did not ask what we need or how we were doing after delivering the food. She did not say thank you or good bye to us.  I will not come back unless they train their waitresses how to speak politely.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w0JHPkyFN3dS5TNCHrhZZA"
  },
  "UW9cSCvGgHghF27ZfUbnsw": {
    "date": "1/24/2016",
    "text": "I've been here twice and the first time, service was great. The waiter was very friendly and happy. The second time, the waitress was rude and service was crappy.   Unfortunately, with the risk of getting this server again, I will be going to the Oakland location from now on. She did not greet us and neither did she smile at any point. In fact, she seemed angry that we were there. Not to mention, she threw our check at us. Yes, she threw it without saying a word. A simple \"thank you\" would've been nice.   Both times, the food was consistent and tasted very authentic. The majority of the menu items are spicy, which is how I like it. Sichuan Gourmet has a huge menu and it can be overwhelming when you don't have the slightest idea what to order. Like myself. So I found myself looking around at other tables to see what they got. A lot of people seem to get the flaming pans which I have yet to try. But it seems like popular items are the Dan Dan Noodles and Dry Sauteed Green Beans. The Dan Dan Noodles are life-changing. However, I will say the Oakland location does a better job of it, mainly because Oakland's noodles are a flat noodle, and Squirrel Hill's are a round noodle. The noodles at the Oakland location are also a nice al dente while Squirrel Hill's was a bit over cooked and mushy. The flavor is delicious at both places, though. I really enjoyed the Dry Sauteed Green Beans as they were very flavorful and rather crunchy; it's a great item to order alongside anything spicy (for when you need a break from the tongue-numbing spices). I've tried a few other items from the menu and all have been consistently enjoyable and well-balanced in flavors.   Overall, huge, extensive menu. Food is consistent. But service is hit or miss. 3.5 stars.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3-Y2rBFEvPRGsb_8j_H4sg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Dan Dan Noodles",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3-Y2rBFEvPRGsb_8j_H4sg/o.jpg"
      },
      {
        "img_id": "pxb_R4sLKPjF2deX9JqOsg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Dry Sautéed Green Beans",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pxb_R4sLKPjF2deX9JqOsg/o.jpg"
      },
      {
        "img_id": "kxGK8xlAc4bBGw7ZTHeE4g",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Mapo Tofu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kxGK8xlAc4bBGw7ZTHeE4g/o.jpg"
      }
    ],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "Emj-af4yfeHR0dTfRzoVEA": {
    "date": "5/25/2017",
    "text": "Sorry I was not impressed. I like Chinese food, I grew up loving Jimmy Tsang's. It was an evening out with a friend. We had a discount certificate for dinner that night and decided to give it a try, being that neither of us had been there before.  We didn't have trouble parking, we wanted to shop in Giant Eagle after dinner, so we parked in the grocery store lot. We walked in to find a hostess waiting at the door. She handed us both a menu and showed us to a table. We were only one of two tables in the restaurant that night. We ordered from the menus given to us, but when the order came to the table, my friend noticed the seafood was missing from her dish. The server told us that we were given the wrong menus. It was clearly a mistake on their part. The server hesitated on make compensation, she went to take the dish away, but we insisted that she just bring the seafood out on a new plate, who knows how long it would take to have the plate brought back. After talking to a manager it appeared to be, showing him the menus that she gave us, she return to the kitchen for the seafood to put into her dish. We were not compensated for their mistake. Overall the food was good. The tea was excellent, I can remember ordering another pot, before the night ended, because we did not receive any refill on our glasses of water. The service was very slow, but friendly. I am not sure I would return. I might try the Oakland restaurant instead.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GMazqhuNAvIyTEvt-kOagw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Chicken/Broccoli @ Sichuan Gourmet in Squirrel Hill",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GMazqhuNAvIyTEvt-kOagw/o.jpg"
      }
    ],
    "user_id": "3egcdazws_x1wW35jgXfNw"
  },
  "YwSCeZpSuctMFVQJgHa9Rg": {
    "date": "11/29/2015",
    "text": "I've finally had a chance to dine here in person, and was blown away by the deliciousness of the meal.   First and foremost, the dry sauteed green beans with minced pork we had were DELICIOUS. Easily the best green beans I've ever had, and I'd go back there just for that alone. So good. Seriously--try this! My friend and I also sampled the steamed eggplant with garlic and spicy sauce. The spicy sauce was simply red chili oil and came on the side (much to the delight of my friend). The eggplant was simple but tasty, and another nice edition to an otherwise super spicy meal.  I opted for the sauteed eel as my entree (from the specials menu) and my friend was boring got the beef hor fun. He has a thing about not eating spicy food in public because of how red it turns him, but I decided to go for the more authentic sichuan style dish. The eggplant was sliced into thin strips, lightly battered and fried, and then sauteed with green peppers, ginger, bamboo, celery and the signature red chili oil. It. Was. Delicious. By the time I was halfway though (still had enough left over for a meal afterwards) my lips were tingling and my nose was running. To you all that may seem like torture, but it was worth it because of the flavor it gave the dish. I asked for a to go container for the left over chili oil and they kindly obliged.   The service was friendly and relaxed--we did not feel rushed to hurry our way through the meal like at some other establishments, and the staff was very friendly. I'm glad I finally got a chance to visit this place in person--I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "m7758u27txVzYdbILs-ISw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Dry sautéed green beans with minced pork.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/m7758u27txVzYdbILs-ISw/o.jpg"
      }
    ],
    "user_id": "mLDC0DjkT2IJkoppBze4eA"
  },
  "rKNLsXKtPqFxuqjs6WPqzw": {
    "date": "12/20/2016",
    "text": "This original Sichuan Gourmet recently renovated their interior, and they now look more like the second location in Oakland. The decor is more earthy, wooden, and dimly lit, as opposed to the bright reds that were all over the walls in the original layout. The main menu and service haven't changed too much, though they're starting to add more special or seasonal items, many of which are listed on the blackboard at the front. Recently we stopped in and had a warm, hearty lamb noodle soup. While this isn't a Sichuan item, it was absolutely perfect for a cold winter day, since it's more characteristic of a northern China soup. It may not be for everyone, since these are not clean cuts of lamb, but if you can pick through the bones then it will leave you feeling toasty and satisfied.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V3l3Op-q0sjg-eJ0lQeCcw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Lamb noodle soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/V3l3Op-q0sjg-eJ0lQeCcw/o.jpg"
      }
    ],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "beLzqoOV7c5E8TFGsYkG4g": {
    "date": "12/12/2017",
    "text": "The menu had many unique options but was a bit overwhelming. I wish the staff had been more helpful in recommending things to try. I liked the food I ordered, out of people I visited with one liked the food as well and the other only liked 2 of the 4 dishes we had ordered.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sMQ074MnfwgYkvePhtfZig"
  },
  "RENHwRmbwnOAFQQ40dfbiw": {
    "date": "1/13/2018",
    "text": "The hot and sour yam noodles have been a standby in my family for a number of years, perhaps over a name change or two! In any case this continues to be my baseline restaurant for Sichuan cuisine anywhere, and it compares favorably with places in Chicago and such. We of course always order off the Chinese menu, and it has plenty of variety, namely enough that we can come back pretty often, not be bored, and be pleased with our meals. Not quite five stars due to some inconsistencies (ie yam noodles have really inconsistent amounts of soup with them to the point that it's totally different in terms of whether it's sauce or soup), and because occasionally you'll land on something that's just a dud.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0nP7RnaaThFgphKUXtaZTw"
  },
  "ZVdzbTSeFkVgxLUUsuI9_Q": {
    "date": "2/18/2017",
    "text": "Wow! 3 times here and I'm smitten. Growing up, we would go to Jimmy Tsang's for large special family events. Sichuan Gourmet may be its replacement in my book. Their menu is very well adorned and organized with photos too! We've had sizzling fish, tea duck, garlic scallops, wonton soup, and a dish with  beef and chicken I'm not sure his Dad got and we've loved it ALL! And the service! Amazing! Tonight they were really moving and had several tables waiting, I was glad to see, such a great place. We will definitely keep coming back !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9cHwoFocl2YCsg9mg7MCw"
  },
  "ZzK_c5UWFyMt-PAah66ZQA": {
    "date": "10/11/2017",
    "text": "This place is really authentic, if you are looking for REAL Chinese food, this place won't let you down, I recommend Chongqing Style Chicken. It's crispy, flavorful and most importantly, it is SPICY. The service here is standard nothing special.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "_dC0B3x2mw4G3VBhKP-qCw"
  },
  "UZ5mKnK-9bgt5et1H-mF_A": {
    "date": "3/3/2018",
    "text": "Not the best experience. When we got seated we had to wait 10 minutes just to get or server and drinks. After we ordered food my food was brought to the table while the other dish we ordered we had to wait 15 minutes. So by the time I was almost finished the second dish they brought out. There was no communication from the server what so ever. Chicken was good steam rice was cold, broccoli was cold as well. When I brought to her attantion she said that it was for decoration purposes. I guess it a good place for a tackout but it seems like they get overwhelmed with customers and 10 server.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mL6vuw5dC1xMFLl-8gC8hg"
  },
  "qclS4YhPfbJURyB9CbmROg": {
    "date": "11/5/2016",
    "text": "Came here with my father because he'd been craving Chinese food. This was my first time here and had a $5 off coupon. First impressions were good. Was greeted right away and promptly seated. It's an ample sized restaurant and was pretty clean.   The service was pretty slow for the number of ppl in the restaurant. Thought we would've gotten our food a lot faster since there weren't a lot of patrons, but we waited a while. So much so, I had to ask a few times whether our food would come out. Our appetizer came out after our main dish. And our side came out when we were basically done eating. Needless to say, everything felt a bit disjointed. The food was fine, but not stand out, though the string beans w minced pork was quite tasty.  I'd give them another try if I'm in the area, but probably won't go out of way to eat there again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "N_LyFYrey_LuxJFkdFwRkw"
  },
  "7rhUgJynBHpXQSFuD6Df8w": {
    "date": "8/17/2013",
    "text": "Another great place in Pittsburgh to get Sichuan food. Other place is How Lee's but I think both are pretty much the same.  They not only have Sichuan food but they also have non-spicy traditional Chinese food. They are pretty decent but you could probably get the same dishes elsewhere that are better tasting and cheaper. So I highly recommend getting the Sichuan dishes.  Dishes I recommend:  Fu Qi Fei Pian () - Beed tripe, tendon, tongue in Chili Oil (My Absolute Favorite) Shijin Mao Xue Wang ()- Pork Blood Tofu, Intestines, Fish Fillet and Beef Tripe Jiang Bei Shui Zhu Yu ()- Fish Fillet in Spicy Broth, Chongqing Style San Bei Ji ()- Chicken with Basil (This is okay here, better at Rose Tea) Yu Xiang Huo Jiang Chao Qie Zi () - Chinese Eggplant in Garlic Sauce or Soy Sauce Gan Bian Si Ji Dou () - Dry Sauteed Green Beans with Minced Pork Cheng Du Liang Fen ()- Chengdu Bean Jello Noodle Dan Dan Mian () - Dandan Noodles with Minced Pork Mu Er Hua Rou Pian () - Pork with Wood Ear Mushrooms Hong Shao Ti Pang () - Braised Pork Shoulder Chong Qing La Zi Ji () - Fried, diced Chicken with dried pepper, Chongqing style (This is extremely spicy. Eat it if you dare)  Things I recommend not to get: San Xian Sa Guo Dou Fu () - Chicken, Jumbo Shrimp, Pork, Tofu in Casserole (Compared to the Spicy dishes this is extremely flavorless. I guess if you do want to get this, make sure nothing overpowers it or you won't taste anything)  Xiang Yu Kou Rou () - Steamed Pork with Taro (Tiny portion, with very little taro)",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "d2ZWcI1ckp4j02b7tAKbWg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Sichuan poached sliced fish in hot chili oil",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/d2ZWcI1ckp4j02b7tAKbWg/o.jpg"
      }
    ],
    "user_id": "DC1hfeeSaYr2E1xwiEL81A"
  },
  "XqqL-1o1FgIv2DSE8girQw": {
    "date": "6/29/2018",
    "text": "better cooked and seasoned Chinese food than most places around the area. nice establishment to enjoy the meal in as well. have had a variety of items off the menu and I can't complain about anything. friendly staff and wick service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Xmw_WcUCShPD0qGO1UD7w"
  },
  "GHZ4R2p9gosl-f1UxYfQqw": {
    "date": "1/7/2018",
    "text": "Alright I think I finally realized why I didn't like Sichuan gourmet the first time. You just have to go to the right one! DON'T go to the one in Oakland. This one is sooooo much better. It's much cleaner and the service is better as well. The menu seems to be more comprehensive to me too and is divided into Chinese and American styles. Some of the food we had were even authentic enough to remind me of dishes I had in China. Also, I'm in absolute love with their fried pork intestines now and before today I had always avoided eating visceral stuff. This is such a game changer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EU5dSjk-UzILTp5kcg-dOQ"
  },
  "ca_mwyXeLdqpzeqVEmH7UA": {
    "date": "11/30/2015",
    "text": "Best place on the planet.  And I've been well around the planet.  They're always coming through with the raw chilies, too. Much love x1001!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Gf9qU7-Ij74GAcV8nPS1oA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. g&amp;#39;damn",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Gf9qU7-Ij74GAcV8nPS1oA/o.jpg"
      }
    ],
    "user_id": "WFi-8lwOPf3FLADG0Tw_zg"
  },
  "dY1MIPUSGSkRJhs0ZHnJBw": {
    "date": "1/19/2018",
    "text": "Great selection of items on their lunch menu. Most of the entrees are sort of pricey but their portions are huge so it's probably worth it. Very authentic food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J5vEo3tpxCriMr0cTsN5pw"
  },
  "uhDejePny3XX_GIp8Rb2zw": {
    "date": "2/8/2018",
    "text": "Very good quality steak in my sichuan beef.  Could have been a little more spicy.  Service was excellent.  Extensive menu including pork, chicken, beef, lamb , duck, seafood and much more.  I will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i7CbdSyezRiHwy-XYOF7ew"
  },
  "_xEpwSMjq47XyzKOFTodxw": {
    "date": "11/2/2013",
    "text": "The best traditional Chinese Dian food I've never eatten in Pittsburgh.   Especially, the braised pork shoulder in spicy bean paste. And fish fillet in spicy broth, chongqing style.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "37DP5RDnxjCeH0xwEsqTMA"
  },
  "NKvOSt7FyF1ZWDxqlS14eA": {
    "date": "4/30/2014",
    "text": "My husband and I stopped here one day to try out a new Chinese place in the area than our usual places. The place looks really nice inside and they have a pretty broad selection on their menu. My husband and I ordered off the American menu. I got the chicken and broccoli and my husband ordered general tso's.   The food was delicious! The portions were just right and for the price you could save half your meal for lunch the next day.  The service is the only part of my issue with the restaurant. The waitress was very friendly and nice but not attentive. But it wasn't only her, other tables I could see were frustrated with their waitresses as well. Ours didn't refill our glasses of water, which I feel is pretty important, nor did she do the one time \"check in\" to see how the food was. She along with the other two waitresses were gone half the time and the restaurant wasn't even that packed with people.  If we were to eat here again, we would only get take out because we sat around for half an hour just waiting.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vrB2Ae6-fX0ZRBx7HBIskQ"
  },
  "zqtlYVAoqEGRE5u2zYj_kg": {
    "date": "3/26/2017",
    "text": "bad service. Arrived at 9:20 and they asked us to take out at 9:50 because they had NOT started on our order yet! Still Tipped but never visit again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Akrg1LOBBVNvA_YIZLChg"
  },
  "0e6DWNSO-Yr4EOqiT2ZbOA": {
    "date": "1/21/2016",
    "text": "Wasn't I glad to find a place that wasn't closed on Christmas day! I would have been thankful for any place that was open and serving food when I walked in here. But, this turned out to be much more than your regular run-of-the-mill Chinese place. It was a place I'll remember for quite some time, and solely based on their food. Services and decor were fine, nothing to brag about, but nothing to complain about either. The menu was long and interesting. It has a long Chinese part and then an American one with popular dishes like Orange chicken, General Tso's chicken etc. Please do yourself a favor and order from the Chinese menu. You can stick to more conventional vegetarian, chicken, pork, beef, or fish-based dishes, or be more adventurous and try their rabbit or frog or maybe eel. I went with a spicy Chengdu style fried shrimp entree, and my husband decided to try their chef's special sweet and sour eel dish. They were both good. The sweetness of fresh tiger prawns within the spicy crunchy batter - it was indeed a delight. My only complaint was that they should have mentioned it's a completely dry dish. Having it under entrees and serving rice with it does not make too much sense. The eel was very good too. It was my first time, so I didn't know what to expect. But, I liked it a lot, and the sweet and sour curry was phenomenal and complemented the rice really well. I did not want to take any stars off since their food was so good, but this place needs to put some effort into modifying their menu book with descriptions of their dishes, or training their staff to be better able to describe their dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rJ06IwXG0fn2p2FHJcLjLg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Sweet and sour eel",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rJ06IwXG0fn2p2FHJcLjLg/o.jpg"
      },
      {
        "img_id": "A48pq32-qP9pL6iwdZ-FCg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Spicy fried shrimp",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A48pq32-qP9pL6iwdZ-FCg/o.jpg"
      }
    ],
    "user_id": "DBU42uXHY4eBCT5nAwdiWg"
  },
  "9DutP9IxxK-_zn5lKM-JmQ": {
    "date": "2/17/2016",
    "text": "Most authentic Chinese place in Pittsburgh. This is a really rare place to find around here and it's comparable to restaurants in NYC or SF",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UQmQFfV11CSgKzJn4m6pcg"
  },
  "HPkjhwz-3VnKWBJ8vEkD6w": {
    "date": "2/10/2016",
    "text": "Quoting my roommate, this is the best Chinese takeout I've ever had.  The Fish and Tofu in Spicy Broth and Mao's Pork are my two major staples. Spicy Shredded Potato and Mushroom and Bok Choy are my top two vegetable dishes. Since moving to Pittsburgh, I've ordered from here 5 days out of the week for the past half year, and will probably continue to do so.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4-0xEhu7dq39Df1wbgOezQ"
  },
  "scbZdzYHj6b7V16yPeqvkw": {
    "date": "11/28/2016",
    "text": "Awesome authentic sichaun food! Loved the flaming fish, eggplant appetizer, and the spicy fried chicken!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wpdqZTyNSw5IFbR1x0QVGg"
  },
  "ZTv6EFnlsD6NBSIE6Wg-CQ": {
    "date": "5/24/2015",
    "text": "The last time we ate there (Feb 2014) , I had very bad headache from the MSG in the food. I was told by a friend that they changed the chief in the kitchen.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-VVSLzMsaVsLOeSce8fVA"
  },
  "KSA0KyWJrpMh2stCwuYQ_w": {
    "date": "3/28/2016",
    "text": "This is the place to go to for real authentic Chinese food in Pittsburgh.  They do have two sections of the menu, one that is an Americanized one and the other a more authentic one.  I can't really comment on the American side, but I'm sure it's probably good.  But if you're reading this and planning on going chances are you're not going there for the General Tso's.  They have dishes such as  sauteed duck tongue, intestines, pork blood tofu, intestines and many other things.  It's quite an extensive menu. If you are daring enough to try it expect levels of heat and sensations that the American palate is not used to.  The Chongqing Chicken will create a unique sensation of burning and numbness that will make your mouth tingle with electric feeling.  It's very unique and we are very lucky to have a place like this here in da 'burg.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NWbISRjfoKl8YHCEXyUCPQ"
  },
  "fgLH2w1I0bOb_Z_QL8_U7w": {
    "date": "8/5/2011",
    "text": "To clear up any confusion, the new name is Sichuan Gourmet.  The restaurant was losing too much business to another China Star on Murray Ave in Greenfield. Sichuan Gourmet is authentic Sichuan.  This is the food that the Chinese G20 Delegation ate when they were in Pittsburgh.  The food is wonderful, and the service is very attentive.  I like this new location, and it looks like they will thrive in Squirrel Hill.  The Tan Tan Noodles are a great appetizer to start with.  I like the Flaming Pan dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dsR6kaBv2R0bDxocBOjE2A",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Shrimp",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dsR6kaBv2R0bDxocBOjE2A/o.jpg"
      },
      {
        "img_id": "36S1q2oifMZQdqQFrTeM-A",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Fish (Flounder)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/36S1q2oifMZQdqQFrTeM-A/o.jpg"
      },
      {
        "img_id": "dvRE1QYSB0wNwekKZ2eS-A",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dvRE1QYSB0wNwekKZ2eS-A/o.jpg"
      }
    ],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "vfUbkfdC0WhB7PHzq6TGQA": {
    "date": "3/16/2016",
    "text": "Had the cumin lamb, beef tongue and tripe and fish in spicy broth.  All were excellent. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wowUudflcxllOaEU4IL_qA"
  },
  "2QXfil4gdvCdlcEi0kxBnw": {
    "date": "2/7/2016",
    "text": "They are awesome. Best Chinese restaurant in Pittsburgh no doubt. I think it's also better than the new branch in Oakland too. Glad we came here for Chinese New Year's Eve dinner!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ATjhH5qnYMehAhWmLaeQXQ"
  },
  "Ki68YQq9ox4_AARVhxZwhg": {
    "date": "5/22/2015",
    "text": "WOW.  I came from Houston to visit family.  I always thought our Chinatown food was good.  That is until I tried this place.  The food all smelled and looked so good, I didn't have time to take any pictures.  I just dug in.  Everything was memorable.  My picks were the mushroom with basil and taro, sauteed green vegetable, and soft tofu with fish.  I wanted to order more but we already had enough dishes.  Definitely, I will have to return.  If you are vegetarian, this place is happy to accommodate.  There are a variety of vegetarian/vegan dishes on the menu already.  If you are strict vegan or gluten-free, this may not be ideal for you.  If you are not strict, then eat on!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "_-JaWKcYeOIwwxQBN2qeUg"
  },
  "QMa_MT71-EdkCqu2pIjRgA": {
    "date": "8/8/2015",
    "text": "Ordered the Amazing Chicken, found it tough and overcooked.  Was my first time here, had a groupon. Would give it another chance. A very nice and clean restaurant. No place beats Taipei Restaurant in Fox Chapel.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oblT1TMsYYr6aNW28rCw_A"
  },
  "sgg07QCOSj7DMfdi0MHfow": {
    "date": "1/9/2016",
    "text": "This is a nice Chinese food. We ordered duck, fish and some vegetables . All of them are nice",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Appe1mTpAcHjNnhgJaltSw"
  },
  "IHlCq1iX6p5V9NCltOONCw": {
    "date": "5/18/2015",
    "text": "REALLY greasy foods. I ordered the tofu, didnt think that was too bad, however the food portion compare to the rice is ridiculous. Too much rice!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "EnbcN0V12D96soMlJb2zsg"
  },
  "j1KzhMjp-CAoPi3XDB-n-Q": {
    "date": "4/18/2014",
    "text": "I've only been for the lunch menu, but it is cheap and generous in portions. I've tried a couple things and all has been exactly as expected. My only complaint it is a little slow sometimes. Not the best place if you're in a hurry.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DVpp6zkvbnqPz34duLKcsw"
  },
  "Timj5d7UT1smh6A31jOgcA": {
    "date": "9/14/2015",
    "text": "This is a modest neighborhood place, with slightly dingy decor and a somewhat tacky menu with pictures of the food.  (Rick Steves says never eat anyplace with pictures of the food.)  But, that's not the main thing.  The food is.    Pretty extensive menu, ranging from authentic to what they call \"American\" (which underlines the fact that what we think of as Chinese food isn't real Chinese food).  I liked what I ordered, and thought the prices were reasonable.  Good, not great.  I'd definitely keep it on the list when hungry.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4jRkKFtSUgNhShQFXNRGXw"
  },
  "8wP2ADaml9xxjQoJRjzcew": {
    "date": "9/25/2015",
    "text": "Ordered again today after an hour and 25 minutes still no sign of my food so I call in and he says it'll be another 10 minutes after calling his driver. I live 12 minutes away from this location. Will never order from here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mkIt8BaYxqGGhaVHt6BxQA"
  },
  "XQ9NiKgg_Zsyz31WaGX68A": {
    "date": "12/8/2012",
    "text": "Every time we walk by this place it is filled with Chinese people so we thought, hey, this must be the place to go... so we went.  There are so many choices... an Americanized menu and an \"authentic\" menu.  Well, WATCH OUT if you order from the real Chinese menu. They are not kidding when they say spicy. I got the spicy chicken in pan -- check out the pictures for a view -- and it was so hot that I couldn't feel my mouth. Don't get me wrong, I love spicy, but living in Pittsburgh for so long, I was out of practice for this one. The best part of the dish was the flavor. I tasted so many actual spices, like parsley and garlic and pieces of what looked like all spice. It wasn't just a heap of soy sauce. My husband's dish was covered in delicious garlic and beautiful peppers--both green and hot.  We will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "rpK40ZN2rNFJLhfdlQqS-Q"
  },
  "XG73DIBmVtMu6LIm3QDEXQ": {
    "date": "10/7/2018",
    "text": "One of the best Chinese food in Pit . I have spent lot of time in China . This is the closest it comes to True Chinese food from China . People are courteous and prices are reasonable I always like green beans with beef",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2tw3kEfLEvuacQNo9smDiw"
  },
  "XVRwRAxbYGwrSvfz77gHpg": {
    "date": "3/18/2018",
    "text": "Excellent authentic Sichuan restaurant- by far my favorite in Pittsburgh. I really like the spiciness of the dishes and they use real Sichuan peppercorns, which have an almost numbing property. Our favorite dishes are the three pepper chicken, the broccoli with black pepper (which actually has red chilis and Sichuan peppercorns), the spicy wontons in red oil, the kung pao chicken. The mapo tofu is also very good. I highly recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zWFlFV-fh0-EumUdXgOgKw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Cucumber with hot peppers - delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zWFlFV-fh0-EumUdXgOgKw/o.jpg"
      },
      {
        "img_id": "mVuZh2IH8NcK9t6kd0FeAw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Chinese broccoli with pepper",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mVuZh2IH8NcK9t6kd0FeAw/o.jpg"
      }
    ],
    "user_id": "eNeWJSdv2q_pGDv1tftUJQ"
  },
  "y_WY5vCmdODCd5UUTDyUbA": {
    "date": "12/26/2016",
    "text": "I was literally reading reviews of this place as my husband and I were on our way to the restaurant. I heard all of you smart Yelpers say over and over that this is the place for authentic Sichuan food, not delicious Americanized Chinese food. I could practically hear Yelp speaking out loud to me...\"Order from the Sichuan menu, Tricia.\"  But guys, I love Americanized Chinese food. I love authentic food too, but I can never resist the urge to try guilty pleasure Americanized food. So when the time came to order, I'm sad to say that I ignored your advice and ordered a general-tso-esque dish (\"Amazing Crispy Chicken\") from the Americanized menu.  And the result? My meal filled with tough, overcooked chicken in an overly-sweet, one-note sauce went virtually uneaten and I ended up stealing half of my poor husband's Chongqing Chicken, which was spicy and flavorful. Yelp was right...the Sichuan menu is where the good stuff is. You guys knew it. My husband knew it. And now I know it. Next time I won't be foolish enough to go my own way, despite my unnatural love of all things general tso.   Service was very friendly and the food came out quick. I'll definitely be back again to order from the correct part of the menu! :)",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "0EhPIlDozxGKpbbHRr6vZg"
  },
  "ml_E2kTXHm3HbsJsyAzvkg": {
    "date": "6/16/2017",
    "text": "I'm giving the place 4 stars for 3 reasons:  1 - Everyone at my table really enjoyed their food, minus myself.  They all ordered from the American portion of the menu - Walnut Chicken, Chicken with Broccoli, and Vegetarian Ho Fun.  I tasted the Ho Fun, and it was very good. 2 - Ambience.  I really enjoyed the decor.  It was very clean, and didn't smell of MSG as soon as you walked inside the door.   3 - The servers were friendly and prompt.  It didn't get 5 because I really didn't like my dish.  I got the Mapo Tofu.  It was the right amount of spicy, but the sauce was very, very oily.  I'm also not the biggest fan of silken tofu.  Although they use that at most Asian restaurants, the silken tofu with the sauce just made the entire dish slimy.  I ordered specifically off the Sichuan menu because of recommendations on Yelp.  I was leaning towards General Tso's Tofu prior to my visit.  I think if we go back, that's what I'll choose.   Also, yelpers, if you yelp them, you get 8% off your next dining experience!  At least I did.  So, super cool!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-aYYid2h-B-cKGFZdtx_MQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Mao Pao Tofu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-aYYid2h-B-cKGFZdtx_MQ/o.jpg"
      },
      {
        "img_id": "2hhpcihy2RxfmmiueyaUpA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Non-American Veggie Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2hhpcihy2RxfmmiueyaUpA/o.jpg"
      },
      {
        "img_id": "ox5I7DgFTV_sFLZ6Zv_JvA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ox5I7DgFTV_sFLZ6Zv_JvA/o.jpg"
      }
    ],
    "user_id": "8x6xjNCbYKeXvyvgNwBpZA"
  },
  "gx77m_OT1LmRSy7h7Vy4vg": {
    "date": "1/5/2017",
    "text": "I came here with my parents and they were able to communicate to the waitress in Chinese as well as order from the Chinese menu. I thought it was funny that the first part of the menu showcases authentic Chinese dishes, and then the second part features Americanized Chinese dishes such as General Tso's, but this allows them to cater to everyone's taste!   I was scared to try the Chinese dishes here at first because they have a reputation of being really spicy, but they weren't that bad! I would recommend getting a mix of spicy and non-spicy dishes for your first time - they are clearly marked on the menu, which is helpful.   All of the dishes we ordered were all really good and tasted authentic. The service was also great and the food came out quickly. We used the 8% off check-in offer from Yelp and had no problems with it.  The Squirrel Hill location definitely looks more upscale than the Oakland one, and was well decorated. I will be coming back again!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RGORnkofHF2RIx9JHfmXkw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RGORnkofHF2RIx9JHfmXkw/o.jpg"
      },
      {
        "img_id": "0GiIzxhtXkdblz8vCaiDVg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0GiIzxhtXkdblz8vCaiDVg/o.jpg"
      },
      {
        "img_id": "-e6BX8MJebZYZWaHMkSErQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Braised pork belly",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-e6BX8MJebZYZWaHMkSErQ/o.jpg"
      }
    ],
    "user_id": "H4e9rk3r1aOm_9ouGMPXTQ"
  },
  "SlnQP342YN0Zlu-nlsGyFw": {
    "date": "12/25/2018",
    "text": "Terrible. Maybe it was because it was Christmas Eve and they were busy, but the meal was complete disaster. Take-out order and they forgot an entree; small portion, unappetizing and dry; hot and sour soup tasted like vinegar. Sustained ourselves on the white rice and fortune cookies. Won't be going back. Waste of $100.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SDPo_p9wm1DCbrfeCcZiVQ"
  },
  "fSxFgTWLJ5Z_H10_khN_kQ": {
    "date": "4/15/2017",
    "text": "Have been here multiple times and never had an experience where I left the restaurant unhappy. I specially like the Chongqing chicken and the dry fish. The quantity they offer is good for the price. In my opinion, the quantity they serve for one order is sufficient for two people.  Tip: i just got to know from the waitress here that if you have any issue with your food, dont wait until you are half way through it, let them know immediately and they will change it for you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bmSuFvdMyF66PDUZr9VfoQ"
  },
  "g6VsUemH9hv_weIRNLQDmA": {
    "date": "12/30/2017",
    "text": "I thank god that this place exists. I've been here for almost every occasion (in a relationship, after a breakup, during a relationship break, with friends, with acquaintances, during finals week, on awkward double dates) and the food always is great! The Cumin Lamb is one of my favorites, Mao's Pork Belly is deliciously sweet and salty, and the Garlic Rib Tips are yummmyyy! I will continue coming here until I move out of Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cx6QIU9RAxBc96uxsbyNbA"
  },
  "srroLZVJbKFGC4MmwBDLRQ": {
    "date": "6/19/2018",
    "text": "I don't travel 900 miles to this restaurant once a year for the service. I've never had anything bad off the \"traditional\" menu. One of my favorite chinese restaurants in the US.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Kx7SVxbvfWf46FUczYtebg"
  },
  "swegIBb-8RrIbzevvDYfUw": {
    "date": "9/23/2015",
    "text": "Delicious and (apparently) authentic Chinese food.  Don't order off the 'American' menu - live a little.  I've ordered the seafood sizzling rice dish both times I've been and it's totally worth it.  They pour some kind of broth over the platter table side so you get a free show - it smells delicious and tastes even better.  We also got the Mao style pork belly dish which was unbelievable.  I'll be back and will try new dishes because everything I've had has so far been so good!  They sometimes have groupons so check to get one before you go! Great deal",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9O-9I0SG5NXu6_cA9CGWHg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Mao style pork belly - so flavorful!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9O-9I0SG5NXu6_cA9CGWHg/o.jpg"
      },
      {
        "img_id": "yvFX3m1yYb6YtZajNhBIww",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Seafood sizzling rice - yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yvFX3m1yYb6YtZajNhBIww/o.jpg"
      }
    ],
    "user_id": "hjk--8VuDX3479_atPJQ1g"
  },
  "sqLYj6ZWWc4mxEKnw8c4ig": {
    "date": "2/1/2016",
    "text": "Pretty good authentic Chinese food! My Chinese friend actually took me here and ordered all the dishes. I knew I would be in for a treat when I saw the whole menu was in Mandarin and all the servers as well as the surrounding diners were Chinese.   We had the cold sliced beef app and I never had anything like this---actually pretty tasty. They serve it with a dry pepper mix on the side that you then sprinkle to your own liking right on the beef. Next, we shared a hot pan dish of pork which was delicious and pretty spicy. We also got chicken and that was good too. These portions are family style so if you order one per person, expect to bring home leftovers.  Great meal through and through. I saw many diners order bubble tea here; I wish I had a chance to try it! So that seems very popular. Oh, and don't forget to check in on yelp to get a discount off your bill :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pAGkhpQEeWemIiPnh0ybdA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pAGkhpQEeWemIiPnh0ybdA/o.jpg"
      },
      {
        "img_id": "bxYhYaIiHjioD8m0jZimzw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bxYhYaIiHjioD8m0jZimzw/o.jpg"
      }
    ],
    "user_id": "78dSO1f1Y5h0sYmUbxMhSQ"
  },
  "sXgon1kh0nVBLrtwOLde7A": {
    "date": "8/8/2016",
    "text": "I might give it another try and order differently, but based on my initial experience, I can't say I was impressed.  We headed out to see what they had to offer since we are still looking for a good takeout place.  They handed us a lengthy menu, with an additional page of specials.  Turns out those specials aren't all that special...and they don't even actually carry them all year round.  We also noticed that the menu was divided into a Szechuan menu and an American menu.  I appreciate the attempt to cater to American tastes and all, but stuffing an afterthought in the back of your menu book isn't really all that awesome.    My boyfriend got over being teased by two eel dishes on the special menu and settled on the General Tso Chicken, an eggroll, and some crab rangoons. Now, I know that these aren't traditional Szechuan dishes, but if you are going to offer them, you should do it right.  This was all wrong.  The eggroll was passable.  The rangoons were a little chewy and not really all that great.  The General Tsos was a travesty.  It actually reminded me of one of those dinner in a bag things you get at the Giant Eagle across the street.  It was super sweet...not at all crispy...and not at all spicy.  So disappointing.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "h9LPugJk2cpIh0gmQb5LnQ"
  },
  "uhkS-Sup-p6mjr7GAbQwlA": {
    "date": "7/23/2018",
    "text": "I hate to complain because I usually will suck it up and eat whatever I get bad or good. But I ordered take out from there Sunday night and it was the worst Chinese food I had ever had. My orange chicken was soggy and the king pow chicken was horrible with a horrible after taste. The dumplings were good and my hot and sour soup. That was it. Needless to say I'm disappointed I spent $40 on awful food at a place I heard has great food. I definitely will not return and waste money here again, sadly.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VEiHaRHKxYkQfrXGYxoSQw"
  },
  "PQ9yD5uwbPZjzDLziyNDPg": {
    "date": "4/12/2015",
    "text": "Its menu offers a great variety of choices compared to other Chinese restaurants in the city.   This is my first time dining at this place. I love all the dishes that I ordered. I ordered fish fillet with silk tofu and shredded pork with seasoning tofu.. I really love the fish fillet with silky tofu dish. The fish is so tender and full of flavor...This dish is usually really salty.but the chef here made it just right..the tofu is really silky and has great flavor ..I have ordered many fish fillet with silky tofu dish at different Sichuan restaurants and I would say that this is one of the best fish fillet with silky tofu dish I have ever tried.  The shredded pork with seasoning tofu is great as well..but personally i think it is a little bit too oily..but overall is great  Both dishes are relatively big portions ..we could not finish both dishes for 2 people..  The service is prompted..they served 2 dishes within 10 minutes from the time we ordered..  I would recommend this authentic Chinese restaurant in this city.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mWE3_zSN43xl5yNvuO0WfA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Fillet fish with silk tofu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mWE3_zSN43xl5yNvuO0WfA/o.jpg"
      },
      {
        "img_id": "xfzpyTUNiy_DtY5nZV0nBg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Shredded pork with seasoning tofu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xfzpyTUNiy_DtY5nZV0nBg/o.jpg"
      }
    ],
    "user_id": "h949ZwQiQAXD5GR3G5wMCQ"
  },
  "0Cp8hOT45eCh-KDNNmk0AA": {
    "date": "5/10/2016",
    "text": "While I am not a huge American-Chinese food eater, I have always wanted to try authentic Szechuan cuisine.  However, when I picked up a cold earlier this week, I just wanted some shrimp lo mein ($8.50) so I came here for takeout.  The restaurant has that very American-Chinese vibe if you eat-in, and the takeout was super quick.  The food was ready in about ten minutes.  Sadly, the Lo Mein and eggrolls I ordered were not good at all.  As other reviewers have complained, the Lo Mein was greasy and tasteless.  There was virtually no shrimp and tons of onions.  Thank God I ordered takeout because it needed some serious sriracha sauce.  After eating the Lo Mein, I really won't go back for the authentic menu.  It just wasn't good.  The major redeeming point was the service.  The food was quick, and the employees were friendly.  Credit accepted but cash discount!",
    "rating": 3,
    "rated": {
      "funny": 6,
      "useful": 12,
      "cool": 9
    },
    "photos": [],
    "user_id": "Ic6-gs1_FjrWGx6JIr95Mw"
  },
  "Yv0EklVJHGX_WIIbvfYMQw": {
    "date": "8/2/2017",
    "text": "I found a real Szechuan chinese food here ,oh my god really happiness. ,after order a mala pork and a fish hot pot and finished it,I feeling really full ,will come back next week,thks so much",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "lMZ2Mkn_u7qTYLshPrdXug",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lMZ2Mkn_u7qTYLshPrdXug/o.jpg"
      },
      {
        "img_id": "_XsEgFc4yqcCCCZH-AJT-Q",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_XsEgFc4yqcCCCZH-AJT-Q/o.jpg"
      },
      {
        "img_id": "ax1Q-g4oVnBfAsp6IqW15g",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Oh my god,found a real Szechuan Chinese food here!! I won&amp;#39;t be hungry now",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ax1Q-g4oVnBfAsp6IqW15g/o.jpg"
      }
    ],
    "user_id": "uJ63G9NvAQwGFtAkLD_Z7w"
  },
  "jxKjecrNiWr-OyQ0R7mByA": {
    "date": "5/15/2016",
    "text": "FYI: Only had takeout here once so far but plan on going back for a sit down dinner with my SO soon.   However, in the meantime, since I couldn't wait, and since I got a hankering for some Sichuan pepper (aka numbing spice, or ma la), I ordered a dinner portion of dry hot chicken as it's often known. Here the menu item is called Chonqing pepper chicken per the receipt, I think, although the person over the phone called it Sichuan chicken. So I'm not sure.   Either way, it was exactly what the doctor ordered. After the numbing reaction fully set in and my tongue felt like it was on fire, tingling, and numb at the same time, I knew I had some good Sichuan pepper at hand!  The dish was slightly more flavorful than elsewhere I've had, especially because of the fresh sprigs of cilantro. However, it wasn't anything to write home about quite yet.   Ultimately, I will update this review upon a more thorough sampling of the menu in the future. Assuming all goes well, I hope for 4 stars!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "SYdf-qaze_5WcdoceXsw3Q",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Sichuan pepper chicken, aka dry hot chicken, aka Chonqing pepper chicken (?)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SYdf-qaze_5WcdoceXsw3Q/o.jpg"
      }
    ],
    "user_id": "CIKD9oMj-qTZ3zDdgFW5_Q"
  },
  "F7tYb6C2r-LcOm8q2oShqQ": {
    "date": "4/26/2016",
    "text": "As hopelessly overpriced as the other authentic Chinese restaurants in Pittsburgh, because, I guess they figure they can be.  But Sichuan Gourmet definitely hits the spot for my (constant) craving for spicy Asian goodness.  I've been here a couple times in the past year, most recently for Saturday lunch with a party of 3.  This location was BUMPIN'--I was almost worried upon walking in that I hadn't made a reservation, but they were able to seat us right away in the pretty much full dining room.  (Full with like, 95% Asians, I might add--always a good sign in a place like this.)  Service was slow and harried throughout our meal--it would have been an issue had we been in any sort of hurry.  We ordered the CHINESE BROCCOLI QUICK-FRIED IN BLACK PEPPER, MULTI-MUSHROOM W. VEGETABLES IN FLAMING PAN, LAMB IN SPICY SAUCE SICHUAN STYLE, and a SMOKED PORK BELLY that was on special but turned out to be pretty much the standard double cooked pork in a black bean sauce.  There wasn't anything I wouldn't order again.  The Chinese broccoli was crisp with a great balance of mala flavor, the mushrooms in the flaming pan were meaty and umami (though that dish turned out much smaller than expected), and the flavors for both meat dishes were oh so delectable.  Everything was swimming in much more oil than I would have liked, which was the only thing that kept it from tasting completely like home.  But yes, this place will do for satisfying my Sichuan itch in Pittsburgh.  If it weren't for the price gouging, I'd be back much more often.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Yk6WWwezDBeQB3Kpb7xehA"
  },
  "rAlY9vqsMnflAHJJVPc50A": {
    "date": "4/14/2017",
    "text": "My favourite Chinese food in Pittsburgh. It's spicy, hot and amazing for my tastebuds. Because I can't remember the names of the items, each time we try out new stuff, and we haven't been disappointed ever. The squirrel hill location has more options of food and more hospitable staff. A big thumbs up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KlygiHMhVd2f6LAuLu3WJQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Jumbo shrimp with minced pork",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KlygiHMhVd2f6LAuLu3WJQ/o.jpg"
      },
      {
        "img_id": "V62Of1KnT_Ek1QYStfwQ2w",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/V62Of1KnT_Ek1QYStfwQ2w/o.jpg"
      }
    ],
    "user_id": "y_sJNqD9YnFWsjzHHUA04A"
  },
  "M9BV3N8PvhrPcLYqpnU7aQ": {
    "date": "3/5/2018",
    "text": "Great Sichuan in Pgh! I ordered a bunch of food so I could get a few meals out of my trip here and I am so happy I did. I loved the double cooked pork, mapo tofu, and eggplant in garlic. The scallion pancake didn't have enough scallion for my taste, but was still good -- nice and flaky.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "wRgqx1IP_mdE1TrGc1brbw"
  },
  "C8KMuI298IT-wQSwQfY0xA": {
    "date": "9/19/2015",
    "text": "Really good Chinese food. Not very authentic if compared with the food in China. But still good enough. Make me miss home!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r1Oe7-8ozaP_yCuDc9IGbw"
  },
  "B56V8Fjq32InXeG1-MOa1Q": {
    "date": "11/28/2013",
    "text": "I think How Lee is better, because Sichuan gourmet has changed its chief cook. I really hope that guy could be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o3kEb-gcCwFF55jSwz4bHQ"
  },
  "8WgST-aaWz0apI5EtmbAhg": {
    "date": "6/26/2012",
    "text": "Most of you guys know that I'm a How Lee devotee, but upon the insistence of Jarrett H, I finally tried China Star (now known as Sichuan Gourmet).  Jarrett-- thank you!! The food here is fresh and delicious, and they use less oil than How Lee. Now, don't get me wrong, I still heart How Lee, but it's nice to be able to mix it up a little bit. I've had the frogs legs & multiple noodle dishes: all good. I'm not a fan of some offerings (dumplings, spring roll, and crab rangoon), and ordering over the phone can be exacerbating. I've also had to convince them that, despite being white, I'm OK with bone-in meat, spice and \"weird\" meats. Once convinced, the employees seem to be genuinely enthusiastic  that I'm trying more traditional Chinese dishes. (Ethnic food places not believing me about spice level and meat choice is another topic and tangent I shall not engage here.)    All in all, though, I'm happy to have another delicious Chinese restaurant in my rotation, and can't wait to actually dine in there rather than carryout or delivery.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7FAWEeRGS1IqKDjrY7uwaA"
  },
  "13DoTawkBmaLBFGk75Bo4w": {
    "date": "8/20/2015",
    "text": "It tastes really authentic.  Love a lot of dishes here.  Not as spicy though, but good to hang out with American friend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "naVOcrMz7sqvqEXqIyh7XA"
  },
  "p6BsqGu8j0lke79tVMEdKQ": {
    "date": "4/5/2013",
    "text": "Disappointed every time. It's not spicy at all and some dishes are even sweet! And it's slow and expensive as well, compared to other Chinese restaurants. Extremely hate the way they deal with chickens, they just don't know how to cut the meat and bones right!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WG7sLzukaJydOcU5DrzBuA"
  },
  "xPen-DcxtjI6rJnl4YQuyg": {
    "date": "10/8/2015",
    "text": "Best place in Pittsburgh to get authentic Sichuan Cuisine. The Mao's Braised Pork Belly melts in your mouth. You will not leave here hungry.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V_WiqaF5pSgFks9spjNcoA"
  },
  "ylhaU-dgoYMzasLAzp1_-Q": {
    "date": "6/28/2015",
    "text": "Awesome authentic Sichuan food, will definitely come again! The is amazing, I order this every time I came! Good service too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2l2n-Eiq8pgtHL9zjHEXQ"
  },
  "uXus3oc73HYOphA0GEZtUg": {
    "date": "9/12/2015",
    "text": "Ordered through eat street, took one hour for delivery. Three entrees and appetizer platter arrived with no duck sauce or Chinese mustard and one fortune cookie. Food was poor to mediocre, save your $$, plenty or other options for Asian food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lEJFc7JYHbz8nRTGlrVwCA"
  },
  "EzqLENXn5wo2hUkyKteWRw": {
    "date": "3/22/2015",
    "text": "Overall OK experience. The dumplings and noodles are Okay, but they had too much garlic. The rabbit meat is not very  good. The meat must have been frozen for a long time, because the texture is not tender at all. By the way, the rabbit is a staple food in my home town, so I know what a good rabbit dish taste like. I tried Jade grille and this place, and I think that I would go jade grill more often.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3iFV_XoufX2i1iPpNNvKNQ"
  },
  "uvMuu5BUnwke_0OZgZLD8g": {
    "date": "5/23/2015",
    "text": "I have eaten here for many times. The foods are very good. Tastes like eating in China! Services are good, too. I have taken my friends here many times when they visit me. I will difinitely recommand this to my frind if they come to Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DH6b6FYrbc-MeQVb16-IIA"
  },
  "UrOq0zldeqHcRR4azsMBEg": {
    "date": "10/4/2014",
    "text": "I have been here twice now. Unless you are familiar with Chinese food it's a bit difficult to know what to get. The dishes are large and tasty but definitely expensive for Chinese food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "noWOT_l5Vv1lCwKfdyVRfA"
  },
  "zj8F4rrpsgKjdh_5rh7pvQ": {
    "date": "5/15/2015",
    "text": "It's a great restaurant. The pork intestine with hot pepper in flaming pan and grilled whole fish with special flavor are super fantastic!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "usw2SAY-8kZ1lW-2KYea5Q"
  },
  "yJ5QFzKGE-jkQknM5Wl-3g": {
    "date": "8/8/2015",
    "text": "Real Chinese! It has the essence of Sichuan food -- spicy, which is not quite easy to look for in the US.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "otyznVnPHluDhZ_EtxFJHw"
  },
  "B6tbUDOdob35M5ipwFg8Rg": {
    "date": "7/14/2015",
    "text": "Good Chinese food.  We got fried rice, egg rolls and Kung pao chicken.  Enjoyed all.  Never been to China so I cannot comment on authenticity.  1 dinner entree MORE than enough for two with rice.  Close and convenient online ordering for pickup or delivery.  We will probably be back (still have more places to try!)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CxjCv1jySKqwvMTeH8gX-Q"
  },
  "2BlGlOnmX0cMBf51cEQVQA": {
    "date": "11/22/2015",
    "text": "Chinese menu is quite good, especially the Chongqing Style Fish Fillet in Spicy Broth.  What gets this establishment a one star is its abysmal service.  I place an order on the phone for Pork in Sweet Flour Paste.  I repeat the order about five times since it's not a popular item.  I even have the girl repeat the menu after me.  The girl suggests chicken is better with that sauce so I go with that.  Now when I get home I find she packed me sweet and sour chicken.  I abhor this stuff.  So I call and tell the girl that she packed me the wrong thing.  The girl tells me: \"Sweet and sour chicken is also good so just eat that.\"  Okay.. I try one piece and find out it is the same abhorrent stuff.  So I take it back to them driving all the way back to Murray Ave and tell her I cannot eat this.  Now the girl tells me: \"Pork in Sweet Flour Paste is not on the menu and maybe you looked at the menu of some other Chinese restaurant.\"  So I show her the item from their own menu.  Now the girl tells me: \"Oh you know what, Chicken in Sweet Flour Paste and Sweet and Sour Chicken are the same thing.\"  I know for a fact that they are different.  One is 12.99, the other is 11.99.  One is on the Chinese menu, the other is on the American menu.  I point this out to her.  Now the girl tells me: \"Did you eat it?\".  I tell her I ate just one piece (as mentioned above).  She gives me this dirty look as if I'm some moocher trying to return consumed food.  I hold down my anger.  She finally calls someone on the phone and reluctantly hands me the price of the item in cash.  She was evidently looking for an excuse to flick me off from the beginning, like I'm some annoyance.  Why?  Because I am not Chinese like most of the clientele?  Shame.. shame.. I cannot comprehend why management would choose to run this otherwise upstanding establishment in this way.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-UO978GjBK6wz0qZOtfwsw"
  },
  "C4-P1m9cTjL21GxsfTfKaA": {
    "date": "11/17/2013",
    "text": "we used to really like this place, but I went there recently with a large party, and whoo-hoo.  the only bad dish we could have called, something like tofu with bland sauce, for an unadventursome vegetarian in our group.  the rest of the 8 or so dishes were good, spicy or flavorful, and did not seem salty or too greasy.  we would go back, but we don't get in the area much these days.   the honey walnut shrimp was a surprise, but ok.  it was a surprise in that the sauce was dark and not light like we have had elsewhere. they take reservations.  parking is best around behind them in a lot.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "U6wBHCCbf-qtyeM3spjmVg"
  },
  "k6LLSnLN3gJYRUYOuBLEqg": {
    "date": "9/19/2014",
    "text": "I did not enjoy my meal here very much. Perhaps I should have tried something off the \"authentic\" menu but I just wanted a simple American style Hunan chicken. The dish was slathered in way too much sauce and it was too sugary and not salty/spicy enough. The hot and sour soup was delicious though. I would give it another try but first I am going to explore some other Chinese options in Pittsburgh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IjNOwI028HYJ9deeeFkXqQ"
  },
  "BrJVAGdSQ1TdWfz1KtgUvw": {
    "date": "11/27/2013",
    "text": "Great food, although a bit oily. They were super nice and kept the kitchen open a bit late for us. Also they let us use our Yelp deal. Keep it up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "eGDbvS1rRlnr2UFjrk7fdQ"
  },
  "8Xc1Mz4CS87D9meTgnV0pA": {
    "date": "2/7/2014",
    "text": "Absolutely delicious!!!  Honestly, the best I've ever had, and so authentic.  Everything we had was absolutely amazing.  (Veggie lettuce wraps, bo-bo rabbit, black pepper fish filet, and beer flavored flaming duck).  We will definitely be back, this place is the real deal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "X8-qM_qOyq7TgMt4cHijLw"
  },
  "va_hDji1hDGucm6_VAlOwQ": {
    "date": "12/18/2011",
    "text": "Mediocre Chinese food. The quality of food was not so good. The service was even worse. The bill was not calculated correctly. And the waiter was not there when we need him. Perhaps that was because of a busy Friday...  Overall, I would like to recommend other Chinese restaurant on Murray, such as Rose Tea or Ka Mei.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xR6eAQXZ_5iojP524oohGg"
  },
  "Lo8iBUqgMNZScloiBSes-w": {
    "date": "6/21/2011",
    "text": "If you want to enjoy your time here, be sure to ask for the Chinese menu! Apparently the restaurant has two types of menu: the regular menu where you'll find the standard, non-spicy dishes, and the Chinese menu where you can order from a huge selection of authentic Chinese dishes!   Pros: spacious, great for a large group dining, quick service, tasty food. The price is great for the quality of food you get. Beware that when they say spicy, they really mean it!  Cons: the menu is a little disorganized, so be sure to specify clearly what you want instead of mentioning the numbers only.   Our favorite dishes: Congqing chicken, eggplant in garlic sauce, fish fillet in red pepper.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5wqv5IY-GQwQtGWfQDCh9w"
  },
  "8_wBAYEbLl_xf81APF54MA": {
    "date": "1/13/2012",
    "text": "4 1/2 is what I should give.  Oh so spicy, oh so good. The mushroom flaming pan is probably one of the tastiest vegetarian dishes I've had, period.  The flaming pan dishes are good, especially the fish (the mushrooms in that, oh so tasty)  Service can sometimes take some time, but there are days when they are quick too. I did a take out order yesterday and that probably took a total of 10 mins.  Tried duck tongue, probably won't try it again. Wasn't very fond of it.  Anyway, the place is a must go, especially if you enjoy mouth burning spicy food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KN1MNPLVPUGsfaOssJQggg"
  },
  "rz6j9wPc6VS7a3zh6ELiYw": {
    "date": "4/3/2016",
    "text": "Real spicy, really good. I've liked everything I've had there, Maos pork belly, chengdu Kung pao, Dan Dan noodles, cumin lamb. All good, this is my sole sit down Chinese joint by a long shot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x3ei6Z5sNoMP1Qg74_arpA"
  },
  "ye5fHdzSdmWNwE1C8iDf1g": {
    "date": "2/3/2013",
    "text": "Very disappointed. American Chinese food, not authentic at all. Also I am not sure why one of the dishes had some really weird smell , not fresh....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "dNEN_Dl4iOu-opFkS4B9Cg"
  },
  "SHKPVkUKf4JjnsrhhSVJUw": {
    "date": "1/11/2015",
    "text": "I ordered take-out from this restaurant for the first time tonight, based on the good reviews on this website. I will not do so again. It took almost 2 hours and four separate calls for our food to arrive. More than $50.00 and a ruined evening later, the food finally came. IT WAS COLD AND GELATINOUS.  I want my money back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "bdN9jtK8HN0iI3VdyVP-Qw"
  },
  "6gbAlE8Jc2LriJsNShrgxw": {
    "date": "11/17/2011",
    "text": "Let me first start off by saying I'm so elated I found this place.  If you've seen my other reviews, it can be most notably recognized that I don't have a deep affinity for Asian cuisine in Pittsburgh.  Actually that's being nice...Asian food here pretty much sucks. Meh.  That being said, China Star might be my favorite option for Chinese food if I'm clamoring for flavors that I'm very much acquainted with.  Some of it is greasy, but that's to be expected with ALL Chinese food, good or bad.  I'm ok with that.  It's the flavors and options that pulled me in and keep me coming back.  Went here with Jhon a couple of times now.  We've tried everything from the tea smoked duck, spinach and tofu soup, the spicy beef noodle soup, braised pork belly, stir fried chinese broccoli, spicy fish in the hot broth, chinese water spinach, spicy chicken in flaming pan, spicy frog in flaming pan, beef tendon, wontons in hot oil, etc.  Yes, we like to eat.  Don't judge.  The tea smoked duck is a MUST.  The smoky flavors that they were able to infuse in the duck, paired with it's naturally supple and fatty texture, give way to a super juicy and flavorful meat.  It doesn't need anything, standing alone as the star of the show.  The best part is the crispy skin.  Nothing is better than crispy skin, esp on a duck or pig.  Mmmmm...   Other things I've reeaally enjoyed are the spinach and tofu soup and the spicy frog in flaming pan.  The soup is very light, brothy, and comforting.  It doesn't bog you down, but I found it to be quite refreshing and fresh.  I could imagine feeling loads better if I ate this while sick.  The spicy frog probably isn't for those who aren't so adventurous.  I personally love frog and have ordered every time I see it on a menu after extensively eating it in Vietnam.  The meat was succulent and flavorful, bathed in a sauce with tons of dried red chilies (like most spicy sichuan food), onions, garlic, and bamboo shoots.  I seriously couldn't stop eating it.  I even ate the chilies and bamboo shoots.  SO. GOOD.  Jhon particularly enjoys the duck like I do, but he also loves the spicy beef noodle soup.  We're both suckers for noodles.  I seriously love noodles.  The noodle soup has great flavors, has a good spicy kick, the beef is super tender like it's been braised for a while.  The only real deterrent is that I find it greasy.  I know I said I don't mind greasiness with Chinese food as it's pretty much expected, but the one exception in my mind is soup.  Who wants to slurp on oily soup?  Not this girl.  Kind of reminded me of food I had in China.  Still really great flavors.  Just don't drink all of the soup.  This is definitely on my list of favorite Pittsburgh restaurants to frequent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lLZjqoBQG8dY7qDXOXfILg"
  },
  "nhQHVpYha-FOtxOVbU1JdQ": {
    "date": "4/5/2015",
    "text": "Never again. Bad service, bad food quality. We ordered bunch of vegetarian dishes and had asked our server to make sure there is no meat in anything we ordered. He assured to us that everything we ordered is vegetarian and  he will notify the Kitchen to confirm. When we got our food, 3 out of 5 dishes had meat. When we called our server, his reply was the dishes are vegetarian while I am showing him bunch of pieces of meat separated from the dish. He took the dishes back without being sorry. When we got the food back, it was so bad that it was not even worth putting on the table. The restaurant was so short staffed that our server only stopped by at our table 3 times (to take order, to bring food and to bring the check). Went here based on many good reviews here on yelp but that wasn't the experience we had today.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bdH04DlzWxtOxdQgStMQRw"
  },
  "UcWxtc9GB4oUDbnnGvYhqw": {
    "date": "8/20/2013",
    "text": "This is probably one of the best chinese place in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-2PdIBswnFgj5SQhdjHkrA"
  },
  "TxVR8C8nhhYw94H2MYWYGA": {
    "date": "5/28/2011",
    "text": "Recently, Pacific Ring up at Squirrel Hill got replaced by China Star, which is now a Si Chuan restaurant. I will say that I am extremely biased because I love Si Chuan food, so that's that. The restaurant is also newly renovated, and I think the interior design looks a lot less gloomier compared to before. Anyway, we ended up ordering  (Cold Beef Brisket and tripe),  (Stir fried spicy chicken),  (Fish in hot oil), and  (Squash and mushrooms).  The dishes turned out to be amazing, although somewhat salty. They were definitely generous on the spices, and I thought they tasted pretty authentic. I feel like this is a restaurant that I would go to regularly with my family in Taiwan, and that says a lot. It could be spicier though... I've definitely had spicier Si Chuan food, but I think it was enough for the people I was eating it with. I have yet to find another Chinese restaurant in Pittsburgh to offer the squash (in the last dish) so I was really excited. I think the meal was amazing and I would definitely go back again, even if the prices are all $10+.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "w_20Zu_jREwBpDpILfQMng"
  },
  "2drHONJJZ8bk9qRH_wFiMQ": {
    "date": "1/20/2016",
    "text": "I ordered from them and it LITERALLY 2 hours and 8 minutes to get.  I ordered one chicken entree and an app no substitutions. When it got here the entree tasted like someone sprayed a cleaner in it.  I've never had that happen, hoping I make it through the night",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PXo_qKGQHrnyitIt85i3LA"
  },
  "eUsBjScdG4pv6Gn9xT818Q": {
    "date": "5/15/2014",
    "text": "We just had a terrible takeout from this restaurant brown rice was mushy. The lamb tasted old and the shrimp with garlic sauce was swimming in oil. It is the last time for me! Really bad Julian",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RM8bXK_wKdGNpt40mmVc1Q"
  },
  "zpxRkD6UpH7UaOlFm5LyqQ": {
    "date": "1/16/2016",
    "text": "This is a transitional Sichuan food. If you like spicy, this is the right place. We ordered duck, fish and some vege, all of them taste good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UtL3XeEGQddOKA48gVQDHA"
  },
  "7m5r48ktbb1kdyik0Ogzkg": {
    "date": "9/23/2012",
    "text": "Food: When you're seated at Sichuan, you're given two menus.  We weren't told the difference between them, but after asking, our waiter explained that one is \"American Chinese\" and the other is \"authentic Chinese.\"  This isn't written on either menu, so if you want to know the difference, ask.  Both menus are expansive and have similar items, and we ordered exclusively from the \"authentic Chinese\" menu.  There are countless appetizers, soups, common and uncommon varieties of meats and seafood, and vegetarian options.  We started with the Spring roll, which was more like a vegetarian egg roll with a fried crispy shell.  It wasn't bad, but very average, although it did come with a lot sauce for dipping.  We also ordered the Sichuan pickled vegetables, which didn't taste very pickled, but were spicy and tasty.  The portion was large, but they were extremely salty leaving us thirsty and needing water (which became a problem, see below).  We asked the waiter to recommend specific vegetarian items; we ordered one of his recommendations and experimented with another.  His recommendation was the baby bok choy and black mushrooms, which was exactly that with a subtle sauce and rice.  I asked for the meal to be made spicy (it wasn't listed as spicy), and the waiter offered mild, medium, or hot.  I chose medium, and the dish was somewhat spicy, but the sauce was fairly bland and a plate full of bok choy and mushrooms gets old fast.  We also ordered the Chinese eggplant, and requested tofu to be added, which carried an additional $3 charge.  The eggplant dish was considerably more tasty than the other, but without the tofu, it may have been similarly boring.  Nothing we ordered was bad, but the best dish was only slightly above average.  The menu may be better suited to adventurous carnivores due to the plethora of options, or someone craving authentic Chinese food.  Price: The prices are very reasonable, as our bill came to just over $30 for two appetizers and two entrees (even with the $3 tofu tax).  Appetizers range from $5-10 with entrees ranging from $8-25 and averaging around $14-15 (vegetarian entrees cheaper, as always).  They offer discounts to Pitt and CMU students and a 5% discount to all customers that pay with cash.  Drinks: Sichuan Gourmet does not have a bar, and there was no mention of BYOB.  We didn't see anyone drinking alcohol.  Atmosphere: The dining room is large with tables of all sizes and large windows facing Murray Ave.  The restaurant was packed while we were there on an early Friday evening, and it gets relatively loud as the tables are close together.  They are open relatively late, so if you leave the Squirrel Hill bars or the Manor before too late, you'll be able to get some affordable Chinese food as a nightcap.  Service: We were seated after a brief wait and our waiter provided menus and water immediately.  Unfortunately, it was the final time we would receive water the entire dinner.  He never replaced the water without prompting, and even after we asked (multiple times), we had empty cups and nothing to quench our thirst after eating salty, spicy food.  The waiter answered our menu questions to some extent, but the host, waiter, and another employee had a very difficult time understanding our English, and we had trouble understanding them.  We waited 20 minutes, yes, 20 minutes, after finishing our meal before the waiter came back to clear our table and deliver the check.  This may be an isolated incident, or a problem due to new staff with the change from China Star, but other tables seemed to be having a similar issue.  (+): authentic Chinese food, fair prices  (-): poor service, average food  Would I go back again? Maybe once they work out the kinks and improve their service, but only if someone could recommend a specific dish to try.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZpTrjeZQ4c_9YA018SXnwA"
  },
  "ubGTE0XNbFakVMd5MV_Umg": {
    "date": "11/30/2015",
    "text": "Food is awesome. I don't come here often because sometimes I dread that the waitresses speak to me in Mandarin and I have to explain to them that I can speak Cantonese only and they would look at me like \"what's wrong with you?\" Haha, but that's my problem that I have never learned to speak Mandarin and this issue should not apply to most patrons here. Service is hit or miss just like many Chinese restaurants. It is slightly more expensive than it should be but there is not much competition in Pittsburgh. Overall, a pretty good place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mdm0j0rpqR9-7kqG1Ltlxg"
  },
  "tvDShXYaowwFDC0laETcQg": {
    "date": "9/21/2011",
    "text": "Delicious. I've come here three times now, and had relatively good  results each time foodwise. Out of the dishes I suggest- Beef noodle soup (huge servings, also spicy despite its 'nonspicy' label), Garlic Eggplant, and Honey BBQ Ribs. Make sure you're ordering off the Chinese/Sichuan menu and not the Americanised one.   My one issue (other than the fact that almost everything is spicy and their spicy label LIES) is the customer service was horrible the last time I went. It's strange, because the first few times was marked by amazing waitresses, and maybe I just caught one on a bad day. Also, the seafood noodle soup she brought me tasted not nearly as great as the other dishes here.   Warning: Unless you're like me and addicted to any and all tangcu spareribs, avoid theirs. Tasted like it might have been refried beforehand- slightly dry and stringy, lots of fat on certain parts. The sauce was droolworthy though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BKMP5NtMa-VqP_lnWjbOYw"
  },
  "HhZ6F8BwUOaadw4HAXQ8Pg": {
    "date": "8/15/2013",
    "text": "The food's not too bad. I ordered a seafood and tofu soup and it basically was a white egg drop soup with imitation crab, little pieces of scallion, and vegetables I assume were once in a frozen bag. Not sure what style of Sichuan food this is, but I guess I should go in knowing a little more about what to order next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ft0-KUGvYJOD-jXgQFypHA"
  },
  "KvWr81tH-2kgtKq6B886hA": {
    "date": "12/25/2012",
    "text": "Meh -- tried the supposed best that Pittsburgh had to offer in Chinese and was disappointed. Mediocre noodle dishes -- the zha jia mien used noodles that were lacking in firmness. Other dishes I had were on the extremes of either being too salty or too flat and tasteless.   Also, weird tasting water.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NDQF0lZo35HBXEPq2FxzBg"
  },
  "LCj7cww2yDdVqEq6EZLDNw": {
    "date": "8/17/2013",
    "text": "We are from the Washington DC area--not a hot spot for Chinese unfortunately--but were very happy with our meal here.  The Braised Pork Shoulder in Mild Spices* was absolutely awesome, tangy and wonderfully fatty.  The ma la pepper-spiced cold bamboo shoots salad was spicy and delicious as well.  The ma la or Sichuan peppercorn (which is really another plant and not a True peppercorn) has that very unusual spicy and numbing that I vacilate from liking and not liking, but ultimately think that anyone who likes spicy, hot food should try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z17MIik571O34ZFL6Za6rA"
  },
  "VYQsvGDhmVRwVPLQSk_MAg": {
    "date": "1/12/2015",
    "text": "Ordered takeout with groupon. I loved the mapo tofu - the spices were really well balanced and they give you a hefty amount. But, I wish that they used more pork. I also got the green beans which were a bit overcooked and a bit too greasy. I also thought that the entrees were pricey. I'd definitely go back to try more dishes, but only with another groupon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HAbASizzsq-Z26CbdTpbpQ"
  },
  "653pvB-8X1KQduyy_pTKCA": {
    "date": "11/16/2015",
    "text": "There are many choices on the menu, and we ordered the dumplings in chili oil, which were good, the beef noodle soup, and the honey walnut chicken. The noodles were bland, and the honey walnut chicken was not hot when it came out, and it wasn't really different from regular chinese takeout from cheaper places (although the chicken had a lot less fried breading as cheaper places, which is good). For the quality, this restaurant was overpriced, and we most likely won't go back. We also had to end up asking a waitress for our check, because our waitress pretty much forgot about our existence.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LKK3BGOSfU1kgHnmstwVbA"
  },
  "O8n5bMyuL0JgUQhJSdymtw": {
    "date": "5/1/2019",
    "text": "This is the best Sichuan food in Pittsburgh. Literally every dish you order form the authentic menu tastes amazing (I haven't tried anything from their American-Chinese menu). If you want an authentic Sichuan experience, you should come here and order from their authentic menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQKwLDRY7YvsryOTeeqUNA"
  },
  "zEfXOwvXHLYifMIUbsO9gg": {
    "date": "4/7/2019",
    "text": "it is an authentic Chinese Sichuan style restaurant .but the flavor and quality are just ok for me(where I came from chongqing) . They don't give you enough portions of food as the price. I will not go back again, there are better choices.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0y2zeh1OQDf3LhwhgG2q0Q",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0y2zeh1OQDf3LhwhgG2q0Q/o.jpg"
      },
      {
        "img_id": "0LBtf7Rjaj1yPHeOdopBjQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0LBtf7Rjaj1yPHeOdopBjQ/o.jpg"
      }
    ],
    "user_id": "IZL1aGb-dqHe0dzV1S8B8A"
  },
  "djDZEPDvRH3tWG4XITeiWw": {
    "date": "1/1/2018",
    "text": "This location is WAY better than the one in Oakland. The place was nicely decorated and felt elegant. The place was packed when we came here for dinner. Although the food is a bit pricier than Chinese restaurants around, it's worth it. We got soup and two main dishes. The food is pretty good and comes out quick! Definitely recommend looking at the pictures to order if you don't know what you want.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gmCK2ARSx22S_4_RQF9Jwg"
  },
  "Rd4cYcJJtFQnkebqai_v6w": {
    "date": "6/20/2018",
    "text": "At the time of writing this I drive Uber full time in Pittsburgh and without exception all my Chinese passengers feel that this restaurant best represents the cuisine of their homeland in China. Along with Sheng do gourmet, also in Squirrel Hill. I  Have eaten at both and have found that they both are very oily for my preference, but certainly do offer more authentic Chinese options. Overall, I recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hgr2OiZkniHGq4tSQ8-3MA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hgr2OiZkniHGq4tSQ8-3MA/o.jpg"
      },
      {
        "img_id": "q-Is11gmSNU70y69ik1ELQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/q-Is11gmSNU70y69ik1ELQ/o.jpg"
      },
      {
        "img_id": "xCokX2CLlbl3XQv2zi6V5Q",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xCokX2CLlbl3XQv2zi6V5Q/o.jpg"
      }
    ],
    "user_id": "Y0Rl4Wu-oUV86Ov8hLqiSA"
  },
  "NbbOc44fqSaCtb7f3HgKCQ": {
    "date": "6/12/2018",
    "text": "Although I have only been in Pittsburgh for a year, this seems to me like the best Chinese food in the city. I have eaten there several times and each time the staff were very attentive and the restaurant was very clean. The menu is absolutely massive, so much so that it can be a little daunting to decide what to order. I usually get a beef dish or something with mushrooms, as the quality of the ingredients in these have been fantastic. The only gripe I would have is it is a tad overpriced for the food, but hey, I might just not be ordering the right thing, there's over a hundred options after all.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RnkKHzIl3LVee_Q6zooQMQ"
  },
  "7YFZZAnXPhMbeaZjZvUgmA": {
    "date": "1/2/2019",
    "text": "Very good! I understand the same folks who ran China Star in the North Hills run Sichuan Gourmet. That's fine with me, I liked China Star too, as did the China delegation for the G8 Summit a few years ago. Sichuan Gourmet is best compared to Chengdu gourmet, down a couple blocks and hang a left. Both are excellent. Overall I'd have to say that Chengdu Gourmet is slightly better food overall, but not as nice a setting or location. But  you can certainly have a wonderful dinner at either. The mapo tofu is quite a bit better at Chengdu, so if you're a big fan, that might be a deal breaker. But Sichuan Gourmet does a great job overall not only with most of the genuine Sichuan dishes such as the Chungking Chicken, but also with the semi-Americanized favorites including pot stickers and beef ho fun. In all fairness, these really shouldn't be listed on the American menu as I've had pretty much the same dishes in Northern China. Frankly, I don't always want \"authentic Sichuan dishes with 1/2 lb of red chili pepper in them,\" so it was nice to be able to mix it up and not have the milder dishes be bland. The smokiness of the Ho Fun that comes with proper wok technique was exquisite. I'll be back, there are 35 or so more dishes I'm eager to try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "989O-qZsZvVKt4Ue9Rm2rQ"
  },
  "klL9M1VWSOLlyDupwph7ow": {
    "date": "2/10/2019",
    "text": "I went to the Chinese restaurant I order in for takeout January 16th when I receive my food I noticed my shrimp fried rice was in a small portion which I paid for a full portion the chicken and broccoli did not have carrots just supposed to be a stir fry no sauce terrible and when I ordered wonton soup it was dark no pork slice not enough meat inside an egg roll was burnt I will never ever go there ever again it also will tell my friends so please do not go you pay all that money for worthless food I haven't been at this restaurant over 20 years ago it was excellent there but now they won't get my money how do you know you",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fBoTCSU9VPeMrpR7zVbE1w"
  },
  "oUJS4_D06yMR3SxGq2RYfQ": {
    "date": "2/10/2019",
    "text": "Been living in Pittsburgh for 4 years and this is the WORST dining experience. We waited 30 minutes for our second entree. When customers who came later than us get a table of food, we were still waiting. Waitress didn't refill our water, no apology, no nothing. Their rude, indifferent, poker-faced manager did come to talk with us after we complained to the waitress, but honestly, we would never visit this restaurant again. The food is mediocre--not as good as northeast cafe or rose tea cafe or everyday noodles which are just 5 mins walk away, service is bad & when the waitress came to our table, an icy wind did blow to our face; when the waitress screwed things up, she didn't apologize to us at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZL-uVqAMRezpewJxUbMm5A"
  },
  "Q2f4JfsTuSzd17nb9TJ_Xw": {
    "date": "10/11/2018",
    "text": "This was an actual authentic Sichuan restaurant. We have been there twice already and we always try a new vegetable and a new dish. We always keep the beef noodles for the kids, which btw are awesome. They have this smokiness to them, they're delicious! We've tried the mapo tofu and and the pork belly and the eggplant and the baby bok choy.  It has never disappointed. This is going to be our regular restaurant.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "v6Kvo2gLp6iYjhGci6FcmQ"
  },
  "yCCPsP9RBEPNnHoR0g2WwQ": {
    "date": "12/29/2018",
    "text": "Ok, ok, ok... So we ordered delivery on Christmas Eve, so I gave an extra star, because... Baby Jesus. But this was the most disgusting delivery food we've had in a long time. Vegetables were boiled down - which could explain why the containers were HALF FULL. Mostly luke warm at best. Spring rolls were 90% dough. General Tso's was soggy (I'll chalk that up to delivery, but have had somewhat decent breading from other places on delivery...) I'll just stop there, 'cause it's not worth my time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i79grgTjhFxqaQs9jcZKPA"
  },
  "HF7a2Q6T4BXmOFIjf4vhIA": {
    "date": "5/5/2019",
    "text": "I've always had good experiences here. The food is good, the service is quick, and the portions are giant. I especially love the basil chicken! This is my go-to place for Chinese food in Squirrel Hill. Not the best I've ever had, but definitely doesn't disappoint.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W49lhvy670kVBUxRJ8KjOQ"
  },
  "UZcA3EsbRWpKe_ha5WBIVg": {
    "date": "12/25/2018",
    "text": "The food was average. Service was bad. Servers themselves don't know the ingredients in the dishes. They kept us waiting for 10 minutes to take the order, and brought the wrong dish- we realized it when the bill arrived. Being non-Chinese we did not realize that we're served the wrong dish. Even the bill wasn't presented to us in the way they were on other tables - no oranges for us :P",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qSRlJgu9-J4siNIRs1HXlw"
  },
  "mFeeCo0kxvWZ6FUQuZMUcg": {
    "date": "8/20/2018",
    "text": "The Mao Pao Tofu and Chengdou spicy chicken are a must! We will be back again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "za6HQo4LruludypOMb1FBw"
  },
  "3S8gawylaNeYmPMOwHDoHA": {
    "date": "9/15/2018",
    "text": "Disgusting food!!! Screwed up on my order twice!!! Both times they put peanut butter on my cold noodles even though I ordered the one without peanut butter! Completely disgusting! Most of their food tastes like crap except for one dish. Overpriced scam serving fake chinese food. Bad service too! The delivery guy wouldn't give us the food unless we tipped, which is not supposed to be forced. Can't say anything good about this place!!! Don't go!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zcj2B3_rAi-zr8PN9teJ2A"
  },
  "tvN-SYAWGSjqbCEcxQ4gKA": {
    "date": "4/22/2018",
    "text": "I frequent Sichuan Gourmet quite often for the lunch specials at both the Atwood and Squirrel location, and am usually quite satisfied with both the quality and portion size of the food.   However, I brought a large group of my friends over a few days ago and we experienced horrendously slow service. We ordered around 15 dishes for around 15 people and it took 10 minutes per dish to come out. The table next to us had the same number of people, ordered after us, and got all their dishes meaningfully faster than us. I would have to assume that their kitchen and/or communication is not equipped to handle large numbers of people.  TLDR: Lunch specials are good but do not recommend large numbers of people.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UWkIQdrtzVRQavGjbWdfTQ"
  },
  "MDjNaGI8hfW9duWx1iQw_w": {
    "date": "7/11/2017",
    "text": "Ambiance: Nice spacious restaurant decorated with a mix of old-world and asian influences. It was good sign all the servers spoke mandarin and 80% of the customers were asians. The place was half-full when we came and it wasn't too noisy. Staff was slightly on the slower side but not egregiously so, just some 3-5 minute waits to order, water refills, check, etc but consistently so.  Food: We got the beef in spicy sauce in sichuan style and kung-pao chicken and both were quite delicious. The meat in both dishes was tender, well-sauced, and the vegetables were cooked to that perfect balance between softened and still slightly-crunchy. The dishes were savory and not too salty but I found the heat a little lacking. The dishes looked intimidating consider the volume of chinese (tsin tsin) red peppers they use but they are actually fairly mild. Along with the sichuan peppercorns, the dishes tend to have a more numbing tongue-buzzing effect than really imparting any True heat (think mild-moderate jalapeno in terms of heat).  Overall, Sichuan Gourmet is the real deal. They've dialed down their heat for the american audience but their flavors are otherwise quite authentic. The entrees are on the expensive side ($13-15) but they're served family style and 2 dishes is enough to feed 3 people. I'd definitely give this place a shot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yyGp1_3i_zhfpBVIY4Xaww"
  },
  "igomGbQDYSTKXoERu6yRtw": {
    "date": "2/21/2017",
    "text": "Sichuan Gourmet is actually the best Sichuan food I've had in America. It's authentic, a reasonable price, and I love going back here again and again. I'm pretty salty that they don't have this place in the Bay Area!  Squirrel Hill is the original location (it has since expanded to Oakland). It's much larger and has \"private\" rooms for large groups or parties, which my organization has used every single year. The servers are polite and the food is generally timely, even when ordered in large quantities.   I've tried a lot of dishes here, and my personal faves are:   Appetizer: Fuqi Feipian (Sliced Beef Trip in Chili Oil), Dan Dan Mian (Noodles w/ minced Pork) Entrees: Steamed Pork Belly w/ Taro, (Chong Qing La Zi Ji), Spicy Crispy Chicken w/ Chili Peppers, Huiguo Rou (doubled cooked Pork Belly) Vegetables: Kong Xin Cai (seasonal)  Every time I come back to Pittsburgh, I'll be sure to come back to this restaurant. Go try it out if you love spicy food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "nj4PFafiPqA1PFj63rR9yg"
  },
  "mzukRyaIlGw0TkvEtMamiA": {
    "date": "3/26/2017",
    "text": "It's been more than an hour since we ordered our dinner (two entrees for $30, not including tip) ASAP, and the food has yet to arrive. When hubby called to check on its progress, the person who answered the phone didn't even ask for the order but automatically assured him \"The driver is on his way.\" I should have known that delivery for $1 was too good to be True. I'll come back to update this review with our opinions of the food if we ever get to eat any of it.  Nevertheless, we'll find another Chinese take-out restaurant to patronize.  Update: Food took 1 hour 20 minutes to arrive. It was mostly warm. The chicken with basil and quick-fried Chinese broccoli were good. We particularly liked the fried rice. Better to eat-in or get take-out than delivery from Sichuan Gourmet.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ogYJ0jztqMrxAhhslQnzg"
  },
  "GE2FYJOuHW8ILHA88_Lz7w": {
    "date": "2/2/2017",
    "text": "A few days ago I saw a picture of their Pork Belly from a friend's instagram picture. Ever since, I've gone through their Yelp Reviews/pictures numerous times and been trying to find an excuse to come to this side of the town. We finally made it a point to stop here for dinner yesterday since I already had some work in Shadyside.  For a weeknight the place was pretty busy and diverse. Despite the chinese fast food appearance from outside, the inside was neatly decorated with a mix of industrial design and asian decor. There's also some private rooms for larger groups.  The menu has 2 main parts Traditional and American Chinese. The American Chinese Menu consists of General Tso, Lo Mein etc. the usual suspect. However, the Traditional Menu has all sort of stuffs that you probably may/may not have heard/seen before and is a bit overwhelming to go through the list at first.  We went with the Chinese Menu and ordered the Mao's Pork Belly (as first seen on my friend's IG), Chengdu Chicken and Tofu with Egg Plant. As an appetizer, we got the Egg Drop Soup and Crab Rangoon. The Egg Drop Soup was better than your normal chinese restaurant - however, the crab rangoon although really good was very oily.  The Pork Belly ... the only reason I've been craving come here.. was bit of a disappointment. It was just okay.. not as good as I was expecting. However, the Chengdu Chicken and Tofu were both really good. FYI: The chendu Chicken is a dry dish (to give you an example: Chicken Nuggets mixed with a whole lot of dry red chillies) not something ideal to eat with rice. So, make sure to get something else too.  Overall, the food was good. The service was a bit slow but the older grand ma lady (serving water) was very friendly, attentive and quick at getting us water and tea although she hardly spoke english.  I would definitely come back again and give another dish a try from the chinese Menu. Also, it's a BYOB.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "zPAvq2_TfoZHFNdM_UCb-Q",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Tofu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zPAvq2_TfoZHFNdM_UCb-Q/o.jpg"
      },
      {
        "img_id": "4rNeutJhXx5fwVHrBXcsvQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4rNeutJhXx5fwVHrBXcsvQ/o.jpg"
      },
      {
        "img_id": "l6HVnvmI6ZCEsBVoic5SwA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Pork belly",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/l6HVnvmI6ZCEsBVoic5SwA/o.jpg"
      }
    ],
    "user_id": "fBO-AauqOjPX2UBp9RgeQQ"
  },
  "YnZt4jRmB93kxtoP8heB4g": {
    "date": "5/17/2017",
    "text": "Sichuan Gourmet attempts to recreate authentic Sichuan cuisine with its classic and diverse menu. You can get any meat here, from fish, chicken, beef, to even frog. However, although the choices here are plentiful, I feel that the food falls short of expectations. The food looks good when you see it--all the colors are there and the shine on the food looks delicious. However, for the mala food, the flavor just isn't quite clear cut. The spicy is like kinda spicy but not really, and misses the kick that Sichuan spicy needs. Also, I was pretty disappointed with how they prepared their drier dishes. I ordered a cumin lamb, and to my dismay was presented a few, and really dried and shriveled pieces of meat. Also, for my beef hot pot, the beef was cooked way too over done so it tasted like rubbery dry scraps.   The restaurant offers everything that makes a good Sichuan restaurant, but needs to execute correctly to earn it's spot as a top Chinese place.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RTTMsplbxNb61fujtFz23g"
  },
  "vXZBsZfHpXZmIKlF_X_Blg": {
    "date": "4/6/2012",
    "text": "Today, the food was cold, apparently it was cooked before we order it. They just use microwave to heat it, but not thoroughly.  After three hours, my boyfriend and I feel stomachache. I will never go back to this restaurant !",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qPsn9g1-KZS9vuQ9OUZqEg"
  },
  "wJAJRrVgrKs6E-c5zBL66w": {
    "date": "7/31/2015",
    "text": "Had dinner at their new store in oakland! Great taste, price is less than I expected! Authentic Chinese food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FfQ4jFluPGh6GwwplsXBWg"
  },
  "UKccqSfauarc25IBHu4suQ": {
    "date": "11/18/2011",
    "text": "Hot damn!  My mouth is on fire with the fond memories of my mouth being on fire!  The secret to China Star is to order from the Chinese menu, not the white folks menu.  Or even better, order whatever is on the whiteboard when you come into the restaurant.   Don't go in and order egg rolls and general Tso's chicken and expect it to be anything but mediocre.  DO order a flaming pan (especially the duck in beer if they have it).  Expect your face will be burnt off it you ask for it spicy.  My favorite dishes: Dry fried Chongquing chicken, mapo tofu, sauteed green beans with pork, spicy lamb in flaming pan, don don noodles and anything with bamboo shoots.   The service is standard for a somewhat authentic Chinese restaurant.  Your waiter will not be around because it is expected that you will be there for a long time and that you will seek out your waiter if you need something.    And if you will pardon the gloating for a moment, THIS IS MY CORNER CHINESE WE-DONT- FEEL-LIKE-COOKING-ON-TUESDAY-Joint.  Can you say 'spoiled?'  ps-it's BYOB AND next to a liquor store!  Heaven!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "EzSrmCtkptei9Pl12Fdjiw"
  },
  "2c-YxrU3W7b6XdrrFNL_fQ": {
    "date": "6/16/2015",
    "text": "We were introduced to this fabulous restaurant back in 2013 and since then we are literally hooked up with their traditional chinese dishes. A chinese food connoisseur can't leave the restaurant unsatisfied. To be honest we never tried their \"Americanized chinese menu\" but the traditional menu always hits the 'T-spot' :-)  Shredded pork with hot pepper, Kong Pao Chicken Chengdu style, chengdu jumbo shrimp (HOT !), and the flaming pan (chicken/ pork/fish) are the chartbusters.. Only thing we miss is their shrimp dumpling (we ordered recently and it was not the same as before ). Overall it's a nice restaurant with good food, convenient location and friendly environment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mJqadSyrhSlF-1tpW3uDhg"
  },
  "-taDjdmp94Tz-l9miE4z_Q": {
    "date": "12/13/2011",
    "text": "Finally, a good Chinese restaurant in Pittsburgh! Even the decor and ambiance seems authentic, with the family-style tables, paper tablecloths, and slightly sticky seats.   The food is top notch--we ordered from the Chinese menu (rather than the \"American\" menu) and were thrilled with our dishes. I had shredded pork in garlic sauce and my husband had some sort of duck with Devil's Tongue yams. Oh actually, I suppose I did order from the American menu: I got a cup of hot and sour soup and loved it. Perfect for a cold night.   The waiter was terrific--he gave our 6-month-old a fortune cookie wrapped in crinkly plastic, which kept her entertained for quite awhile.   By the time we left around 6:30 on a weeknight, there was a decent crowd, and all seemed to be enjoying themselves. We're looking forward to going again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "d0LUROgBb3R5eAEiocKLvg"
  },
  "I2eSqBj-Vc76o9hCxGAeTQ": {
    "date": "8/21/2011",
    "text": "Hallelujah!  An authentic Chinese restaurant smack in the middle of Squirrel Hill!  In my three years in Pittsburgh so far, I'm often asked, \"How do you like Pittsburgh?\"  And my answer is always, \"It's exceeded my expectations!\" and I mean that in the best way possible.  But then I always have to temper my enthusiasm with the fact that there is absolutely no reasonable Chinese fare to be had (that, and I miss being around tons of Asian Americans).  Anyway, I used to pass by this place and think, \"If they do dim sum AND Japanese food and whatever else kind of Asian food they think they cook, they must do everything poorly.\"  Apparently that wasn't so far off.  But a few months ago, I noticed that the signage had changed, and that when I looked in the windows, the place was FULL of Chinese people!  And that, my friends, is the mark of a good Chinese restaurant.  I'm sad to admit that I waited this long to try it, since I live just a few blocks away, but man oh man, am I glad I did.  This is the real deal, Sichuan spicy goodness.  We got the lo mein (don't shoot me, it was for my non-Chinese husband), garlic eggplant, and fish fillets in hot pepper sauce/broth (literal translation from Chinese: Water cooked fish).  OH MY GOD AWESOME.   I can't wait to try some of the other goodies they serve here.  But make no mistake - come here for excellent Chinese food.  Thank the heavens above, Pittsburgh culinary options really have come along!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "ckMFtaljrmXWaSiQqk9ZWA"
  },
  "xYzItcZJkuFIalN0OPdz2Q": {
    "date": "2/20/2015",
    "text": "Room is cold, better keep you jacket on, it is winter of course. Fish in flaming pan served cold(fish meat, vege is ok), but warmed up by the flame underneath, thanks GOD! Cold dish is the best, good job chef.  3 cups chicken is dry, it happens when you reheat the chicken meat.  Mapo tofu is good, and hot, a decent dish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R90DZJCIM5R7-Q76a14vMQ"
  },
  "523Le2PIwTiAbKlf7zVM9w": {
    "date": "5/16/2015",
    "text": "Went out with my wife and a couple of her co-workers who were from China. They couldn't recommend it enough. We had a lovely time. We ordered a crispy-style chicken, dumplings, a dish with pork belly, asparagus, and it was plenty to go around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Dqs0eia1lDmzvkAa38d4A"
  },
  "_Ged-GIf_phDoocU5tMp4Q": {
    "date": "5/9/2015",
    "text": "A nice restaurant in general. The dish size is super big! Good for family gathering and large group.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nb1DwKlsGqqRDTVyRcq2Nw"
  },
  "O5adkT5Nze6YTwlCvq2TVw": {
    "date": "11/13/2011",
    "text": "I've never really had authentic chinese food, and I'm as guilty as they come as far as loving my americanized general tso's and egg rolls. However, authentic Sichuan, with it's allure of numbing spiciness, has had me wanting to try it out for a while now. So while we waited for our one-hour photos to finish at Costco, we ran up here to give this place a shot.  We walked in to grab takeout and the guy at the front desk seemed American born and fluent in both English and Mandarin(Not that I know what fluent Mandarin sounds like, mind you), so consider your complicated phone orders A-OK with this place. We started to look at the menu and were disappointed at the choices - it seemed to be a normal chinese place with a few additions here and there. As I was about to choose a dish, though, the guy mentions that there are in fact two different menus, and that if we're feeling adventurous we should look off the black menu.   Of course, this is what I had been looking for - and of course it was no easier to make a selection off the hundred or so brief descriptions. I finally asked the guy what would give me my fix of Sichuan heat and he immediately recommended the Chongqing Chicken($12.95), describing it at simply chicken mixed in with a heaping pile of peppers, sounded right up my alley. My friend got Shredded Potato in a spicy sauce($9.95), and my girlfriend got tofu noodle soup($7.95) - which they accommodated her complicated order of no sesame oil, sesame seeds, or nuts by going back to the kitchen and ensuring it could be done first. Our food was ready in about 10 minutes.  When I finally got around to eating the chicken, it was exactly as I had hoped - peppers outnumbered chicken in this dish by far, and the heat was amazing. Pure mouth-numbing bliss, and the flavors of the dish itself were outstanding. But seriously, the heat was what I was after and the heat I got, and as I took breaks from eating I was sweating and my tongue felt like it got shot up with novocain.  The shredded potato dish was fairly tasty for the little I tried, and the tofu noodle soup was a bit bland in my opinion - by we also ordered it with a water base instead of a chicken-stock base, which is probably the reason.   The China Star is an awesome place to go try out some real Chinese food. I don't know if this place will replace my General Tso's habits, but I can't wait to come back and start to work my way through some more items on this menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "B5FTjNWSgkAQ9UjOKVjGhw"
  },
  "hhWhTp_7h1GaPv0vE12oZw": {
    "date": "3/26/2012",
    "text": "Help, I've died and gone to Chinese food heaven!  I highly recommend trying what China Star has to offer. Their Sichuan menu is frankly amazing. I adore the Flaming Fish Pan. Oh my goodness is this dish amazing! Soft succulent white fish in a mini wok, filled with sizzling garlic sauce, mushroom and sauteed bracken. This is a huge portion that can easily be split between 3 people (although, I could totally hog it for myself)! One word of caution, the sauce is mainly oil based so I suggest eating in and having it while it's hot.   The steamed dumplings are fantastic and so is their garlic eggplant and mushroom - bok choy dish. Just writing this review has made want to go back for more! Their service has always been friendly and you can ask them for the True authentic choices. I can't wait to continue exploring the rest of their menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "y7DLKy_D6CPqhzGswGXAZA"
  },
  "fSXLbJ7hmAdmfZFxMfybIg": {
    "date": "4/21/2014",
    "text": "This review is purely for an ORDER FOR DELIVERY- via Grubhub.  The western lake beef soup was great. Fair portion for 9.99$  Green beans w. Minced Pork - 10.99$ on grubhub, tasted TOTALLY HORRID. Portion was equal to that of a 6$ dish, will not be ordering for delivery again.  Based on all the positive reviews, maybe I'll come in to eat... Portion must be bigger than a small round container for 11$  P.S. Grubhub being the excellent service they are, gave a 15$ credit for this order. Unfortunately the restaurant was not kind enough to give a fair portion.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "t9WT2qoitoPrmgSmlel0mQ"
  },
  "L3afV-hQyXeYEH0J5M927g": {
    "date": "7/8/2014",
    "text": "Love this place!!  The mapo tofu is amazing.  We always order wontons in hot chili oil",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p6XDKu_m8Qx-bcELSDfbQg"
  },
  "Yoy9yYNsoPZXXrl5F1vktg": {
    "date": "1/27/2012",
    "text": "Miserable experience tonight.   Ordered delivery and was disappointed the minute it walked through the door.   Sampled:  Nothing   Called and returned everything and ordered from someplace else.   We have ordered from here before, and I have always been a bit disappointed with one or more selections, but tonight was very frustrating.   All I wanted was an eggroll with homemade duck sauce and hot mustard.  My fiance even repeated it three times on the phone please extra duck sauce and hot mustard.  The delivery guy gets here and not only is there only one duck sauce but no hot mustard. They also didn't send the extra sauce for my shrimp.    My fiance called back explained the situation and they returned it, but he did have to explain himself multiple times as if he was the one that had done something wrong.   I might give them a try again, but with all of the quality Chinese food in the area it is unlikely.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kXt6tPSGLWhWTiXO7XPjuA"
  },
  "y4DehxUD_MkPzF4ppaN7jA": {
    "date": "2/21/2015",
    "text": "I used to like the food in this restaurant until i ordered takeout today. There's a piece of garbage like plastic bag in the noodle i ordered today. This is seriously disgusting.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xW4EVZ9dMc1Qo6QyWsj33Q",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Found a piece of plastic in the noodle i ordered for delivery. Disgusting.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xW4EVZ9dMc1Qo6QyWsj33Q/o.jpg"
      }
    ],
    "user_id": "HBajMLky2uEykI7wQ6QwkA"
  },
  "WEv_0EgrCYMLWZnZnXVkjw": {
    "date": "4/6/2014",
    "text": "Excellent, flavorful, spicy, authentic Szechuan fare and hearty servings. The hot & sour soup was loaded with tofu, egg, veggies as it should be and plenty of flavor, not just pepper. We loved the eggplant and garlic,sweet, spicy and tender. The flaming chicken is terrific, with wonderful vegetables, aromatics and plenty of pepper oil and red peppers. The tea smoked duck was a bit too salty and the skin was not as crispy as I would have liked but edible. We look forward to, our next visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kVXB8GHOkKVdZQp-VEUA0Q"
  },
  "Q0mvslxMSfNVyYuMCT78WA": {
    "date": "9/8/2013",
    "text": "Absolutely the best, most authentic Chinese food in Pittsburgh! Try the Chongqing Chicken, the Mapo Tofu, the Xinjiang style lamb-- all fantastic! Service is good, hours very convenient. Take it from someone who lived on China for 3 years- this is the real deal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6SikAm0r-8ydKCCEqpLY_g"
  },
  "iQ_xV5BPMtRxv5ydpNHnkw": {
    "date": "5/2/2011",
    "text": "Great new chinese restaurant, just opened two weeks ago at the former location of Pacific Ring. They have an dauntingly long menu, we ordered dou miao (watercress), fried whole riverfish, beef tongue appetizer, and the dumplings in chile oil... yummy!  There is still much more i want to try from their menu and I haven't figured out what's best to eat from this place yet... but what we ordered was really delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "7T1IMdlV_UDkNSNFHtXm5w"
  },
  "w-GOvipPIc5S70W6ztmT-g": {
    "date": "9/13/2014",
    "text": "Great overlooked Chinese place in Squill.  It's got that classic \"I burnt the dinner on Christmas so I'm going out to Chinese\" vibe in the decor and atmosphere, you know what I'm talking about.  But it's also got a great expansive authentic menu-  It can be hard to figure out what to order.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_0TKEDIcuWW5Y4BHo1t24g"
  },
  "XIFPY1FUcvR0kWI6UcpRMw": {
    "date": "2/10/2012",
    "text": "I'm really hesitant to give this what I think it should be (2 stars max), so I'll set it at 3. The fact of the matter is, for the quality of the food you're getting (which is mediocre Sichuan cuisine), you are paying exorbitant prices ($15+/dish? really?). Granted, it's Pittsburgh, so it's hard to compare the food to places where the Asian density is higher, but still...  1) Chongqing la zi ji. Not horrible, but lacking the spice omph that it typically has. This version is breaded; the Chengdu one is not. 2) Beef bao. Not good at all, avoid this - it's tasteless and a very simple, uninspired stew. 3) Beef tendon, cold. Actually really nicely prepared, I'd recommend this one - nice balance of ingredients + peppercorn + chili. 4) Water-boiled fish. This dish is a disgrace to the real dish - its not served properly, almost no peppercorns are used, and it seems to be using some pre-made spice ingredient + way too much starch. 5) Pork shoulder. Not sure what the exact name of it was called, but it was actually pretty good - though I say that as it wasn't really a restaurant style dish but more homemade.  Service is nothing to yell about, and 5% cash payment discount. Sorry Pittsburgh, I hope you find better! (The N. Hills location used to be, but I haven't been in forever!)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bVcOjYPawv-MOX3aW-5oZQ"
  },
  "choIss3E35yXE2cVfD-ieQ": {
    "date": "9/13/2019",
    "text": "Thanks Yelpers.  I wanted authentic Chinese food.  As a Philadelphian, authentic, traditional, new age, and fusion Asian cuisine is readily available.  I wanted the beef tendon but they were out .  BUT, the really nice woman at the register asked me if I like tripe or tongue, and I said absolutely. So she suggested the beef tripe and tongue in chili oil.  Simply amazing. Thinly sliced, flavorful, large portions... just amazing.  Crispy rice and  chicken, it was super spicy (love that) and really crispy, even after driving home, it stayed crispy.    Last but not least, double pork belly fried rice. I mean fried rice is hard to get wrong and they did everything right and then some.  So to sum it all up, each meal deserves .  Next time I will dine in.  The restaurant is beautiful and welcoming.  Oh while we waited, they brought us cold water because it was hot outside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "UxaFwy9NCOx1nLydRSOMhA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Hot Amazing Crispy Chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UxaFwy9NCOx1nLydRSOMhA/o.jpg"
      },
      {
        "img_id": "u00J8WRc6lYACI9dxLa02A",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Double Cooked Pork Belly Fried Rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/u00J8WRc6lYACI9dxLa02A/o.jpg"
      },
      {
        "img_id": "tYLlf6xF0G69k362OGJwkw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Chengdu Beef Trip and Tongue in Chili Oil",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tYLlf6xF0G69k362OGJwkw/o.jpg"
      }
    ],
    "user_id": "sX3cvLnOE7z534dNtPAkDQ"
  },
  "5AqzHyrihAD5oHWjROIqxA": {
    "date": "7/19/2019",
    "text": "Got the $18 silk tofu and crab dish which turned out to be just silk tofu, frozen corn/peas/carrots, shrimp and imitation ham in a watery broth. Nothing at all resembling crab (so why such a high price point?) Was told that this was a translation error when I called to make sure I had received the correct dish. Overpriced and under-seasoned. I was extremely unhappy with this dish that was the main thing I ordered for some comfort food during a tonsillectomy recovery. All I wanted was silk tofu that was done well and this was not it.  My partner enjoyed his tripe and tongue dish, so maybe you have to order very specifically to get an authentic dish vs. a weird tasteless Americanized version of something that I expected to be completely different. Items need to have actual descriptions, and the menu needs to be significantly trimmed down. And the translations need to at least try to be accurate to what is actually in the dish. Don't up-charge for nonexistent crab. The frozen pea/corn/carrot situation did not really work with the dish and I remain eternally baffled as to why restaurants utilize these terrible frozen veggies that I am literally avoiding eating from my own freezer when ordering out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4d7W2OXWMAH3YfIKgbAPBQ"
  },
  "wKaupL9vdBWHQ0S8ZYR_6Q": {
    "date": "4/28/2019",
    "text": "The service here last night was truly horrible. When we arrived, we were told that there would be a 15 to 20-minute wait, and given a menu. At first, I assumed that this meant that we were going to have a great experience, and that they were aiming for a mutually beneficial arrangement where the customer gets to the table and knows what they would like to order so that they can turntables more quickly, and we are able to get our food more quickly. This was not the case.  Instead, maybe 15 minutes after ordering, one of the entrees in our three person party arrived. It was mine. I politely waited for everyone else's food to arrive before starting to eat. Two or three minutes later, an Eggroll arrived for 1 guests, and the other entree. We were a bit puzzled as to why they didn't just bring out the egg roll first, assuming that those are ready to go on a busy Saturday night. Over the next nearly 20 minutes, we waited patiently for the third person's entree to arrive. We saw our waitress once, and politely let her know that we were still waiting for one of our entrees. Then, the hostess came over to check on how our food was twice, and both times I told her that we were getting a bit frustrated that it had been so long and not everyone in their party had their food. When the third entree finally arrived, our server really had no excuse, despite us asking very politely what led to the holdup. She basically said that they come from different parts of the kitchen, and take different amounts of time. How on Earth is that an excuse? My food was completely cold at this point, and the person at our table who had been waiting 20 minutes after everyone else had received their food to get something more than an egg roll to eat was obviously pretty frustrated. We ate the rest of our food as quickly as we possibly could and got out of there, waiting quite a bit of time after asking for a few boxes and to process our bill. I could see that they were very busy, not sure if they were short-staffed or what, but the experience was unpleasant enough that we will never be back. The food was maybe a 5 out of 10, not disgusting but certainly not one of the better Chinese food places in town. My walnut chicken, which appeared to be one of their signature items, had that dry stringy consistency chicken that you sometimes get from microwaving leftovers or leaving food at the bottom of a chafing dish way too long. Never in my life have I asked to see a manager, but the only reason that we didn't last night is because both our server and hostess didn't seem like they could possibly care any less about our experience. Looking around, we noticed other people looking rather upset and receiving their food in strange increments. Rough night I guess, but no way in hell will we go back here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q2H45qMrFpBw7KK8EhUepw"
  },
  "paghafpJq42irztOUfBTMA": {
    "date": "6/30/2019",
    "text": "Sichuan gourmet is my favorite place to get Sichuan style Chinese food in Pittsburgh. The key is ordering from the Chinese menu instead of the American menu! The spice level here is among the highest I've had, which is one of the best things about the food. The combination of the numbing spice, savory flavors, and fresh ingredients can't be beat. The portions are generous and prices are affordable too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wzG2VPmVdo5qFsi-g5gJcw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Ma po tofu, eggplant, chongquing chicken, broiled fish in spicy chili broth",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wzG2VPmVdo5qFsi-g5gJcw/o.jpg"
      }
    ],
    "user_id": "a2DW6Wq7DcKnm2giGG9IjA"
  },
  "i9QLFT_I9n7sL4xjYYoS5A": {
    "date": "8/25/2019",
    "text": "My partner and I visited this evening. I ordered the Szechuan Beef Soup, only to find that nearly all of the soup consisted of beef fat. We requested a discount on the meal, and were only offered a pathetic 5% discount. Not only was the soup repulsive, but the overall management of the restaurant conveyed that they don't care about their customers. I recommend taking your business elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bn0EEFev5MXjeA063QPPCg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Beef Fat",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bn0EEFev5MXjeA063QPPCg/o.jpg"
      }
    ],
    "user_id": "rpMmj7yZ14o5QMhEG87Aiw"
  },
  "4SxHTIAhLSFZrv_Ja_DuLw": {
    "date": "11/25/2018",
    "text": "As a Chengdu native living in Pittsburgh for a couple of months, I find Sichuan Gourmet is the most authentic Sichuanese restaurant so far. having been here a couple of times, I have to say most the dishes I have ordered are above average.   A few staple Sichuanese dishes, such as steamed eggplants appetizer, cucumber appetizer, Ma Po tofu, Dan Dan noodles, and flaming pans (or dry-pots) were spot on, though dish presentation and flavor details could be improved. For example, the steamed eggplants were not cut in a way they are supposed to be, also the pork ribs with bamboo shoots didn't look very appetizing (the flavor was okay).  Personally, the spicy level is good for me, not too spicy yet with necessary Sichuanese flavors. However, this might not be True for the diversity of potential customers out there. If the restaurant wants to go to the next level, I recommend the restaurant could use some type of standard \"spiciness scale\" to meet different customers's dining needs (which is a common among authentic Sichuanese restaurants) . Service is better than average Chinese restaurants, but could be slow when the it's busy.  Overall, I think it's a solid 3.5-star authentic Chinese restaurant. I round it up to 4 starts because it offers me the taste of home in Burgh. I'm sure I'll be back or order take-out every once in a while.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 13,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "p3UU9vt4dOnDhxnETKMQKQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Steamed eggplants with garlic sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p3UU9vt4dOnDhxnETKMQKQ/o.jpg"
      },
      {
        "img_id": "3o7JLJ2sGRlOhmLkNbqKcA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Dan Dan noodles &amp;amp; Pork ribs with bamboo shoots",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3o7JLJ2sGRlOhmLkNbqKcA/o.jpg"
      },
      {
        "img_id": "xJR7YnrjxYvgS4QDPUnhTw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. A24. Cucumber with Fried Pepper Flavor &amp;amp; A8. Chicken in Scallion and Chinese Pepper",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xJR7YnrjxYvgS4QDPUnhTw/o.jpg"
      }
    ],
    "user_id": "GhuMzO3JVds90tweXV5t7A"
  },
  "eWE4ui00SpFSgRzdHfdhCw": {
    "date": "9/20/2019",
    "text": "Very rude service by a waiter. Food was not authentic. Wrong calculation on bill. It seems a common practice in this restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wQrdctk7IzzIVACHo2anBQ"
  },
  "kRVl11A_XJwxMDv-hHtzXw": {
    "date": "10/13/2018",
    "text": "I stopped by here a couple of Sundays ago with my wife for dinner.  We were kicking around some ideas for dinner whenever my wife decided on Chinese food and I found Sichuan Gourmet in the Enjoy book.  So we headed on over to Squirrel Hill for our dinner.  Sichuan Gourmet is located right on Murray Ave and is actually quite nice inside. While the restaurant is only a single story tall, they have seating in two levels with a lower level and then a higher level where we sat that is up a couple of steps.  The inside is decorated in a lot of wood tones and has stuff like a fake tree.  There were also two flat screen TV's on the wall both which had what I assume were Chinese TV shows on them.  For dinner on this evening I decided to go with the Chong Qing Chicken while my wife went with some type of sea food hot plate.  Chong Qing Chicken is my absolute favorite Chinese dish and it did not disappoint here.  The chicken was cooked nicely and was tender and juicy.  Meanwhile the batter around it was airy and crispy.  It was covered in dry hot peppers as well as Schezuan peppercorns, ginger and garlic.  While the dish wasn't super spicy I did get a bit of it as well as little bit of the numbing.  Besides the chicken my favorite part of the dish had to be the tiny  bits of garlic which took on an almost buttery flavor to them.    The bottom line for me is that I would head back here again in the future.  As a matter of a fact I actually had a discussion with my wife after we had both finished and we both agreed that our meals were that good.  Next time I hope that I can order the chicken just the tiniest bit spicier.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "1TMRrgeTSNoX3XFn6OonXg": {
    "date": "4/14/2019",
    "text": "Had an excellent meal with superb service during a very busy time post CMU Tech Fair. The restaurant was packed with huge student parties and I was prepared for mediocre service but the staff was on point and delivered a great meal.   This Chinese restaurant is in the heart of Squirrel Hill a hot bed for Asian eateries. The authentic food options were really exciting. We ordered a seafood hot pot that was prepared in the large cooking pan in the center of the table. It takes time to cook especially if u order lotus root that takes 20 minutes to get soft. The result was amazing - it was not cheap but was a great value and was really fun to eat. We had steamed dumplings- and a eggplant with hot sauce that were both excellent. Order apps to hold off the wait for the hot pot. We also ordered a fancy Flaming beef that was visually fun, just spicy enough and had a nice variety of veggies. I highly recommend this dish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DTN9gqqKoo2B9maEbqhNfQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. The big cooking pan and the wait for the hot pot magic",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DTN9gqqKoo2B9maEbqhNfQ/o.jpg"
      },
      {
        "img_id": "BfQ4mLPfvtrtPTnE5NrAkA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Eggplant spicy appetizer",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BfQ4mLPfvtrtPTnE5NrAkA/o.jpg"
      },
      {
        "img_id": "L-_9rGHVUpHIHvxt0cqH4w",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Seafood hot pot",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L-_9rGHVUpHIHvxt0cqH4w/o.jpg"
      }
    ],
    "user_id": "UetOIhAdPBkGjm_o-mSC3Q"
  },
  "ry0FwGB6Pjdnl2jB0_tT-w": {
    "date": "6/12/2019",
    "text": "Amazing authentic experience. they have an authentic side of their menu and american for anyone who wants that. i am a new comer to authentic chinese cuisine so i was a little worried about what exactly i was ordering. we got kung pao chicken, tofu, scallion pancakes, and some udon noodles. we had enough food for 6 total meals including the two we ate there! so much food. their entrees definitely are shareables. overall it was a great experience and i can't wait to go back and learn more about chinese cuisine and to broaden my typical eating palette! great spot in squirrel hill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e2SZJY55gyirXSNEQu_aSg"
  },
  "iIiqYLYe2AdO5uF9nlJUdQ": {
    "date": "2/25/2019",
    "text": "This place was such a great surprise. I had no idea what to expect as someone in my group was leading the way and opted for this place. I love Chinese food, but if you are looking for the \"american\" version of Chinese food - do not come here. This Sichuan place is where you should come for some authentic dishes to have family style. Our table of five split 3 main dishes and two appetizer. I have no idea what they do to their chili eggplant but man, is it delicious. We also had the pork belly and bok choy. We all had a blast, and the dishes were wonderful. I think as a group we all spent $12-$15 on average too which was great.   One guy in our group was fighting a cold and ordered separate from us and did not want to share. The staff was attentive to that and brought him his dishes directly to him and the bill to him. Something small but we still noticed and appreciated this.   I can't wait to try more on the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iOHdpvxNuMwJaer8lZUW9g"
  },
  "gYph_LblxefyNQORkb-cIQ": {
    "date": "7/13/2018",
    "text": "As much as I like Asian food I don't think I'll be back here. They're just too many high-quality Asian restaurants in the city of Pittsburgh. We came here on a Groupon my wife had Szechuan chicken Hawaiian style. It was fair. I had to noodle soup seafood and I've never seen Schremph so small in  my life.  Service was sub standard, indifferent in my wife's words.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "16zddOAhxVAjZIS3k6WI0Q",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/16zddOAhxVAjZIS3k6WI0Q/o.jpg"
      }
    ],
    "user_id": "Ivaiwkm8UOm7EHyH8trQ7g"
  },
  "VDqtKuHUIYapuEwDhSaasQ": {
    "date": "3/11/2019",
    "text": "This is an amazing place to order Chinese food from and their  food taste amazing and it is,not too greasy, which is a very good thing and the taste is  amazing .  Friendly, prompt service. A large menu with a variety of choices from mild to spicy! Industrial looking space; very clean.   The best Chinese food I have had in years",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lyVPS4HCERSzipghwAfBrg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lyVPS4HCERSzipghwAfBrg/o.jpg"
      },
      {
        "img_id": "HT9Zz9sMNLgRoR3DAwkDEQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HT9Zz9sMNLgRoR3DAwkDEQ/o.jpg"
      },
      {
        "img_id": "2VuFqdgC26T7iEqRGEY8Bw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2VuFqdgC26T7iEqRGEY8Bw/o.jpg"
      }
    ],
    "user_id": "6brJoNSgyZ0AxeQBNLMkNg"
  },
  "fCGip_LcfK6uPAQg1Yooww": {
    "date": "4/19/2019",
    "text": "pretty good experience! I been there many times. Everytime they give me some new dishes that I never have at other place. The service was very good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9YLCsbNqbkk8gsEWM5EWhw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Country style pork with buns",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9YLCsbNqbkk8gsEWM5EWhw/o.jpg"
      },
      {
        "img_id": "FFRzg_aniWrUBFUGk_2rjw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Chengdu style instant boiled hotpot",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FFRzg_aniWrUBFUGk_2rjw/o.jpg"
      },
      {
        "img_id": "br9uKLCYQaVCfHwMQNaM4Q",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Nourishing health tofu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/br9uKLCYQaVCfHwMQNaM4Q/o.jpg"
      }
    ],
    "user_id": "RG5SrmObWOMrdMBVr448HA"
  },
  "pSx6v_GrXRaa9WV87Dci6A": {
    "date": "4/30/2018",
    "text": "OVERALL: hands-down best Sichuan restaurant in Pittsburgh in terms of flavor. Come here for authentic Sichuan food, but make sure you order off the \"traditional\" menu. Environment is nice but service is mediocre.   Sichuan gourmet is one of my favorite places to go, for both lunch and dinner. First of all, they have great lunch specials, which are perfect for students who have some time between classes to go eat. It's generally under $8 and come with soup or a drink. The portions are perfect for lunch. They have a traditional Chinese menu as well as an American menu for their lunch specials.  As for dinner, they have great options as well. As a warning though, their American dishes are not impressive. I ordered the fried rice there once, and it was a solid 2/5.   I wrote this review to commend Sichuan Gourmet for their fantastic traditional Chinese dishes, which are authentic and flavorful. The prices for the entrees can get pricey, but it is fair for the area. Some of my favorites are the Chongqing fried chicken, which is the best rendition I've eaten in Pittsburgh, Mapo Tofu, Shui zhu beef, and pork with celery and dried tofu. The Sichuan flavor is very present in all these dishes. As someone from that area of China, it makes me extremely happy to see food like this near my college campus.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Via6bGr3rzMtfaDrDqA9VQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Lunch special (double cooked pork and shredded pork with tofu and celery)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Via6bGr3rzMtfaDrDqA9VQ/o.jpg"
      }
    ],
    "user_id": "PrPAKuxN2Aw_QL60DhALKQ"
  },
  "5fyUOr0Vk2fyfkDtvk1Rmw": {
    "date": "12/7/2018",
    "text": "Wow! We were impressed by this place. Big plates of tasty food (if you like chinese cuisine of course), excellent service, authentic atmosphere and affordable prices - what else to ask from a good restaurant. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ni_XGUWwOGyEQSp66v0kzA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ni_XGUWwOGyEQSp66v0kzA/o.jpg"
      },
      {
        "img_id": "jkggRrKd90mu4beK1jRyuA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jkggRrKd90mu4beK1jRyuA/o.jpg"
      },
      {
        "img_id": "_Guldw4C8cE6FViBQmg_Rw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_Guldw4C8cE6FViBQmg_Rw/o.jpg"
      }
    ],
    "user_id": "80SUG7dIwHG4dtHKzXq_3w"
  },
  "3gUOT9t3Y2X-bYPJheKePg": {
    "date": "9/19/2018",
    "text": "Went at lunch and ordered vermicelli noodles with pork, Sichuan beef in broth, and tripe and tongue in chili oil appetizer. The noodles had so much flavor, a bit salty but a very good taste. I wanted to keep eating them. The beef was tender and had a good amount of veggies in the broth. The appetizer went really great with rice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4fYYyXJSv8FHlEoav_fijw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4fYYyXJSv8FHlEoav_fijw/o.jpg"
      }
    ],
    "user_id": "3CqhhGSlTk0C5kwPJ-Km7g"
  },
  "qxZvN7EkJArEE6wN3zp7-g": {
    "date": "1/17/2018",
    "text": "Great option for Sichuan food in Pittsburgh. I've been here a couple times, and every time it's satisfied my craving for spicy, hearty, filling (and oily) Chinese food. Some of my favorites are Diced chicken with dried pepper chongqing style, Smoky pork belly with seasoning tofu, and Dried sauteed green beans with smoked pork. Watch out for those peppers when you're eating those famous fried chicken bits! Another veggie option I also like is the snow pea leaves.  It's a Chinese restaurant so I don't really expect good service, but I think it was fine. The restaurant itself is pretty spacious which is nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LXr28_TITbSPIoucPTcQmw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Dry sauteed green beans with minced pork, and Diced chicken with dried pepper chongqing style",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LXr28_TITbSPIoucPTcQmw/o.jpg"
      },
      {
        "img_id": "acaMaeYu9RHlLEf6htqxGA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Smoky pork belly with seasoning tofu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/acaMaeYu9RHlLEf6htqxGA/o.jpg"
      }
    ],
    "user_id": "GKlW5tDfCvAtbqnGzBokNw"
  },
  "I2d-yKZ8fFV5oFm63c7fbw": {
    "date": "4/24/2018",
    "text": "Got this in CMU lunch box lol. Thanks for the paper and ink. We need to value this in our digital world.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aCOPkmFXwbbDkhxbf4wwuQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aCOPkmFXwbbDkhxbf4wwuQ/o.jpg"
      },
      {
        "img_id": "XX3AiMMhyEVaT7o4Wr9aXQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XX3AiMMhyEVaT7o4Wr9aXQ/o.jpg"
      }
    ],
    "user_id": "gPEc5dIL_8AVyxOH9_RF5w"
  },
  "jPw81G98cPJlb-WcP7Mx7g": {
    "date": "7/26/2019",
    "text": "So I really like this place's authentic pork belly with leeks (and also their dry sauteed green beans) and I always order it whenever I come here. Tonight's pork belly was kind of over-cooked and dry so I was at first disappointed but when I told them about it the manager and girl was really nice about it and replaced it asap after I let them know. The replaces pork belly was super tender and just as good as I remembered it! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5JAIsV5ebx5UNbgwkXkAzg"
  },
  "sZW9O430UvFEvBaZaSYOXA": {
    "date": "4/13/2013",
    "text": "We had the mapo tofu with fish, the hor fun with shrimp (not on the menu but they'll make it upon request) and another fried prawn dish. The hor fun was not in gravy- it was their own version- but still good. The prawns were really delicious and the mapo tofu perfect. Would definitely go again. Paid about $11/person.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qqbPlTw6kEBIJMrw8iz3pQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Hor fun with shrimp, not on the menu, but you can specially order it",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qqbPlTw6kEBIJMrw8iz3pQ/o.jpg"
      },
      {
        "img_id": "cx78D8fkEXipE9E1LTUCRw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Some fried prawn thing",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cx78D8fkEXipE9E1LTUCRw/o.jpg"
      },
      {
        "img_id": "o_rrs1AiZLz2imnDntIHfA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Mapo tofu with fish",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o_rrs1AiZLz2imnDntIHfA/o.jpg"
      }
    ],
    "user_id": "RxD31wTRqmVuWZLH1MN9Dg"
  },
  "enrZ7lixrp4vjxMK08zy6g": {
    "date": "12/16/2014",
    "text": "Oh, so delicious. Huge menu, and in the three times I've been there, the food has been delicious. Here's the ma po tofu...with fish! And here's the cumin lamb...with enough Sichuan peppercorns to make you feel it the next day.  Two nice features about the menu. One, there's a section labeled \"American Chinese\"--helpful for me, so I know what to avoid. Two, there's a section of steamed dishes, which makes my salt- and oil-free Nana very happy.  Would be five stars, except the place could use a good cleaning. Random boxes everywhere and a sub-par bathroom.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QOsm6AoAtB4ju82K_Iv2ig"
  },
  "T3mCIbwWSf0PXgpwNfwtYQ": {
    "date": "11/4/2016",
    "text": "This is my favorite Chinese restaurant in Pittsburgh. My friend from China took me here and knew exactly what to order. I love Sichuan style food.  They have two menus I always order from the Chinese menu not the American one.  I get the flaming hot chicken it comes with bamboo shoots.  They have amazing dan dan noodles.  And they just remodeled, looks great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RXKHjg1YfsRWpOaUna4R_Q"
  },
  "fTJfL2f_lCos4U8qH12X1w": {
    "date": "5/13/2015",
    "text": "Very good Chinese restaurant. As a Chinese, I very suggest you guys to try. It not only has Chinese food which match Americans, but it also has very wonderful Chinese food like domestic Chinese food. I often take my friends to there, most of them like the food. In addition, the price of the food is not expensive and the amount of each dish is enough.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qaqbhsi7xCxjT4_ygTNAHA"
  },
  "xzN9hNPRZ6kPvHfgqpBoqQ": {
    "date": "5/12/2015",
    "text": "It's a great place with a lot of options :D my India friend says she really likes the Chengdu jumbo shrimp!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zdYqWP84eexfxF0ClVI2iQ"
  },
  "4e72CBDOFRGc1_ooql8VAA": {
    "date": "1/3/2015",
    "text": "The service was extremely fast, atmosphere was great. I did not like the Bok Choy with mushrooms like I thought I would. The ginger duck was really good though. 4.5 stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "akrkQYK01K-RZB1mVKTTXw"
  },
  "zjIfE319avPYhlO56K0sTQ": {
    "date": "8/11/2016",
    "text": "Don't know why. Their attitude goes worse and worse each time I visited. I remember when they were just opened, the attitude was fantastic. I guess there are only that many decent Chinese restaurants around the town, and they get to be arrogant and don't give a fuck. Oh well.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hIlNkQBDlQ8NggGOvtp3Rw"
  },
  "ceZrikgTG9JNqybfYqWJwg": {
    "date": "5/3/2015",
    "text": "My favorite eating place in Pittsburgh! Delicious and authentic Chinese Sichuan spicy food. Even comparable to most Chinese restaurants! We come and order online on a daily base.  They even provide gorgeous student lunch box to CMU every workday.  5 star recommend! And no matter what dish you order, it will bring you taste of real China and hometown. Love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PlE4kQMr5QiqnFsD9pIyNg"
  },
  "lI7q_eJ2HTjQRmkezCCOGw": {
    "date": "6/25/2014",
    "text": "Best Chinese food you can find in Pittsburgh almost the same quality like the restaurants I've been in Beijing, China.   Very authentic, great taste and a huge menu. And reasonably priced as well. Very quite at off-dinner/lunch hours.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "KuIxSrhYQ94y7_n5njHlPA"
  },
  "mQl4FLrI6xypDManSioF7Q": {
    "date": "8/29/2015",
    "text": "Nice food!I had my Birthday party here. Cake knives and wineglass are provided. You should better come here before 6 or you may have to wait.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "admpcBtIPSwzjpMDqjKFnw"
  },
  "4FHps-D6p5c1Z_gIs9AlAA": {
    "date": "10/22/2015",
    "text": "Ordered the pork with sizzling rice from the Chinese side.  It was wonderful, rice with tangy pork with black vinegar, I think, ginger, garlic, and soy.  Yum.  From the American side, the orange chicken was good too.  Will return to try more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QaOA8k-xIXF9v76iBDwjew"
  },
  "AVzMN4KRKtvjxF5oo3MLjQ": {
    "date": "3/4/2012",
    "text": "I got yelled by the lady when I called to let them know I didn't receive the dumplings which I ordered along with other dishes. How dare they.  They have decent food but that doesn't matter to me anymore. I am never going back to this place ever again.  HOW DARE YOU YELL AT THE CUSTOMER ABOUT YOUR FAULT!",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "UFKm0aqCsjiRQhx8ilIa0A"
  },
  "wbV6sr9iJGujnJI2xo-D0Q": {
    "date": "8/11/2014",
    "text": "I'm adding Sichuan as one of my go-to Chinese restaurants. I have been to Sichuan before for Chinese New Year and was not impressed. My friend had a Groupon so we went here again. They had changed their menu so it was more presentable. They still separate the \"Traditional\" and \"American\" menu. We ordered the pork belly and stir fried noodles. The pork belly was to die for. I actually wished they gave more rice with the dish because I would dump it into the sauce and eat it plain like that. The size of the entrees are pretty big and through perseverance (not really) my friend and I plowed through both dishes. I would order the sliced pork belly (without spice) in a heartbeat again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "BTg_ajmMJKKpvH0P1mAUqA"
  },
  "XJzd26jm-oapckfb9pBLzw": {
    "date": "8/17/2015",
    "text": "Should be top Chinesefood in Pittsburgh! I like it so much! I often have lunch or dinner at this restaurant, it never disappoints me!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Z1lI6-OhvHlxbxMwZ1yCA"
  },
  "Z6NBAG_CjqPHZlIkKMlu-A": {
    "date": "6/27/2012",
    "text": "Great authentic Chinese food. I've spent time in China and lived in Taiwan.   Use the chinese style food menu... Read the menu carefully... Order a lot of stuff... Dont forget about vegetables (steamed veggies and cold cucumber salad are awesome) Bring friends... Be prepared to spend a chunk of cash... And always ask for very little oil.   I haven't tried their hot pot yet, but I'm sure it is a treat! I can't find hot pot anywhere else in Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "sYBgfT4Qpbg8qe1-nckazQ"
  },
  "Kd-oICEEu2uzNxuG9jsXag": {
    "date": "1/1/2013",
    "text": "Terrific (real) Chinese food--went there for lunch and split an eggplant dish (in a garlic sauce, similar to Ka Mei's but a little spicier) and a flaming pot chicken (with garlic chunks, onion, some other veggies, and a generous helping of hot red pepper).  Also had dumplings with red pepper oil sauce, similarly delicious. I definitely look forward to visiting this place again when I am in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YE54kKTuqJJPNYWIKIpOEQ"
  },
  "ifV9j_vQkTSH2WmzCT517A": {
    "date": "7/19/2012",
    "text": "0 friends 1 review Virginia E. Pittsburgh, PA   7/19/2012 Ghastly meal! An egg roll and a dish called \"triple fairy\" were delivered. The egg roll was less flavorful than a frozen one from Giant Eagle. I was already suspicious -- if a Chinese restaurant can't make a decent egg roll, then you know it's bad.  The Triple Fairy -- that was the outrageous thing. The \"triple\" referred to a mixture of chicken, scallops & shrimp that were supposed to be mixed with vegetables and a light sauce.  What arrived was a disgusting mess of HUGE tough broccoli spears, giant chunks of green pepper, and big stringy snow peas with brown spots that looked like insect bites. The vegetables were way too big to put in your mouth without cutting them up. And of course the inevitable baby corn. The scallops were the texture of pencil erasers, the shrimp was totally overcooked, and whatever the sauce was had no discernible taste at all.  I actually ate a couple of shrimp & scallops, a mushroom or two, and threw the rest in the garbage.  Sixteen dollars down the trash chute. Learn from my experience.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tg7rDyiw2QJO9yZDuFNshQ"
  },
  "9_mJElFvfZpvUQK9KyFqHg": {
    "date": "1/18/2013",
    "text": "THEY HAVE HOT POT!!! I mean honest to god, authentic Szechuan hot pot.   It's not on the normal menu, or it wasn't when last I was there, but if you ask for it, they'll haul out the Chinese menu and there you go. Ever since returning from china a long time ago, I have really craved this dish. And hot pot's not the end of it!   This lovely, spacious restaurant features a bevy of authentic Szechuan dishes. The wait staff speak heavily accented English, but they are so friendly and inviting that it isn't uncomfortable. Once they realize you're into the good stuff, they're full of recommendations and suggested meal alterations.   There's lots of room, but every time I've been there the tables are pretty much full. I believe there is also a big area in the back for large parties. I know where I'm going for any big shindig I have in the future!!    I highly recommend this place for the more adventurous of you all. Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sun6U8Mb-ez9THffaJZq_Q"
  },
  "X-od9X_cYPqsGnccZtuEAg": {
    "date": "8/30/2015",
    "text": "As a student from Sichuan, I have to say that Sichuan Gourmet is a reeeaaaally good Chinese restaurant that provides authentic and delicious Sichuan cuisine - the taste is just the same as it is in Sichuan. Strongly recommended for those who want to have a taste of Sichuan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cFq-R1Q6eOpRoRtHusEiOw"
  },
  "l4LGxKZqo6rIVsaNdDF64Q": {
    "date": "1/7/2013",
    "text": "condition is wonderful through the music does not match so well. I will try some spicy food next time",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "064HzSinc0k62q2k6O8AzQ"
  },
  "UQ4jOdz4Y918wReO6vGi4A": {
    "date": "11/5/2016",
    "text": "Twice I have gotten take out from this restaurant. The first time they forgot two of the five dishes I ordered. The second time I got the completely wrong order. The food is good but if you actually want to get what you pay for I would suggest going down the street to Chengdu Gourmet",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NWtBnahJoPW3ovaZbmZVug"
  },
  "giSItGIA4rwtijnsyk_d3w": {
    "date": "8/25/2012",
    "text": "An interesting mix of authentic and Americanized offerings is available at China Star.   The crispy noodles served at the start of the meal come with only duck sauce. Make sure to ask for the hot mustard to mix with it!   The steamed pork dumplings had an odd flavor, the filling had a taste almost reminiscent of a hot dog's meat. Certainly not what I was expecting.  The egg roll tasted fresh but extremely bland. I wouldn't recommend them.   From previous visits we had found we didn't like their Peking duck, so we tried their tea smoked duck instead. I must admit it is a much better choice when you're in the mood for duck.   The best part of the meal was the \"Flaming Fish Pan\". I ordered it based on Ishi G.'s recommendation, and I was not dissapointed. The fish is moist and delicious, while the sauce was hot - in both meanings of the word. Spicy thanks to the pepper, and boiling thanks to the flame burning beneath it. A must order if you like fish.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7wUQAStoHgM5hB87P5wofg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7wUQAStoHgM5hB87P5wofg/o.jpg"
      }
    ],
    "user_id": "8ugd_yB1RecZMCWfSsr3GQ"
  },
  "IdIQatp5HV1Q0H4NGUdbdw": {
    "date": "8/22/2015",
    "text": "Have been in Pittsburgh for one year. This is my go to chinese restaurant. The food is very authentic and reminds me of home. I especially love the fortune cookie! I come here craving for it. Best Chinese food in town!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B67ZXOT7vmUM7r79sv298A"
  },
  "ZLKrmnan2jztDGLyLi2Wgw": {
    "date": "5/19/2015",
    "text": "One of my favorite chinese restaurant in Pittsburgh! Recommendation : hotpot, boba tea, port intestine noodle",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7mIcSvr7WHdMcDKZy-7xoA"
  },
  "Z--aqxW8cXCJXaAaiW4poA": {
    "date": "8/12/2016",
    "text": "My dish was not listed as described. There was no broccoli in the triple flavor shrimp. And it was$15 plus delivery costs got a very small portion. Not impressed. I've been to China and this is not authentic. Not to mention I'm from NY so have had much better experiences for a much lower price. Go to How Lee in the same area.... It's Americanized but better portions and good flavor.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1w4sjUGI5AMcM3M0MTVIrQ",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. This is the small portion you get for $15",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1w4sjUGI5AMcM3M0MTVIrQ/o.jpg"
      }
    ],
    "user_id": "y6vRJzATy_SI4nXB6v6oeg"
  },
  "i3WitsjH6X_OqP7ahRZ3Wg": {
    "date": "7/13/2014",
    "text": "The best (Sichuan) dumplings ever!  Their authentic menu is quite good too. The big mushrooms in basil and garlic sauce is great.  They have an american menu if you don't feel like trying something new",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "u9vRV4wDWsDkupnZmA3RtA"
  },
  "aqlkQ-4OAsmeKxbdYBKWGQ": {
    "date": "10/10/2016",
    "text": "Don't come here for lunch -- terrible!  When this restaurant opened, I used to come here fairly often for dinner.  I like spicy Sichuan food. But after three bad meals in a row and indifferent service (bordering on hostile), I decided that there were much better options in Squirrel Hill, and haven't been back for a couple of years.  Today I happened to be in that area at lunchtime. Other places were looking busy/slow, so I decided to give Sichuan Gourmet another chance.  Big mistake.  They didn't give me the \"authentic\" menu, and I was in a hurry, so when the waitress reappeared I just ordered the Sichuan Beef lunch special -- asking specifically for \"extra spicy\" -- with rice and an egg roll. Food came promptly, with the egg roll coming later.  This was the worst Chinese food I've had in years.  The small portion of Sichuan beef was just strips of beef in a flavorless brown sauce and a some chunky strips of vegetable, mostly celery.  There was no detectable spice, and very little detectable flavor except for the stringy, nearly raw celery.  The rice was waterlogged and soggy.  The egg roll, when it came, was a thick, doughy, undercooked wrapper, filled with some nondescript mix of vegetables.  Overall, very disappointing.  I left most of it, paid the check, and went down the street to get a sandwich.  The waitress knew better than to ask if everything was OK.  On the plus side, nothing was rotten and it didn't make me sick.  This place does seem to be popular with Chinese students, and I saw some decent-looking dishes going by.  Maybe you get different food if you order in Chinese.  But I won't be going there again, and certainly can't recommend it to anyone else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Re5V4d2hvNIVHLherb5DzA"
  },
  "dAuJeGB4kAl5pf1Emreg6w": {
    "date": "10/9/2016",
    "text": "I had really high hopes for this Chinese food after seeing how many reviews it had I decided to give it a try. I ordered take out General Tos chicken it was sour and soggy, the lo mein noodles where spaghetti noodles with no flavor, and the crab Rangoon was also very sour and not creamy. Additionally if I pay $11 for chicken, I would hope there would be more than 10 pieces. The service was great and I had a pleasant conversation with whomever checked me out but the food was sub par and I don't think I will go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OdGUmH0WlZrEt9Gukt5Inw"
  },
  "oz1lrIuOEMObkyOgUS5tRA": {
    "date": "5/17/2014",
    "text": "I've been living in Pittsburgh for 4 years and Sichuan Gourmet is definitely most recommended place for authentic Sichuan style food in Pittsburgh Area. I personally recommend top 3 dishes which my friends and I often order.   No.1 Chongqin Chicken: all my American, Chinese and even Indian Friends love it. I really like it but won't eat too much(they are fried and I know it is hard to stop eating once you started). I would only eat it on my cheat day during the long week of workouts.  No.2 Tea Smoke Duck: I've tried this dish in many Chinese restaurants and so far Sichuan Gourmet is among the best. I would recommend picking the date when the restaurant buy the fresh duck(you probably need some connections inside the restaurants, be friends with the manager:) ).  No.3 Pork Shoulder in hot source: when I was a kid, my mom often cook pork shoulder for me, I really enjoy the soft texture of the meat. After I came to US, it became my personal favorite dish in Sichuan Gourmet. However, I would not always be able to order it: sometimes my friends don't eat pork, sometimes this dish is too much for 2 people. I highly recommend order this dish when you have more than 3 people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "2j6jfLpcYdffifgKDj_OwA"
  },
  "dOU-jDDJCwGp27VBDT3HkA": {
    "date": "2/1/2014",
    "text": "Arrived at about 1pm on the Wednesday. The place was empty, which should have tipped us off, but it was too cold to keep walking down Murray!  Our waitress was courteous, but not terribly attentive. We ran out of water more than once and getting our check took longer than it should have. Not that big of a deal, since we didn't really want to get back to work anyway. We did have some problems ordering as our waitress was initially confused when we asked to order from the main menu during lunch. The front of the dinner menus has a few blurbs about the lunch specials and salads that come free with dinner and deals that are available when dinner is ordered, but the waitress didn't know what any of it meant, so we never did figure that out.  We ordered off the dinner menu because the lunch menu lacked descriptions and looked pretty boring. We ordered scallion pancakes, cheese rangoons, a chicken dish w/ vegetables, and the braised tofu w/ vegetables. The cheese rangoons turned out to be crab rangoons, which was very disappointing to me, but my companion said they were okay. The scallion pancakes were also okay. The entrees we ordered were delicious. The tofu in my dish was great, the veggies were yummy too. The chicken dish was ordered very spicy and that is apparently exactly how to arrived. Not a fan of chickens myself, I had to take her word for it. The vegetables in the dish were not exactly what was in the description on the menu, but my friend had no complaints.    Despite the slow service, I was all set to come back to this place and order that braised tofu again until I stopped by the restroom prior to leaving. It was just gross. Not the kind of gross that could maybe be explained by the last person being a pig. It was the kind of gross that comes from not being cleaned in a very long time. The sink looked pretty clean, but it also appeared to be one of the newer items in the room. There was grime on the walls, the floor was disgusting, it smelled bad, and the garbage can in the stall was the stuff of nightmares. When restaurants can't be bothered to scrub the bathroom every once and while, I'm left thinking they don't scrub the kitchen terribly often either. I swear I'm not a germ-o-phobe, but I will never go back.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "kXTtha5cufwobFQDnEIqsg"
  },
  "Peo721JFrMob4S1oGcVQ7g": {
    "date": "3/30/2014",
    "text": "I come here often to get my spicy sichuan fix. The food is authentic and always brings me back to my time spent in Chengdu.  The Chengdu sliced pork belly is a plate of fatty oily heaven. The sauteed green beans and dan dan noodles are also a must.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "cSor__Fn0xKhOtCdkGuiog"
  },
  "5Z4F7uT4dy2A8_6KRKykJg": {
    "date": "1/1/2014",
    "text": "I would hate to complain if I felt like we simply ordered poorly, but this experience struck out in every way:   The waitstaff took entirely too long to address our table when many other tables around us were being seated and served. We ordered three dishes (steamed vegetables, vegetable lo mein, and kung pao beef) and tea. All three dishes were seriously not good, to the point that we left them on the table untouched. [How do you ruin lo mein?!?!?] I had to prompt the server twice to bring our tea, and we never got refills on our water. We had to, finally, ask another server to bring our check because our server was nowhere to be found.  We will not be back. :-/",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "pGYL8nbOKuIOTt50YUfOwA"
  },
  "hnbNDhlTQhOefcz80VSDZQ": {
    "date": "1/28/2016",
    "text": "Went here for dinner and it was much better than we expected. The decor is nothing special, but the service was friendly, quick and helpful with suggestions. I liked that there was a separate American menu. Absolutely loved the hot and sour silk tofu. I will definitely be returning.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8BTwIfYNAYSl1bLXs6XnHA"
  },
  "Gr5fzMkS_AwEVUv1-v88Rw": {
    "date": "6/25/2016",
    "text": "Bleh....coming from Philadelphia area and having been  to a very   good  Szechuan restaurant in dc once..the food here isn't that good and all...  come on Pittsburgh this is your most  authentic?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ZcVrYUzhLA_vhNcUj3DVg"
  },
  "JnvvsK6PY_HJe8GTFNpq2w": {
    "date": "3/12/2014",
    "text": "Went there many times, and I still love it and have never been disappointed. As a person originally from Sichuan, the food served at Sichuan gourmet is absolutely authentic for me. Sometimes, I can even hear cooks talking loudly in Sichuan dialect. Advice for Non-Chinese: forget about the General Tao's menu, be more adventure, and ask the server for recommendation on the menu with Chinese if you have problem ordering.   I would say, start from the appetiser if you are too concerned.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "mr98N3IY3bS6D4Fp81t-bg"
  },
  "gtg0bWYdSV-LmZu-1qmjKg": {
    "date": "7/7/2017",
    "text": "All dishes we ordered are very authentic Sichuan food.  The quantity and quality matched with the price.  It is worth to come back again to enjoy delicious Chinese food here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bifxFMZq9E9uMpEtdYngmw"
  },
  "-RNxkZFbwUe23Vcr83SZaA": {
    "date": "10/20/2013",
    "text": "What happened? Came here in summer and dishes were delicious, but subsequent 3 or 4 visits have been meh.  My boyfriend loved the Amazing Chicken the first time he tried it. It was crispy and lightly coated in a subtly sweet sauce. The couple of times we came back to satisfy his craving, the chicken has been soggy and drowning in a frightening amount of sauce (even though the last 2 times we requested \"light sauce\").  I loved the beef noodle soup the first time I had it, but the quality of the beef they have been using in the soup is atrocious. Last time, only 1/3 of the beef chunks were edible. The rest of the meat was either too tough/chewy or too fatty.  Don't know if I will be back.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "g7S7fGfZC9ow_wIsK848MA"
  },
  "oKohw7g9F8p2XX7noUMBDQ": {
    "date": "6/14/2016",
    "text": "Whenever I come here, I buy multiple dishes to eat and bring home with me. Come here if you like authetic chinese food. Delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_LTJtwiPtUVskCh7bEL13Q"
  },
  "3NfxR-Gq4AmtYrpG2seE7g": {
    "date": "8/16/2011",
    "text": "Nom Nom Nom Nom ...   This place is delightful!  As a hardcore Thai fan I frequently shun Chinese food.  Mostly because I feel the bland ameri-chinese is greasy and unsatisfying.  This place however blew me away with their authentic Sichuan food!  Who knew Chinese food was this good!  Damn those restaurants that try to placate the American palate!  The millions of dried red chillies that were scattered through a pan of flaming fish, calling to me with their flavorful, spicy, and tender meat that had layers and layers of flavor.  This place is just around the corner from us, so we'll definitely be keeping it as a go to.  Tip - You'll have to ask for the Sichuan menu, they won't automatically give it to you.  Also the servers will give you plenty of tips on what is good, and what are the most popular dishes that people order.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "cQ81MDLuHzM4-aEklDK0Nw",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Flaming Chicken &amp;amp; Eggplant in Garlic Sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cQ81MDLuHzM4-aEklDK0Nw/o.jpg"
      }
    ],
    "user_id": "3KkT6SmPFLGvBS1pnDBr8g"
  },
  "aTv3ot9wqyAPMFgemeHhmw": {
    "date": "2/18/2016",
    "text": "One of the more authentic Chinese restaurants in Pittsburgh. Luckily they are not the only one (Jade Grille in Mt. Lebanon also boasts many authentic dishes). As a vegetarian there a plentiful options and each are prepared to spec. I love numb peppers and this place uses them! Lots of options for all types of diners so meat lovers don't fret. The space is at best dingy, but clean. I've been in a lot worse in Chinatowns around the world! Worth checking out if you are in Sq. Hill and hungry for authentic Sichuan cooking.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mIyOekSeriEs7kZ9UHGF6Q"
  },
  "lcqwpHBDehodhcwTOPUdVA": {
    "date": "2/28/2018",
    "text": "I ordered Chinese from Postmates and the food is so great. The quality of food is super good and priced so well. I have tried a lot of places around and this one is my new fave for sure. !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2rJ6o3ee0EPf3gBuBMGfYQ"
  },
  "v1k3ZV5OxsaBkxPYdmrx0g": {
    "date": "11/25/2016",
    "text": "I really like this place initially, but for the past few visit, we had this short hair middle-age waitress that is very unfriendly to her customers. We had to wait for a long time to be asked what we want to order, and our water never got refilled, we have to ask for napkins again and again because each time we only got a few piece of bar napkins.   We normally tip waiter/waitress at least 20% and we have to tip her 12% to discourage bad attitude. As working in service industry, being just a little bit more friendly is doing for your own  good",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cSueM6_er4EA2F949Wja9A"
  },
  "6mL-_MTLt4RzwPHDwuz0jw": {
    "date": "4/30/2016",
    "text": "I always come here for dinner with my friends. This is a typical Sichuan restaurant. The spicy pickle fish is my favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OgcwtR4BiRK2GheIK6odPg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OgcwtR4BiRK2GheIK6odPg/o.jpg"
      },
      {
        "img_id": "56RSjUE-_iaZh81QAnr4dg",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/56RSjUE-_iaZh81QAnr4dg/o.jpg"
      },
      {
        "img_id": "iGfBwywdLajKSYPeo76ygA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iGfBwywdLajKSYPeo76ygA/o.jpg"
      }
    ],
    "user_id": "g-LCK3ozEvX-a8SVdcK8yw"
  },
  "yDNUpN50Ucm8_k5Xq2KOqA": {
    "date": "12/22/2015",
    "text": "Love the authentic Szechuan cuisine as well as range of American chinese classics for those who want them.  Had my rehearsal dinner here! (Small group of 12 with chinese banquet style, they were very accommodating and easy to work with)  Veggie favorites- I love the fresh sauteed snow pea leaves (pricey at about $14) but my favorite veggie side because of their light flavor and freshness. I also love the eggplant in garlic sauce, very generous servings and just enough spice.  This place can definitely be on the spicier side but my mild spice husband loves the cumin beef and the dumplings.  Service is fast and efficient. Orange slices to end each meal :). Great neighbor Asian fix. Atmosphere is so- so with white paper on tables but overall homey with good lighting.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WQDG1_b28izxQgj061FD2Q"
  },
  "aPTMj11ceswNaxMv66EAKg": {
    "date": "12/19/2015",
    "text": "So I love the food here. I always order from the Chinese menu because, well, I'm no dummy. It's full of traditional dishes and I'm always discovering something new that I love. Whenever they have Chinese broccoli on hand, that's my go-to side for whatever spicy main dish I'll be ordering.    Dining in is a fun experience and it's nice to be able to bring wine and not pay a corkage fee. The environment is busy, but very comfortable to relax for awhile and enjoy the meal. The lunch specials are a GREAT value during the week.   I usually order delivery though, which is why I didn't give this 5 stars. For some reason, I ALWAYS have to tell the delivery folks to come to my apartment building instead of me coming out to their car. It's an odd problem and it's consistent. Still worth it because I just love the food that much.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8sSu2zx6fK5nCSUrOiYUSQ"
  },
  "bhBdFsjc8_as6Sf4VVynbA": {
    "date": "8/25/2013",
    "text": "I've not started eating but just looking at the menu is making me deliriously happy.  SG, how did I miss you?!  Food arrived.  It was authentic (we just got back from china--this was better than some places there), the service was fast and efficient, and it was delicious.  You can order 'Americanized' Chinese or go authentic--either way, you are in for a treat.  Ordered:    -smoky pork belly with seasoning and tofu  -Sichuan style dumplings -beef trip & tongue in chili oil  -dan dan noodle -pan fried hot peppers",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "viMEMVXQExcexc7ctpRdCA"
  },
  "3men30JVAndKrGDXai0L7Q": {
    "date": "12/14/2016",
    "text": "Favorite Chinese place in pittsburgh. Definitely eat in though because the portion sizes for take out are much smaller. Our favorite is E01 (spicy boiled fish), mapo tofu, and chonqing style chicken. They give you orange slices for dessert, which is nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0o982U53lhwbVDuPPlBiA"
  },
  "OWxr2EaRR-4xqVzvZwKbaw": {
    "date": "2/3/2016",
    "text": "Food: 4 Ambiance: 1 Service: 3  We eat at the Squirrel Hill location all the time to get our spicy fix. It's great food that keeps us coming back!  Ms Beffrey loves melt-your-face-off spicy, whereas Mr Beffrey likes it a tad more on the human level. The menu has items that spans the spectrum.  Our new favorites are the Snow Pea Shoots, which are tender greens quickly sauteed and salted. Tasty but on the expensive side given its simple preparation. The spicy chicken in chili peppers is a must try if you can tolerate it. The chicken is fried and crispy, though beware the dish looks like it's 90% chili pepper (edible though!).  We highly recommend the Mongolian need, which is a different more numb-y kind of spicy. Packed with flavor.  Ambiance is a typical Chinatown-y feel -- pleather booths, unflattering lighting, loud, really nothing to set any sort of mood.  Pretty on par with 99% of Chinese restaurants.  Service is similarly Chinatownesque: fast, erring on the side of brusque, sometimes you get a little overlooked in the hustle and bustle, but (in True Asian fashion) generally very efficient. Don't come expecting to have a pampering experience.  Love the food here, which is what prompts us to come back time and again, though we do almost only takeout now.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "l-2IShe20fTfmvShKQUvoA",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Mongolian beef, highly recommend (if you can handle the burn)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/l-2IShe20fTfmvShKQUvoA/o.jpg"
      },
      {
        "img_id": "sTuayhFdJbNYWrsvCTSP2Q",
        "caption": "Photo of Sichuan Gourmet - Pittsburgh, PA, United States. Fried diced chicken in chili peppers - so good!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sTuayhFdJbNYWrsvCTSP2Q/o.jpg"
      }
    ],
    "user_id": "aX5fuSb2qH6BWjXppD4FsA"
  },
  "-yXtd5glj8lhi2he9RbOhQ": {
    "date": "2/5/2018",
    "text": "Terrible service. I ordered food home and they sent the wrong chicken and took 2 hours to deliver the correct one. I called them twice and in the middle of the conversation they hung up on me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5JwxHtNFI0xx_Ujwt-w_Nw"
  },
  "Qkmy4mCHOBGX2JH7NFO2AQ": {
    "date": "12/31/2016",
    "text": "This is a good little spot for Chinese. They recently remodeled the place. I love how they always have the Yelp coupons! Staff is friendly and the atmosphere is nice. I like how they offer online ordering. My personal favorites here are General Tso's and Beef w Broccoli. Also the location is prime... right on the 61C bus line.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cUUCMncwWZm57s95iUX1Gg"
  },
  "JFUyOftJ_fKo84G0YG8Ztg": {
    "date": "11/26/2016",
    "text": "We had a great dinner with extremely fast service on a busy Saturday night. Ask for Qin when you stop in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UfyghIE5QfYhSN6uGp4MXA"
  },
  "bUkjzrACRf_Gbxuc92udqQ": {
    "date": "4/20/2017",
    "text": "We ordered online from Beyond Menu.  They apparently cancelled the order because, although according to the app we are within the delivery area, the driver disagreed.  Although they had both my phone number and my husband's, no-one bothered to contact us.  It was only after I waited for more than an hour and checked e-mail for status that I discovered it had been cancelled.  So here I am at 8:30 at night without dinner and royally pi**ed off.  I called BM and was basically told so sad too bad.  No help from anyone.  I will not be frequenting this restaurant or BM again.  Chengdu Gourmet will get my business.  I know they deliver to me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ybNUo2YvdPTpiM7RfM48nA"
  },
  "jathr6xiZa07pVlIU9ekMg": {
    "date": "10/8/2017",
    "text": "It's so great to get authentic, fresh, home made Chinese food.  Courses are city priced about $13-$15 each but good sized portions.  Started w the egg roll.  Fresh, crispy and home made.  The pan fried dumplings were the same.  I also got the dried chicken that is pictured numerous times on yelp.  That was delightful and different.  I love that they aren't shy about making spicy food and using hot peppers. I'm sure I could have increased the intensity but the rest in my party don't have a high tolerance.  Still, they enjoyed that chicken entree(which we requested as an appetizer) just picking around the peppers.  The 5 spice beef noodle soup was great.  Maybe you can ask for extra small bowls to share.  It was a lot for one person but I'm not complaining!  The last 2 dishes were shredded beef w peppers and chow fun.  Excellent portions and taste.  All of this for the 5 of us.  Saturday night seating time took about 10 minutes at 745 pm.  I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t6cvXZrt7M9kRWpOHgL5VA"
  },
  "pJ1SbjBqQFMnohNyObo15g": {
    "date": "1/11/2015",
    "text": "I have passed by this place several hundred times a year , and never stopped here, UNTIL TONIGHT ! I was very surprised and impressed at the extensive menu.This restaurant surely has something for every taste.  I decided to try the 3 pepper chicken. I like very spicy food and this dish hit the spot. Not only was it delicious , but it even filled my big tummy. Excellent staff , very fast & friendly. Very authentic and enjoyable. Sometimes you just have to treat yourself to the best. I recommend treating yourself to Sichuan Gourmet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "67IMqiMGTTlobnDMEWszmw"
  },
  "MeRJtdRT0TognxHAt53j0w": {
    "date": "12/29/2014",
    "text": " - E.04 - or as they say in English, fish fillet in spicy broth, CHONGQING STYLE  ...   Anyone who doesn't like it, please consider not eating chinese food (ever again).. it's not for you.. !",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "wjRMUQunGJnHO55GIrHeyQ"
  },
  "8iExE2LdcE6LPIkluIk0Ug": {
    "date": "10/23/2016",
    "text": "We had a delivery.  The food just wasn't good. We didn't like the seasoning and the taste of the dishes we regularly order every time when eating Chinese food anywhere else. Additionally I ordered a soup and got a big box of noodles but no broth . Just a container with a little bit of seasoned minced meat (tasted really good) . I called the restaurant to tell them they didn't send any broth and they told me that this is the dish. This definitely wasn't a soup. Overall it was a disappointing dinner.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mq7Idkasiq10B2XvIa6B5Q"
  },
  "upO0v1xwhOQ43yB4BX1izg": {
    "date": "7/25/2014",
    "text": "Yum!  My dad and I wanted to plan a quick adventure into Pittsburgh, and wanted Asian food while we were in the city.  My friend the lovely Angel I. (currently of Washington DC) recommended Sichuan Gourmet and the Squirrel Hill area, which was a very good choice.  There's an easy paid parking lot behind the building, and there were a bunch of open tables available at noon. Our server wasn't the fastest, but she was very nice and quite helpful.  They have a huge menu, including authentic dishes, Americanized items, and a lunch menu.  All seemed pretty reasonably priced.  We tried: --lunch combo hot and sour soup: delicious, if thinner and different than most I've tried in the past.  It seemed to be a thinner broth with less cornstarch, and had mushrooms and more vegetables.  Very good. --lunch combo fried rice: great as well.  more vegetables than most, and not greasy or dry. --sichuan dumpling in red chili oil: very hard to eat with chopsticks, but great-- tasty filling in a very spicy sauce. --Mongolian beef, extra spicy: my dad ordered this because Mongolian beef is his favorite, and he doesn't get Chinese too often.  This was delicious.  The beef was perfectly cooked and they nailed the \"extra spicy\" request.  He had plenty of heat without losing any flavor. --Chicken and eggplant with spicy garlic sauce:  actually one of the best Chinese dishes I've had, ever.  The eggplant practically melted in your mouth, and the sauce was spicy with the sweetness garlic gets if you cook it just right. So good.  I'm not sure when I'll next make it out of Greensburg, but I might have tovisit Sichuan Gourmet when I do!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "L9ZJpCQgXzfNXiJI9ahyZw"
  },
  "j7kKUR6qRPXfpuLoUXzDlA": {
    "date": "12/28/2014",
    "text": "I have tried many Chinese restaurants in Pittsburgh. Sichuan Gourmet is the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oEYcjAM2QGlPSJvuMQlYtw"
  },
  "-A7hn29K0ZGZOomWyetTWA": {
    "date": "10/17/2015",
    "text": "Great very authentic food I come here all the time and all the real Chinese are there. We ordered a seafood dish, a vegetable dish, and a noodle dish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-7h_DWxh4ubTAjWIwW--Ow"
  },
  "zk73_k3lLOFj-o128wF5Rw": {
    "date": "3/22/2015",
    "text": "Hesitating between 4 and 5 stars. Definitely a wider spectrum of choices compared to all other Chinese restaurants in this city. Price is the reason that prevents me from visiting every single weekend. With a larger group of people this place would definitely be a top choice as their portion is good. But 1-2 people? Maybe I'll try the other two places in squirrel hill as they have appetizers and dishes that are less generically Chinese.  Sichuan style, which means spicy food here is decent in general. They do have some choices that are not available everywhere else, like frogs, special types of vegetables. And if you do not have a high spice tolerance, no need to worry here. They adjusted their dishes well enough to satisfy both Chinese and American customers.  (A second reason this is not my personal favorite) Milder dishes are also available. Spicy fish dishes are normally fresher compared to other places and I strongly recommend them. Pork dishes are also very nice.   Can be crowded and loud on weekends. But they do accept seat reservation (as far as I can remember). And they have two private rooms for larger groups. These rooms can be combined and is large enough for a group of around 25. Might need a while for food to be ready (same for most Chinese food), so if you are going starved either get appetizers or more dishes. One dish per person is usually enough.  Try it and I hope you will love it as I did!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "49GlLnhi2d8YbbR6tzDFUQ"
  }
}