{
  "HcM4vKGGCgo46zmJLJ152Q": {
    "date": "9/22/2014",
    "text": "After seeing all the good reviews and seeing the sign saying they have been featured on Diners, Drive-ins and Dives we were pretty excited to try this place. We had attempted to try out Waffles INCaffinated, but the wait was 1.5 hours.  We ate here on a fairly busy Sunday morning, there was no real room to wait while they were cleaning the table, and every time the door opened the cook?/owner?/maybe manager? would yell \"CLOSE THE DOOOORR!!!!\", as loud as he possibly could.  When we sat down, it took at least ten minutes for someone to come give us menus. I ordered coffee (the menu cites only one free refill ,which is weird). The breakfast menu was way smaller than anticipated. If you don't want eggs for breakfast, definitely don't come here. Our order was fairly simple (as there aren't many options), but our food took at least 45 minutes to come. When it finally did, it did not all come together but rather very staggered over many ten minutes or so. I got an egg english muffin sandwich which was extremely comparable to what I could have made at home. Does not come with anything...Nothing was remarkable.. plates, mugs and silverware did not exactly look the cleanest. There was definitely some crusty stuff on the rim of my coffee mug.  Annnnyway, wasn't thrilled. Prices are VERY cheap, but you get what you pay for...Will not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "et62V-QAUVHTtj6XMq8AUw"
  },
  "H-dzCs0wvwpkt85S8zOqlw": {
    "date": "4/30/2015",
    "text": "definitely the bar experience. Something you have to try at least once.Stopped in for weekday lunch. Husband got the roast beef and mashed potatoes and liked it. I felt the gravy was a bit artificial - the kind that makes you want to keep eating it.  I got the chicken parm over pasta. The chicken crust was crispy, sauce was good but nothing special. Service is slow (busy) but good and friendly. Definitely a place to come and watch people. Do not bring children. There is only one table with actual chairs, then there's seating at the bar, and a few bar tables with backless stools. Small and dark - exactly what you would imagine for an old neighborhood bar except it is smoke-free.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7oysdaETNb4cOOH-K0bDTQ"
  },
  "g-sgwxN-DTN_v-FLr7Oycw": {
    "date": "2/18/2012",
    "text": "The bartender, was nice and friendly and accommodating every one in the joint was friendly.  Two drinks came to $5 not too bad for the Southside.  Where just one drink can easily cost you $5 or more.   This bar/restaurant was filled almost every seat was taken which is a good sign on a Saturday afternoon.  They're doing something right.   We only stopped for drinks here but the staff made a very good first impression on us.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "V7uS5US4oTf-S9u36HJQCQ"
  },
  "uYKm84xSSIgDYoDjGKBITg": {
    "date": "7/9/2012",
    "text": "Far and away my favorite bar in Pittsburgh.  The food is incredible (the hot roast beef sandwich with homemade red skinned mashed potatoes is my favorite) and the drinks are ridiculously cheap.  The staff is always super friendly.  Plenty of TVs for watching the Steelers.  I have been coming here for years, and having moved to LA last year, I miss Nadine's more than anything else in Pittsburgh.   I couldn't ask for more from a bar than Nadine's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wj9cUg8yiBcPpVXEJ8I24w"
  },
  "UPRYDvhntxZQSNBi-Wdn1Q": {
    "date": "8/15/2012",
    "text": "Food - 5 stars: I went here because I saw it on Diners, Drive-Ins, and Dives. I will say, it was on Food Network for a reason. The food was fantastic. I wasn't even that hungry and finished everything I ordered. I had wings and Mac and Cheese wedges, which I recommend, especially the wings.  Price - 4 stars: The menu said 50 cent wings, but I ordered a dozen and walked away with almost a $20 bill? Something was off, but I didn't stick around to check it out, since there wasn't a detailed bill and I was in a hurry. Otherwise I believe the place is very cheap.  Service - 3 stars: There was only one guy working the bar and the food, so it was hectic to put in orders. He was very nice, but he never came to our table and just shouted at us over the restaurant. Kind of odd.  Atmosphere - 2 stars: A dive is an understatement. It was by far the smallest place I've ever been to. There wasn't any room to walk, let alone sit and eat. My bedroom is larger. And in-restaurant smoking laws aren't in effect in Pittsburgh? Who knew.  Overall, I'd recommend this place to anyone who is willing to ignore the poor service and tiny hole in the wall, for some awesome food and drink. I'd go there again, just for take out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nG80HtApQ0DL5PU8gYo9cA"
  },
  "0VmQyiHIhGAkAKdYsYu4Dg": {
    "date": "7/9/2015",
    "text": "Awesome hole in the wall bar/restaurant in the South Side Works area. It's a nice change from all the other restaurant options in the area. Great food, and very friendly people working there. I always try to order something from their specials of the day and they are always great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WP9e2YqFJRX_qIy_ThVkow"
  },
  "XZDvQhytA9WwUjBGQaNnAQ": {
    "date": "7/31/2016",
    "text": "Nadine's is quickly becoming my favorite brunch place in Pittsburgh. It has traditional bacon and eggs and good iced tea.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YbQJXXZlDy1q1HzgIyFU3w"
  },
  "M2DTVGAIabInIPlNHgba6g": {
    "date": "10/23/2013",
    "text": "My husband and I had to be in Pittsburgh last week.  We had a hotel on the Southside.  I remembered that Diners, DriveIns and Dives had been to a Southside place.  A quick Google later and I came across Nadine's.  We decided to head over there right after the usual lunchtime on a Thursday.  The locals were all there but we were greeted right away and given great service.  As you do, we each had one of the Specials.  A roast beef for him and a meatball hoagie for me.  His roast beef was too die for!  Openfaced sandwich, smashed potatoes all covered with beef gravy.  This is the way we both remembered eating it growing up.  The meatballs were gigantic and super tasty.   The fries are fresh cut with the skin still on and they were crispy like they should be.  We returned there the next two days.  By the third trip, we were family.  My husband is from Pittsburgh and worked on the Southside during college so it was old home week for him.    Between the great food, camaraderie and super low prices, this place is worth the visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "9lhZd8oHmdpHI-narT6pOA"
  },
  "l_gtrELh9_X1cff-SgjGWQ": {
    "date": "1/12/2014",
    "text": "As a local SouthSider, I'm giving Nadine's five stars for being exactly what it intends to be: a local spot serving up good, solid pub food in a very friendly neighborhood environment.       Living right around the corner, I can't imagine a better spot to chow down on a traditional American breakfast. If you want carving stations and mix-your-own Bloody Mary bars, go elsewhere...but if you crave a real eggs, toast, sides & good coffee spot, accompanied by a real SouthSide atmosphere, walk right in and grab a seat at the bar.       I set the bar high for breakfast, knowing that while it seems so basic and effortless, it's also often a disappointment when eating out. Not so at Nadine's. Stopping in recently, during the Polar freeze, I had one of the best \"regular\" American breakfasts that I've had in ages. Sunny side eggs done perfectly! Not an easy task, thanks Matt! Paired with perfect toast and a luscious slice of ham...I was happy! My friend's over medium eggs were, again, prepared just right, with a side of what she proclaimed to be \"the best bacon \" she's ever eaten. Your basic American breakfast..but done so well..a treat indeed! Couple that with the friendly conversation at the bar, and if you're really lucky, a visit with the charming Miss Nadine herself and it's about as perfect a Pittsburgh neighborhood experience as you're likely to find.      If breakfast isn't your thing, don't hesitate to try any of the daily specials being offered...from homemade soups, sandwiches from the grill, and strong favorites like a killer hot roast beef or spaghetti and meatballs, you won't be disappointed. Portions are generous, the prices are right, and you can settle into a conversation about the Steelers or Buccos before you've even settled in your seat...A real gem on the SouthSide.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "AMEEmwStgP_OBGwAL-tO4A"
  },
  "A5_2gDY7cXyePSl9GsKQgQ": {
    "date": "6/2/2011",
    "text": "Take a dive into Nadine's.  Fun little bar...smoking-OH NO!  But no one was smoking when we were there.    Had lunch with a few regulars that were lots of fun and watching sports on the many TV's.  Service was friendly but tended to skip us for the regulars.    This place has some neat specials and sandwiches.  Ordered the Fried Bologna with peppers and cheese.  Delicious!!!!  If you haven't had a fried Bologna, you need to give it a try!  Friend had the hamburger which looked to be homemade, not a frozen patty and declared it to be delicious and cooked perfectly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 12,
      "cool": 11
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "B18rQPnnjrStcvtXos-P3A": {
    "date": "12/11/2014",
    "text": "This place lives up to the hype.  This small neighborhood bar is definitely worth visiting.  I've been here for both breakfast and dinner.  Not only are the drinks and eats reasonably priced, they taste amazing.  I must suggest the mixed grill in the mornings and the bacon is top class. Say hello to Earl if you stop in early! If you go in the evenings you must try the meatballs. Crystal is one of my favorite bartenders in the southside so be sure to stop in and ask for her!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C_yxM4XqJ3AVDGlBp_6D3Q"
  },
  "9D5SRz7kgdcgWP5nwXiayg": {
    "date": "9/25/2010",
    "text": "If there is one place that exudes old school Pittsburgh it is this great diner that has been featured on Guy F's \" diners, dives and drive-ins\". Besides being one of the best spots for breakfast in Pittsburgh's Southside it is also a rowdy football bar with plenty of yinzers clad in gold and black yelling for and about thier Steelers.  The mixed grill is a consistent winner and if Nadine has her stuffed peppers available they are a definite winner. The specials change daily and her casarols are unique and tasty.  If you go on a weekend you are Likely to be served by Earl the bartender-chef-dishwasher and bouncer.   A little smoky but a unique taste of local Pittsburgh flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PoeWkqengXggK4yS-0fZjQ",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Steeler Sunday at Nadine&amp;#39;s",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PoeWkqengXggK4yS-0fZjQ/o.jpg"
      }
    ],
    "user_id": "KX0U40FdEvUmr2chL2d7ww"
  },
  "IjozIQCU0l_scqil6q93Xg": {
    "date": "2/15/2016",
    "text": "I have been to Nadine's a couple times before.  The first time I had fine service and the food was good.  The second time the service was slow, but nothing to write home about. The good was good.  I went to breakfast there on Sunday, February 14 at 11:30 am and the service was abysmal.  As soon as we sat down, it took about 5 minutes for the waitress to take our drink orders - no big deal - but 15 minutes later she asked if she'd ever brought our drinks (she hadn't) and finally brought us menus.  The place was full, but not overcrowded.  10 minutes later we got our drinks and she took our order.  So at this point we'd been there for 30 minutes.  When we got our coffees we realized we had no spoons and no sugar.  I couldn't find our waitress so I waited at the bar for 5 minutes before the other waitress/bartender noticed me and I could ask for sugar and spoons.  She seemed annoyed that I was asking, and I asked very politely.  At 12:35 - more than a full hour after being there - we still didn't have our food.  We suspected it had been made, but our waitress was ignoring that it was sitting out and ready to be served to us.  We didn't order anything complicated.  At that point, we called it a bust and left - by the time we left, it was 12:45.  We'd been there an hour and 15 minutes and no one served us our food.  Our waitress never came by to even check on us so it's not like we could have even asked about our food.  The couple at the table behind us had gotten there 15 minutes after us and left (with fully bellies and empty plates) 15 minutes before we did.  I'm not sure what we did to deserve bad service and no food, while we waited calmly and patiently for over an hour.  If you want to wait an hour for mediocre food, this is your place.  Otherwise there are plenty of other great food places with great service for breakfast in South Side and beyond.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JswXx1-subdh8g1O78YOpA"
  },
  "0Zz23FP9r58BbCZRaralAw": {
    "date": "6/20/2014",
    "text": "Fried bologna sandwich is a winner!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zLDeirzuAVqNoNCgaJr4MA"
  },
  "fw_QTcqLfl28DzYzgP3uOw": {
    "date": "10/16/2013",
    "text": "Loved every bit of the atmosphere!! I love dive bars and I wouldn't really consider this one of them. It's got better food than most restaurants in the area for half the price! I think they have the best chicken quesadilla on the planet here. Definitely a must visit in this area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-0-GK_g5BKPBrcf3PvloWw",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Bar/kitchen! So unique. Love it!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-0-GK_g5BKPBrcf3PvloWw/o.jpg"
      },
      {
        "img_id": "_GFqEff7aMHVloBJvdOe5w",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Best chicken quesadilla ever!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_GFqEff7aMHVloBJvdOe5w/o.jpg"
      }
    ],
    "user_id": "yOLEf0Tx6xbkB7sqcfFOeQ"
  },
  "H2_62eLblWTPw0n0eWveiA": {
    "date": "7/23/2013",
    "text": "Found this place through Yelp and I could tell I was gonna love it before I even got there. Got my day started right with egg and cheese on an English Muffin and an Irish coffee. It's spots like this that are the reason I love not only Pittsburgh but PA as a whole.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lvpu1Pdiz0SsFLPMbfdJVQ"
  },
  "NC4Dl6_Y_nWp3_TGHEbqZQ": {
    "date": "1/16/2012",
    "text": "Off the main drag, Nadines sits on 27th street on the slopes side.  As far as I could tell, it was the only bar on that street.  It sits sorta randomly, that once I turned in the street, was surprised to see it right there.  Street parking was very easy - but not sure how that would be on a weekend night.    I will admit when I walked in I felt totally out of place.  At first I thought I was the only woman in the establishment, but then I saw about 3 other women in the joint.  It's not that big of a place so the fact that I had a hard time spotting the women should tell you how many men were in that place.    I didn't get any food, but I tried my friend's fries which were tasty.  I got a tangueray and tonic and it was perfectly made.  Oh and huge bonus it was $2.75!!!!  I was in total shock by the price.  So the drinks are really affordable and from what I heard the food is good.    I would have rated this place higher b/c I like the feel of the bar and it's totally divey nature, but there was smoking which turned me off.    Once I got settled in, everyone was really friendly.  Not sure that I'd go here again, but I'm glad that I checked it out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NnrCwpS1i5mZtkGGzmIk0g"
  },
  "qwnD4PPVS8YHa4UcI-Cm0g": {
    "date": "4/7/2011",
    "text": "Call me slow for not checking Yelp before going there, but since I has first seen Nadine's on Diner's Drive-ins and Dives, I assumed it was a family restaurant. After walking quite a while down the strip district in the freezing cold with 2 kids, I discovered that Nadine's is actually a bar. Kid's can't go inside. Unfortunately for me, this meant I didn't get to partake in the goods.  For those wondering about the rating - Yelp doesn't give an option to provide feedback without a rating so I put mine smack dab in the middle.   So, for people with kids: Don't even try. Go back when you are out with some friends.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ireXTpAJwUchkC71J-qoQ"
  },
  "eQoavCe5kBQz7WtwF7f-ag": {
    "date": "12/25/2015",
    "text": "This is the coolest place!!!! The owner made us our food on Christmas! Such a hidden gem...or not so hidden due to the great location. Quick, easy,cheap, and so much fun!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rwcigxZpk-rNebb3I9i94w"
  },
  "-uldTzhJINrVtCUqEjJyvw": {
    "date": "6/22/2013",
    "text": "Found this gem on Yelp and the Food Network. Driving across the country, my bf and I wanted to stop at some of the best eateries on our trek to the East Coast. Nadine's was one of the best stops we made.  We both got their famous roast beef and mashed potatoes and gravy hoagie and a beer for $2.75 a piece. The food was the perfect portion size, perfectly hot and juicy; filling but not too filling and at just the right, cheap price $17 for the both of us. The staff were friendly and made conversation with the both of us the entire meal, offering more drinks, but we had to refuse due to time restraints.   It's a whole in the wall joint with delicious food and great hospitality... definitely a stop for me every time I'm in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u02-PKd3OFizJOENzPDY9w"
  },
  "qxXdO1N0YfXvT4F7LW4lkg": {
    "date": "7/9/2015",
    "text": "Had the Rueben, Roast Beef, Mashed Potatoes, provolone sticks & jalapeno poppers. Everything was EXCELLENT!!! Server / bartender / cook seems to really love what she does :-) Don't miss this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dhNy6MC5OR5K6EGg3hMmpA",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Rueben!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dhNy6MC5OR5K6EGg3hMmpA/o.jpg"
      }
    ],
    "user_id": "syWBPnGLTT6T-Dp5Sjm3iw"
  },
  "EhydFzAHFa3rAl3mMCOCAw": {
    "date": "5/25/2015",
    "text": "Decent food, lots of regulars, nice dive-y atmosphere.   Would recommend: roast beef. And pro tip: get the beer in the bottle, the tap is usually flat.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hnBzgVoRoqLrGVSxO0ilg"
  },
  "9ImoadlJjUptqU8APN_wfQ": {
    "date": "7/27/2014",
    "text": "I have only a few observations:  Breakfast served 24 hours a day?  Breakfast for dinner?  Yes please!  I love breakfast for dinner!  One of the members of our party ordered the roast beef with mashed potatoes.  Ate it all, and wanted more potatoes, so simply said \"can I get more potatoes?\" Five minutes later, he had a plate of potatoes.  This place kinda reminded me of my parents' dining room table, and I love it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "BTKtAXjPHjH5B3xuT4uiIw"
  },
  "13LT6jeqcMsTSxXXGX91OQ": {
    "date": "7/30/2016",
    "text": "I love Nadines, the food is great, the staff is great, but watch out if Courtney is working. Courtney treats people like they aren't welcome Ina place that normally is full of happy faces and greetings. I've spent many evenings enjoying the staff and regulars in this restaurant and Earl, Peeps and Shannon are welcome faces every night. Courtney is rude, impatient, and acts like people are a problem. Not the same attitude I'm used to. Want to give 5 stars, but she has upset the balance.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fceMT7KVfFx25J84S4O8vg"
  },
  "Eraa-3rPgY8QaqzKUzXwcw": {
    "date": "3/17/2017",
    "text": "Just want to start by saying when I went to pick up my take out order and the friendly lady behind the bar told me it was under $20, I thought she had the wrong order. I mean, we ordered 3 full meals and a bisque. I had just gotten 3 chicken tenders and a few chicken wings from a drive thru place that cost me $13 so... Anyway, we ordered the corned beef and cabbage (it was St Patrick's Day) and it was really good. The corned beef was melt in your mouth tender and there was a ton of it. It was also full of potatoes, cabbage and green beans. It was just like my mom used to make...very tasty. We also got a fish sandwich and mac n cheese. The fish was crispy and flaky but the bun was the star. It was fresh and airy and delicious. The mac n cheese was creamy, not dry. The crab cakes were were pretty good...better than what you'd expect from a diner. They had a lot of filling but they weren't dry at all and had a lot of flavor (they came with mac n cheese too!) I really loved the bisque. It has that slight sherry flavor a good bisque should have. All in all, one of the best $20 meals I've ever had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CPuTcFf5TS9VuwZTbSyo_g"
  },
  "VpBrgFAn0TnP5LoHWoa1Hg": {
    "date": "5/23/2015",
    "text": "Wow the place is small,er, cozy. The food, thankfully, was great! Fries baloney with grilled onion and peppers? Oh yeah! Grilled cheese with bacon? It was huge and delicious! Took some of their pasta home, and it was great for leftovers. Only complaint? NO HEINZ KETCHUP. A sin on the burgh!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q4hrjE9Vr-1VcGIYQ-smJQ",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q4hrjE9Vr-1VcGIYQ-smJQ/o.jpg"
      },
      {
        "img_id": "6Kpid8o-iaghNcRY4Kjayw",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6Kpid8o-iaghNcRY4Kjayw/o.jpg"
      }
    ],
    "user_id": "sJtMmQDRJeFyZVmVccy-uw"
  },
  "rcBdR5mpNDgAkJu-JTSsQQ": {
    "date": "7/12/2016",
    "text": "Dirty ,very noisy not just loud ,people screaming across room service is hit and miss, , average bar food",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0cCLtwlET7hbTvEx6AXMKQ"
  },
  "KT0T4WMFcLNImSbsNhj_Wg": {
    "date": "10/26/2008",
    "text": "TY saw this on Food Network's Diners, Drive-ins and Dives (Episode 313 All in the Family), so it was a must-stop. It was a small little stand-alone building at one end of South Side and you wouldn't know what it was except for the neon sign and the banner outside claiming its recent celebrity status.   It's one of those places where you step in and what you see is what you get. And what you see is one long bar with a bunch of stools, a couple of high top tables and a few regular ones, and that's it. It runs lengthwise and sprinkled around are various slot/poker machines. There are a few flat screens and TVs scattered around with the game on.   They have the specials listed right next to the door and Nadine herself was behind the counter, having a smoke.   Which leads me to the four-star status. I just don't like smoke when I'm eating. I don't like it when I'm not eating, but I especially don't like it when I am trying to savor food. I know it's legal and all in PA, but it still ruins the experience. But in a way, enhances it, because you would expect it to be a smoke-filled kind of place.   Anyway, their specials are $4.50 and I had the bowl of chili and grilled cheese sandwich. TY had the meatball sandwich and both were exceptional. The blond woman who took our order was just as nice as can be.    Be sure to stop by if you're in Pittsburgh! Definitely a godsend after eating at Nakama the night before!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "yacIE10ynt-WrJjUT-1Q6A",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Nadine&amp;#39;s chili and grilled cheese sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yacIE10ynt-WrJjUT-1Q6A/o.jpg"
      },
      {
        "img_id": "dW0PLjxBNpxBE-SE7vzziw",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Inside Nadine&amp;#39;s",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dW0PLjxBNpxBE-SE7vzziw/o.jpg"
      }
    ],
    "user_id": "36Vr9BASkR2v9NKNoZtiSA"
  },
  "0QV2y0yzyNd9xcMIIo2O5A": {
    "date": "1/30/2016",
    "text": "Nadine's has excellent service and great food that's easy on the wallet.  A full meal with beers for under fifteen bucks!  Crystal is my favorite bartender/cook in Pittsburgh. She makes everything perfect for me while working her ass off.  Stay away from the creepy hat lady that works Wednesday nights and you'll be fine.   This place still gets five stars because Crystal, Earl, and a Nadine's breakfast overcomes any deficiency from the bartender on Wednesday nights.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-qARpBiDw5Z6Dgg0GEou2g"
  },
  "BxfYgc-ArDrwXqRTCSVaag": {
    "date": "3/26/2016",
    "text": "I have only been to this place one time, and it was for breakfast on a Saturday morning. The menu is not large but that also makes it easy to choose. But what I will tell you is there is absolutely no need for a large menu at this place. The food comes out fast just the way you ordered it and absolutely delicious. This service is great they're on top of your coffee and whatever else you might need. It is also much cheaper then your typical breakfast spots like Pamela's or DeLucas. I also liked the Dive Bar like atmosphere. Not to mention the owner Nadine herself sits at the end of the bar and is very cordial and attentive to her customers. If you're looking for a good quick breakfast and a simple Bloody Mary while not paying Meat and Potatoes brunch prices, this is the spot. It has the potential for the fifth Star once I sit down for lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xyoHoT8K8TGkPG8-RQGgng"
  },
  "G0bAC4B7jBqUJV1iAERmKw": {
    "date": "5/31/2015",
    "text": "Terrible place, Racist Troll Owner and so is her troll daughter who bartends there.  I will never set foot in hear again.  I can't talk about the food or drinks as blacks aren't welcome in there.  So if you wanna get away from us black people, Nadine's is your place.  Yinzer hangout.",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "iAUl8Y6D7e9RNpLjvRCDdg"
  },
  "NH1fjJT7KH_Rng9oWGxT4g": {
    "date": "1/8/2014",
    "text": "It was a very cold day in Pittsburgh on Tuesday- minus 8- but it was a great day to  get some serious chicken dumpling soup at Nadine's.  I went with friends- we all enjoyed the soup I had the Turkey- well cooked not too dry and the smash with gravy was heaven- my gang had fried bologna sandwich  and number #1 selling Roast Beef- It warmed us up- This is a friendly local hot spot that has not let TV stardom go to their heads.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UetOIhAdPBkGjm_o-mSC3Q"
  },
  "DN6XIygLAWve8tkkT7B84g": {
    "date": "6/28/2015",
    "text": "This is a pretty small, nondescript place located off Carson Street--it doesn't seem like the kind of bar that would attract a lot of rowdy activity. So while I was somewhat surprised that it was featured on Guy Fieri's show, it later became more understandable as I saw the friendly and welcoming side of Nadine's. While the place is small, the servers are friendly, and the happy birthday messages behind the bar were fun. The food is great for the cost--everything below $6 or $7, and while the portions are small, they are more than enough and delicious at the same time. The roast beef was indeed sliced very thin and remained tender with the gravy and mash giving it ample flavor. I also enjoyed the country fried steak, another special of the day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "XDepbMT2I583l9Nj7eVGIw": {
    "date": "5/9/2013",
    "text": "Ok so at this point of Cinco de Mayo, it is possible that I would have thought any food was amazing. However, their french fries out of a bucket and microwaved carnival cheese was out of this world good, and I think they had the cheapest drink prices we had seen all day. Good food. Cheap. I'm in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3DltS5Wr9MOntnc8StBFBA"
  },
  "RVfabHoERuBIz_j6ac_lJA": {
    "date": "1/1/2013",
    "text": "I live in the DC metro area, so I am not used to being around people smoking in restaurants/bars.  I hate cigarette smoke, but given the area it's not unusual I will disregard that complaint for this review. Sweet Jeebus I love me some Nadine's.  I love the divey-ness, when you drive by it looks more like a shed than a bar or restaurant.  You can watch your food being made, and they have delish specials.  I had the most amazing fried chicken club sandwich (a special) and my husband had a burger. Food was top notch and very reasonably priced. We aren't in Pittsburgh often, but when were are there, it's our first stop.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "Es2nqEwtjo5anRYgqXLN6A"
  },
  "dLNCFB9yop_ZP8iB1sWjlg": {
    "date": "1/31/2017",
    "text": "Great place for a good, fast, cheap breakfast.  My English muffin sandwich was spot on.  Certainly a dive but good place, and good coffee.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mmoI0-Sc6GKz878pcwwCOg"
  },
  "KTfQcjiR_6SdjrbWnhj2DQ": {
    "date": "11/1/2015",
    "text": "Yassssssss!!! What more can I say about this place other than, AWESOME! Tried this place because I love diners and it was right around the corner from us. I had no idea going into this that it was on Diners, Drive-ins and Dives. Cheap drinks, good people and great food. Meatball sandwich was absolutely wonderful and everything else I saw looked just as good. Luckily, we're here for a few more days. I intend to go back at least two more times to try the other things on that menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BNWdbecdqyk7GhLG3fDWrA"
  },
  "dY3cpq8qSjt3EROq_X0Ocg": {
    "date": "9/24/2015",
    "text": "Good, cheap.  Reminds me of home, good ol Fayette county.  Seating is kind of awkward.  Food was classic dive food, cooked fast and in front of you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HTe6E11xxgu-whSUB3j0RA"
  },
  "g9YYYkUtkQnukMSTDcV9aQ": {
    "date": "4/19/2013",
    "text": "This place is Pittsburgh.  The simple food and simple people.  There have been a lot of complaints about smoking.  I heard recently that they are no longer smoking at Nadine's! I went there this morning and there is no more smoking.  Now to my review.  The food is always good at Nadine's during the day, but I think my favorite time to go is early in the morning.  Eggs and beers after a hard nights work.  The service is always blunt and no nonsense but I love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YYJNykk0WhPxL3c7KeTzyw"
  },
  "JyWRlPZmvodNtZ3r4_xxxg": {
    "date": "12/6/2015",
    "text": "We had a great experience.  Cozy atmosphere,  great food.  We ordered the hot roast beef and a grilled chicken salad, along with a \"pop\" for under $15.  Wow.  We'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PDYZ2hGlPKCMNIdY2_nB0Q"
  },
  "OtuA7u_3yzMSQmWuzEKINQ": {
    "date": "8/2/2016",
    "text": "Loved the ambience at this place. This place beats Pamela's for the quality and price and it's close to the bike trail. It's the perfect place to hog after a long bike ride.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EvRhxCitoOs32lZYXPPGNg",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Mixed Grille and coffee",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EvRhxCitoOs32lZYXPPGNg/o.jpg"
      }
    ],
    "user_id": "Zk9aLPcbkVrEFbZnstfKGw"
  },
  "uOrPFRXmxAYyxLpoXY2Dyw": {
    "date": "6/5/2016",
    "text": "Our party of 2 waited an hour after placing our order before we left. They weren't busy and didn't apologize for mismanaging their orders.  The environment was unclean, including the glass they served my orange juice in. Of course, they were in denial and blamed the glass until  I scraped off the grime in front of them.   Do not go here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "rmsrapdm0N33MwZ-orB8UQ"
  },
  "navKs5LzXbxwdQfk4XQGVQ": {
    "date": "11/25/2017",
    "text": "My brother's boyfriend was coming to visit for the first time, also his first visit to the Burgh! We wanted to meet on the South Side for breakfast and show him our beautiful city. We went to a more trendy restaurant on East Carson street and were actually turned away because we had a party of 9!!! I quickly searched and found Nadine's just a block away. We quickly changed plans and were greeted by amazing people. They were so friendly and kind to our big group.  They kept us up to date on the super short wait and got us sat immediately. They did a stellar job, and the good was amazing! Not an unhappy person in our group. Thank you so much to Nadine and her staff for saving the day!!! I will recommend you to everyone heading that way!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ProDxaxNGYieiHG76pdflA"
  },
  "fp9rqdobMEgh9DGr8YzI_w": {
    "date": "2/10/2018",
    "text": "I recently stopped into Nadines hoping to order some food and have a little chat with Earl since I haven't been in town for months and come to find out he retired! I was in complete shock, but I got to talking to the new bartender taking his place i guess and what a gem she is. Her name is Kelsey and what a perfect replacement for the legend himself, she couldn't have been more delightful. With a full bar she made sure she got to have small talk with me, beer always refilled, and managed my food in a timely matter...and once you start talking to her, wow! That smile and laugh makes the whole time you're there welcoming and comforting. Guess they had to get rid of the old wallpaper and bring a new one in and great for the owners to get ahold of some chick like that. I will be there every chance I get when she's working.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CAHj6Os5qU4DckN6edbWOg"
  },
  "Nl6ICLY5BiziDhLg6Xf1BA": {
    "date": "10/29/2017",
    "text": "Great local favorite, Southside staple. Small place, friendly and attentive service staff. Amazing food at Amazing prices. Gets busy on weekends for breakfast-brunch-lunch, but totally worth the wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZehB0tojKXm4V0IP24pp6w"
  },
  "vEPqL7sCOdBOg22Zk6Zsnw": {
    "date": "3/24/2016",
    "text": "This is a True blue dive bar.  Love love love it.    We had twelve drinks and jalapeno poppers and our total was $32.  TWELVE DRINKS.  Earl is a great character.  The drinks are strong.  The crowd is lively.  GREAT place if you're looking for a good ol Pittsburgh dive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "K-nJvlZKQOHp1R5CkHh0Eg"
  },
  "3l11S0w2BUB0DFxw81ggdA": {
    "date": "3/9/2014",
    "text": "Let me just state for some that I did not come here because of DDD and no, I did not try what was featured on the show.  I came here...well, simply because I was hungry and thirsty.  Upon walking in this place makes you feel like you are in the wrong place, that is until you are warmly greeted by the bartender.  We didn't even have our coats off and were asked if we wanted something to drink.  We quickly settled on a draft and were brought menus.  Now, people, this place has a very small menu.  On top of the small menu there are specials that appear to change often.  A note to people also is that this place specializes in breakfast, half of the menu is for breakfast fare.  I almost ordered a special but decided to go with something from the menu.  I got the BLT and a side of fries; my friend got a cheese quesadilla and onion rings.  This is the nice part, everything is cooked fresh when you order it!  My BLT was amazing.  The bacon was crispy, tomatoes and lettuce were fresh, and the bread was just toasted.  The fries are fresh cut.  So no frozen here, cut and then thrown in to fry.  With the light touch of mayo on the sandwich it surely hit the spot.  The quesadilla and onion rings looked good too, but I kept my mind on my own plate.  This place, even though it is nothing more than a hole in the wall that has been there for \"17 years\" (I believe that's what the sign says outside) is amazing and charming.  It's small in here, so if you have a big party, don't expect to feel comfortable in here.  It's dark from the walls and small windows, which to me made it feel warm.  The decor is about as typical as you can expect with many places like this.  I totally liked that their dishes were mixed and matched.  Like they went to Goodwill next door and just bought every plate they had on the shelf.  It gives this place the \"we don't go with the flow\" feel that makes it work.  After a satisfying meal the check arrived.  That was like the cherry on the cake, for two meals and two drafts, $15.  I kid you not.  Totally worth checking this place out for food and not just drink.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 10,
      "cool": 9
    },
    "photos": [],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "mlIx_c-ZCvu8YtRrIwiB0w": {
    "date": "7/2/2016",
    "text": "Worth the hype. This place is a DIVE for sure, but don't let it scare you. I still have dreams about the steak and cheese sammy that I had there. I will definitely go back the next time I'm in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tieTvyMRUep5QdU5tzTKmA",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Steak &amp;amp; Cheese sammy with fries. God bless.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tieTvyMRUep5QdU5tzTKmA/o.jpg"
      }
    ],
    "user_id": "lrLLV_TVaGSAmigrJMmh8Q"
  },
  "LTHEyMeb_XqmVazjzowRkw": {
    "date": "6/7/2016",
    "text": "I recently made a trip to Pittsburg, and much to my surprise, the friend I was staying with lives two blocks from Nadine's. I saw this spot on Diners, Drive-ins, and Dives a few years ago... Boy is it a dive, but the food was delicious! I had the Reuben and it was outstanding! A lot of meat, smothered in thousand island and melty Swiss, grilled to perfection. The place looks like a shed you would see in a backyard but on the side of a busy street.  The inside isn't much to look at but that's the beauty of it. It was evident they serve a lot of regulars which I personally love to see. Needless to say, I thoroughly enjoyed my experience at Nadine's, from the \"decor\" to the killer food. I'll make sure to stop in again the next time I visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XNEiSyG6BN23P8V_jJiECA",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Reuben!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XNEiSyG6BN23P8V_jJiECA/o.jpg"
      },
      {
        "img_id": "taV04r3l8EIgg-NtZTcLGw",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Reuben! Get it!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/taV04r3l8EIgg-NtZTcLGw/o.jpg"
      }
    ],
    "user_id": "0H-D3OfaZZpi3XWQZ513vQ"
  },
  "DlW8nAErU8UEQs06Fe-GkA": {
    "date": "3/13/2017",
    "text": "Great food, good prices, incredible portions.  This is a fantastic dive bar lunch place, and served me well with a Saturday morning breakfast with my wife before a trip to the strip district.  Try the roast beef!!!  I LOVE how all the coffee cups look like donations from the diners. None of them match, but they all come filled with wonderful coffee!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GJkZ88YIV3kHr82_JlKegA"
  },
  "UOHY8WXEI8EiI0cLjf5pGg": {
    "date": "4/25/2016",
    "text": "Went to Nadine's this morning after a long day at work.  At 8:00 am on Monday morning, it seems to be the go to place for people in the medical field to go for breakfast and screwdriver after a trying day at work.  Before I even stepped foot in the door, my friends were raving about the \"mixed grille\" dish, which is pretty much a tiny mountain of eggs, homefries, ham, sausage, cheese, peppers, bacon (and probably more).  It seems like the kind of bar where people want to know your name... There are tvs wall-to-wall showing morning news and current events, inviting you to hang around and \"shoot the sh*t\" with your buddies, staff, and other patrons.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JeERFBZyECRwzscG3dvKQQ"
  },
  "GdiVo9nG6hGKx92EjTP8ZQ": {
    "date": "11/6/2015",
    "text": "I have been trying to figure out the name of this place for like 2 years! I stopped here on a recommendation from the front desk at the Hyatt while traveling for business because I got in late and all the crappy chains were closed. I was so tired and hungry when I walked there and so full and happy when I left I did not retain the name or location of this fabulous establishment. The bartender was really friendly and the atmosphere great. I got a BLT and it was seriously the best ever- super thick crispy bacon.  I wound up moving to Pittsburgh and have been racking my brain trying to find this place again and I randomly saw the DDD episode and figured it out. I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_onj0qGXu0wKvHAXyhxjRw"
  },
  "mVx5C4LeB-IRGhXBkkOilw": {
    "date": "3/27/2017",
    "text": "Had breakfast here on Sunday morning and I can't wait to go back. Super casual and laid back, I wasn't embarrassed that I was extremely hungover and looked like a total slob. We sat right down, I ordered a breakfast sandwich that was bacon cream cheese and a slice of tomato on a toasted bagel. It was so good I've been dreaming of it since, plus it was 4 dollars. Also had a really good Bloody Mary which if I'm not mistaken was 3.50.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "omwBX6tSFifgJ4xZU8a1CA"
  },
  "0LRLYOLYJlf1E0m-O2vxSQ": {
    "date": "5/7/2017",
    "text": "Good, cheap dive bar! Quick service. The food was pretty good, especially for the price. Definitely a greasy spoon type of place. I had the mixed grille and my friend had the French toast. We shared a special, the biscuits with sausage gravy. Both were tasty and satisfied our hunger. We left full and didn't quite finish the large portions Nadine's serves. I ordered wings to go for my fiance and he enjoyed them, especially the golden BBQ sauce.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eXWL83SrSkkkidNTTo9wDw"
  },
  "Gk9zkLGNKaMsZvzFuhQTlw": {
    "date": "5/19/2017",
    "text": "Awesome little dive bar setting! On the food network, great breakfast and has a bar!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J9An8BT-KlKSZdiyKoRWUA"
  },
  "umH9ndxRIru5i9b2p8WSGA": {
    "date": "10/3/2016",
    "text": "After living in Pittsburgh for 24 years and frequenting the South Side neighborhood weekly, I made my first stop to Nadine's. I heard about Nadine's via word of mouth and from passing by in a car. Being a lover of dive bars and inexpensive food, I knew I'd have to eat here eventually and boy I wasn't disappointed.  As with any location in South Side, parking is limited so you may have to walk a block or two from your spot depending on the time and day of the week. My first impression upon entering Nadine's was how small the building is, although it looks small from the outside so I'm not sure why I was surprised. I went for lunch on a Monday so finding a seat wasn't an issue. The bartenders on staff were working with a sense of urgency and swiftness that you'd only find in a busy cafe or breakfast joint. The menu at Nadine's is small and affordably priced, with no entree exceeding 7.00. Within 10 minutes of sitting down my food was already right in front of me! Hot sausage with peppers, onions, and provolone, with a side of fries. The hot sausage is served on a delicious white bread sausage bun. The sausage itself was caramelized to the perfect degree and the spice level was exactly where it belongs for hot sausage in my honest opinion. My only complaint about the sandwich was the the onions were a little bit underdone, but nothing intolerable. The french fries were to die for, literally straight from the fryer to your plate, although I would avoiding ordering them if you're trying to stay heart heathy, as they are a little bit greasy!  All in all, Nadine's is exactly what it's advertised as; an inexpensive dive bar with delicious greasy food and affordable drinks. I would recommend Nadine's to anyone looking for a quick lunch or after work dinner commuting through the South Side neighborhood.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HctFza9JOWPnnx0BuXIxzQ"
  },
  "Y0mPG5ugRa_KCge6XB-gEg": {
    "date": "8/21/2016",
    "text": "J and I came here after declining to wait 2 hours (!!!!) for Waffles Inc. We called ahead to see if there was a wait, and let them know that we were walking over. We were pleasantly surprised to see that they set a table up for us! The staff were very nice. It was a pretty busy place, as every seat was filled. I ordered cranberry juice, a cheddar omelette, and a bagel with cream cheese. J ordered coffee with French toast. Since it was busy, our food took a long time. A really long time. A little too long in our mind, however we were occupied with watching the Olympic Games. Food was decent and really inexpensive. J was very happy that everything was less than $15. The atmosphere was welcoming and fun, however we may not return due to waiting so long for our food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BfX5cChtKJZMhWHLB1K1eg"
  },
  "1uGs49BNOXpNOWSEM2gWGg": {
    "date": "11/4/2014",
    "text": "LOVE Nadine's!   My boyfriend and I were visiting Pittsburgh for a few days and heard about Nadine's from some locals, so we decided to seek it out. For one thing, when we went... I remember thinking, \"Is this the right place?\". Looks like a complete dive and did not think that they would be serving anything other than beer and bar food here... but I was wrong!   The inside is small, a few tables and then the bar, so we took a seat there. Nadine happened to be working that day with one other girl and boy, is she an awesome lady! Loved her instantly. I ordered coffee, eggs, home fries, and french toast. She made everything literally right in front of us. Cut up a potato right there on the flat top, watched as she made it into home fries... watched her make the mix for her french toast batter.... awesomeeeee. She chatted with us while she made our food and even recommended places for us to go to while we were there.   The food was delicious and the prices were amazingly cheap. I would go back again in an instant! (With the Buffalo phone book we promised her!) Highly recommend everyone should try Nadine's. If you go during the week, it isn't as crowded... and the earlier the better.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "e59mKJX5uBf3o-p6sOmWjg"
  },
  "0gHBXvqQhFjLrL3zKSu52Q": {
    "date": "12/19/2012",
    "text": "If I could give this 3.5 stars, I would probably feel more comfortable doing that.  I would say it is closer to a 4, than a 3 so since halves are not possible, this is where I stand.    If you are the type of person who likes a neighborhood dive, Nadine's is your place.  Lots of regulars, very blue collar, very related and SMOKY.  That is my only complaint... the smoke.  But other than that, where can you get a great priced meal, cheap drinks, and a super friendly staff?    After living near there for about two years, I am only upset that I did not get to go there more.  Definitely a place worth checking out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLVq7VSJBHZwqurwWoCmpg"
  },
  "odAMRIEkcHrBJAKTcDF8mQ": {
    "date": "12/28/2016",
    "text": "We stopped here on the way to Washington DC hoping for some delicious food. We wanted to eat somewhere that was featured on Diners, Drive-Ins, and Dives, and this place had excellent reviews. We, however, were highly disappointed.   The service was not too great and the food was not up to par. I was \"eh\" about my Reuben, and the other people with me didn't seem to love or hate their food either. We had ordered jalepeno poppers as an appetizer and they were awful. They tasted nothing like a jalepeno popper should taste, I think we only ate 2 of them.    Other than the food, the look of the place was awful too. It was disgusting inside, and the bathrooms were flat out hideous.   The only good thing I can say about this experience was that we met some very kind and funny local Pittsburgh men.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4_58XvkTADG8SydwI3PhEw"
  },
  "qdjfA-762iyOvQqGEsv-QA": {
    "date": "5/2/2017",
    "text": "I stopped in here on a late Sunday afternoon with my wife to avoid the more expensive parts of southside works.  Definitely a local crowd at the bar with most people drinking.  My first impression was that this place is very unappealing.  From the outside it doesn't look like much, and inside it's noticeably dirty and dusty.    Thankfully, the first impression was the worst part about coming here.  The staff was very friendly, talkative, and attentive. I ordered the reuben, my wife had the sausage sandwich, and we split a basket of fresh cut fries.  The reuben was good and packed high with corned beef.  The bread could have been toasted more, but that's just me being picky.  The basket of fresh cut fries was excellent, and my wife was satisfied with her sandwich and very full afterwards.   This place is your typical local dive bar; great prices, solid food, TVs to watch the game on, drinks flowing, and some friendly customers and staff to hang out with.  Not opposed to coming back here for a drink and to fill up on food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "p2zG6moVk1JWwxkALfWHVw"
  },
  "FWcrhqlOpGOLZ9hQ33VokQ": {
    "date": "2/28/2019",
    "text": "Great family owned restaurant/bar.  Some of the best French Toast.  The breakfast hoagies are delicious and massive yet only $4.50 - $5.50.  It is an awesome.  Very helpful staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2HakSibZ4mYuFocJF3hQJA"
  },
  "YrbqbcDs3mLt6Wqi7vKfjg": {
    "date": "6/22/2018",
    "text": "Must have gone here on the wrong day. Took my daughter to lunch at 1 didn't get our food until 5 minutes to 2. The whole time we have to listen to an obnoxious drunk nurse who work the night shift. We had to put up with her for about 30 minutes before she left and yes she was drunk and she was driving and they served her also she had a car seat in the back . So my daughter was served her food then had to wait another 10 minutes before my plate came out they didn't have home fries they were maybe three bites of hash browns very small portion was not happy.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u9jYxrrUGxiozqnhrXm-dw"
  },
  "Lw0r2PAew4BdeGOByuV0mw": {
    "date": "1/25/2019",
    "text": "Excellent burgers and a great little hole in the wall to enjoy a few beers with friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Tqfi_hk8V8oOiCwpySolQ"
  },
  "jJ8qsGZI6CIuVv04Gw21Cg": {
    "date": "9/2/2017",
    "text": "Update: Stay away from this place. Hours after I ate here I have been very sick throwing up. Eat at your own risk! The dog running through the kitchen should of been my first and only clue.    Update 2. After 14 hours just throwing up and having the runs which I can only describe as peeing on the wrong hole, I was finally able to go to the ER and food poisoning was confirmed. They put some IV and other meds and I was able to finally sleep a few hours during the day. Other than being super weak, I won't be dying soon like I thought I was at 3 AM when I sat at that toilet for the 52nd time. Lol. Lesson learned, never go there again!  Decided to come here since the person I was dating wanted to come. Beer was not cold like it should. I ordered the country fried steak with eggs and mashed potatoes. The \"cook\" put the mashed potatoes on the plate and put it on a microwave. What really got me was a dog running behind the bar which is also the kitchen. Not very sanitary if you ask me.   Despite all that, I have to say that the steak was really good. The rest of the food was tasty. The mashed potatoes at least were real and not from a box. This is a dive bar where locals frequent. The bartender/server was very attentive although, she forgot to put her pants the right way. They were upside down for some reason and the tag was showing. Lol",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fV2DnWALRWyoNErlY6e2pg",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Country fried steak",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fV2DnWALRWyoNErlY6e2pg/o.jpg"
      }
    ],
    "user_id": "9Bv7l_W0oG0lYqYY3FV0dA"
  },
  "HPzINS3o6s32fVRwU9hPTw": {
    "date": "12/11/2018",
    "text": "I love Nadine's atmosphere and food!  Great burgers, Reubens and you must try the brisket on Fridays.  Fun, fun, casual atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ZjIsQUbBlYlYwYPc54cdQ"
  },
  "EJnoclmfpQNm-mFE2o_DOw": {
    "date": "5/26/2018",
    "text": "Love this place! Just went there for the first time today and will definitely be back. The bacon was the best that I have had in my whole life. My husband had the \"mixed grill\" which was hash browns with eggs, ham, peppers and onions added, amazing. Being able to watch your food cooked is nice and entertaining.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iQrCGD-I60xr7gqhYCFdjg"
  },
  "DAkU7EvlqSjjDTXqHR18Wg": {
    "date": "3/4/2018",
    "text": "I had the roast beef. It was sliced very thin and very good. I would recommend this place and will certainly be back soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rBhU3nawTqDgPo-_PCzTYQ"
  },
  "DQ87NO9I6AQOU3Irpj9v7w": {
    "date": "5/17/2018",
    "text": "This place is tits.  Marissa was a fantasic host.  Drinks came quick.  Mixed grill was also tits.  Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnNyaBBBkeJVS-R7fHEmqQ"
  },
  "4AYPTadbUsHWvP8Suenw6Q": {
    "date": "2/10/2018",
    "text": "Nadine's is an absolute gem, as evidenced by our lord and savior Guy Fieri. Come hungry and both your stomach and wallet will leave happy. Yinz are gonna love it.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dRk7Hhos49RIdf7WWjrZ9g"
  },
  "bl2FR6nZXZuB3hAc1xGipA": {
    "date": "5/27/2017",
    "text": "This is the first and last time I'll ever go into Nadina's.  Matt was rude and disrespectful. I've never ever been treated with such disrespect. He was highly intoxicated and started name calling. That's when I knew it was time for me to go. I'm very disappointed. Total waste of time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N99tMmlVNppaWg9_CX1Nbw"
  },
  "Yleme1xAk2whB3-D3fPDvQ": {
    "date": "6/23/2018",
    "text": "I will never return to this restaurant again. The food took almost 45 minutes to arrive after we ordered. Once it did finally arrive there was a hair in my sandwich. The waitress did not refill our drinks once. She was complaining about being hungover to her co-worker. After we ate it took another 30 minutes to get our check because the waitress forgot what we ordered.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9DwMc3od_Idelwuucde6DA"
  },
  "04EKMr8Lb04A9VqYx3Krdg": {
    "date": "3/13/2018",
    "text": "Nadine's came highly recommended by our local air bnb host.  The place definitely has that local greasy diner look (which we were psyched about, don't get me wrong). I noticed the music was loud when we walked in at about 11:30 on a sunday morning, and figured it was just the song, but it continued blaring the entire time we were there so it was impossible to have any sort of conversation at all.    Our french toast was absolutely delicious but my side of bacon didn't come until i was literally done with my french toast so that was kind of a bummer.   When it did come, the bacon was really crispy just how i like it!  Coffee is a big thing for me, so while the coffee was great, i was disappointed that we never at any point got a warm-up/refill.  We were done for at least 20 minutes before we got a check, and at that point we had to ask for it.  Overall the food was fantastic, would highly recommend to anyone visiting the area! The service left a lot to be desired, but maybe we caught them on a bad day.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vAd2aq_fKcOdHtCJHTqoIg"
  },
  "k0t4gMu8Qg9--uD26nG64A": {
    "date": "2/5/2018",
    "text": "After hearing about Nadines from several southside people I decided to give it a try and boy am I glad I did! The bartender/ server/ cook was amazing,  she somehow manages to multitask perfectly,  our drinks were delicious,  the food was great and the entire time she interacted with everyone at the bar as if she wasn't even busy.  That kind of customer service is rare and astonishing,  this may have been my first visit but it is certainly not my last! The prices are great,  the food and beverages are devine but above all that the service blew my mind!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "92xi_OHnZcFWSDgb_BZEEg"
  },
  "TMkrkMFyBXOBYBMlvPY_Ag": {
    "date": "10/29/2017",
    "text": "My husband and I tried Nadine's today because there was a long line at Ritter's. We should have just waited at Ritter's! Nadine's has a very limited, boring menu. Our server was unfriendly. I waited ONE HOUR for a freakin' bagel with cream cheese...and I had to spread the cream cheese myself! My husband's hash \"browns\" were white (meaning, barely cooked and definitely not browned). It was just ridiculous. They ended up comping our meal because we were so pissed off, but I would still NEVER eat there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ql1LUL-zS8ChMIXra3r92w"
  },
  "EjWMS01tn8kj5VnxRiwosg": {
    "date": "8/9/2013",
    "text": "Came here from the recommendation of Diners, Drive-ins, and Dives on Food Network. We got their roast beef and mashed potatoes and Na's pasta, both of which were featured on Food Network. The roast beef and mashed potatoes was pretty decent. It was beefy with the whole thing slathered in gravy. The portion size was pretty large too. Their pasta was on the mushy side and was definitely not as enjoyable as the roast beef.   The atmosphere is a bar type area and was a bit smoky, but the service was very friendly. They seated us at the largest table in the back and we even signed their book listing names of people who found Nadine's through Food Network.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "4QYw6zj3MObsGdRt3Sm9Ug",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Roast Beef Sandwich and mashed potatoes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4QYw6zj3MObsGdRt3Sm9Ug/o.jpg"
      },
      {
        "img_id": "cDjcmb8kgFmwJTZ1PuY8HA",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Na&amp;#39;s Pasta",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cDjcmb8kgFmwJTZ1PuY8HA/o.jpg"
      }
    ],
    "user_id": "DC1hfeeSaYr2E1xwiEL81A"
  },
  "OHSu5NZNqtcBuw9p1PThIw": {
    "date": "7/18/2018",
    "text": "I would like to start off by saying that I've been coming to this place for a while now. The food has always been great and the service use to be great. The morning crew has falling off since the Nadine(Mother) doesn't be there like she use too. Seems to be the morning crew is always drinking or under the influence of alcohol.  I've come here numerous times in the evenings and Peeps(bartender/cook) has always been courteous and I couldn't have asked for better service nor food from her. Thank you.   Now my problem is that when i first started coming here. There was an variety of music on the touch tunes machine. I come here to unwind and listen to all types of music. But now they have filtered out all of the hip-hop and R&B music and my question is why??? I listen to rock/alternative/country and Every i mean EVERY one i searched was on the touch tunes machine while i search Janet Jackson it was only one song by her. Its amazing that all the African American music is gone. Why is this? It really makes my husband feel a little uncomfortable knowing hes black and im a white woman.   Im pretty sure this establish will find a way to take this down. But why take it down when you never take down the positive so why take down the negative.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ygErs_PlF9s-Ln9Y_BJ0ZQ"
  },
  "Ja3fybYbgbeXlvFh1vyS3w": {
    "date": "3/6/2016",
    "text": "My favorite flavor of dive bar.  A judgement-free zone with cheap prices and good food. The bartender makes the food in front of you, sometimes he has a mustache. Ten out of ten, would recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZNrZkWvN6NzfWO-4KYb0_A",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZNrZkWvN6NzfWO-4KYb0_A/o.jpg"
      }
    ],
    "user_id": "1C56H0OTzuqEvU6v7rypXg"
  },
  "kQXunRmmVsAr_zscAOvEbQ": {
    "date": "6/13/2016",
    "text": "My first visit here was for breakfast a few weeks ago. Nice spot for the yinzers. Service was surprisingly good. Honestly, the owner seems very rough around the edges and she even scowls and growls but it wasn't off putting. For some reason, it adds character to the place and I really think she is just trying to get the job done. Lol   Everything about this place is small...parking lot, building and even the tables. A quick drive around the block and I was able to find a spot to park.   There is seating around the narrow bar and a few high tops a short distance away. Breakfast was simple, cheap and good. Choose how you want your eggs (smacked up, flipped and rubbed down...perhaps), select your meat and the home fries come with. Wow, it was cholesterol laden but good. You'll be asked your choice of bread and trust me, you want the Italian. Did someone say Mancini's, eh? Very yum.  Would I visit again? Yup",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 6
    },
    "photos": [],
    "user_id": "B_4cl4IGRqYb0wQSe-rYjQ"
  },
  "cxhrxrg5344j1dEgpL-pCg": {
    "date": "2/11/2015",
    "text": "We love Nadine's which was visited by Guy Fieri, Diners, Drive-Ins and Dives. The food is prepared right in front of you, and the bartenders are friendly and funny. Owner is sitting at the corner of the bar and always acknowledges his customers. Daily specials, awesome Rueben and burgers. Famous for fried jumbo sandwich and NaNa's pasta. Did I mention the onion rings?  Nothing on the menu is more than $6.  My only concern about providing such a rave review is that I won't be able to get a seat next time at the quirky neighborhood establishment.  .ps. it's smoke -free",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "mrEiYaK6Te-gz8JuyO-sgA",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Go on your birthday and see your name on the birthday banner!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mrEiYaK6Te-gz8JuyO-sgA/o.jpg"
      }
    ],
    "user_id": "GUiJ6uObUjEwSlnayE0Zdg"
  },
  "sZmd7L1qSkc9L6QcBAwNAg": {
    "date": "6/18/2019",
    "text": "Great place for breakfast. Welcoming and attentive staff, great coffee, perfectly cooked bacon and nothing was overpriced. Easy to park in the side lot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_x_zDb85W9b0i2h0nSm_TA"
  },
  "vV1SHsOGiowEZ0uLdntQIQ": {
    "date": "9/4/2019",
    "text": "This is a great find! I was searching through yelp to find a breakfast place on Labor Day that I have not already tried and this popped up. It's a small little \"hole in the wall\" for lack of a better term and is family owned. You can feel/see that it's family run because everything ran like clockwork. Decent menu selection, excellent prices, and nice portion sizes. I ordered a cheese omelette and added mushrooms with a side of potatoes. Two Person breakfast was under $20. Only thing I could say is that my eggs were a little greaser than I would have liked, but that's an easy fix with clearing off the grill. There were several orders going at once. I will be patronizing this place again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mA3tALTzmDunDRctGEu-wA"
  },
  "YN-dSjF-Aa7YHC1zrSxVWA": {
    "date": "6/29/2018",
    "text": "Went to Nadine's for breakfast with my wife. We sat at the counter as the place was packed. The waitress came write over with menus and asked what we wanted too drink. I had 2 eggs over easy with bacon and home fries and white toast. The food was ok nothing special at all. The home fries where lacking in taste. The eggs where cooked correctly and tasted fine. The one nice thing is they do have there own parking lot so as long as it is not too busy you do not have too pay for parking. The staff where friendly and the service was fast. Unfortunately I was not thrilled with the food as it really was nothing special. With all the other choices for diners and breakfast food I would say I would not go back again at least for breakfast.",
    "rating": 3,
    "rated": {
      "funny": 13,
      "useful": 18,
      "cool": 15
    },
    "photos": [
      {
        "img_id": "8ND-YO74UVVP_a2e3zUjgg",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8ND-YO74UVVP_a2e3zUjgg/o.jpg"
      }
    ],
    "user_id": "hg71CGHy9bwpgY8cGVVg4w"
  },
  "ZTCDC_yXoy3-e78bHHLtxA": {
    "date": "2/23/2019",
    "text": "I have frequented this place pretty often and every time I am here I am never let down.  Sure you can label it as a dive or what have you but you can say, you will not leave here hungry.  It is not pretentious, to say the least and get a lot of great conversation.  You will hear stories and conversations from the regulars and get welcomed warmly.  You want to have a good time, come here and have a couple drinks at the bar and engage in some conversation.  I continue to come back because this place tells a story and that is that you will love it for what it is.  It is not pretending to be something it is not and embraces that 100 percent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "kci2jdXmERFr1MpNAV-42Q"
  },
  "mnhV4LGkJH7EcPx60PrJdA": {
    "date": "7/10/2019",
    "text": "Love coming for breakfast and drinks after a night shift of working. Staff is always friendly and the food it great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rBoVWxpLef_QE3KS1SMbuQ"
  },
  "_ojFJb4kbFpO3igVIzbdBg": {
    "date": "5/27/2019",
    "text": "Fantastic family-owned business. Just a tip because I saw people standing by the door, you must seat yourself. There are side tables for 2-3, bar seating, and a table in the back. It is busy as anticipated but food is great, comfort at its best. Very affordable. Parking lot is located in the back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "34obrntAU6D2B3yCJAZxog"
  },
  "uht2H31fXDD_xxx_Cn1a7g": {
    "date": "10/29/2017",
    "text": "I hate to update my review and remove 2 stars because this is my neighborhood bar and in here 3x a week, but things just aren't the same here.  Earl left and even tho i thought everything at the bar would remain the same, its not. Earl was so nice and made sure to always have conversation with you. That is one of the reasons this bar was so special.. People knowing your name & your story.  We went in today for lunch and there were only 3 others in the bar. A girl took our order. Normally everyone there plays bartender, cook & everything in between. After taking our order the girl didn't even say 2 words to us. Someone else made our food, another person served our food & refilled our drinks. No one even asked how it was. The young girl who initially took our order spent the next 30 minutes counting & splitting the tips. We were sitting right in front of her & had to ask 2 times for our check.   About the food... Again not the same. My frozen Hash Browns weren't fried or crispy.. They were just bland frozen hash browns. I also ordered the country fried steak & eggs. Normally the gravy on the steak is thick & delicious. This gravy was so thin that it seeped into the steak and couldn't even taste it  Bring back earl or at least teach the young bartenders how to be friendly and bring on conversation.   I feel embarrassed writing this bc im here 3x a week but i at least hope Nadine sees this and changes some things.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "avmQEVvdrq9270yivQp06Q": {
    "date": "5/18/2019",
    "text": "Tried this place for the first time today for breakfast and I loved it!! The people were friendly, it was quick and delicious and the coffee was fantastic. I am excited to go back and try there lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tozyIYbBTA7ICXQMydM93g"
  },
  "UJ9QBY76wMq5652-pVbtCw": {
    "date": "6/16/2018",
    "text": "Burger was AMAZING!!! Fast and friendly service. We also tried the mac and cheese bites. The bartender suggested pairin with their homeade ranch...we were skeptical, but it was AMAZEBALLS.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7czhAZUBvBvUAC2s2YBKtg",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Mmmmm...get in my belly!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7czhAZUBvBvUAC2s2YBKtg/o.jpg"
      }
    ],
    "user_id": "FqOlp3ZFw1oliHyb5V69JA"
  },
  "ym95SmDmkXj1zzSB7fi4_g": {
    "date": "10/22/2018",
    "text": "Giving 4 stars for exactly what Nadines is.  We went to a more popular breakfast spot on Pitts campus with an hour wait.  Pulled up my trusted Yelp and found Nadine's.  To my shock and chagrin, I was taking my daughter and her roommate to A BAR for breakfast.  Don't be fooled by the front door.  Well, you won't be fooled. It looks like a working mans bar but let me tell you the breakfast was cheap and good and the most friendly waitresses I've had in a while.  Had breakfast but the burgers looked great and the nomads ranch dressing was yummy (for my fried zucchini)!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Oyx99R1v3d_UIE-vymJIBQ",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Amazing French Toast.  Western omelet was great, too!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Oyx99R1v3d_UIE-vymJIBQ/o.jpg"
      }
    ],
    "user_id": "lEklU-0ebR_ZWFs8v5YA5A"
  },
  "NlgCuTtlw-Pk4L8giOxHLQ": {
    "date": "7/27/2019",
    "text": "Nadine's is one of my household's most favorite places to eat. While I think it's primarily known for breakfast, we love their dinner and drinks as well. I personally recommend the grilled cheese, cheeseburger, Reuben and fries. This is truly a local hang out and can sometimes feel intimidating for that reason, but everyone is very nice and you can't beat the food and prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V_hhFppOHNkbNpqH18CvsQ"
  },
  "czvvNkqrm4ax5fqIrLhg6g": {
    "date": "7/26/2019",
    "text": "This is a great dive bar, if not one of the best in the city but if your looking for food, I wouldn't recommend it especially depending on whose working that day. There's 3 people who suck at cooking there and one out of those 3 people is the owners son. First the guy is just dirty and unsanitary. He doesn't use gloves and he barely washes his hands, and when he does washes them, he dry his hands on the same dirty rag that he already wiped his hands off with probably about a 1000 times. not to mention he's constantly wiping his face with his shirt cause he's sweating and then goes to wipe his hands off his shirt also after he done something.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YpeiqqBGqza1Iiq96KaurA"
  },
  "M8hDmOz7PgA2t8_74otIXg": {
    "date": "2/9/2019",
    "text": "Killer Reuben sandwich.  Country fried steak was really good too, as were the jalapeno poppers.  Leave your reservations at the door, it's a small town style bar and restaurant with small town prices for great food, all in the big city.  Can't wait to come back again and again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EeK6Bmye04T5EODN_91CKQ"
  },
  "9GOEFWKDA-1gyqVLuP5qOw": {
    "date": "2/20/2017",
    "text": "\"Where do you find these people?\"   This was Earl's question to our friend Brad, a regular and local (you probably know him).  Well, my wife, our other friend, and I live in California. I don't think he held that against us, though. We all had a good time here after a recent Steelers game.  I hope yinz appreciate places like Nadine's, because similar establishments are hard to come by where we live. I have no idea where I could get a fried bologna sandwich in SoCal (although I'm sure some hipster gastropub will be featuring one soon). And Yuengling? Forget about it!   I have to say, though, that the people here are probably the biggest draw. Neighborhood hangouts like this are a prized commodity in our ever-changing world. Whether you're a fifth-generation Southsider or a tourist from a far, exotic land like Orange County (don't call it \"The OC\"), you will feel right at home at Nadine's.  I attached this picture for Earl, so he'll remember what a mimosa is and what to charge.  P.S. Don't forget to sign the guest book.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 8,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "Bjc5dXKRuZhT5tOSRkfCPA",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Photo taken on Sunday",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Bjc5dXKRuZhT5tOSRkfCPA/o.jpg"
      }
    ],
    "user_id": "rvkVh-FNvg2fYSgHjG4mkQ"
  },
  "x21Finy6zv7PBfYKKiK7yg": {
    "date": "5/27/2019",
    "text": "Intimate and local space. The grilled cheese was amazing, as were the macaroni bites. The bartender was also running the grill; she was doing a really good job. I'm looking forward to returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1PH5BWPkhUaTLSNdwVOPyA"
  },
  "9cnR0NBq-hr-m6Mt4ORQvA": {
    "date": "7/30/2018",
    "text": "If you want drinks and food after an overnight shift this is the place to go! Lots of other medical or post night shift workers there. Small and cozy. Friendly staff. Quick service. Great prices!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "uVt5vnUbahYXt82Lyx9CvQ"
  },
  "gyYP0UHdk4D9iAhtNMUeOA": {
    "date": "1/30/2018",
    "text": "Nadine's is the perfect place to grab some drinks or  grab some food (with a small group). The place is a small hole-in-the-wall featured on Diners, Drive-In's, and Dives. The staff is extremely friendly and the food is cheap! My experience was great. The food isn't fancy, but it is delicious! The restaurant itself has a tiny parking lot, but there is also metered street parking available because it is located in the Pittsburgh South Side.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rzYUUFOYu4iMotii4jL__w",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. Two eggs with a side of ham",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rzYUUFOYu4iMotii4jL__w/o.jpg"
      },
      {
        "img_id": "dF1sGtSPBxyUYyGRKzUMDA",
        "caption": "Photo of Nadine's - Pittsburgh, PA, United States. French toast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dF1sGtSPBxyUYyGRKzUMDA/o.jpg"
      }
    ],
    "user_id": "ENZbh_u6v1vT_zTUW3vZGw"
  },
  "cZnsxxe4Rpm-ECnNdiuSTQ": {
    "date": "5/17/2019",
    "text": "What a hidden gem or dive I should say. Is it a Burgh thing that your breakfast can come with a Yeung for $2.50! My eggs and ham were good . French toast was yummy. Coffee hot and not bitter.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SWIZHQwvt9nhn09HvjOMxQ"
  },
  "mI92SiofhZ_C2RvOI4RK-A": {
    "date": "12/1/2018",
    "text": "Great food --breakfast of omelets, OJ and Irish coffees-- with fast friendly service in a long narrow bar that is probably not ideal for families but good for some friends in town from Chicago for Chargers @ Steelers. Super well run business with everyone working hard to serve up some tasty food. Highly recommend for people wanting to avoid chain places or cookie cutter spots with no personality.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eYI3bsQTAxi1-dGA2HVxjg"
  },
  "tQiEU5pYCrt_lM-0WJk1Zw": {
    "date": "5/3/2017",
    "text": "What a fun place. We were immediately greeted by several folks. \"What brings you in?\", \"Where are you from?\"...like I was coming into someone's living room. Everyone there seemed to know each other. The perfect definition of a neighborhood restaurant!  The menu was just right for the size of the restaurant; small with a powerful punch!  We got hamburgers and tater tots. That hamburger was terrific!! I've never been a big fan of tater tots (nightmare for college days), but we compromised and they were good too.  We look forward to going back and trying more things off of the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "BJUY0UadA-STNQfNGnpTjg"
  },
  "ttK8ZFly6HalvJruK9P9zA": {
    "date": "3/7/2015",
    "text": "Phenomenal. Great prices, delicious hearty breakfast, strong coffee. If you are drinking, the drinks are cheap too. Warm, welcoming, attentive service, and a great dive bar atmosphere. Without a doubt, one of the best spots I've found in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IjNOwI028HYJ9deeeFkXqQ"
  },
  "XPomo9YGIZbRM7PwLrRDGQ": {
    "date": "7/24/2012",
    "text": "This place is a bar. There is drinking. There is smoking. Kinda sketchy-looking. Go somewhere else if you want chic and ambience. Go here if you want to eat some really great bar food in a very divey bar. I had the Philly steak sandwich. BF had the Reuben. Split some fries. Drank a coupla beers. It was terrific. We watched them cook the meat and veggies. All the ingredients were fresh, not frozen (as far as I could tell). They sliced bread off a fresh loaf for the sandwiches. The Philly steak sandwich roll was yeasty and soft. I'm convinced it was bakery bread. The rye was dense and chewy. The portions were generous. The reuben was 2 inches thick - spicy dressing - great sauerkraut. And all of that for something like $15. The owner was pretty friendly. We were obviously tourists - I actually had on a DRESS of all things because we came straight from the airport and I'm one of those people who dresses for air travel - but no one gave me a dirty look or made me feel like a yuppie slumming a dive bar. He asked where we were from and where we were heading and brought out the visitor book for us to sign.   This place was on Diners Drive-ins and Dives in 2008 (this info from the owner). This place put the \"Dives\" in DDD according to him. And I couldn't agree more.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "722HiuAnRlHHZNdmt19p9A"
  },
  "krKB-_DaLxZiuJM-Q_xqSw": {
    "date": "1/9/2015",
    "text": "Heading back to Pittsburgh for a week and checked out Yelp to make a list of the restaurants we would be visiting while we were there. Nadine's is always on our list. I was reading the reviews when I saw that Amanda B. from Lockport, NY had written a review. She mentioned that Nadine wanted a phonebook from Buffalo, NY and guess what?...we were going through Buffalo (to go to Anchor Bar for the Original Buffalo Wings). I private messaged Amanda to see if she had a phonebook and if she could meet us at Anchor Bar. I didn't get in touch with her right away but when we got to Anchor Bar the super nice bartender gave me a phonebook. Nadine was so surprised and thankful to have it. I was thankful I was able to help out and very happy that Amanda mentioned it in her review! Thanks Amanda!!  Oh, Nadine's was terrific as usual. The food is awesome and the staff is super nice. They remembered us and welcomed us back with open arms. Simply love this place. There is no smoking inside anymore which is terrific and if you have never seen a cigarette vending machine - they have one! It's a rare sight!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bbucvMWQyMP6EFF5CdqM-Q"
  },
  "A775Hdo7t7Pbpwim1_1TGQ": {
    "date": "9/10/2010",
    "text": "Nadine's is a place where the inverse property of food takes place. The smaller this place is, the better its sandwiches are. This is one rule that you definitely must keep in mind if you choose to step in.  Now, I didn't get to eat in my first time, but I did get to eat well. I was privy to trying the French dip and the fried pastrami they have there, which are basically complete decks of meat, cole slaw, pickles, and rye put together. Pretty good.   I definitely want to go back sometime.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "7x44Lt23CeiJFFP6H0_s1Q"
  },
  "Ydw8hTxennvOMOZXgnPDnQ": {
    "date": "3/7/2015",
    "text": "Nadine's is the perfect spot for breakfast, lunch and/or dinner.  The food is great, the prices are reasonable, and the staff are very warm/friendly. Nadine is there everyday and prepares daily specials that are just like home cooked meals.  Matt never forgets a face and will keep you laughing. Everything is prepared right in front of you and exactly as you order. Plenty of free parking for customers right out front (which is tough on the southside).  Make sure you ask for Peeps as she is sure to put a smile on your face.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vRg-O0SDPSiAsuWNav1MVw"
  },
  "cm-dl2HGzmw7EMmqzcuGkQ": {
    "date": "4/8/2010",
    "text": "Dirty, small, greasy, damn AWESOME.  The fish sandwich (i hear) is to die for.  Cheap prices, that's for shore.  Smoke filled divey bar.  I love it.  If and when I'm in the southside, it's always on my list to pop in.  Beware... when you leave you will leave there smelling like a greasy fry cook that chainsmokes.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "EWkQxKg-KOzujC38Z_40wg"
  },
  "zh25DajLDQ5x-VY3U2WDqg": {
    "date": "9/7/2015",
    "text": "Yep,it looks like a hole in the wall but my wife saw it on the food network and we had to check it out. The food is great,the staff os friendly and the prices extremely reasonable.  If you are in the area it is a must stop.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6HBUzYN_4ahpXpuSNgLqDA"
  },
  "3VCJdc8PY-pjLyv97BKYMQ": {
    "date": "10/3/2011",
    "text": "Great little local neighborhood bar with a bunch of regulars. But they all made us feel at home, and were super nice! It's small....really small. The bologna sandwich was really damn tasty!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Pj91NFPtXWeIDaLp2kuyw"
  },
  "MrM3NeCYzTyC8VCSX4t8Cg": {
    "date": "2/29/2012",
    "text": "If you like smokey dirty bars with cheap prices and even cheaper quality of food this is your place. Got the roast beef bland nothing special. My wife got a hamburger it was just ok she said once again nothing special.  I found out the drunk and obnoxious people in the bar were the owners son and his friends. The f work ever two min that my wife did not care to hear. I was in the restaurant biz for a lot of yrs and here is some free advise don't drink where u work! It's your restaurant not your frat house. The menu is very boring typical bar food. When it was suggested that we try the fried baloney I almost laughed in her face thinking it was a joke did not think anyone still ate that junk.  I saw a poster of the triple D guy and I have tried several places he visited. Guy I gotta tell u lost a lot of respect for u if you think this is a good place for food. A Dump yes a drive yes good food no way. Will never go back. I will keep my place right across the street Michael's pizza. Much better food although nothing fancy just really good pizza!!!!! (and no smoking!) so to summarize if all you care about is price and don't mind a place that smells like a cross between smoke and a dirty toilet have at it. Was surprised at the reviews but honestly most people don't care about quality only price. If you are one of those then go but there are only about 10,000 restaurants and bars that are sooooo much better in the south side!! Wish I could have given it zero stars but that's not an option!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KfcifZdN-_X3qFYHtvUTzw"
  },
  "ac8RREWKIFo80wxElxUrpA": {
    "date": "12/3/2011",
    "text": "Oh my! What a great afternoon and super great food! Home cooked goodness, felt like I traveled home to Mom's house! Matt is a cutie and Earl is IT!  Made us feel like we were regulars, perhaps we shall! Teri Dunn",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ruLefE-LjwSJMB3JGrLIg"
  },
  "DUSYqAUL9rBQNFctQ5EI6g": {
    "date": "11/17/2013",
    "text": "Best Reuben ever...kudos to Shawn the cook who made this sandwich to crispy perfection on the outside while keeping it juicy deliciousness on the inside!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q73cmGQiskRmUdEz9SW9bw"
  },
  "qT3NgPA0S5t_bmVBIrlxeA": {
    "date": "8/25/2014",
    "text": "TERRIFIC !!!!  My husband and I, along with our son and daughter-in-law, driving home from a trip to Cleveland, decided to stop in Pittsburg for lunch.  My son remembered seeing a place on Diners Drive-Ins and Dives that was to die for... so, we looked up the address and made a bee-line for Nadines.  TOTALLY worth the trip!!! Even better that we bargained for! The physical location was as described by previous reviewers and shown on DDD, not much to look at, small, etc... but WOW the food shines and the friendliness and service of the staff is FIRST RATE.  Each of us ordered something different so that we could sample each others fare.  We couldn't decide on what to vote the best dish because they were all DELICIOUS!  The burger was amazing, perfectly cooked, juicy and abundant, the Fried Bologna was killer, the grilled hot dog was incredible.  The Reuben was outstanding... Nadines perfectly sliced meat (razor thin) tasted so very good with the perfect amount of sauerkraut and dressing... can't say enough about it.  The Philly Steak was amazing along with the Fried Zucchini.  Guy Fieri was right on the mark with this one... OUTSTANDING and worth a visit.  Oh, and did I mention how incredibly reasonable the prices are... love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CU4NKfGJBQO0hKNtAW1eGg"
  },
  "1FeIGf-mu2-_ynve-ZeU0g": {
    "date": "8/7/2010",
    "text": "tiny, tiny place but huge flavor on the roast beef sandwich and dirt cheap. Recommended",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "opSGpsem_1ItsnX8qULmbg"
  },
  "NeUZjGzZCqLOAnv3NRSklg": {
    "date": "10/12/2010",
    "text": "Great Sports bar with amazing cheap good food!  Great deal!  Cheap Drinks!  Can't beat it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M51neugZMowA5VZI-tar8A"
  }
}