{
  "QTUg-ATxTg1Qh5R1ixREvA": {
    "date": "1/6/2013",
    "text": "I went here to watch the Pitt Panthers bowl game this past weekend. It looks very fancy, typical of a restaurant in a casino. The ambiance was modern and cool. It's very big and there's plenty of tables there. There's even a VIP section. The food left something to be desired though. It's typical bar food. Absolutely nothing special about their food at all. I did enjoy their drink specials though. I've heard they always have nice drink specials so that's a definitely a plus. All in all, it's somewhere that I'd go to again, depending on the drink specials but I will not eat there expecting a meal to match the ambiance.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "pq6SX85MwHW7dMRo_RhDHQ"
  },
  "ph9Lh1AGq3XfefTinruEGA": {
    "date": "3/24/2016",
    "text": "If I was able to give negative stars I would. I just got home from here for a relaxing dinner with my mother and aunt, I just wish I knew the service would be so bad before so we could have gone to McDonalds and been more satisfied. It took 15 minutes for our rude waitress to even come over and greet our table with a half ass smile and what I would assume a migraine from rolling her eyes so much at us. As you can tell the rest of our meal occurred in the same negligent fashion as previously stated.  The best part of the entire evening was watching our waitress run to her gang of fellow lazy waiters and laugh and point to our table reflecting on our frusterations in a passive aggressive fashion. Furthermore,  after ordering a simple shot that sat at the bar for 20 minutes, we figured it would be easier, faster and possibly more pleasant if we simply went up to the bar. There was our second horrible decision. The 3 bartenders were even more rude as they aimlessly walked past us ignoring our orders; counting down the minutes until happy hour was over. I would understand if I was the only upset one but there was another equally frusterated party next to us complaining about the same horrible service. I have never in my life put up with such horrifying service and I normally would not write a review but this experience completely ruined our entire mood and evening. I will never ever come back and make it a point to spread the word of such a terrible establishment run by horrible customer service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TQGOVwPGaq8QNuQb1-D1aA"
  },
  "ZwNeCHFuMWJfpzx4yyj0uA": {
    "date": "8/13/2013",
    "text": "Awesome cheese steak!  Great apps!  I would say you should go during happy hour for drink specials. The menu is pretty basic, but all the food is well made and affordable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M4akx9J4s3TFt7txMfb3Vg"
  },
  "wZoBrth3pABBT2rAYJnHFw": {
    "date": "1/5/2014",
    "text": "Best place to eat in the Rivers. Great food and service for a reasonable price. We ate at every Restruant there. This one is defiantly the best. Friendly atmosphere. They are very accommodating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RGA0Q1v4nzEz1q_ZogKr-Q"
  },
  "rT8PmKM2VWgAIgPmlb0REg": {
    "date": "9/21/2017",
    "text": "This place has gone so down hill. I used to like eating here at the casino but this last trip was awful. It was a Tuesday night, the place was empty and the service was god awfully slow. Everything we had was disgusting. We left all only having a few bites of our meals. The \"filet\" COULDN'T have been filet. It was the driest, grossest meat Ive ever had. Tasted like a frozen meat patty. The crab mac and cheese had imitation crab meat in it...and the cheese sauce was scarce and completely flavorless. It was more or less a bowl of plain noodles with chunks of fake crab. Yum....never again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qrVAvNmRBAYsXuqjl7jR3w"
  },
  "gJYgGOy9t_QEWJAg1XyRkw": {
    "date": "8/17/2018",
    "text": "Fries were good..service good portions good. Club bread needed alot more toast to it",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nzkRy6gZThINDW9vBdq3lQ"
  },
  "gKTukDa8yc9fIDI_Vn7DNg": {
    "date": "3/16/2018",
    "text": "The food is decent but service is just terrible. Servers don't know the menu and the management is absent. In fact, a Manager told me today that \"we don't have the time to get your order right\".  Really could be a good experience if they put more effort into customer service and management'. But kudos to the kitchen. I recommend the wings and ultimate nachos.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C8CcltLxiFjxnVDPldm-6Q"
  },
  "fk_rZ6XD5xgpxYDOnUnYtA": {
    "date": "5/27/2018",
    "text": "Tried the bread pudding and it was the best chocolate bread pudding I hav had so far..taking away a star cos service was kinda slow but food was awesome!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JnFiIKJzPPcdJUdDFTpYAA"
  },
  "w57yz686YZwJbdIdr7CBzQ": {
    "date": "3/20/2017",
    "text": "Not impressed.  Food was okay - didn't care for the potato skins with bbq sauce....just a strange combination.     Service was not good and the bartenders were the rudest I have ever experienced.  I won't ever go back here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fNQt6QsoFGwM_xK9y2aMxQ"
  },
  "5Itu8QEtN2itur8CU4-_CA": {
    "date": "11/6/2016",
    "text": "I'm giving Wheelhouse four stars because of the lingering cigarette smoke from the casino. Nothing can be done to get rid of it.  Besides that, we went at 4pm on Saturday for a drink and apps. No drink menu so you have to ask and guess what you'd like. Service was quick, accommodating and friendly.  I got pierogi nachos(pierogis in cheese sauce, tomatoes, red onion, sour cream and chives). The wine served came filled to the brim.   For the sports fan, there are tvs EVERYWHERE!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5W_LMSthT2jsQOqKFU6IKQ"
  },
  "M_4wfB50KO4QYit3pLVxHQ": {
    "date": "4/29/2018",
    "text": "Good bartenders and our server did fine but our steaks were very over cooked. Would come again just not for steak entrees",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FqUT5t6pw38qdgaHaG6yNw"
  },
  "pSu0DEAjARQeuyzI3P5H4g": {
    "date": "9/18/2017",
    "text": "a restaurant that's in a casino shouldn't have taken 50 min to get our food. Sat on the patio not clean. It was into lunch already. Shrimp po boy was overlooked but was comped. Not a great experience. Always had good service and food here before. Disappointed. What happened rivers?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IlVp8ZQNXqwuACpNqYfPQQ"
  },
  "FEBXNO2Qoxrwu_SCLLx2Bw": {
    "date": "6/27/2017",
    "text": "Great food and drinks - especially the selection on tap.  Big portions and good prices - especially for a casino joint.  Friendly staff - very attentive.  We ate at the bar.  Had the Cobb salad and ultimate nachos between two people.  Stuffed!!  Still had lots of cash to lose at the casino.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FihtMQU-LK8IS6q9RF6VPA"
  },
  "_5zOuRnmZbKIv8rGgPzvMw": {
    "date": "6/6/2017",
    "text": "Captured Audience is how they survive. I have been to the Wheelhouse about 6 times over the past couple of years and I can only remember one time that I enjoyed both my food and the service.  The faux wicker tables in the back are filthy with food particles stuck in the between the slats. The service is always second rate, with lack of management oversight to see if you are enjoying your meal/time.  They are very slow with drinks and to return to see if you need anything at all.   Do not waste your time or money, eat before you get there and save yourself the aggravation of both poor service and ok food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "um9zapZ3vO9XK5Gdp4BWhw"
  },
  "cQVGRSr2uIpDh2fQHlvP7w": {
    "date": "6/4/2017",
    "text": "When asked to meet friends before a concert to have dinner I thought I would give it another chance.... should of saved my money.  I love beer battered fish so I ordered their beer battered fish dinner.  The batter was heavy and over loaded, way more batter than fish, very thick, not light like it should be, bake potato was hard not baked long enough or maybe they nuke it vs baking it, mixed veggies where right out of the freezer bag steamed. Long John Silvers does fish better....   The server was ok not great ... kept calling everyone \"honey\" someone should be teaching them that is in very poor taste.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JhtLYanU8fKkrziFhRhpVQ"
  },
  "9roqkVhhNtu_QYZeNf77Yw": {
    "date": "7/30/2016",
    "text": "The atmosphere and location are great for a casino restaurant, but the food has gone downhill from the last time I ate here about 3 years ago. I had Monterey chicken and my biggest complaint is the the chicken tasted fake!  At a price if $17, I expect to get a decent piece of chicken. On a side note, all the other casinos across the country where I've eaten... the food is cheap, the drinks are free and I win money at least some of the time. But nope, you'll see none of this at the Rivers Casino.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "OKZaB3Hv_k7apLhlgkdWpQ"
  },
  "taJSNt--QQyINpbGKeojAA": {
    "date": "8/21/2016",
    "text": "Have been here several times and always had a good experience bit this past Saturday was awful.  Table for 5, place was really not too busy. Took about 20 minutes just to see the waitress for drink and appetizer order. Another 20-25 minutes for 4 beers and 1 mixed drink. No apps yet. When the appetizers finally arrived,  they were good, but dinner was disappointing.  Dry burger, steaks cooked wrong. Spoke up and saw the manager.  He did take off the burger and steaks but still left a bad taste for this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BJyvv1V7soijiZ75YzRFfw"
  },
  "5vRcx8iiV4z8uvkpEZ9VgQ": {
    "date": "9/11/2014",
    "text": "I was here for the Thursday night football game with the steelers and ravens.  First I waited about 15 minutes to get someone to even come and greet me at my table.  After that I ordered and had onion rings.  Let's just say burger king puts more effort into their onion rings.  Then came the burger with with which I was impressed with till I took a bite and burnt.  It was medium well in the middle as I reauested and burnt on top mot acceptable.  I saw my server a total of 3 times never asked how the food was and didn't see any managers.  Save your money and eat somewhere else or I guess come on a better night.  I'll never be back again and it was my first time here.  Finally I'm here to watch the steelers game why would you give me the check as I planned to stay here the whole game and drink.  Poor service!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FQtvju8V-vPxJreVIrjT3Q"
  },
  "dmY2hhHXL-6zv2AzShObKg": {
    "date": "7/22/2017",
    "text": "I've lost enough money at Rivers Casino were I can fund a small village in Zimbabwe for the next decade. Needless to say when I come to Rivers I usually end up at the Wheelhouse. The food is pretty good here after a night of losing large sums of money. Obviously, the service is a little better when it's not packed. I usually get the grilled chicken sandwich which is standard fare.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BgrC5J_FfcsFHI7vgrJ2Eg"
  },
  "mWmsF0nicUZsYOjT3fKPHA": {
    "date": "6/17/2017",
    "text": "Horrible service at the bar it was like we were invisible. Would never ever recommend this bar what a joke. Manager finally got the attention of a bartender and did not comp our drinks!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WLesxk2QiIEztEq2LK4p7A"
  },
  "iS4JZhL5PmQtPEZXg06k8Q": {
    "date": "12/1/2014",
    "text": "A group of 4 of us dined here Friday.  We had the loaded nacho appetizer to start which was really very good.  I had the fried fish sandwhixh with fries.  The fiah was not crispy and the fries tasted stale, perhaps they needed to change the frying oil.  My husband's burger was cooked too rare.  The best meal at the table was the cobb salad with salmon ($16).  The salmon was nicely done.  The portions here are huge, but the food was touch and go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZV1QYxQ73_hzR6AiXhei5w",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States. Very nice cobb salad with salmon.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZV1QYxQ73_hzR6AiXhei5w/o.jpg"
      },
      {
        "img_id": "YxAQmRfBHj7PuZLcOO0Xzg",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States. Gigantic sandwich and fries.  Looks better than it tasted.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YxAQmRfBHj7PuZLcOO0Xzg/o.jpg"
      }
    ],
    "user_id": "TpDUE7uikk6T6O8oKH1LiQ"
  },
  "6X3faON0PMDVcvZrIxql-A": {
    "date": "6/8/2016",
    "text": "This gem is located at the rivers casino. I'm not into gambling, just food and beer. The Wheelhouse has an awesome view of the city and a great array of screens, including a huge one, to keep an eye on the game.   I have been here a few times and keep ordering their burgers. Drink prices are on the higher end unless it's happy hour. I enjoyed a great burger, fries and 3 beers during happy hour for around $30 and was very pleased.  I recommend this place if you're in the area for a game on the north shore. The crowds are never huge. It's also great for a Pens pre-game if you're riding the T over to the arena.   My only criticism is that they had a limited amount of beers on tap, but honestly, any cold beer will do the trick at a sports bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qtPpesRN8bUXyahr6rZ4BQ"
  },
  "VngOyO096053epS2UCrRzA": {
    "date": "4/21/2013",
    "text": "The food here is not very interesting.  There's no way to keep out the cigarette smoke from the casino, so that's a distraction.  I don't think I will be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "nDP8XivJVxebDddoheJrTw": {
    "date": "1/18/2015",
    "text": "Went to Wheelhouse on a Sunday night with my husband. Service was great (Eric) and food was great. I got the wheelhouse burger with BBQ  pork and pickles and it was very good. My husband got a bleu cheese burger and that was also good. Both came with a side of fries, but it was a nice surprise that the fries are a mixture of steak fries, curly fries and waffle fries. Who likes choosing between kinds of fries when you can have them all? I ordered a cup of chili with a side of cornbread. It came with a large dollup of sour cream that I had to scoop out (way too much) but the chili and cornbread were very good. My husband got the soup du jour which was a creamy potato something and that was also delicious. We were able to watch the SNF game and enjoy a few beers (16oz coors light for $3) and then go out and do a little gambling. This place is a great value and has very good food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3RCyqHVXIgUFZbUVgr73A"
  },
  "5V_5SoU_yttcdsJN41085g": {
    "date": "5/18/2019",
    "text": "Ordered a chili and double stack burger (medium) with mash potatoes and gravy.  The service is great- kind, courteous, pleasant. The mash potatoes and gravy are awesome.  Th chili should be renamed to hamburger soup with vegetables. Very little seasoning.  The medium double hamburger was not pink and warm inside (see pic). Instead well done and dry. Thankful for ketchup.  Did I eat it - yes Did I pay for it - yes  Would I return - doubt it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "neJV2v37dV6Y2mmj176x2w",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States. Allegedly double burger medium - I couldn&amp;#39;t locate the pink warm center instead found dry burger - thankfully ketchup was on-hand",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/neJV2v37dV6Y2mmj176x2w/o.jpg"
      }
    ],
    "user_id": "75ulr6DdTYyBI26g3j3A5A"
  },
  "qDLP98i-Eq5iGAnf79Unrg": {
    "date": "4/26/2019",
    "text": "The ONLY reason to come here is for happy hour, other than that, just don't. And for happy hour I'm not saying it's better, it's just cheaper. I came with coworkers for happy hour yesterday and at first we were going to sit at 2 separate tables but then half of us just decided to stand at the bar. So I'll give you the run down at the bar and at the table:   Bar: this isn't Southside on a Friday night, it shouldn't take me more than 10 minutes to get a glass of wine. The issue isn't necessarily the bartenders (even though they definitely were socializing a lot considering how many people needed drinks) it's the fact that they're SEVERELY understaffed behind the bar. The picture I took shows half the bar and look at the drinks. Every single person has an empty glass. Isn't that the number one responsibility at a bar?   Table: the waiter was beyond confused the entire time. He would come back and say something wasn't available or it was kicked or offer a drink for free then at the end he charged everyone for everything and was like oh I forgot. Getting checks was a literal nightmare also. Considering this is in the Casino and I'd imagine the goal to be pump people in and out so they can gamble, they definitely fail at that.   Anyways, the food is super mediocre also.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wgQ_ibaa1DXCb36A8QH35g",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States. Half the bar with almost all completely empty glasses",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wgQ_ibaa1DXCb36A8QH35g/o.jpg"
      }
    ],
    "user_id": "tJiWkQtxSmr4UdfEp-EYHA"
  },
  "-s_BfY837otwIje88AIAZA": {
    "date": "9/15/2019",
    "text": "Portobello sandwich was ok.  The hoagie was overwhelming but the insides of the sandwich were good.  The pierogi nachos were excellent and my dudes kielbasa sandwich was en pointe!!!  Good place to nosh at while taking a gambling break",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zhpJSjIv6aWkSg_ky08lPA"
  },
  "zkRvWgzW2522bkQ0e2-yAA": {
    "date": "1/12/2018",
    "text": "Came in on a Wednesday at 5:30 and the restaurant was about half full.  There were 4 of us- me, my wife and my parents.  We were seated quickly and our server was over in a matter of minutes.  We knew about the happy hour specials (half price apps & drafts) so we ordered 2 drafts and the jalapeno bites ($5).  My parents ordered a water, a Pepsi and the nacho app ($4.50).  The drinks came out rather quickly, the apps took about 10 minutes.  We then ordered entrees...  The bites came out first and were pretty good but not great.  The jalapinos were rather small but for bacon lovers- the bacon was abundant!  The nachos was a mountain that had everything you would want on nachos.  Perfect...!  My Fish & Chips ($17) came out good but not great.  The fish was a bit greasy as if the oil wasn't hot enough.  The chips were a mix of fries & waffle cuts and were very good.  The mixed veggies (cauliflower, broccoli & carrots) were perfect.    The others in my party ordered sandwiches.  They came w your choice of veggies, fries or Cole slaw.  My wife ordered the Ultimate Burger ($10) med well and it came out perfect.  She loved it and the bite she gave me was delicious.  She said the fries were good but not great.  My mom ordered the Hot Pastrami ($10) and she loved it.  She had the Cole slaw and once she took the small bowl off her plate- her sandwich looked naked.  My dad ordered the fish sandwich ($12) and although he said it was good- I don't think he was very happy with it.  His fries didn't leave the plate.   All in all, we were pleased w our meals and service was excellent...",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "0u-dMW03BL_hLWbfY6V__Q",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0u-dMW03BL_hLWbfY6V__Q/o.jpg"
      }
    ],
    "user_id": "vD2HML4pseH8-0HH3CrWzA"
  },
  "JTsb0v3mcwqq5ourcVjKSw": {
    "date": "1/31/2019",
    "text": "I've pretty much given up any hope of having decent service here. No matter the day of week of level of 'busy' they are, it's slow and unreliable.  The food is decent and the hostesses are always nice/personable, but multiple different servers are just not that great.  I guess it's a non-issue since options to eat at the casino are limited by nature, but a smile and promptness go a long way.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "phsDm7coAiXBV4rCEURedA"
  },
  "x4zFiorGyDkR_o_mA_djdw": {
    "date": "10/8/2018",
    "text": "Being right after a home Steelers game we knew there would be a wait but the manager Clark was SUPER NICE!! Made the wait not a big deal. He came around asking how everyone's meals were and even filled our iced teas. We ordered buffalo chicken dip for an app and I had the chopped house salad which was perfect!! Presentation , temperature and taste! Everything was very good!! We def will be back if in town from New York and when we do we will be looking for Clark!!! Thank you!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xeN5K4XpUXhCtz_oPR4bPA"
  },
  "5nBsTFAYfwCqkFW5cfgPEQ": {
    "date": "7/26/2019",
    "text": "Food fair at best. Phili steak bun so dry and old. Lettuce yellowed on quesadilla. Beer expensive. Won't be back. Expected better for price",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ADCJqjXAsGTXg8Sz9l3Y1A"
  },
  "JhBCD_EwcAyP0SQe_eRfmQ": {
    "date": "1/15/2018",
    "text": "I love the Wheelhouse. By far the best restaurant in the Rivers casino. They have such a wide variety on the menu & the portions are HUGE. I've eaten here several times & always have leftovers. Portions are definitely large enough to share. The meatloaf dinner is one of my favorites. It's cooked perfectly & you get two sides PLUS soup or salad. Can't beat that for $17! Wheelhouse also have a decent French dip. Service is usually pretty quick and the staff is friendly. Their wedding soup is also really good and you can't go wrong with one of the salads. I'd definitely recommend the wheelhouse!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_IRMBJgfNJ-F2xGSbcHJ8g",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_IRMBJgfNJ-F2xGSbcHJ8g/o.jpg"
      }
    ],
    "user_id": "chbCROaKWm2pj5uUT-ruGw"
  },
  "eXydD7svO7Ym5mDndhGQsg": {
    "date": "12/26/2018",
    "text": "I will start by saying the ribs and pork chops were incredible.  Sadly, that was the only good part of my experience.  Let me start by saying I have been a bartender, server and chef for a long time and have managed and have been a trainer in each position.  I went in not expecting serve from the left, clear from the right, high - end dining.  However, service was definitely not what should be acceptable in a casino.  I asked for a wine / drink menu and was told, \"those are hard to come by\" and after our server found one on the adjacent table, was told, \"I can never find one so quickly.\"  (The badly used small menu was definitely beat up, not wiped and was falling apart).  I asked the server the name of the 6 offered house wines and then had to explain twice that I was asking about the brand and not the varietals.  She had to go ask.  In the time she was gone, we decided to get a bottle of Woodbridge White Zin.  (Not my first choice, but my folks like white zin).  During this time, the initial drink order arrived after far too long a time.  When we finally received the wine, there was no bottle service presentation at all.  The foil on the top was very improperly cut as the foil was still above the upper lip on the tip and half under the upper lip with the cork re - inserted into the bottle.  So, the dirty blade made contact with the bottle glass that wine was being poured over.  As I ordered the bottle, I should have been given the first taste.  Nope.  She poured my glass, my father's glass and finished with my mother's glass.  Obviously, she should have been the first pour.  Oh, let me backtrack and say that the Woodbridge bottle I ordered was not the open bottle we received.  We were given a pre - opened bottle of Beringer that was $11 more expensive.  Ordering our meals took a very long time from initial seating.  When we asked the soup of the day, our server had to go back and check.  The three of us ordered wedding soup.  On 2 of the plates, the soup had spilled over making the spoons and cracker packages sticky.  Also, it was the first wedding soup we have ever had with no chicken and no veal / meatballs.  It was pretty much chicken noodle without chicken.  Again, the saving part of the visit was the quality of the entrees.  Also, if proper wine presentation is not standard at your location, it should be utilized.  I have had bottles in different level restaurants in different casinos in and out of Pennsylvania.  It seems a universal standard.... especially when you are presented the wrong wine.  Filled out the online form and still have not heard anything back.  This explains a lot about the team when management ignores their own request for communication.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MYy_V5-r1hM_cS88irIvhw"
  },
  "pw4BREalyiyNsMT5SZHS0Q": {
    "date": "5/4/2018",
    "text": "What a great restaurant inside the casino. My wife and I were doing some gambling and looked around for a place to have lunch. Came across this restaurant and was surprised how much the menu contained. Both of our meals were very good. I had a huge plate of nachos and she had a philly cheese steak with waffle fries/ huge pickle. Our waiter was quick and the restaurant was clean and had a view of the water. We will definitely eat here again. Didn't give 5 stars because the margarita machine was broken! So I didn't get to have one and I was in the mood for a frozen margarita with lunch lol.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BK0lHs9uOOUbYW0H_rar_g",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BK0lHs9uOOUbYW0H_rar_g/o.jpg"
      }
    ],
    "user_id": "nua2Fqvq-A2IIOVpthUufA"
  },
  "U5Bb4YMjsN5TyfuisOn9QA": {
    "date": "7/22/2018",
    "text": "Decent. Sat outside on a Friday evening. Wasn't to busy large portions. Slow waitress. Had to get up a few times to get some forks and napkins. Poor boy wasn't good at all. Greasy and nothing to it. The Cobb salad redeemed this place. Very large and tasteful. Will go back for salads but will sit inside so we can get some service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LSMEAPaTDVHwRKYpV09PoA",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States. Poor boy",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LSMEAPaTDVHwRKYpV09PoA/o.jpg"
      },
      {
        "img_id": "1G9k-vxNk8yuOHla0VFn_Q",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States. Cobb salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1G9k-vxNk8yuOHla0VFn_Q/o.jpg"
      }
    ],
    "user_id": "MsiMQACd1shjlxUcr0ZcxA"
  },
  "mq1DK52CToRVhkLsYmbQuQ": {
    "date": "1/28/2017",
    "text": "After having my high hopes of attending the grand buffet crushed by a long line of other hungry hopefuls all rushing the gates prior to closing, I decided to wander down to the wheelhouse...  The wheelhouse offers a nice happy hour until 7pm with some good apps at half price definitely made for sharing!   The menu items include a few items customized to Pittsburgh including Pittsburgh nachos which looked quite interesting.  I decided on a burger and was pleasantly surprised by the taste.  The only down side would be regular food items (like burgers or chicken) are a little pricy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-Pknhn3NJDakzJR-Jebscw",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-Pknhn3NJDakzJR-Jebscw/o.jpg"
      },
      {
        "img_id": "cmmIh3ItrZkFmJsijvkcnw",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States. Massive Loaded nachos only $4 during happy hour",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cmmIh3ItrZkFmJsijvkcnw/o.jpg"
      }
    ],
    "user_id": "ulQ8Nyj7jCUR8M83SUMoRQ"
  },
  "qeA9EHUaBlplq-r21kbSFg": {
    "date": "2/2/2018",
    "text": "You know when food looks good but doesn't taste good?  We have a case of that here. I ordered the burger that the Wheelhouse is known for-The Wheelhouse Blue Burger. It had bleu cheese and horseradish added into the burger. It comes with a bacon onion jam along with tomato, onion, lettuce, and a whole pickle with fries on the side. I ordered my burger medium. When the burger came the patty was unevenly made so some bites you got a nice bite of beef and some the patty was thin. My burger was well done-no pink to be found. I didn't taste bleu cheese but you could taste horseradish. That was a nice taste. I then added the Bacon Onion Jam which came on the side. I liked the addition of the bacon flavor but the jam was incredibly sweet. Too sweet.  My hubby ordered the Pittsburgh Skillet. It had kielbasa, sweet potato fries, onions, cabbage, cheese sauce and topped with 2 fried eggs. The dish was 80% sweet potato fries. There were only 2 small pieces of kielbasa. My husband picked through it trying to find more kielbasa only to come up empty forked. He left most of the dish uneaten.  We ordered an apple tart for dessert. The tart was an inch and a half thick. It was dense. It was served cold. There was a thin layer of sliced apples that were limp. There was a small scoop of cinnamon ice cream on top. Then it had caramel poured over top. It looked pretty but the only flavor was from the cinnamon ice cream.  We came. We ate. No need to come back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "v2b6aWZ1xk9GTaPwJ9H50Q",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States. Apple tart",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v2b6aWZ1xk9GTaPwJ9H50Q/o.jpg"
      },
      {
        "img_id": "akdI5OQ6fOEzrc6M5yQXAg",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States. Pittsburgh  Skillet",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/akdI5OQ6fOEzrc6M5yQXAg/o.jpg"
      },
      {
        "img_id": "qpkMQ-UlM04bh7jvnIpP_w",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States. Wheelhouse Blue Burger. No tomato. No onion.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qpkMQ-UlM04bh7jvnIpP_w/o.jpg"
      }
    ],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "1WtS-zasnplVoWF8cEjy7A": {
    "date": "4/2/2017",
    "text": "Disappointed. We were a group of five and everything seemed a bit unorganized. For example, only two of us got complete place settings and all of us had to wait ages for our waters to be refilled. There seemed to be an issue in the back of the house, as they ran out of clean glasses (they served us plastic cups), clean cups for soup (they had to serve us bowl sizes, but hey more soup for us), and also small plates (we got large plates for appetizers). It was actually kind of comical because every time something was brought out to us, it came with an apology.   The food was unimpressive. I ordered the Portobello Grinder and it was a soggy mess. The fries tasted like they were sitting under a heat lamp for a while. On the bright side, my mom really enjoyed her salmon. No one else was singing praises, though.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DtzguIRjy-oRbrwVidAxQQ"
  },
  "CaUColi3C43VDlNJdFWBYg": {
    "date": "9/29/2018",
    "text": "Decided to eat here and have a couple beers while my wife was gambling. To make a long story short. The pretzel bites were hard as a rock. The wings weren't horrible, but they put cold sauce on the wings without heating it which of course made the wings cold. The Staff is very friendly, but very inattentive and unorganized. On a positive note, the flamethrower sauce was good on the wings. Unfortunately it felt like I was eating wings I just pulled out of the refrigerator.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HSUSoDAZ-51a5x6Hkq6DiQ"
  },
  "IfijlbE4w2A9d2WU5okBSA": {
    "date": "2/16/2017",
    "text": "When I am at the casino, I love to eat at the wheelhouse. I have had a few things here in the past but the last two times, I have ordered the portobello mushroom sandwich which is so good. First time I added chicken and the second time without. They are both good. It's has this brown gravy like sauce on it which makes it really flavorful. I definitely recommend the fries with everything on them as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GQf-RDt9Q_SAZZ6wi1vTyg",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GQf-RDt9Q_SAZZ6wi1vTyg/o.jpg"
      }
    ],
    "user_id": "mA3tALTzmDunDRctGEu-wA"
  },
  "Wk5ttGZYnKH02dneE5QpPw": {
    "date": "2/17/2019",
    "text": "Great service and reasonably priced food. Was very crowded but it didn't seem to slow down the service or the time to get our food. Portions are huge!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RVcViYk_cR2iQDXu0h71rA"
  },
  "fRqGOYHYkwDISSBWIRUzMQ": {
    "date": "8/7/2018",
    "text": "This is a good place to eat, after playing some slots my wife and I sat for a early dinner outside. I ordered the Cobb salad and she had the Po boy. Both came out looking good.  When my salad was placed in front of me it was enough to feed 2 people, we could have shared. My wife's sandwich could have had more to it but it did have a good taste . We had a nacho appetizer which was also good, the appetizers was a nice size, which we shared. The only complaint that we had was that the service wasn't the best. We would eat here again, but the service needs some improvements. I gave this place 4 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f5SgN_5ukI1WAGkOSIuuIw"
  },
  "qK-s4ldvVbvqbCv-NA5n0w": {
    "date": "5/26/2015",
    "text": "Great cuban sandwich on a pretzel bun.. amazing!!!! I love this restaurant!  Its conveniently located in the Casino and I often place takeout orders. The bar staff is courteous and so on the ball.  I can place a takeout order - and play some penny slots and in 10 minutes time my food is ready.  I have never had to wait long for food.  I have had the steak hoagie, and the chicken Caesar salad and they too are amazing and fresh.   Wheelhouse is a little bit more pricy than a restaurant chain perhaps but I think its worth it.  My fellow yelpers.. I totally recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_lisWACTWWkdJm1DlAh_ww",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States. steak and cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_lisWACTWWkdJm1DlAh_ww/o.jpg"
      },
      {
        "img_id": "SqV2zE9UTopYRPTVFZOLeA",
        "caption": "Photo of Wheelhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SqV2zE9UTopYRPTVFZOLeA/o.jpg"
      }
    ],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "UtYxWqZnN4k_ANqF6WZdpw": {
    "date": "9/1/2018",
    "text": "Food was great.  Highly recommend the burgers, especially the bleu cheese burger.  Seasoned wings with sauces on the side are good too.  However the service, if one can call it that, was so appallingly bad that it killed the whole meal.   I used to be a server so I m pretty tolerant.  But, this was unacceptable.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "exB4YgzlIPwo5wC9La2zDg"
  }
}