{
  "D4FC0t2LyyDfqaECrztOvg": {
    "date": "5/14/2005",
    "text": "Best cheesesteak in town.  The bread is baked fresh and delivered everyday specifically for the cheesesteaks.  The meat is to die for, thinly sliced right off the eye of round and then fried up in its own fat.  Tell them to lightly toast the bread and you'll have a foodgasm.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c8qFkI_VusWo0xZvkjfBWQ"
  },
  "fkIQrIRuhk2wOxTDaRHQqw": {
    "date": "1/21/2015",
    "text": "Mitchell's has continued to surprise me over the many years I have stopped in.  I am in no way a \"regular\" but I do like to stop in a handful of times during the year and every time I'm there they have done something new to basically accommodate customers to create the best environment for them.  I've never seen a Bar or Restaurant LISTEN to it's customers as much as Mitchell's.    Two things that HAVEN'T changed over the years is the awesome service and great affordable food.  So I hope those things stay the same!  It's no question as to why they've been open for over 100 years and are the oldest bar and restaurant in Pittsburgh.  (DONT LET THE OYSTER HOUSE TELL YOU DIFFERENT!)   I recently signed up for their first Paint Nite knowing that they would probably use the upstairs.  It was a first date for me with the girl being from out of town I had two options this evening: Take her to a Pens game or go to Paint Nite...   and I definitely picked the RIGHT choice (she was not much of a hockey fan) but we would have stopped in there in any case since the parking is free after 6 and its close to Consol.    They knocked their first Paint Nite out of the park.  It being upstairs was like having our own personal Paint Party and did not have to fight with anyone to get a drink or food even though the downstairs was PACKED for the game (as usual).  They even kept the kitchen open until 9 (they usually close it at 7) specifically for the Paint Nite guests.  Gina, our bartender, was very attentive and seemed to be enjoying the event just as much as we were.  Bottom Line: I'll definitely be back for it.  Mitchell's has never disappointed me and for how much fast food/commercialized restaurants there are downtown I can't think of another place that can beat Mitchell's home cooked meals (AND affordability) with the friendly atmosphere that every family owned business should have.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v05Gm3lJTZhZ5L4E3MWr4g"
  },
  "-2HXd4gNhy7JVtPRjXhE9g": {
    "date": "10/23/2014",
    "text": "I was introduced to Mitchell's by a friend of mine and have been a big fan ever since!   The staff is always very welcoming and everyone at the bar always look like they're having a great time.  Their garlic parmesan wings are usually a go to for myself and friends, along with a Titos vodka of course. I look forward to many more happy hours to come!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ySFAoZqGrDkql7ulAm5kGA"
  },
  "AjP1aSK8mH1HcXJ3TOkPSg": {
    "date": "3/7/2016",
    "text": "Walked in with high expectations, and certainly was not disappointed. Waiter was kind and attentive. Got the mushroom burger cooked medium. If you like your burger anything under or over medium well, just ask and they will do it. Burger was fantastic and would highly recommend. Also got beer braised buffalo wings, and loved them, but they were $8, which is kind of expensive, but not to bad. Definitely recommend it, and give it a solid 5 stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Lzr4NSV4eFDq-T-Amur2A"
  },
  "tno35P14-BRFumbV_xApGA": {
    "date": "4/30/2016",
    "text": "Excellent service and excellent food. Had one of the original dishes turkey and it was amazing. We will be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "puM2bUS4osof1lVQeCmCAw"
  },
  "O9Yje7AMXhJ798j080piNA": {
    "date": "12/7/2012",
    "text": "You know what the problem with having a tummy bug is?  Well for me it's that after a day and a half of feeling miserable and having no appetite, I'm h-u-n-g-r-y afterwards.  And what better way to satiate a post recuperation hunger with a good burger?  And I mean a really good burger!    Such was the case this past week with me.  I took care of it with a good Mitchburgher Burger.  Mmmmm!   I ate that entire 1/2 lb beef patty with all it's charbroiled goodness topped off with lettuce, onion, pepperjack cheese and their special sauce--with a side of fries.  My coworker looked at me in amazement and asked \"My lord, Susan, where'd you put all that\"?  Hey, when you've got the post flu munchies, you've gotta take care of 'em.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "UtkjXTiMfGRz4R1zDF3Kxg"
  },
  "bH0lMpJQFjEPaD3ZkOK97w": {
    "date": "12/3/2015",
    "text": "Joe is absolutely amazing. Love coming here after a hard day at work and unwinding. Makes you feel like family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mUbIcYFzkkvLXP0yV4RpqQ"
  },
  "DcLU98HZyZNBQdwNptDClw": {
    "date": "3/19/2015",
    "text": "Mitchells is my favorite place to go downtown! The food is great and the staff is AMAZING! You cannot beat the hospitality!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LSy2ExGE8K3jAflzPFDcWQ"
  },
  "RxbFFEPsEd1OAZf2xHuhyw": {
    "date": "3/20/2015",
    "text": "Went here between sessions of the NCAA basketball tournament for a quick dinner. Upon entering was told to go upstairs to dining room where a limited one page game day sandwich menu was presented. My friend ordered the fish sandwich which looked ample but not big by pittsburgh standards. I ordered the fried shrimp and they brought out 7 teeny little breaded frozen shrimp not even worthy of being called an appetizer. Major disappointment as the place was full by the time we got our food, which made sending them back and waiting for another selection impossible. This place needs an overhaul... Went back downstairs and saw people enjoying full chicken dinners... Where were they on our menu??? I wont eat here again",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TdkhJ3q4iWpWPbfhKBMKeQ"
  },
  "1zu_NY6S3ea-1ZLLSLViyw": {
    "date": "2/15/2012",
    "text": "Fatties unite! Fried is their specialty!  This place is pretty good. No culinary masterpieces here, but you can get a satisfying lunch for pretty much less than 10 bucks.  I was told that fried items are what they do best here and I had the coconut shrimp which was delicious.   It's definitely where professionals in the city go for a quick lunch and the servers and pretty speedy.  I say give it a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "fFPc6xeOebK1ns8qYuUfew"
  },
  "AJvoGgXAZoUkFlkAlk1phg": {
    "date": "1/3/2015",
    "text": "I can't think of a more Pittsburgh bar and restaurant than Mitchell's it's the oldest in Pittsburgh and one of the best. Drinks are reasonably price and food is great. Don't even get me started on the atmosphere there, they really know how to make you feel at home. If you're unsure of what to get just ask Matt and he will tell you all you need to know. I don't know how else to get you there just stop reading and go already",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kix9zclvsCLjQhOO9XmiVA"
  },
  "of8mpOHebIY24brNel1Brg": {
    "date": "4/29/2016",
    "text": "Awesome food!  Corn chowder was delish. Smoky ranch dressing was superb. Very nice people, great service and the vibe of of old-fashiony games was cool",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I3L1QBwJMn2fFJx0aL0K8w"
  },
  "dCsRbzB2tkzd5kiGvg-KKw": {
    "date": "3/17/2014",
    "text": "Okay... normally I like Mitchell's- but today they had the Corn Beef and Cabbage/Potato special for St. Patrick's Day.  Well the cabbage and potato were just boiled with no flavor and the corn beef was lunch meat probably cooked again-now has lost all flavor.  I was so disappointment.  And I hate spending money on food that just is not good.  Sorry.  Thank goodness I had hot sauce and pepper.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bLQnmossluXqgg6PaipXgQ"
  },
  "BNo_OnH6gELkJedHFOaCCg": {
    "date": "7/29/2015",
    "text": "Great place for lunch and happy hour. Food is always delicious and you can't beat the daily specials.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A7FSfCuL4z3RnNfl0lJhnA"
  },
  "LaSg1wlkosR6aSiuzxyo3A": {
    "date": "4/21/2011",
    "text": "Beer, beer, and more beer.  It's definitely a low-key nieghborhood bar.  As an out of towner, I enjoyed it.  It felt like Pittsburgh's version of Cheers except grimier.  Unfortunately, the kitchen closes fairly early on weekdays otherwise this place may have received another star.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9QoXklTk-Fl1Q1Cy8fCbdQ"
  },
  "XJTijGA3LyIRIm4Kgt9wjg": {
    "date": "7/14/2010",
    "text": "I really wanted to like this place as it's been in downtown PGH for a hundred years or so.  Even gave it a couple chances...  First time I tried a special which was a shrimp quesadilla.  I guess I shoulda known better than to order a dish not originally created in America at a Pittsburgh bar/restaurant but I tried, anyhow.  The waitress brought out a still sizzling metal pan of burnt teensy-tiny bay shrimp that were definitely from a frozen bag.  They were stuck to the pan and so charred that I had to send the plate back.  Eww.    Next time I went I decided to keep it simple and had a burger, which they claimed are their specialty.  The burger was huge, yes, but overcooked and completely unseasoned.  Blah!  During this visit I also had an awful waitress who was quite busy frantically gossiping with another waitress who was actually trying to do her job.    I had Bass on tap during both visits and could barely finish them because they were so warm.    And on top of it all, it ain't even cheap!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "0qURFmBuyYvpOrxVrTt5sw"
  },
  "lPVEbuL1gENcvsYXEckzpA": {
    "date": "1/15/2015",
    "text": "Went here for a PaintNite Pittsburgh with some coworkers.  Great location for the event (had the upstairs reserved with the upstairs bar just for the painters), but the downstairs non-smoking section was extremely small and cramped and the service was very poor (very slow for the 4 tables she was tending to, messed up our checks twice, told us they had things then didn't, never asked how things were, etc.).  NEVER DO  THE TACO TUESDAYS OR 3$  MARGARITA SPECIAL.  The taco shells were so stale they were disgusting, the meat had no seasoning/dressing.  I wouldn't expect a great taco for $1, but taco bell would be a better choice.  So if their other food options are anything like it- I HIGHLY DO NOT RECOMMEND.  I wouldn't expect a great margarita for $3 either, but there was not a drop of alcohol in it- pure mixer/sour.  Before ordering it, I asked the waitress how they were and she cued some girls sitting at the table next to us, they tried being nice in their response of \"eh they're pretty weak\".  Another coworker tried a burger instead (better choice), but for the price for it to not include a side- not worth it, plain jane burger.  Overall, I do not recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cXoZIiVc9DXYkMNzq-UbAQ"
  },
  "OSYZ6mnNRMAcCN7zHo9vew": {
    "date": "7/25/2015",
    "text": "Went for lunch while visiting Pittsburgh and had the Greek salad with salmon. It was delicious! Amazing selection of beer on tap. Even better was the friendliness of the staff. I will definitely come back next time I'm in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CuaRS3TvJrlSIEG0RosvGQ"
  },
  "UKpy9ev8xGn4Xfy3aHy-QA": {
    "date": "10/8/2015",
    "text": "Very good service. Very good prices. Food was very good value. Nice after work location with friendly staff and non-sketch patrons. Will go there again. Tons of craft beer choices and awesome happy hour rituals.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0mzedKPqeCFOaFMRG-e_Kw"
  },
  "E4QmU5Q1KcCdtAgvq9j3Ew": {
    "date": "8/25/2008",
    "text": "Comfort food, that's what this place delivers. I came here for a lunch with five other people and this was some good, old fashioned comfort food. Two people ordered the hot turkey sandwich, it was open faced with mashed potatoes and gravy smothered over top the turkey sandwich. Two other people ordered the hot roast beef sandwich. It was also served open faced with mashed potatoes and gravy smothered all over, but it was a darker gravy. They all got the vegetable of the day, peas.  I got the soup and sandwich, $5.99, which included a large bowl of cream of mushroom soup. It had whole mushrooms (button and portobello) and was a light cream, not as creamy as I would have liked, but still good. It came with a tuna salad sandwich that was tasty. The last person in our party got the tuna melt on rye which she gobbled up whole and a side a fries, also very good.  The loss in stars is because we asked to sit in the non-smoking section and were basically ignored. The host said, \"Well, after 1pm it doesn't matter, the top of the restaurant is closed\" so we were sat smack in the middle of a smoke filled section. The service was ok in general.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mwB6MuCknEUq_DWhRwyMYA"
  },
  "Va-fYi39WEmcQ29ZKuxx5A": {
    "date": "12/2/2008",
    "text": "If there was a button that said \"not for vegetarians\", I'd click it.  That aside, my carnivorous friends really like the comfort food this place serves up, and the bar staff is quick and friendly for their happy hour.  A large chunk of the crowd in the afternoon and early evening are lawyers, as this is where they head after work in the nearby buildings.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BWFF5dX7oE5F-IB8hc36Kg"
  },
  "edqv4nRqT6TIiGVmmAnWvw": {
    "date": "5/12/2019",
    "text": "Great downtown establishment!!  Great food and great drinks and a really nice outdoor seating space.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tow80SY2wMwbVtSVpx2bmg"
  },
  "S5UqtiHlWy700hpgq7Fdtg": {
    "date": "12/1/2018",
    "text": "This is a great place for gatherings and food. They have some great seafood.  As for gatherings, they provided quick service, had a decent amount of drafts on tap, and good people.  We traveled here for a coworkers last day at the office. Good times.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zJi-5BAnx37jIuwvD9mZZA",
        "caption": "Photo of Mitchell's Restaurant Bar &amp; Banquet Center - Pittsburgh, PA, United States. Ben&amp;#39;s last day at work",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zJi-5BAnx37jIuwvD9mZZA/o.jpg"
      }
    ],
    "user_id": "_-Tvg5rZiPC-e-jM04DzKw"
  },
  "Nxjag8c-zdDw93-fYPbRbg": {
    "date": "2/21/2019",
    "text": "This is a super cute, super tiny store. Almost like a newsstand moved indoors without all of the newspapers. Though they do sell them here as well as lottery, breakfast sandwiches, donuts, soda, candy, coffee, etc.  Justin, the owner is very nice and friendly. Prices are comparable to other types of stores in the downtown area.  Located on the lobby entrance of the Mitchell Building just to the left if you're on Ross Street standing in front of the structure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "k5BbtRr8IllhFDjXSYf7QQ": {
    "date": "1/29/2018",
    "text": "My girlfriend suggested we go here for lunch now that the downtown location of Storms has closed. She took me up a flight of stairs. We were greeted warmly and sat down at a table overlooking a window.  They have daily specials which are posted on one of those triangle boards outside the restaurant. I decided to go with the chicken breast sandwich with coleslaw. She went with a spinach salad topped with salmon. Her salad was supposed to come with a bacon dressing.  We got our food in a descent amount of time. My chicken breast was very thick but was on a regular bun. It was good but very messy. The coleslaw was average. My girlfriend told me that she loved her spinach salad however, it seemed as though the dressing she got was more like a vinaigrette than a bacon dressing. She inquired about it and was given another. She later told me that it still tasted like a vinaigrette.   Prices here seem to be much more reasonable and you can get away with a sandwich and side for under $10.00 if you aren't ordering drinks. There is a bar area which wasn't open during our visit.  The place is clean and the staff very friendly. They have other items on the menu such as paninis and I understand their specialty is hamburgers. Will have to try one next visit here.  I gather that we must have eaten in their banquet hall. I did not get the opportunity to see the restaurant and bar below.  It makes for a descent lunch if you work near or in the area and are under time constraints because of work.",
    "rating": 3,
    "rated": {
      "funny": 6,
      "useful": 14,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "Cm3FffzoS1MdhTZ2BAIEOw",
        "caption": "Photo of Mitchell's Restaurant Bar &amp; Banquet Center - Pittsburgh, PA, United States. Chicken sandwich with cole slaw",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Cm3FffzoS1MdhTZ2BAIEOw/o.jpg"
      },
      {
        "img_id": "aVet5arEnj3JYzAl3H5oOA",
        "caption": "Photo of Mitchell's Restaurant Bar &amp; Banquet Center - Pittsburgh, PA, United States. Salmon salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aVet5arEnj3JYzAl3H5oOA/o.jpg"
      }
    ],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "xRNe0CloR6W9oC_f2VCw_w": {
    "date": "4/25/2018",
    "text": "Good Food at a great price. same with the drinks all very reasonable. I am not a smoker and didnt realize that this was still a place you could smoke in, just not my thing. Other wise a good experience and great service. I would go back to drink, just not to eat",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hqscQv8mLiqlBg9BVCNHdA"
  },
  "AvInkIsMSxizNupu_apqaQ": {
    "date": "11/28/2018",
    "text": "First time in Pittsburgh. My hotel recommended Mitchell's Pub. The staff at Mitchell's (Rausche and Sara)was so welcoming. One of the famous regulars gave us a history lessons on the pub. A must go to if you come to Pittsburgh.. Great bar! Great people!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bhcw7urc189WuPzmM5bagg"
  },
  "WmrvdxhJX5iqmkpMEIvLzQ": {
    "date": "12/28/2015",
    "text": "Half of Mitchell's is a bar and the other half is a family friendly diner. I'm not sure how the bar side is, but the diner portion is lovely. The atmosphere is very warm and bright. I really appreciate it when a restaurant has proper lighting and kudos to Mitchell's for providing that. I came here around the holiday season and it was all decorated. The service was quick and wonderful. Our waitress was a sweetheart. My only complaint is the cigarette smoke leaking in from the bar side.   As for food, I got to try the chili, Mitchburger and original fish sandwich. The best entree on the table was the burger. It was packed with flavors and bacon. I wish they allowed the option to request it medium rare, instead of coming out fully cooked. The chili was a bit bland, even though thick with meat. I suggest adding a pinch of Cajun and a pinch of salt then it'll be perfect. The fish sandwich was HUGE, but came with nothing except two buns. I suggest slapping on some sauce and dress it up with lettuce/tomatoes. It was so dried without any sauce and plain old ketchup just doesn't cut it. Add a special house blend sauce that's creamy with a spicy kick, then that'll be 5-stars worthy.   Although there were minor flaws in the food, I see potential in this place and would love to return here in the future if I'm in the area. Portions are huge with tons of meat and prices very affordable for the amount of food.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dXGijj4ZLWbS6cBQPKNIQQ",
        "caption": "Photo of Mitchell's Restaurant Bar &amp; Banquet Center - Pittsburgh, PA, United States. Chili, Mitchburger and Original Fish Sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dXGijj4ZLWbS6cBQPKNIQQ/o.jpg"
      },
      {
        "img_id": "wSxBHw-JgG4VWdXKEoE3Dg",
        "caption": "Photo of Mitchell's Restaurant Bar &amp; Banquet Center - Pittsburgh, PA, United States. The family friendly diner half, the other half is a bar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wSxBHw-JgG4VWdXKEoE3Dg/o.jpg"
      }
    ],
    "user_id": "H_09-Wr5JcN5hpp5RnSLTA"
  },
  "YWQamR_QZ9J784fmd69Ixg": {
    "date": "3/17/2019",
    "text": "Great place to go on st Patrick's parade day! Good food, family friendly. A little pricy but worth the food and really nice waiting staff as well",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dUUgbnVTy8MiOp47Pr5GfA"
  },
  "4MGTtOICUzJWc7HJE4icdA": {
    "date": "11/2/2017",
    "text": "The fries are good. The bowls of soup are pretty hearty but again back to the fries. They're hand cut and addictive! I stopped here for a quick bite to eat and after passing this place often I finally stopped in. The place is bigger than it appears and clean and the staff here are not only kind but they're quick too. I only had thirty minutes to eat and gobbled down the chicken fingers and fries. I however do have it on my list to try their fried fish as it looked all types of yummy. This is comfort food at a reasonable price. No one at the table had any complaints. I can see why this place has been around for so long. Also the beer selection has a variety to offer. The only thing that might drive you crazy is finding parking downtown but again the fries make it worth it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tekHDsd0fskYG3tqu4sHQw"
  },
  "EBPhjGDoSc0gf8duK2pcyQ": {
    "date": "7/25/2013",
    "text": "I'm going to need to update this because I've only had take-out for lunch. That is because their specials are great!!   Each month, they make a new calendar with all of the specials each day (2 each at about $7.65) I've had the crab cake sandwich with fries which is delicious! oh my goodness that plump, deliciously seasoned crab cake was fabulous! I've also had their special with baked chicken, mashed potatoes & gravy, veggie + bread & butter.. for $7.50. Feels like a Thanksgiving feast!  I've always experienced great customer service and happy faces while waiting for my take-out. I'm looking forward to coming here for a nice dinner with my other half very soon and updating this :)  They have a bar side with a bar (obviously) some booths and high top tables. Also, there is another side with just booths. The second floor is also available and that may be where the banquet hall is located.  Check the Lunch Specials!  <a href=\"/redir?url=http%3A%2F%2Fmitchells.tv%2F&s=e7ae9003466a241bcbebf629c46928b446e8528c65d3e78856c1c4b387f59ed1\" target=\"_blank\" rel=\"nofollow\">mitchells.tv</a>",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "24_hEc0A4yS34AnanULqZg": {
    "date": "8/8/2015",
    "text": "This is more of a review for their banquet hall upstairs as this is where I had lunch today.  Decent food at with good prices - I had a Cobb salad and fried cheese, which I will say was one of the better versions of this appetizer that's a staple in my house. Nice crispy breading and gooey cheese that didn't ooze all over the place.  Our table was drinking rolling rock or miller lite bottles for $4.25, which was more than I'd expect to pay but not outrageous.  Service was OK, we were here for a special event so I can't blame them for being a little overwhelmed a bit. Decor is certainly lacking.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhQOA8-FdpA6D0hNhXEYIw"
  },
  "eyMLdnRBSWh3AqafPmy0Pw": {
    "date": "3/10/2015",
    "text": "I haven't been in this place for like 15 years or so and had even forgotten what it was like.  My first impression when I walked in was how clean and well maintained it is for a place that's been around like forever. I had a seat at the bar and was greeted with a smile almost immediately before getting a menu and a raspberry ice tea.  I chose the meatloaf sandwich which came with mashed potatoes and roasted veggies. It took less than five minutes to be presented to me and the  whole plate was smothered in a brown gravy.  Everything was truly delicious with the exception of the bread which had a really tough, stale crust.  If I was to order this meal again I would ask them to hold off of the bread and just go with meatloaf and gravy.    Although I was here for lunch,  I should also add that it has great potential for happy hour. There's a full bar and five different craft beers on tap. It looks roomy enough to hold a happy hour crowd too.   I give it four stars despite the tough crust.  The service was exceptional, the rest of the meal was delicious and it just seems like a comfortable place to hang out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ba8O7MxFTqFnzELnr9nDTQ",
        "caption": "Photo of Mitchell's Restaurant Bar &amp; Banquet Center - Pittsburgh, PA, United States. Inside the meatloaf sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ba8O7MxFTqFnzELnr9nDTQ/o.jpg"
      },
      {
        "img_id": "s3IP7slfRevIfdgbrHt6PQ",
        "caption": "Photo of Mitchell's Restaurant Bar &amp; Banquet Center - Pittsburgh, PA, United States. Meatloaf Sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s3IP7slfRevIfdgbrHt6PQ/o.jpg"
      },
      {
        "img_id": "stFQwweUJVm2HMdvV9g83w",
        "caption": "Photo of Mitchell's Restaurant Bar &amp; Banquet Center - Pittsburgh, PA, United States. The Taps",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/stFQwweUJVm2HMdvV9g83w/o.jpg"
      }
    ],
    "user_id": "cUqU7UfSaamDg0L5TIJPRg"
  },
  "c0FYflfuif8d8ZbZFAzsCw": {
    "date": "3/28/2018",
    "text": "Thank god they are finally closed for business. The food was horrible. Place wasn't that clean.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PmcOVQ52qTLIrS2tTf1ndw"
  },
  "SLBH4I8o8j-zLNXhYsN_Rg": {
    "date": "1/23/2016",
    "text": "I'm a little embarrassed to admit that it's been almost 2 years since I've gone to Mitchell's. It's the perfect lunch of happy hour spot for downtown, what have I been thinking?! I stopped in for lunch today and was truly impressed with the changes I saw. Even the bathrooms have been redone! They've way upped their menu game too, it's not just divey bar food anymore. My lunch was delicious, and served with a smile.   I really need to come back for a happy hour or maybe before a Pens game. They have lots of drink specials posted in the bar area and I'm also a huge fan of no smoking (I do think you can smoke late night still, but you cannot smell it during the day!). Mitchells has really stepped up their game since my last visit and I will certainly not wait another 2 years to return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SJQTqW0Uf4V9MNX1ogtw6g"
  },
  "wsWQJnpBdomnPvdGc8mneA": {
    "date": "5/2/2016",
    "text": "I recently had my wedding shower at Mitchell's Restaurant in their upstairs banquet room.  I would 100% recommend others to use Mitchell's for their next event.  We worked with Gina who was extremely nice and professional!  They were flexible on the layout of the room, food selection, and bar selection. Also, the cost was very reasonable.   On the day of our event the food was delicious, the drinks were great, and Gina was there to make sure everything ran smoothly.    Planning a wedding can be challenging, but having the wedding shower at Mitchell's was a True joy!    I have attached some pictures from the shower.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "24to1YHum5gqGUHPLqdSsA",
        "caption": "Photo of Mitchell's Restaurant Bar &amp; Banquet Center - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/24to1YHum5gqGUHPLqdSsA/o.jpg"
      },
      {
        "img_id": "rfoVHJGHIKLkcEqlRc75-w",
        "caption": "Photo of Mitchell's Restaurant Bar &amp; Banquet Center - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rfoVHJGHIKLkcEqlRc75-w/o.jpg"
      },
      {
        "img_id": "RapDH0O4W3j2H2xjRofORg",
        "caption": "Photo of Mitchell's Restaurant Bar &amp; Banquet Center - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RapDH0O4W3j2H2xjRofORg/o.jpg"
      }
    ],
    "user_id": "86pZCj0yM0jCSlKOCOnSdw"
  },
  "Ik2lIGu88-O5NAUcGE_zUw": {
    "date": "12/7/2017",
    "text": "We had our work Christmas party there last night and it was fantastic! We have the upstairs reserved with a food buffet all set up. The food was excellent and the staff was great. Everyone was laughing, smiling and having a great time! Would definitely recommend having more parties there!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0HIe_z0NnkeFI1J26vbr4w"
  },
  "JDeBJErhWOEQ9UQE0sHl5A": {
    "date": "10/25/2017",
    "text": "Don't miss the Thursday Night Happy Hour, $2 off craft beers. Still would be nice to have a food selection.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1SVRZizwJdh1AYbB5O8Cw"
  },
  "N4MDjOHZimShrnq--LgjMg": {
    "date": "8/27/2015",
    "text": "Mitchell's has upped its game adding a 24 tap system, with 20 rotating crafts.  The prices are reasonable for a downtown establishment and a great place to go if you are parking and walking to an event at Consol, or hopping the T to HeinzField or PNCPark.   They also hired a new chef, he is formerly of the urban tap, and brought a new and inventive menu with him.  The classics that Mitchell's was famous for are still here but the menu compliments the changes they made that the front of the house.   One final note. The bar area is non-smoking during the day (great for business lunch or happy hour ) but becomes smoker friendly later in the evening.   Highly recommend Mitchell's",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XfZIw2MvQqABQz5TSpU7EQ"
  },
  "gkH9h14YgUcnDe6wAhxGIQ": {
    "date": "12/16/2014",
    "text": "Working downtown, there's not a lot of places I can go for lunch that offer such great quality and are so friendly! I thought it was very cool that it is the oldest restaurant in the 'burgh, and I can see how they've survived for so long.   I highly recommend Mitchell's to anyone who wants good service and a great meal for lunch downtown",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1WZZcQ8GEIsWx5Dn63lXkA"
  },
  "_V5a_DPgAkukIx3BzdOvrw": {
    "date": "1/27/2016",
    "text": "I usually leave my office at 1PM daily for lunch with a few friends dubbed the \"lunch crew\" and we often frequent Mitchells.  When you walk upstairs to the main dining room, nothing jumps out at you except for standard, basic, run of the mill. Typical cafeteria chairs and tables.   One day the \"lunch crew\" was looking for a burger and we gave the \"MitchBurger\" a try. Needless to say we have never ordered anything else since. In the basics of a good burger and sandwich, this burger hits all of the basics, with a few problems that they have since changed. Let me breakdown the construction of such.   A few pros and cons. Cons. They used to put the lettuce on the very bottom, which with a hot burger would make the lettuce wilt and become slimy. And thats it for the cons.   The Pros. The burger itself is not frozen or pre formed. It has that rustic hand made look. The bacon is thick and crispy and the pepper jack cheese provides a nice heat and texture. The onions are red and sliced into thin rings. I opt for no tomato. And then they add this magical \"mitch sauce\" consisting of a hot sauce / ranch blend. Just a filling burger that hits all of the right notes.   Downsides to the Mitchells experience are small but are important in any restaurant review.   When you ask for a water with lemon, ask for extra extra lemons because the portion provided are extremely small.   The french fries included with sandwiches can be hit or miss depending on how under or over cooked they are.   Other then that, we are able to always get in and out and back to work on time feeling very satisfied!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2swV8V2modOHX6UXc0WUlQ"
  }
}