{
  "L5nvQREKMvQ-8HICklvSNA": {
    "date": "8/20/2013",
    "text": "Not sure about others' bad experiences...  On arrival found clearly marked order counter with someone very happy to assist us.  Good conversation as she prepared our sandwiches, quick and to order.  Beer on tap was easy from a just as happy and helpful bartender.  Beer was cold, sandwich was classic corned beef on rye deli made.  I won't hesitate to return if I'm back in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nxJs0RO-1tcVPkgNRvgF4Q",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States. The Corned Beef sandwich, with saurkraut on rye",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nxJs0RO-1tcVPkgNRvgF4Q/o.jpg"
      }
    ],
    "user_id": "oKYJpAZyW6O-COIWfQbdOw"
  },
  "MlVjYPGo6JwGGD4_P-OErg": {
    "date": "11/14/2015",
    "text": "I'm gonna miss this place now that I'm not going to work downtown anymore. The \"Famous Special\" with sauerkraut on marble rye was my favorite. Really really good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kneey6lq_XsBoM6yN7IeHg"
  },
  "0p3CxCRIn08cUEemqYwtZg": {
    "date": "10/13/2015",
    "text": "This is my favorite place to go for a quick drink or food. Also the two bartenders Bubba and Dj are my two favorites ..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cN5XHxzkvyZdd1YoStmVaQ"
  },
  "P_FawPCtf6hlmuXbdCrh-Q": {
    "date": "7/18/2015",
    "text": "This place is a downtown must. Not fancy, by any means. But, that's why I like it. It is a great shot and a beer place and the perfect spot to grab a beer before a Steelers or Buccos game. I love the Roast Beef on Rye. I think they use Breadworks bread. Keep up the great work, guys.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4cxjdGjqdYLPSr-wWKpe4g"
  },
  "y_g0mFHT8A5jjY320-BcFA": {
    "date": "12/5/2014",
    "text": "Great prices, casual atmosphere, heavy pour on the cocktails, this place is a downtown staple.  Oh, delicious sandwiches and free popcorn.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3RCyqHVXIgUFZbUVgr73A"
  },
  "Q62KzXKWUK8FeB9EPU0-mw": {
    "date": "5/15/2015",
    "text": "Absolutely the best corned beef sandwich ever.  I have been a fan of Sammy's for at least 25 years.   It seems like nothing more than a bar, but don't let that fool you.  The corn beef is excellent.  I like the corn beef special on light rye with the coleslaw and Swiss cheese.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DzO4XKQbQftUxfJSFCxo6Q"
  },
  "uY65IlAVYC3oii6UN70_9A": {
    "date": "5/6/2015",
    "text": "The corned beef sandwich is the best. Add a cold brew and you don't need anything else.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-yJPfuvhDduWP9surV5aag"
  },
  "yA7lmEeGA9uPXsAxQdrUJA": {
    "date": "8/17/2014",
    "text": "Go have the corned beef. And a good Iron City draft. They're both delicious. It's a great lunch spot in downtown (I assume this is the one I went to; my receipt says 901 Liberty but 9th is very close).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eyHhwpGvSMpwxHZMjveYYQ"
  },
  "D2VQGmccnsCJ8pkeU2HQUQ": {
    "date": "8/23/2014",
    "text": "I was in Pittsburgh for business in June and found this place. Nice place! Kind of a \"shot & a beer\"joint that sells really good corned beef sandwiches from a counter in the back of the place. Corned beef was really good! What makes them famous, I don't know! They were not \"that\" good, but well worth the money!! Check it out, but keep you expectations from getting too high...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bu2_FVGfhzrkJwe7Ve53Sw"
  },
  "eKlkAR4VCPmM0rKWkDEl_Q": {
    "date": "8/31/2014",
    "text": "Not too impressed with the corned beef sandwich.. I figure if you have the words \"Famous Corned Beef\" in you name it better be damn good... This one wasn't at all.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tOuqzsrmaVOVKafGwihH1g"
  },
  "Bhir-8-8XgXDfunwr7abxw": {
    "date": "10/20/2014",
    "text": "The famous corned beef sandwich on Rye is the way to go!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AOUt4FQmL9qjMkJpPgGuQg"
  },
  "CpK4a5-4pVmdqyivlqjkkA": {
    "date": "9/8/2013",
    "text": "Good quality corned beef sandwich at a good price. However, I asked for my rye toasted and was greeted with \"we don't toast here.\" How do you not toast a corned beef on rye???",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CIpwihx4KR4xdlPu2QVvSA"
  },
  "I7mHXasOkBXGmQ8JlQBgxw": {
    "date": "11/21/2014",
    "text": "Pretty perfect Reuben.  They steam the corned beef which I love.  Perfect proportions of meat, dressing and sauerkraut.  Good pickles.  Very Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SpWiIWOvChL8Jy3tzM4RQA"
  },
  "Nz-8WJLEqwy6xsy2Afym8g": {
    "date": "6/27/2014",
    "text": "I have to first say that I did not rate this restaurant one star based on their sandwiches.  Today was my second time at Sammy's because the first time I had their Reuben it was the best I've ever had.  I went back today and was appalled by the customer service.  I walked up to the cash register and stood there for atleast five minutes before someone said-Are you ordering food?  I said yes, they said-You need to go stand over there.  So I move over and someone walks right in front of me and ordered-no one says anything to them.  I stand there for a few more minutes until one of the rude blonde sandwich girls says (without looking up from her sandwich) What did you want.  I said-A reuben.  She says loudly-I can't hear you..  So I said back loudly-I said I want a reuben.  She says-You know they're not toasted right??  I said-ok.. yes.. that's fine.  She says-what bread do you want-I say-Rye.  So I go check out and the girl says loudly-this is for here right??  I said no-its not.  Needless to say I get back to my office and my Reuben is on white bread and there is none of the sauce on it which made it so good in the first place.  Maybe I'm being dramatic.. but it's just not the friendly Pittsburgh service and quality that I'm used to. And if you're going to choose to work in a restaurant.. then be a little friendly and have some respect for people that are spending their money at your establishment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jvM7Cd4Wq_mohvtnWH_skw"
  },
  "ZxmzVDdQ4W2O43uix6-UtA": {
    "date": "7/26/2017",
    "text": "I never ate here before just drank after work in the old days. So I was in the mood for a pastrami sandwich,  this place is 2 blocks from my work so I went in. The grown up version of bam-bam behind the bar says you can't order food at the bar, go to the back and order. I order a \"hot\" pastrami and swiss on rye, lady asks want anything else on it, I ask do you have brown mustard? She says smartly \"it's the only mustard use \". Ask for a ice tea then pay. Guy says \" it will be a minute while it heats up\". I get my sandwich.  Meat was \"cold\" & dry, cheese not melted. For the $$ the portion was small. The bread was fresh and the pickle was good. Total waste of 10 bucks.  The only good thing from the experience was the cute girl with the tattoos that works there. They claim to be New York style, bullshit. Don't waste your money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zokgpfAn1onJ1DppA1DTDw"
  },
  "iwt4dk4Sn3t7XhvJ2-lMxg": {
    "date": "12/7/2016",
    "text": "Fast service. Good food. I had the \"famous special\" (just its name) with Corned beef & sauerkraut on rye. Nice blend of thousand island & mayo. Two pickle spears & large drink for under $10. One free refill... Oh yeah, there is an ok bar too",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "91VdxxFmRAvr3rwbcOYSyQ"
  },
  "2QpHeqDb3rZz4bDw3F04lg": {
    "date": "5/23/2017",
    "text": "Hard pass on this place in the future. Stopped in here hoping to find some delicious corned beef, just after picking up my daughter a slice of pizza from up the street. Even mentioned that, as I was placing my order. It was only after we payed for my food & our drinks, a guy comes over & says they don't allow other peoples food in their establishment. I honestly thought the guy was joking! He wasn't. I told him that would've been nice to know before purchasing my entree. He said, you should've asked!.. Zero offers of making a to-go order, nada. I had to ask for that! By the time I got my order ready to go it was cold. I definitely feel this was shady business & bad corned beef!! Definitely look elsewhere for a better taste of both.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jGFz3tiqXVaR6iZd0yPacw"
  },
  "qypGMYP-KC5BLdE7hTHtyA": {
    "date": "4/21/2017",
    "text": "Good food, good drinks/selection, but the lady making the food was absolutely miserable",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gqIF4WyHYJ3UjnKplmFRrw"
  },
  "2TBtGqVvrW4zoLkgDw9upA": {
    "date": "11/22/2017",
    "text": "Friends and I have been coming here and all of the other former Sammy's locations for cheap beer and dry sandwiches, but I will never return. We already closed our tabs and was going to purchase a beer to go when some random man decided to make an unwarranted sexist comment to me about my appearance. It was insulting and uncalled for. I shared the remark with my friend that was coming out of the bathroom who defended me by telling the man to keep his comments to himself and that women don't need to hear what men think about them. The bartender, you know, the famous wrestler or whatever he is, told her to stop and eventually threw us out and \"banned us for life\". I guess it's okay to be insulted by men and women should sit there and silently accept it. As we were walking out the bartender just kept claiming that he \"won\". Congratulations on winning five less customers and a glowing yelp review, sexist asshole. I never thought I'd give a business a one star review, but you're welcome. You earned it.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "GTbnKWAYHAgY4Z_62547WA"
  },
  "7xYH7Gs7X1ShyElBSTbVHQ": {
    "date": "4/23/2017",
    "text": "Pastrami sandwich with slaw was very good. Lady making food is not very patient with out of towners like me who are unfamiliar with the menu. Bartender heard my order wrong and poured two beers I didn't really want. \"Oh, sorry\" was the reply. Whatever, we drank them anyway. Good food and beer prices, simple atmosphere. I'd eat/drink here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ATxkHK2fT6M8lv3VN5nvag"
  },
  "UzmXFYrLoxLjpHWG7_pb6Q": {
    "date": "3/14/2018",
    "text": "The best sandwiches in the city. It's the most low-key bar in the city. If you want to grab a sandwich and a sixer this is the place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DbDHXGbJBEqAnn60XChMdQ"
  },
  "xCjLPJ2qTN9REBISaUK8_g": {
    "date": "10/10/2015",
    "text": "Good food, horrible service.   If you have thick skin, you can definitely eat here. But if you are prone to being offended when someone's rude to you, this is not the place to go.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "FRo0h7Hbc812UeHTmB8d0A"
  },
  "4Ox3WFtx88EBJrzmwATLEQ": {
    "date": "10/12/2016",
    "text": "The food is good, but the service was awful!! Michele the manager became frustrated with me while I was placing my order because the restaurant was short staffed!! I could've believe that I was being spoken to with such disrespect when all I wanted to do was place an order.. Never again will I spend my hard earned money here, neither should anyone else..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rT9jTvfRM5OB7u2wB-td2g"
  },
  "KnNWp6FYYViklakPhJNQ1w": {
    "date": "7/12/2016",
    "text": "First time going to sammys and their customers services is horrible. The ladies making my sandwich were impatient and moody. I felt bad that I will never get to try there so called famous roast beef sandwiches but I will not tolerate any type of rasicm. Yes I'm a African american man that lived in Pittsburgh my whole life and I expect great things from my people (all people) from Pittsburgh. Hopefully they can make some  changes in employment which I doubt. This is not a review on the food but how I was treated at this establishment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "XoXQah66EEq2dwZbm0jRVA"
  },
  "Luq9sZlF_4_a6Jj0FdBjzQ": {
    "date": "1/9/2013",
    "text": "I didn't have a drink at the bar, but one look around told me I would love this place as a bar. It's just the kind of dusty , down to earth, sparsely filled  place I like getting my drink on at and I will surely be back to sit at the bar and slow life down for awhile and have a brew.  It should be also  be noted that I have now found a new location to procure 16oz cans!!!   I stopped in on my half hour lunch break and ordered a roast beef sandwich.   The roast beef was warmed which I wasn't expecting. For me I like my roast beef served with cheddar cheese...cheddar cheese isn't exotic...but for some reason Sammy's doesn't have cheddar *frown...and I requested brown mustard none of that either.   So what I got was meat, lettuce and tomato with a large drink the total for my sammich  and drink $8.00.  That makes for an expensive lunch.  Way more then the $4.85 I'm use to spending on my 6in Italian BMT....  I'll be updating this once I see how the bartenders get down...but for now 3 stars the sandwich was way to expensive for what it was. No cheddar no 5 stars.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CTNVzpXSuqmiGHcBtMvsRg",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States. Roast beef, with American cheese.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CTNVzpXSuqmiGHcBtMvsRg/o.jpg"
      }
    ],
    "user_id": "V7uS5US4oTf-S9u36HJQCQ"
  },
  "f5i1D6kXyklAxx4WoSMaWw": {
    "date": "9/16/2012",
    "text": "The idea of people going to restaurants and ordering things that aren't on the menu only to slag them ruthlessly for not having those items is one that has always confused me. I assume these cranks want to dislike particular businesses and have churlish fun doing so.   Sammy's is nothing more than what it is, and I'm not sure why some diners can't appreciate it for that. If one wants the Big Apple delicatessen experience, one should board a Greyhound, and coincidentally, a bus station is blocks away from this Sammy's satellite. So go. Far. Away. Please.   At Sammy's, you'll find adequate service, a mixed, civil, quiet clientele, old-fashioned tavern decor, and fine, fine sandwiches served in normal proportions. Are they really \"Famous?\" I don't know, don't care, and hear no one \"raving\" about Sammy's aside from its haughty, eternally malcontented detractors. Sammy's makes sandwiches and serves alcohol, soft drinks, and a few other things. Cope with that.   Regardless, I still feel that Sammy's makes a fabulously fatty yet fragile and flavorsome corned beef, but they do offer other kinds of sandwiches as well, and for some reason I was feeling like having tuna salad en route to a Symphony X concert at Altar Bar one evening last week, so that was what I treated myself to.   See, I often crave that chilly, mushy, rich, creamy, slightly crunchy tuna filling between slices of sturdy white bread from time to time, and Sammy's delivered it unto me without fail, building the beast to my specifications (white bread, lettuce, tomato, onion, American cheese, and mayo). And I'd never ordered such a thing from Sammy's before, either. So take a chance for you I did, the Yelp lurker, coming out happily unscathed.  What I have ordered before is their luscious potato salad, and I ordered it again due to its abundance of waxy, yielding spud cubes, tenaciously velvety dressing, and whatever other good, good things comprise it.    A fat, cold obelisk of dill pickle completed my basket nicely and kept me going for the rest of the long, strident night ahead, so to me, the portion was adequate and destroyed Subway with a bolt of lightning.   Including a tall cup of Pepsi, my bill came to less than 7 dollars. I left a dollar tip and was thanked by my server who told me to \"holler\" if I needed anything else.  P.S. Over two years ago, I reviewed the corned beef sandwich itself at Sammy's sadly defunct Lawrenceville location...  <a href=\"http://www.yelp.com/biz/sammys-famous-corned-beef-pittsburgh-2\">yelp.com/biz/sammys-famo...</a>",
    "rating": 4,
    "rated": {
      "funny": 16,
      "useful": 23,
      "cool": 19
    },
    "photos": [
      {
        "img_id": "J5pLa_bsvHR5k_1N7jiwRw",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States. a tuna salad sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/J5pLa_bsvHR5k_1N7jiwRw/o.jpg"
      },
      {
        "img_id": "tUNLoPbzlmyVL_CaCml4gQ",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States. a pickle",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tUNLoPbzlmyVL_CaCml4gQ/o.jpg"
      },
      {
        "img_id": "p5VfYpV4TTXc6Ve4W20rlw",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States. A fantastic cup of potato salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p5VfYpV4TTXc6Ve4W20rlw/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "m1Ew2vqHD-qzt2u0hT365Q": {
    "date": "10/24/2017",
    "text": "The corned beef sandwich was fine. Forgot the coleslaw on the side - check your order if you're getting something to go. The chicken soup was excellent. Service was fast.  The atmosphere of the place is like an old bar/tavern. A good place to go if you want a quick meal to carry out Or you want to hang out with some friends with a beer and a sandwich.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Uu6NB5hiskHEtcoZWl9gw"
  },
  "qw1Dzat8gqra5Ujz8uNvIQ": {
    "date": "12/19/2015",
    "text": "Belligerent bartender, dirty dishes and broken glassware.   Ordering my first (and only) round went smoothly. Conversely, when I noticed my mug had a chip in it, I politely asked for a replacement. The bartender, showing a great deal of condescension, acted as though this was a ridiculous request and illustrated his thoughts by pouting like a petulant child as he poured the beer from my damaged glass into a unclean replacement.   Ignoring the poor cleanliness of my second mug, as I was sensing some enmity, I continued with what I thought was proper decorum. I spared him the lesson on classical physics yet tried to explain that the glass chip may have fallen inside my beer, therefore, I would like a new draft. I also added that because I had already had a few drinks from my original, it would be perfectly acceptable for him to pour me only half a glass.   I could see that he was already precariously perched at the precipice of cantankerous conduct and possibly personally offended. Apparently, rational thought before asking for half a beer poured into a new glass (or on which to base any decision) became too much for him to handle. This is what must have sent him plummeting over the edge onto the behavior which I base my review.    With arduous focus maintaining a prison yard stare, he slammed both mugs into the sink. At the sound of broken glass I reconsidered explaining the basic principles of physics with an augmentation in decision-making to thwart his poor life choices and their repetitive cycles. However the amplified air of hostility and roll of his eyes made me confident that he now understood how we ended up in this conundrum. Explication would be redundant and conceivably harmful. I nonchalantly looked away in an effort to prevent this volatile situation from reaching critical mass.   My labors to recover the situation were rewarded with a full glass of beer crashed onto the bar where it spilled over the sides to become a half glass of beer with a wet and sticky grip.   I let it go, after all, I didn't come here with the futile notion of educating a bartender in the suitable customs and cultures of civilized society. If I ever hear anyone mention patronizing this place I'll instead recommend a trip to the great ape exhibit at the Pittsburgh Zoo. From my experience the apes at the zoo exercise a more appropriate demeanor.   After the way I was treated I'm embarrassed to have spent money here. Fortunately there are a plethora of superior alternatives within walking distance.",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-qARpBiDw5Z6Dgg0GEou2g"
  },
  "qGMuMN9tafcMZQOltsBW2g": {
    "date": "4/5/2016",
    "text": "A great corned beef sandwich in a bar with plenty of character.  Small place with friendly staff.  Glad I stopped in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FDDiyvrG4oAO7ZSR3tHkqA"
  },
  "Lahea_Z-I_7TF3oZN78bbg": {
    "date": "11/28/2012",
    "text": "Came in and as the other reviews said it's kind of dingy. I really was craving corned beef and have been wanting to try this place for a while.   The waitstaff is rude. There are no signs of where to order so I asked the bartender and he shoveled me towards the back.   I found the spot where they make the sandwiches and ordered the corned beef. I asked the next lady I wanted everything on it and to go. They do take credit cards to my surprise. Even Amex haha  I have to say my sandwich is quite delicious. The corned beef is quite good and the bread is soft. It came with a pickle that was huge! For around $6 bucks I really can't complain. I'll call this place a little hidden gem.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pwpKFY_WRFddFj7B_w578w"
  },
  "RbAMeuakuNgCwewVS3v1qQ": {
    "date": "11/20/2013",
    "text": "Yinz goin dahn to Sammy's for corned beef sammich n'at? The answer to this question should always be yes. Sammy's may not be the nicest bar, but its a very Pittsburgh bar. If you know that is a compliment then this is the place for you. Tender meat on local bread is not a good enough discription. I love Sammy's, its a pick me up after a hard day. The meat, cheese, and bread sorta meld together to become a smooth buttery burst of flavor.  I suggest \"the special half and half Pittsburgh style with everything on marble rye and a potatoe salad\" half corned beef half pastrami  with thousand island dressing \"pittsburgh style\" means with Cole slaw on top comes with a pickle . The potatoe salad is nothing special but it completes the meal. The beer is cheap with an ipa on tap for 3.50 so drinking suggested. The only suggestion I have is get some Turners tea up in this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2YVGKKcup6mjQmDQ6arEg"
  },
  "VB43bKpyL4ly9mY82dmWLA": {
    "date": "9/10/2014",
    "text": "My favorite spot in Pittsburgh. Great corn beef sandwich, nice atmosphere, great bartender. Over all, a better vibe than any other downtown bar /grill I visited! The bartender keeps a 2014 Almanac Book of Facts, to settle any dubious claims from any tall tale telling patron.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TKhGjPF6kr1wzDYLBmHVGw",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TKhGjPF6kr1wzDYLBmHVGw/o.jpg"
      }
    ],
    "user_id": "zRHhrTMfLsH9YwPC1pPLpg"
  },
  "ymco3FmCLke-f339UdD9QA": {
    "date": "12/5/2016",
    "text": "I was pleasantly surprised by this place and the name holds True. When you first walk in, the place looks old, which can give off a two sided opinion, but then I ate the Corned Beef, which was amazing!  A good quantity of meat and the quality was even better...  I'm from Jersey and it's hard to rival our deli sandwiches back home, but I'd say this place comes as close as possible.  I strongly recommend checking this place out if you are in town for a Steelers game and I plan to visit here again when I come to see the Pirates play.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K5g0jFF88R2tSKYUzXpT8Q"
  },
  "wFaAJ5pmdDo0pmFNT6oOOA": {
    "date": "7/29/2015",
    "text": "The most stunning dive of dives in the city- neon lights and Yuengling at 10AM sharp. And the sandwiches! They're glorious. I may have erred in going for the brisket over the corned beef, but I couldn't have been happier. Paper-thin, moist, and sweet with onions and creamy dressing. The ideal sandwich, truly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gpKrnCN6WMC6MC4JIJFI3Q"
  },
  "aLMm0OmpoXnDMdpIXQnSPA": {
    "date": "9/12/2019",
    "text": "I stumbled over Sammy's for lunch and I tell you what..  this little authentic deli spot knows how to make a great quick sandwich.   They pride themselves for their famous corned beef , however they have other different cuts of meat such as pastrami salami and so on.  Can't wait to go back there and try the pastrami.   The sandwich comes built high (elevated) stuffed with meat and your choice of either coleslaw or sauerkraut in addition to your optional type of cheese. You can also add additional toppings.   Sandwich size comes in two options half and full. They also offer lunch combos with a side and a drink for a value price.  They have a full bar which I did not partake in .. As I am mostly there for lunch.   The owner/floor manager was very friendly and attentive as well as the rest of the staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8rCG_eH5NNgJE-WotmtKmA",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States. Famous corned beef special",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8rCG_eH5NNgJE-WotmtKmA/o.jpg"
      }
    ],
    "user_id": "kD_FScl4YPpVFjN03GW2Cg"
  },
  "V6PsGi0Vpus-dajnCfCxBA": {
    "date": "9/15/2019",
    "text": "I used to go to Sammy's Famous Corned Beef and the food is excellent! I went downtown to get a sandwich and it was shut down and I couldn't find them.About 3 months ago I found a Sammy's Famous Corned Beef on Liberty & Ninth Ave,I was so happy to find Sammy's I had to stop and get Sammy's Famous Corned Beef Sandwich! Now I try to go at least twice a week to get the best sandwich & it comes with a pickle and I ask for the mustard on the side!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dyk3y7VV07z9cOaULVcCCg"
  },
  "LLrBj8sizSLcLvn5Hs81Cw": {
    "date": "2/19/2019",
    "text": "For a quick lunch this place is a great spot.  You get in and get what you want and go.  Especially if you hit it at just the right time.  I was surprised that it wasn't busy when we showed up, but that just made for filling my belly a quicker time.  I know that the name says corned beef in it, but I have to admit that I didn't partake in a sandwich that had corned beef.  I cannot tell you why, but every single time I end up in a deli type of place I get myself an egg salad sandwich.  There's something about that sandwich that is simple.  Also something about it makes it quite the quick meal to down in a hurry.  The sandwich was plentiful, I was not upset by that fact.  Two long slices of bread filled with egg salad and my choice of toppings.  I just went with lettuce as I wanted a little bit of a crunch.  I enjoyed every single bite of that sandwich.  Definitely a place I will stop in again.",
    "rating": 4,
    "rated": {
      "funny": 12,
      "useful": 14,
      "cool": 14
    },
    "photos": [],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "cwTAfrKqc4YhcJ0aIKvFJQ": {
    "date": "2/19/2019",
    "text": "Great stop for some drinks if you want to be able to talk to the person you're with! I also hear they have excellent sandwiches. I wish I would have been hungry to try it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0x5qTcOIDQiUekTn3hMsQQ",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0x5qTcOIDQiUekTn3hMsQQ/o.jpg"
      },
      {
        "img_id": "Rw_7iH9bbedWQpWb-wPAiw",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Rw_7iH9bbedWQpWb-wPAiw/o.jpg"
      }
    ],
    "user_id": "Bhg-NRc1sErioP7PhiQfGw"
  },
  "EoZu77uUkXf9tQ6wtSTFEw": {
    "date": "11/18/2018",
    "text": "I had the corn beef and it had a lot of meat in it plus the bread was really fresh. It's hard to find parking if you park in a lot it's about $9.00 it's a location to go to if your already shopping or attending a show. It's older but they have enough seating and you can see interesting people walking the street.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "J88xQq3A7Y8ZktipdXL49g",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/J88xQq3A7Y8ZktipdXL49g/o.jpg"
      }
    ],
    "user_id": "3xBFFH866WoySDG7uuwBSQ"
  },
  "HZgG7Y47tB2VNcoaxJ3VGw": {
    "date": "11/19/2018",
    "text": "Delicious corned beef sandwiches and friendly staff. I loved this place so much I visited twice on my 4 day stay.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ufQ5ntoHmVUYTIjBmxfFHQ",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ufQ5ntoHmVUYTIjBmxfFHQ/o.jpg"
      }
    ],
    "user_id": "ZKBpfW7kiqxqp1ypsrlp3g"
  },
  "2oHET3w971_43pb4mCXTcQ": {
    "date": "1/6/2019",
    "text": "I just went to Sammy's yesterday before a show at Arcade Comedy Theater and it was the quintessential Pittsburgh dive bar/sandwich shop and probably something like what Primanti Brothers used to be.  Sandwiches were tasty and everything was cheap. The atmosphere was awesome -- dark and kind of grungy with 80s arena rock playing and Iron City on tap. I felt like I had been transported back to 1988. Would recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YjXFMjWERoHhTQN8FtdDrw"
  },
  "pwanLoB6hcthweGch2t4Eg": {
    "date": "4/26/2017",
    "text": "Sammy's is a place with lots of tradition. This is their original location. They know how to make a classic Corned Beef Sandwich and they make it well.   They pile their sandwiches high, and they are made to order. All the ingredients are fresh.   Service is fast and courteous. You order in the back, then pickup at the cashier.   I've been eating hear for more than 20 years, this place is dependably good.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 9,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "tBS87zzmwbN7C5CeNfKgFQ",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States. Classic corned beef sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tBS87zzmwbN7C5CeNfKgFQ/o.jpg"
      }
    ],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "gTSBaCwyG9DNi-mDSr-ZWQ": {
    "date": "7/21/2018",
    "text": "Bar review:  Basically, the kind of bar you'd expect in a bowling alley, with some craft beer options. Well + mixers were strong, served in a cheapest plastic cup, came with limes that were at least 2 days old and picked out of a styrofoam cup with fingers, and were $4. Then round 2 was served by grabbing that plastic cup back and refilling. All coordinated by a burly gentleman you can only assume is a lifer with little patience for the bullshit and whimsy of the gentrifying downtown crew.   On another day, I'd be giving a horrified 1 star review. On this day, we really needed the break from gastropubs and overpriced bourbon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gf1UQyDGfNI_xfoxqItpmw"
  },
  "PAccpNQpk73hkKeLoOe7vA": {
    "date": "7/15/2018",
    "text": "Sandwich was disappointing.  Corned beef tasted like generic deli sliced meat.  It wasn't even as good as Boars Head corned beef.  You would be better off cooking your own corned beef to make a sandwich, it was messy and lacking great flavor.  I would not go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "58tVksIIkoYTHpUbTwZb3Q"
  },
  "zX88jvIdNnR90szdBmIOxQ": {
    "date": "4/20/2018",
    "text": "Located downtown, this corner bar is a great option for a quick lunch or dinner bite, and or beer.  If you are going for a bite, when you walk in, you will head toward to back of the bar, where you will see the above head ordering signs and sandwich counter. You order the sandwich and pay there. While waiting for your most amazing sandwich, you can now order a drink at the bar (paying there).  For those of you that have been here before, you know the run down. However, i was a little confused when i first patroned.  The sandwiches are very very good. The woman that has made my sandwiches, every time i go, is down to earth and pretty patient with me (Thank god)! And the bar tenders are nice as well.  It's a very low key bar and not intimidating. I've eaten there alone and didn't feel weird about it.  I have been coming here for the last few months, every few weeks, just to get my sammie fix. They are really that good!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 10,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "iJycEEIJHdp4nVagIFkCmQ",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iJycEEIJHdp4nVagIFkCmQ/o.jpg"
      },
      {
        "img_id": "N9b0Ga8h6cgjH0fPcf2ReA",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States. Side of potato salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N9b0Ga8h6cgjH0fPcf2ReA/o.jpg"
      },
      {
        "img_id": "HqWaef0T4aQAorgGhToQbA",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States. The roast beef special",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HqWaef0T4aQAorgGhToQbA/o.jpg"
      }
    ],
    "user_id": "nzl2KyGKLtV7j8QEfOhC-w"
  },
  "uqgp4dpY4vZyNT7h7A8rIg": {
    "date": "5/6/2019",
    "text": "Serves cold sandwiches!! Horrible service!! I asked to have my sandwich heated up and they said they could not do it!! Shouldn't be able to serve food that can't be heated!! Health code violations everyhwere!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l05ATcLs4Srk5rNELRPnYg"
  },
  "FIglBxLdIZu-ElgHA7l2Kg": {
    "date": "5/17/2018",
    "text": "Sandwiches are small and expensive.  Ordered the 'Famous Special $8.99'  Definately not famous or special.   They say 'New York Style'.  Looks like they haven't been to New York during this century. In New York they are piled high and delicious. Don't believe me?  This place was completely dead during the lunch hour except for a couple old men sitting at the tables...  Eat somewhere else, seems like that's what everyone is doing",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iJSvri1sARt4dttrcnAibw"
  },
  "2wVnqOI3ox8fxgSpPmM5gA": {
    "date": "4/18/2018",
    "text": "I'm a Chicagoan, so I'm not gonna give you the Official Pittsburgh LineTM that you have to go to Primanti Bros. Yes, P-Bros is an Experience, and my life is greatly improved for having had said experience. But when it comes to the better corn beef on rye, it's Sammy's hands down.  The quality of the ingredients was off the charts good. Even the pickle on the side was unbelievable--and from the same local producer since Sam first opened up shop 31 years ago.  Its exactly what you want in a neighborhood bar, down to the neon signs in the window, the nostalgic mix of old timey black and white regional photos and Penguins and Steelers memorabilia plastered across the walls every 3 inches, and complete with the aloof but still affable owner, counting money and slinging beers behind the bar.  tl;dr: I highly recommend anything that comes with a pickle.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5VIobHxcLSggElffh20MeA"
  },
  "SmTjOobsOgg1L3SIwD8-YA": {
    "date": "3/17/2016",
    "text": "Downtown Pittsburgh is deserted at night, especially on this street.  I was asked if I needed help with directions by a well-dressed stranger steps before entering into Sammy's with my suitcase.  That was sweet.  I got off the Amtrak train during the evening and was wandering around the area looking for a quick eat.  Qdoba was closed.  Originally, my plan was to eat here and then head to my hotel but I changed my order into a take-out.  Although only a few seats were occupied, the atmosphere was very heavy and intense.  It was a little too quiet for me.  I felt like I was in a saloon with a fight about to break out any minute.    I walked to the sandwich counter at the back of the bar and ordered the special.  The woman was friendly although she didn't seem to be up for much conversation.  For less than $10 (~$8?), I got a pastrami sandwich on rye with cole slaw on the beef and a pickle on the side.  Damn, the cole slaw was light and the pastrami was very tender and chewy!  I devoured the whole thing.  Definitely worth a trip to Sammy's for this sandwich!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cwA8bDbEWxL-0RKA2-5_VQ",
        "caption": "Photo of Sammy's Famous Corned Beef - Pittsburgh, PA, United States. Pastrami special with cole slaw",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cwA8bDbEWxL-0RKA2-5_VQ/o.jpg"
      }
    ],
    "user_id": "A08xF_ykmsWQV0ypYA8wkA"
  },
  "o7lZEZdCoci0CxaAwfNjlA": {
    "date": "1/4/2019",
    "text": "The food was good.  But the one staff personnel was so very unpleasant  and NOT friendly at all.  Asked what kind of bread and we asked for the baked fresh bread that was on the menu and she told us we don't have fresh baked bread.  Asked for soup and her replied that it's not ready, no explanation as to when.  She was just so short and snotty with her answers, did not make the dining experience very good.  Thank goodness the rest of the staff was very nice included the gentleman that put the sandwich together, the young lady that got the drinks, the bartender and the gentleman that ran the cash register.  Just takes one rude staff person to to ruin the experience!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QH3YO7Jmg-5BqzBgPzMuXQ"
  },
  "O52dY9B_XXjsMIEkN42NVQ": {
    "date": "12/8/2016",
    "text": "Great, simple bar downtown if you're looking to grab a quick beer and a sandwich after work. Sometimes an overly trendy and over priced bar is just NOT what I'm in the mood for. Sammy's is perfect for those times. The price is right and I love the casual atmosphere to have a few beers and hang out. They have some great beers on tap as well as a good selection of domestic cans and bottles.  According to a lot of my friends, the best tasting and priced Bloody Marys around! (I don't like Bloody Marys, but I trust the judgement of my pals when it comes to cocktails!) You can get many different kinds of sandwiches, although they seem to be known for their corned beef or pastrami. The brisket is really good as well! Sides include macaroni salad, potato salad and cole slaw-- all of which I have eaten and enjoyed.  Bartenders are friendly and it's surely one of the best deals for a meal and some drinks downtown!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "5IaHGddT0RLq1-S5LbP1iw"
  },
  "TDzx1fvJz_bBWuI8DAMzuQ": {
    "date": "10/20/2017",
    "text": "With this being the last of the locations open, it's by far the best one to have stayed. With Bubba behind the bar you know you're in good hands. Now let's break down these sandwiches..... the bread is always local and fresh, the slaw is super tasty, the Russian dressing is the best addition to the star of the Sammy's Special.... the corned beef is the best around. There's not all that gelatinous fat, it's lean, juicy and super flavorful. This is the only place I miss when I'm on Vacay and my first craving when I get home.  Hands down my very favorite sandwich in Southwest PA",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "lV__BHQw9QvkcyLtTFZSzw"
  },
  "eK7VetQCeAURaL0tQkamaQ": {
    "date": "7/21/2018",
    "text": "Let our son pick a place for dinner and he is a big fan of corned beef so he chose Sammy's. The corned beef was seasoned perfectly and served with coleslaw that was fresh and crunchy. I had pastrami and enjoyed it. I would have liked my bread toasted but was caught up looking at the wall of celebrities who had eaten there and didn't know to ask for it. Will definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NkhRx1ZdqqCx7JdfLbzDyA"
  },
  "nBn37SeTt1nMPLxOql8Jgw": {
    "date": "8/26/2016",
    "text": "Today I chose the \"Sandwich Special with your choice of meat topped with Swiss Cheese, Cole Slaw and Russian Dressing - with pastrami\"   The sandwich had no shortage of meat what so ever and was \"good\" but it lacked cole slaw and dressing and only had a little cheese.   All I could taste was the pastrami really.   I have had the corned beef before and its good too but I am more of a pastrami/salami fan.  Next time I will request the dressing and cole slaw on the side and just apply myself.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  }
}