{
  "nvRlwP0SAvV4MQmNrZiAlQ": {
    "date": "2/7/2016",
    "text": "Another place that's conveniently located , really close to where I'm put up when I visit Pittsburgh. Food isn't bad. I like their pork dumplings the most. Other stuff are fine too. Octopus rice was pretty good as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WFxoNHaxj4UzLvVGTddkZg"
  },
  "-GtafwZx04w4PzPGhDfYEA": {
    "date": "3/22/2016",
    "text": "I like the sweet beef~ Good place, will go there again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JF6lF4S9bORhNKurJ4HjnQ"
  },
  "UwqDqs984-uWHOrMYNMZbA": {
    "date": "10/2/2013",
    "text": "This is a pretty authentic Korean restaurant. Although the price is slightly expensive, this is far better than the other Korean restaurant in Pittsburgh. Bossam, steamed pork, is must-have. However, I would recommend staying away from soup-based dishes, such as Sundubu, because they are flavorless.   Other than that, pretty good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3GTGj_NEucyHJEcSefZI2g"
  },
  "kff901BvrmTqtjkcctHfnA": {
    "date": "1/4/2016",
    "text": "Ok taste, far from good. But acceptable. Ok service. Nothing impressive. The quantity is big though. Seafood cake is good. Just an ordinary Korean restaurant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5fj1GxcUkRL29J2VOgMDTQ"
  },
  "fMYKwQvEbnM1sC1JlaOrLw": {
    "date": "1/22/2015",
    "text": "Awesome food...and lots of it.  Great for sharing.   Super service,  friendly wait staff helped us to enjoy the Korean culinary experience authentically.   I recommend it highly! !  We're going to bring our foodie friends doon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BwXxD6CREZuhqqnCiJWSQg",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BwXxD6CREZuhqqnCiJWSQg/o.jpg"
      }
    ],
    "user_id": "jiWTDAQ9pQJbehJB6_HFiA"
  },
  "d19oWVR6zznrZCQgsvbqMg": {
    "date": "4/10/2016",
    "text": "The food was great, the staff was very attentive, and the prices were reasonable for how much food we ate. The bullgogi was great, our first Korean dining experience a success.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WeWMbBqmAW97rMbBLfCiKQ"
  },
  "_Q4P2pNbP2dGPTykfQ49nw": {
    "date": "12/18/2012",
    "text": "Here, the service totally outshone the food.  Lots of attention from the 2 servers working the dining room but the food was good - not great.    I went in on a Sunday where they serve lunch and there is no lunch menu on Sunday.  You are on dinner prices on Sunday afternoon - which totally made sense since there were only 2 tables occupied in the dining room and I was one of them!  I opted for the Spicy Chicken.  Again, good but not great.  It was one of the more reasonable items pricewise on the menu.  I really had my heart set on Galbi but not for $25.  That's like a small steak at Morton's.  Everything here is \"extra\" which is pointed out in painful detail on the menu here.  I pasted the Customer Policy here for you to enjoy.  This is serious stuff.  ====  Customer Policy   *  We accept cash and 2 ( or fewer ) credit cards from each table, because other parties want to check out in a timely manner too. No separate checks are provided within-table.  If payment-separation-upfront is a main need, we can help finding places that specialize in it.  *  If not satisfied with our server(s), let us know while you are being served here so that you can be satisfied. Otherwise, 10% gratuity of total check may apply on the credit card(s) presented to us.  Many places auto-enforce 18% gratuity nowadays.  *  Unless arranged in advance, it is agreed that 2 hours are sufficient for your party.  We may take reservations that arrive soon after yours.  *  We can add an ingredient if you request, such as lettuces, noodles, etc.,  only $4.67 per each Addition accommodation may apply.   *  We can substitute an ingredient for your special preference, only $2.80 per each Substitute accommodation may apply.    *  B.Y.O.Cake ( Bring Your Own Cake, dessert, or foods ) is accommodated, only $0.28 per person B.Y.O.Cake charge may apply.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "oF8Efb3fBrwWZvmsl6e-pw"
  },
  "54Fyv-FcdzPF58GTBre2qw": {
    "date": "5/3/2011",
    "text": "Green Pepper stands out as the only Korean restaurant in Squirrel Hill, a neighborhood that has multiple pizza places, coffee shops, Chinese eateries, and ice cream/froyo joints.  I enjoyed my bi bim bap, which can either be made vegetarian or with beef (I opted for the former). The rice, egg, and other assorted finely sliced vegetables came out sizzling in a hot stone bowl, with chili paste on the side. The entree also comes with miso soup and several sides (mung bean sprouts, spicy daikon, and spicy cucumber slices the night I visited). I'd agree that the prices are rather high for Pittsburgh, but what I got was plenty of food.  Nevertheless, the service is the reason for my lukewarm rating. The best way I can describe the service is that all the servers seem to have extreme tunnel vision, and only appear to focus on one table at a time. Rather than bringing food to one table and then going over to other tables to check in, the servers march right back to the kitchen. They don't appear to notice that other tables look ready to order or appear to have finished eating and want their check. We spent a long time trying to catch any server's eye for our bill (our original waitress had gone MIA) before we had to be a little obnoxious. Then we waited and waited for someone to come to take our money and make change before my dining companion got up and took our bill and cash to the manager's station.  Luckily, we weren't in a rush to go anywhere post-meal, but the servers' inability to multitask still tried our patience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zh8-XfjqlwAxf--RS4azzg"
  },
  "DVucGtDufCZOPJ2q7RdytA": {
    "date": "11/12/2014",
    "text": "I came here with my husband and another couple. We arrived to a rather disorganized host station and put our name on the list.  When we asked how long the wait for a table 4 for might be, he looked rather perplexed as if no one had ever asked such a question before.  He then preceded to look around confusedly and stammer out a few statements before declaring that he had no idea.  We gave our phone number (as requested) so that they could call us when our table was ready and decided to go grab a drink down the street while we wait.  After about 45 minutes, they still hadn't called, so we decided to venture back. When we arrived I inquired about our table, and I asked if they had tried to call (which I know they had not). Another host immediately set out to find us the first available table. So I guess, if you come to this place on a Friday expect to get the shaft if you leave even if you leave your number.  Anyway, we got the little appetizers which were amazing and also ordered the Bibim-Bop which was pretty awesome. They serve this dish in a hot stone bowl which had rice and beef and tons of veggies, the servings were rather generous too. I loved it!! The table also had some delicious dumplings that were rather tasty as an appetizer.  Overall I will come back here just on their food alone.   I will also mention that their bathroom was pretty spotless, which to me translates that they keep a clean kitchen (at least in my mind it does).   Overall, despite the weird customer service experience prior to being seated, our waiter was on the ball the whole time and were served rather quickly despite the mix up initially. That and the food was rather outstanding. Just expect to wait a bit for a table.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "i3lHb48oSkgrjFuA1t4ApA"
  },
  "KfrJIK3hw5AvizBU3VcOVw": {
    "date": "12/22/2012",
    "text": "I just moved to Pittsburgh and was really excited to see that there was a new Korean restaurant. I really love Korean food and have had it in many cities in the US. I was really disappointed in this place, though. The service was pretty poor, waiters had no knowledge of Korean food. I had the bibimbap which was sub-standard. Overall I was disappointed, I wish that they could step it up.  I really really wish there was a good Korean restaurant in Pittsburgh but this just isn't it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "GWo_mSz-eVajPYqvGl3DaA"
  },
  "SUTZKGDBhOVAbhSMR9YO3w": {
    "date": "1/19/2014",
    "text": "The food is pretty decent, but over priced.  Given that this is pretty much the only authentic Korean place in Pittsburgh, I guess they can do that.  You do get a fair amount of food, I always have leftovers.  Service is friendly and quick, and the food hits the spot when you're craving Korean cuisine.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZqjMBVTrkZSifQ7FYiyNFw",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZqjMBVTrkZSifQ7FYiyNFw/o.jpg"
      },
      {
        "img_id": "otONSyn_2wYQQ0Ie6kPzkA",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Green onion pancake app",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/otONSyn_2wYQQ0Ie6kPzkA/o.jpg"
      }
    ],
    "user_id": "4yR91m8fSLHTBGvPeHJHOQ"
  },
  "U1B48o5TnDrbQE9e2z2XSQ": {
    "date": "2/17/2017",
    "text": "Service and food was great. I really enjoyed the Banchan. I've tried 3 dishes so far, they've all been amazing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FfM2I6DwIyStSrXeLBQJFA"
  },
  "5sq_t_YJ_I8p8NCnUZz_jA": {
    "date": "2/24/2013",
    "text": "I had raw fish on the veggie with rice. It was above average but it is definitely over price. With $17 per portion, there was not a lot of raw fish in there. The waiter and waitress are very slow and complained about their tips. It took them about 10 to 15 mins to get us our check. I didn't feel like giving them a good tip either.   I always want to try the place but we went into there on one of the Sats when they had lunch sign out. After we went in, they said that they don't have the lunch special.  I feel like being cheated. Will not be back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-VVSLzMsaVsLOeSce8fVA"
  },
  "Jk70V2ykgVzjD66rLPJJIw": {
    "date": "2/11/2017",
    "text": "I made a reservation one day before we went there. But when we got there, they say there is no reservation. They confirmed that was their number I called, but they didn't write it down for reason.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6KkkNnVkJGUTsq82aalLbA"
  },
  "v4oSfnz3hhKHfTckibjlgg": {
    "date": "12/28/2016",
    "text": "Best Korean food I've ever had. Service was great, Loved the k-pop in the background. I'll definitely be coming here often!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c_yL97Lunl3ytiIUzLvJxQ"
  },
  "Jw_dSkiIBr8j-uYFDXMfCw": {
    "date": "12/31/2012",
    "text": "This review may be more biased than average, given that I am not a Pittsburgh native, and this visit to Green Pepper was my first and only experience of Korean food in Pittsburgh, as well as my first and thus far only experience of Pittsburgh itself; and I am a Korean who lives in the DC metro area. ~~~ My mom and I ordered the seafood kalguksoo (knife cut noodles) and kimchi stew for lunch on a weekday. The restaurant was completely empty except for us. We were given our meals in a reasonable time after ordering. We were each given ONE BANCHAN side dish of salty kimchi. In my experience, this doesn't even occur when one eats a Korean meal at home; it is UNHEARD OF in a restaurant.   It made sense to serve kimchi with my noodles, all else aside, but it was ridiculous for a KIMCHI stew entree to be served with EVEN MORE KIMCHI. All of the above wasn't really outrageous..just really ridiculous & BAFFLING--these are the types of things I'd expect and have seen as \"punishment food\" for the losing team on Korean variety/comedy shows.  I distinctly heard Korean in the kitchen, too, so I was even more confused. There really can't be a reasonable explanation for the food we were given, is the best way I can sum everything up.  The kimchi stew itself was meh~ (bad, to those who know what Korean food typically tastes like). The noodles I ordered were EXTREMELY SALTY, like the broth was made from sea-water that came with the seafood. It lacked flavor otherwise. I can't remember if the kimchi stew was saltier than avg, but I think it was tolerable. Prices were a bit higher than what I would consider fair in the DC area, and certainly ridiculous, given the lack of banchan, for example.  The waiter was nice and friendly and the atmosphere seemed nice. ~~~  TLDR: Nice service, but the food is literally a joke.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "WBwvzq9dZH5iewx6lno6KQ"
  },
  "TRGlqNy_xCt6w44DfiTEOw": {
    "date": "4/5/2014",
    "text": "I am a vegetarian so I ordered a tofu entree which was pretty flavorless unless doused in soy sauce. The real reason I gave only 1 star is because my boyfriend (who is only in town for two days) ordered a beef entree and then spent the rest of the evening throwing it up. I expected more from this restaurant.   We spent too much on our meal to spend the rest of the night throwing it up.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QgzPrY4EtWMgSIaUc89bAw"
  },
  "DwitprHXNY-saYxbhu4hHg": {
    "date": "5/30/2013",
    "text": "Went here with a large group (16) for a celebratory dinner.  The staff seemed to manage us ok relative to taking orders and bringing the food out, but thereafter, they seemed absent.  Food was decent.  I got the traditional Korean BBQ short ribs, which in typical fashion, proved to be the traditionally greasy, fatty, and flavorful dish I expected.  BYOB and Karaoke help distinguish Green Pepper over other offerings in the Squirrel Hill area, but don't over stay your welcome...  at closing time the staff abruptly shut down the karaoke gig and ushered us out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7aaA3Z0i7_XmjQWkamPlmQ"
  },
  "Qtd6pVH0Ppko6s1aZqWP8w": {
    "date": "8/25/2012",
    "text": "Best Korean I've had in Pittsburgh. I don't generally trust yelp reviews on Korean food , since Korean food can be intimidating if you don't know what you're doing. This is the first place I've been in a long time that serves Mul Nang Myun (I think they call it fresh and light noodles), and it was excellent....like summer in my mouth. BF had bul-go-gi which was also good. The seafood pancakes were also perfectly done and not the least bit rubbery.   Yes Korean food can be expensive but its also far more labor intensive than some other Asian foods....if orange chicken is your go-to Korean may not be for you.   If you're apprehensive go for lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "8YkgEusJsOmasGdQFZPWyA"
  },
  "3r6Fc683e3gVFZCc0p7Kew": {
    "date": "3/4/2012",
    "text": "Sometimes you need a little karaoke...and sometimes you need a lot. It was that kind of Saturday.  A couple of weeks ago I decided to put together a little karaoke event dubbed \"Whitney-oke.\"  I think you get it, you smart Yelper, you.  All Whitney Houston - all the time.  Usually, my crew heads to Duke's Station in Bethel Park (far, but ribs that make you wanna smack somebody, they're that good), but we decided to keep it local and head to Stinky's on Hatfield in L'ville for their weekly Saturday karaoke.  What this genius (me) didn't count on, was that when the Pens play, the karaoke machine doesn't.  Sad.  So, we headed to Nico's Recovery Room in Bloomfield - not my/our favorite place AT ALL - but desperate times.  Unfortunately, as is usually the case with Nico's, there was nowhere to sit and the cloud of smoke was intoxicating. So, I turned to Yelp.  The first place to pop up in my search was Green Pepper, a little Korean joint in Squirrel Hill.  Having never been, I called to check on the karaoke details.  Darren (came to know his name later) answered the phone and explained that karaoke is free until 10pm, but after that would cost $1.25/minute.  So, um - that took me a solid 5 minutes to understand. I think I asked him at least 4 times. Poor guy.  I'd blame booze, but I was stone sober at this point. I just didn't get it.  We decided it was worth it, especially given that there were 10+ people in our party.  We arrived to an absolutely empty restaurant and were VERY pleasantly surprised to discover a plush, leather couch-lined karaoke ROOM;  with a big tv, a nice, fancy microphone, internet access-based karaoke software and none of those strange kiddos from Nico's to judge our Whitney antics.  We set the clock and decided to spend one hour singin' our little Whitney hearts out (total $80).  It might seem like a lot to pay for karaoke, but the service was great and the camaraderie...well, that was priceless.  Can't wait to go back.  Britney-oke, anyone?",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "-ARdx8hOcEWlMDjzwLYZ_g"
  },
  "CTQ_KJimBp7FcvRyPDW6qg": {
    "date": "4/2/2018",
    "text": "The food here is clean and delicious! The complimentary dishes are refillable and good. Service is nice as well. This is my favorite Korean restaurant is Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ZrM6QmbyLoSTSxgrC2J8g"
  },
  "C4Tsf8RbuQNLE9Kbqw1bcA": {
    "date": "7/30/2016",
    "text": "Very nice food. I loved it. I was there with a couple of my Korean friends and they ordered the food. I don't remeber all the item names but they were all great.  Nice enviroments with cool living room style couches around tables.   The Bibim bops in the main dishes and the pancake in the appetizers is a must try in mymopinion. Especially the pancakes were conpletely different from what I had before. Not a traditional breakfast pancake at all.  I gave them a 4 because I felt and also based on my Korean friends' opinion some of the items were a little too pricy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PxbDxIHBC2-wl51VAV_RoQ"
  },
  "n-K-GxDGZEKLXFWo6j0etQ": {
    "date": "11/2/2015",
    "text": "1. Seafood pancake -- it's an appetizer but as large as pizza, enough to serve 2-3 people. It's really delicious! Strongly recommend! 2. Forgot the name but it's the last entree on the menu! Shrimp, kimchi, fried rice-- there's a spicy sign but it's not spicy at all!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dzvUU7TRyLElE74zY78h_w",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Seafood pancake -- it&amp;#39;s an appetizer but as large as pizza, enough to serve 2-3 people. It&amp;#39;s really delicious! Strongly recommend!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dzvUU7TRyLElE74zY78h_w/o.jpg"
      },
      {
        "img_id": "K8ejo19A-DRNs_IqdcV0Dw",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Forgot the name but it&amp;#39;s the last entree on the menu! Shrimp, kimchi, fried rice-- there&amp;#39;s a spicy sign but it&amp;#39;s not spicy at all!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/K8ejo19A-DRNs_IqdcV0Dw/o.jpg"
      }
    ],
    "user_id": "yi4yRfkBax2zne4SM-UvSQ"
  },
  "IYu3fSoalLBN1A9gddPf4A": {
    "date": "7/8/2016",
    "text": "I have eaten here many times. Although it is a bit pricey, the food is excellent and you get unlimited banchan (side dishes), such as spicy garlicky potatoes (my favourite), steamed broccoli, beansprouts, japchae (sweet potato noodles with vegetables), their in-house made kimchi (spicy picked cabbage) is one of the best. I personally love: the seafood pancake, kimchi pancake, bibimbap (rice with meat/tofu, vegetables and dippy egg on top in traditional hot stone bowl which scorches the rice and makes it so delicious), spicy octopus bibimbap, grilled mackerel, garlbi (beef short ribs grilled to perfection), kimchi jigae (kimchi stew) with pork, tofu or tuna.  Eating here is an overall fun experience, my toddler son was very happy for having been given fun little cup, spoon, fork and tiny training chopsticks with his favourite cartoon Pororo.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XZFlH0CO2Txp2OVynS0Zag"
  },
  "DbqPm1L3DOYpdIRvohTcIw": {
    "date": "8/16/2013",
    "text": "Slightly more expensive than Korea Garden, but food is good quality. Better than some places in KTown NYC in my opinion. I recommend the Bibimbap,  Spicy Hand-Made Pork & Home-Made Kimchi Dumplings in Beef Stew, and  \"Soon Doo Boo\" Spicy Soft-Tofu Stew. The Bibimbap is huge and comes with so many components to it. My favorite thing about this place is definitely the side dishes, especially the daikon radish kimchi and potatoes. Although, now they charge for refills when they didn't when they first opened.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "J5trdda_Wkddte9uJ_aXNw",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J5trdda_Wkddte9uJ_aXNw/o.jpg"
      },
      {
        "img_id": "newWh-5gMX_JiEIWASmbmw",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/newWh-5gMX_JiEIWASmbmw/o.jpg"
      },
      {
        "img_id": "G_QSvvKWwS_OBRnWbTT_0A",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G_QSvvKWwS_OBRnWbTT_0A/o.jpg"
      }
    ],
    "user_id": "DC1hfeeSaYr2E1xwiEL81A"
  },
  "W4Y73SceBqI0MgGpVhZ0pg": {
    "date": "7/7/2013",
    "text": "Came in for a Sunday brunch with my family and were the only group. I wanted to try a korean place around here since I had really good korean food in NYC a restaurant called Miss Korea. Side note- In my review you'll see that I compare to Miss Korea since their service and food was amazing. So any New Yorkers? - you'll know what I mean (: ! We were brought to the other side of the room where I saw a tv with a karaoke stand. The furniture seemed a little out of place to me with sofas and faux leather seats with glass tables. Besides the setting, service was ok like the usual.    Ordered a  \"Tuck Bo Kee\" (the first appetizer on the menu) and it tasted alright- It's rice cakes with fish tofu, fish cakes, and a boiled egg in spicy red sauce. Compared to the \"Tuck Bo Kee\" I had at Miss Korea, Miss Korea's is much better and tastes more fresh. (Miss Korea's \"Tuck Bo Kee\" comes with octopus and clams).  For Entrees, tried the Bibambap (305), Bull Go Gi (301) sweet marinated beef, and Spicy Bull Go Gi (302 - #2 best selling entree) spicy marinated beef.  The Bibambap looked amazing and very pretty! But tasted okay compared to the one I had at Miss Korea. I throughly enjoyed eating it out from the clay pot.   The Spicy Bull Go Gi to me tasted good and was more on the salty side than spicy. Was really oily and looked fatty.   The \"regular\" Bull Go Gi (Sweet marinated) was like eating sugar. Ridiculously sweet! So if you are a sweet tooth or like EXTREMELY sweet seasoned beef, this might be fore you. Or else don't order this! After one bite of the beef I knew something was off-  I told the problem to the waiter and he was nice enough to take it off the bill.  Both of these orders come in Bento Boxes with three banchans. Kimchi, noodles, and soybeans. Oh yes, that was another disappointment that I had. Their banchans. SO LITTLE! Again, I've experienced meals that come with 8-10 banchans so I was really disappointed.  In the end we were served with complimentary bowls of cinnamon ginger tea/soup. I took a sip and was something I could NOT drink. Extremely sweet!!!!  Felt like it was a mixture that could be mixed with dough to make cinnamon sugar cookies.  Waited for a long while to get the check processed. People started to come in 40 minutes later and there were only 2 waiters, so I understood why things were going a little on the slower side. The other waiter ended up processing our check since our waiter was busy, but I was glad that they provided us trident gum in the end.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7lAMYnXdib9AvOQsPylE6Q",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Topokki, bibambap, bull go gi, miso",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7lAMYnXdib9AvOQsPylE6Q/o.jpg"
      },
      {
        "img_id": "0YQtzmGhuZpcfmQEaFvlsQ",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Bibambap",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0YQtzmGhuZpcfmQEaFvlsQ/o.jpg"
      },
      {
        "img_id": "eiK0bD4WoXuHJ8sm121Lgw",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Spicy Bull Go Gi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eiK0bD4WoXuHJ8sm121Lgw/o.jpg"
      }
    ],
    "user_id": "2VGJEt4VpcUqrvEt6j5zqg"
  },
  "OfbNVOkaYAkk1IquyJn8xw": {
    "date": "4/1/2017",
    "text": "The wait for a table was certainly worth it!  The appetizers - dumplings and seafood pancake - were great.  The side dishes were good too.  The Bool Gogi was good, but different if you're used to BBQ beef.  Their shaved beef was just as tasty, just different.  The atmosphere was nice - quiet and intimate.  Highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-r4l6--AYCw1tb6Ag-nz5g"
  },
  "FyKl8cTtE7PeH1f0sWIg-w": {
    "date": "6/26/2015",
    "text": "I come here once in a while when I'm craving Korean food, especially since it's close to my apartment.  A couple years ago, I would've given this place a solid 4 stars, but after my recent visits, I can only say the Kimchi Jjigae, Bibimbap, and Kimchi and Pork dumplings will make me come back. Sadly, the service here really went downhill. It's hard to order, grab a check, and have a glass of water because the wait staff barely comes to check on you. The last time I came here, I asked for a cup of water that never came, despite me asking two different waiters multiple times. Overall, I'd definitely say that the food is the best part about Green Pepper, but the service can be a huge turn-off, especially when you're hangry and just want to have a meal.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rfFco6lZ59398G8rXgvkEw"
  },
  "MNc2SstNI27SMWkBlDqnAw": {
    "date": "1/7/2016",
    "text": "We ordered the top three dishes, Bibim bop, Soon Du Bu, and Bulgogi. They were very authentic and delicious. The free vegetable appetizers were awesome. The kimchi was salty and sour. I was surprised by the rice they served. It was mixed with something like red or black grains.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XUiCNLVCw3I5ueNRJWLwVA",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Top 3",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XUiCNLVCw3I5ueNRJWLwVA/o.jpg"
      }
    ],
    "user_id": "h2daaVYjVpPWjoFgBpSrmw"
  },
  "V3KrqfzIKFuKoxMF2wCGBQ": {
    "date": "9/3/2015",
    "text": "This place has a great atmosphere. It's very new, and they have a tv playing kpop videos when you come in! There are always Koreans here.  Buttt, their food is rather expensive and isn't as good as other Korean places in Pittsburgh, like Korea Garden, Oshii Bento, or Golden Pig.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "42aIqqLHAJeQRMVwZKcFdA"
  },
  "Tbqm2a5prewRFbSZsyh4fg": {
    "date": "1/21/2013",
    "text": "Good korean food has been and is still hard to come by in Pittsburgh.  Green Pepper has decent, but not amazing, food.  It's decent for Pittsburgh, but quite lackluster compared to the best restaurants in NY, SF, and the greater DC area.  I've enjoyed the Bibimbap bowl and Spicy Bulgogi here.  Generally the food is on the salty side.  Their prices are not cheap, but the entrees are quite large because they come with a variety of sides that include kimchi, cold noodles, etc.  I remember being impressed with their food during my first few visits but becoming progressively less enthusiastic with repeated visits.  Not sure if this means the food quality is declining, or if they're inconsistent.  Could also be a personal thing.  I did have a really bad lunch experience here once -- I ordered a spicy chicken dish, and the quality of the chicken was pretty bad (I think there were even bits of tendon/bone in the supposedly boneless strips of meat) and the dish super salty and with an off-flavor.  The environment is versatile.  It's upscale enough for a nice night out but doesn't prohibit wearing jeans and a t-shirt.  It's very friendly towards big groups, as they have several large tables and couch-based seating areas.  They have open karaoke on Friday and Saturday nights and offer pre-arranged private karaoke parties, which I have not yet experienced, but it's the only place I know of in Pittsburgh where you can experience a sliver of classic asian-style karaoke.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TsBUWbhRhuiEMXb56kL0Cg"
  },
  "3R5rhRI5FNI58rhrxfkMbg": {
    "date": "4/3/2015",
    "text": "If you like overpriced, mediocre food that takes an inordinately long time to get to your table and is delivered by ill-informed wait staff with lousy attitudes, this place is one of the best.  The giant TV screen playing Korean music videos was an irritating atmosphere choice.  Perhaps it's good Korean food, I don't know.  If people who rave about this place so much like Korean food that much, I think they should save up their money and learn to cook it themselves before patronizing this place.  $44 + tip for 2 people...  I could've gotten better food at a takeout place from people with less attitude.  Unless money and things like customer service aren't important to you at all, don't go.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vnZhfpFkDQAob2B-4Q_dhA"
  },
  "ZgcF2XlvBrrkt2gA_5ONIg": {
    "date": "8/11/2016",
    "text": "Came here for a late dinner. The place closes at 10 pm but the kitchen closes at 9 pm. Good thing we came in before the kitchen closes. I saw a couple of people got turned away after arriving past 9 pm. Ordered the spicy pork and it was amazing. The banchan was good too and the server got us extra. The prices were rounded to whole numbers (after taxes) on the check. Korean restaurants are expensive so my dish came to $18 but I was beyond full.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WbF4O180ed9bXyYvQrc-zQ",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Spicy pork with soup and rice ($18). Banchan included.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WbF4O180ed9bXyYvQrc-zQ/o.jpg"
      }
    ],
    "user_id": "mn953G0yuwIOlkgzOXkRGg"
  },
  "dZnKOzVUlRwYVQ9WGgh3YA": {
    "date": "9/7/2014",
    "text": "So this evening, the wife wants Korean for her birthday dinner, just some takeout, y'know, have some be-bim-bap in our own backyard while contemplating the trees to the sound of dying locusts. So the kid (age 14) and I go to The Green Pepper and I send him in with some cash and wait in the car. He comes out ten minutes later, empty handed. \"Why the delay?\" \"The guy said this is a fake twenty dollar bill,\" my son told me. He tossed me the bill (it was the old kind, from the 1980s). \"Really? Did he use a pen on it?\"  \"No,\" said my son. \"He said it was 'the fakest twenty dollar bill he ever saw' and said he didn't have a pen. Then he said 'I can't take it, it's fake. Sorry dude.' I just stared at him.\"  \"What did this jackass look like?\"  \"Five foot four, looked like a weasel.\"  \"Not Korean?\"  \"No. Caucasian. He also couldn't figure out what key to use in the cash register. And then said when he was handing me change from the twenty, 'you gonna give me a tip?' -- which I thought was really weird.\"  \"What a jerk. Probably thought it was fun, yanking the wires of a 14 year old.\"  On the other hand, the food is good. Each dish a few more dollars than the other Korean place we normally go to that's closed on Sundays.   And the cicadas joined together in a symphony of lust and mortality as we dined under the stars.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOmDSeE2n9jekxjKQ79NaQ"
  },
  "ebihuwc5cVDsiYo24S7gkg": {
    "date": "6/28/2014",
    "text": "I came here several months back for dinner per the recommendation of my dining companion, who lives nearby.  This was my first real experience eating Korean food, so I wasn't sure what to expect.  Since I don't eat beef, the bulgogi wasn't an option for me, so I went with the spicy pork.  It came in a bento box with three other side dishes (don't remember exactly what they are/not sure I could identify them due to unfamiliarity with cuisine), plus a bowl of rice.  It was certainly a lot of food--more than I could eat in one sitting--but then again, I would expect as much, given the prices.  While the pork was flavorful, it was a bit spicier than I would have liked.  To be honest, it's difficult for me to judge the flavor of the pork, since I'm unfamiliar with the cuisine, but it was interesting and I enjoyed it, for the most part.  The side dishes that came with it were hit-or-miss for me, with some being very flavorful (pickled veggies) and texturally interesting (noodle-y things), and others less so.  I didn't really feel that the rice added much to the meal.  The atmosphere was interesting.  My dining companion explained to me that it doubles as a karaoke place after 8, hence the K-pop music videos playing on TVs as we ate.  Service was fine--no problems there.  Overall, an interesting experience, and I'd be willing to come back and try it again. 3.5 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "LNANwXuPXwvMYvYmCI9gmQ": {
    "date": "10/9/2014",
    "text": "AWESOME FOOD. I studied abroad in Asia in college, which is where I was first exposed to Korean food - and I fell in love. I was so happy when I got back and found Green Pepper. Bibimbap is AWESOME, so is the scallion pancake. It's also a cool experience - for those of you who aren't familiar with K-Pop - it's awesome and hilarious.  Sometimes the service is a little slow and the prices are a tad high, but the food is so good (and you can't find it anywhere else in Pittsburgh) that I don't even care.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_oNthTV94Evx9qGkJOTXLQ"
  },
  "Mv6BvRiKcjFRYEBxZ4OTmQ": {
    "date": "8/31/2014",
    "text": "Good Korean food, but high prices and poor service.   My future parents-in-law came to town from Korea, and after days of eating nothing but Pittsburgh tourist food, they wanted a taste of home.  When we arrived, the door was open, one other table was seated, and no one waited on us for nearly ten minutes. Finally someone came over to inform us that they don't open until noon (unlike the 11:30 time posted on their website, Google, and Yelp) and that they couldn't take our order until then. It was 11:45. Before noon, two additional groups sat down.   The food was average Korean fare. There was nothing particularly special about it. With entrees ranging from $16-$30, we expected a higher quality product.   The wait staff, though, was the most unimpressive part. There was no organization whatsoever. We had three different servers waiting on us. That should never happen. Also, one of the servers was inexplicably wearing flip-flops and very nearly injured herself from slipping as she exited the kitchen.  Ownership needs to get a handle on how to properly manage a restaurant. For the price, it's not worth the mediocre service or the product they put out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cyj_7M0vcwNVIjnUWPOz0g"
  },
  "XnNHCWrrOcolLPMe3jAC-w": {
    "date": "3/21/2014",
    "text": "Please** put up with slow service for great food. I am in agreement with it being expensive but it's so friking good. Everything tastes good. They have alcohol! Korean bbq! Amazing sides! The bibimbap has such a great flavor and such well prepared ingredients. I am always excited to come and eat here. And that is rare in Pittsburgh.  The way that they cut the vegetables and present the meal is amazing and the sauce is just perfect. I havent had such good Korean food since Koreatown in Toronto.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zv1DkDIgAAFt0S88a2qROg"
  },
  "Q6qAoqhxKqbEn9M9tdj5Pw": {
    "date": "1/11/2014",
    "text": "I had been waiting to try Green Pepper for a long time. The anticipation of spicy and savory Korean food had my mouth watering before I even stepped foot inside the doorway.   I had a little cloud pop over my head with kimchi floating about and I let out an \"mmm\" sound. It was strangely reminiscent of Homer Simpson thinking about donuts.  To start we ordered some dumplings. The mains were staple Korean dishes- Bi Bim Bap and Spicy Bulgogi.  The amount of food that comes with an entree is staggering, Kimchi, greens, sprouts, potatoes...etc. My girlfriends bulgogi was quite a spectacular and had a fried egg on top! Let me tell you , everything is better with a fried egg on top.   Both dishes were hearty and full of flavor. It was a bit odd to see Korean MTV juxtaposed with relatively fine dining, but hey, I have seen stranger things.  Upon finishing, if you can call it that- because we were so full...we received a delicious dessert tea.  And to make your host happy, never forget to say thank you in Korean- Tedahni Kamsamehdah!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "s_PI8eOGJdoYCIGCSmBN8Q"
  },
  "Uv6LuTZwi4Y91_DBL_mXzg": {
    "date": "12/19/2013",
    "text": "Probably the best Korean food you're going to get in Pittsburgh.  This area doesn't have a huge Korean population like some coastal cities, so those of you from New York, DC, or LA should adjust your expectations accordingly.  Other reviewers have noted that the food is expensive, but, to be fair, you do get a lot.  You will not leave hungry. I had the spicy octopus bibimbap.  They made it authentically in a cast iron bowl that sizzled pleasantly when it was brought out.  The menu description did not disappoint: it was quite spicy and well-endowed with octopus.  My dining companion (a self-proclaimed Koreaphile) was impressed with the more exotic menu offerings and the K-pop videos playing in the background. My only complaint was the soup that came with my meal.  It was scant, lukewarm, and boring.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "DmXlYGtjjz-EHpaDyJCWSQ"
  },
  "q3lOPFEkzDjnA3G_E3qLjg": {
    "date": "5/11/2012",
    "text": "Maybe two stars is a little harsh considering only the quality of food, but the price brings down my rating significantly.   I went on a Friday night around 7 (usually when the main chef is on duty at most places) and tried a few of the dishes. My server was new and unfamiliar both Korean food in general as well as the menu, proving to be pretty unhelpful. Being new is not someone's fault, but he was simply insufficiently trained; when we asked for a side of pickled shredded radish (a Korean banchan staple), he brought out sliced cucumber with a chili dressing. Anyway, the spicy porkj and kimchi dumplings (fried) tasted alright with the soy sauce, if a bit flat. They were excellently crisp but the stuffing was oddly homogeneous and mushy like the pork was overly minced (a small complaint that did not lessen the taste).  I got the \"Garlbi\" (not galbi?) for an entree and was satisfied for the most part. The flavor was solid, if a bit sweet for my taste, and it came presented on a massive platter with 3 sides (seasoned tofu, kimchi, and bean sprouts), a small bowl of soup (which looked like miso but I suspect was doenjang) and a side of rice. The ribs themselves came sizzling on a cast iron pan that left a nice char on the veggies. They had nice grill marks and flavor but the texture was oddly tender. I know asian pears tenderize meat, but I would have preferred if they had a better chew. This was a similar problem with the spicy beef bulgogi which, again had a nice taste, if not very nuanced. The texture however is best described as a mound of mush. The beef had been shredded and tenderized to the point that the rice had more chew and texture. The flavor is enough that you can get over it but it could have been significantly better. My friend tried the bibim-bop and, while I didn't try much of it, she found it mediocre.   We all concluded that the problem was not in a lack of authenticity; they didn't do anything dumb like make everything an American-Chinese stir fry. In fact, a lot of the menu items are obscure even for people with a good knowledge of the cuisine. Everything just feel short of tasting like good Korean. It looked right and the flavors were on the right track, but literally every dish was a few nuances short of worth it.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FSN8kNTktUv1TQb0-_G_qw"
  },
  "SPfX2EK2TDYaJajUG3oSXA": {
    "date": "10/5/2014",
    "text": "This place is a solid 4 stars in my opinion.  I would have to say the service isn't the best, not very friendly and not thorough in regard to checking on tables.  Getting that out of the way, the food and atmosphere make up the difference.  The food is solidly good Korean food, and the restaurant atmosphere is sleek, modern, and clean.  We always enjoy what we order.  They serve a Korean dessert soup after dinner which is a thoughtful addition.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VQ_-F9T_zf-vxz7pptgSng"
  },
  "0XVE0S1bWvEnUzraou51OQ": {
    "date": "9/11/2012",
    "text": "I have been to the week-end buffet a couple of times.  I am not sure if they're still doing it but, it was absolutely mind-blowingly good.  Expensive - $20 which is more like NYC prices.  But, good home-cooked traditional Korean dishes that to me are like Asian soul-food .  Recommended if for just once in awhile due to the high cost . (the buffet is ONLY on Sundays.)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ekUMPGWf4QB5uj6yAvGIw"
  },
  "1A0X91rpzTnMIR3ImGdBQg": {
    "date": "10/1/2011",
    "text": "I'm a huge fan of Korean food so when I saw this place I knew I had to try it out. I wasn't impressed by their bulgolgi, the beef they use is definitely a cheap cut,  it was very stringing and I almost choked on it. I will probably go back again and try some of their other dishes. I agree with most people that their dishes are overpriced. Be prepared to pay about $50 for two people.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "5Ra43bbUQNYkBCOUQtxYnA"
  },
  "JN-E9smdtsqo1_wjE68XHw": {
    "date": "9/15/2012",
    "text": "1st off the staff was allowing my group to be seated. Even when there were tables available. People who arrived at the same time as us and after us had received their food and finished it before we even got our food.  We waited for ~1hr for our entrees.  I ordered the Soeul Lung dish. When I finally got it, I found it not only bland, but devoid of contents. For a bowl that held 4 cups of a weak broth, the combined volume of noodles and 4 tendon-y slices of beef was only half a cup.    I tried some of my friends' dishes and did not find them tasty either.  (Spicy bulgogi, cold buckwheat noodles)  It did take a bit of coaxing for the staff to agree to comp our appetizer.  Overall, it was too much expense for the quality of food and service.  I don't recommend this restaurant, but it could have just been a fluke for the that night and our table.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vSE0_XsS_Qgdp805O6RefA"
  },
  "J_V3ZbsjQxozskTPxamcrQ": {
    "date": "1/30/2013",
    "text": "Good, interesting food. I go here pretty regularly and mostly have the same dish or variations on it, so I'm not really going to be able to comment on the overall menu (sorry). I can't say much about how Green Pepper compares to other Korean restaurants, especially those that may be located in Pittsburgh because this is the only Korean restaurant I've ever patronized.  I find the wait staff to be very friendly, especially once you go a few times and they recognize you as a regular. They are very amendable to special requests.  The dish I usually order is the \"Spicy Chicken Meal Set\" which never disappoints me. It comes in a rectangular serving tray with compartments. It's very cool looking.   They serve these delicous, clear noodles called, I think, (and spelled phonetically) \"Chock-chay.\" These are wonderful. I would just order these, if I could.   I can't say that I've ever had a bad meal. The kimchee is always very flavorful and the vegetables are always fresh. Sometimes they serve a tasty kind of pancake and other times, it's tofu. The chicken is sometimes more spicy than others, but I have always enjoyed it.  There may be other, \"better\" Korean restaurants but for Pittsburgh, I think this place is  worth a visit and I'm glad I found it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CyYfjQJgnXOis15-syC9Fw"
  },
  "geOXNQTCsrlQXG_WUOfwyQ": {
    "date": "8/14/2011",
    "text": "Gourmet korean food, good sized portions, reasonable prices, friendly staff, beautiful presentation and nice atmosphere.  Pittsburgh doesn't have many korean restaurants, and this is a welcome addition to our options.  I'll look forward to coming back soon!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MDeA-Gx8NScCyAdziq7IeA"
  },
  "Xe9iP2RSyLrSD4v37XUL_w": {
    "date": "10/19/2013",
    "text": "Way overpriced for subpar food! Bi bim bop (vegetarian) for $16? The food was surprisingly not spicy- I had to ask for a second side of red pepper sauce to make the bi bim bop have decent flavor. Could hardly flag down staff when we needed anything. I definitely won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GDuPxIUv8KElI7ZzN9-VpQ"
  },
  "JHM8w5wn5HXrrhIV0V55rQ": {
    "date": "1/14/2011",
    "text": "I had the kimchi chigae, and it really hit the spot. Beautifully hot and spicy. I would give 4.5 stars for the food, but the service wasn't so great.  The waiter seemed overworked, and when a neighboring table asked if a certain meal had shellfish, he just said \"I don't know\" without offering to check with the kitchen. He didn't have a bad attitude, just a lack of experience (I think).   So I'll round it down to four stars overall.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "lv52Tt5labpxJELNZPCRCQ"
  },
  "Z_nb98lAkSbJakf-n-EndQ": {
    "date": "11/7/2010",
    "text": "Green Pepper is the 1st Korean restaurant in Squirrel Hill, and the second Korean business after Young's Oriental Mart. Normally, I like to rant or rave about a business, but I'm very neutral about this place so this is a pros and cons list about this new business:  PROS -Service was very genteel  -Portion size for  the Kimbap was large. Meat dishes, like Bulgogi, are much cheaper here than at other Korean restaurants in Pittsburgh, but the casual food is a little overpriced. The plate ware and interior decor is very streamlined, but there is an awkward emptiness still lingering in the space. -I peaked into the kitchen and it was very clean. Was a little too empty of the ingredients and inviting cooking smells though...  Like in most korean restaurants, a complimentary dessert or candy is served. Here they had both! Hobakjuk (korean pumpkin porridge) was served in little white bowls after we asked for the check and then our bill came with peach hard candies for the table!  CONS -Like mentioned earlier, you're overpaying for casual Korean cuisine you could get cheaper at Korea Garden but the Bulgogi is cheaper here. -Service was nice but the waiters are unexperienced students and everything is very slow. -Green Pepper doesn't serve as many side dishes as the average Korean restaurant but their complimentary after meals totally compensate for this. -NO DEFAULT KIMCHI at the table!! This is unforgivable. It may have been bc I was at the table with non-koreans, but it's still ludicrous. -The Ramen Soup and Kimchi Dumpling Stew could've been made at home for a couple bucks. If you're going to serve it at a restaurant, there should be other things inside. There wasn't even a dropped egg or a couple pieces of green onion in the Ramen. The dumplings looked so lonely in the stew because there was nothing else in the broth. No mushrooms, cabbage, meatballs, onions, nothing! -Besides our table, there were only Korean patrons there, let's share the culture! The place could use more advertisement and be less introverted.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "HlFx562GFpbL9VmILh2Osg"
  },
  "7QteRR36TXI-_3HtCNFtEg": {
    "date": "12/10/2013",
    "text": "Overpriced and abysmal service.  We arrived during normal dinner hours to an awkwardly empty restaurant.  We needed a minute to review the menu, and the waitress came over twice in about two minutes.  It then took another fifteen for her to even glance at our table.  The banchan doesn't come first and in fact comes after the appetizer, with the course.  The food was decent but pretty bad for the price, especially in comparison to NYC's KoreaTown.  Flagging down a waitress for a water refill took about twenty minutes, as she hadn't checked on our table for about forty.  At that point, we were just done with this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PWl_wcphoKeF2lBeDEyDaQ"
  },
  "ALbb2wmR9uryuYcnHB53fw": {
    "date": "4/8/2011",
    "text": "Great Korean food in Squirrel Hill.  The spicy bulgogi and baby octopus are my particular favorites.  Which side plates they provide seems to vary (there's always kimchi!), and unfortunately they're served per-person rather than for the table, which cuts down on variety.  Recently they've included a dessert of ginger persimmon soup, which is unique and a refreshing way to end the meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cWovCSAoy3S_dZoD8ZI8LA"
  },
  "1u3ji16wTeb0i5jvgpgreQ": {
    "date": "11/27/2011",
    "text": "A bit expensive. Real stone pot used for their bulgogi bibimbap. Dishes look good with delicate decoration but don't taste as good. Good environment at the hall at back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AyhF9VDkrReBv_cO-oI-JA"
  },
  "U7NdRrDyKo--1l2tKn4B4g": {
    "date": "1/2/2011",
    "text": "We really enjoyed our trip to Green Pepper. Though a little more expensive than we were used to paying in Ann Arbor, where Korean joints abound, we did get a lot of good food for our money. We both had the veggie Bi Bim Bop, which was beautifully presented with miso, the traditional appetizers (incl kimchi), and followed by a nice sweet barley drink for dessert. The service was good. The decor was strange - annoying green laser lights and a random assortment of kitchy americana things on the shelves. However, there was a second room where it looked like they sat larger parties, which was nicely decorated.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "ICueswLm5Qav5JN3EHw-Fw"
  },
  "aLbU4bnZ9KwBELXqeN9Cew": {
    "date": "7/31/2011",
    "text": "The food was delicious.  I had bi bim bap.  I liked that the bi bim bap came with many ingredients on the side so you could mix and match as you pleased.  In addition, the meal was large.  Also, the dessert tea they serve at the end is delicious.  The only con was the relatively high prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8heSpevri02f06W9VeNz0g"
  },
  "ARgye__d9n6lFe9zwa2XFw": {
    "date": "6/17/2017",
    "text": "The food and service were outstanding. We will definitely return to this excellent restaurant.  We liked the seafood pancake especially and entrees were fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DC02W5COI79KM-JVPe_nYw"
  },
  "Sxhbwcpy6vtzdXR3q6gOnA": {
    "date": "1/30/2018",
    "text": "I love the food here and this restaurant is elegantly decorated. The only reason for 4 stars instead of 5 is because the wait staff are not overly friendly, they are not rude by any means....but a smile on the face, and refilling the water (places that leave me thirsty are a pet peeve of mine from my days working as a server and being more aware of people's drinks myself)would go a long way and make this place 5 stars.  I love the bibimbop and the soju cocktail, and the sides are amazing and unlimited in size.  I think after writing this review, I will check their hours and go eat there today, I am hungry now!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G5jKh6i3ugLtLPAAXz8DpA"
  },
  "ohzSuJc0afefF8SKrljaDA": {
    "date": "8/18/2018",
    "text": "Food is very good.  Service was good initially but dropped off as more people came in. Definitely recommend for korean food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E89dlx5J0Yo2VzhYypi7mA"
  },
  "anK1URoNTfull-sfYGrhQQ": {
    "date": "3/2/2016",
    "text": "Had a Sunday reservation for a party of 10 for a celebratory brunch, and they seated us in the karaoke back room.  The onslaught of K-Pop music videos on the television screen behind us provided amusement throughout our meal.  We were brought 5 different varieties of banchan, which included kimchi, spinach, japchae, fish cakes, and bean sprouts.  They were tasty but could definitely have stood to be refilled during our meal.  (They weren't, even once, which I found strange for a party as large as ours.)    I ordered the soondubu, which wasn't super impressive with its included seafood (some clams, squid, and small shrimp) but was very well-seasoned and had me craving more of the spicy stew for days after I devoured the leftovers I took home.  I would definitely be back to order this dish again.    Most of our table ordered either the vegetable or regular bibimbap, which came in a huge dolsot bowl and was very well-received all around.  The big disappointment was my partner's Pork Belly BBQ Grill, which was definitely plenty enough for two, as advertised, but the very thinly sliced pork just wasn't very flavorful and could not be saved by the various sauces and accompaniments.  Definitely not the best $40 we've ever spent.    We B-ed Our Own B, and the $5 corkage fee we were charged for each (super oversized) wine bottle we brought was very reasonable.  Overall, we enjoyed our meal but were definitely incentivized to try other Pittsburgh Korean establishments before circling back to Green Pepper.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yk6WWwezDBeQB3Kpb7xehA"
  },
  "8PrRx5Gf1QHOTa48pmTD6Q": {
    "date": "11/21/2016",
    "text": "The prices are a bit high for what you get. The bi bim bap and spicy chicken are salty. I really wanted to like this place, but there are better options out there for Korean food. The back room that has karaoke looks cool. I just wish the food was better for what you pay for.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "AvJKPrUYFMwVMj0iT1BhvA",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Spicy pork",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AvJKPrUYFMwVMj0iT1BhvA/o.jpg"
      }
    ],
    "user_id": "D0_EDhZvO5z3UEPszmxiYg"
  },
  "VrPXJbb8bgXClOE5bV6g8w": {
    "date": "2/11/2017",
    "text": "I made a reservation an evening before, but when I came they claimed they didn't receive the reservation, so I showed them the call history but they still denied. The attitude of the servant was very arrogant, being very irresponsibly saying it's not his personal fault, and didn't positively seek for a solution for us. The worst experience I've ever get on squirrel hill. We designed this to be a birthday dinner but it was all ruined.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NVN_g7BenSc6PlMJGK7rJg"
  },
  "9OEnMq0GSJe30mR2is4XdQ": {
    "date": "12/17/2016",
    "text": "Very good Korean food! The banchan (side dishes), were also very delicious~. My spicy noodles (forgot what it was called in English) was pretty basic but still good. Prices were aiite but moms LA Kalbi was expensive, which is normal for all Korean restaurants. Very nice interior decor. Would go again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J4s-nnp3JUNawmv9bKnGWA"
  },
  "EVK3zsNR1Xe9RalC_XtifA": {
    "date": "1/20/2019",
    "text": "This is a very Americanized Korean restaurant. If you are looking for a more authentic, mom-and-pops restaurant this is not it.  We ordered soon du bu, kimchi fried rice with pork, and bibimbap. The food was decent. However, they only gave us four side dishes (banchans): broccoli, japchae, potatoes, and bean sprouts (NO KIMCHI?!?! AT A KOREAN RESTAURANT?!?! very sad). These dishes were never refilled, even after they were all eaten.  The service was subpar and we were never checked on, the waiter refilled our water once without any word. The kicker is their overpriced food. 15.89 for soon du bu is pretty steep as is, but when we received the check they had rounded the price up to $17.00. Everything else was rounded up as well. The check stated that this was pre-tip. What?! This was unacceptable and we will not be eating here again.  Very sad, as the food was alright, but there are better Korean restaurants in town.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5eGt71-3oqhT-m8XHXYLZA"
  },
  "SXv73XmmanUFewiabFzLeg": {
    "date": "8/5/2015",
    "text": "I travel to Pittsburgh once a month for work. I am Korean so having Korean food during a work trip is a must! I have tried a few korean restaurants in Pittsburgh and I believe that green pepper is my favorite.   Pros: It is clean and very nice looking  Food is authentic  Service is good (can be hard to find at a korean resturant :) it's the culture ha ha)   Cons: It is a bit over priced but after trying other restaurants around the area, I'd rather pay the higher price.   I've had the kimchi jigae and grilled mackerel .  Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "u766nLu7-4ptpYTPdlGbnA"
  },
  "u0tE9yDhiZyKebwSMSRbBg": {
    "date": "11/18/2017",
    "text": "Soo Doo Buu and seafood pancake are really good. The side dishes are fantastic. Also 10% off paying with cash",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "edhxIFVTqW6A7it9y7TA6w",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/edhxIFVTqW6A7it9y7TA6w/o.jpg"
      }
    ],
    "user_id": "9gdRV2jTbSaKly1GRD7tfQ"
  },
  "nww3HJY3cZgR6j894cH9FA": {
    "date": "3/14/2015",
    "text": "As always, the food is fantastic. Reminds me of my mom's cooking back home.   They do now give a 10% discount if you pay with cash, so if you haven't tried them yet, hoard up your cash and go visit them now!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yFdLT6sKqABv4NI9hojEOA",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. 10% off cash payments and the dessert they give at the end of the meal (dinner menu only): sujeonggwa",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yFdLT6sKqABv4NI9hojEOA/o.jpg"
      },
      {
        "img_id": "UgBrgLv9q2MOF9ivHYWlpA",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Spicy beef (bulgogi)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UgBrgLv9q2MOF9ivHYWlpA/o.jpg"
      },
      {
        "img_id": "-HSxxbKaDUpVZmYV2maQmA",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Seafood Soondubu (or soft tofu stew)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-HSxxbKaDUpVZmYV2maQmA/o.jpg"
      }
    ],
    "user_id": "QKO1lJNXNuYTlMsUnwjM6g"
  },
  "QuASWqArPEQhlmWZCdehFw": {
    "date": "1/5/2015",
    "text": "!  As a korean american living in Pittsburgh, I'm determined to try all the Korean restaurants around....the atmosphere is  kinda strange. The only thing Korean about it is the kpop videos playing on the TV screen. I was pleasantly surprised to see Koreans there whIch gave me hope tho. The banchan was pretty good... Happy to get chapjjae- kimchi had a nice flavor....Boyfriend ordered the spicy bulgogi ( ) and I ordered my favorite kimchijjigae()       It kinda turned me off that the waiters and waitresses used the Americanized names for the dishes. \"Spicy beef\" and \"kimchi stew\" ....I just wish they would use the proper names, but I think that plays into the whole atmosphere th8ng I mentioned.  My boyfriends food didn't taste authentic. I was surprised at how unkorean it was. He said that his meal had a taste that he has experienced before whereas most Korean food he's tried is something unique and unmatched.    My jjigae was pretty good, but broth was a light color. I was full when I finished tho which was a good sign.   I would go back for a samgyeopsal  KoreanBBQ BC the samgyeopsal in my jjigae was good. Other than that, I think atmosphere plays a lot into restaurants and their authenticity... and I think this restaurant can play well to American audiences just introduced to Korean food...but, personally, having been to Korea and felt genuine Korean restaurants....this place just didn't do it for me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3TNpd3oF7ny88T2zrwxcuQ",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. spicy beef",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3TNpd3oF7ny88T2zrwxcuQ/o.jpg"
      },
      {
        "img_id": "CHJbGtJV1sW6P7Vaq8gGeA",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Kimchijjigae",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CHJbGtJV1sW6P7Vaq8gGeA/o.jpg"
      }
    ],
    "user_id": "U2JnZGuLu2jI0Z3D8suZWw"
  },
  "NbJQU9ECC2q3aMTCeDiLzA": {
    "date": "10/22/2016",
    "text": "Prices are comparable and food is good. Have only eaten at the restaurant a couple of times, usually do take away. Restaurant is nice with decent service. Recommend for take away.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "_mE03hneL7wq0tdMeKbChA": {
    "date": "9/25/2014",
    "text": "I've been putting off going to any Korean place that is not located in either California (ktown),  New York, or Georgia and obviously Korea...because I am afraid it might not live up to my expectations. This place is great for Pittsburgh, I love it but I want more!  Wish they gave more sides, if not unlimited. But they don't. They only give you 5, even though the menu says 6. And it's per table not per person. Which by all means, is not enough if you were eating with a big group of people. *sad face* I didn't ask if we could have more sides because by that time our food came out. Maybe I will next time.  Only wish they had the cold picked daikon radish as a side, Cold noodle soup, tofu soup with raw egg, and hot plates in the center of tables to cook your own food. Also I didn't get the rice water that usually comes with meals (u know what I'm talking about.. that brown warm water). Is that too much to ask? Maybe I am mistaken. Correct me if I'm wrong.  Lastly, seating and ventilation was terrible. The couch seating up front was awful. I left with a back ache and smelled like smoke. So did it live up to my expectations? who cares... :)  I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "A5p42lRD8I8qDwgK-JAQVA",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Spicy pork",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/A5p42lRD8I8qDwgK-JAQVA/o.jpg"
      },
      {
        "img_id": "MwQxNGbCv0OixyWFt8Aekw",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Bibim bap",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MwQxNGbCv0OixyWFt8Aekw/o.jpg"
      }
    ],
    "user_id": "2IweYEr1K6vWxx428zZoVg"
  },
  "8L_XbLJm4CL14yoZaXpVHQ": {
    "date": "2/11/2017",
    "text": "VERY BAD EXPERIENCE IRRESPONSIBLE WAITERS We made a reservation but after we got here they said there was no such reservation. We showed them the calling record, they admitted that this was their number but claimed that they don't know what was communicated on the phone therefore they cannot guarantee there is a reservation. IF YOH DECIDED TO COME HERE TO EAT, NO NEED TO MAKE A RESERVATION BECAUSE NO ONE CARES.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9trBOtnRtJsC9PbnkwqfyA"
  },
  "xQssCZlzNYDJk9cPDb23Kw": {
    "date": "7/3/2015",
    "text": "Decent food. Too bad I couldn't enjoy it because of the loose strand of hair in my spicy bulgogi. We went for my daughter's 15th birthday, as she adores the Korean culture. So, of course we were looking forward to a peaceful, delicious meal. ..but that hair...ughhhh! Just RUINED the entire experience. I know things like this happens..but nonetheless, it was disgusting. Will I go again...? Maybe. But I'd definitely try to find a different spot first. They were really friendly and apologetic about the incident. They offered me a free drink; but I declined. Not sure if they knocked the price down from my total..I think I got a discounted price. I don't know..I wanted to pay and leave. #bummer  Aside from that- nice and clean environment, overly priced food-but hefty servings and great K-Pop music on the television. My children did enjoy their meals.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VALh4xQp3uDX23x9O1ozNA",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Korean soaps in the background",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VALh4xQp3uDX23x9O1ozNA/o.jpg"
      },
      {
        "img_id": "Igzp1EwWxfH8Lah3FJlKQw",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Purple rice this time..last time it was plain white",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Igzp1EwWxfH8Lah3FJlKQw/o.jpg"
      },
      {
        "img_id": "s-39fFhGOSft6mGCMVxDUQ",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Dessert. Not sure what it is..",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s-39fFhGOSft6mGCMVxDUQ/o.jpg"
      }
    ],
    "user_id": "MP5PG36M4h2T-rMfAKqM0w"
  },
  "y1F635ImptOtyWHfeCS5Qw": {
    "date": "11/11/2017",
    "text": "One of my favorite restaurants in Pittsburgh. Food is great, and seemingly pretty authentic (it's not unusual for me to be the only white person there when I go). Servers are friendly and food comes out relatively quickly. I highly recommend the Bi Bim Bap! I also really enjoyed the kiminchi pancake appetizer. The BBQ is good as well",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uGJAIka-J09dXj9Avb_WaA"
  },
  "YHKCXkkbFqrwxlMXZW3mhA": {
    "date": "9/20/2016",
    "text": "Why I'm not impressed : Average food, no refills on the Bachan. Before you judge, they took the little bowls away, so I guess that was a  clear indication that I couldn't even ask for more :/ It may be because this is Pittsburgh, but the food really is pretty average.   What I ordered : Steamed Pork Dumplings, Fried Beef Dumplings, Kimchi Pancake, Beef Bulgogi, Mackarel   What I liked:They inadvertently brought a BiBimBap Bowl out instead of the Bulgogi, but corrected my order without much argument.   Other Thoughts:The atmosphere is loungy and we felt under-dressed in shorts and t shirt. The website could use a better background image and perhaps a few formatting edits on the text. It is almost impossible to read in its current state (09/2016). The K-Pop playing on TV screens kept us entertained. I mean, we all like PSY, right?  Oh, and they had the song number for Gangnam Style printed out near the Karaoke Machine. Nice!   I'll definitely give them a few other chances before I re-evaluate my rating, but they're a solid 3.5 for now.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qkRVFX4OrkZq0uDqb822tA"
  },
  "PnB89LM5uls7oyabwlewtg": {
    "date": "1/12/2016",
    "text": "A group of us came a bit late for lunch service on a Sunday, but they were nice enough to seat us anyways. I ordered what I normally order at a Korean restaurant (if they have it), which is the dolsot bibimbap. The hot stone dish was perfect for the chilly day we were having. The free appetizers were good. We also got the crispy onion pancakes, which were yummy. For all the entrees we got, the portions were large enough that three out of four of us got to-go containers. I didn't even touch the miso soup that came with my dish. The bibimbap I had was exactly what I imagined it to be and it was delicious. Afterwards, they treat you to a cup of persimmon tea.  I was a little surprised that the weekday lunch items were like $5 cheaper than the weekend menu. If I had to make a suggestion to the restaurant, I would suggest separating the weekday lunch menu and the weekend menu. Being able to see what I would've paid if I had come for a weekday lunch, makes me feel like I'm paying too much on the weekend. On the plus side, if you pay cash, they take off 10%, so that's nice. (There is an ATM in the restaurant.)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "vHHjaq9pSuwq8uCrQ85qlw"
  },
  "2ZdUoHPXQ8KSBeKBLQrtCQ": {
    "date": "5/22/2016",
    "text": "Pittsburgh is a bit underwhelming in the Korean department; this place doesn't stand up to the best options around Atlanta or some other cities, but taking into account where you are, you can have an enjoyable if slightly overpriced meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YE54kKTuqJJPNYWIKIpOEQ"
  },
  "kR62ZOhj2Q78UHItY7WK8A": {
    "date": "1/18/2016",
    "text": "Enjoyable Korean dish experience.  I'm not very knowledgeable about Korean cuisine but one of my dinner companions had been here and recommended the Bibim-Bop (love the name) dish.  You can order it either vegetarian or with bull-go-gi which is beef.  I ordered the vegetarian dish.  In place of beef is tofu.  It comes in a very hot stone bowl.  There is rice at the bottom and then vegetables and finally, the tofu on the very top.  The dish comes with a fried egg in it which was easily waived so I did.  It comes with a side of peppery red paste and I used very gingerly.  It was very flavorful and the quantity served is definitely more than I could eat at one sitting.  The price for the vegetarian version is about 15.00, while the beef version is about 1.00 extra.    Before this dish came to the table, there are side dishes (I believe we had 5) that are served per table, not per person.  Some included kimchee, potatoes, sweet potato something, noodles, and broccoli.  All were good.  I didn't think I would like kimchee, but I was pleasantly surprised.  And, you can ask for a refill on these side dishes, which we also did.  After dinner, they served us each a small cup of a persimmon drink.  It was quite tasty and tasted of cinnamon.    The space is pleasant, service efficient and courteous, and food plentiful and tasty while the price was fair but maybe slightly on the high side.  Some notes:  There were 7 of us seated at two tables pushed together.  Their policy appears to be one check per table (regardless of number in your party I'm not quite sure) and you get a ten percent discount if the table pays by cash.  There happens to be an ATM inside the restaurant.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "63yhYfjv3I6u3AoKhL0UcQ",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Bibim-Bop",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/63yhYfjv3I6u3AoKhL0UcQ/o.jpg"
      }
    ],
    "user_id": "GMKoemATfrXg1deaXxt2jA"
  },
  "sZrSU7iSMktuB1c0atjM8w": {
    "date": "5/20/2017",
    "text": "First time having Korean food here in Pittsburgh and it brought me back to my roots! Loved it all!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p3LqAv9vT8GSNIze1UBlwA",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p3LqAv9vT8GSNIze1UBlwA/o.jpg"
      }
    ],
    "user_id": "vPoPiH-ztEv-zcUJlVTYdg"
  },
  "kCNFkanj6KGBxR1FRp3PEA": {
    "date": "2/28/2019",
    "text": "Awesome traditional soups/stews.  Reasonable prices.  Pretty good KFC as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ScVOFbrtMikkBOfCKwsQA"
  },
  "HbTyWmY9Q4ez81oQkfKZ9Q": {
    "date": "8/29/2018",
    "text": "Taste good  Reason I only give 1 Star: Open too late. Only after (5pm). Closed 10pm, they would not accept any orders after 9pm. Closed Tuesday.  Business hours are awkward. Seem they don't need business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zq038oKEQz1_PKX03YF9dw"
  },
  "P5MMwssyzjPxxOCx1B5xyQ": {
    "date": "2/17/2017",
    "text": "I've never been a huge ethnic food eater, but I've been expanding into it slowly over the past couple years. The Green Pepper was my first Korean experience and I have to say I was very impressed. I tried the bibimbap, which I believe is a pretty common dish, and loved every bite. It definitely provided a different take on a friend egg with sauteed vegetables, and the spicy pepper paste allowed for a contrasting flavor of which I could not get enough.  The atmosphere seemed a little strange to me with the karaoke setup going, but from what I understand, karaoke is a relatively popular activity in Asian culture. They also had see-through glass tables which I can't recall ever seeing at a restaurant table before. Neither of these are complaints, obviously, but just aspects that set the scene of the location.  I'd love to eat here again, and when that time comes maybe I won't embarrass myself by trying to act like I know how to eat with chopsticks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bcWo9bfsBWxRuQcATphH6g",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Bibimbap. The first time was a charm.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bcWo9bfsBWxRuQcATphH6g/o.jpg"
      }
    ],
    "user_id": "1XAJ7iFmIcsiH8irvY5cRQ"
  },
  "LHtfnnfPI-fbeAWZxZSkEQ": {
    "date": "12/24/2017",
    "text": "Tasty! We got two appetizers for the table, the scallion pancake and kimchi pancake. Both were delish and generous portions. A couple of us got the bibimbap, which was an amazing mix of veggies, bulgogi, and flavor, especially with the hot sauce they give you. One of us had the short ribs, which were also quite tender and flavorful. Only odd thing was that they have Korean videos playing on a big screen, which was basically soft porn. But food was a winner! Caveat: I'm a white guy with little experience with authentic Korea food. I liked the food here, but couldn't tell you if it was authentic or not.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ha_vV_KICrv5NysLxBBwLA"
  },
  "UqSYe4ng_ZOl-M1vf0XB9A": {
    "date": "8/25/2018",
    "text": "The food is delicious yummy but the service is sucks ,Very disappointed",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YjqOTg5V0jWa3AF5Hg__cQ"
  },
  "rC3V_4FxQeiCILRn-B6_Cg": {
    "date": "12/1/2017",
    "text": "Pros:  The only Korean restaurant in the Squirrel Hill area.  Nice dining area, not romantic, but decent sit-in. Bibim-Bop (beef stone bowl) comes with a hot stone-bowl. Free starters and will be refilled.   Cons:  Expect $20 / person.  (I can't say it is expensive. It's average in this area for dinner out, but on the other side I do expect better) Foods are OK.  (I had better in town for cheaper price and better food.) \"D-J Stew\" Korean miso stew with seafood was rather small.  * VERY IMPORTANT.  THEIR WEBSITE SUCKS.  PLEASE UPDATE YOUR WEBSITE.  WE ARE NOT IN 1999.  OK-OK.   Pork Belly BBQ was good / OKOK.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YQvXj_PfSEw2bccbLNop-w"
  },
  "vAQJzluii_KW7Dof-Anfrg": {
    "date": "1/9/2018",
    "text": "Odd atmosphere. The bright tv playing K-pop videos on repeat did not help my appetite. The food is not bad, but it is slightly overpriced considering the average quality.   Service is adequate but not particularly friendly. Overall not a bad dining experience, but I wouldn't go out of my way to dine here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "duDYbWuTmgxzAh5gK0f6Tw"
  },
  "rFg7wbLqUg4O21TZgWp8gA": {
    "date": "5/31/2017",
    "text": "Today, I came for dinner with two others. When I walked in, no one attended to me or offered to seat me. Only when another party entered and asked me if I had been attended to first did the server offer to seat me. After being seated, I heard another table ask where their water is and why is no one asking for their orders. I noticed many waiters just standing around the register....  When we finally got to order, the waiter asked us if we wanted anything to drink, so we said hot tea. The waiter failed to tell us that tea was extra charge and came in single mugs instead of a tea pot. Is that not cheating customers out of their money or what?  Traditionally, Korean restaurants come with free side dishes, and our waiter did not bother to give us the side dishes until I had to personally ask.  I ordered the bulgogi, and the only redeeming factor is that it came with purple rice. The price of the dish is incredibly high for the quality and the over marinated sweetness of the meat.  While I wouldn't recommend anyone who is not from Pittsburgh to go to Green Pepper and would highly suggest going to your own local Korean place back home instead, Green Pepper is easily one of the more accessible Korean restaurants you can get to in Pittsburgh.... If you do choose to visit Green Pepper, I would be mindful that the service will not be good if not terrible and the price will be high, but the food will be decent.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "3bs5yS7O7262QcARGfGU8Q"
  },
  "JpGSIZIRcEyEpSOV2n6sgw": {
    "date": "6/3/2018",
    "text": "I came there at 9pm, but the worker told me they didn't serve food anymore, although it shows it's still open and the close time is 10pm. Really bad experience, will never come back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t3pxtvVnrLlAAs_eeM6ylQ"
  },
  "fvqTU12A_GT7ECPE8U8T1g": {
    "date": "11/21/2015",
    "text": "I have stopped by here a couple times for lunch, as I work in the area. I love their lunch specials. The size is large, they are less pricy compared to their dinner items, and takes really good.  Most of the lunch specials are accompanied with the 6 sides, from which the kimchi and the potatoes are my favorite. Usually a soup is provided too, a light miso soup with egg, and that is really good too. My favorite entree here is the vegetarian bibimbop which is given in a hot sizzling bowl. I recently got the \"spicy chick\" which was marinated chicken and stir fried in a really tasty spicy sauce.   The atmosphere is loung-ish, relaxed and have korean songs playing in the background. Definitely not a place to grab a quick lunch, but instead have a more relaxed one!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Fd9_CRGeC0ZdXE4z9WAAWQ",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Spicy chick with soup and rice! Soo good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Fd9_CRGeC0ZdXE4z9WAAWQ/o.jpg"
      }
    ],
    "user_id": "Zt8kRfpqdL7cULnAS2f5AQ"
  },
  "X2paNkxfTxrWZy5QRb4APg": {
    "date": "3/26/2017",
    "text": "My name is Hitt, I'm from Pittsburgh PA.  I do many things but one of the things I like to do is experience everything I humanly can from foods to places plus people and things.  Rather than write a long review and clutter the reviews with anymore long reviews (no knock, you guys are great) I'm just gonna get right to the point...  This place?   worth a try.  The bowl dish with purple rice, eat it. Bimbim maybe? Scallion pancakes, eat them! Clean environment, a huge plus. A little expensive but not really. Karaoke in the room over. Awesome K Pop on the TV.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 7
    },
    "photos": [],
    "user_id": "zUQVfRIwoDJb_-8qiWUNwA"
  },
  "Y6jk8rtY1tMS5UBpWicvbA": {
    "date": "11/7/2017",
    "text": "Good for the Korean Choice in Pittsburgh, but overall strange.  Food is very expensive for the dishes, dolsot bibimbop is tasty. Every time I go, I notice that the standards have been slipping. Service is okay, not very attentive. Free sides are only served sometimes. Strange atmosphere with K-pop videos on loop on the televisions.   When we went about a month ago, after we ate, my girlfriend was asked to wait upfront while i was in the restroom (presumably so they can reset the table ... even though the restaurant was mostly empty). When I came to find her, our waiter who just served us, tried to seat us again and then told me that the bathroom was for customers only. Strange that he didn't remember who he just served",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qeSXu-nC3c38p0ayuOmP5w"
  },
  "x8LYzgYQPttFxUHwZaJfTg": {
    "date": "9/27/2014",
    "text": "I was really craving dol-sot bibbimbap. and was told by a friend this is the only place that offers it in pittsburgh. Dol Sot Bibbimbap and regular bibbimbap are different - fyi. In terms of the interior: it looked really clean and modern. Not a whole lot of tables. I would say there were only around 8 tables. Some of them had sofa chairs instead of regular chairs.   On fridays, there's even karaoke offered but not sure how much it costs.   The side dishes were fine and they refilled them upon request. The dinner prices are really high for Korean food, but I'm biased since I grew up in LA where Korean food is much cheaper.   Overall, the dol sot bibimbap was really cleanly/nicely done. The rice wasn't burned on the bottom and the veggies were abundant. But for dinner it cost almost $18. That's really steep for dol-sot bibbimbap in my opinion.   I was really impressed that I came with my 16 month old daughter, and the server immediately brought out a Pororo bowl and small baby cup for her. It's also nice when a restaurant is able to cater to the little ones.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "amMgkX6ejpPyfJha3npD8g",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Super kid friendly.. The server brought out a little baby bowl and water cup.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/amMgkX6ejpPyfJha3npD8g/o.jpg"
      },
      {
        "img_id": "wU9bDIjtdCETsFal6X_RaQ",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Bibimbap for $10.28!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wU9bDIjtdCETsFal6X_RaQ/o.jpg"
      }
    ],
    "user_id": "yV4dun0_ALnZ6LQIsrCu_Q"
  },
  "zyt0L8my1yoyXoXxRPTetg": {
    "date": "7/25/2016",
    "text": "If you want a good laugh, read the introduction on their website.  It almost made me not want to eat there, but I'm glad I gave it a shot.     We did takeout after looking through the reviews since Korean karaoke didn't really appeal to us.  The two of us ordered a chive pancake, some spicy pork dumplings, and the bulgogi.  It was plenty of food.   The chive pancake came with a sauce that made it absolutely delicious.   I will say though that when I think of a chive, I think of the thin dainty length of mild green.  This was really more of a scallion pancake.   The spicy pork dumplings were made spicy with a sauce, so don't be afraid of them if you aren't into super-spicy.  This was the dish we could really take or leave - it was good, but I'd try something else next time.   The bulgogi was presented in a bento box with some rice and a few other bits of Korean goodies.  It was tender and flavorful - a winner.  Everything was packed well and ready within the allotted time.   We'd do it again for sure.     Now let's get back to the website, which I dare say could use a little work.  The description freaked me about a little because it sort of sounded like they wanted a medal for not poisoning people.  Here's a little excerpt: \"Some of the obvious secrets included unrelenting disposal of stale ingredients, constant procurement of the freshest and the best quality ingredients, and the customers' overall long-term health they chose in every decision.\"  Since when is the need to discard stale food a secret?  It should be a given...and if it isn't, I'd rather not know.  The long-term health part of that sentence initially read more like \"we keep our kitchen clean\" to me (probably not what they meant, but when combined with the comment about stale food, that's sort of where your mind goes).  The place looked clean, though, and I enjoyed the food, so I'm letting it go.  The boyfriend discounted it a star because the prices are on the high side.  The bill was almost $50 or something, which we consider to be a lot for takeout and a lot for two apps and an entree.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h9LPugJk2cpIh0gmQb5LnQ"
  },
  "e23HfCpQWmKJXl0ygrBuEQ": {
    "date": "9/3/2016",
    "text": "I've been to quite a few Korean joints in my time. Chicago, San Fran, Milwaukee, Pittsburgh, Madison... But this place! I'm from Milwaukee visiting family in Pittsburgh with my fiance and they suggest this place.... The Green Pepper.   Ooookaaayyyy.   Well we were fortunate enough to get in right before the rush with no reso. We had 8 of us, 3 of them kids. Waiters worst nightmare, right? Nope! Joel was fantastic! As was the rest of the staff. The food was amazing! I loaded pictures of the full table (5 entrees and a bunch of apps). And a picture of the table clear of food. We ate it all. I suggest a reso on weekend nights or you'll be standing around. Saw those people. But they know it's worth it!  Thanks you Green Pepper and Joel!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CUdFxS3CXNDMh_NaG6h6jQ",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Now it&amp;#39;s empty!!! Amazing!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CUdFxS3CXNDMh_NaG6h6jQ/o.jpg"
      },
      {
        "img_id": "8L8dy0uTx9NlnsAmztttJg",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Let&amp;#39;s load up the table with everything!!!! The next photo shows all these plates empty!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8L8dy0uTx9NlnsAmztttJg/o.jpg"
      }
    ],
    "user_id": "KdggS9BltRZYALvTviTJnw"
  },
  "1RT9XAFEeeW8UmI9A5E95A": {
    "date": "11/26/2016",
    "text": "Green Pepper is a decent korean joint. You'd expect it not to be that authentic but you'll be pleasantly surprised! Just don't set your expectations too high. :P They're reasonably priced for large portions. They serve a variety of korean food from soondoobu (korean tofu soup) to bibimbap to grilled mackerl & other assortments of meats.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "RndtjBHm41mIisU-oGeV1A"
  },
  "9SIYrELs0qps2nTwedkCVw": {
    "date": "1/26/2017",
    "text": "On a rainy or a depressive day, order yuk-gae-jang and your glum-ness will melt away.   Seriously though. Their soups were flavored quite well. Very well. As a Korean I was pretty content with their kimchi soup and yukgaejang (it's beef with bunch of other veggies inside - try it, it's a pretty common dish in Korea). The beef flanks were tender and the soup was spicy but not overwhelmingly so and a ton of veggies to balance out the soup and beef. Also the portion is pretty sizeable. Mega full after devouring it.   Also rice is good. It's the wild purple rice/white rice mixture!   Their kimchi seems like it's store-bought but can't have everything. The side dishes weren't plentiful in variety but each were flavored well and refills are limitless so.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "N-C_wj65eBowF1LziNIv3g"
  },
  "bo478ccLTFZ1p2wmYRZHOA": {
    "date": "2/3/2018",
    "text": "The food is good here. I love korean food so I go pretty often. It's a really calm and relaxing place to be in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3u8LVe44cT0RRta3bNXhww",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3u8LVe44cT0RRta3bNXhww/o.jpg"
      }
    ],
    "user_id": "Vr7T3u7qFzh3sf1lAxk-Yg"
  },
  "TbgAVmcrinroMz7Cy5CiCg": {
    "date": "9/1/2019",
    "text": "Very delicious! Goof service and fresh food! Excellent free sides before main food! satisfied experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_9SryyYihwVVIN7kb8sj4w"
  },
  "4hEYoCNpHdXcqNTr6otgww": {
    "date": "3/31/2019",
    "text": "This was the very first restaurant I visited in Pittsburgh before moving here and my god did it leave me disappointed. My wife and I ordered the seafood pancake, bibimbap, spicy pork bone stew, and soondubu and were astounded by how spicy their gochujang and gochugaru were. After even three bites we both broke out in sweats and we usually have pretty high spice tolerance. Also as many other reviewers have pointed out, aside from the spicy taste there wasn't much other taste to the dishes.  We came on a weekday so there weren't really many people in the restaurant so service was actually really good/fast when we were there. But for the prices being charged for these dishes, there are better options around other parts of Pittsburgh.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7MW4pEkiqRvSwWIj8XwCog"
  },
  "8by870rGwrDb7wY7nSfmtQ": {
    "date": "11/12/2018",
    "text": "The food here is delicious! Unfortunately my last visit was less than satisfactory. We had a 7pm reservation but were not seated until about 8pm. This was not totally the restaurant's fault - they told us that prior patrons at the table we were supposed to have lingered a long time after paying their check. Nevertheless I have to review based on my experience, and waiting in the entranceway for an hour was not ideal (it's on the restaurant to kick those people out or find us another table). The manager did give us a free entree as an apology, so that was nice!  Once we were seated, there were a few minor mishaps - my friend's glass was unclean and we were not given silverware. Still, we enjoyed all of the food. The vegetarian bibimbap is probably my favorite entree, and I loved the scallion pancake appetizer  It's worth it for the food but be prepared to wait, even with a reservation",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fqwjl-xJTnjVe-VKK-a72Q",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Lovely array of sides/starters",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fqwjl-xJTnjVe-VKK-a72Q/o.jpg"
      },
      {
        "img_id": "bgSRgUXZVLaydhX0MEYTwA",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Strews served piping hot and still bubbling!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bgSRgUXZVLaydhX0MEYTwA/o.jpg"
      }
    ],
    "user_id": "YhKdhoEhxD8A7ldxdhPPOw"
  },
  "CG2ULOq7gwpg_wxa7TnPRA": {
    "date": "2/18/2019",
    "text": "2.5 stars rounded up to 3 just because the food was fine, service was friendly, and everything else might have just been a fluke.  We came on a Monday night as a group of 5. Told the waiter we had a few more running late and he said it would be fine for them to just join our table when they arrived. We decided to get started and ordered our food. 3 bibimbap, a bulgogi, and a kimchi stew. A few people got the steamed dumpling and one ordered the pork fried dumplings. One person also got a cocktail.  After not too long, one of the steamed dumplings and fried dumplings came out, along with the side dishes. The menu specified that each entree came with rice and 3 side dishes, but since we were a big group, they brought just a few sides to start and said we could refill as we go. This made sense as having 15 tiny plates at once would definitely crowd the table.   The entrees started coming out, which we found odd as one person hadn't received their app or cocktail yet. Throughout this, we were also trying to get water & side dish refills, however it appeared there were only two people as waitstaff/host and we weren't able to flag anybody down, nor did anybody come to check on our table. We began to eat and after enough time had passed, one person felt that her bibimbap had been forgotten too, especially since it had been ~15 minutes since the other two bibimbaps had been served.     At this point, the last two in our party showed up and were directed to our table. After more attempts to flag down one of the staff, we finally got the attention of one. We explained that a drink, appetizer, and entree were never served, and that we had two more ready to add an order as we had explained at the beginning of the meal. He was very apologetic and immediately said they would remake the missing items and we would not be charged.   The missing drink and entree arrived pretty quickly, but unfortunately the dumplings that came out were the fried pork rather than the steamed vegetable. The person who ordered them doesn't eat pork, so we had to send those back too, and just asked for the steamed dumplings to go. The meals for the latecomers arrived without too much hassle, however by that point we were pretty disappointed with the amount of mistakes. There were also no side dishes that came with the final entrees, so rather than having 3 side dishes per meal as indicated, we ended up with about one per meal.   I don't know if any of us really thought too much about the quality of food at that point after all of the distraction, but the general consensus was that it was fine. The kimchi stew had good flavor although seemed not a great value for the price, and the bibimbap was filling and tasty. The bulgogi was surprisingly bland, but not bad. And the side dishes were just ok as well. I think based on other options in the area for Korean food, I won't be running back here anytime soon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MoFYvOoufOMyVTmUFAhRxQ"
  },
  "RsI6KT68pmKBslp4YDYDoQ": {
    "date": "1/2/2019",
    "text": "Man, I've been to many Korean restaurants in the USA and outside the US (in my beautiful motherland of S. Korea baby!!!), and Green Pepper is the classiest Korean restaurant I've been to (don't really know if this is a pro or con, but it was definitely interesting). The side dishes were yummy and the refills were free! The bibimpop was nice & LA galbi was very tender! Overall, the experience was nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SEZ4juyOYaoACAddTu0T1w",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Vegetarian bibimpop",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SEZ4juyOYaoACAddTu0T1w/o.jpg"
      },
      {
        "img_id": "OsbVf9h_hAIWY6oUPuAfdw",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Bibimpop and LA galbi and side dishes!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OsbVf9h_hAIWY6oUPuAfdw/o.jpg"
      }
    ],
    "user_id": "JKSb0GEs81uYb3rt91flcA"
  },
  "DgSz6yy6dhW-cUKdqJh4yg": {
    "date": "2/3/2019",
    "text": "Whenever I had a first-visit to a Korean restaurant, I'd try their Galbi steak. Green pepper has really good Galbi steak. However, I think the most impressive dish is the Korean fired chicken wings! It's crispy outside and juicy inside! (I like soy garlic sauce). I think the chicken wings are really authentic and even better than the Korean chains in other cities! Their side dishes are really good too and they can be refilled, which is very nice though we didn't have kimchi for the side dish. The overall experience was great, I definitely come visit again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kcS56MqO3F36Iv7zrtFz-g",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Side dish",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kcS56MqO3F36Iv7zrtFz-g/o.jpg"
      },
      {
        "img_id": "Aw8_yXRbHcSZpDAhuNt9vw",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Fried chicken wings with garlic soy sauce. Super good!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Aw8_yXRbHcSZpDAhuNt9vw/o.jpg"
      },
      {
        "img_id": "3DWBukrPaW4j4ZsP-WbsGw",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Galbi steak",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3DWBukrPaW4j4ZsP-WbsGw/o.jpg"
      }
    ],
    "user_id": "Bz9Hddcu2Hu0h3FArKfDGQ"
  },
  "XZggktnYAJpSl9x0yZODRQ": {
    "date": "4/5/2019",
    "text": "We visited Green Pepper with reservations for a large group of 15. We were seated in the back room which was perfect for both us and the other patrons. We started with a good mix of appetizers including lots of kimchi, chicken wings, chive pancake, and assorted dumplings. We enjoyed everything and particularly loved the chicken wings. I don't know what everyone had for dinner, but one had the mackerel and liked it. Another loved his the bibimbop. I had the spicy kimchi stew with pork. Of course, it was quite spicy and delicious. One friend had the pork belly BBQ and it was so tough she couldn't eat it and sent it back. Hers was the only complaint I heard.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "nDS68-Z9x21817kgKECNcQ"
  },
  "o2zdTM7zdxZGyCG5ocZmdA": {
    "date": "7/24/2018",
    "text": "This is a nice Korean restaurant on Murray. We went for dinner.   We decided to order the vegetarian bibimbap and the kimchi stew. The banchan isn't per person and is for the whole table, but you can get more after finishing at no cost.   I personally ordered the kimchi stew. Came out super hot, which was great. It comes with a side of rice, and even if the stew looks kind of small, there's a lot of soup in there. I wish there was more rice in comparison to the amount of soup. The soup was good, good amount of tofu but very little pork. Plenty of kimchi in the soup which was nice.   My friend who ordered the bibimbap said it was good, but a little too oily.   Overall, the food was good, but my main issue was the price. My soup was $16!! And the vegetarian bibimbap was also $16! I thought that was way too expensive for both of them, especially the bibimbap. I probably wouldn't come here again because it's so expensive and they give a reasonable amount of food, but not for the price of $16. If my entree is $16, I'm expecting a meal that is more more high quality or generous with portions and I didn't get that.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bM3jQXn7tpuz5d1lIUI5JQ",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Spicy Kimchi Stew",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bM3jQXn7tpuz5d1lIUI5JQ/o.jpg"
      }
    ],
    "user_id": "3EN4rQgpR8cR1NxuJNzi9Q"
  },
  "36ri1CSy6l21-J0k_ndIsg": {
    "date": "7/4/2019",
    "text": "Great Korean food. I take my friends here. They started charging $2 for kimchi, but I pay it. They have some free appetizers.  You'll enjoy it here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sAO6x5hzLjGbfNVc6VIV3Q"
  },
  "Fm8DFCTHirvv9KisaaKBDg": {
    "date": "1/18/2018",
    "text": "Slightly confused by this place, while I thoroughly enjoyed the K-pop playing on the TV, I could see why others would be turned off by it.   Our food was decent but I just didn't really find it THAT great. Like i won't be thinking about it for weeks.   Keep in mind that all the side dishes come cold. Which is probably customary, just not for me. We got Korean fried chicken wings, Bi Bim Bap, and the Korean short ribs. We got a decent amount of food for the price (at first I was nervous about the prices). Bi Bim Bap was probably my favorite of the 3, the ribs were grilled perfectly but lacked a flavor, and the chicken was breaded WAY TOO MUCH.   I'm always for new places so maybe I'll go back and try something completely unoriginal and out of the ordinary but I'm not sure, it just was ok.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nu4Q0HCyDMqNEISWSsHu7g",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Sides",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nu4Q0HCyDMqNEISWSsHu7g/o.jpg"
      },
      {
        "img_id": "y_b5UOHzQ4d3WBe_S7Z0Tw",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Bi Bim Bap",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y_b5UOHzQ4d3WBe_S7Z0Tw/o.jpg"
      },
      {
        "img_id": "qJtT10WBMauamdG0OOe7JQ",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Korean short ribs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qJtT10WBMauamdG0OOe7JQ/o.jpg"
      }
    ],
    "user_id": "tJiWkQtxSmr4UdfEp-EYHA"
  },
  "Gv3L8t_E2XWSlsrt9_KdDw": {
    "date": "2/15/2018",
    "text": "Location: Halfway down Murray. Park on Hobart Street to avoid the meters.  Parallel parking on Murray is a headache during busy hours.  Food: Korean fusion. Dumplings were perfect. Good portions. Food was mediocre for the price. Ps. they even the prices for taxes if it looks weird on the menu.  Ex. $.93= $1  Drink: Try the pear or white grape juice... spectacular. Refill....please....refill.  Service: Terrible the entire way. No direction of seating upon entering, not greeted, once seated slow approach to table with no introduction. Our server was the opposite of polite, snatched the menu out of my fiance's hand, did not explain any standard questions. Overheard our server telling the table beside us that their house cocktail tastes like water-downed vodka. They actually walked to the liquor store for wine only to come back and have to fight to get stemware.  Experience: I would never go back. That was some of the worst service I have ever experienced. Left 18% and will never recommend to anyone. Hire new staff, these guys are terrible. No table touch or follow up on food or a refill of drinks. We had to chase him down for our check. Without the juice, this place has nothing going for it.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "WqcLRN3fFAk0fI94xBnpCA"
  },
  "QP5T7aFOrTnpOWYZfzVdOg": {
    "date": "11/4/2018",
    "text": "I like the kimichi fried rice. It is delicious! However, I feel dish choices are too limited, and I highly recommend to hire more waiters/waitresses. I could tell they tried their best to bring their services as soon as possible to each table. However, I've been waiting for 15 mins to get my cup of water and one of them even spilt out the soup on our table and didn't wipe it! I don't blame for the person because it is clearly a shorthanded problem in this restaurant.  Please hire more waiters/waitresses",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wWT1e9ZwRI8bguucajvwXg",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wWT1e9ZwRI8bguucajvwXg/o.jpg"
      }
    ],
    "user_id": "ezrhKG8_BCpFqb5y7atY4A"
  },
  "JTO3wZduzj9D2z1hWI5zZQ": {
    "date": "5/19/2017",
    "text": "Coming from an area where there is a Korea-town nearby, I've been to some really nice Korean restaurants, and Green Pepper didn't even come close to the places I've been in the past.   To start off, the service is extremely slow. Despite the fact that there were two open tables when I talked into the restaurant, the waiter refused to sit me. When I insisted that they just sit us down for the third time, they simply put two white sheets of paper over the table and then went about their business. Seriously? Just sit down your customers next time, since your waiting area is literally just one small couch that is placed uncomfortably close to another dining table.  The waiter I had also had no idea what any of the dishes on the menu were. I get it that the menu is large, but you should probably know what Seafood pancake is if it's literally the most popular appetizer on the menu.   As for the food, I was not impressed. The Seafood Pancake appetizer looked ok, but was just not really flavored well. Everything was really bland, and the mixture was a bit messy. Also, there just wasn't enough seafood, so it ended up being a salad pancake with an occasional shrimp.   For the main course, the bulgogi, I was really disappointed. The meat was not even cut like bulgogi should be, which is thin slices. Instead, I received short noodle-like meat cuts that you would find at a Chinese place. The meat was also too sweet so it didn't really taste like Korean bbq.   What a disappointment.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zffis9SMQ2EnNXFAPymZRQ",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Bulgogi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Zffis9SMQ2EnNXFAPymZRQ/o.jpg"
      }
    ],
    "user_id": "RTTMsplbxNb61fujtFz23g"
  },
  "fLWkHDMsgpB2O4Eh0iiaTA": {
    "date": "4/13/2019",
    "text": "Very clean and professional looking dining area, staff is friendly and attentive. Very accommodating to Children providing them with nice cops lids and straws, I was very surprised when the waiter offered us kid silverware. The food we got was delicious as was the Iced Green Tea. Good job green pepper keep up the good work",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4sUpKeOVJdx4Bi3Z9YV80g",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Carlbee ribs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4sUpKeOVJdx4Bi3Z9YV80g/o.jpg"
      },
      {
        "img_id": "bRkIUO__90izshQsy3dJqg",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Delicious chive pancake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bRkIUO__90izshQsy3dJqg/o.jpg"
      },
      {
        "img_id": "6ISlDnpRtZSyIpPTNPdWRg",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States. Cute kid utensils",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6ISlDnpRtZSyIpPTNPdWRg/o.jpg"
      }
    ],
    "user_id": "1J6NZD-FU09VFMZLHT-acg"
  },
  "RWqlY3lfrmP_t8ZJExwLoQ": {
    "date": "3/4/2018",
    "text": "Korean food here is decent for Pittsburgh but very slow service as they have maybe 2 servers at any given time.  Checked in on yelp 30 min ago and we still haven't gotten any drinks.  We only come here because there aren't many better options for Korean food in Pittsburgh.  I've tried the soondoobu, fried chicken, and ddukbokki which were pretty good, albeit overpriced.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Rj1EXdbuetOG_-gBMA8pA"
  },
  "ByvQQgzmSa68bOmumpa5hg": {
    "date": "12/12/2017",
    "text": "I've been here once. The service is fine, but I found their dukbokki to be unappealing. The fish taste was way too strong and the dukbokkis themselves were rather thick. I was also underwhelmed by the soondubu here.   I recommend trying other Korean restaurants in Pittsburgh before coming here.   I may reconsider coming back to try their BBQ.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zdpn-MrLT_QPhwJ5-KHKCA"
  },
  "dSoO8Ip79mZm7rhBNUzJ2Q": {
    "date": "4/22/2017",
    "text": "I was here for dinner with my friends. Though it was a Friday night,  we found a table as soon as we arrived. We ordered sea food pancake, spicy chicken and kimchi fried rice for a party of 4 people.   In the sea food pancake, I could identify squid and shrimp. The pancake was crispy outside and soft inside. The quantity and quality is worth the price.   Spicy chicken with the rice they offer is delicious. I had the best experience when I ate it with the rice bowl they give. It is not too dry or not too watery. It has right consistency with amazing flavors.   Kimchi fried rice was good too, but it is too oily. I am not sure if I will order this again. Specially when we approached the base of the pan, I felt like I was eating rice with oil. Not a great feeling.   Overall, the food was good, and is worth another visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lv050wgjnXUdne8SipwyWg",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lv050wgjnXUdne8SipwyWg/o.jpg"
      }
    ],
    "user_id": "bmSuFvdMyF66PDUZr9VfoQ"
  },
  "Ml5YHYAi4l3_kxlUZqZM0g": {
    "date": "1/12/2019",
    "text": "Ordered the two most popular dishes. Soft tofu and Bibimbab. Rice for both were clumpy. Too much water when cooked. Also I wonder why the bibimbab was sweet as it was. We also werent served kimchi until we asked for it. Waaaay over priced probably because there arent many Korean restaurant competition. Worth a try if you havent had Korean food",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vWN3tXkgl7XwLiMOg85ZoA"
  },
  "-xHkI94tv_UO0daYTtMxvQ": {
    "date": "11/4/2018",
    "text": "The rating is mostly for service. We had a reservation and still waited an hour. Once we got our table we were ignored. We had to call the  server over many times during the course of the evening. I personally didn't like anything on the menu however the party I was with liked their meals. It was a bad experience. Yes",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Ycf-VA_zODVhh6U-eREvA"
  },
  "nv_pvGRcGoeK4s6KDkpQqA": {
    "date": "7/10/2018",
    "text": "Seafood pancake, always a must. The bull-go-ghee is also awesome. Have been there several times as my cheat day meal:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "8LEm276lIYX-pt0GGTQUNg"
  },
  "ipLdpA0V7Aen-r26dAQCYw": {
    "date": "1/11/2014",
    "text": "Great Korean barbeque! Complementary dessert tea made a great end to the meal. Good atmosphere, pretty good service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C7qxsQ2rDFQLYuBygXKsMg"
  },
  "RnnX5eiytn1PD_aMfX5bAw": {
    "date": "12/4/2013",
    "text": "If you've never tried Korean food, gotta check this place out.  Kimchi jigae is piping hot and delicious.  Tofu, pork, kimchi, broth, scallions... yum.  Side dishes are nice.  Sprouts, kimchi, potatoes... varies by the day.  Kpop on rotation on the flatscreen!  I spent a few years teaching ESL in Korea and this place always takes me back... check it out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OqweF5o8se1UcJ7YjBB7hQ"
  },
  "xpPcXMks__xBigRiRkUE7Q": {
    "date": "6/23/2011",
    "text": "I don't know whether or not to give this a 3.5 or a 4 because of how much the food costs. I would say yes, the food is pretty solid Korean food (for the area), but coming from California where there are Korean restaurants on every block, I'd have to say Green Pepper is only slightly above average. But yes, it is still pretty solid food.  My problem is that I feel like it's way overpriced and I would hesitate to go there again. Between my cousin and I, the bill came out to almost $50, which I would have to say is a bit ridiculous. I wish the prices were a bit lower because that would make me more willing to go again. However, I have to save my wallet from depleting quickly and will have to take a rain check on coming here again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rXoymJVtWZyBkx-gU7aVXw"
  },
  "NYTKHV7zKZ4f9PWhEMU3hQ": {
    "date": "5/12/2011",
    "text": "Pretty good for Pittsburgh-- was impressed overall. BUT way overpriced considering the portions! Not to mention, they serve the banchan in boonshikjip style, so it's part of your tray of food... which is smart on their part because you can't really ask for more banchan. A shame though because the banchan was really clean and good. My tofu jaeyook was also pretty good; I'll be ordering that again the next time.   I'd be more inclined to give them a 4-4.5 if they lowered the prices and allotted more banchan! (Yep, I'm a banchan whore.)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "g82R2_L85cOxE3ADIUdRpA"
  },
  "7qjmog2K-lo-hhmOfj6d5A": {
    "date": "5/3/2013",
    "text": "The ambiance of the place is modern and the food comes on large platters with other stuff like soup/rice/kimchi so it looks impressive. Now I would love to go there more often but the food is not something to rave about and the price seems quite high for Pittsburgh. Bottom line: go there only if you're really bored of anything else Sq Hill has to offer. The bibimbap is decent, the seafood soup is disappointing.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VwAhjZPN7zJuyG03P8mp_w"
  },
  "4ECLlGMHAHJb7p3NnRMYtg": {
    "date": "11/22/2010",
    "text": "Green Pepper is a casual Korean restaurant. That being said, the food is pretty simple but yummy, and the service is decent, but not great. The price point is just about right. This place could be compared to Oishii Bento in Oakland, not to Sushi Kim.   Over all, I really liked the place.  My biggest complaint about most Korean restaurants in Pittsburgh is the cheesy and shabby looking  interior. Unlike most other places, this place is very  neat, cute, and looks more like a cafe, not a traditional Korean restaurant.   I had Dolsot Bibimbop (mixed rice in a stone bowl) and it was really great. Highly recommend it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "50T7WqsrJbQAWMzBa68-7w"
  },
  "S4ozLF0rw2pFlW5YEhU1DA": {
    "date": "2/2/2011",
    "text": "AH so good. fresh fresh fresh. closest to koreatown in LA you can find here.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "l2wPVknbNJgGT7FrJ8PlAw",
        "caption": "Photo of Green Pepper - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l2wPVknbNJgGT7FrJ8PlAw/o.jpg"
      }
    ],
    "user_id": "Q0Bs5ObN4w2U5WHs2gLsPA"
  },
  "nHy1k1ET3LwURW15N_bLAw": {
    "date": "3/16/2011",
    "text": "Highlights:   Spicy pork: great flavor, tender, good sized portion Kalbi: tender, perfect amount of char, tasty marinade  Shortcomings:  Prices somewhat high for Pittsburgh You don't get to grill the meat yourself Only 3 banchan per entree Sloooooow service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SmabICOC4cQaIzy4sQAVXQ"
  },
  "ArntAMywkuuyUIdoyNA9ag": {
    "date": "6/8/2011",
    "text": "Best Korean in Pittsburgh - just a tad pricey for the food and service levels.  (My guess is that they're trying to recover their capital investment with high prices, but they ignored elasticity of demand, so they pushed volume down, and, thus, the place stays relatively empty.)  Our waitress was very attentive but not particularly friendly (not unfriendly, either), and we went in late.  Despite closing at 10, we didn't leave until 10:15, but I had no impression that they were pushing us out like other places do around closing time.  (Which I appreciated, but I also felt a little guilty.)  My friend and I both had bi bim bap.  Mine was the best (or close to it) that I've ever had.  The ban chan (little cold side dishes) were excellent, too, but they were maybe just a little light on them.  I'm usually sated with 4-5 dishes per diner, but Green Pepper only did 3 per diner.  (Not a huge deal - they were very good.)  Overall, I'm really divided.  4.5 stars, but I'm going to be a bit more critical given the prices.  (I'll reconsider after a second visit.)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0N9bSCmoJMoGmR0EldzjQg"
  },
  "9C3dO04oKcOs8NxFF-AlQQ": {
    "date": "2/13/2011",
    "text": "Came here hearing that this place was finally a good Korean Restaurant around Pittsburgh!   I ordered the kimchijiggae and it was really a taste of home, not quite, but better than what I can ask for at other places in terms of \"koreanness\". I've seen other reviews on this place and I have to agree on one thing. The price of the BBQ is low, and the price of other things are high. For example, Korean BBQ/bulgogi is about $21/$19 respectively. The kimchijiggae and bibimbap are around $13 or $15.   A bit sad when I didn't get a bunch of side dishes (banchan) that you get at \"real\" Korean restaurants (you get only 3 with your meal) but the food was overall good. Tried my friends bibimbap and it tasted like it should, which is very good in Pittsburgh. No offense.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JkEnhnAX_t5ERz_I1H55Fg"
  },
  "bhx0mKN4ixG_uZYGu1MEQw": {
    "date": "8/15/2013",
    "text": "Food is good, but very pricey. I ordered a suhlungtang and paid $13 for it which is way too expensive...but I understand...it's Pittsburgh. Anyway, I don't doubt that the food is delicious so 4 stars!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ft0-KUGvYJOD-jXgQFypHA"
  },
  "dOeoLidz6AVjL_9ruWGShQ": {
    "date": "5/2/2013",
    "text": "Giving another Korean joint in the 'Burgh a try.  As you may have noticed the better half and I seek out the Korean places.  She is Korean and I spent time there.  We often hunger for someone else to cook us some dishes of her native soil.  We heard good things about Green Pepper in Squirrel Hill and figured we owed it a shot.  The place has a weird layout.  Very straight forward and bordering on cafeteria.  The giant flat screen plays Korean music videos which is neat I guess.  The service was pretty bad....some college aged kids that just gossip with each other and need beckoned to the tables for anything.  I resorted to going up and paying and the kid said, \"I will come to your table.\"  \"Well, you weren't, so I came to you.\"  The rules on the menu are ridiculous which leads me to believe the place is run by an insane person.  10% gratuity is included on your bill, so don't tip 15%, tip 5-10. Now, the food. We got miso soup (meh) and Bossam.  The bossam was really good and may get us to go back.  It could have used more sides, especially considering lettuce, peppers, and carrots are so cheap.  The meat was cooked perfectly and they left the skin on which is just delicious.  I enjoyed their kimchi and so did the wife.  I'd like to try other things, but the place is pricey.   My advice to Green Pepper -- work on your servers, rules, and ambiance, then raise your prices.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E8w6O_CXuluNeo4K1JMIbQ"
  },
  "Nh_MPztaHuAztYZ2HevnBg": {
    "date": "4/2/2015",
    "text": "It is usually a great restaurant. However lately its service level dropped significantly. We waited forever to get our meal. The waiter was really shy and hesitated to serve us.  I have been a pretty loyal customer but tonight we almost starved to death... Not sure when we will b back, if ever...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2USKw35pPJvAxBQngXQkPg"
  },
  "mBs57OS1Gw6VxBNNuvr2oQ": {
    "date": "6/23/2011",
    "text": "Green Pepper offers a nice variety of dishes: each dish comes with 1 ~ 3 side dishes and an after meal sweet soup.  If you enjoy  variety, such as a bento-style meal, Green Pepper offers a break in the monotony.  Portions are OK, id say justified with all the different side dishes you get.  I do not have much basis in comparing Korean food, but I had a pleasant experience with their Bibimbop, cold noodles and their bulgogi - even though I am usually incapable of digesting spicy foods... (they offer some non-spicy alternatives as well)  Service is fine.  Cordial, acceptable waiting time, frequent water rounds.  Price is indeed high, even considering all the positive aspects.  I would recommend others to try it out and decide if the price is worth paying...  The food here seemed more approachable than Korea Garten over at Pitt.  Maybe its Americanized, but good for me!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Q96J2WhklEkdg3uQm1aMg"
  },
  "9hGmWAqdM8s95JVvqMLVjA": {
    "date": "10/17/2015",
    "text": "Galbi and soondubu are amazing. Also, the breaded fried pork cutlet is awesome and it's a massive serving. My parents are both Korean and love the food. I've eaten home cooked Korean food all my life made by my mother, aunt, other aunt, other other aunt who comes to visit from Korea, brother, grandma, other grandma, granny from church, and friend's mom (all Korean, obviously). I've had experience eating various personal styles of Korean food, and I really love the food here. I find it True to authenticity and flavor. Definitely recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fhd_AAQB1AGNs7CwtDHdGA"
  },
  "D8LbF_x0veFSUl3EI1B3Fw": {
    "date": "2/1/2015",
    "text": "Green Pepper is one of my favorite Korean restaurants in Pittsburgh. The food is always consistent, the portions are big, the quality of the food is good, and I leave the restaurant satisfied 100% of the time. My favorite dishes are the spicy pork, spicy chicken, Sul Lung Tang, and the mackerel. I'm a huge fan!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NNUde28sG2YWVaBhPod2_w"
  },
  "fyNG1eDaiuMYXg5ktXXwhQ": {
    "date": "10/9/2015",
    "text": "I have visited this restaurant several times in the past with overall good experiences.  However, my recent visit was quite disappointing.  I made a small request, the same request was easily met during previous visits, due to a health issue.  Unfortunately, my request was disregarded and I was unable to eat my meal.  In addition, the service was poor (inattentive, unknowledgeable).  I will be looking for replacement korean places soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B1PLuGhu7cvQOkhdFzmokg"
  },
  "VwEdDP7l9bx3fiQASvsC6g": {
    "date": "1/18/2015",
    "text": "This is my favorite Korean restaurant in Pittsburgh. Great tasty food and atmosphere! The owner has a high standard in keeping the restaurant clean and providing good service. Their food tastes like home-cooked meals with natural ingredients without chemical condiments such as MSG. I like everything in their menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kUxuGiQss-FO8nAZO79-6Q"
  },
  "jVc8F6kPtnyAowHVZLM48A": {
    "date": "12/17/2012",
    "text": "The best Korean I've had in Pittsburgh so far.  I had the bi bim bap which was great.  My friends had the kim chi stew and the octopus bul go gi, which I also tasted and both were delicious.  I especially liked the octopus bul go gi which had tender spicy pieces of octopus and flavorful seaweed topping, and that is not a common dish I see in other Korean restaurants.  Overall I was impressed with the menu which had a diversity of options, some of which I was unfamiliar with. I was a little disappointed in the Korean side dishes, which we each got 3 side dishes of the same thing, and they were not very interesting ones and all vegetables (I think it was kim chi, bean sprouts and broccoli).  If we are going to get 9 in total why not bring out 9 distinct ones to share?  We also tried to check out the karaoke since it was a Friday night but unfortunately we were informed a group had already reserved the entire karaoke area for the whole evening.  The atmosphere was nice and relaxing and the servers were very friendly.  And they had a few interesting beers on draft. I'll definitely go back here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3bo1FXvQnxw2hmO0CHH4Nw"
  },
  "3cZx2TweoKidtcCBOmehlA": {
    "date": "5/2/2015",
    "text": "Lovely. Attentive servers, delicious vegetarian bibimbap, octopus, and kimchi. Comfortable interior (tables with couch seating are available).  Discount on the bill if you pay in cash. Will absolutely go again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_wIdLdtFlv83rxyws035OQ"
  },
  "rOgnW0tvdB4qqcuN8dpi2Q": {
    "date": "3/31/2014",
    "text": "This place was delicious!! I honestly can't remember what I got since basically my Korean friends helped and ordered for us. We sat on this super comfortable couch in the back. The service was a little slow, but the ambiance and food was just amazing. I'll be back again for sure and hopefully I'll know what to order.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "d6JltKIeAbPj415bwSm7eA"
  },
  "LKf8SPMhZPVYPhFODOUdnw": {
    "date": "8/1/2015",
    "text": "The best restaurant in Pittsburgh so far. It is a bit pricey but it is worth every penny!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lg9vVhVaPnfeorVMNSdDaQ"
  },
  "yxLawLDMTfBrs1u9jNk8kA": {
    "date": "3/28/2013",
    "text": "I came here with my boyfriend on a Sunday night and it was empty except for one other couple.   I decided on the dolsot bibimbap. I was pleasantly surprised to find some unique toppings such as egg resembling tamago and the gelatin cubes that are given as banchan among the typical spinach, fried egg and beef. Their homemade bibimbap sauce was great. The meal came with a bowl of miso soup, kimchee and bean sprouts.   My boyfriend decided on the spicy bulgogi which he really enjoyed. His meal came with the soup and sides that mines did plus a small portion of cold japchae.  Each meal was about $16, which I thought was fair for the amount and quality of food that we got.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g7S7fGfZC9ow_wIsK848MA"
  },
  "pSV2mvm2y3brj-9wfdGo8A": {
    "date": "11/14/2014",
    "text": "We just got back from seoul two months ago, this food was wonderful and was a great value for lunch. I had the bibim-bop and my husband had the dumpling soup, both were delish! We had home made persimmon tea after the meal which was fabulous. Love the byob policy and soju on the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qa01179kwR_8RPMZAIoPkw"
  },
  "3rXLkv5VhEGRLyai_AzgzQ": {
    "date": "4/1/2013",
    "text": "I love Korean food & music. Their Kimchi jjigae was good but I wasn't feeling their chicken dubogi. I love that they play Korean music though.   Btw while you are eating the waiter come by and spray disinfectant stuff at the table near by and the smell is horrible.. & whole you're eating too ugh. But anyways.. It's an okay place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MDMnWk5tEzZuZEFQfJFrKg"
  },
  "8hN3I-eW-z0k-RJdAxFYug": {
    "date": "3/12/2012",
    "text": "Meh - somewhere between 2 and 3 stars.   The two rooms are very nice: lot of space between tables, nice distribution of the tables in the rooms, pleasant, warm colors.  The food is, sadly, quite bland, way too bland for the price. The spicy squids (~$14) were not very tasty, but they were very chewy: Good work out for your jaws. The sauce was fairly generic, not very spicy (2 stars). The bibim bap (~16) is perfectly eatable (that's the 3 stars), but that dish is more comfort food than anything else. Surely not worth the price.  Question: why is it that Squirrel Hill does not have any high-end restaurant, but tons of mediocre (although not always horrible) places?",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "LMl9Z43ZVPh5wrz4LeYd6Q"
  },
  "f7xkpy3mCXnJRe0xYtyCtQ": {
    "date": "7/26/2014",
    "text": "My boyfriend and I found this place by accident on road trip. We both love Korean food and I consider myself a Korean snob and this place was awesome! Great service, amazing flavors, and also they serve this little cinnamon pallet cleanser at the end of the meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "g-AfNHw4PatnrLdvvjp-uw"
  },
  "XTaVB5KAd9m4KgbWDcG3Bg": {
    "date": "5/14/2013",
    "text": "There were ups and downs on my week night visit.   Good - the food. I had soon dubu jjigae, and it was fiery, creamy, and delicious. The BF had bulgogi and said it was fine - really high praise for Korean from him. Both though it was good enough to go back. (The only thing I can complain about is my egg. I thought it was missing until I found it at the bottom, cooked through, solid, and half burnt to the side of my crock.)  Bad - banchan. Actually, lack of them. Instead of serving an assortment of side dishes, each order came with three little ones. Each of us got tofu and kimchi, I got steamed broccoli and he had cold noodles. Banchan are a big part of why I love Korean food, so this disappointed me.  Good - Korean pop music and videos.  Bad - Service. Our guy tried, but he didn't know the menu, was a little too hands off, and the dining room was a mess. One table left shortly after we ordered, and none of their dishes were cleared away when we left.    Good - Shoju. Hello, it makes everything better!   Bad - pricing. I'll be back for lunch, its more reasonable. If they weren't stingy with the banchan I would happily pay their prices, but the experience doesn't quite live up to the expectation I had.  I liked it, I'll go back, but it's more because its the closest spot for a K fix, not because they amazed me. I love all the different jjigaes, so when I'm off I know what I'm getting for lunch!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2dTQmS9iUhzdvhSElbkOOQ"
  },
  "8S4H6EBnxX-XVxV_u8m8pw": {
    "date": "7/20/2014",
    "text": "One needs to be very careful as to what to order. Bad choices will lead to unsatisfactory experience that is not worth the price. Recommend pancake and bibimbap. Also tried spicy beef and dumplings stew, not good. They do good on free stuff. But as for the entree, Pittsburgh has much better Korean restaurant one can go to.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DFQmDSSmyW5pSBBYgzp5AQ"
  },
  "XNANEg8yvYnga2f9FNO7YA": {
    "date": "5/29/2016",
    "text": "The pork is terribly smelly. The food is awful. I think the meat we have has gone bad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FrDkpW8czup-6c5kGSZ38A"
  },
  "nYMFrpy24vOEGDJC0NYeUA": {
    "date": "8/31/2011",
    "text": "When I come here, I swear I sometimes see a little old Korean grandma in the back, cooking everything.  That's kind of awesome.  Also awesome?  The fact that they have a karaoke bar.  That you can rent out for your friends.  Wow - Pittsburgh really HAS come along!  Food here is on the pricey side, but is really good.  The kalbi definitely satisfies my cravings, but at 20+ is kind of a splurge.  We normally get the bulgolgi when we're not feeling up to spending that much.  I do miss all the little kimchi dishes - here, they serve everything up in bento boxes.  So, it's not quite like what you'd expect from Korean places in either New York or San Fran, but given the paucity of Korean places in Pittsburgh, I'm not going to grumble too much.  Like Dennis L., I'm not  going to say I love this place, but given the circumstances, it's solid.  If you're really craving the Korean BBQ experience, my understanding is that Korean Palace in Oakland is the way to go.  I haven't been there in years, since I refuse to deal with the parking situation in Oakland, but hey, when you want Korean food, sometimes you just gotta suck it up.  In the meantime, Green Pepper might be enough to keep you from having to go off the deep end.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "ckMFtaljrmXWaSiQqk9ZWA"
  },
  "fIWdKEVeZKPXUEive6_ueQ": {
    "date": "3/3/2014",
    "text": "I've only been here once, but everything was excellent. Everything was cooking perfectly. Authentic. And the service was delightful. I look forward to visiting again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "B8TSv4yeHNiKyhXueBiiCw"
  },
  "S7UM8ynRIXiehQHg7Mo3-g": {
    "date": "1/25/2014",
    "text": "Great atmosphere and service. I have gone here twice with my family and have always had great service and great food. The meals are on the higher price end but the quantity and quality are definitely worth it. And when you go to a restaurant like this, money shouldn't be something to be surprised about/a complaint because you're going to a high end restaurant with excellent cuisine, not a chain restaurant. Definitely recommend going here for a quality filling meal. You'll definitely go home with leftovers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vrB2Ae6-fX0ZRBx7HBIskQ"
  },
  "F8mcKy8O036mrgRzq_W3kQ": {
    "date": "3/19/2017",
    "text": "I still have yet to find a good Korean restaurant in Pittsburgh. The strange decor of Green Pepper left me uneasy right as I walked in. The restaurant was plain, monotonous, and dimly lit - 3 things I'm not a fan of. To make matters worse, my friends and I were seated in some huge, old sofas which were extremely unconventional and felt out of place. Upon receiving the menu, I couldn't help but notice how expensive all the food was. The prices were absolutely absurd and they also charge for extra rice. *side note, the first bowl of rice we were given was half full. When we asked for another, they gave us a full bowl (strange?). And with regards to the food quality, it was mediocre. My kimchi fried rice, although overpriced, did taste pretty good but definitely wasn't anything special. My friend's meals were worse than mine in terms of both presentation and taste, but still edible. If you're looking for better priced and decent Korean food, go to Nak Won Garden.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hHbh_9wBg-0Dwn_-3aTfoQ"
  },
  "OwBJJeLZAMasOh-RUuPMmw": {
    "date": "3/5/2014",
    "text": "Well, I am not a fan of Korean food typically.  My fiance loves it. So we tried Green Pepper.  We went on a Saturday and it was pretty crowded but only had to wait about 15 minutes for a table.   I ordered the Veggie Bibim Bop.  I was actually pretty surprised that I liked it. Fried egg was perfect, the veggies were all steamed and sauce they bring you is delicious,  The service was great! The young lady who helped us was super friendly and very prompt with drinks and food.  I was very happy we tried it and would go back for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qQRmnbKI84Up4a2MBFfaFg"
  },
  "Dij0zsLSF2KfV5EzKG1rhw": {
    "date": "3/14/2011",
    "text": "Don't blink as you're going down Murray Ave, or you'll miss Green Pepper if you aren't familiar with the location.   The space is clean, and has a bistro feeling to it. The lime green walls brought back those Linda Blair in The Exorcist, and yummy split pea soup memories.  I looked over the menu, and noticed no Yaki Mandu (fried dumplings). We settled for the steamed beef mandu as an appetizer, which were the savory option. Ground beef, sweet potato noodles, and green onions made up the mandu stuffing.   My daughter loved the presentation of the dishes on lacquer trays, and compartmentalized boxes. I had the Bi Bim Bap, and it did not disappoint. It was full of fresh vegetables, shitake mushrooms, bean sprouts, and one of my favorite parts, the fried egg. The miso soup was bland, but did not go to waste. The kimchi was fresh, not salted or spicy enough for me. The Bulgogi was sweeter than what I'm used too, but the others with me liked it. My daughter liked the pork bulgogi, spicy kick, and not sweet. The portion of jop chae was good, I didn't see an entree of jop chae on the menu, so I wonder if they rotate their menu. The persimmon cinnamon punch was nice, cold, and sweet. A dessert offering, and one of my favorite Korean drinks.  The waiter was friendly, but inexperienced, and slow. He had the K Pop playing, which my daughter appreciated. Will go back when I'm in the area for something different.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "kKCWp4tDw76Q546wXwWuTg"
  },
  "H2jOVgGr-vuTZzliwy07sg": {
    "date": "7/14/2014",
    "text": "This place is so good! I feel like I am getting authentic Korean food. I like their pork bone noodle soup and their meat dishes... One side note is that the portions are not huge and they are a little on the pricey side... But at least the quality is good. I like the decor too. The pillows are very puffy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b-7RP6jNrcnA9N_Xm6Tk-Q"
  },
  "eBgp22qtMrVO9Csg8SHXBA": {
    "date": "9/15/2014",
    "text": "This place was crazy. We thought at first that the staff must be a bunch of college students that just started working a week ago, but after reading the other reviews, I'm not sure this is True! I think one major issue is that there is team service and thus no one individual waiter was responsible for our table.   There was one waiter (blond, short) who seemed to be in charge. He spent most of our visit appearing baffled. I watched him at the register station trying to write up bills and use the register. Comical. It took 15 minutes for them to visit our table after we were seated. After that the food came out at a nice pace - first some appetizer type things, then the steamed dumpling appetizer we ordered, and our entrees.   The food was fine. I am not a Korean food connoisseur, so I can't really comment on how authentic or good it is - to our American palates, it was just ok. Also seemingly expensive, but the portions were large.   Once we were done eating, we started waiting. We waited, and waited and waited. The servers ignored us, and noodled around - they never actually look at the diners so it was super difficult to get anyone's attention. Finally we called a skinny waiter over, and asked for two simple things: 1) the check (which seemed to please him) and 2) take out boxes (which caused him to furrow his brow and look slightly angry). OK.   So this guy then continues doing random crap as if we had never asked for anything. 5-10 minutes go by while he walks back and forth to the kitchen, empty handed, and refilling water glasses (I must say, they were excellent with water service). It was as if we had never spoken to him. Finally we call the short blond waiter over and ask for 1) the check and 2) boxes. He says, oh, of course. He asks the skinny guy to get us boxes. Skinny guy rolls his eyes and says \"yeah, yeah, yeah\". Skinny guy proceeds to do other things for another 10 minutes before finally procuring two take out containers from the depths of Squirrel Hill.   Now for the check. We waited and waited some more. Blond, short waiter looks confused but decides he needs something to do. He walks around asking how everyone's food is. He takes orders from other tables. Finally, we ask, can we *please* for the love of everything that is holy have our check? He replied incredulously, \"Oh! You haven't gotten your check yet?!?!?!?\" So if he didn't get our check, who would have gotten it? He is the check guy! OMG I didn't even know what to think.   Needless to say, we paid in cash to save the pain of waiting our credit card to be run. And then we ran out of the restaurant. Please go to the Green Pepper only if 1) You truly love Korean food or 2) You are writing an expose on baffled waiters. Hahaha, I'm glad I went just for the memory.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x_1zRzYpLtU01h-bxZtqBw"
  },
  "OBP9cDFoPmC_i8WCurtnUQ": {
    "date": "9/13/2014",
    "text": "Really enjoyed the atmosphere, the Bibimbop, the assortment of pickles they brought out, and the kimchi dumplings.  Thought the Bibimbop was a great deal for two.  When they brought out all the small bites I felt like I was at someone's Mom's house and she just brought me out a ton of stuff to try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_0TKEDIcuWW5Y4BHo1t24g"
  },
  "NUBJr7gKtvAdocdbZUKmhw": {
    "date": "5/9/2011",
    "text": "We tried Green Pepper last week as our first taste of Korean food, and we were really happy with it.  We had kind of been putting off trying it for awhile, as it is the restaurant to replace our beloved Sweet Basil, but I'm so glad we finally checked it out!  First of all, they have a small wine list, but you can also BYOB for a $7.50 corking fee.  I think this is the first Pittsburgh place we've seen that has both a wine list and a BYOB option, so we liked that.  Our waitress was really helpful and informative.  I had a few questions about the menu, and she was really great with taking the time to answer each one.  She explained to us that the type of spice used in Korean cooking can sometimes feel spicier than it really is, because even the milder versions sometimes make you feel like your nose will run.  It was nice to have a heads-up about that (and the menu also lists if items are spicy or not).  We started with an order of the pork and kimchi steamed dumplings, which we really loved.  These were just perfectly done all around.  We each tried something different for our entrees.  All of the entrees (except the stews) come with miso soup, which is basically my favorite thing right now, so I really appreciated that.  Their miso is very basic, no tofu in it or anything, but super yummy.  The soup was served alongside our meals, which came in a fancy TV-dinner-like plate, with the little dividers for different menu items.  I got the spicy pork, which was sooo good.  It was quite oniony, but the sauce was not overly heavy.  With the pork, you also get kimchi (think cold holobchi stuffed cabbage in terms of flavor), cold cellophane noodles, tempura-breaded zucchini, and steamed white rice.  The portions were sizeable but not huge, so I only had a little bit to take home with me.  My husband got the bibim bap, which can be served vegetarian or with ground beef.  He got the ground beef version, which comes in a pot with a variety of veggies and egg on top, and is served with kimchi, bean sprouts, and rice on the side.  Everything was quite hot, although not too spicy, and he was really pleased with the flavor.   Green Pepper doesn't offer any real desserts, but you get a cold cinammon tea with your meal in place of that.  We loved the atmosphere as well, very bright and welcoming.  After they close, you can apparently rent out their 'karaoke lounge' for parties (and during business hours, large groups can sit there).  The prices were a little higher than other restaurants in the same area, but they put a big emphasis on the healthy components of their meals, so it's worth it.  I also give them points for their super cool silverware, including metallic reusable chopsticks.  The presentation of the meals was just lovely!  We went on a Saturday night, and it does appear to get crowded at times.  Fortunately, we had a short wait, but I would recommend going early if you stop in on the weekend.  Even if you have to wait a bit, the quality of the food is well worth it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "r98FaAOAoJDCPp384XpcYA"
  }
}