{
  "LaF06LcK7qvAcP1S7uOL3w": {
    "date": "9/4/2015",
    "text": "Excellent food. Definitely the exact same as sesame Inn in Mt Lebanon and upper st clair though",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iEZHFtv4DTAZxUxluMj8yQ"
  },
  "SREr8rRDNr2ohIQK8qBs0g": {
    "date": "12/26/2016",
    "text": "Eh....it's ok...everything kind of tastes the same. Lemon chicken is good but it's all pretty bland...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ii49O95HWZYXK3jWtfjvQ"
  },
  "RLhctSSleNrxXku_NBRqVg": {
    "date": "10/2/2015",
    "text": "Probably the most underrated Chinese food in the city. Every bit as good as sesame inn if not better. Great for pick up or delivery but we usually eat in. Clean comfortable atmosphere with plenty of seating. Service has always been extremely quick and friendly.  Good quality, great portions and fair prices. The won ton soup is solid and my go to dish is the Hunan beer.  Plenty of fresh veggies and the right amount of spice. My wife likes to get the veggie lo mein and orange shrimp which is full of flavor. Only complaint was that they brought the boxes to is at the table instead of boxing the left overs for us in the back but that only happened once. Overall this is definitely our go to place from now on. So glad they're here on the Mount!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7okR0yid_j4R7ZZvJ3B9Og"
  },
  "Aqh-NPw_jJY852qSwFODrw": {
    "date": "4/25/2015",
    "text": "Our party of 9 came here in a bit of a hurry because our reservation plans at Shiloh Grill fell through and we needed to catch our boat ride on the Gateway Clipper. This place was just perfect! They served us quickly and the food was delicious and fresh! Wonderful service. Would totally go here again! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9dne_Dwg8KrasW4UUkFn9Q"
  },
  "1TOzSj57VenfRuJt2o6_bg": {
    "date": "1/31/2015",
    "text": "Got the chicken and broccoli with won ton soup, sooooo good!! Will be coming back a lot since I live in Mt Washington. Very nice staff and fast service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XPET43oRHEQ7MVotkHWDdQ"
  },
  "dD0Vc21Y3pEVCmOi27NOHA": {
    "date": "12/24/2015",
    "text": "I guess I didn't have a typical experience compared to the rest of the reviews on here.  It is a little expensive, but the portions are huge.  My friend got Pad Thai that was so sour it was inedible.  When we told the server, she went to the kitchen, came back out and said that's how it was supposed to taste.  We repeated it was too sour but didn't order a replacement since they thought it was US that didn't understand how Pad Thai was supposed to taste.  At that point, we didn't feel like we could trust whatever the cook would send back out.  I have no reason to believe they would add any special sauce to a replacement (hopefully edible) entree, but being challenged at the complaint didn't offer peace of mind.   Since the portions are so big, we split the other order (Happy Family) and it was plenty.  Left the Pad Thai on the table.  At checkout, they gave 10% off which I just laughed at.  I can accept the mistake... just too much vinegar, but the 10% off was a joke.  They should have taken the inedible food back, done it right, and not questioned it.  They made us feel like the problem was us... not their food.  The chicken didn't taste fresh in the Happy Family, but the broccoli was fine.  They don't have a liquor license.  No reason for me to ever return.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zeSxwAyoMqT3quYkYLVsuA"
  },
  "qWWMt4Z-4AC6e-KUFgeRCQ": {
    "date": "8/20/2016",
    "text": "This place is the worst! The service is great, it's quick and all... But I'm dying for GOOD Chinese delivery and it's nowhere to be found on Mount Washington. The chicken dishes are soggy and so so chewy. Not crunchy.. The flavor tastes off...makes you question how old the ingredients are. The rice is dry. Someone please open a good Chinese delivery spot by Mount Washington!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZPALlEzYyFRdjj491D1Nrg"
  },
  "lnJ-rKAhafhKYEeDOSTt7w": {
    "date": "6/20/2015",
    "text": "I love this place! I moved to Mt Washington 15 years ago and ate at the Chinese restaurant that was previously in this location, and even though I'm not a fussy eater, it was so bad I never ate there again.   In stark contrast, the food here is wonderful. I think it is somewhat expensive with average size portions (for the price) but even with that I give it a five. I mostly pick up or get delivery and have eaten in once. Service is always fast and very friendly. The restaurant is lovely with clean bathrooms.   As to the food: my go-to favorite is eggplant with garlic sauce with chicken or shrimp. With shrimp is my preference. I like the barbecue spare ribs with bones as an appetizer. I've had several other dishes and liked them all. Although I usually get in a rut with favorite restaurants, every time I order here I usually get a known favorite and try a new dish. I probably get food here once a week, enough for several meals. I like that they have a few Thai dishes on their menu. I hope they are very successful and on the Mount for years to come!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PO6VYNxglBieDj9F3iWm3g"
  },
  "8Qf0tr1cN-M0OwrbQKhZhg": {
    "date": "5/12/2015",
    "text": "The former spot had too much negative press to try so I steered clear of this place until I drove by, noticed it looked different and read the current reviews under the new ownership. A legit Chinese restaurant on the Mount? Well, I just had to investigate.  I took a look at the menu online and we ended up ordering lunch specials which were shrimp lo mein and the double delight (chicken and shrimp). It came with the normal options of soup or egg roll. We tried each and weren't disappointed. The eggroll was light and flaky and packed full of crispy veggies and the normal pork. The soup broth was also light yet flavorful. The entrees were very good. Enough to make me think twice before heading off the Mount for Chinese. I really can't wait to try some more from their menu.   Lastly, I must mention that the interior of this place looks great. It looks fresh and made we want to come back to dine in. The person who took my order and waited on me when I arrived was so welcoming. I always appreciate and acknowledge good service and that's exactly what I got here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "B_4cl4IGRqYb0wQSe-rYjQ"
  },
  "fgSJWxghwH0MHAl9Jl6qjQ": {
    "date": "3/26/2015",
    "text": "As a previous reviewer mentioned, the place before Sesame Garden (it was called China Palace) didn't have the best reputation or the best food. But this wasn't just a remodel and a name change- it's a completely new owner. The food has done a 180 and as a life long Mount resident I'm so glad to have a place to get my Chinese and Thai fix.   Portions are generous and prices are certainly reasonable. Welcome to the Mount!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yCzTBlSc7zpF3zvMluCLRw"
  },
  "X4BZ95CEsBdgEzujTNuETw": {
    "date": "1/31/2015",
    "text": "New Chinese restaurant on the Mount!  Very solid Chinese restaurant with all the dishes you expect.   We had General Tso's Chicken, Chicken Lo Mein, and Crab Rangoon. All the portions were extremely generous. The food was flavorful and well prepared. Happily the general chicken came with plenty of sauce and had a surprising amount of ginger flavor to it. Very nice.   We will definitely be eating here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "S0i2W9Gu34UbcnWb4DXRGw"
  },
  "xzwWgalub-IFvdgC7mu5MQ": {
    "date": "5/14/2016",
    "text": "I was visiting a friend in Pittsburgh, and he told me that this is the best Chinese restaurant that Pittsburgh has to offer right now. So, I told him that we will go here for dinner. Well, I had the Volcano Chicken, which was strips of fried chicken saute ed with wine sauce, and he had the Amazing Chicken, which was strips of fried chicken in a slightly spicy and tangy sauce. Well, there was nothing volcanic about the Volcano Chicken, and there was nothing amazing about the Amazing Chicken. I mean, this might be the best in Pittsburgh, but this isn't the best Chinese I've had. I wouldn't visit here again if I were to ever come back to Pittsburgh again, but honestly, this isn't a bad restaurant at all. It is pricey though. It really makes me wonder how bad other Chinese restaurants are like in this city if Sesame Garden is considered the best.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IUpA1wZIHWNyuGrBXnJd9Q"
  },
  "jJIMzg4eqOux6JUJ6e2U8A": {
    "date": "8/1/2016",
    "text": "It was ok. Not something I would recommend to friends, but I will order for delivery in a pinch. The dining room area isn't very welcoming.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pzWqbCd17r056Saa4lhBDg"
  },
  "A8JllwMAL_1-GyC0n67aTQ": {
    "date": "8/12/2017",
    "text": "Great food, really large portions, and very fresh ingredients. Definitely a cut above average Chinese food. Also, this place delivers to the Sheraton @ Station Square, directly to your hotel room.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wd4S85oLhvhVc7lGR11QRg"
  },
  "i8IY5Bly9Te1SJTvUMDvjA": {
    "date": "5/18/2016",
    "text": "I used to eat at Sesame Inn in Station Square until they closed. I am so happy that Sesame Garden decided to open up in Mount Washington. The food is delicious, the service is great and the staff is wonderful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VciJ3a93lkrwvhGfz__MwA"
  },
  "XiGfRHruS0lFB-vdRwQqrA": {
    "date": "8/27/2016",
    "text": "The first time i came here was back in March with my husband. It was lunch time and there were probably another 2 tables besides us,I ordered a Thai recipe which I forgot the name but It was good, it was a spicy eggplant recipe with lemongrass sauce so perfect for white rice. My husband ordered as usual general tso chicken. Last week,my husband got me shrimps lomein for take out,it was delish and the servings were big I was able to bring half to work the next day. I will definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BTLCu5mAMiODuCQxw8nfCw"
  },
  "G-DKUil_lUhBBt04XAKBSg": {
    "date": "5/30/2015",
    "text": "On pulling into the lot for this restaurant I was taken aback because I thought my sister was going to look at a new Toyota for her husband. She then stated that the restaurant is on the same property as the dealership.  On to the food... I had the Sunday Brunch which consisted of appetizer, soup and entree (Triple Delight) along with a drink for $12.99. All in all the food was very good and the portion size was appropriate. If I ever go back again I will try the Amazing Chicken which I got a chance to taste it was delicious and the portion was Huge!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vUyr0O72btWjs1HqZRc4EA"
  },
  "7XfpgpAIo4s1G5nOkGNNvQ": {
    "date": "6/16/2017",
    "text": "I've eaten here numerous times before and have only had two issues. The first issue was about two weeks ago I ordered the beef and broccoli and it just wasn't very good quality. I chalked this up to a one time issue and tried them again last night (6/15/17) I ordered the double delight (shrimp & chicken) and my girlfriend had the general tso chicken. Everything tastes good until a few hours later when I started to feel ill. I won't go into too many details but I showed symptoms of clear food poisoning and spent most of my night either awake in stomach pains or running to the bathroom. That will be the last time I eat here which is a shame because typically their food is great, but last nights experience just isn't worth the risk of trying again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H5wyUpaMhXuRyb_QN45BFA"
  },
  "Kqyu6eETNtDpUlhwcX3lsg": {
    "date": "7/25/2017",
    "text": "I love this place! Amazing food and quick service. The portions are large - one meal for two people is plenty! If you're in the mount, this is the best delivery!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qUNW37fL00bsfEeqzjbsqQ"
  },
  "XRJWGhU0MMglCAzzy-P_6w": {
    "date": "1/2/2017",
    "text": "Never had a bad meal. Chicken with string beans is our favorite! Eggplant is also very good. Quick delivery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "acJ5wH7xEzckBP1J8L0dYQ"
  },
  "Znx_8GKkXzdMvpdy5B8h-Q": {
    "date": "3/11/2017",
    "text": "My did was filled with flavor. We had steamed dumplings as an appetizer, the texture of the dough was great, and the taste was spot on. The ginger chicken was full of crunch, and was sweet & savory. We finally found a great place in Pittsburgh for Chinese cuisine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HNQAY7kzCAXAjqbIxv4eoQ"
  },
  "XRbvCNlL4TEmBjJYUo9qkw": {
    "date": "4/6/2017",
    "text": "Sesame Garden sits atop Mount Washington which overlooks downtown Pittsburgh, Pennsylvania. Sesame Garden is just a quick inline trip up Mount Washington. The space is very simple albeit a grand, traditional arched entryway inside the restaurant. The place looks like a traditional carryout Chinese restaurant on one side of the archway and on the other, a nice sit-down Chinese restaurant. The food is served family style with a side of rice. This means, for the solo traveler, prepared to have leftovers and to not be alarmed by the price. If you are traveling with someone, this place is great cheap meal if you can decide on the same thing. Overall, the food was very good. The meat was nicely prepared and the vegetables were crisp and flavorful. It is the perfect intersection of classic Chinese takeout and a well-prepared meal. It can be enjoyed out of the container on the couch or in restaurant on a date-night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qZTBxa6Mklhfzx1em6M8Zw"
  },
  "0-ot1ayi3xXJpgjwXcOq8w": {
    "date": "8/17/2016",
    "text": "Went to lunch today with my son. First time at this restaurant. Not crowded. We had the orange chicken and the amazing chicken. Both were excellent and sauces were unique. Good service and very friendly. Definitely will return for a dinner soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oeVx-uT6G-zsH2ZQsCSMYw"
  },
  "H7RtR1LKCW6-0YEHgMYMvQ": {
    "date": "7/26/2015",
    "text": "Mount Washington's hidden gem! The staff is in friendly and the food is amazing. Typical Chinese food leaves me feeling lousy, but this is REAL food, worth the price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G_eoZ0M6np8sZQ2L0a7K9A",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Gang Deng with chicken (from the Thai section of the menu). My favorite! Spicy, sweet, simple.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G_eoZ0M6np8sZQ2L0a7K9A/o.jpg"
      }
    ],
    "user_id": "NLMMNclbsppy9ER7vZtg3w"
  },
  "RFTQhBuV-vIWccWxaAyzyA": {
    "date": "5/27/2015",
    "text": "I just signed up for Yelp specifically so I could review this restaurant because I loves the food so much and I really want more people to eat here so they stay open!  I consider myself a pretty experienced eater and happen to be very critical of restaurants especially since I have moved here from NYC and have eaten at some truly incredible places. THAT BEING SAID, the General Tso's here is OFF THE CHAIN. It is so perfectly crispy with the perfect amount of sauce. Literally the best I have ever had, ever. The dry sauteed green beans are a perfect side vegetable dish. I can't wait to try more.  EAT HERE!   First off my 5 star review is based on",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_aUiM9beh2O67wufX7FdsA"
  },
  "-J-DLKUB0-Wx2IxJpwepVQ": {
    "date": "3/25/2015",
    "text": "So the name of this place changed when they remodeled, which was smart because it didn't have a great reputation.. After reading a few of the reviews posted after they reopened I decided to give it a try.  We got Mushoo chicken and volcano chicken.  My fiance loved the volcano chicken and the Mushoo was excellent. Not greasy, fresh and the portions were very generous and reasonably priced.  So glad there's a good Chinese place on the mount. I've seen lots of people sitting in the window but we keep getting take out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l6LSKkcPUbYuE8vYrzAevg"
  },
  "X23_y9mIH9ui4awm6Lb7JA": {
    "date": "5/10/2017",
    "text": "We ordered the pork fried rice, walnut shrimp, lemon chicken, crab rangoons, egg wrap, wonton soup for delivery. The food arrived within 30 minutes and was still warm to hot.  Everything we ordered was good and tasted pretty authentic. The servings were huge and we were heating up the left overs 3 days later.  The lemon chicken was crispy and the lemon butter sauce (which was packed separate) was sweet and tangy which may turn off some people who doesn't like sweet food (I love it, that's why I ordered it). The walnut shrimp was also a little sweet and savory (with brown sauce typical for chinese food).  The rangoons, I didn't enjoy so much. It had too little crab bits and basically just tasted like cream cheese in fried spring roll wrapping paper to me. The egg wrap was good, not phenomenal.  The rice was cooked perfectly with big bits of pork, a few bits and pieces of vegetables, and can probably serve around 3 people.  The two entrees also came with 1 cup of white rice, so if you store that in the fridge and would like to cook your own fried rice or garlic  rice with your left overs (which we did), you can. I wouldn't store the rice for more than a day or two though.  Would gladly order from them again, and will probably visit the restaurant itself sometime soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vtO8Ncb9HijZuXnkpT7qMw"
  },
  "ZLSnf6f3cza84J2rYFdVQw": {
    "date": "1/16/2016",
    "text": "After moving from Honolulu 15 years ago to Pittsburgh, I have gotten used to very sub-par \"Chinese\" food and how much people love General Tso's Chicken. When I moved here, I had no idea what that was. There was one of the typical sub-par Chinese restaurants that I had gotten used to over the years in Mount Washington. Eventually, I got used to eating there. Then Sesame Garden opened last year. This made me a happy gal.   My boyfriend and I have been there a handful of times and I have ordered takeout once. Every time that we have eaten there, we have been sat at a lovely window table, received wonderful service, and delicious food. My takeout was no different. I thoroughly enjoy eating there every time. We try to get there for dinner as much as possible. We have the same waitress every time and she is friendly and efficient. Couldn't ask for anything more, really.   This is where I tell you about how much I love the food. Sadly, we've found our favorite dishes and normally don't try other things. It if ain't broke, don't fix it... Our favorite appetizer is the fried dumplings. We have tried both the pork and veggie options and we actually prefer the veggie. My boyfriend's favorite dish there is the Tangy, Spicy Shrimp & Scallops. I have to agree that dish is very tasty. I have tried their Amazing Chicken which is to die for. But the Amazing Duo is fantastic. The Amazing Duo is chicken and shrimp together. I think I have found my favorite thing there. I know I have had a couple of other dishes but can't remember since after having The Amazing Duo, my mind is cloudy.   All in all, I'm glad that I found a good Chinese restaurant in Pittsburgh and it is in my neighborhood. Thank you, Sesame Garden, for opening. I will definitely try to come and visit you more often. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xk_q5_RRLkRsX2z4Xxbigg",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Amazing Duo (chicken and shrimp) on the left, Tangy Spicy Scallops and Shrimps on the right. Both delicious and recommended!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xk_q5_RRLkRsX2z4Xxbigg/o.jpg"
      }
    ],
    "user_id": "IvwQY0tXIp-7wO-tFZOicQ"
  },
  "Kdulfr1fTLi0aa6Xofrl5Q": {
    "date": "6/2/2015",
    "text": "Fresh delicious flavorful traditional Quick Chinese food. Don't let the freshly painted cute dining room fool you if it's not full. There's a constant flow of takeout orders. I had Gen Tso's Shrimp. Perfect. Broccoli and big red bell peppers with just-crispy shrimp. In a sauce with tones of ginger brown sugar and garlic. This. Is. Soul food!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9cHwoFocl2YCsg9mg7MCw"
  },
  "0RnX1_sh3--HmONPFt3lMA": {
    "date": "6/6/2015",
    "text": "I was craving Chinese food on a Saturday, and I've honestly had a lot of bad experiences with Chinese o the south end of Pittsburgh where I live. I gave this place a try, and I am so happy I did.   They were pretty slow for a Saturday, so I was nervous when we first walked in, but there was no need to be. The food was fresh, well cooked, and delicious. They use fresh vegetables and white meat chicken. The service was very good. I had a steady supply of water.  We had General Tso's Chicken, Sichuan Chicken, and Kung Pao Chicken. We also had the pork eggrolls, vegetable eggrolls, and vegetable lo mein. The portions are huge, and in line with the pricing. Overall, we're super happy to find a place within a reasonable drive for delicious Chinese for takeout or for eating in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zmk5pSyTlJdavjPKkDDj9w",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Interior dining area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zmk5pSyTlJdavjPKkDDj9w/o.jpg"
      },
      {
        "img_id": "q9xH7BrQ9JlNRtJ5ydOqkg",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. General Tso&amp;#39;s Chicken. Delicious and piled high! Also half-eaten, sorry guys.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q9xH7BrQ9JlNRtJ5ydOqkg/o.jpg"
      },
      {
        "img_id": "xYR-UjrJgsdfX00swqI5uQ",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. My half-eaten Kung Pao Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xYR-UjrJgsdfX00swqI5uQ/o.jpg"
      }
    ],
    "user_id": "C371u4yqZEGJN9iTETml4A"
  },
  "2EvlhtR_vucHbxKIeUDAGQ": {
    "date": "9/10/2015",
    "text": "Very disappointed with our takeout order and will not frequent Sesame Inn again. Ordered takeout dinner from there Labor Day evening only because, disappointingly, Thai Touch Kitchen was closed. One chicken and one pork egg roll, the only decent part of our dinner. The spicy basil chicken was bland and rubbery, same with the orange chicken. Giving a 2-star because previous experiences weren't quite as bad, but definitely not giving them another chance.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PmE0HlY_nFjFkC2O5nZqyw",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Spicy basil chicken, are you kidding me?!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PmE0HlY_nFjFkC2O5nZqyw/o.jpg"
      }
    ],
    "user_id": "QuLMz9jLUPTCM4OX9VBIHg"
  },
  "aNAENp0ClNWH1ojmAW6vpQ": {
    "date": "9/27/2017",
    "text": "Got general t'so. Chicken was pretty dry, still good. Good price for what they give for the lunch special.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uj0F49Y_0bamUqDS8yJ4lw"
  },
  "tqvRxdQjQYJ_uKBxpJNppg": {
    "date": "8/9/2016",
    "text": "They seriously have the best general tso's chicken!!! we always get takeout here when we feel lazy or simply just hungry for general tso's chicken. we've tried something else as well. such as tangy fish-great! shumai pork-good, sichuan chicken-good, Mongolian beef-good but too much onion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pW_XkS9BfbnAQ_JMxNA-8w"
  },
  "u9XYxLZLrZSToEOZiDqm_Q": {
    "date": "11/3/2016",
    "text": "Good Chinese food on the Mt.    This place is a lot better than it was a few years back, I think it's under new management or has new owners and the delivery is fast.    Awesome food, fast delivery, all smiles",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OXKY-9T83F2juMY7XDIitg"
  },
  "j0Jdl-9cZvYu-w1ZoMficA": {
    "date": "5/28/2017",
    "text": "Everything is delicious. Their brown sauce is the best Ive ever had. The vegetable platter is chock full of veggies. I always ask for eggplant and asparagus.  It's BYOB!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fhhCAXicBBycbWJHSyUo0A"
  },
  "ZhKJtbqYIbfItEDOp_tCAQ": {
    "date": "8/25/2017",
    "text": "Too expensive for the quality! I ordered pick up. Service was fast and friendly, no complaints there. Food was mediocre. I had the wonton soup, which was very good, and the General Tsos Chicken which was just ok. Despite the good sauce (spicier than most I've had), the chicken was way too chewy which made most chunks inedible. I would go back here for the wonton soup any day, but will likely steer clear of anything else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pUghdCza1hzoBX4ntyDIuQ"
  },
  "ZSixRHJdGQQ9N9y6RzjnyQ": {
    "date": "1/28/2018",
    "text": "Definitely my go to Chinese place in this area! I have gotten take out and eaten there, and all of my experiences have been great. The restaurant itself is very clean and quiet. Their general tso's chicken is my favorite dish! I get white meat only and I've never been disappointed with anything I've gotten there. The staff is also very friendly!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yRU2uJ-rOLgFU8tWSPLxmw"
  },
  "3ejfQkR2k_mgYC9VsLg1OQ": {
    "date": "11/18/2015",
    "text": "I'm always very happy with the food and service at Sesame Garden.   They will deliver if you live in the neighborhood. The delivery drivers are always friendly and usually arrive earlier than estimated. Who doesn't love that?    Every so often we'll order from another Chinese restaurant because the prices at Sesame Garden are a bit high in comparison. It usually results in disappointment and serves as a reminder for why we pay a little more to come here. The ingredients are higher quality and it shows in the flavor.   I love having a great Chinese restaurant in the neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kVAf5BYEipRMyJGMOxjDtQ"
  },
  "JUom5fqL18CFWi5jSxPjnQ": {
    "date": "9/18/2016",
    "text": "Easily the best Chinese food in the city. Take out is great and dine in service doesnt leave anything to be desired. Excellent portions great good and if you'd like be sure to ask for all white meat chicken. Really can't go wrong here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "FGWtUUzCfHSKcMh8doXIDA"
  },
  "2Vhly4-hlviNxRD87TrsLQ": {
    "date": "12/7/2015",
    "text": "I ordered pad Thai, orange shrimp and general tso  chicken. It thought it was a little pricey until I saw how much came with the meal. The restaurant was empty which always give me cause for concern but these days restaurants are doing a large take out and delivery business so I decided to keep an open mind.     The lady that took my order was nice but all business as you would expect. Restaurant was clean  The food was enjoyable. I had leftovers for the next day for 2 people. Im not an expert by any means but I'd suggest this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XGxj96Yjn49cQT5TBKLFqw"
  },
  "2Ad9jXDGWE_aTsjuT_HRmg": {
    "date": "10/20/2015",
    "text": "Easy take out Chinese food. Had the amazing chicken and it was all white meat. Quick and easy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bx1x3Zfatt71jDz9OKeQsg"
  },
  "q7ZvR11N2g1mPsLtEAdFyw": {
    "date": "1/9/2018",
    "text": "For a Chinese restaurant, this place has terrible eggrolls but that's the only bad thing I can say about it.  Everything else I have ever ordered has been great and the crab rangoons are fantastic!   I usually stop in on the way home from work and order to go.  Its ready in about 10 minutes and I am on my way.  They are really friendly too which is hard to find anywhere anymore.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vlUXqMgw3PWev9I3Vhh4nA"
  },
  "1OopW5kxoMJfYcYarDHW7A": {
    "date": "5/12/2017",
    "text": "So freaking good. That's all I'm gonna say. Don't believe me? Walk into the place and smell it. It's plain to tell there love going on in that kitchen. Our waitress seemed to be the owner or owners wife perhaps? So warm and welcoming. Oh, and the food rocks. My brother hates American Chinese food and loved it. Will definitely go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ec6nVIBBrJsXvvIzR2hCXw"
  },
  "N14gNet2uu6GBGBjtotiPQ": {
    "date": "6/24/2016",
    "text": "Sesame Garden has THE BEST pad thai! It is seriously so good. My husband and I live right down the street and we eat it at least once a week. We've both tried other things on the menu and it's all delicious. The staff there is always helpful and kind, and they always deliver quickly with fresh food! There's hardly anyone ever inside eating, so I think they do most of their business delivery. Don't let the empty restaurant deter you! Their food is delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "_oNthTV94Evx9qGkJOTXLQ"
  },
  "Mrc9ERgPrHXKHUDqhiQI5g": {
    "date": "6/24/2016",
    "text": "Sesame Garden, although a Chinese joint, has the best Pad Thai in Pittsburgh.  It's about 12 bucks and you get two meals worth of food.  The chicken and vegetable are the ones I can vouch for.  I'm sure the shrimp is also just as good.  They deliver, and usually are at my front door within 20 minutes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "jSHt8v7GCcrTDbmxqOKFNw"
  },
  "sFLMseWidEZo0DPWyI-vWg": {
    "date": "2/26/2017",
    "text": "Living on Mt. Washington this is our go to place for Chinese takeout. The food is always fresh and the portions are huge, so you definitely get your money's worth! Our go to is the chicken and broccoli with brown sauce, chicken lo mein, fried rice (veggie or chicken), and egg rolls. It is always consistently good. We have never eaten in the restaurant but it is very nice inside and clean! The people that work there are also very nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gM_FUxbUY4E33dCkN01iEw"
  },
  "XCaqUponZ35P3cdCcYg0Tg": {
    "date": "1/31/2019",
    "text": "Best Chinese delivery in the area!! We live in the South Side slopes and they deliver to us. This is the first (and only) place I have ever ordered takeout that arrives so hot I have to wait to eat it! It's unbelievable. Love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dlwyicSGxEB96BfxLzuv5A"
  },
  "j94ohmDA4t6lSzsymA6UKg": {
    "date": "7/20/2017",
    "text": "I heart this place.   I moved just around the corner late last year, and have walked past this spot quite a few times before stopping in. Now it's one of my favorite restaurants to visit.  In a nutshell: the staff is nice, the food is really good and the portions are generous for such reasonable prices. They have a blend of standard American Chinese food classics, along with some Thai cuisine influence.  Stop by and pick up takeout or dine in. You'll be pleasantly surprised.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "e3dtWb_6aL5-afvXM9f7qw"
  },
  "OniP4WcgqNEj1b9qe7ioww": {
    "date": "6/28/2019",
    "text": "This place has great food however customer service is terrible. When the delivery driver arrived at my house my friend went to get the food from the driver. The order was paid for by card and tip was included at time of payment. As my friend walked away with the food the driver stopped her and asked her if something was wrong because she didn't tip. He then launched into a 5 minute explanation about how difficult delivery driving is and the extreme effort he put in to bring us our order. My friend did not know I included a tip and felt inclined to add additional money because of his angry rage about delivery driving became uncomfortable to her. I believe in tipping people as I use to serve and relied on tips. A delivery driver is paid hourly and if one place forgets to tip, that is never a reason to pressure a customer to give a tip. Our meal was paid for, we paid our delivery fee and we did include a tip, he just didn't know. I suggest you just get take out. Lol.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ycDV8TQpZCDWNFGiZvMH8w"
  },
  "PVC-DtbA1vJGWvK6_eZdHg": {
    "date": "7/1/2018",
    "text": "This place is truly delicious. I had the Cashew preparation with tofu, and it's clear that great care was taken in preparing the food - the tofu was actually cooked, rather than just plopped on the plate like at most places. Same deal for the yummy vegetables. And the sauce was delicious!  Went with a party of 4 adults & 4 kids at noon on Sunday - was quiet in the restaurant, but the staff was still so gracious to us & all the kids. Can't wait to return!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "HcJchgW8quNVD9Z2Q_ZvKw"
  },
  "2Jt83Ij4X95LyB1-jWDNcQ": {
    "date": "4/24/2017",
    "text": "I was craving Chinese food and I hate the Chinese restaurants in my neighborhood. So, I looked up a spot to check out and I chose Sesame Garden. I ordered the Shrimp Eggroll, Amazing Chicken, with white rice. I am glad I ordered it to go, because parking is quite difficult around there. I had to illegally park near a fire hydrant, put on my flashers....and prayed my food was ready for me! Anyways, the restaurant was quite cute and the host was friendly for the short amount of time I was there.  The shrimp eggroll was absolutely delicious! I wish I would have ordered 2! The portions were quite plentiful, and should because the food is a bit pricey. That is why I took away one star. But I totally enjoyed the food. The amazing chicken, was AMAZING! It is a spot that I will definitely hit up again, Hopefully next time I won't have to illegally park lol",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "W0YPUUT-1jxzv0hjUi5mLw"
  },
  "0_eYjCuW0FqKcy9SPp29ag": {
    "date": "4/6/2019",
    "text": "Excellent food! We really enjoyed them! As other reviews state, the prices are a little higher, but the portions are huge. Totally worth the price. General tso's chicken was not spicy, actually pretty sweet! Dumplings were very thick, not like those thin potstickers other places give you. Chicken lo mein is one of the best I've had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IdskhKKnnzoogz0AxLz0XQ"
  },
  "EXxz2QBXhsRx0F6U_D54mg": {
    "date": "9/21/2018",
    "text": "Excellent food, NO parking, they deliver, a little expensive compared to my favorite in East Syracus. Good place to go eat at, nice setting. I need to find a takeout place with good food and a little lower price.   Have a great Thai place by me in Alpharetta, great food, good prices, and nice setting. A win win, always packed.  My son and I were the only ones there, but with the parking and prices I understand why.   I will go back, but it is not a place to order from more than once or twice a month.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RcIY_p4InWTfr_QqX-uaqA"
  },
  "gDtDaLvY7oqHtcVUCWPfBA": {
    "date": "7/15/2016",
    "text": "This is my favorite spot for American style Chinese food. The restaurant is very clean and open.   The staff is friendly and orders are filled very quick. Especially to-go orders. Even if you live on the mount, you still can call and leave your place and not have to wait too long for your order to be ready.  My favorites are the mu shu pork, and the general tso's chicken.   The prices could come down a little but other than that this place always gets me out of a night of cooking.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mrudkq5duCOoiuhL61ZBcQ"
  },
  "PDaKcXfVmk9fWBmVTL8EQw": {
    "date": "3/8/2018",
    "text": "Found this place on Yelp and decided to give it a try and boy I am soooo glad I did!  I had the best General Tso's I have ever had! It was so crispy and had a generous amount of sweet saucy goodness...lol. It really is perfection.  My son ordered the Crispy Duck, despite my warnings. (I had duck once before and thought it was terrible. Dark meat, very greasy, strong gamy flavor) This duck was superb, much to my surprise. Not greasy at all, not gamy, just more of a dark meat flavor. Nicely done. It does take more time to prepare, but they asked us if that was ok. Good sign of things made to order.  Sampler platter was very good, had very good teriyaki chicken,  very good barbecued spareribs, excellent coconut shrimp, the best crab rangoon I have had, and my 2nd favorite egg rolls I've found.  We also had seafood hot & sour soup, I thought it was kind of yucky, but my wife and son liked it fine.  Lo Mein was also the 2nd best I've had.  All in all, although a bit pricey, I will definitely return. Excellent food and friendly staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "giOxaIL7VOf9JS2DMQdO8w"
  },
  "eEtZE0esTqNEA_yy1TjjBQ": {
    "date": "3/16/2019",
    "text": "New favorite to go Chinese spot. Ordered amazing chicken and it was GREAT! Very tasty and full of flavor. The white meat chicken in the amazing was large and plentiful. Great service as well. I will be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q3gxszb9w0km11oy86__kA"
  },
  "GusAWz7EW4GI8_gjKLKJAw": {
    "date": "10/26/2017",
    "text": "The food here is very good I like to get their Shrimp Lo Mein and fried dumplings or crab Rangoons, but today I tried the Singapore-style rice noodles: shrimp chicken pork and vegetables in a curry sauce and when I tell you it was f****** delicious! I'll definitely order it next time I go.    The ambiance is casual and quiet. Whenever I go it's usually not very busy so I've never had to wait an inordinate amount of time for my food and have always been seated immediately.  I also usually go around my lunch at either 1:00 or 4:00. For dinner I usually see at least two or three tables seated.     The staff is always friendly and polite they always smile.  Whenever customers come into my job, I always recommend this place as a good spot to come and grab a bite to eat plus the food is so cheap how could you say no?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "diq97ZN5hG_HVsbopHE92Q"
  },
  "bCeqsNw3ZM0ohC3k8qxusg": {
    "date": "3/14/2016",
    "text": "Lately I've been steering away from most Chinese places just because I'm not loving the food. But Sunday night I was hungry and decided why not with this place. It's close and I always run past and see people inside.   They close at 9 on Sunday's and I made my order for takeout at 815 and it was ready before 830. I didn't get any hostility or anything for ordering so close to close (some places do).   The gentleman who took my order was very nice and pleasant and when I picked up my food he was very friendly.   This place is a bit pricey I will say. I got the Amazing Duo (lightly fried chicken and shrimp in sauce). It was great! It was a ton of food. I've actually gotten 3 meals out of it!!  If you're looking for Chinese in the area I would recommend",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5U0GO1-BW_F_6k7eOJigxQ",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. That&amp;#39;s about half (sorry I dug in) and this lasted me for lunch the next 2 days with the rice! (Amazing duo)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5U0GO1-BW_F_6k7eOJigxQ/o.jpg"
      }
    ],
    "user_id": "tJiWkQtxSmr4UdfEp-EYHA"
  },
  "MaCI300osOd2SJKmraSn2Q": {
    "date": "11/26/2017",
    "text": "I always patronizethis establishment because the food is so good!  And the staff so nice.  Everything so fresh, delivery available.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wV80G-imrQo25rHzKMq6fg",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wV80G-imrQo25rHzKMq6fg/o.jpg"
      }
    ],
    "user_id": "NK9jX5pjmJKoW7CNrk-z0w"
  },
  "1zXK_KBBGN74vAhsbEMHtA": {
    "date": "1/1/2018",
    "text": "General Tso's chicken was extra crispy, in a good way. The fried rice was devine. The chicken and broccoli was surprisingly good; I'm used to a thick brown sauce, but it came in a clear sauce. I will definitely be back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "By9NDMWsBB4YKMP3EqBwhw"
  },
  "GUGaXyb1M284lTXvALw6SA": {
    "date": "3/20/2017",
    "text": "I've lived on Mt. Washington for years, and after a less-than-stellar experience with whatever place used to be there before, I have avoided this restaurant. However a recent peek at Yelp clued me in on the fact that this is a new restaurant under different management so I decided to give it a try!  I'm so glad I did! I've never eaten in, but the delivery is always quick and the food is excellent. Our go-tos are the Amazing Chicken and the Cashew Chicken, but thanks to some other reviewers I will be trying the Amazing Duo next. This is definitely some of the very best American Chinese food in the Burgh. I will say that comparatively the prices are a bit high, but the quality and service has always been excellent.  I'm so glad that the new management has made this place into a truly awesome restaurant!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "xjDkNv3JodG04_7Oq2JD-g"
  },
  "yoiP2nqO5ud0f5Id74mNMw": {
    "date": "2/25/2016",
    "text": "This building used to house a crappy Chinese restaurant. A disgustingly bad Chinese restaurant. Thank goodness Sesame Garden came along and saved us all from terrible food.   I've eaten in a few times and I've also gotten take out. Food quality and deliciousness are always consistent. The restaurant is spacious and comfortable and the service is good. Everyone is very sweet- The owner gave my husband and I big bear hugs after we welcomed him to the neighborhood and wished his business well.   I usually order the amazing chicken and an egg roll. I've had more amazing amazing chicken and better egg rolls in my life, but these are pretty darn good. If you're looking for a real treat, try the \"Assorted Sampler\" Platter. YUM!   The dinners are a little pricey compared to other Chinese restaurants in the area, but you get enough grub for at least two meals. (Amazing chicken makes a great breakfast, y'all). Plus I can promise that this is going to be some of the best Chinese food you can find on this side of the river.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "DtzguIRjy-oRbrwVidAxQQ"
  },
  "10t1Wc7g0Y0Ch6VIfZdgaA": {
    "date": "6/25/2015",
    "text": "It's so nice to have a decent chinese restaurant in my neighborhood in Mt. Washington. Sesame Garden has pretty good chinese food. By no means is it the best I've had but it's good enough, I'll order from them again. However I do feel their prices are a little high. You get a good amount of food but still a bit pricey.  I ordered the vegetable spring roll (which I did not like), the Pad Thai (which wasn't bad) and the Mussaman. The Mussaman was really good. Comes with green beans, potatoes, onions and pineapple in a light curry coconut sauce over top rice. I'm not usually a curry fan but this dish was great & not too spicy. Will definitely order again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ANkXOldhRoLV8V0woCCZxQ",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Vegetable Lo Mein. Not too bad.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ANkXOldhRoLV8V0woCCZxQ/o.jpg"
      },
      {
        "img_id": "MxiFsUsc_B0AL_EATSIk3g",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Pad Thai",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MxiFsUsc_B0AL_EATSIk3g/o.jpg"
      },
      {
        "img_id": "olT3_eQiqGr-4U0vglA_Vw",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Mussaman over rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/olT3_eQiqGr-4U0vglA_Vw/o.jpg"
      }
    ],
    "user_id": "9pbOJFanh66_QnIb5Fjblg"
  },
  "XlDwI0mczdkORxOZ7Ovqsg": {
    "date": "2/16/2018",
    "text": "Everything I've ever gotten here has been wonderful and fresh. I recently got the mussaman curry with beef for lunch with a side of brown rice and hot and sour soup. It was the perfect amount for lunch and was absolutely delicious. I've also had the amazing chicken, the Penang curry, and the beef with broccoli which have all been great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HblyRHrSVcicPe9tk5XeVg"
  },
  "riGaXTJKN-wEMA1xKflmfw": {
    "date": "10/15/2015",
    "text": "What makes you come back time and again to a restaurant? Is it the food quality? Speed of delivery (to your table or your home)? Or the service? Sesame Garden hits all three of these categories and is one of the best Chinese restaurants in the city of Pittsburgh.  Having visited the establishment twice now, the meals have been tremendous and by far some of the best food I've eaten in a long time. We ordered General Tso (not too rich or spicy, but hit the spot), Garlic Chicken (including crunchy vegetables and a light sauce), and Steamed Dumplings (delicious!). The only thing that seemed a little off was the Wonton Soup which was still delicious but underwhelming.  What's really great is the staff and the level of service. After picking up an order and arriving home, I realized that the order we were given was wrong. Upon calling they quickly sprung into action and delivered the correct order to us within minutes.  Though the prices tend to run a little high (some of the most expensive I've seen outside of Chinatown in NYC), the food and quality is more than worth it. And if that means paying $3+ per entree will guarantee great Chinese food, then pass the lo mein!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 9
    },
    "photos": [],
    "user_id": "NxtYkOpXHSy7LWRKJf3z0w"
  },
  "-RFBkCZgd9hAEQmIiqhHSA": {
    "date": "6/13/2018",
    "text": "So glad to find a Great Chinese restaurant that isn't buffet style! Don't get me wrong, I don't mind the occasional neon yellow rice buffets from time to time, however, if you genuinely love Chinese food, and prefer something a little more \"artisan\", then Sesame Garden might be for you. I wouldn't say it's overly authentic, but everything that I've had here was absolutely delicious and at a very reasonable price. I would highly recommend their sampler platter for 2, it's a great way to taste a little bit of everything. The shrimp pad Thai is fantastic, perfect amount of spiciness, and the General Tso's chicken(yes, sometimes I'm that asshole that orders GT chicken) is probably the best that I've ever had. The service is very pleasant, and the location is right off of Grandview ave, so it's a nice place to bring out of Towners so they can see the view. Overall, this is probably my favorite Chinese restaurant in Pittsburgh, yinz should definitely check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bleyhN--91eJmPyJpXr9Mw"
  },
  "YKgskz8sY7OX7Z7yY8OIQw": {
    "date": "3/5/2019",
    "text": "I ate at Sesame Garden with my sister. We ordered the crispy tofu, Gang Deng, and Pad Thai. All were vegetarian (tofu, no meat).  The crispy tofu was the best I have ever had. There are lots of ways to make it but this was slightly salty, a little spicy, and had pieces of garlic and ginger cooked with it. FABULOUS. I can't wait to order it again. It was a very generous portion. We shared it and could barely finish.  The Gang Deng had plenty of vegetables in it. The sauce is a red curry with coconut milk- they went lighter on the coconut milk than I'm used to and I really liked it! It was pretty spicy, too. I have found some restaurants don't believe you when you say you like spicy. I didn't spevify when I ordered. It was good, tho. I like the heat.  The Pad Thai was better than most. Good flavor, a little spicy. I'm not a huge Pad Thai fan, but I could have eaten more if I wasn't so full from the other two dishes.  Well worth the walk in the cold to get there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZOA_kPdQOTMUrkw8Sr-L5w"
  },
  "ZoaCFIeVoBEDM52HIYyr3Q": {
    "date": "7/14/2019",
    "text": "I just want to start by saying that I am used to Chinese food from San Francisco and this was my first introduction to Chinese food here. I found it interesting that they had Chinese and Thai options at the same place.   The service was good, the restaurant itself needs updating (It wasn't necessarily dirty but it disrepair for sure. ie-water spots all over ceiling, dingy carpet etc..)  The Pork dumplings were really good. The sauce they give was delicious. The shredded pork dish was good but it doesn't mention in the menu which vegetables are cooked with it and I don't like some of the ones they included (celery, carrots). And I don't think it tasted very much like garlic. The lo mein was good too- but definitely not authentic. It tasted like buttered noodles and honestly had more garlic taste than my pork dish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LrEqYyTZSM1_84-b0qKb5A",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Pork dumplings- fried. So good",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LrEqYyTZSM1_84-b0qKb5A/o.jpg"
      },
      {
        "img_id": "x1yP2gxtjjLPcDP7fBMpiA",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Shredded pork with garlic sauce (wasn&amp;#39;t actually shredded and very little garlic taste)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x1yP2gxtjjLPcDP7fBMpiA/o.jpg"
      },
      {
        "img_id": "m5oBpSDn9sgu63HqGg6amQ",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Shrimp and scallops lunch special",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/m5oBpSDn9sgu63HqGg6amQ/o.jpg"
      }
    ],
    "user_id": "i9rH5-NuYFnZhTMAqHCRQg"
  },
  "LoXiFpjbVeiQ9MD5Qrvsfw": {
    "date": "6/2/2019",
    "text": "Decor -dated and the carpet is dingy  Service - friendly and quick  Food- great, flavorful and big portion sizes (expect the rice you will prob have to ask for more)   Apps - Crab Rangoon and veggie egg roll- everything was hot and fresh.  Honestly might be the best veggie egg roll I have had. It wasn't greasy and the veggies inside were very fresh.   Dinners- General Tso chicken and Orange chicken big portion sizes. I wish they gave you more broccoli with the chicken dishes. The orange chicken has a great flavor!   Overall one of the best Chinese's restaurants in Pgh that I have come across so far",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "065NwtBbToJwXKqsZ1Ai6w",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/065NwtBbToJwXKqsZ1Ai6w/o.jpg"
      },
      {
        "img_id": "mRE9acuovPWgCg8YkzafXg",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mRE9acuovPWgCg8YkzafXg/o.jpg"
      },
      {
        "img_id": "xS4Nwoov41RBUwUziKsQiA",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xS4Nwoov41RBUwUziKsQiA/o.jpg"
      }
    ],
    "user_id": "11aKQnIWLCS-O88j9ya2YQ"
  },
  "-oBdx4EUkfEcvj93uNuVQQ": {
    "date": "8/31/2019",
    "text": "One of my favorite Chinese restaurants in Pittsburgh. A little pricey, but the portions are huge. I always have leftovers. The entrees that I've tried have all been delicious, but the fried calamari appetizer is my favorite. I get it every time and often go there just because I'm craving it specifically. It has such a unique flavor and is fried perfectly. I also like how they give you free tea if you ask for it. This place seems to do a lot of takeout and delivery, so the restaurant itself is almost always empty, which I personally like. Every other place on Shiloh St. is loud and crowded, so this is a nice change of pace. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K4wGmMNmLp_qNeIV8FyRGw"
  },
  "iHAhyX0L3aMOaQmiNUce6A": {
    "date": "2/11/2019",
    "text": "I'm really glad they do delivery! They said about 45 minutes, and they came in that time frame.  Pretty good Chinese food for a very reasonable price. I got egg drop soup and chicken fried rice. I really liked the egg drop soup, it was different from any I've had before because it had a few vegetables added. The fried rice was pretty average, but good. The portions were huge.  I will definitely order delivery from here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "suGyAnfEjZo52DxaKbDD7Q"
  },
  "K5H6kVO8TCbY7u9rn8u_6w": {
    "date": "8/2/2019",
    "text": "We like trying Chinese Food when we travel. This is a nice little hole in the wall. Food was fresh and tasty.  Portions were plenty.  It was very quiet while we were there but it was late afternoon so not surprising.  We'd definitely recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zeSqXkPf2yo-v9_YZUo_OA"
  },
  "4DyEf5XmX41dvclXIQGnwA": {
    "date": "11/18/2018",
    "text": "Definitely not worth the price. This place's prices are extremely inflated for flavorless basic Chinese food. The customer service was subpar. I ordered food to go and once I arrived home I ended up not being content with the meal once I dug in. I could've went to the super market to get my entree and be satisfied.   For my entree, I ordered a light fare meal: broccoli with chicken. The meal was basic and simple. One good thing is that I enjoyed was the brown sauce on the side.   I would order ahead of time if you want to pick your food up to go as you have to pay for parking Monday they Saturday (if you park in the parking lot).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NiNX6RKigjvxnPMsgJAXjw"
  },
  "SxGhPWROZWkA6bO0SbXDTw": {
    "date": "7/12/2019",
    "text": "Whether pickup, sit down or delivery, Sesame Garden has always been stellar! Everyone's had a bad meal (even at their favorite place), but never here. Sweet/Sour, Lemon & Sesame Chicken are my \"go to's\" but the egg rolls are always great too. If I had anything to add, maybe some seasonal specials. But all in all a great combination of taste & value!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "11W8jGsCD3dNVVOL243uag"
  },
  "mVu1p2ILLygg1T7QB7Xw-Q": {
    "date": "2/19/2018",
    "text": "My trusty sidekick and I were craving Chinese food and were in this part of town so we stopped for dinner on a Wednesday night.  We were a little nervous because no one else was in there but wow were we impressed with the food!  We ended up ordering a few appetizers -crab rangoon, bbq spareribs and salt and pepper calamari. Everything was so delicious and it was the perfect amount of food- more than enough for the 2 of us.  We also ordered the shrimp in lobster sauce and I have to say it's some of the best I've ever had - the sauce was the perfect consistency and some places make it so bland - this was perfect!    We'll definitely be back!  Oh, by the way, while we were there a few more people showed up and the delivery car was super busy - must be a popular delivery place. Would definitely recommend!!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 10,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "raL734JpO8tO8ng6MMF1fw",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Shrimp in lobster sauce- chick full of goodness!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/raL734JpO8tO8ng6MMF1fw/o.jpg"
      },
      {
        "img_id": "cQY1j788OvN77UY6CxSEzw",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Salt and pepper calamari-",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cQY1j788OvN77UY6CxSEzw/o.jpg"
      },
      {
        "img_id": "xA17x6pPRx7kk9DEalf3Zg",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. BBQ spareribs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xA17x6pPRx7kk9DEalf3Zg/o.jpg"
      }
    ],
    "user_id": "hjk--8VuDX3479_atPJQ1g"
  },
  "bINu2YCMcTujqGo47AWMUg": {
    "date": "7/7/2019",
    "text": "This place is really good and not very well known unless you live in Mt Washington. I usually get the chicken and vegetables with white rice from the healthy fare menu. It is steamed, has no MSG, and is awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kQaJ3DweniL-OV5T5JjEuw"
  },
  "pAfp8MTEeKKeAZDJNkz0xg": {
    "date": "3/23/2019",
    "text": "We are outside of the delivery area but it's well worth the call to then pick up your order. Better than your basic Chinese food restaurant with plenty of variety to order from.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VpsVJ60ieMG1xfH6MX6-Ww",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Sesame Chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VpsVJ60ieMG1xfH6MX6-Ww/o.jpg"
      },
      {
        "img_id": "tBXM37bY4n891xodFt5__A",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Appetizer",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tBXM37bY4n891xodFt5__A/o.jpg"
      }
    ],
    "user_id": "so_2aFvY2-XkK06-sptUng"
  },
  "3lHtmPSPyvS3_0kA2tjQ7w": {
    "date": "7/14/2018",
    "text": "It's extremely challenging finding good Chinese in Pittsburgh. Any lover of the cuisine can tell you as much. Sure, Squirrel Hill has a number of authentic options, particularly Hunan and Szechuan, but if neither is your cup of tea or they're too authentic (because, let's face it, that's possible too), you're out of luck. I was happy to find this location. MT Washington is horrible for parking and accessibility but the restaurant is fairly large, served quickly and has an assortment of Chinese and Thai.   I tried the spare ribs and wonton soup. Both were excellent. I'm looking forward to going back and trying shrimp, chicken, and fried rice. The egg roll was also good, however it's a spring roll. Just saying.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "EmrahJMelcioolXzG8TVng"
  },
  "QINWMp2uEySY8EM7dQJW3w": {
    "date": "6/26/2018",
    "text": "Anytime I'm feeling lazy but boujee, I order the Walnut Shrimp. These guys are definitely on the splurgey end of Chinese Takeout, but the quality truly is there. These guys used to be owned by different people, and if you remember them from back then, I urge you to give them another try! The quality and service has gone up, and you can't go wrong on your \"Netflix and Chill\" nights (we all have them).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "01bmnye5yXRyDZ5Je6tnKg"
  },
  "gnyVtrVbSZdv-bOCvJ9B8Q": {
    "date": "3/20/2019",
    "text": "Best Chinese food I've had ever! Nice location, really quiet. Service wasn't the best (only 1 waitress/ host) but the food made up for it. They also give you a lot of food, enough for two people to share one plate!   We ordered salt and pepper shrimp, sesame chicken, orange chicken and shrimp, and shrimp fried rice amongst the 6 of us. Everything was amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9qJoMA_cBN63i8rjvqUCxg",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Orange shrimp",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9qJoMA_cBN63i8rjvqUCxg/o.jpg"
      }
    ],
    "user_id": "ZNyimFjrLHWuBfp1o2mjQQ"
  },
  "bw-jCJa_Di0CeamjyEAf1A": {
    "date": "11/3/2017",
    "text": "My girlfriend and I stopped over here for lunch. We literally had the place to ourselves and were able to order off the lunch menu. The spicy items are marked accordingly and on the other side of the menu were Thai inspired dishes.  From her vantage point she could see some people coming in for take out. The lunch prices are very reasonable. With your choice of entree you get a choice of soup or eggroll, white, fried, or brown rice as your side. With your check you get a store bought fortune cookie.  She had the General Tso's chicken with rice and eggroll. I had the chicken and shrimp entree mixed with vegetables. Needless to say service was fast and the food very tasty. My friend told me that her General Tso's was not overly spicy. I enjoyed my dish as well. I was please with the portion size as I normally do not finish the rice when I order. Here it was just enough.  The eggrolls came with both the duck and hot sauce almost combined but you could tell the difference just by looking at it.  The waitress was very attentive to our needs and did ask if we wanted to split the check. I refused but was grateful she had asked.  This is a nice option when dining on Mt. Washington since Shiloh St has a lot of eateries as well as the Grandview bakery and love Pittsburgh shop. Street or lot metered parking is available. If you heading up that way avoid Sycamore St since part of that road is closed. Shiloh is a one way St so it is best to head over to Grandview Ave and proceed down from there.  We had a good lunch at a very reasonable price.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 11,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "G59bRS5aZYB8CeSL3-Nakg",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. Chicken and shrimp with veggies and fried rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G59bRS5aZYB8CeSL3-Nakg/o.jpg"
      },
      {
        "img_id": "nekatWGTxmAcWvld8fJdqA",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States. General Tso&amp;#39; chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nekatWGTxmAcWvld8fJdqA/o.jpg"
      }
    ],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "vAHiCk7XbgHI18HxSS1azg": {
    "date": "6/15/2019",
    "text": "I'm super picky when it comes to Chinese food, and my standards are high since I worked at an amazing Chinese restaurant for 7 years. Just moved to Mt. Washington and this exceeded my expectations for the neighborhood Chinese place. Had a few different things off the menu and all were good. HUGE portions!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0b3Ah7TaSYLaDS4lSh-jtA"
  },
  "haPS8XOVtkwX9EsD_EX3bw": {
    "date": "5/12/2019",
    "text": "Absolutely love Sesame Garden! It's delicious every single time.  We drive from Monroeville maybe once or twice per week and order the same thing every time! It's that good.   We starting dining in as well, it's not really the best establishment for that but we've come to love them so we don't mind, but it seems like you get more food with takeout!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q1I8Ih5GxqfOEJiXefoP4w"
  },
  "iRf_trzErPLJyExQpEijLw": {
    "date": "1/21/2018",
    "text": "This is my favorite Chinese delivery place! They deliver to the Southside quickly and the food as always been good. My go-to dish is the amazing chicken, made extra spicy. The dumplings and spring rolls are also very good! Recently we tried the sweet and sour chicken for a different option, it was good - but since I love my Chinese food (ok, really all food) spicy it isn't something I'll go back to.   I've never actually eaten in the establishment, so maybe one of these days I'll drive up the hill and try the actual restaurant out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MXE5dJEqzzfKDLEGkHbdVA"
  },
  "T_rhzc6Lg-IgTgJxAR7mPg": {
    "date": "12/24/2017",
    "text": "Found this Chinese restaurant near our Airbnb and had lunch here. Traditional Chinese style inner decoration. We had seaweed salad, wonton soup, sesame shrimp and panang. The seaweed salad was a little bit sweet, which served as good appetizer. There were three wontons in the soup, and they were yummy. The sesame shrimp was one of their most popular ones, with sweet and sour taste. We chose tofu for the panang, and it was great. Really a nice place for Chinese cuisines!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "V05E4GPZuF0DBDqX4vo2dA",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V05E4GPZuF0DBDqX4vo2dA/o.jpg"
      },
      {
        "img_id": "cIY9xa106-B8dy_DBt0Ikg",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cIY9xa106-B8dy_DBt0Ikg/o.jpg"
      },
      {
        "img_id": "8u6itrIqyu2vCjRYYLwCwg",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8u6itrIqyu2vCjRYYLwCwg/o.jpg"
      }
    ],
    "user_id": "IZ_GqfYCxcCti7Ck_fi6BA"
  },
  "OvsFRwAxFl6F-oas03AzYg": {
    "date": "10/12/2018",
    "text": "So, I went to this restaurant at 3pm, and was offered a dinner menu. So, I chose massamun curry. The portion was generous, but not proportional to the rice. The sauce was wayyy too sweet to my liking, and not spicy at all like typical Thai curry. Maybe, I was stupid to order Thai food in Chinese restaurant. Also, it was not a very busy hour, but the waitress took forever to refill my water.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "59xqpcgI-QURwFoQWu5eng",
        "caption": "Photo of Sesame Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/59xqpcgI-QURwFoQWu5eng/o.jpg"
      }
    ],
    "user_id": "pGKXzpdYmBq_qBfog8p9SA"
  }
}