{
  "eu17I2ThTy29wcugTVhcYA": {
    "date": "6/13/2011",
    "text": "I love the food.  I can't remember the name of what I get, but it was the penne pasta with the banana pepper pasta sauce.  Super spicy, but super flavorful.  We live North of Pittsburgh, but will drive there to eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5uLbh_1vidB0NPn9Nm0dgQ"
  },
  "D_LL68tr8mG-Xs1ARzoQIA": {
    "date": "8/8/2013",
    "text": "Great Service and amazing meatballs!  Those are the two reasons this got four stars from me.  Pizza...eh, not that worth it but the dinners are some of the best!  Great low key place for a family Italian Dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gBkSDwcl8nZTTLzyXkz8kA",
        "caption": "Photo of Segneri's Italian Restaurant - Coraopolis, PA, United States. Skip the pizza go for the dinners!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gBkSDwcl8nZTTLzyXkz8kA/o.jpg"
      }
    ],
    "user_id": "Ke1dd4u9vwYITpsz2eivZg"
  },
  "nkS-QMZeY7I9UXwCJxIPkg": {
    "date": "5/19/2017",
    "text": "Very nice little Italian place. It's very small and a bit dark inside, but clean. Our family of four was seated quickly, but actually getting food took a bit, and we waited a long time for the check. They bring out some plain bread with real butter on the side, which was nice. I ordered the gnocchi, which came with tomato sauce. It was very good, but I recommend getting a different sauce with gnocchi because the flavors didn't play together well. We ordered the bruschetta appetizer that was nice and hot, with the cheese melted on top. Family's ravioli and lasagna were both wonderful. The meatball that came with the ravioli and my gnocchi was wonderful-get something with meatballs. All in all, a very nice place with great food and servers. Just don't go if you're in a hurry.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KHXVPU1cbuqI_483fnI1JQ"
  },
  "v8biCDUqzfD7GEDMd9oFxQ": {
    "date": "8/1/2015",
    "text": "I grew up in Pa and moved away a very long time ago and I still miss The gnocchi.  Went to visit my dad recently and it's just as good as it ever was.  I can't wait to go back.  I'd pay someone good money to ship me some of this food to Oregon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "gVgosgrTfyNg97lNh7OHaA"
  },
  "P4zSlTwWjhNw1gJOw-SQMg": {
    "date": "2/15/2016",
    "text": "Oh my my, best Authentic Italian food I have enjoyed in a very long time.  Never had Italian Tripe before but will eat it again before I have to leave town.  The service was great, she recommended items \"not\" on the menu and I am so glad we listened.  The sauces were full of flavor and the meat balls not from the freezer!  Everything home made.  Fabulous food, comfortable atmosphere, and great service if you find yourself in Pittsburgh take the short drive to Coraopolis and enjoy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ClBUxZDTkCbnDey5YO-sg"
  },
  "GBQlrAkx-8f7tITFRAphDg": {
    "date": "3/2/2013",
    "text": "Segneri's is one of my favorite Italian Restaurants! The straightforward approach to Italian food reminds me of the food my late Grandmother would prepare.  We started our meal with an order of the Stuffed Hot Peppers and a large Antipasto Salad. The stuffed peppers are 3 hot banana peppers stuffed with a sausage mixture, topped with mariana sauce and melted cheese-- simply delicious! The Antipasto Salad is enough for 4 people-- its a generous serving of various meats, cheeses, roasted red peppers served on a bed of greens. The dressing for the salad is on the vinegary side, but its very good if you like that flavor.  My favorite entrees to order are the Penne Arrabiata, the Cheese Ravioli, and the Gnocchi with marinara. The Arrabiata sauce is VERY spicy, and equally as delicious. The last time I ordered it, I had enough for dinner and lunch the next day-- very generous portion! The Ravioli and Gnocchi are both homemade, neither is too doughy. The marinara sauce is bright red and full of flavor. I often describe it as \"drinkable\"-- yes, it is that good!  Segneri's is no nonsense Italian done right!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "jOVcYOqVJXIYZBCuIyytww"
  },
  "LSkEEkz4e-qTRrHP3UES_A": {
    "date": "9/20/2015",
    "text": "Just fantastic. After having trouble finding a place to eat late at night in Sewickly, we eventually stumbled upon Segneri's. We arrived 5 minutes before their kitchen closed, but they were super accommodating and told us not to rush in making a decision. The food was incredible and the owner and staff were all extremely friendly. I had a spicy Penne which was seriously hot! The spicy Italian sausage paired nicely with everyone's meals too.This is a must try if you are in the area and I will certainly return whenever I am back in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NlR3B6kgfLXzr4R9txoc0w"
  },
  "jvgNgQmwkq3iqC9yyUaOOA": {
    "date": "5/11/2013",
    "text": "I absolutely love this Italian restaurant!  It's a small, rustic place, with genuine Italian food.  The last time I was here, it was for lunch.  I ordered the fish sandwich with french fries.  The sandwich was served on a platter and the fish was as long as the plate and the bun looked like a complimentary side.  It was breaded and fried to perfection.  I didn't bother with the roll.  The fries came on a separate plate and was heaped.  Needless to say, I ended up getting a box to take food home.  Now, if you get to talk to \"momma\", she is absolutely a wonderful woman!  If you're rude or disrespectful, she has no problem telling you, but she will also tell you if you're one of the nicer customers as well.  She gives it straight up and I think it's great!  And finally!  It's sooo hard for this girl to find a truly great cannoli, but I know where to get one now!  Overall, the food is awesome and ambiance of the place is really nice, servers are friendly, and service is prompt.  This is one of my favorite places to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "aYrvn_5tR3U-4ZhpH-CD0A"
  },
  "i_sj92aLvk_G7TfE12dEJg": {
    "date": "7/3/2015",
    "text": "Excellent food and great price! The cannoli was made fresh and a definite mush have! Great service and wonderful atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NMRKiQbU1W0-AhtKaIxgHw"
  },
  "bpIlQRirmQgEn6dQbZtdzg": {
    "date": "12/16/2016",
    "text": "Charming place great wedding soup ! Had the meatball sandwich awesome!! Owner came out sweet Italian man !!! Highly recommend if in this town ! Brought our hockey team with parents",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j8t_J8Mttnd7lDvSYPQ4kA"
  },
  "1Eg5j2ztAnlncY_UGsw4jQ": {
    "date": "12/18/2012",
    "text": "This is a neighborhood joint that reminds me of my childhood in Hoboken, NJ.  There is a limited menu here of classic Italian dishes with some specials of the day.  I opted for the Chicken Parmesean which was not on the menu but was one of the day's specials.  It was so good!  I got two large, perfectly breaded and fried chicken breasts with a side of penne.  Lots of cheese and sauce - probably a bit oversauced - and the pasta was a little overcooked.  Still, not a dealbreaker as it was a delicious dish overall.    My wife opted for the lasagna - our server highly recommended this and said it is homemade.  It also was delicious if not a bit oversauced.    I also ordered the Italian Wedding soup.  This was a good dish but on the verge of being too salty.  Overall, this is a cozy place with a very familiar way of serving customers here.  Highly recommend for delicious food at a very reasonable price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "oF8Efb3fBrwWZvmsl6e-pw"
  },
  "zlCmCv9PmqoA0WJp0Df_5g": {
    "date": "4/22/2014",
    "text": "States that they take reservations, they do not.  Wanted to bring a large group of 16 here for dinner and the manager could care less.  Hello Armstrong's Italian restaurant which is just as good and also nearby.  SMH, that business owners would be willing to turn away business like that.  4 families will now never recommend this place to their friends and family.",
    "rating": 1,
    "rated": {
      "funny": 8,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "HhJuPNZhnrEvjTvbZ4MKgw"
  },
  "tb9cXT11iR-nYRuuyRFALA": {
    "date": "1/20/2012",
    "text": "Great place for a casual date. It had a limited menu, which frankly I appreciate. I got linguine with clam sauce, my boyfriend got spaghetti with mushroom sauce. Service was prompt and friendly, if a bit impersonal.   We'd both been expecting a white mushroom sauce, but it was basic marinara with mushrooms. Still tasty, but not what was expected. However, the clam sauce was just so outstanding that it more then makes up for it. Tons of clams, garlicky and flavorful without being oily. We both ate our fill and had plenty of leftovers to enjoy later. Will definitely be returning!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ks8PDwnZ_lZTzCQkfAN0HQ"
  },
  "hrRQqi5WiXXp8651VZZEMg": {
    "date": "11/28/2014",
    "text": "The food here is very consistent. It's alright, but just be prepared to wait. A. Long. Time. Not sure how to emphasizzzzze this, but it will take you longer than you can possibly imagine to get your food. The home made stuff on the menu, like the ravioli is very good. I am personally not that fond of the fontinella cheese. I would say it tasted a bit oily and plastic-like.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3z1EttCePzDn9OZbudD5VA"
  },
  "H0dUpR8ck9HRIhNc37vdMw": {
    "date": "12/19/2013",
    "text": "Great food and good prices... Quality Italian food and great atmosphere.  If you want authentic Italian food then this is the kind of place you want to go!  Not a chain Italian  restaurant",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SPPieDvwnkvQoI7lj5vFYg"
  },
  "GUr3OGKKGIUqH-pSOrG8Mw": {
    "date": "7/15/2015",
    "text": "Came for a late lunch on our way to the airport. Staff was very friendly. Wedding soup was amazing. Lasagna was very good. Highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "b9WqGaksfz7KpvcDwqXMxQ"
  },
  "NiZ7VOzLZfggrlEzHFFRhw": {
    "date": "2/23/2009",
    "text": "I liked this place!    The instant i walked through the door, I could sense the patrons had painted me as a non-local.  I realized that I was probably the only person in the place without some sort of Pittsburgh sports team clothing or hat.  My septuagenarian waitress spoke to me VERY LOUDLY, as she mentioned her hearing was gone.  As such, I place my order in a VERY LOUD manner  My salad was very traditional Italian, as well as the broccoli penne.    Very no-nonsense Italian, and I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NCMpvGQ4wsfEFoqtFLkBoA"
  },
  "u_5baKQzfQnDGiGK43a_YA": {
    "date": "12/11/2014",
    "text": "Great experience both times we were there after a trip to the Meadows and another to Cabela's.  Spaghetti both times, amazing meatballs and nice atmosphere.  Nothing to look at but great Italian food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mm7yBLE4GXYEdDOcm-AyGQ"
  },
  "Jaad-4UyGRffwtdxbFn-qQ": {
    "date": "2/21/2012",
    "text": "Was staying nearby and wanted something local for dinner. Knew of a couple other places but decided to try this one. Good choice. All four of us had pasta dishes. They don't come with salad, so we ordered a large antipasto. Nice fresh greens, great roasted peppers, fair amount of meats and cheeses. The pasta was well prepared. Sauces were very good. Gnocchi was not doughy or starchy. Good meatballs and sausage. Arrabiata was SPICY, which suited me just fine (usually I have to ask for hot pepper flakes - not here!). Pasta with broccoli and oil/garlic was very good. Not cheap, but not overpriced. Decent portions. Service was fine - it was a Saturday night and several parties hit at once. The kitchen was stressed, but it wasn't a long wait for the food. Pasta is prepared to order. Would definitely go again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XSmFdk6FKL88oaNu2qGaiA"
  },
  "cb-dwoccF2qHcxActK4rxg": {
    "date": "4/26/2015",
    "text": "best chicken parm i have ever had. got takeout on a friday night. ordered the chicken parm, chicken cacciatore, and broccoli with oil. The chicken parm didn't have too much breading on it like other Italian restaurants and had the right sauce-cheese-chicken ratio. The chicken cacciatore had great spice and was made with delicious mushrooms and peppers. The broccoli was by far the best broccoli i have ever had. The only downside was that they took about 45 minutes to prepare the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-U15_H7--5srCNXgd1MEiQ"
  },
  "mj3ncqUicbvkHZ3m--X-zw": {
    "date": "3/15/2011",
    "text": "My favorite restaurant in Coraopolis.  Love the Food!  Sam, Michelle, Kathy and everyone there  always give great service .. I recommend this restaurant to everyone all the time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6T1diLeP7RGhia47zlGTCw"
  },
  "ycQpp0f8Q1ktC859YVOFCg": {
    "date": "4/24/2018",
    "text": "Stoppped for lunch. Great local place with good service. Large portions, good American Italian at a good price.   We would stop agian",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uTfAtovuZKCdwj7XHb4zdg"
  },
  "Vvk3Mmn4tSVAO5-qr0TVQw": {
    "date": "6/24/2018",
    "text": "I lived the first 15 years of my life in Moon Twp., but during that time I never ate at Segneri's. I'm now 41, and was up there visiting from Louisiana, and needed a local place to eat before heading to the airport to return home. Segneri's was my choice, and it was the perfect one. I absolutely loved it. The stuffed hot peppers were the best I've ever had, and the penne arrabiatta was delicious, but VERY spicy (remember, I live in Louisiana, so I know spice and heat!) My buddy (who's a local, but also had never eaten at Segneri's) had the hot sausage sandwich and proclaimed it to be some of the best hot sausage he's ever eaten. He said he'll be returning there soon with his wife. An awesome place that I'll definitely return to the next time I'm in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PIgqCpEdt7ijZhYUIt3BYA",
        "caption": "Photo of Segneri's Italian Restaurant - Coraopolis, PA, United States. Penne arrabbiata - spicy!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PIgqCpEdt7ijZhYUIt3BYA/o.jpg"
      },
      {
        "img_id": "STd1yKLvrzGAhSNdLaBXMg",
        "caption": "Photo of Segneri's Italian Restaurant - Coraopolis, PA, United States. Hot sausage sub - my friend said it was the best he&amp;#39;s ever had.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/STd1yKLvrzGAhSNdLaBXMg/o.jpg"
      },
      {
        "img_id": "ve1huSEO9DLSixsqixXEDA",
        "caption": "Photo of Segneri's Italian Restaurant - Coraopolis, PA, United States. Stuffed banana peppers - best I&amp;#39;ve ever had",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ve1huSEO9DLSixsqixXEDA/o.jpg"
      }
    ],
    "user_id": "nVN20tunCTGzxSXrhD9K6Q"
  },
  "7pf4z1LZYN3R9-cn9ELO5Q": {
    "date": "12/17/2018",
    "text": "What a charming little Italian spot! Everything you would expect from a mom and pop establishment. We started off with wedding soup and the banana peppers. Both were delicious. Both came out very quickly. The sever was very sweet. My tossed salad was fantastic. It was perfectly dressed and seasoned. They don't seem to have a tap system so all beer and soda is bottled / canned. Our entrees took over 40 minutes to come out because the server forgot to put the ticket in. They seemed a bit short staffed. She apologized with cannolis so I was ok with it. The chicken parmigiana was definitely worth the 40 minute wait. The cannolis get two thumbs up!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vCMLDTmNQJTshp0buV1JaA"
  },
  "x0KO0VI6h3mUUfGegf7qGA": {
    "date": "10/31/2018",
    "text": "Visiting from out of town and chose this restaurant for some comfort food. The menu is limited, so is the bar, limited and only basic wine selection. Food was is okay. No ambiance to speak of. Prices are good. This place is okay for basic Italian food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ExW1Mo5JmluVwHQmI-HSTA"
  },
  "A2tXsXRUAfEuhsGG4Y3Saw": {
    "date": "12/27/2018",
    "text": "Great down to earth Italian food. Nothing fancy, but tasty with good sauce on the pasta. Love the wedding soup.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TQI7J7Tv_m5xtgdmZqrCYA"
  },
  "8L-Hq9giAprVlnCPp-A1YA": {
    "date": "4/9/2018",
    "text": "Ate here the other night haven't been here for years. I had the Italian Hoagie and there were other assorted Munchies .  Will definitely make a Return Trip in the Near Future",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UFluJsfDeBb0jBbZLF3cbg"
  },
  "tyocAeXfcT8mpHmQ7jizCA": {
    "date": "6/29/2018",
    "text": "Why the $$?  I would put this as a very reasonably priced place.  I grew up across the river and remain friends with two of my classmates from way too many years later. They were getting together for lunch and when I saw the menu, I made the 186 miles one way trip. I ordered the chicken parm sandwich at the recommendation of the waitress.  Husband got grilled hot sausage.  One friend got spaghetti and meatball, the other friend stuffed shells.  Husband and I shared our sandwiches with each other.  Yum.  And I was salivating over my friends' choices.  We were reminiscing and enjoying ourselves and time got away.  It was after 2 and they close at 2 and open up again later for dinner.  But they gave no indication that we should leave and we felt bad when we saw it was 2:17.  This is a wonderful find.  Huge portions and worth every penny.  My friends had spumoni  for dessert and ice cream aficionados that they are declared it the \"good stuff\".  Husband and I split a cannoli.  I will gladly drive into the Burgh for another meal here.  You lucky Pittsburghers.  If I lived here, I will be here on a regular basis.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bFhi7iyR7b-7sNmlWqTc5A"
  },
  "eioUFyLrO8iYYuGuikC8BA": {
    "date": "4/21/2018",
    "text": "Was in the area for business, and decided to stop at this place based on Yelp reviews.  I had lived in Pittsburgh for 10 years before leaving in 1998. The city has changed tremendously, mostly for the better, but this place personifies the old school things I remember best about the city -- local, family owned Italian food joint that is part of the neighborhood and doesn't put on pretenses.  Every neighborhood used to be full of them but many have been squeezed by the chains.  There is a reason this one has survived.    The menu is simple and not extensive, but that means everything they do is done well.  We had fresh bread and attentive service.  Linguine and clams is my benchmark dish at these types of places, and this was outstanding.  Wifey had the straight forward spaghetti and meatballs and still keeps asking me when we can go back to Pittsburgh.  Portions were large enough that we had take home, despite eating to the point of being too full (but you just can't stop).     If I am ever in the area again, I will go out of my way to seek this place out.  If you like simple, fresh, homemade Italian in a homelike atmosphere (as much as a bar can be homelike,-- hey, it's Pittsburgh!), I recommend you do the same.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ySkF9ssilnwu0MSKlDklBw"
  },
  "qWqw5jB-95rMDotns8mZLA": {
    "date": "11/19/2017",
    "text": "Definitely one of our favorite spots for Italian. Always very personable service and the prices are good. Food is always excellent. Portions are typically huge bit not with every dish. The linguini with clam sauce was awesome. We try to get here at least once a month, we don't eat out that often tho.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BPPOfVhrLHPNPUxHfS94gw"
  },
  "skecCqVIXhBxYUG4fMClgQ": {
    "date": "9/9/2018",
    "text": "Love this place! Simple surroundings and friendly staff. It's been a favorite for more than 40 years!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5PUspNAwuz7fZqiEln2F5A"
  },
  "ki-wzOhI_gXjVXWwJuUJfg": {
    "date": "8/28/2018",
    "text": "Wonderful family local Italian place. Staff was very friendly and all 4 of us enjoyed the food and drinks. Portions are huge and quality was excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "brZNtemt33KO9xkR6bu2Fg"
  },
  "VedQOA61OR5kjKhRD8Ir8g": {
    "date": "6/14/2017",
    "text": "Got a to-go order of chicken parm & upgraded to gnocchi which came with bread & a small salad.  Everything was delicious especially the gnocchi.  Enough to share with someone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JwI4KRG3jWolRMlMIik5Lw",
        "caption": "Photo of Segneri's Italian Restaurant - Coraopolis, PA, United States. Chicken parm &amp;amp; gnocchi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JwI4KRG3jWolRMlMIik5Lw/o.jpg"
      }
    ],
    "user_id": "m2uTGkOKcXqQJSmvsYvtMg"
  },
  "GuwNkqcOzUV7VRZ27sk4Cg": {
    "date": "7/12/2017",
    "text": "Lived in Coraopolis briefly about 14 years ago when I discovered Segneri's. Rediscovered them recently on a trip back to the Burgh and to my very pleasant surprise, it's exactly as I left it! Same owners, same place, same decor, and most importantly same food! This is how I remember a typical Pittsburgh Italian restaurant would be before there were national chains. Just local and family owned.  Growing up in an Italian family, I'm very picky about Italian restaurants and rarely go to them (preferring to make my own). When I do, my first question is how they make their linguine with white clam sauce. If it comes with 5 clams in their shells that I have to pick out, you can be sure I won't be back. Segeri's comes with heaps of clams and garlic and parsley as it should.  Call me old fashioned but I love that they haven't changed a bit. There are no vegan options, gluten free items, or lighter fare on their menu (ugh!)...just good traditional Italian food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "C9xqSzTRv7oTXNlgxpJWKQ"
  },
  "Jgfr8OmHMRKnZoXCEH_PVQ": {
    "date": "9/15/2014",
    "text": "Perfect Italian food.  Menu not extensive, they had chicken parm, chicken Cacciatore, lasagna on the daily specials plus a few pastas and sandwiches on the regular menu.  I chose pasta fagioli, chicken Cacciatore, and it came with giant portion of pasta with unbelievable Sauce. The chicken Cacciatore was the best I ever had.  Too full for desert, but the apple pie with cinnamon looked fresh and the people at next table raved about it. Service homey.. Price 14.95 plus beverage cost. I'll be back here every time that I have to visit my nearby work location. Oh, I was the only non-local last night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "aJN3F3bS_ooe4rZx8rHmgA"
  },
  "puJIGm_Q-at5ICYzkkvsdw": {
    "date": "4/5/2018",
    "text": "Truly a local haunt.  Had the grilled hot sausage sandwich w/grilled onions. $5.95.  Plenty for a lunch serving.  No sides are served.  Just the sandwich. Fabulous.  You will get a flavor for the local folk who wander on for a noon bite.  A working person's place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6LiUHVlgMo9Nmz17aprzTA"
  },
  "t_tD_aQC5jS6voUV9I7JAQ": {
    "date": "9/13/2017",
    "text": "Five stars as long as you understand what this place is - and what it isn't...  If you are looking for good homestyle Italian this is your place.  Fresh basket of bread to start.  Meatball, sausage, pasta, sauce all were home runs.   Cannoli's were great as well.  Can't beat price.  Ambiance is what it is for bar/restaurant in coriaopolis and service can be slow....but imho the food and value overshadow these issues.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6aASDuw9SOejVBarYYe2eg"
  },
  "gF_IYu-GXtQTCVlpKTOnKw": {
    "date": "4/25/2017",
    "text": "People in this area are regulars. For many locals this is a sacred family tradition. Closes early. No reservations. Small restaurant. Great Italian food. If you want to eat where the locals eat, try it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6lDy-UzyFM01SG-TKgmL-w"
  },
  "NK6wkKBxvHk0nkkW4yL9BQ": {
    "date": "5/2/2016",
    "text": "Grew up eating here.  I love everything about this place from the warm family friendly atmosphere to the great portions and quality of the food.  The salad dressing is to die for.  Great food and service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kNMtMMIKtiyx1eBnizH3cQ"
  },
  "lzs8I6oBcguFXhUiDmHE7w": {
    "date": "8/8/2017",
    "text": "Nice, old school, old style family Italian restaurant.  Homemade goodness.  Really like their Hot Sausage and Meatball sandwiches.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pc91H_ESc5lAH86lkQGpqw"
  },
  "-pqVjc02kdnSfuu20iX0oQ": {
    "date": "6/11/2016",
    "text": "That's how authentic Italian food should be. Perfectly brief menu with lots of good staples.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kvh5HETL_An3aezT7OAolQ"
  }
}