{
  "g-bZPbwCbRvQupT6cUW4HA": {
    "date": "3/29/2013",
    "text": "I visited this place because my boyfriends father saw an ad on TV for it. Immediately I  thought, Eggs R Us from TV? This sounds odd. It was semi difficult to find because it is located in a strip mall. The place was fairly busy but we helped a server put together two tables and sat down right away. Pretty good for a Saturday am.   I couldn't help but watch the kitchen as I was facing them and they were all moving rather quickly. As I watched plates come out my first thought was, I wonder if those potatoes are bulk frozen potatoes? That's never a good thought when you are about to order.   I decided to go for the breakfast burrito because that was what everyone here on Yelp recommended. I had no idea the thing would be as big as my head. Holy crap! I literally ate 1/4 of it. It was alright, nothing to write home about. Service was okay, dinner was crowded and small.  The thing that bothered me about this place was what I saw going on as I waited for my food. The toast was being made in the masses. I wanted to snap a picture of the toast mountain that was forming at the bottom of the toast roller, but it was right next to the busy servers. We kept talking how we didn't have an appetite for toast because of their bulk pile of white bread that had formed. Then I noticed something that made me want to immediately leave the restaurant. Gross! They were cooking food and putting it in buckets!?! OMG are you serving animals? That's what putting food in buckets reminds me of. I really hope that bucket food was something that burnt and wasn't being used. I never got to confirm. After reading Darren W's review, I think thats how they cook and serve food. Come on, guys! Disgusting. I will not go back.  I think I'll stick to places like Cafe Davio, where I know the food is homemade, and not served in bucket bulk. Gross.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "49SXsLMeH_Py2vC8F9ZHRg"
  },
  "BxSu8a3d8rKSg1P_-cIFhA": {
    "date": "9/16/2015",
    "text": "Eggs-R-Us rocks! Owners are very nice, service is quick and food tastes good with large portions at economically - friendly prices. - Big Jarv, Crafton, PA",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aU-VpDiRjj3ZAkmQy4MsZQ"
  },
  "5udXzNcGkHKDIOaRED_8mw": {
    "date": "9/5/2016",
    "text": "Best coffee in Pittsburgh! Great classic diner feel, great food, definitely a spot with a lot of regulars. The bountiful breakfast is the best on the menu and the omelettes are also really good- should plan on taking home though, they are so big!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nMadF-OjJriNamno2xrbRg"
  },
  "TSR-c-P_A1URw4O4WWPcDw": {
    "date": "8/25/2016",
    "text": "Service is absolutely terrible. Over an hour for breakfast with no refills on drinks. We will never return to this diner again!!!! Food is ok at best!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yS8VTtuo7mirvjE9RPu2wQ"
  },
  "Lwbz0o9jUAbFcLkkMxytpw": {
    "date": "8/21/2016",
    "text": "One of those Mom and Pop diners. The employees were really nice. However, their service was mediocre. They sat us right down, but it took them forever to place our order. Then we didn't get our food until an hour and a half later. No joke. I ordered pancakes, bacon, and their home fried potatoes. The potatoes were really good. The pancakes and bacon were really tough to eat. Definitely wouldnt recommend them for breakfast. My BF liked their fries and bacon burger.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OYhb-f7m0SkRLcBj3tPLQQ"
  },
  "cN7OzTYc8fEKUp4pIdSXLQ": {
    "date": "5/30/2016",
    "text": "Ordered the Bountiful Breakfast and a Savannah Style Grits...potion sizes are large, hash browns, toast, and eggs were good.  The sausage patties had an off-putting taste like the pork was stored beyond its expiration or best-by date.  The grits were dry, stiff and granular instead of the customary  consistency of cream of wheat.  On the positive side, the staff was friendly, and service was good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a-9l7BRysSwMITLQtPHLrw"
  },
  "07xPmUh0-piLywVMFN4vPQ": {
    "date": "2/22/2015",
    "text": "Had. Breakfast. There. The other. Day. It. Was. Okay. Great. Service.       Until  I saw  one of the cooks  with a blue   coat  on. With. Dog hair. All. Over the. Back. Of. Coat. Ewwwwww.  Won't. Go. Back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HvjaLr6OlW10Z-JbDgu_ug"
  },
  "3w_CbLl_s99uHao9NiPeYg": {
    "date": "9/26/2011",
    "text": "This place isn't going to knock  your socks off with the decor or ambiance but the food is good and fast!    The place is normally slammed (esp after church) so you might have to wait a bit for a table.   Pros: Big Portions, Some healthy options available, friendly service even if they are busy, they do have outdoor seating (metal furniture on an uneven sidewalk in the strip mall, again ambiance)   Cons: they will probably be a wait for a table but being busy is actually a good thing, i guess. I know diners aren't frequented for their decor but this place needs a remodel. It can get loud inside because of the open kitchen and close corners.   Overall: I go here at least once every couple of weeks. The food is solid and the service is friendly!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "IKnLl7SbuP0u6HS34jwHhw"
  },
  "-Kx9eR94w8KpREccRa792g": {
    "date": "6/27/2016",
    "text": "Great food, sadly terrible service when they're busy. Tried to call and place an order three times just now. An unhappy lady answered the third time (I waited 5 minutes in between calls). I started with my order and asked for no onions which I don't feel is an odd request. She said when they're busy, no special requests are taken, but she'd check. I could hear her in the background asking the chef if he could do no onions in an order and I could hear him in the background saying \"well, I guess so?\" in a nasty \"why are you being a bother\" tone. At that point, I can do without my order. I'll go to another one of the great pittsburgh breakfast spots where they don't mind answering their phone or making their customer the order they want. It will be a long time until I go back here and definitely won't be when they're \"busy!\"",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EJC00ii4putYlLR9XDov4w"
  },
  "Qfu5bKcSFx9tuhT_leqfqg": {
    "date": "3/24/2015",
    "text": "The best breakfast ever. You can taste the freshness in every bite. Quantity, quality, a ma & pa atmosphere. Sitting & watching the employees you can see they are a team. Great job to all of you.   See you next time we're in Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aqvt2Asez4TyP-8opUQIUw"
  },
  "9ZGddph3SiFVzSfetMRlTg": {
    "date": "10/20/2014",
    "text": "In town for my first Steelers game, this place was great! Awesome and friendly service, great coffee, and you can't beat the prices. I had their almost famous breakfast sandwich, and got a choice of sweet or hot sausage. The hot was nicely spicy and delicious! Classic diner feel, huge portions. When  I'm town I'll definitely stop again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VhMvGkNwDYf8EY2NHZ5TCQ",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. This mammoth burrito is under $7!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VhMvGkNwDYf8EY2NHZ5TCQ/o.jpg"
      }
    ],
    "user_id": "ZZqPOUBcGQ4etpl5oon8Uw"
  },
  "29G_6DHsoDzn4dEhBwMO1A": {
    "date": "5/18/2014",
    "text": "Craving a Sunday brunch, I used Yelp to find a great place that was still open and serving breakfast.  My friend and I decided to head to Eggs-R-Us.  Thanks to reviews, I knew it was a little hard to locate since it's unusual to find a diner in a strip mall. We arrived around 1:30pm and found the dining area about half full so it was easy to seat ourselves.  Eggs-R-Us has an extensive breakfast menu with various options of pancakes, breakfast meats, omelets, and French toast.  I had their country fried steak and poached eggs on toast. My friend had their French toast sandwich with a side of home fries.  Both of us truly enjoyed the food.  I'm from the South and rarely find a True country fried steak with white gravy north of the Mason-Dixon so I was delighted to find the real thing. The portions were generous and they use quality meats. We didn't have pancakes but several of the other diners made that choice and they looked delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oc0mUaIrfaLFN7p_F1uMIw"
  },
  "bW9s1Nw8pdegwdR2kAYAiQ": {
    "date": "12/22/2014",
    "text": "Food is good, however it's rather greasy. It's always busy for breakfast, especially on the weekends. The overall restaurant is dirty, it really needs an upgrade, paint, cleaning, etc. the bathroom is a storage closet for cleaning supplies and it's rather disgusting too stare at dirty dishes in the kitchen when eating.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wx8G6UywWdO4QY4dMmfuEA"
  },
  "uo9RNtSNaGbbcI8B-T8L1g": {
    "date": "5/25/2014",
    "text": "Great place for breakfast. I had a excellent omelette with mushroom, onion, swiss and hot sausage. Toast and a heaping portion of home fries on the side kept me full most of the day. The service was good, I highly recommend Eggs-R-Us.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hj3TPeXpEFZFm5Pe-aoHqg"
  },
  "9TWWYnpOZdQ1RKsKWvwnag": {
    "date": "5/17/2014",
    "text": "Pretty decent local breakfast joint as far as food goes. Nothing out of the ordinary. There is always a huge line to get in the door and is really no standing room. Seating itself is also pretty cramped. In the particular case of this greasy spoon, I'm not too thrilled to look at what's cooking in the open kitchen, but this could have to do with the fact that it is always kind of dark inside and because of that it can look a little dingy. It's not that it really seems unclean or anything. The food always seems to take just a little too long, but when it comes out it's always good. Nothing to write home about though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mNfsL3FzF9zFhfR6TFaAEg"
  },
  "WW0yohJ9SAZ8-Y4V7uPGiQ": {
    "date": "4/6/2016",
    "text": "Positively fantastic. Best omelette I've ever had. Don't let the exterior fool you - this place is excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGE3HC7bglBUWH-9QR7mhA"
  },
  "YPBDY69tAZFn1I5ZkqA8Rw": {
    "date": "5/31/2011",
    "text": "Topologists are still trying to figure out how such a tiny hole in the wall can produce such huge meals. The breakfast burrito is big enough to hide a Fosters oilcan in, the regular-sized pancakes are each the size of four LPs stacked up, and the larger MANcakes are -- well, if you have to ask, you can't eat them.  But size doesn't suffice for a five-star joint like this. The food is so GOOD that you'll arrive at a clean plate soon enough, even when it's piled high (and it will be). Why was I born with two ears and only one stomach? WHY?",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EIt66bYmFr_2kbs5qsL-0Q"
  },
  "6772GXoatvSyVtWMHYgvvQ": {
    "date": "7/17/2015",
    "text": "So dirty....and the owners are very disrespectful to the staff in front of the customers. Unacceptable! Our table felt uncomfortable due to this...food is not worth it,  beware!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "besdNvAM167pIyi4uGT22w"
  },
  "vonruu7q6lO9tKxEqM83aA": {
    "date": "11/1/2011",
    "text": "YUM!  I accidentally ran upon this place when a coworker of mine & I were in a rush for lunch. We were gonna hit the pub in the strip mall, but I saw this at the last minute and we went to the diner instead. I am so glad we did.  I've only ever gotten the omelet but I have no problem with that either. For like $6-7 you get this HUGE omelet filled with meats and vegetables and cheeses. You can get additional meats & cheeses for extra cost, but you get that plus potatoes and toast. It's absolutely ridiculous. And so damn good. I'm usually full through dinner when I eat there for lunch.  My friend once ordered the french toast with bacon and that looked delicious as well. In fact, I tasted the bacon - crispy!  They don't deliver but they do call ahead orders and take out. Since whenever I'm in Pittsburgh I'm at a local hotel eating reheated food, I might have to start taking this place up on that. That is, if I don't make my coworkers offended by eating delicious smelling food in front of them ever day!  I love this place. It's a dive, but it's good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zesQ28ZSEF0P6vueSne0gg"
  },
  "RotzMyXcCltz0b1HMFwo0Q": {
    "date": "8/21/2015",
    "text": "Not impressed. Savannah Grits were good which is why I'm giving 2 stars. Omelette was tasteless...hash browns way too greasy. Service was terrible...waitress never offered to refill coffees and had to ask 3 times for water and had to ask another waitress to find her to get the check.  Too many good places to go for breakfast so first time will be my last.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uLwa2V5vM9m1gqwGL5XWzA"
  },
  "doxbNxh3Y_UYq06Z1_5aBg": {
    "date": "10/26/2011",
    "text": "Have you ever walked into a place and the look of it was so \"dumpy\" or \"divey\" looking? Eggs R Us is that place, so dumpy that it's cool! I love this place!  I found myself on Noblestown Rd to get a loaf of Italian bread across the street and I decided to stop in for coffee. Being a veg, I figured I probably wouldn't be able to get anything there for nourishment. To my surprise they had egg white omelette (I do allow myself yoke free egg substitutes, fat free milk, cheeses, and yogurt) with peppers, onions and tomatoes. I ordered that with wheat toast. It was delicious, void of oils or butter, the vegetables, crisp tender, were an excellent flavor burst for the fluffy egg whites. Even better when I put a little frank's hot sauce on it.  Excellent service, the waitresses where super friendly, eager to please and very  nice. For the omelette, toast and coffee (bottomless cup) my bill came to 8.11, not bad at all. I can see myself stopping by quite often.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IwQVL3UJa_PsGtoBsLcz8Q",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Egg white omelette and wheat toast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IwQVL3UJa_PsGtoBsLcz8Q/o.jpg"
      },
      {
        "img_id": "KEyXbVIjh90nthDmP7tVHA",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KEyXbVIjh90nthDmP7tVHA/o.jpg"
      }
    ],
    "user_id": "UsmTxWbobLsI6WR1Db0W7A"
  },
  "aYA-NGBpykQQpV3ROq6ZfQ": {
    "date": "12/11/2013",
    "text": "I work up the street and order delivery with my coworkers a minimum of 2x a week. The food is always always fresh. The servings are huge. I literally split an omelette 3 ways and its a full breakfast for all.  And on the very rare occasion the driver forgets something? They either offer to bring it back to us or give a credit for next order.   Their breakfast sandwich, omelettes, and burrito are amazing...but try a belly busting bacon cheeseburger. Amazingggg. And with fries under $7.   Many times the owner himself delivers our food, is very friendly. This makes me feel better that this is a hands on business.    I have only eaten in there one time. Yes its small, the grill is right there in the open, and the place gets very crowded. I'm not really a fan of that mels diner type atmosphere,  I prefer delivery at work.   You wont be disappointed if you work or live near here and get breakfast or lunch delivery. Support a local business folks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5RxyZjPA1f14JTj7dY2_zw"
  },
  "HfhDizCOSCeuj14UeAOvKg": {
    "date": "12/28/2014",
    "text": "I forgot to write a review for here.  Just throwing a quick one out.  This food here was amazing, and cheap. Ordered a huge meaty omelette and some home fries for around $7 w/ a coffee.   Negative: The place is tiny and was jam packed not one seat open except at the counter behind the cooks. Was interesting watching their fast pace though and realizing although I love to cook I could never handle working a position like that. Non-stop, bam, bam, bam, pushing food out. Very loud inside. If you are claustrophobic go eat in your car lol. My anxiety level was above average til I received my food and blocked everyone out while enjoying it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mkIt8BaYxqGGhaVHt6BxQA"
  },
  "VfaWeWbKr_CvVhzl_fp-oA": {
    "date": "10/28/2015",
    "text": "The taste of grease resonated thru each bite....  The bacon must have been cooked two maybe three days ago then thrown on the grill to be warmed up.  Food was edible but the part that REALLY turned me off was the guy behind the grill.  He walked outside, stood next to the front door ever 10-15 minutes to have a smoke...  Then walk back inside and continue cooking.  Let's just say I won't be back...!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZpCuJ-tu2PfocS1bl4ChQA"
  },
  "4t-BLg10PWC5H54g9yv15g": {
    "date": "9/10/2015",
    "text": "I thought this place was great, huge portions for amazing prices. However they did mess up my friends orders pretty badly, but it was all delicious!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UaiPgl-P_elvN7BaEkuyUg"
  },
  "o2oKIlMrkJgAKk38jixd0w": {
    "date": "8/24/2015",
    "text": "We ate at this restaurant on a Sunday morning. It was extremely busy. The place is very laid back. The portions are large. Our food took long. It's a greasy spoon so adjust your expectations.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "X_4O5JGCrzNk30gdxJhFng"
  },
  "Yyn4Ez_LsF99qHGl2FUnww": {
    "date": "5/24/2016",
    "text": "Nice little diner. Very nice workers. The Almost Famous Breakfast Sandwich was very good, and HUGE! The bread they use makes the sandwich. The home fries were above average. If I'm out here again, I will be coming back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gLzKd_BcmVjvg6O972dM1A",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Almost Famous Breakfast Sandwich with home fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gLzKd_BcmVjvg6O972dM1A/o.jpg"
      }
    ],
    "user_id": "patuu3vZ70xQ2GiUyhQJzg"
  },
  "EC1ljmowukYyrCIegnYiUQ": {
    "date": "4/1/2011",
    "text": "Good little diner.  Typical little diner except it is in a little strip mall next to the State Store...so kind of hard to find.  Must be Steeler fans...have a terrible towel and the bunny with an easter basket and Steeler gear.  Place was busy, good lunch crowd.  Have about 12 tables and a counter that is split with 4 and 4.  Sat at the counter to watch the cook.  Love to watch the cooks work!  If you order the pancakes, watch out, they are huge...you get two huge pancakes on a large oval plate...and yes...the plates do not match...so cool!   For those more adventurous you can get the Country Fried Steak!  Ordered the Eggs-R-US' Almost Famous Breakfast Sandwich comes on Italian Bread toasted on the grill with melted cheese, a couple of huge thick yummy pieces of bacon (or ham or sausage), a huge scrambled egg.  OH SO GOOD!  Oh Yea, the home fries are good too!  Wait staff kept my cup full and were friendly but very busy.  If you are looking for a good breakfast give it a try...preferred over the infamous P's.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 18,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "HuyNKTaP76khnA6MKpfKOw",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Eggs-R-Us",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HuyNKTaP76khnA6MKpfKOw/o.jpg"
      }
    ],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "Q93jfCjFqIUdizIyLdbS0g": {
    "date": "10/22/2015",
    "text": "Greasy spoon/diner aesthetic in an unassuming strip mall. Portions are big enough to feed an army. Places gets busy but that is only natural in an area devoid of other quality options.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9olpPYmaiCqIgOyLrmT24g"
  },
  "asWlvTVI0d4730maLChdiA": {
    "date": "9/22/2015",
    "text": "By far the best breakfast in our city!!!! The portions are super big for a great price and no matter how busy they get , the waitresses are always friendly and quick! We both order their bacon, egg, potato breakfast and it never disappoints! The cheese eggs are THE BOMB!!!!! My husband and I LOVE THIS PLACE!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LDS0vN3q9Rp0vm2QWVzz0w"
  },
  "vxFk_yobncb_boA05nNseA": {
    "date": "1/8/2014",
    "text": "We used to live so close and so we would order breakfast takeout from there at least once a week...and the food is so consistently yummy!  We moved to Pleasant Hills recently and are in search of a place that compares...so far, no such luck.  The atmosphere is gritty awesomeness...the place is TEENY TINY, and you can expect to walk out with a good stink on you...but, the food is totally worth it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TjGSSS4MlsP0LCNYztvysQ"
  },
  "64LFFhaBK5fSVian1mvfEg": {
    "date": "3/29/2013",
    "text": "Dude. So we were originally going to this breakfast place that was featured on Food Network (I am such a sucker) but the wait was like 2 hours (we are all suckers) and we somehow ended up at this place.   The food was good, the price was probably 1/3 of what you'd pay at a \"brunch\" place, and everywhere I looked, there were people in baseball caps dismantling essentially half of what Old MacDonald's farm could produce in a day.   On top of that, service was fantastic, with the manager/owner coming up to us and giving us an extra bacon, because he felt like we didn't get enough! Yes, you can win my affection with cured pork.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "ULNuvHJFyylqAzdMWRkmxg"
  },
  "11J-HpZ0oJOeg3yfgXbG-w": {
    "date": "1/25/2016",
    "text": "Cute diner with friendly staff and huge portions! Best breakfast burrito in town. Absolute GO TO in the Crafton area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q5PZ0jfjaXg4hc0FevvKdQ"
  },
  "T8thz56RuE5YB51Ghb1fZw": {
    "date": "3/11/2016",
    "text": "My husband and I had a fantastic breakfast here. All the food was so flavorful and cooked to perfection. The serving sizes are very large and we even kept leftovers for later on. Apparently the food smelled irresistible as our dog ate them. I have never been so upset! I'm still thinking about the omelet. We will definitely go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GDJp4QIS_r63sdV1ItabTQ"
  },
  "GIYHI_fJuZOFvJiLC7MXRQ": {
    "date": "10/21/2013",
    "text": "Some friends and I decided to get brunch this Sunday.  We decided on Eggs R Us.  As soon as we walked in we saw a packed diner.  The waitress offered to seat us but told us up front that they had a few call offs and were really behind.  We were in no hurry so we were seated and took our time to chat and hang aht.  0ur drink orders were filled and then we put our order in about 15 min after the last person in our party arrived.  Each of us ordered something different.  I ordered the Western omelet and it was fricken delicious.  The ham is thick slices of what tastes like Christmas ham.  The eggs were fluffy and perfect.  And the veggies tasted fresh and cooked just right.  I am a huge fan of the home fries at ERU.  And once again, they did not disappoint.    We had a long wait, but it seemed like the entire restaurant was sympathetic to the staff who was busting their asses to pick up the slack caused by the call offs.  There were people who didn't want to wait, but they weren't assholes about it, and I credit the very apologetic server who communicated to everyone what they were up against.    0ur food was great.  Simple, unpretentious, plentiful, inexpensive and most importantly DELICI0US!   Eggs R Us is a greasy spoon, ma & pap, locally owned/operated, Pittsburgh gem.  And the Pittsburghers who patiently waited while the kitchen staff, servers, and owner held it together make me proud to call this place home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z4KUUQ9iMX4TqYF9FhwcHA"
  },
  "0lj8zPsxTCDifCMWxSBudA": {
    "date": "11/20/2015",
    "text": "I haven't had many True, not processed complete meals in this area (The Burgh) in a very long time. Everything is Freshly cooked, Serving size are extremely large and the price is right! Ooh the taste..   On point ,Definitely!.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "or8gUbdIyTERkPIBI_xYWA"
  },
  "FPLbJk4aM3RanME9FFnnsA": {
    "date": "9/10/2013",
    "text": "This place is awesome great tastes for low low prices... Can't believe how cheap the price for so much food... A little small so you gotta go real early or on the weekdays when everyone's at work... This places food is so good words can't tell..  It's a little small so big groups are problems... It's child friendly... But a little loud because of the close quarters..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-h4nHEPASpo_vL5cUvdQxA"
  },
  "DjGTW0PH8SIb3X7ayOGQOA": {
    "date": "5/15/2012",
    "text": "Kay and I came here for breakfast Sunday morning, and I'm really torn over whether or not to give them a 3 or a 4-star rating. To me it was certainly not 5-star worthy, but everything we had was acceptable.   Perhaps it's because my hash browns came frozen from a cardboard box or because the pancakes looked and tasted to have originated from powder or because the corned beef hash was scooped from a bucket and just seemed and tasted to be a bit pre-fabricated.   Hey, my chocolate chip pancake was edible albeit somewhat...elastic? I kept thinking of stretchy foam rubber even though I relished the chocolate chips.  And my Almost Famous Breakfast Sandwich was a simple success. Bookended by two hefty, buttered cuts of toasted bread, and filled with scrambled eggs, American cheese, and sweet sausage, it got my day rolling and was easily the breakfast's zenith.  After I ordered the hash browns, saw that they were storebought, and caught sight of their home fries, I ordered the home fries in addition to the hash browns due to not wanting to be a bother (the two fellows manning the grill were really getting swamped). Sliced thin a la potato chips, some were crispy, some were soft, but all were flavorful, the textural juxtaposition making these mere fried early meal taters more engrossingly appetizing.   As I alluded to earlier, grill work is war. Kay and I sat at the counter, thus getting frontrow seats to all the kitchen drama. Fire! Protein! Melting cheese! Sweat! Hot Oil! Cast Iron Pans! A Blackened Flat Metal Grill! Accusations of \"too much stahndin' arahnd!\" How do people cook in such a confined, narrow space without injury? It was exciting, frightening. I was stressed FOR the beleaguered staff.   Nonetheless, we both found our breakfast to be about as average as that offered by Coraopolis' Eggs 'n At, ERU's spiritual cousin...of sorts. Yeah, come to think of it, a 3 sounds correct.   P.S. The service was cordial and astonishingly agile.   P.P.S. I wanted to snap some pictures, but due to the hectic environment, I thought it might be frowned upon.   P.P.P.S. Be prepared to wait a spell for your food on a Sunday morning. We were lucky to find a pair of stools right away but waited at least a half an hour for our meal.",
    "rating": 3,
    "rated": {
      "funny": 8,
      "useful": 12,
      "cool": 10
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "UKQsuJkw0dlnVQflS0BLnA": {
    "date": "9/5/2016",
    "text": "Best breakfast in Pittsburgh.  Coffee is probably the best breakfast coffee I have had.  The service is great.  Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_hdbOhbODGOMtVOh-veEug"
  },
  "oh1IbuM5kf9ngLpJApuBjA": {
    "date": "1/3/2015",
    "text": "Great breakfast!  Huge portions and less expensive than eat n park. Support local businesses!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vqZCDJ8RpOU6nPJhUWi2jw"
  },
  "SBBztspnyKwuuMpHh11N2g": {
    "date": "11/23/2015",
    "text": "Walked in rather empty we sat ourselves at a dirty table . Waitress came over with out menus threw a wet towel on the table kinda implying for us to wipe it off we ordered our drinks . No menus so I went up to get them . I can back to the table that was located on the right corner of the room gave my coworkers the menu. My coworker announced she was being dropped on we looked above us and there was a pipe dripping from the ceiling. .  The coffee was weak and tasteless. I ordered French toast sandwich. Eggs were cooked perfect bacon a little cold and over cooked tasteless wheat bread. Filthy inside and very mediocre food and the service was lacking. If your coming they town keep going .",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "TYGhXRbfMXN0HhBk2O6DDw"
  },
  "Y34eKvSwLHxLwAOt026DUg": {
    "date": "11/22/2014",
    "text": "My wife and I have loved this place ever since we moved to Crafton over 5 years ago. It is the picture of a greasy spoon diner. Counter and table service. Big portions and decent prices. The waitresses have always been friendly and the owner/cook is nice as well. This place gets packed on the weekends, so be prepared to wait a little while at the door, but it's worth it! The Omelettes and Big Breakfast Burrito seem to be favorites of all the customers as well as myself. The home fried potatoes are a must side for any breakfast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Mx6hLt5GXREQ_6Gez1kC6Q",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Omlette with home fried potatoes and Italian toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Mx6hLt5GXREQ_6Gez1kC6Q/o.jpg"
      },
      {
        "img_id": "i4uxs6VY1u76oAtGqNAgwQ",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Best Greasy Spoon in Pittsburgh!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i4uxs6VY1u76oAtGqNAgwQ/o.jpg"
      }
    ],
    "user_id": "BPfyOyh3zUvWYRTp9ZY5Tw"
  },
  "AMPSTNLgw8IchbbuuX6p1Q": {
    "date": "2/28/2016",
    "text": "ThIs is the cornerstone of a simple diner.  Since the demise of \"Del-kid\" this place keeps creating a super breakfast.  Don't look for crepe's or bagels with lox and all will perfect.   KISS!!  Keep It Super Simple",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eiCghahpbyiupzPV6aElkQ"
  },
  "YYzGJwTD76NTTie2xz7P4g": {
    "date": "12/29/2015",
    "text": "Pretty underrated breakfast spot on the west side. Hard to get a local breakfast spot around here so this spot would probably be good no mater what. I've been here a few times and have enjoyed it every time. The seating is a little bit cramped but it's breakfast so who the heck cares??  Plenty of parking is available in the parking lot out front.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "91koVXu54Y6tIiZKKxVmrw"
  },
  "rRxpeDlLGbshAn77UfOQ-Q": {
    "date": "9/9/2016",
    "text": "Read this - great omelet and great service! Be careful not to drive too fast or you will miss this great place tucked in the corner of the mall. The sign says diner on front. The omelet was huge and you have 5 choices of adds which made this omelet even better for a great deal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ZxQe_ZeUG24aEL1r6gTcA"
  },
  "Zm0oJfDpqnRZ4B1QvdaniA": {
    "date": "8/20/2015",
    "text": "Great little diner. HUGE portions, great price.   I had the Breakfast Burrito. It was packed with potatoes, scrambled eggs, and jalapenos, wrapped in a doughy tortilla, topped with melted cheese and served with tiny sides of sour cream and salsa. If I go back, I'd ask for extra cheese on top and an extra side of salsa. The flavors were simple home cooked goodness and I was full a little over halfway through.   My mom ordered the egg sandwich. Again, it was huge. A big \"paddy\" of eggs and several strips of bacon on thick, fluffy slices of toasted white bread. The bread alone was amazing!  We stayed at the Crowne Plaza 3 min down the road and came here before catching a plane at the airport. Based on other reviews, I was worried about slow service so we budgeted an hour for breakfast and came prepared with our order in mind. No need! At 7am on a Thursday we were the only ones in there! The waitress was attentive and kind. I would say this is a great place to grab breakfast before heading to the airport. We hopped on the interstate and were at the airport 25 min later!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0mrXvAPtpfpsaMY8bsliiA"
  },
  "v-1Lv27LiG56joBb5OYCKQ": {
    "date": "7/31/2017",
    "text": "I'm updating this review in hopes of saving my local breakfast joint. I've been going here for 7 years now, and I've always really enjoyed it. However, over the past year I've noticed a steady decline, that I feel compelled to acknowledge. This place was always a little dingy, in kind of an endearing way, but it's starting to get to the point where it distracts you from your meal. I feel the service has remained pretty consistent, not terrible not great. But the food has also started to become a little suspect. For instance, the burgers used to be fresh beef and our last order were frozen hockey pucks. Don't get me wrong, I still enjoy Eggs r' us, however, I hope the owners start investing more time, energy and resources into their business and resurrect it back to greatness, because if they continue to leave it untouched, this local breakfast Favorite will turn into just another strip mall eye sore.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bleyhN--91eJmPyJpXr9Mw"
  },
  "NUPOL6woahBHtyD2MHogWQ": {
    "date": "2/7/2015",
    "text": "I am always on the hunt for a greasy spoon, type hole in the wall breakfast place.  Eggs r us did not disappoint.  It was seat yourself, and the wait on a Saturday morning was not bad at all. It did take a while to get our food, but it was packed and everything is made to order.  I had the breakfast burrito,  which I am sure will keep me fed all weekend.  It  was so delicious.  The prices are so cheap. Under ten dollars for one person. Friendly staff.  Just a good all around breakfast spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hklG_aGTaBIMjzz0rmvieA",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Oh. Mah. Gah. Holy burrito,  batman.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hklG_aGTaBIMjzz0rmvieA/o.jpg"
      }
    ],
    "user_id": "jtTLwhJW4JDRqUOQUzCOfA"
  },
  "Xg-tK9qoLwecGCcNJxqXIQ": {
    "date": "8/14/2015",
    "text": "Believe the hype. Hands down THE best egg sammich I have ever had! Had to came back here before heading back home. Small diner feeling with a friendly staff. Service isn't lightening fast, most likely due to the non stop stream of customers, but the food more than makes up for it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rZz3YzbmznZ9xX2jRVA7MQ"
  },
  "nIfLNspyyRtj1IcEpGYYIQ": {
    "date": "12/4/2012",
    "text": "One Sunday morning as I was leaving work at 7am and hungry for breakfast, I thought to myself, \"Self, you should finally go to Eggs-R-Us!\"  Sometimes, I must admit, I have the best ideas.  I arrived just before 7:30am and they already had a few patrons at tables.  I was solo so I just took a seat at the counter.  I had been drooling about the breakfast burrito for awhile.  You might even say I have a breakfast burrito addiction.  I ordered mine with the sweet sausage and oh my.....it was everything I dreamed it would be.  Before I even devoured it, I was impressed with size.  Biggest breakfast burrito I've seen yet.  Now I'm not afraid of food in the least.  But about halfway through that burrito I had to take a breath.  At this point the waitress came over and asked me if I wanted a box.  I acted a bit insulted by her assumption that I was unable to finish this burrito in one sitting.  However, shortly after that I started to feel lightheaded.  Then I kind of picked apart what little remained and ate the sausage and a few other bites until I had enough.  Yes, faithful followers, I was just narrowly defeated by the Eggs-R-Us breakfast burrito.  But when I was done it was quite clear that I did not need a to-go box.  All told, my burrito with the meat addition was $8.75.  Not bad when the size is taken into consideration.  That bad boy was stuffed with eggs, cheese, sausage and enough potatoes to serve two people.  Sitting at the counter was also probably not the best idea as I watched several other delicious looking items being made like the mancakes and the breakfast sandwich.  Or maybe it was the best idea because now I have a few reasons to return.  As I left, a gentleman, perhaps the owner, was taking empty boxes outside.  He held the door open for me and personally thanked me as I left.  That sincere appreciation was the best way to end one of the best breakfasts I've had in recent memory.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nqdSgeHZB2P3MEjirCF7UA",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Breakfast Burrito",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nqdSgeHZB2P3MEjirCF7UA/o.jpg"
      }
    ],
    "user_id": "WoKCLSctS7G2547xKcED-Q"
  },
  "ZSkeTaVP3ehbH1vIAXPG_Q": {
    "date": "5/16/2017",
    "text": "Nice breakfast type place. Good food and the young lady servers are on the ball.   But....... dont plan to stop in and have lunch on your 1 hour lunch  break.  Like many of the places in the area , they just cant get the food out of the kitchen or off the grill.  First time 35 min wait. Second time 31 min wait.  No third time planned. A few eggs snd bacon with toast and homefrys is not that difficult.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "c14PAVzMMRjK36FG_NvU1Q"
  },
  "RLWa4C7Ypn58JsukRAKVmQ": {
    "date": "5/31/2016",
    "text": "I'm visiting my girlfriends family and we decided to come to this local breakfast place. It was absolutely terrible. First off, you walk in and you look to your left and see the grill and it was filthy. We continued to walk in and we sat at the booth located all the way in the back and we were able to see the kitchen. Dishes were piled as high as we could see. We just said whatever and we proceeded to order our food and when we got it, it definitely wasn't worth what we paid for. Needless to say, on our next trips to Pennsylvania, we will not be dining at this fine establishment. Just terrible.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CSZlYYJwlIEmS_2-4m8uUw"
  },
  "gjeGnKn5muiz77vYEkIZMw": {
    "date": "9/8/2016",
    "text": "As an outta of towner, I appreciated the Pittsburgh flavor in the food that they serve.  The sausage patty was like 4 inches long and looked like a ground round steak with  a little sweet and heat in it.  The home fries were perfect and unique.  They offered Italian bread for toast and it was thick and good.  The OE eggs were absolutely perfect. The owner described for me their methodology in how they Cook and why they do things a particular way, including their utensils and cooking tools.  Clearly this place has honed their craft.  The food came out fast and the service was great.  No wonder the locals were here for lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FJh1by20A8lch7s7u9UrCw"
  },
  "51NiDsAN3A5mzDsnBaTCdA": {
    "date": "6/10/2016",
    "text": "I can't believe I ate there. It was the dirtiest and filthiest place I ever experienced in my life. But we were starving and I was with a group of people. Our server got them the 1 star, but she needs to find a better place to work for. The owner should be ashamed and the local health department needs to be fired for allowing it.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0QFZBRL4a7XfHY9BdkRHCA"
  },
  "XDlcLv_udXy_sSSv0ktVvg": {
    "date": "5/31/2015",
    "text": "Amazing!!!!! The service was incredible and the entire staff was friendly and attentive. I ordered the big burrito and IT WAS BIG...and incredible. Eggs with home cooked potatoes with peppers and onions were wrapped into a huge tortilla with melted cheese on top, served with sour cream and salsa on the side. I only ate of of it and I was sooo pleased and FULL. The coffee was also great and fresh!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2Rdp5U32JCSciM4cmJ6V_g",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2Rdp5U32JCSciM4cmJ6V_g/o.jpg"
      },
      {
        "img_id": "emTYsGCs_ZO9AMDnrcrKdQ",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/emTYsGCs_ZO9AMDnrcrKdQ/o.jpg"
      },
      {
        "img_id": "lx6nlPIHzhUeOHkrO_ghQg",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lx6nlPIHzhUeOHkrO_ghQg/o.jpg"
      }
    ],
    "user_id": "SVnKmEuEF7AAt-EfqmiNKA"
  },
  "GXcq77g3X_HWoT2m4y97MQ": {
    "date": "5/30/2016",
    "text": "I'd been here many times, and thought it was pretty good as far as breakfast places go.  I would normally rate it at least 4 stars  However, my last trip I took someone specifically because I was raving about their cooked from scratch corned beef hash.    We didn't walk in 5 minutes before they closed.  And after patiently waiting for our server to take our orders after we decided, we were disappointed to find out they were out of the corned beef hash.  A few suggestions:  1. Don't keep it as a regular menu item if you run out of it. Make it a special that you out on the chalk board.  2. If you keep it on the menu, maybe put a disclaimer saying 'while it lasts'. I would be less upset if it said that.  3.  Make enough so you don't run out.  If it's something that runs out, it's not like it's going to go bad.    Other than that and the waits that can occur because the place is so small, it's a good place for a good breakfast at a good price. I'm giving them 2 stars because 1 star would be too punitive, and I can't in good conscience give them 3 because they need a small reprimand.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ePy8DNYiL9fNUKzjjK1CyA"
  },
  "8zi7AcWC2S53anUgfsM-_g": {
    "date": "9/15/2014",
    "text": "We went on a Saturday and at first were a little frustrated about the wait, BUT once we sat down and had some food, we had no regrets.  Simply one of the best breakfasts I've had in awhile! I ordered corn beef hash and eggs, and probably the most flavorful I've had! No salt or pepper or anything needed here!  We will def go back to this place. Plus, I love they have some healthier breakfast options!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m9gbVx5omWOpZMoorxvHQQ"
  },
  "XYaUZ5syIKeloZdILpxpqw": {
    "date": "3/14/2012",
    "text": "Eggs-R-Us definitely is my favorite dinner in the city. I mean, with a name like this why wouldn't it be? Located in what I'd call a rinky-dink place in Green Tree, it's easy to overlook, however, once you go you'll always remember it.  Whenever I have a friend in town, family up or just a friend who is hungry I always try to take them here. They do have a lunch menu, but how can pass up some great diner breakfast dishes when given the chance? Nothing I've had has every disappointed. French toast, amazing. Omelets, wonder. Pancakes, enormous and delicious. Even their Italian bread they serve with their meals is good. Everything is just out of this world. My favorite meal hands-down is their breakfast burrito. Now I don't like to admit this but I have finished one in a single sitting. If you ever order one you will probably judge me. The burrito takes up an entire plate and is filled with all the breakfast goodies you'd imagine. It really could be split into two meals and for like $6.99 who wouldn't love to make two meals out of something?  And as far as service goes I'd never had a bad experience. I know diners get a bad rap for having waitresses with rude attitude and give you bad service, but this really isn't the case. Everyone has always been quite nice and I've always enjoyed my experience there.   Sometimes I feel like I should take a day off of work just to go. It would totally be worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dsX3MiQiTy3OVI8MKn0I4w"
  },
  "os7S2ZP5UGziNktt1-4CRQ": {
    "date": "3/7/2015",
    "text": "My husband and I came here for the first time two weeks ago for breakfast. We love trying new diners and I'm not sure how we've never heard of this place. It was wonderful! Eggs R' Us was easy to find and we had no problems with parking. It was a True diner...you can see all the action. The place was not very big, but there was never a wait (even for a Saturday!) and steady flow of people coming and going. Our waitress was OK. Attentive, but a younger girl who seemed like she'd rather be doing something else. My husband ordered the Breakfast Burrito.  According to him, it was \"really good and cheesy.\" It came with sour cream and salsa. I had the Breakfast Tour (two eggs, choice of two meats: bacon, ham, hot or sweet sausage, one pancake, and Italian toast). Prices were good and the food was fantastic- we'll definitely be going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2U6d0Fx9ALdlm9fha37ckg",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Breakfast burrito...you&amp;#39;ll definitely be full after this one!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2U6d0Fx9ALdlm9fha37ckg/o.jpg"
      },
      {
        "img_id": "vtIJQ_aeIxvzG9cG1kTV7Q",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Breakfast tour! A little bit of everything :)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vtIJQ_aeIxvzG9cG1kTV7Q/o.jpg"
      }
    ],
    "user_id": "dXcbXf1wANDwAdfi8ptW_g"
  },
  "t66Ist_7y7XWo4SEBhfxEA": {
    "date": "5/23/2016",
    "text": "WOW!  Very good food, despite the humble looks!  Highly impressed with my favorite breakfast line-up of eggs, potatoes (had home fries here), bacon, and Italian toast.  You can tell quality when you have exception taste out of \"basic\", common breakfast items!  Bob Evans has been my standard for this breakfast, but Eggs-R-Us just hit it out of the park!  I wasn't sure about the Italian toast when I ordered, but was surprised at how good it was (and holds up to holding the eggs for scooping onto the fork way better than normal toast!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FkEg96WIwHrjNhgLC64J6w"
  },
  "xzrN6Kf8_Zyd_cUIJUGfmQ": {
    "date": "7/12/2018",
    "text": "Not sure how this place passes inspection, it's dirty looking and tired, but.... it was good! Service was a little slow, staff was friendly. Eggs cooked perfect, bacon was generous and crispy. Great breakfast to start my day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zmvoN7jjQ-ZlhIjX3DAP6A"
  },
  "Agza8Ht2s2ZK2Wr-2R1AoQ": {
    "date": "9/4/2016",
    "text": "The breakfast sandwich is a must have!  The perfectly fluffy eggs and thick cut bacon on thee most buttery toastest bread ever!   Accompany the sandwich with a cup (or two) of coffee and it's the perfect way to start your day",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "UxV7mAkRCu0ZNHVwN-cU4Q",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Breakfast sandwich and a side of potatoes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UxV7mAkRCu0ZNHVwN-cU4Q/o.jpg"
      }
    ],
    "user_id": "sX3cvLnOE7z534dNtPAkDQ"
  },
  "BJLDIA877YaeSTwOWK84tQ": {
    "date": "3/18/2017",
    "text": "Best breakfast around. Love the breakfast burrito and the breakfast sandwich. Their lunches are good also. Large portions of everything. You will not leave hungry. I have never had a bad meal. Expect to wait however because the place is very small. It is a little dingy too but clean. The servers always hustle and the food comes out as quick as possible.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "a2LFiJh0Xj8w1iQmtAb8cw",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Basin breakfast sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a2LFiJh0Xj8w1iQmtAb8cw/o.jpg"
      },
      {
        "img_id": "omaS2drurrPadzfAYk3aSQ",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Breakfast burrito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/omaS2drurrPadzfAYk3aSQ/o.jpg"
      },
      {
        "img_id": "eFmeREw_S_NMJyMFDdII_A",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eFmeREw_S_NMJyMFDdII_A/o.jpg"
      }
    ],
    "user_id": "91kobM-jjYrLudkrfIPz3Q"
  },
  "Iegw9LLOvexn3T9AoHXR3Q": {
    "date": "8/18/2018",
    "text": "Loved this place. We highly recommend the famous sandwich and the hash browns were amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2QIQvWEfzhNeBFO4wo8-LQ"
  },
  "wXZlUc0ZwSqHjoqTenW9VA": {
    "date": "12/5/2016",
    "text": "This was by far the worst place I have ever had breakfast at. I'm not sure where the positive ratings came from but stay away.....stay far away! Clean? Oh hell no.....not clean! I hate to leave reviews like this, but it is what it is.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "c6YODkyEKQcPWihmE5HbbA",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/c6YODkyEKQcPWihmE5HbbA/o.jpg"
      },
      {
        "img_id": "7Op6DlyUSXCryojVXrOCbg",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7Op6DlyUSXCryojVXrOCbg/o.jpg"
      },
      {
        "img_id": "rDapMBzPFZIY6sSR66_hxw",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rDapMBzPFZIY6sSR66_hxw/o.jpg"
      }
    ],
    "user_id": "AKqMnr1bEFIZDG_zQzX8sA"
  },
  "DKoqKA2Uu8YQUyE3iDK9Mw": {
    "date": "5/1/2016",
    "text": "This breakfast place doesn't get the attention like some of the others in the area, but it consistently serves up a tasty diner-style breakfast. It's usually bustling inside and crowded as you might expect, but a great menu. I usually get eggs with a meat but when I went this week, I saw and smelled pancakes coming of the grill and wanted to smother my face in them. Maybe when I'm not counting carbs? Anyway, I like this neighborhood place especially if I'm having a breakfast craving and don't want to search for street parking as with some of the other local options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BeTMpRzoxRQWceSLp-6MEA",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Eggs, ham and bacon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BeTMpRzoxRQWceSLp-6MEA/o.jpg"
      }
    ],
    "user_id": "xwecV1wwnA_2oZH0GkpZOw"
  },
  "nsAOvesLanoK3hqp2ogKyw": {
    "date": "12/17/2013",
    "text": "I felt like I was walking into an old man's club. Basically because it was all old men and us four ladies eating breakfast. Apparently old men appreciate a bountiful breakfast, because that's what you get!   The servings are incredible! They're massive, so get ready to eat and maybe not eat again that day! I really wanted just a basic breakfast with all the fixins, so I ordered the Bountiful Breakfast: two eggs, home fries, and sweet sausage. I opted to order a chocolate chip pancake instead of having the Italian toast the breakfast came with because you know... I didn't already have enough food!  Everything was as expected for a greasy spoon diner. Greasy and good. i thought the pancake was delicious with tons of chocolate chips! And at around $8ish bucks this was a steal!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "lzKArtB08HVPRxJDj2LeDQ",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Chocolate Chip Banana Pancake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lzKArtB08HVPRxJDj2LeDQ/o.jpg"
      },
      {
        "img_id": "UelzCjxy5yYYS2o0qW2IqQ",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UelzCjxy5yYYS2o0qW2IqQ/o.jpg"
      }
    ],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "WuuhPP06qSg_uvpvfbkKGw": {
    "date": "3/8/2019",
    "text": "I have Yelp to read reviews. That's it. But I just gotta write one on this place. Sat at the breakfast bar and could immediately tell the employees were in panic. 4 total individuals working in this place shoulda been able to handle the crowd for an 11 o'clock lunch. Ordered biscuits and gravy, two eggs over easy. Waited 25 minutes until I saw the guy working the griddle throw two eggs on for over easy. He plated them. They sat there for 10 minutes until he noticed them still sitting there, alone, with no biscuits to keep them company or gravy to blanket them with warmth. Apparently somebody else was responsible for the rest of my food. Coulda been the nice lady trying to separate the check of a 6 person table as an enormous dude yells out to her how they should be separated. Or it coulda been the enormous dude. I dunno, I certainly don't think they knew either. The griddle cooked- annoyed-threw them out, I walked out. Stay away unless you've got time or want to be slightly entertained.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RXxV-UqgUhFOsmsY7OXtnQ"
  },
  "_dBeM4Wv7Tjuw1MApOtPcQ": {
    "date": "2/2/2017",
    "text": "Mad love. This is literally everything I want from a breakfast place. Good food. Good service. Super Pittsburgh. I love it.  I have been here multiple times and every thing I've had has been fresh and delicious. These guys know breakfast. Service is fast and friendly. They know their regulars well but everyone is treated well. Never an empty cup of coffee here. The prices are quite reasonable. It's a wonderful spot to meet a few friends (and I do say few. It's a little small so a big group would be tight) and catch up over some coffee and grub.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qb0ZfVOe33QVjNHGoGBabg"
  },
  "YV4Ypak6VnTMIJo2H6IgfA": {
    "date": "9/17/2015",
    "text": "I visited Eggs-R-Us for Sun. brunch this past weekend.  My friend and I were in this part of town to hit Antney's, but we wanted to put some real food in our stomachs before indulging in ice cream.  Eggs-R-Us was the closest place I had bookmarked, so we decided to check it out.  Note that it's a bit hard to find--it's right next to the liquor store in the shopping plaza.  Upon walking in, most of the tables were occupied, and the ones that weren't needed to be cleared.  Since nobody greeted us, we went to seat ourselves at a table that was being cleared.  At that point, we were given menus and our order was taken fairly quickly.  However, our order took longer than I expected to prepare (about 30 min.)--to the point that I asked the waitstaff after 20 min. if the cooks had our order.  When our food finally came out, my order was incorrect.  I ordered the almost famous breakfast sandwich with home fries ($5.79), but it came with hash browns, instead.  I pointed this out to the waitress, and, fortunately, she quickly rectified it.  The breakfast sandwich was about what I'd expect at a diner, which is fine--except that the eggs were folded unevenly so that part of the sandwich was full of them and part of it had almost none.  The home fries were underseasoned and underwhelming, but the mistaken order of hash browns was much better, so be sure to get hash browns when given the choice.  My friend ordered the bountiful breakfast with hash browns minus the toast ($5.99), and was satisfied with its quality.  Overall, my visit to Eggs-R-Us was so-so.  The food, for the most part, was fine, but I was underwhelmed by the service.  In addition to the slowness of order fulfillment and the dirty tables, I had to ask another waitress to refill my water.  I get that Sun. afternoon is a busy time, but getting food out in a reasonable time frame and filling waters a couple of times are basic service expectations.  I wouldn't go out of my way to return, esp. given that I live in the city near the Bloomfield Sandwich Shop, which offers similar food and ambiance with *way* better service.  It is a convenient stop if you need a meal before hitting Antney's, though.",
    "rating": 3,
    "rated": {
      "funny": 10,
      "useful": 12,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "zYuX4jwPG283NAr_1G51UQ",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Almost famous breakfast sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zYuX4jwPG283NAr_1G51UQ/o.jpg"
      },
      {
        "img_id": "lCZLA05ilx43XNSnIAvmBw",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Bountiful breakfast minus the toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lCZLA05ilx43XNSnIAvmBw/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "_XNDppqillYbEcu8f9NeVA": {
    "date": "9/25/2017",
    "text": "Ive been going here off and on for a few years now. I'll start by saying the food here is great! Its not the type of place that most will frequent everyday because it is a tad pricey but as far as Diner Breakfast goes it is fantastic. The fresh Italian Sausage and the thick Italian toast really take it to the next level! Always quick service even when it gets busy.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6ouQxISJLIBfUlN-5VCphQ"
  },
  "aVWbRuUq6Mdiusqi2y5Wmw": {
    "date": "10/18/2016",
    "text": "OMG I love this place. It's truly one of the rare things I miss about living out of the city. My office was down the street so I quite often had breakfast here. One of the best greasy spoons around. Oh I'd love for them to open another location closer to Bloomfield. They'd rival any city diner for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "pzlIVqdt7clXk9ecNJAyfw": {
    "date": "6/6/2018",
    "text": "The food was like eating at home wonderful. Server all working hard and helpful.I'm here from California on vacation and I'm glad that I stopped in very good experience. When I come back to Pittsburgh I'll definitely stop back in here again I recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nAEH4YkmHIggEbb9biAYNw"
  },
  "CPUWRp6rPnJ1w6alJ_JRcA": {
    "date": "6/30/2017",
    "text": "My husband and I found this little jewel of a spot on Yelp. They did not disappoint. The food was so good and didn't break The bank. Portion size was great. My husband loved his omelet! The waitstaff were friendly. Four stars because the place is really small and service was slow. Great mom and pop stop!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "mMynr_ck3XFQiZeXAu1g1A"
  },
  "9kn8Wpa1ubczvCQtmroVXQ": {
    "date": "6/23/2017",
    "text": "If it had the best breakfast I did not see this. Door handle was filithy. The floor was sticky. And I know its a family run business but you need to have your place clean. I walk two steps in and two out.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "gCwpec7LTAustCcoC-BSAg"
  },
  "teTVP-iT2LiF7qiP_vnMjA": {
    "date": "6/26/2015",
    "text": "Generous portions indeed! Our meals were delicious and prices were awesome - big portions, small prices! Downside the place wasn't kept well, floors looked like they haven't been swept/mopped for a while. Tables weren't the cleanest either and our server wasn't too pleasant, she was not friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U0-VOoNN7ORuGQe8o77RCw",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Build Your Own Omelette",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/U0-VOoNN7ORuGQe8o77RCw/o.jpg"
      }
    ],
    "user_id": "RzFVxelbI6GobapXq4Vbhw"
  },
  "V6EQU_zTB7N0HXeklWxYjw": {
    "date": "4/6/2018",
    "text": "Stopped in for breakfast after reading the reviews. Food is four stars.  Cleanliness is one star.  I had oatmeal and a side of corned beef hash.  The Hash was enough for two people and a nice heaping bowl of oats.  Good coffee too. Really nice, friendly folks too.  I'd like too see them devote some evening hours with a few buckets of Simple Green or TSP solution and a scrub brush to degrease the place. Then invest in five gallons of fresh paint for the walls. A few hours of sweat equity and $500 would make this place more \"appetizing. I guess it does keep the pretentious hipsters away though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6LiUHVlgMo9Nmz17aprzTA"
  },
  "rTuApINK_NWTrlu-y7XzZg": {
    "date": "5/3/2018",
    "text": "I ordered catering from Eggs R Us and the experience was horrible. The card I used was not my personal card to pay for the order, it was a company card. When I places the order I provided the CC # and expiration date. A few hours later, I received a missed call from Eggs R Us without a voicemail I call them back and they inform me they wrote down the CC # wrong. I had to call them back with the # as it was a company card. The next day, I receive another call from them advising they did not have the right expiration date on the card. At this point, I decided to just bring the card with me when picking up the order. They did apologize for the inconvenience. When I went to pick up the food I stood around for about 5 minutes before someone asked what they could help me with. Granted, there was a grease fire (with guests still sitting in the restaurant) I've never seen such unprofessionalism at a company before. Waitresses were running around, swearing, causing a scene. I understand everyone was upset about the fire, but you still need to run a business. After about 15-20 minutes I got my order without the drinks that were included. Th waitress stated we're not included with the catering order. I was advised on the phone call it was included. She then asked her manager if it was included, and he stated yes. She informed me that they did not have any juice and they would need to go get it. At this point, I was very frustrated and went to go get my own juice. The food was not the best, not terrible either, but based on service I will NEVER be going back to this place",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ak0iy2j7RQ_LQMmDM8HNEA"
  },
  "c2dnVp8faJCySYnj_nU7TA": {
    "date": "11/8/2016",
    "text": "The food is great!  It's a shame that I won't be returning ever again! While sitting with my 7yr old grandson, waiting for our food, the busboy(man) leaned into my ear and whispered something completely inappropriate. I should of walked out at that point. I was stunned!  It's not a family appropriate place!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6XcdoByO4Cdt7Sz_hFQFJA"
  },
  "UHJ_pgL7l1ConxMXVtgdnw": {
    "date": "12/23/2017",
    "text": "They need to update the menu and prices on yelp. After ordering take out, I was told the prices were outdated here on this app. Which was little frustrating",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5KBmyrYcJgk9_jy224aHpA"
  },
  "nCbboGSBP3xNAe-slpE_9w": {
    "date": "7/20/2019",
    "text": "Best waffle and French toast but my favorite is breakfast tour. If you have never been you should try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v1nluKXXYmYSREULUjmqWg",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. The best restauant for breakfast in Pennsylvania",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/v1nluKXXYmYSREULUjmqWg/o.jpg"
      },
      {
        "img_id": "JPXx2aGYU3xHLWI_KnHWHQ",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JPXx2aGYU3xHLWI_KnHWHQ/o.jpg"
      }
    ],
    "user_id": "lMI9sj4-g0ZZCAS0ySdkIg"
  },
  "_04Xw4ZRpBzFi1P8rDTRig": {
    "date": "10/28/2017",
    "text": "We love coming here for breakfast on the weekends or if we are lucky enough to have a day off during the week. This review is an updated one from the last time. We came here on a Friday morning and there were plenty of open seats. We sat down and immediately we had a server. She brought us our drinks and we were ready to order. We ordered our usual omelette and shrimp with grits.  We usually get these when we do not have a lot of time. We waited about maybe 15 minutes and our food was hot and in front of us. Everything was cooked to perfection. We enjoyed the meal and we were in and out. If you have not given this restaurant a try , you are missing out !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zbuN5ZNnWHBaK6X5Vw0aQA",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Shrimp and grits.  Low Country Plate To be exact..",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zbuN5ZNnWHBaK6X5Vw0aQA/o.jpg"
      }
    ],
    "user_id": "AKMRMIIPSHzp4KD76Z9Tgw"
  },
  "LPKKfG3Fp_Npr5QE7BunaA": {
    "date": "2/6/2019",
    "text": "My new favorite breakfast diner!  I had difficulty finding the eatery as my GPS said I was there... it's a very small location in a strip mall so watch for it. I sat at the bar as the booths were full but was comfortable watching food being ordered and great conversation with the friendly waitresses. I received coffee almost immediately and it was delicious. I then ordered pancakes and crispy bacon. The atmosphere is very relaxed and the patrons were young to old. The diner is a little 'tired' but clean enough. The pancakes are HUGE and flavorful -- Holy moses glad there were only two!  The syrup had a hint of honey and was also very tasty. The bacon was prepared perfectly and had great flavor. I recommend you stop in for a bite to eat. I enjoyed my visit and plan to stop in when I'm in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dXfft5l0z6j5QTW_ij8K_Q",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dXfft5l0z6j5QTW_ij8K_Q/o.jpg"
      },
      {
        "img_id": "esTb_6_BCrt-_dzfJ1CQ6Q",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/esTb_6_BCrt-_dzfJ1CQ6Q/o.jpg"
      },
      {
        "img_id": "HvPCvQ4ROeoHtHuXHcU2mg",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HvPCvQ4ROeoHtHuXHcU2mg/o.jpg"
      }
    ],
    "user_id": "qp1nGNEFB98UpMEppL4vwQ"
  },
  "IG5pKkj8rGgUc-3nQV8g5A": {
    "date": "2/7/2018",
    "text": "First off, let me say how happy I am to live so close to such a gem of a place. Eggs-R-Us is not your typical diner, but it has a unique Pittsburgh charm that is sure to have you coming back time and time again.  When I moved to Crafton, not going to lie, I thought the name Eggs-R-Us was hilarious. The name is very fitting for a place with breakfast as good as this place's though! The first time my boyfriend and I ate here we ordered takeout for a lazy morning at home. I got the French toast breakfast sandwich with sweet sausage, and my boyfriend got the country fried steak. Both of these portions were huge and the taste was amazing. The breakfast sandwich was basic but it was everything you wanted in a breakfast meal. I'm a big advocate of sweet and salty foods, and the sweet French toast paired with the sausage was out of this world. He loved his country fried steak as well, but he vowed to get a breakfast sandwich next time we visited Eggs.  My boyfriend's birthday was this week and we decided that part of a perfect birthday morning is a great breakfast. We decided on Eggs-R-Us without much hesitation and this time we wanted to dine in. We were seated immediately and it was right around 12PM and wasn't very busy. Our waitress gave us our coffee and took our order at the speed of light. He stayed True to his word and ordered the breakfast sandwich and I got the breakfast burrito. Burritos and breakfast foods are separately among my favorite foods, so when they are combined it's game over. The burrito came with potatoes, peppers, onions, eggs, and a ton of cheese. I opted out of adding a meat to mine and it was still almost the size of my head. Not sure anyone could finish one of these mammoth burritos in one sitting, but I gave it my best shot and still ended up with a takeout box with a full serving of burrito left. I'm not complaining by any means about it, and in fact my boyfriend ate a big portion of it, too.  The light blue interior and Steelers decor may be eyesores to some, but it made me feel right at home. The staff was extremely friendly, food was great, and the price was nothing to complain about. Super A+ for Eggs-R-Us!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "IcjZiETEDVnkiSWDSk43hA",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Breakfast burrito! They weren&amp;#39;t lying when they said it was massive",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IcjZiETEDVnkiSWDSk43hA/o.jpg"
      }
    ],
    "user_id": "1VVHf1BvtGC0aSCCIjQyiA"
  },
  "uHc5GI89N8NjlG9NMQlr5A": {
    "date": "12/10/2018",
    "text": "First time tying this place today. Walked in and it was just a small diner. I told our waitress it was our first time and she gave us the run down on which food is popular and gave us some suggestions. Very polite and awesome waitress. Our food arrived quickly and was really delicious. Pricing is great. Really liked this restaurant will be going back in the future !",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "q3kq8Tx9wdCUfOexGQtAEQ"
  },
  "UPEgU3sdhg4q8zTS-tmthw": {
    "date": "7/7/2018",
    "text": "Nice service, people were very friendly. But the food tasted just not right... I ordered Waffle amd scrambled eggs, the waffle had a salty flavor gor some reason..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zdo-fgxcyemV7jBbSQj9sA"
  },
  "xp8LOHjLnjmNP_6mdDsbyQ": {
    "date": "5/30/2019",
    "text": "Stopped by before our road trip back home, the server was kind and the portions were huge. The coffee wasn't as good as usual diners but they made up for it with their giant breakfast. The prices are great and the food was delivered fast. It's in an outdoor strip mall so keep your eyes peeled for it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "giEfWRPmaBQi0GnkZUl81w"
  },
  "OvAjA91hNzgppCQnymleqw": {
    "date": "11/4/2018",
    "text": "I would not recommend this place to anyone..cheap decent breakfast but after what I witnessed I will never patron this place ever again..microwaved a burrito for 5 minutes. One of the cooks was handling already prepared food with no gloves the whole entire 15 mins we were there. We left!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BQJp0zg-3vW69opTYMBRZA"
  },
  "TAH4fOnGPSn5vGbes5tWpA": {
    "date": "2/15/2018",
    "text": "Really good food big portions. Nice people, they have not yet to mess up an order.  Check on you if you need anything or refills. Great service and Good for family and Friends.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "m5CAH0LQGhILFu-BC9bi5A",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m5CAH0LQGhILFu-BC9bi5A/o.jpg"
      }
    ],
    "user_id": "js0n4T5zEih004UPDj1umw"
  },
  "fB6JGbyNSGIqIDn8GrIjAA": {
    "date": "10/1/2018",
    "text": "I was looking forward to it since there was soo many good reviews, however I was very disappointed with the food and service. Waitress didn't check on us two parties that arrived after the three of us received their food before us and by the time our food was brought it was warm-cold. Very disappointed-maybe today wasn't their day.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IDeXynZknpk3T0-PVS8KLA"
  },
  "sHMVJuC-Od1r4oc_56BbAQ": {
    "date": "2/23/2019",
    "text": "Went back and the service was much better. Chocolate chip pancakes w bananas were great, but I wish they had whipped cream. The side of hot sausage is a must and the prices are cheap for the portion sizes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "Pzg2KimLJIDI6L-K1cg52w": {
    "date": "6/29/2018",
    "text": "Really outstanding food, I personally like the sausage, and the pancakes.  Being a diabetic I appreciate always having sugar free syrup available.  If they were 24 hour, they would have even more of my money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LGXlkLvjylax593u-evS7w"
  },
  "4CeQwEA_LpwrHvtmMd8HRA": {
    "date": "12/15/2018",
    "text": "My son and I are in town for the Steeler game. Walked to this little diner. It was a 25 minute walk and worth every minute we walked. My son had the pancakes (largest pancakes ever). I had a bit of everything. It was deeeeelish! It was busy too.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ydsBGkL3TPS_WVlIfqFY7Q"
  },
  "B2djIXBtt1h7VKAB96P2Ng": {
    "date": "6/16/2018",
    "text": "I'm all for a charming dive, but this place... we felt like we didn't belong there. Yes the food was cheap. Yes the portions were ample. None of that matters if you don't feel comfortable eating the food. I've been coast to coast and I have rarely been steered wrong by Yelp. This place was the exception.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jbs1r1ecOhEKVReuqKvD8w"
  },
  "oiq1CAT9FQdufNRIAcPMOw": {
    "date": "1/8/2017",
    "text": "No frills and thrills. Literally a hole in the wall dinner. Dirty, old, run down. Amazing food! Piping hot! Soooooo good! Pancakes were the size of the plates and thick! The toast was to perfection with an abundant amount of butter. Eggs were perfect. Sausage was spicy and authentic. Not boring store bought. Ham was thick and seasoned perfect! Absolutely best breakfast I've had in a long time!!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7HxN_J9KPqqsAAKE59atmg",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7HxN_J9KPqqsAAKE59atmg/o.jpg"
      },
      {
        "img_id": "gIsVg9nxXD033srC9dLrYA",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gIsVg9nxXD033srC9dLrYA/o.jpg"
      }
    ],
    "user_id": "_-yFnMPrRqMqc07SeIBDDg"
  },
  "6Q0Em7esk6lCYl12903wUA": {
    "date": "11/2/2017",
    "text": "The atmosphere is very homey. Loved the small town feel of the classic diner. This place is amazing and family owned. The meals are melt in your mouth delicious. As you can see the breakfast burrito is HUGE!! Plan on eating there again tomorrow while on this trip for work.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5Oh3qERT5fzcT9rsMUirXw",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5Oh3qERT5fzcT9rsMUirXw/o.jpg"
      }
    ],
    "user_id": "LKIeaY48ovXozDqr3b_FAA"
  },
  "x5b9pyH0FzeA8JHOzNcG_g": {
    "date": "4/27/2018",
    "text": "Great find thanks to Yelp!!  Small little local place looks like the typical dive diner....the best kind!! The plates were full and the prices low. My scrambled eggs were PERFECT!!!  Staff was nice and kept the coffee coming. Will definitely add to our list of top breakfast choices when in the Burgh!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "b7mgKLxg3t_X_YQXL9azvg"
  },
  "PaEIxIWnGk1-64kjSpz-SA": {
    "date": "9/17/2017",
    "text": "Definitely a greasy spoon diner, with not that great service. But with that said, the food was good and so was the coffee. I ordered an omelet with ham, spinach and cheddar. It was huge and filled with cheese. The ham was grilled nicely and the spinach tasted really fresh. My wife ordered poached eggs well done, and they came out perfectly. That may sound simple enough, but trust me, many a place have messed them up in the past. The one complaint would be the bread wasn't homemade or fresh. It was just store bought. That was fine for the Italian, which was Cellone's and very good. But my wife's raisin was bland and as she said \"not even worth eating.\"",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "86pgyTAcILzHen9C5zCerg",
        "caption": "Photo of Eggs-R-Us - Pittsburgh, PA, United States. Ham, spinach and cheddar omelet in foreground; poached in the background.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/86pgyTAcILzHen9C5zCerg/o.jpg"
      }
    ],
    "user_id": "nfP7jRgmR_wkM10_Gg0scg"
  },
  "thHgEtg_wJlLxoaoHsZ0tg": {
    "date": "9/28/2017",
    "text": "I love breakfast, but I very rarely ever eat breakfast at a restaurant and think \"oh, that's amazing; that's way better than I could have made it.\" But that's what I think when I eat at Eggs-R-Us. They have the best bacon and hash browns, and for me that really pulls the whole meal together. I honestly don't even know what they serve other than breakfast. (Although if you're eating at someplace called Eggs-R-Us, you should probably be eating the all-day breakfast.)  Great food aside, this place has the typical Pittsburgh restaurant disadvantages of being small, cramped, and old. I definitely would not bring a large party here (I think even 5 people would be too many), and it's popular enough that I try to go on off-hours so we can get a table.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "PJv_YaUIw3mKEHgoxaj0wQ"
  },
  "5bhezNhSuKs9g9zYe0efMQ": {
    "date": "7/28/2017",
    "text": "What a frustrating and humiliating experience trying to actually eat at this diner.  After sitting for an hour waiting for our food, we watched in horror as our server handed our breakfasts to two other patrons who'd just sat down.  Then she argued with us about it, then realized she's screwed us over and tried to tell us ours would be right out.  We left at that point, because we really didn't want to wait another hour to see if they'd even get it right.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "hin4OjhJxvw2kwFUxjDzww"
  },
  "d9FV_ldERxKtH1Hn09C9JQ": {
    "date": "10/28/2012",
    "text": "Settled on this diner because it was closest to the hotel and closer to the airport than Pamela's or the Original Pancake House. Glad we made the decision. There was no wait and the staff was very friendly. The portions were extremely generous, the food was great and halfway through the meal the cook sent over another plate of ham because he felt the original piece on my plate was too small (not the case). The spicy sausage is great so definitely order a plate of that. Would definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "R0Uo8zM8H9gsl5b6W0xrFA"
  },
  "9C74QFLRia3QFFX0hZTj1Q": {
    "date": "1/21/2016",
    "text": "Best breakfast in Pittsburgh!! You can order anything on the menu and be happy. We were there a couple days ago and I got the pecan waffle and my wife got the mixed grill. These are two of our staples. So we knew they were gonna be fantastic. Beside the food, the owners are so nice and willing to do anything to help. The staff is amazing as well, they are alway happy and seem like they are always on the move. We eat here all the time!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9fCyWcTnFktdB0aQ5UIClQ"
  },
  "Dn5NidKmZuwn7QOsOZ_uHg": {
    "date": "8/14/2015",
    "text": "Worse service ever!  Waitress dumped off our food on the table and never acknowledged us again!  No coffee refill!  No check we had to go track another worker down so we could leave!  I will never come back!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nw6YuEESuNn037ZSCHSMtw"
  },
  "4FFMyu-pCbGx_zk1tH-dBg": {
    "date": "9/6/2015",
    "text": "Don't let the name fool you, they have good breakfast, but lunch here is phenomenal. If you are into classic old-school diners this is the place for you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BPdGMVEa52elvnOBbWUD5g"
  },
  "atSGL1YwVqSMdTJnmE9QNA": {
    "date": "6/20/2015",
    "text": "Always heard about this place on commercials, finally decided to go. Gab N Eat in Carnegie has always been a family favorite, so I had high expectations of this place to compare with. Waitress was nice, but everything took a while to get. We probably waited over 45 minutes to get our breakfast. But, the breakfast sandwich was large, inexpensive and good. Home fries were very yummy. If your in the Crafton/Greentree area it is a good choice, but might take a very long time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ROdMGBimzfgpFPvwLrZkcA"
  },
  "v0vV08vb4dP0Sod7HX2QnA": {
    "date": "12/8/2012",
    "text": "Really great little diner!  Great food.  Reasonable prices. Great service.  Combinations are yummy.  I had a medley of breakfast items and ALL were outstanding.  By 1p on a Saturday it was easy to get a seat and service was super fast.  I will definitely go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "us0CgncpaRvCZRp9Sqzezw"
  },
  "SLuKWrhkwojxMBsgeKeQAg": {
    "date": "6/17/2012",
    "text": "After reading the many positive reviews about this hole in the wall diner I was really looking forward to my brunch this morning. I ordered the omelette with hash browns and toast.   Once I actually saw the food I wanted to just walk out. It tasted 10 times worse than it looked.   The toast was drenched with butter. The hash browns were definitely bought from the frozen isle of a store. And the vegies in my omelette were not fresh ( most likely frozen vegies).   I dont expect a diner to match up to the quality of real breakfast places but i do expect fresh food.   Just STAY AWAY.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qcUnxIvoKHk9cxObUKm_kA"
  },
  "26hQy2RMyhYxjzmlE_dNeQ": {
    "date": "10/4/2014",
    "text": "We arrived after lunch rush and had a great meal. The omelets were expertly made, fluffy area fantastic fillings and cheese. I loved the hash browns too, crispy tasty patties. The pancakes....we got blueberry and banana walnut. The banana walnut were fantastic.  Large chunks of walnuts and yum bananas. Breakfast burrito was delish too! The service! Fast and awesome. Refills kept coming. And our waitress was great. I got my omelet and it had homefries. I noted I ordered hash browns she said ok quickly no arguing with me and promptly ran and got me hashbrowns. She didn't take my plate away like so many restaurants do and make me sit there with no food. She didn't take the homefries away either which always strikes me as petty at restaurants when an order is wronf. I was a restaurant manager who didn't like that practice as you can't serve that food again once it gas hit the table and it's yacky. Super professional service and made us really happy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jK-PfH3Jwvb7k-7Ge-s00Q"
  },
  "_Cn3za0n_oEUJePf6i0SYg": {
    "date": "12/5/2012",
    "text": "I took a chance on this places and boy was I surprised good service and big portions for the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4nwTbDDVZfU78UbREfUVsg"
  },
  "YZW4XMmBKApzK9H2CQIfMg": {
    "date": "7/27/2014",
    "text": "I can only rate this a three not based off of their good which was excellent but because of their lack of customer service. The place is small, which adds to the old school diner feel, but the servers act as if they have no time for anyone but the regulars. It was my first time eating here (new to the Greentree area) and not a single server (they all help cover each other's tables which is a plus!) even said 'Hi' or 'how are you guys doing today'. The first simply set silverware down and without looking at either myself or my husband uttered 'your server will grab your drinks' and walked away. Almost ten minutes later, our server walks up and had my husband not been looking up, since I was buried in the menu, neither of us would've noticed her standing there since she didn't greet us. She takes our drink requests without a smile or any additional interaction and walks away. Our order for food followed soon after but our simple breakfast took over 30 minutes to  arrive, the saving grace of the experience was the delicious onion & green pepper potatoes! The bacon quality was great but it tasted like burnt and dirty griddle, which just shows poor training in the kitchen or lack of awareness. However, I love the diner atmosphere so I will continue to go back and hope it can only improve!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4HWG2E7pIweFJNJ0LNzBOQ"
  },
  "zyDhOegSi9lrIg_A5TGqPA": {
    "date": "6/6/2014",
    "text": "I absolutely LOVE this little diner! I am just a \"bacon n' eggs\" kinda gal--not too adventurous but I will tell you this--the bacon here is KILLER (I guess in more ways than one--but death by bacon might not be too bad!). The bacon is thick cut, chewy and full of flavor! (Can you tell I'm a bacon lover yet?) I order my eggs over easy--PERFECTLY DONE--every single time! The home fries are good too--although I prefer mine with just onions (not peppers) and they happily oblige. The toast is Cellone's and let me tell you, I'm a Mancini's gal but--I feel Mancini's is a bit too \"airy\" for toast. Cellone's yields a firmer toast which I believe is much better and tastier--good choice Eggs-R-Us! The coffee is the best I had from all the surrounding diners in our area. The waitresses are excellent--very friendly and accommodating. This place is small so there is usually a wait (and the rush of air at the door-due to the exhaust fan-when someone opens it-can be annoying) but in my opinion, it is well worth the wait. I love the mix of people and it's noisy, which adds to the ambience.  It's interesting to watch the owner and the other cooks do their magic--right out in the open! They work at a small grill top but they sure can pound out the meals! The owner and his wife are very down to earth, friendly and hard workers. They deserve your business! By the way, the reviewer who mentioned \"food in buckets\" obviously hasn't a clue...furthermore, is food in a clean, food bucket really any worse/different than food in a bowl (other than the size or shape)?!!! Take a walk through GFS (restaurant supply/food store) and you will see a variety of \"food in buckets\"...sheesh! Good luck Egg-R-Us--we look forward to having breakfast with you many more years to come!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X8FiExnHMi-PAd5IF8zcPw"
  },
  "jhi6-cjrrLd6-tZt_c6AQg": {
    "date": "5/17/2012",
    "text": "Best breakfast spot in the city. Huge portions and great tasting food. Try the monster breakfast burrito.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-qSB-gmfSdQ1DgLay367ww"
  },
  "d7ypuE9eGRlHoGS8Xl81Dw": {
    "date": "5/18/2011",
    "text": "Always busy in the morning and with good reason. The hot sausage and bacon are unreal.  Do yourself a favor and get the bountiful breakfast.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6LYMUNBqHEBP8NOwd9P14g"
  },
  "gAGlr2eLr_E_3SeTEb38iA": {
    "date": "6/29/2011",
    "text": "Average diner no more no less.  Look for the Diner sign in the corner behind the wine & spirits to find them.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zfWG-mS2c9R1ES5adp_eiQ"
  },
  "qVzioF-QBZUCwpkV0PPmOw": {
    "date": "6/14/2013",
    "text": "If your looking for quality food with quality ingrediants. This is not it. Sysco drek!!p",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aFwbSQ1fCC6jHybB-YA4gQ"
  },
  "z3-oF9Efm5I3SkIwQsSvnA": {
    "date": "5/29/2012",
    "text": "went here and the food was good, i am a glutton so they cater to that lol.  nice home fries, very good, but the wait was sort of long, i would call in so your food is ready when you get there  would have gotten 4 stars if the vibe wasnt soo weird and the patrons in there didn't stare at us when we walked in, I was like OKAY, WOW-when we walked in there, the staff was nice and hospitable, but guess you cant help what patrons you attract.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uzaAsqboefzmod_hrX-GFg"
  },
  "Jsqas0DsbZEGURA_v8R1nQ": {
    "date": "5/28/2013",
    "text": "Disgustingly dirty!    My seat was directly across from the dirty dish  \"hole in the wall\" where the dishes sat and just kept building up.  On  the counter and hanging on the spigots were filthy black towels and rags hanging everywhere that we're used for cleaning??   A young man was standing at the counter cutting up onions and putting them in baggies while touching his hair aynd face the whole time.    I have never been in a restaurant with so much visible filth. I only ate m toast because. Lost my appetite. My husband faced in the other direction and said he would eat his breakfast and that after being in the \"army\" he could prob eat anything but agreed it needed washed down to say the least  bathrooms yuck!     I didn't care how big people claimed the burritos or pancakes. Can't stop thinking about where their prep occurred.    I'm sure you'll find a better place somewhere down the road.......keep driving!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R8njG-aYXRA3Hucn-dBhbg"
  }
}