{
  "hna8nRak_UNdsN8Tn5wttg": {
    "date": "8/24/2012",
    "text": "Went here for lunch because its close to work.  Loved the food being cooked right in front of me!  The place was crowded but service was good.  Definitely will go again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Gal7Vqe4zAZVQ6Lgl8jqQ"
  },
  "xaDAT6ESeVKORTOIgmXVwg": {
    "date": "6/20/2015",
    "text": "The all you can eat setting was good and so was the veriety. Everything turned out to a satisfactory setting until you add souse. They recomend to get a little cup of souse and hand it to the grillers. But if you put it in pior then the cooks will burn your food. The cooks only know how to use the sauses after the food is cooked and not before. In adition it seems that the way the grill is cleaned needs some work other than a spray of oil and a scraper. Its good food at a good price, just remember when eating there if you dont get your combination just right to the grillers expectaions then you will end up with what looks like leftovers from the grill trap.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fmGB5bwEQEopuuc4Hd2ExQ"
  },
  "pY1SxNZtfW40zexdC9bW2w": {
    "date": "12/17/2012",
    "text": "Loved this place - the food that is (because I had takeout). You can pick your meat(s), vegetables, and source for your stir fry and they'll make it how you want it. Their pot stickers are the best I've had yet. Will definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n77a8pr9OK4uBxyKulF2zw"
  },
  "X2LinOdbxF7yH01AZeW17w": {
    "date": "2/17/2012",
    "text": "I wasn't overly excited about visiting this place simply because they are pretty common where I am from. My boyfriend had never been so it was a great experience for him. The food was good. A bit overpriced for what it is, but I guess that's where they need to be if they are in Southside? I don't remember it being quite as expensive back home.  Problem with this place? The music was so loud, that our server had to yell to talk to us. My boyfriend even noticed it. \"Is she yelling?!?\" She was so loud that when she would talk over the music to the table next to us, I would get annoyed. The staff was friendly and even found themselves singing along to the music as they cleaned. Which I was happy to see everyone in a good mood. But why were there so many!? They had their own show choir going on here on a Tuesday night. There were literally more people working than there were eating (I counted haha). And that's even including the 3 employees who I watched eating in the kitchen. I was just too overwhelmed with people working to feel comfortable. They were everywhere! Maybe it was to ensure the restaurant does well since it's new? Maybe the manager doesn't know how to cut workers after a certain point? Maybe I was an extra eating in the background for an episode of Glee?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "49SXsLMeH_Py2vC8F9ZHRg"
  },
  "5dN3Tu8ZzW3HshnujQYRYg": {
    "date": "10/30/2014",
    "text": "Why is this not in the D/M/V area?! So many vegetables, meats, sauces and unlimited bowls!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t558G_va4vxSccBA-eOYkQ"
  },
  "bq_my0unqH-y2FsEXDlaNQ": {
    "date": "11/19/2012",
    "text": "I just tried this once to see how it was and seriously feel no need to go back. $8.99 for lunch and $13.49 for dinner which you will never see posted on their webpage. The novelty of the whole place is what must bring people in the door. There was a place in Squirrel Hill a few years back that let you pick your meat and vegetables for a stir fry and they had since closed up and became the Silk Elephant.  I couldn't really see a point in tipping a waitress when the setting is very informal and you are basicly doing all the work. They bring you an empty bowl when you sit down and then your rice and drink if you choose to order one. In my opinion if everything were like Chipotle where you get your own drink and no need to tip someone all the better. I guess I am just a cheapskate but when you are eating this kind of food you really don't want to spend that much cash as a whole. If we had a Pei Wei here in Pittsubrgh then there really would not be much need for a place like BD's. I noticed the onions were cut up all half assed where they leave the core at the end in there and don't care that it is all clumped up and stuck together. One of my pet peeves.   Not sure what the draw is here getting your food cooked on a dirty grill by a teenager who would rather shoot the breeze than check to see if your food is burning. Watching him turn and chop my food (loosing a few select pieces of meat into the spill well during the process) with what looked like two filthy sword like utensils was not very appetizing at all. I think when someone else came up behind me and he scraped the grill shooting black carcinogenic ash into my stirfry was the final straw that made me not want to go back. I chose a mixture of about 5 different sauces that completely dried up once poured over my food on the grill. I couldn't really tell what it tasted like since it was so dried out and full of black specs of charcoal.  If you want something similar and willing to pay the asking price of $9 for lunch, just go to a good Hibachi Grill somewhere where you get a free entertaining show by a real chef. If that's not for you either I suggest one of the better Chinese buffets around town and pay $7 instead and get all you can eat along with salad, fruit, cookies and ice cream.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YmZb7nsmeufYcsjhg84zcw"
  },
  "Jws58f-anI4Qnsu8_Gmzaw": {
    "date": "9/13/2014",
    "text": "The meal I had at bd's mongolian grill was amazing.  The ability to create your own meal and have it prepared for you with excellent entertainment is awesome.  It has a great family atmosphere and its welcoming to all. Needless to say I will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o3KH6CLieC6aGYm3sq4Jbw"
  },
  "BuleKbJ13UdJr0EuLiNpkg": {
    "date": "4/24/2012",
    "text": "Went there with a family group of 12. We had small children and adutls allergic to seafood. Our waitress was wonderful- she kept bringing drink refills, napkins and more bowls.  The set up was great and the  place was clean. I also think the prices were reasonable..  about 15.00 pp for unlimited trips.   I do agree that it was slightly cafeteria style and many times the people working the grill would yell to  \"stand here\"  after  we had already stood next to family  or friends and places our food down. One  other slightly confusing thing was the add of the  salad bar..didn't really understand if  it was  included or you paid extra.  Over all a decent place to eat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LvbVj7YtBYrza71ofqH1Fg"
  },
  "e_SMJz3MnsmOqXda7okzrg": {
    "date": "10/7/2013",
    "text": "My whole family enjoys BD's food, prices and atmosphere. Always a favorite choice with my teenage son and 5 year old son. Mongolian's chefs cook on a stone slab grill infront of you while tossing and serving with steel swords, always entertaining. If you enjoy the food be sure to bang the gong and everyone cheers. While you wait at the grill side service bar, chefs will entertain you by playing connect four, rockem sockem robots and more with you or your children. They also have a few song n sword type skits they tend to break into. They are allergy safe, so mention if you have a food allergy and they will take care of you.  There are soo many food options available on the raw bar, almost any type of meat and seafood you can think of, tons of pastas, veggies, spices and more there is also a salad and soup bar, you can use their recipes or create your own, then take to the chefs for preparation. Best part, if you dont like it...try again, its all you can eat!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ro_F4PJqYV7THY0v5TCf6g"
  },
  "yzwM0CciecSwsLqWGITXyw": {
    "date": "2/15/2012",
    "text": "Where to start? Walked in. Realized that this place was somewhere between TGI-Fridays and cheap stir fry. Quite a low point to start at. Went to sit at the table only to realize that all of the lights on our side of the restaurant  were annoyingly blinking, such that one might be concerned about having a seizure. Next, we were asked about drinks and appetizers. Drinks took very long and we didn't really know what to do from there because we did not yet have bowls. When we realized that a redonkulous $14 + dollars would get us a teeny bowl in which we were told to fill with an assortment of raw meats and veggies. The look of raw meat prior to a meal was quite unappetizing. I had to strategically place veggies into my bowl because it was so tiny after I filled it with a couple noodles. We then waited in line for our meager meal to be cooked on a grill. Oh and by the way, you can't move more than 5 inches without an employee asking if you need help. I mean its a glorified buffet, not brain surgery... Anyways, meal was cooked on the grill between several cooks. This is the part that concerns me regarding food borne illness. While one meal was placed on the grill, the cook would saute that meal and then move onto the next, which also had raw meat in it. Just something about seeing the cooks touch raw meat then touch my cooked food, did not seem OK. Regardless, because I love food, I ate my meal anyway, albeit while listening to horrid top 40 dance/pop music blaring. Not a whole lot of food if you get just one bowl. Did I mention it was over $14? I had a glass of wine and a bowl of food.... $23. REALLY?  Overall WAYYYY over priced. But we did get a free beer coozie as we left. Perhaps my expectations were too high. This place will probably do alright for the typical buffet goers who gorge themselves. But if you actually enjoy the TASTE of food and not the feeling of being engorged, I would roll to another place in South Side that serves stir fry for half the price.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "y8qLYtkPk3hMydP7OTlWnw"
  },
  "3vAHBMAR7RbH8e0j4W8PHw": {
    "date": "8/7/2016",
    "text": "My favorite mangolian grill place in Pittsburgh that I've been too. I've been there many times. Considering the price the quality is pretty good but they are not consistent with the ingredients.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PxbDxIHBC2-wl51VAV_RoQ"
  },
  "-wBGuUzGbX1f09a7VHsrDw": {
    "date": "6/1/2016",
    "text": "Our server was extremely rude. She was slamming utensils and rolling her eyes constantly.  No greetings and was not tentative. We felt like we were not welcome and were rushed.  The food is overpriced and we got egg shells in our meal.  It was so bad that I created this Yelp account to give this review.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qgCX6sJIQMXDfRoc-BG6Dg"
  },
  "9R6yfPLdxGp9G_m5WeHZcg": {
    "date": "9/9/2016",
    "text": "There's not too many times I've resolved to never return to a restaurant but my experience was awful. The quality of the ingredients is horrible. Everything just tastes like canned sh*tty vegetables. The price is exorbitant considering the quality. The only question we had for the waitress was whether we requested rice with her now or up at the grill. She said something along the lines of \"oh wherever.\" The staff balked when I asked someone to refill the brown rice. They visibly argued in front of us about who's job it was and that neither were going to do it. It took ten minutes to be filled. Our table was sticky. The waitress literally struggled to pick up our receipt after she set it down. My unsweetened ice tea was the only thing I enjoyed about my forty minute experience here. Will never make the mistake of coming back here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x41r4YZV9PhQyVca4QfBzA"
  },
  "_4dk_HG0duHSf6dFCjeqVw": {
    "date": "4/19/2017",
    "text": "I am a Pitt student who dined in at Mongolian Grill. Long story short: I would have rather gotten stir-fry from the university's dining hall, Market Central. If you're not a student it costs $13 and it's all you can eat and so much better than Mongolian Grill, which is saying A LOT.  There were a number of issues with my experience at Mongolian Grill: 1. The stir-fried rice was crunchy. Seriously, I felt like I was eating burnt Rice Krispies cereal. It was so bad that I did not get the unlimited bowl, however, others in my party did just because they could not eat their first. Moral: avoid the rice. 2. The waitress was somewhat incompetent. She forgot to bring us our sides of rice until we were halfway through our meals, and then charged me for the wrong (and more expensive) dessert, and refused to change it. 3. The soup and salad bar were awful. The soup had separated, so there was grease and oil on the top, and there were bacon bits in the bins that had fruit and other salad toppings. I feel bad for any vegetarian or vegan trying to enjoy a meal here. 4. The manager is sketchy. After speaking to him about being over charged, he offered to give me free meal coupons (uh, not after that food!). Once I refused, he offered to mail me cash... Isn't that illegal? Despite me paying with a credit card, he said he could not refund me, which makes no sense.  I rarely leave bad reviews but after the disrespect I faced from the manager, I felt no other choice. I am a foodie who doesn't mind spending money on food, but I truly regret spending $20 at this establishment. You're better off going to the Cheesecake Factory across the street. Seriously.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z_Ad31JmJZyWrXA2qju0DA"
  },
  "L1g5YbKQWtQt-Aqd0Af96Q": {
    "date": "12/21/2014",
    "text": "I like this place for the most part. AYCE only cost an extra $2 compared to a single bowl. One bowl isn't quite large enough to fill me up, so it's almost mandatory to go for the unlimited option. These types of restaurants are cool, but can be too flexible when trying to put together a good combination. The sauces can really make or break a dish and without knowing what they taste like can really be like taking a shot in the dark. Luckily, if you strike out and you do AYCE, you can simply try again, but each trip can take about 10-20 min depending if there is a line or not. I'd suggest thinking of a popular stir fry dish that you like and sticking to what you know before venturing off the beaten path. Lastly, a plus is they will let you box up your last plate if you can't finish it, which some places won't let you do.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DN9qVvHo2x8CLkh3Yz07aA"
  },
  "rdF505Nn4H3hPtNYl129WQ": {
    "date": "11/9/2017",
    "text": "Might as well just take some exlax and save some money. The ingredients just sit at room temperature for hours...sort of disgusting.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "njp-VIKNIAnoUT1oqjJgHw"
  },
  "TFDFzzAEMTTD-7wpEHjvcQ": {
    "date": "5/15/2016",
    "text": "Stopped here on a whim for a late lunch and we weren't sure what to expect. We were pleasantly surprised. It is a little overpriced but the food/ options are amazing. We tried the jalapeno mozzarella sticks which were a nice little chance. We each got a bowl and filled it with meats, shrimp, veggies, noodles... Everything. This is a great place for picky eaters. You get to choose exactly what you want in your plate.  The service was good. The waiter was vet friendly and the grill cooks were entertaining. We will definitely be back and recommend this to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pVMG872L0O8lNvIEIFQBkQ"
  },
  "diugy8pRGaTTZyouvZl4Lg": {
    "date": "2/8/2015",
    "text": "We were introduced to Mongolian BBQ several years ago. We were so excited when this restaurant opened. It is my boys favorite place to eat and they would eat there every day. When it opened I really loved it but each time we go it seems to go down hill. I can't put my finger on any one big thing but just little things. The quality of meats is inconsistent. The cleanliness of the bathrooms is \"iffy\". The service is hit or miss.  Today we went during Happy Hour. Appetizers and beers on tap are half off. Specialty drinks are $2 off. I put in an order for Crab Rangoon. Fifteen minutes later the waitress told us they were out. She asked if I wanted something different. I said that the other two things I liked had pork in them and due to health issues I couldn't eat pork. She left and then came back and said the had shrimp and artichoke wontons. When they came they weren't good. It was all flavorless artichoke mashed up. There was no sign or taste of shrimp. There was no dipping sauce to help bring flavor.  I made a plate of ad libbed a version of Pad Thai. The grill area was packed so it took a long time for my food to be cooked. There were five of us in our party. Two of us only ate one bowl. The other three ate two bowls each. All of the guys liked their food but thought the wait to get it was too long.  It's definitely a place you have to try once but it will be awhile before I go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JNhtNfPOsQ5wKRq1TczXdg",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. A spicy teriyaki dish",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JNhtNfPOsQ5wKRq1TczXdg/o.jpg"
      },
      {
        "img_id": "S8Q12taPCA5lVz4aETp-YA",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. My ad libbed Pad Thai",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S8Q12taPCA5lVz4aETp-YA/o.jpg"
      }
    ],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "BWMf23C9dsutz-23PmPaGg": {
    "date": "11/30/2016",
    "text": "Very cool place. The stir-fry is delicious and I love how we create our own, unique stir-fry's. Stir-fries? Anyway, it's very cool the way it's set up and I love watching the chefs prepare our food right in front of us. Also, I like they way they crack the egg.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pGQmnru5BcE2R-UM9IKkHA"
  },
  "64r_kDGqHkeZYRf7goau8g": {
    "date": "6/21/2012",
    "text": "Let's put it this way...we practically live next door to BD's and we've only eaten there one time since it opened.   The food is fine, but since you're sort of on your own to develop your recipe, it kind of defeats the purpose of going out to eat. Don't you want to go out and have a professional chef provide you with his or her palate-pleasing recipe? So BD's does all of the prep work and the actual cooking, but throwing a bowl of stuff on a flat grill and standing there waiting for your food isn't my idea of a great restaurant experience. The chefs hardly entertain, aside from a little banter with the guests. Overall, they just stand there and occasionally flip their \"swords\" while hoping to not undercook your meat(s)...yawn.   The positives? The cost and the service. For lunch, at least, it's really affordable. It would be hard to get all of the ingredients and cook at home for under the cost of your meal, but I'm still not sure if that's a good enough reason to go. The service is actually pretty good. The waitstaff, bartender, and cooks all seemed really nice, so you're at least welcomed into BD's with a positive vibe.  I will say the absolute worst part of my meal was the crab rangoons. I'm not sure if they'll make it into the actual menu, but they were awful. The wonton wrapper was so thick and bland that it would've overwhelmed any potential flavor inside of the rangoon. Not to mention the dipping sauce didn't go well with rangoons, either. Totally disappointing; perhaps the only time in my life that I left uneaten crab rangoons behind.   Overall, the whole experience as average as it gets. I'm sure we'll eventually go again out of convenience, but I haven't thought about going back since our sole visit, and I don't see that changing any time soon.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "JiPMk9WmbJu-VfTRAKpZpw"
  },
  "KwY3pTRQVPYknkshZ9Bvew": {
    "date": "3/20/2015",
    "text": "I can't say anything about the quality of their food. I only sat at the bar long enough to enjoy a couple of beers and watch some March Madness.   The quickest way to turn me off from returning to a restaurant is to let me whiteness the person who is serving me stuff food into their own face. While I understand that it was a slow night hardly want to see my bar tender stand behind the bar and consume a protein or weight loss shake. Next quickest way to not have me return: not washing your hands after touching dirty money and then touching plates with food on them.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kT-yh4-9OB0yIMenzcsKjg"
  },
  "G3_1RNymU33idrlEbEmpoA": {
    "date": "2/29/2012",
    "text": "BZZZZZZ BZZZZZZ *Pick up \"Hello, thank you for calling BD Mongolian Grill, this is Bailey, how may I help you?  Me: Hi Bailey, yes I'm driving there now and would like to put my name on the list, there will be six of us dining tonight.  Bailey: Awesome, can I get your name?  Me: Yes, it's Joe, J-O-E  Bailey: Okay, great, and you said six of YINZ will be here?  Me: Yes, six of us, at six.  Bailey: Great see YINZ at six!  Nothing like a True Pittsburgher answering the phone of a new place. We all met at the parking garage, which is a treat, because someone is always late, but this was my friends and cousins taking me out for my birthday and to my surprise everyone showed up on time. Fellow veg and great friend, Jamie was joining us as well. We were all BD Mongolian Grill virgins.  We were seated at 6:06 and Emma, our very nice and VERY PATIENT waitress greeted us with water, and menus, she took our drink orders and we looked over the menu. Well, with the girls chatting and all the guys chatting, we neglected to look over the menu, and continued to socialize. Emma brought over six bowls and explained to us how BD Mongolian works. The first station is noodles and proteins, the second station is vegetables, tofu, and other items, third station is sauces, herbs, and spices. Along the way are other employees to help you out. I chose rice noodles, tofu, mushrooms, water chestnuts, broccoli, and red peppers. My sauces were a mixture of Kung Pow and sweet and sour.  Then it's off to getting your bowl cooked. I handed it over to one of the cooks, who asked if I had any allergies to anything, then proceeded to stir fry my dish in very little oil. After a few minutes of cooking and because it was my birthday, banging the gong, my dish was complete, and I was off to my table. In the mean time, Emma brought  brown and white rice to our table, flour tortillas, and lettuce wraps were also there. I waited for everyone and we all dug in! I have to say, I had no idea I was such a good noodle chef, my dinner was delicious. Everyone was very quiet as we chowed down on some really delicious food. There's a salad bar as well, but I never got near it.  I had joined Club Mongo a few weeks back when I went to the BD Mongolian Grill website so my dinner was free, my total was 2.45, and that was for my drink. Later me and Jamie stayed and had drinks at the bar and watched the hockey game.  BD Mongolian Grill could be my new go to place for lunch or dinner, I really loved the atmosphere, the staff, and Mike, the bartender is very friendly, and goes out of his way to make you feel at home. I LOVE it here!",
    "rating": 5,
    "rated": {
      "funny": 9,
      "useful": 10,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "v0LcbeDsREF4HC1CO6rp0g",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. Tip Tip....HURRAY!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v0LcbeDsREF4HC1CO6rp0g/o.jpg"
      },
      {
        "img_id": "llRjkpyYhIYaLaS3AjxZUQ",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. Oh yeah!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/llRjkpyYhIYaLaS3AjxZUQ/o.jpg"
      }
    ],
    "user_id": "UsmTxWbobLsI6WR1Db0W7A"
  },
  "IGmWDpQVxN9NMFmPRDEBgw": {
    "date": "3/25/2017",
    "text": "4:00pm and the place is 80% empty. The guy tried to seat me at a little tiny table. I asked can I sit at a bigger table? I'm a pretty big guy and I joked with him that I was wider than the table, and I am, not huge but big enough to feel crowded. He comes back and asks \"Can you just sit there?\" I said \"Really? You're about to loose me here, I thought I asked nice, I'm fat, can I please just sit at one of the many empty tables?\" So he let me sit at a different table. Shouldn't have to ask twice.  The waitress then came over with a little tiny bowl and explained how to get the raw food and they'll cook it, etc...  I said, \"ok, I'm getting the all-you-can-eat, I'll need more than that little bowl.\" She said I can have another bowl after finishing with this one. I tried to explain, look, I'm a big guy, I'm gonna eat 4 or 5 of those little bowls at least, can you please just bring me a few to get started?  No.  I said if I can't keep the food coming this could take me all night. I'm here to eat. That's not the way it works she says. I said That's not a very good deal, I don't think I'm gonna do it. She rudely snatches the bowl away and snobbishly says fine as she storms away.  I was a little rude after that but WTF!!! If you're gonna offer all-you-can-eat you should expect a few big eaters now and then. It's Rude and Ignorant to discriminate and not graciously offer a comfortable seat and access to the so called all-you-can-eat food in a timely manor without a snotty rude waitress. Never did try the food. Never will. Don't be deceived, if you like to chow down this is not the place. Another place that thinks I would go out to follow their stupid rules they have set up to regulate my food intake at an all-you-can-eat. It doesn't work like that. This place will never last.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xxYjciE9n5IZylP023ze8w"
  },
  "UhjHlF2-dlZA234e2Y0ysQ": {
    "date": "1/3/2016",
    "text": "The food was decent but the overall experience is not. The process of creating your bowl is not fun and is very difficult to manage if you have small children in tow. The place was also a mess with virtually every point being point being dirty. We have no intention of ever returning again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xg98DhTV0z4yNiC4LChDtQ"
  },
  "urlbHMUnw8D3E_aK2wCLgw": {
    "date": "2/28/2016",
    "text": "After a movie we decided to try this place. We both got the unlimited trips with the salad bar. The waitress was helpful explaining how it worked. Great choices. First trip I got a mix of meats, vegggies, and teriyaki sauce. Everything was good very well, great flavor. Second round was seafood, shrimp & calamari, veggies,& a mix of teriyaki and ginger sesame sauce. And the last trip was shrimp and ribeye with veggies and ginger sesame. 2 of the 3 grill guys were fun, 1 was grumpy.  Tipped the cooks on my last trip, please tip. Salad bar was small but fresh.  Definitely want to go back. Great place.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zokgpfAn1onJ1DppA1DTDw"
  },
  "iK7H3hSMoz01vlj_xC1MpA": {
    "date": "9/6/2014",
    "text": "I actually quite like this concept. It is essentially a AYCE buffet (I would assume most people go for the unlimited bowls, unless they're skilled at filling a single bowl to the brim), where the only type of food you can get is stir fry. But they have a huge number of ingredients, probably more than enough to satisfy whatever craving you have. I like the fact that I can choose exactly how much meat and veggies I'm feeling, along with the sauce choice. The meat looks mostly fresh and fine and prepared well, and the veggies all look presentable. Even the sauces have a lot of variety, and I appreciate that I can get a stir-fry that is not overly salty. Finally, while we did not try any of their appetizers or desserts, the soup and salad bar were pretty sufficient for finishing (yay watermelon!).  Pro-tip: Their prices, both lunch and dinner, are very comparable to Hokkaido, and the food turned out tasting much better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "bjEwqTAwD6xZtAzNRRTd1w": {
    "date": "11/21/2013",
    "text": "I was actually really disappointed.   I've gone to a few other restaurants that are \"Mongolian BBQ\" and was knocked off my feet from the service to the food.  Here not so much.    Honestly, I won't be going back and here is why.  I don't get grossed out too easily but I went over to the salad bar, excited about this option only to be let down.  I made my salad and loaded it with a bunch of goodies... Sat down and started eating only to find glass in my salad.  I told the waiter, he went to check it out.  Now I can't tell you where at in the salad bar it came from but it was there and I instantly shut down.  It took the waiter 20 minutes to come back to me and finally \"apologize\" and inform me that the workers in the back said it was from a few days ago when they broke something in the salad bar.  My assumption? The salad materials were old.    Moving over to the food... there was a dead fly in the shrimp. Who knows what else could be found over there but I wasn't taking my chances.  The wait staff was friendly for the most part, until I had my 2$ off coupon for a bowl.  They weren't pleased to honor it.. they did though.  But you'd think after having glass found in your food, they'd be a little happier to honor a coupon or hell maybe throw in a free app to give me an incentive to want to come back... no.   That's all.  Won't be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "CXGsY1TzVd86hNn9eNNYEw"
  },
  "VBvFXJ9UYm1UMGFrZolRqg": {
    "date": "1/25/2014",
    "text": "Typical Mongolian grill. Prices are OK. I've only been once, but the service wasn't the greatest. I'll be sure to update my review next time I go, as I definitely plan to try it out again.  What stands out, for me, was the wide selection meats, veggies, and especially the tasty sauces and spices. One can really go nuts with the options.  Protip, from watching others - get the most out of your bowl by loading the meats and veggies FIRST, then pile a \"birds nest\" of noodles on top. People were really impressive with how high their bowls were stacked with noodles.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "KrTRREwzW6oaKlmLIZud-g"
  },
  "MCTASvpJYkSxn5VYQiUp3A": {
    "date": "12/27/2016",
    "text": "Went yesterday having not been there for about a year or 2. I was very dissapointed, quality has declined while prices have increased. I understand the price increase, but service was bad and the grill team was weak. Was seated in the bar area had to wait about 15 minutes before even being acknowledged, then had to wait longer for a server from a different section to take our order... just wanted a bowl and waters, all while the bartender served the other tables in our section and made a long island for a walk in that sat at the bar. We came back with our food only to find black crispys from a poorly bricked grill and no silverware or napkins on our table. There are a multitude of options down south side for food and I can safely say I will not choose this one again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UeKdkQiKlnQ_x5bNrFw2UA"
  },
  "FsoaFSGAYtSudnUElsBqmw": {
    "date": "2/13/2012",
    "text": "I also went there today for the opening..  Serena did a good job with her review.  I noticed lots of people having Sundaes (found out there were a lot of birthdays).   I am from Cincinnati and have been to that location many times along with the one in DC.    There were a lot of workers (almost too many).  I spoke to several of them and they said they never heard of the place until they got a job there.  They still need to work out the kinks.  For example my waitress didn't know where to get me a knife from and kept taking my glass to the kitchen for an ice tea refill when the bar and an additional beverage station was right behind me.  She also forgot to bring rice and tortillas.  This BD's offers lettuce wraps too.    Meat/seafood consisted of chicken, ribeye, strip steak, marinated steak, pork, meatballs, shrimp, scallops, maui maui fish, sausage, brats (which looked gross), calamari.  Noodles (rice, rotini, lo mein).  Veggies - interesting they didn't have pea pods like the other BD's.    They also have a good selection of sauces/spices but not as many as other BD's.    No reason to order appetizers here since you will get filled up on the meal.  Unlimited dinner which includes soup and salad bar goes for $14.99.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DEFk299pEBqKgUgQ703V9g"
  },
  "ECfM7XXqL2URJixpBuwpLA": {
    "date": "11/17/2013",
    "text": "I love this place! Location is really convenient and I like that it's in the works instead of being on Carson.   How it works: If you choose the buffet your server will bring you a bowl which you can pile as high as you can balance it with anything from the buffet.  Next you take your food to the grill.  Occasionally the line is a little lengthy but definitely worth it.  First your food is placed on the grill, then your sauce toward the end.  When it's all finished cooking it's put on a new plate.  This place definitely has something for everybody! I get a bowl and pile it high with steak, green beans and potatoes.  I love the million options for sauce and seasoning; I make mine extra spicy!   I brought my grandmother with me for my birthday last month and she opted for a delicious bowl of veggies and chicken.  I brought my extremely picky father with me too, and he ended up ordering chicken fingers which he loved.  My gram and I each got cocktails at the recommendation of our server and they were delicious!  They've also got really tasty mini deserts!  Hostess was fast and our server Mike was great! The guys on grill are super friendly and fun, too.  One thing I noticed about another review - Reviewer said she was too short, at 5'4\", to see what food was on the buffet.  I'm a full grown woman at 4'9\" and I can see just fine, so I'm not too sure about that.   Overall, I highly recommend BD's.  It's one of my favorite spots in Pittsburgh for a fast and casual meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9w5_HYf5_1sIHKz-grPg9w",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. I&amp;#39;m a plain Jane with my meals, but man is my mouth watering just looking at it.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9w5_HYf5_1sIHKz-grPg9w/o.jpg"
      }
    ],
    "user_id": "U4H6q16A0cdaCCUWXQiMUA"
  },
  "BVOdXwWS--wxqmACtZO67Q": {
    "date": "10/16/2015",
    "text": "While the food was ok, and the guys that were cooking the food were nice, I'm not happy with the overall experience. My boyfriend and I went there on a weekday, and they were very understaffed and overcrowded. It's not that service was bad, there just was not enough of it.   - We ordered egg rolls, and they came out rather late.  - I dropped my fork by mistake when I first got my food and asked for a new one, but was not brought a new one until the meal was long done and we were waiting for our check. I didn't mind that too much, because I ended up using chopsticks. - My water glass was empty for most of the meal. - The tables/seats were so close to each other, I noticed people struggling to walk around. I was so close to the table behind us, I got headbutted by the guy sitting behind me, and I was sitting with my midsection squished against the table. In addition, when I attempted to walk up to the area where they cook food(to get myself chopsticks), I got elbowed by a girl trying to take her coat off while sitting at her table. There was just no room to get around.   I left with a headache(from colliding heads with the guy behind me, the uncomfortably loud noise level due to too many people seated so near to each other all talking, and not enough water), not happy, and still hungry(we were planning on getting dessert there, but ended up leaving and getting it elsewhere).   I love going out to eat, and was hoping that this place would be another regular spot(because I love the idea of this place). With all of the other options available around Pittsburgh(especially South Side), I have no reason to go back. There is much better experiences elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "aOHKDZUkPkSG6CDOgRuJHA"
  },
  "cPgNvRrBPKZskqn5t75jKw": {
    "date": "6/18/2018",
    "text": "I live in Columbus Ohio and love Mongolian BBQ. We visit them quite frequently, however while on two business trips to Pittsburgh I decided to visit this location. First off, the service was extremely poor on both visits. My first visit it took almost 10 minutes before the waitress even noticed I was sitting there. The restaurants in Columbus when you are seated they ask you for your drink orders and if you want tortillas and rice, when you return from making your first bowl of food, the rice, tortillas and drinks are at the table waiting for you. Not in Pittsburgh, when you come back from making your first bowl you better expect to wait 5-10 minutes before getting your tortillas and rice. Your soda will only have 4-5 cubes of ice and will not be cold. The grillers in Columbus will flip, turn and chop up your meat and veggies on the grill so it cooks evenly and sometimes they even put on a cheerful show or will talk to you while your food is cooking if they're not busy. Not in Pittsburgh, they plop down your food on the grill and that's where it will stay for the majority of the cooking time. They will only flip/turn your food once or twice at the most, and will make no effort to chop up the large pieces of meat and veggies. As a result your food ends up tasting burnt. This restaurant needs a more cheerful customer focused staff and new management BADLY!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l4RlqYFEiMm8aHk7-bm10g"
  },
  "HBFLDSd6FebiPQI_VaCNDw": {
    "date": "7/20/2016",
    "text": "Always great food and the guys working the grill seem to be enjoying their job every time we are here. They always take great care of our kids and are willing to do things that seem so little like making a lone egg for my 5 year old picky eater.   We have been here a number of times with our kids and always have a great time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h9pdmjkxFAdAu56eeEpkCA"
  },
  "-ykGmMw7fqWts2jr4ze6YQ": {
    "date": "11/3/2015",
    "text": "Must remember dollars for tips! Very fun concept restaurant. always put your garlic on your protein, unless you're trying to ward off vampires and any breathing being. Ridiculous deals available, sign up for their emails, they have BOGO for your birthday. The meals alone are crazy, especially if they keep up the unlimited bowl option with to go. unheard of. Suppose that 's how you have to do it to keep such a large supply of fresh ingredients at the ready. Definitely loud. Check website to see if it's college night/ happy hour/ etc. Not the place for a quiet conversation. . . most days. . . maybe for lunch. . . defintiely as healthy as you want it to be, flavorful as well. you're at the helm of this ship, they do all the prep, cooking, cleaning, aaahhhh",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9cHwoFocl2YCsg9mg7MCw"
  },
  "wBbseye2XDZeKTgKhS95wA": {
    "date": "2/16/2017",
    "text": "Great first experience! Cooks were knowledgeable and food was fabulous. Only complaint really was the server seemed to be annoyed and curt when I said I'd never been there before and said since my friend had that he could show me around and how to do everything. Other than that I really loved it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nKqqytfqc_I_-nDZBOFw7A"
  },
  "ym2QQjtZdNzfcBaL-LfPYw": {
    "date": "1/9/2017",
    "text": "I was excited to return here and we had such a good dinner. Watching dinner being prepared on the large grill and picking what you want makes this a fun place. Don't forget to hit the gong to thank them! I opted for 2 bowls and also tried some different ingredients. I just really like the large options that are available.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IwAzZe3iN9ZBMxW7lKM3Yw"
  },
  "U0SiKmN7sANnYLihAyAnUQ": {
    "date": "1/15/2016",
    "text": "I love this place. Took a friend there today and she was amazed. The gentlemen working on the grill made it go so far when the place was busy. Very entertaining.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-EpKRCcxcwiH77CCMyViZg",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-EpKRCcxcwiH77CCMyViZg/o.jpg"
      }
    ],
    "user_id": "x7iB_JlqoX2WqBagCIYxQg"
  },
  "y39zBUWjpzBeLPLH_2Muww": {
    "date": "6/20/2015",
    "text": "I work in the service industry and have for a long time and look at certain things and listen for certain things when I enter a restaurant. That being said, I am really satisfied with the level of service I was met with. I was approached by my server Mike and gave my friend who had never been here a thorough break down of who you are and how it works. He was friendly, met all our needs in an immediate and courteous way and was relatable. The cooks didn't look like they hated their lives and worked charismatically with mild flare and was a joy to watch. I could tell the one was new but was focused and put the final touches on my entree with success. I believe his name was (Kyle) good job. The salad bar was cleanly and neat, the ingredients were fresh, the lettuce was not wilted or brown, and they had a decent amount of options. Hell yes to whatever that \"Crema Andaluz\" soup is... So good. I also listen to hear excessive boh/foh profanity and I refreshingly couldn't hear any NSFW conversations or servers talking negatively about their tables. (That's really nice and shows people seemingly like working here)   I feel like establishments like this, that are partially self serviced, get overlooked and underrated. We will be back. (As it is now one of my friend's new favorites) All he kept saying to himself as he was piling food in his mouth is \"This is so good. This is so f%*king good.\"  Make sure you give Mike some credit. He's great at his job and not many servers are.   Keep it up.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sgybIsT8wEkWYLFGe6jucw",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sgybIsT8wEkWYLFGe6jucw/o.jpg"
      }
    ],
    "user_id": "_G61KbATzzAZJUapHEAJ1w"
  },
  "EgvSLrwpcsRy8bUFroitnw": {
    "date": "5/25/2016",
    "text": "I LOVE BD's.  This is the second year in a row we've celebrated my birthday there and we will continue to do so.  It's such a fun place!  We always get the unlimited bowls because I like to try different combinations and for $3 extra it's totally worth it in my book.  They'll also give you a to-go box so it's great to make an extra bowl and then take it with you for lunch the next day.  Our server was super friendly and she kept our water glasses full and replenished our rice twice (each table gets white and brown rice to accompany their stir-fry).  The selections on the stir-fry bar were plentiful and well-stocked.  My favorite combo is sirloin, scallops, lo-mein, tons of veggies, fresh garlic, and a combination of bbq and hot chili sauce.  SO delicious.  We didn't order anything from the bar this time but their drinks are usually strong and well-priced.  This is a great place for a group and perfect for picky eaters.  We'll be back for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1_GyI0-gY3W0B9rzFDA_A"
  },
  "Px2UHwmbXiuvjJF-F18UJg": {
    "date": "3/26/2015",
    "text": "I like this place and this concept and on top of it the price.  If you've never been here I highly suggest it at least once.  BD's is a do it yourself with a little help all you can eat protein/vegetable/sauce party with a chef show in between preparation and eating.  Here's 10 steps to how you eat here...  1. Get a bowl 2. Pick a protein  3. Pick a vegetable  4. Reverse step two and three if you're experienced 5. choose a sauce or mix of sauces and spices 6. take it to a strict customer line up to get cooked 7. Watch the show and talk to the people around you 8. Order rice or wraps or nothing 9. eat it 10. repeat all you can  Go for lunch and total it's $20 a person drink and all.  The alcohol is priced fair and the staff is always interesting and helpful. Well worth any money spent for what you get.  Highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "zUQVfRIwoDJb_-8qiWUNwA"
  },
  "9oF7Nz6AUWOzixpI5BhHjA": {
    "date": "2/17/2015",
    "text": "So obviously this place is user-dependent. If you know how to cook a bit and choose your items and sauces well, you're sure to win. If you're unable to do so.... you'll lose. So I'll rate them on what they can control.  I've been here 4 times so far. Every time the meat is well stocked with about 5 varieties of land meat (chicken, pepper sirloin, sirloin, and lamb), a few seafood options like squid, fish, and shrimp, and a couple bonus items here and there. The veggie options are similarly ample and varied with peas, baby corn, green peppers, and tofu being frequent. They also carry raw eggs.  They cook fast, they cook well. I've thrown some weird requests at them like the time I made a 8-egg breakfast omelette with potatoes, bacon, and cheese from the salad bar. They still nailed it.  The cost is like $15 for unlimited food that you can custom flavor. That's pretty good!  Jason's rank order list of Pittsburgh Buffets (updated occasionally): top tier - Quaker Steak (Robinson) - buffet tuesdays - The Library (Carson) - buffet tuesdays and sundays - BD's Mongolian bbq  Middle tier - Quaker Steak (Pleasant Hills) - buffet tuesdays  Low tier -Sushi Kim (friday and saturday kbbq buffet)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "ObrVX0Z7lw7tFF1xklfmbA"
  },
  "Ck3LqKz62EGv4nXzh0leig": {
    "date": "7/5/2013",
    "text": "The concept here is just...awesome.  I love build-your-own, all-you-can-eat, salad bar option available places SO much. I really do.    The food - terrific. As a seafoodie, I couldn't be more content. Scallops and salmon and shrimpies, oh my!  The layout - not bad.  Not perfect, but a-ok.  The price - depends on how hungry you are. For dinner I think one bowl is something like $13 and bottomless bowls are $15.  I say, go bottomless or go home.  Skip the salad bar though. It's a little bit of a waste of space.  And this is coming from salad bar's number one fan in the world.  I will say that the orange cream/tomato soup is pretty stellar and a nice complement to pour over your grill creation.  The service - oy.  It's not AWFUL. The staff is always friendly, but they just don't seem that efficient.  The best service I've had here has been at the bar with the bartender.  I'll probably take that route in the future and it seems that the main wait staff just can't totally figure it all out.    Pretentious alert - I've been to China to an honest-to-goodness Mongolian grill. The food is pretty dang similar so Pittsburgh has a real gem here.  Allow enough time for service on the slow side and you'll leave satisfied.  Also, join their e-club - the coupons are the BEST.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-ARdx8hOcEWlMDjzwLYZ_g"
  },
  "xX03hNHvrE14_K933lsOlA": {
    "date": "4/9/2016",
    "text": "Amazingly awesome place. Found this place on my trip to Pittsburgh wishing and waiting for one to come to buffalo.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jLhKq3AxfjyD3kzOhGqsJA",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jLhKq3AxfjyD3kzOhGqsJA/o.jpg"
      }
    ],
    "user_id": "GkpV4mnaaZYLM1UXyqBpQg"
  },
  "A27aOvFiIjrU5mIjrpdzNQ": {
    "date": "1/27/2017",
    "text": "Carry out - this review applies to the carry out experience.  Ordered one of the stir-frys.  Cost a little over $13 and was a tiny portion.  Smaller than you would expect for an appetizer.  Literally went back out to a different restaurant after finishing it.  The dish wasn't especially good either.  Was very disappointed with the experience.  After discussing this experience with others, apparently the in restaurant experience is quite a bit better.  Just avoid the carry out apparently.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g49MsYxBLha9Thzv1E3Uug"
  },
  "pU39p7DcY_coaL1Odi6wUA": {
    "date": "1/26/2017",
    "text": "Ok where do I start? I must admit I ruin my first experience here because I didn't have a clue what to do. Although the waitress was very pleasant she  was pretty vague on instructions for a first-timer.Therefore, I made the mistake of completely  filling my bowl up with meat. leaving no room for veggies.In her defense,she offered me another bowl for veggies,no charge. That's when she thoroughly explain how to select meat,veggies and sauces which is very tricky because they all looked delicious. Positive my next visit will be better now I think I got the gist of it.However my meal wasn't a total debacle the chili garlic sauce I choose was outstanding. The guys stir fried dish to perfection,didnt overcook. Cant wait to go back, I got a few delicious ideas for next meal. will be back soon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ATl-qRTqe_AwCTj_T2p3w"
  },
  "Jw_lIDI7HinxWpq5kzhXcA": {
    "date": "1/11/2016",
    "text": "The service was excellent. The quality of food was mediocre and the price was bit too pricey.  Service: excellent.  I went with my BF and he wanted all you can eat. I just wanted 1 plate. My first plate, I was mistaken into trying to follow the recipe and make my own sauce. It was GROSS, so I asked the waiter for another plate so I can try again, this time with premade sauce, thinking now i guess i have to pay for the AYCE price. The second place with the premade sauce was good. To my surprise, my waiter only charge me for the 1 plate price since i didnt even touch the first plate.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cpx_JVTZpG92PZFjMB65GA"
  },
  "Zz-7-BV3vdVAafPq4aMcYQ": {
    "date": "7/15/2015",
    "text": "The way this place works is pretty cool. You get a bowl and just stack it with all different types of meat and seafood. The choices were overwhelming but all great. It was interesting to watch them make your creation. For the amount of food you get, the price is good as well. I'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "04Yay6wY_leHMTxLV7h4WA"
  },
  "42vg9D92LwZ-GDo3_PrQcw": {
    "date": "7/24/2016",
    "text": "Love love love love love this place. Don't know how many times I've been here now, was trying to do lunch once a week or every other week. Can't beat the quality for the price. Delicious soups that aren't the same old stuff you get at other places. The bacon on the salad bar is best I've had on a salad bar. I go early for lunch, beat the crowd and no waiting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zrO1IWna2hqDlJsTF_l-gA"
  },
  "OBOzZ7ilGkUkx8nQOS1b4Q": {
    "date": "1/10/2017",
    "text": "I was disappointed with my first trip to BD's. I do not have one near where I live, so I went to this one when I recently was out of town for a Steelers game. I have heard many people rave about BD's so I was excited to make my first trip there. The service was good, the cooks were friendly, the restaurant was clean, the prices were descent. My big problem was the quality of the food. The shrimp they had were literally about the size of a penny. The steak they had, at least after it was cooked, reminded me of steak ums. The chicken was decent, the had imitation crab. The vegetables and sauce were normal, nothing to write home about. I wouldn't even mind paying more if the quality of the protein was better, basically it's a glorified create your own stir fry joint. I wouldn't go back, which is sad, because this place does have potential.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NHtoRhGKKeKU6OLXfh-vrg"
  },
  "R1Qw3cJGIv16Scv7q1LklQ": {
    "date": "9/10/2014",
    "text": "This was a different experience,  they have stations with different kinds of meat fish and a vegetable station and spices . Your suppose to get a bow,l go to each station pick the ingredients you want take it to the cooks and then they cook it for you while you wait dosent take long.  They have an all you can eat option . And I was surprised the waitress told us we could take a meal home she gave us a box.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ahl7wBbav9ZoBrvwi3vyew"
  },
  "mCYs0KHUbYvQyhZLooxePA": {
    "date": "9/25/2013",
    "text": "I really love Mongolian grills, but this place was lousy. The white rice was undercooked and crunchy and the brown rice was overcooked and mushy. It was also super salty and inedible. The stuff we fried up was mediocre. We left our food and didn't take it with us.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "uH0I8STxSnHWb3Py3SVogQ"
  },
  "pI7rYhBYPBnU2T1shEUvtg": {
    "date": "6/15/2014",
    "text": "I just recently had a meal here and wow did it hit the spot. Our waitress was very patient given how busy it was and, as we were a moderately sized party, very effectively attended to our needs. I also found the establishment to be clean and well kept. In fact my only gripe would be that the bowls were too small to accommodate my overly anxious eyes and appetite as I wanted to grab everything I saw at the self-service bar. This was rather minor though considering the selection, variety, portion size, taste, and overall feeling of satisfaction all at a very reasonable price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5Z3aJjyr8YD892R7jw_3Iw"
  },
  "o20yw2DT8jvfx9_uNe0IbQ": {
    "date": "7/28/2014",
    "text": "amazing happy hour, especially during Mondays it runs 5-9. Half off wines drafts and appetizers and 2$ off specialty drinks making the margarita only 3$!!!! There's so many flavors to choose from too! Blood orange, prickly pear, Mai tai.. Too many to name! Great place to start to explore south side !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HwB7VDJeQ4qOMcYyP5-mSQ"
  },
  "wCLvvfx2v30Kr3Ei1wkZ_Q": {
    "date": "2/18/2012",
    "text": "My family will return again and again.  Kids meals are all the same price.  My kids opted for the bowl instead of the menu fare.  Really nice because even for picky kids, there are so many choices.    I tried two different bowls while there with the brown rice.  Everything was prepared perfectly.  There was nothing I didn't like - because I chose all the ingredients.  My husband equally loved his dishes.    The staff was very helpful and attentive.  They could ease up a little on the upselling, but I understand they were trained that way and the staff is still learning the ropes.  I was a little put off by our waiter bringing the desserts to the table and offering them to my kids without asking us first.  I would not have let my children have dessert if I had been ask but it was already in front of them so I didn't want to start a battle in the restaurant.  I caution people with ANY food allergies.  They use utensils on multiples peoples dishes at one time.  If someone has a severe egg, seafood, peanut allergy, they could be exposed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yRt-Li8SPtbZISHIvbG_-w"
  },
  "8uqmmY-2N_4R5vq81sulmw": {
    "date": "4/28/2014",
    "text": "I have been here just once, I must say I have never seen anything like this before. They had a wide range of food items for the buffet. The interesting part, they cook what you select from the buffet right in front of you on the grill. The food tastes really good. Good ambience, moderately priced. I would recommend this place for dinner.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U5ra-0o82UJqsy_TqZWLSA"
  },
  "EmJQ77c4NhXqkdhDJT2nVQ": {
    "date": "11/17/2014",
    "text": "get the all you can eat--it was great.  Ask for Julia to be your server---she is so sexy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5tc0g2WKpWT73q9hbIPBoQ"
  },
  "k1BQAEH9tDYzmGRzR9WVNw": {
    "date": "2/19/2012",
    "text": "Overall, I enjoyed it here.  It's essentially a create/build your own stir-fry.  The waitress brings you a bowl and then you can go to town at the buffet style setup of ingredients.  Once you've chosen your meats, veggies and sauce, you go up to the grill and they grill your concoction while you watch.  For my first bowl, I went with chicken, pasta, broccoli, peppers, carrots, egg and a chili garlic sauce (one of the hottest sauces on the menu).  For my second bowl, I went with scallops, rice noodles, carrots, water chestnuts, bean sprouts, egg, broccoli and the teriyaki sauce.  I really like a lot of flavor in my meal and love anything spicy so my preference was the first but they were both good.  They also will bring out rice, shells or lettuce wraps if you want to use those with your bowl of goodies.    Here's what I didn't like...the strawberry peach sangria.  I love a sweet drink more than the average person but after waiting for about 20 minutes, I was really disappointed with our pitcher of sangria. Where was the wine portion of this drink?  It tasted like kool-aid mixed with Sprite.  BOMB.  I hardly ever leave a drink behind but I did here.  The rest of the table was equally disappointed.    We also opted for a brownie sundae to share for dessert.  It was gigantic and it was good but didn't blow me out of the water.  I don't know why.  Maybe because I wanted the brownie to be warm and melt in my mouth and it didn't.   Lastly, I'll say that we went here for the soft opening so it was very crowded, the waiters/waitresses were brand new and didn't know the menu very well and the service (including the bar) were running behind.  My only warning is to fill your first bowl as high as you can.  Once it cooks down, it doesn't seem like much is there.  One bowl left me feeling hungry and wanting more but two made be feel as though I had gorged myself silly and shouldn't have gone up for more.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "89R0mC9DUwc-P1UCoh8s6w"
  },
  "SThrZwtXKApSDofVKqLvZg": {
    "date": "3/13/2014",
    "text": "The location is great and parking after 6pm is free. Friendly atmosphere and a good selection of food. They could use an additional cook there were only 2 working the grill at the time we were there. I had dinner with my wife daughter and best friend. They mixed up the sauces and spices that my wife and I had and our tastes are very different. I would go back but watch the cook a little closer next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZ2w2bQNAwY5Wd3XXNbIhw"
  },
  "MYrA2I4lFUenDj8PyGWZAw": {
    "date": "7/19/2014",
    "text": "Great as always food we love it here! Kielbasa and ribeye steak are the way to go service could be better at times but you can beat the food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FQ4SAriivb0RQqkmw-H6ow"
  },
  "yPU9MgG527ucjja4OQMdSA": {
    "date": "6/8/2014",
    "text": "I took my lunch here i like it is different than others you can choose your food by your self and they will cooked it in front of you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ar-M9TT6s1ZpB6lnqXdWwA"
  },
  "lfewQEgkec0CpZrdC-aUSA": {
    "date": "11/16/2013",
    "text": "I was just there last week. It was about $15 for all you can eat bowl, I believe just one bowl was $13, so for the $2 extra dollars might as well go for it. Skip out on the appetizers, even for half off during happy hour, wasn't anything special. I took a quick peek at the soup & salad bar and it didn't seem to be worth it either, although I believe it's included in the unlimited bowl, not sure about that though. My other suggestion would be to put your veggies in the bowl first and then pile your meat on top. They have it set up so you do the meat first and then veggies, but I feel like unless you got mad skill, you end up not being able to put as many veggies in your dish and then your meal seems like it's missing something. Also, there's a huge selection of sauces and spices.. I kind of felt like it was overwhelming, because there were so many options and not really anything you could sample them with. So if you're not really sure of what you like or want, it was hard to try and figure out what would be good. I know on the menu they tell you some things that you can mix together for a certain taste, but it's not listed by the sauce section anywhere. First time up our griller was pretty good, but the second time the guy was too busy doing tricks that he didn't turn our food enough and it ended up being slightly burnt on the one side. Oh - what I thought was nice, is the waitress suggested that we get the unlimited for $2 and she'd box it up so we could take it home for lunch. So no matter what, you're taking something home. We went around 5, so it wasn't that crowded yet.. around 6 more people started coming and lines were formed at the tables and grill for a small wait (I know there were a lot of complaints about that when I read reviews about the place). Overall it was a good experience. Would I go back? Probably. I left feeling like it was convenient, something new.. but I felt like I could just make it at home.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rfy598B1ElBFv8uH4cVLJg"
  },
  "i02Ar49wrTeeahTT4m2BMw": {
    "date": "3/20/2012",
    "text": "Disappointing considering the buzz I've been hearing. Food was okay and I liked the fact that there were so many choices but that's about it for the highlights. I've honestly experienced better atmosphere in a high school cafeteria. The restaurant is like one big mess hall! Rows of brown tables and chairs, no dividers, no decor, no greenery, no wall art, nothing! Just tables, chairs and people.   The experience itself was very stressful especially with a young child. Having to select your food whilst juggling a toddler and then waiting in line whilst juggling said  toddler plus bowls of food and sauces, and then to having to wait again whilst watching your food cook is not my idea of a relaxing dinner out.   Prices seemed a little high and I did not like the fact that, even though we ordered the 'unlimited' bowl, we had to wait (and wait, and wait) for our server to bring us additional bowls. We also had to wait (and wait, and wait) for rice and when we did get it, you would have thought there was a rice shortage! Skimy, skimpy...and we never did see him again to ask for more.  Restaurant was very noisy, gong banging every 5 minutes, servers hooting and hollering at one another and I swear they must have spilled, broken, and/or dropped at leat 10 different drinks while we were there. Maybe it was just a bad night...  The food, once I could actually eat it, was decent (in a fast food sort of way), the selection was nice, and the huckleberry iced tea was delisch!  Not sure I will be going back in a hurry...just too extremely stresssful in my opinion...and they have some work to do. Like better description of sauces, combo suggestions, speeding things up at the grill or finding a better method for 'crowd control' and for the love of all things holy...have trays available for carrying bowls, sauces, entree plates, etc.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jlv56gDY89ImrHkc5nIFsg"
  },
  "HPmISmYtjU0N6_mRqG_hPQ": {
    "date": "9/24/2014",
    "text": "I love going to BD's! It doesn't get crowded for lunch, but it does get pretty crowded for dinner every time I've been there. You can pay for either one bowl or you can pay a price for unlimited number of bowls. There are three buffet like stations. The first one has all the raw meat/fish, you can mix meat, everything is how you want it. Next, they have vegetables and eggs you add to the meat, and then lastly you grab a small bowl and go to the sauce station. They have a variety of about 20 sauces, again you can add as many as you'd like, behind the table they have suggestions on what sauces taste good together and what style of sauce they are. You can then add any spices to your bowl if you want. Next, you take it to a hibachi type center, where the cooks take your bowl and cook it right there in front of you, they take multiple people's at once, you just wait there until your bowl is done. There's a salad and soup bar also for an added price. You also can either get rice or tortilla wraps to go along with your bowl. They only thing I don't like about Bd's is that the raw meat can get on the handle and can get on your hands, and that's a little bothersome, they do have hand sanitizers around the buffet tables, but that does bother me....I definitely recommend to anyone to try Bd's Mongolian Grill!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "lD_8ob0NCminnct-xP1hTA"
  },
  "CnJR4Q7dpxXIjnncck_IUA": {
    "date": "9/24/2012",
    "text": "This place is great!! Just be sure that you know what you are getting in for before you go, so that you are not disappointed. This is the place to go when you want a loud, interactive, fun meal. Do not go here if you want a quiet sit down dinner night, with people waiting on you hand and foot!  I personally had a great time here. Their selection of meat (duck! calamari! scallops!), veggies, and sauces was out of this world. The lines to get your food grilled weren't too bad, but know in advance if you are going there on a Saturday, you will wait about 10-15 minutes for your food to be cooked. That is just the way it is - it is a busy place! The cooks fry up everything on a big circular grill, and it is a lot of fun to watch them. They are interactive with the guests, and will cheer you if you give them a tip :)   You will also get a big birthday song if you go for your birthday.  The waiter was exceedingly polite and cheery too.  Yes, it is one of 'those' places! Go prepared to have fun, be loud, and interact with the staff, and you will have a great time. If you don't want a whole restaurant singing to you, just stay home and go another night when you are in the mood for a louder, more raucous experience. You will have a much better time that way!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hbk0ti7bc5UEz1W8D-r4FA"
  },
  "lx7eChj80oqmumZ0cqx0RA": {
    "date": "9/7/2013",
    "text": "This place is brilliant. Choose your meats, choose your vegetables, choose your sauce, and then have it cooked in front of you. Good beers on tap and decent sized televisions for the game. I will be back for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u8xbKg7tmA-LhuJkypf1Qw"
  },
  "puFJH_2iHXvISrwwMd6Gpw": {
    "date": "3/18/2012",
    "text": "Booooo!  I am so disappointed in the Southside Works for wasting prime reality on this place.  A friend of mine suggested we go here for dinner the other night and let me just say I was underwhelmed and \"skeezed\" out.  If I had known this was basically an \"Old Country Buffet\" disguised as actual Mongolian food, I would have aggressively suggested somewhere else to go.  Also, I didn't realize it was a corporate chain either; I find a lot of value in the Cheesecake Factories of the world, but in general I don't get real excited about chains or franchises.   Ok that said; let me say what was good about the place:  1) Healthier options 2) Friendly and enthusiastic staff  On to the negative stuff:  1) It's a buffet! 2) Our waiter, clearly instructed by his management, had about a 10 minute opener listing all the rules and health code regulations when using the buffet line. Overkill much? 3) The place was relatively messy.  Sauces spilled everywhere, food bits hanging around on the floor, dirty tables, etc.  I think this is to be expected when you have your customers doing the majority of the food service for you. 4) The barriers on the buffet line were sparse, I felt like everyone going through the line was breathing all over the food. NOT APPETIZING 5) The menu is all over the place. They offer Asian, Italian and American ingredients; these are paired with recipe cards that you are advised to follow.  Way too complicated and no real cohesiveness to the theme or style of food. 6) In order to get your food you must huddle around a large grill with about 15 other patrons while they cook your food.  This is a novelty that I think most people will endure once. 7) They offer a \"salad\" bar with the all you can eat option, the salad bar stinks.  It's brown iceberg and some other random under temp veggies on ice.  The soup is so ridiculous as well, obviously frozen Campbell's Select or something of the like.  So um yeah, this was far from the worst place in Pittsburgh, but I won't be going back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "3WZt8ICFLpogX-nORBYETA"
  },
  "W9hyV9qGEvusMB63QzT2Fw": {
    "date": "7/21/2012",
    "text": "I have to admit I was skeptical about this place before going there last weekend for the first time. What is Mongolian food?? Will they have anything I can eat there? Isn't this a chain? I don't like chain restaurants. Then I stopped whining and looked online at the menu. I was intrigued and agreed to go. I'm actually glad I did. The dining room was not exciting, very basic. We took our seats and our waitress asked if we had been here before. My wife has been to one in Maryland, but I answered \"no\", expecting an explanation of what I was supposed to do. Well, she plopped a bowl down in front of me and walked away. Umm, ok. My wife thankfully was able to walk me through the process. There were many starches to start making your own stir fry with. Rice noodles, egg noodles, pasta, you can ask your waitress for rice and tortillas. Great. Next we made our way to the veggies, walking past heaps of very unappealing raw meats. I don't eat meat, but people seemed to like it. I just hope it was in some sort of refrigerated container. I loaded my bowl with some tofu, and was impressed with the selection of vegetables being presented in this salad bar type procession. Edamame, bean sprouts, and bamboo were among the more typical beans, potatoes, baby corns and water chestnuts. I piled my bowl high and went for the sauces. They had tons to choose from, you could essentially make your own by combining a few. I tried the lemon initially. Then we walked over to the \"grill\". This thing is massive. They can cook LOTS of food at once, and I have no idea how they keep it all straight. They asked me if I had any food allergies, and I told them I was a vegetarian. They promptly cleaned and scrubbed the grill, then sectioned it off before placing my creation down, which I liked. The possibility of meat juices contaminating my dinner isn't pleasant. The guys at the grill were very skilled, not to mention entertaining to watch. They added the sauce to my wonderfully cooked stir fry, and I took it to my seat. I was surprised how tasty it was. The tofu was even nicely browned, and the provided chopsticks - bonus. We decided to try another round (they have an all you can eat type option), and picked at our second bowls worth, as we were already quite full.  Our waitress was not attentive. When she handed us our second bowls, she disappeared. I think we waited 30 minutes from the time we finished eating until she came to ask us if we needed anything. She never asked how anything was, and our waters were gone. I would have given this place 3.5-4 stars if we had better wait staff service. Seriously, it's not like she even had to bring us our food! The guy at the table behind us had a bowl of raw meat sitting on his table for 10 minutes before one of the hostesses told him what he was supposed to do. She never told him either. I will probably come back, as I enjoyed the choices and the flavors. I just hope I get a different waitress.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_fpHwIiEJOp79qED9YSE7Q"
  },
  "hPxxNYdcu6hWXS0ra7h-1w": {
    "date": "4/3/2012",
    "text": "Before I went to BD's Mongolian Grille in the South Side Works, I saw the commercials and watched the videos online, and I got excited. It looked like it would be a hibachi style place with cooks doing tricks and the food being really interesting. What I found was place that was a mix of Benihana and Moe's Southwest Grille, with an all you can eat buffet thrown in. I actually got dressed up to go to BD's, but I realized quickly that I was over dressed. Again, think Moe's Southwest Grille. I was surprised by the casualness of the restaurant, being that it is in South Side Works and it seemed from what I read that this was an experience restaurant.  The way it works, is you get a bowl at the beginning, and head up to a big salad bar type set up. From there, you pick from raw ingredients like chicken, shrimp, steak, pork, mahi mahi, and others. I liked all the choices and everything looked fresh, but I have to imagine that the little kid across from me that was using the raw chicken tongs to get raw steak didn't understand what salmonella is. Then, you move on to the raw veggie section that is filled with everything from broccoli, mushrooms, bean sprouts, peppers, onions, and lots more, including a raw egg that the cooks will scramble. Finally, it's on to the sauce cart, which is where the food gets it's flavor. You can choose from a ton of sauces that are sweet, BBQ, hot and spicy, or many others. I tried the peanut sauce which had a slight kick to it but wasn't overpowering.  Next comes the part that is supposed to be fun- the cooking. You stand at a counter that encircles the round cooking surface where the cooks make your food. This is where the commercials show people throwing food around and doing tricks, but the reality is you stand there and watch the guy take your food and dump it on the grill. After about what seemed like 15 minutes, and a few turns of the ingredients you've chosen, your food is handed back to you to enjoy. Personally, I didn't like that I had to stand there for that long, and what was worse was since they were busy, I had to stand in line for 15 minutes, holding my bowl of raw meats and veggies while I waited for an opening at the counter. By the time I sat down, I spent 30 minutes making my meal and had a cramped hand to show for it. With that said, the food was good. The ingredients and choices they offer allow for endless combinations, and since you can go up multiple times with the unlimited choice, you could try lots of combinations until you get it right. I also liked the go-withs, like the white and brown rice, tortilla shells, and lettuce leaves (for making lettuce wraps).  As for their salad bar, I wasn't that impressed. The soups were clam chowder and white bean chili when I was there (are those Mongolian?) and the salad bar seemed pretty standard. I would suggest not filling up with the salad bar and instead go right for the hot food. In all, I wasn't impressed with BD's, but it wasn't a bad experience. I didn't like the wait time for my food, and the experience makes it hard to enjoy with someone else- you're always waiting for your next dish or building a lettuce wrap to really appreciate anyone around you. Plus, the design and attitude of the staff makes you feel like your at a casual restaurant (again, think Moe's Southwest Grille), so it doesn't feel like a special experience, but more like a gimmicky restaurant. On top of that, they do a good job of discouraging you from going up to make new bowls since there's such a wait time involved. They could have had two grills going, and there still would have been a line. I was with a large group- some of my friends loved it, and some hated it, but for the most part the food was good and the prices aren't extravagant. Just don't expect a fancy dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tYPh3vjZsi5xMEA561mGpg"
  },
  "ns5E-l7f6JyVyT81sphyuw": {
    "date": "4/7/2012",
    "text": "I came to this place because a family friend was in town and enjoyed it wanted to go back for a second time in the same week. It seems like a cool concept, but I did not like certain things. I think while it is a fun idea to \"make your own dish\" it didn't make for a nice dinner. It made it feel fast food-ish. Not somewhere I'd want to go on a date. The whole getting food process wasn't as fun as it should've been either lots of waiting so conversation time was definitely lost. If you know how to make Mongolian I'd say go ahead try it if not, go somewhere the prepare the dishes for you.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "unnIZzjpZyuKYeje5gjPEw"
  },
  "KTi6qc9papIRqPnouDOTXw": {
    "date": "4/15/2019",
    "text": "very disappointed. the meats seemed unsanitary and didn't look fresh, when i went to have my food cooked other people's food was getting into mine ( i had noodles and kept finding rice??) the service was slow and didn't seem very friendly was over priced for bad quality",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qShqGHbUTD48-7CMNmOZWg"
  },
  "9FJ_T-vKsiWV-9hQ2U_yMw": {
    "date": "6/4/2017",
    "text": "BD' s is a buffet with a stir fry twist. You fill up a bowl with meats, noodles, veggies and top it off with seasonings and sauces of your choice or follow a recipe that they created. There's also a salad and soup bar. They have large sweet specialty cocktails and frozen drinks as well as menu specialties like fried rice. It's the perfect place for picky eaters and to bring kids.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2YVGKKcup6mjQmDQ6arEg"
  },
  "Ie97q6iZD-iI9kHQkmYtXQ": {
    "date": "6/30/2014",
    "text": "After a bicycle ride, this was a great spot to dine outdoors and have a nutritious and filling meal.  After the server's guidance, we promptly piled on the protein and veggies, picked from an assortment of sauces and mixed them with others, and proceeded to the preparers who mixed it all up on the grill, doing what they do best.  Scrumptious.  Tip:  Pile it up high in the bowl given you because it does shrink in size when cooked.  Very fairly priced.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "185ejxSO1yxHKVNU1ds1og",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/185ejxSO1yxHKVNU1ds1og/o.jpg"
      }
    ],
    "user_id": "GMKoemATfrXg1deaXxt2jA"
  },
  "5hRdAC5L07Tj7AxPLHw_DQ": {
    "date": "5/17/2017",
    "text": "I have been to this place a few times and its just ok. Nothing special. The meat quality isn't terrific but its passable, the salad bar isn't very impressive or fresh. The price is decently reasonable; not too cheap or not too expensive either. No need to go out of your way to come here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mxufNEcZIYndtjPHVtCh5w"
  },
  "4jycDwCU08WChsWDtLVHew": {
    "date": "1/4/2016",
    "text": "In a nutshell: customizable stir-fry, all you can fit in your bowl. Flavors depend on what you put in your stir fry. The contents of your bowl get cooked for you.   The concept of all you can fit in your bowl sounds great but it doesn't end up being all that much. The bowls are not that big which makes it awkward to put in a lot of ingredients. Not that I'm asking for huge portions but for $14, I'm not sure if that's worth it for a small bowl of stir fry. For $3 more, you can get unlimited bowls. In terms of flavor, it really just depends on what veggies and sauces you put on it so the potential of having a great stir fry is there. It's just without knowing what the sauces taste like, it hard to pinpoint what you'll like.   I should also note that all the ingredients sit out and there's one buffet that stores raw chicken right next to noodles among other non-meat ingredients. It's all cool that it's raw since it'll all going to get cooked anyway, but the risk for contamination is unnerving. If someone puts the tongs back in the chicken juice and someone else goes to grab that tong and then another tong and another, those chicken juices will be on every tong and spoon. I know I'm quite the germaphobe so I'm sure not many are thinking in terms of contamination, but I definitely recommend washing your hands after the cooks finish your food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "txkcUWkPyDx0NqG7kjN7LQ": {
    "date": "11/25/2015",
    "text": "Very Positive Experience   -Clean Dining Room  -Prompt Table Service  -Amazing Selection  -Super Fun Grill Guys  I give high marks for this one",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "1V5tTGQbhaCBbmH-EVT7KQ"
  },
  "RK9KzzrQDGTj6cnSIBoz2A": {
    "date": "9/30/2017",
    "text": "This is a nice stop in the South Side.  Meals are a good value.  Lots of fresh vegetables and tasty sauces.  The staff is friendly.     I enjoy having the opportunity to mix items in a big bowl so that every meal can be different.   Choice of spices allow you to satisfy your mood of the day.  This is worth a try.  I'll be back.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 15,
      "cool": 9
    },
    "photos": [],
    "user_id": "DYqujEDnSMgwL7sFTRSv8w"
  },
  "xa5-qONHE3YoO7exVPaZMg": {
    "date": "9/29/2016",
    "text": "This was my first visit to BD's and it was a great time!  The waitress started us of by asking if we had every eaten there before and when we said no, she provided an indepth explanation of how to proceed!  Since it operates sort of as a buffet but also as a live cooking experience it can be a bit overwhelming to new comers, but she did a fantastic job of giving us directions.  We took our bowls to the food line and began to make our selections.  The food looked fresh and good, which is a plus!  We filled our bowls with a wide assortment of meat, fish and veggies and selected our flavorings.  The cook was great too!  He cooked our food with flair and we watched as he spun his cooking utensils around with some skill.  Once the food was grilled we found it all to be tasty and wonderfully grilled.  The waitress stayed on top of things and kept our drinks filled as soon as we emptied them.  I really, REALLY enjoyed the experience!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GCd6RJWfuO7MDhJWZJg3KQ",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. Awesome food and great grill master!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GCd6RJWfuO7MDhJWZJg3KQ/o.jpg"
      }
    ],
    "user_id": "tHgqDvB6eDtY-1N8-12Ttg"
  },
  "DPdIK_ODOuPs3JNvZ-s56A": {
    "date": "5/17/2013",
    "text": "After getting tired of my wife bugging me forever to take her here, we finally went on Mothers Day. I wish I had listened sooner as this place is great! No wait and no need for reservations unlike the Cheesecake Factory across the street which had a 2 to 3 hour wait!  Here's how it works:  1. Once seated a server comes and takes your drinks orders and hands each of you a bowl.  2. You go up to first station, the meat station and add as little or as much chicken, steak, pork, shrimp or imitation crab meat as you want. Ignore the \"pick one meat only \" sign. You can get all the meat available if you want. There are also lo mein and rice noodles available at the station   3. Then you go to the vegetable station and add as much spinach, broccoli, snap peas, onions, mushrooms, water chestnuts, tomatoes, carrot and more to your bowl.  4. Next you go to the sauce and seasonings station and pick from over twenty choices.  5. Finally you go over to grill. You will be given a number from 1 to 10. The number you get is were you go and place your bowl and sauce(s) and wait while your food is cooked. Be sure to tip the cooks. They will give you a cheer when you do.  6. And last but not least sit and enjoy.   Once you have your food your server will offer you white or brown rice, lettuce wraps or tortillas to go with your meal.  One bowl cost $8.99 for adults and $6.49 for kids 3 to 11, but unlimited bowls for adults are just $2 more and the second kids bowl is free. Even if you're full off the first bowl go through again and take it home for lunch the next day.  Our server Luke was great. He explained to us how everything worked. We each started off with a tasty Raspberry Lemon Aid.  For my first bowl I had lo mein, steak, mushrooms, onion, broccoli and yellow, red and green peppers. The cooks were really nice and talked to each person while they cooked there food. They teased us about it being our first time there. Let me tell you, the food was delicious! Everything was fresh and tasted so good!  For my second bowl I had lo mein, chicken, shrimp, steak, mushrooms, onion, broccoli and yellow, red and green peppers. It was just as good as the first. I could only eat about a quarter of it and took the rest for lunch the next day.  They also offer appetizers and desserts and have a full bar.  Insider tip: Be sure to check in using the Yelp app to get $2 off of a bowl and also to sign up for Club Mongo for future discounts and free meals.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 10,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "1RACi1JHxrbP3O9_5CE3Uw",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1RACi1JHxrbP3O9_5CE3Uw/o.jpg"
      },
      {
        "img_id": "NDiGO3wX0VW94l5kh1KglA",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NDiGO3wX0VW94l5kh1KglA/o.jpg"
      }
    ],
    "user_id": "BjtJ3VkMOxV2Lan037AFuw"
  },
  "bt5s8EbrZCSJn0X4SbwQSg": {
    "date": "5/12/2017",
    "text": "Great Happy Hour with $3 Margaritas!!! Available Frozen or on the Rocks in a ton of flavors Prickly Pear, Watermelon, Blood Orange, Strawberry, Huckleberry, Pomegranate, Raspberry, Ginger, or Sriracha",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZqHwzFCbYKT1U-DrEP1IMw"
  },
  "xr__m2o7y_fm7nxcQjFolw": {
    "date": "7/15/2018",
    "text": "The food is great because you make your own combination. The service has been questionable. Sometimes it is great and sometimes it is less than poor. The guys at the grill are great, tip them well!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2v_SqV2c0mx39cF8XTHQiQ"
  },
  "v62wVnqZn6DlNOKIykv85g": {
    "date": "10/1/2017",
    "text": "Very disappointed as really used to enjoy this place. Went here for lunch on a Sunday, and had always enjoyed the lunch specials in the past, and this included weekends.   When we sat down, we were handed dinner menus and told they don't do lunch on weekends. I had checked the website to make sure they still ran the specials, and they clearly had it listed with no date restrictions.   Got up and left. Really unfortunate that they advertise one thing then change it when you get there. Also, one bowl for 14.99 for dinner is a TOTAL rip off.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S0ULDB4vJ0q4HxEcBJFZDA"
  },
  "H_uELzwbaUDDnmDrtX4VpQ": {
    "date": "11/9/2017",
    "text": "I would recommend this to anyone. The food is great... well if you know what you are doing(build your own bowl). Endless food is on $2 more than the standard price. Come hungry and eat well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w8XWsJZ5YYwVyU_qfy1GOA"
  },
  "bOPdf4ktgC7ngxpcilfkxg": {
    "date": "3/25/2018",
    "text": "if you don't like your meal at Mongolian it's your own fault! tons of options to personalize your stir fry make this chain a fun and delicious experience.           our service at this particular location was good and the restaurant was well staffed. pricing here depends on whether or not you get unlimited bowls (3.00 extra) and if you order any other sides.           stick with the stir fry and customize your bowl with whatever you like. my brother and I compete to see who can stack their bowl with more food. they offer flour tortillas, lettuce wraps, white rice and brown rice on the side included with your bowl. get these and make tacos! I like to go back up to the sauce selections and bring a couple back to the table for dipping (pro tip).           the salad bar is very basic but good as well. it's nice to have this as well as 2 different kinds of soup included in the price of your stir fry bowl. if you have room after a giant bowl of stir fry, a salad and a bowl of soup they have a list of yummy desserts, including deep fried oreos, which you already know are good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dRk7Hhos49RIdf7WWjrZ9g"
  },
  "1dD1AtIF_a0g76abn5YpLw": {
    "date": "7/14/2015",
    "text": "Sister dragged me down on a Monday afternoon. Not liking the crowds in South Side anyway, was only convinced by a free meal.      Wasn't crowded at all and sat immediately. My nephews had to fill me in on how it worked. Easy. Being in a wheelchair was easy to maneuver around. Stuffing things you liked in one bowl was difficult without overflow. Was a nice change of deciding how much of this and that.       I had gotten the pork, noodles, and a bunch of others (too many to list).  I really enjoyed watching the guys cook on the rounded flattop. Another customer stated sometimes they put on a show, but I missed out.  A few minutes later I was digging into a heap of goodness. The one bowl did me justice, but as for my nephew, he got seconds.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FtVTK-KxTAtLMDNQeTX1yA",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FtVTK-KxTAtLMDNQeTX1yA/o.jpg"
      },
      {
        "img_id": "Ae3ldsagwAAuZvaJoCp5vg",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ae3ldsagwAAuZvaJoCp5vg/o.jpg"
      }
    ],
    "user_id": "mS7wtPVBVf8_eTG2rO8hxw"
  },
  "Iso-QkFJ5SWtsQ8P-4USiw": {
    "date": "9/16/2016",
    "text": "So let me start off by saying that I've been here three times now and I like it. I do think that the stir fry bowls are overpriced for the little bowls that you're asked to begin with, but the food is good. Also, those three times that I've come here were during happy hour which makes it worth it. The margaritas are super sugary, but you can't beat $3 margs. The apps are delicious from the spinach & artichoke wontons to the dumplings to the fried rice---well worth half off apps! I'll continue coming here during happy hours.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UyXqGEKod-veD6m6Hq0EDw"
  },
  "o2S0Dl8uVYzQpVHopKXDuA": {
    "date": "2/13/2012",
    "text": "I had been dreaming of this place opening in Pittsburgh for years.  I had a girlfriend who worked at the one in Michigan and she guided me through the tricks and treasures of Mongo (as they call it, I know, I'm so \"in\").    We ordered a pitcher of sangria because sharing is caring folks!  I was very excited about it because I felt in the mood for something fruity and refreshing, something a sangria should be like.  This was not.  This was strawberry soupy-ness mixed with some alcohol.  It was not good.  I'm not sure if this was something the new bartenders made wrong or it's just the way they make it.  Just be warned:)  I was so the pro, I knew to not pile a bunch of meats into the bowl and I knew to pile that bowl high because it shrinks once it's cooked.  So I get my mix ready:shrimp and scallops, pad thai noodles, lots of veggies and a crap load of water chestnuts because who can resist those!  I choose the Bd's teriyaki the first round and the Kung Poa the second.  The teriyaki fell flat but the Kung Poa was just the right mix of spicy and sweet I was looking for.    For the grand finale we were brought out this massive glass full of ice cream, one massive brownie (that could really pass for a large piece of cake) whipped cream and fudge.  Holy bajebus it was huge!  But it was seriously massively delicious.  You absolutely have to split it or you may have to be rolled out.    The thing is, I think my palate has changed.  There's so many wonderful local unique Pittsburgh restaurants that offer such fantastic fresh food, it's hard to keep up when you're a chain.  Don't get me wrong, I'm sure this won't be the last time I go there or the last time I go to a chain, but it just isn't the same...and I think that's probably for the better.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 11,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "pmHwTZej-DeA4f4hhu_fYg",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pmHwTZej-DeA4f4hhu_fYg/o.jpg"
      }
    ],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "MEjMZSPBU2a1ML6eDEllvA": {
    "date": "3/9/2017",
    "text": "Very yummy. Like how you can pick the meat veggies and sauces. Shrimp was a little fishy tasting though. Will be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AYarmqNQXDpUdZIL-jSXtw"
  },
  "xFuKUljpnZhr-xjQjqgSTg": {
    "date": "1/3/2014",
    "text": "Several people kept telling me - YOU MUST TRY Bd's Mongolian Grill!!  So when my friend had her birthday dinner there, I thought it was a great time to try it out.  Unfortunately, I just wasn't impressed.    The party was on a Friday night and, of course it was hoppin'!  We were informed as to how the place worked, given bowls to fill, and told to have at it - Meats, Veggies, Sauces.  This is where they lost me.    The meat... it just didn't look good.  I also didn't enjoy the idea of raw meat sitting out there for people to self-assemble.  Maybe I just worked in the food service industry too long... but eww.  Also, it just didn't look clean.  There were decent vegetables - nothing gross or moldy.  They had tofu!  Thank goodness for tofu!  If it wasn't for that, my meal would have been a disaster.  Finally the sauces.  I will say, they just weren't clearly labeled clearly.  Also it was just messy.  If you don't know flavors, you won't make a successful stirfry.  There were several people at our table who destroyed their meals by incorrectly mixing sauces.  The grill is what sells the restaurant.  They guys that work the grill are efficient, comical, and friendly.  They are my reasoning for giving Bd's 3 stars.  I liked the grill.  Would I return to Bd Mongolian's?  If a friend had a birthday there, yes.  If not, I probably would choose one of the other SouthSide venues for my meal.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "g23xx_BkRti4H-zmbhnEKg"
  },
  "osGw6i_Q9amA-MBLY7T6kw": {
    "date": "7/16/2014",
    "text": "I love this place! If you are a person who isn't okay with buffet style this is not the place for you. This place is unique because you choose raw meat and veggies of a buffet, whatever sauce and spices you want and then they cook it in front of you on a huge flat top. You basically pay 1 price for the \"bowl\" which is endless. They cook whatever you can fit in your bowl and when you finish, head back to make a new one! They also have a kids menu. Standard ambience, nothing special. Patio seating available. Service is quick even when they are very busy. I have been here several times and will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mm9WYrFhiNqvHCyhQKw3Mg"
  },
  "vETbPkj0roRmYa3HiYRPjA": {
    "date": "1/11/2017",
    "text": "The winning combination of D.I.Y. and dinner and a show, BD's is a totally glorious experience. If you're doing a bowl (or multiple bowls), you're in complete control; personally selecting each perfect broccoli floret, each plump scallop, every drop of whatever sauce tickles your fancy. However much of whatever you desire, provided it fits in your bowl. After this satisfying process, you present the fruits, vegetables, and meats of your labor to the grill cook... And the show begins. Using utensils that are part tongs, part knife, they prepare your meal with the flair of a True maestro. You end up with your very own personalized masterpiece. It's beautiful, and it's okay to cry tears of joy as you eat it.  Also worth noting: the cocktails are worth considering, the beer list is usually quite decent, and if you're adding soup and salad bar, keep your eyes peeled for the Creme Andaluz... It is savory and sooo creamy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "EDa3oJ8qJa7QDY8a0DucxA",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. I always enjoy watching them grill my bowl of awesomeness",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EDa3oJ8qJa7QDY8a0DucxA/o.jpg"
      }
    ],
    "user_id": "01bmnye5yXRyDZ5Je6tnKg"
  },
  "IUAaWNAELvwYlhC8DrL08A": {
    "date": "2/1/2017",
    "text": "I can't believe I have avoided this place for so long! I don't know what I was thinking, but I can tell you I have been missing out!   The concept was odd to me at first, but quickly grew on me.  I strategically piled my bowl as high as I could with chicken, steak and veggies.  For sauce, I chose teriyaki and added fresh garlic, ginger, and a little bit of the chili garlic sauce. It was so delicious!  I'm always concerned that places like this will get soggy, but the grilling was great.  I had plenty of food leftover (again, strategically stacked my bowl).  I also loved the salad bar and the soup selection they had was really good. I will definitely be returning!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5diNOFykr0CkyTU950aybg",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. Yummy steak and chicken stir fry!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5diNOFykr0CkyTU950aybg/o.jpg"
      }
    ],
    "user_id": "cAvlJ-lvBywOjcG1FTC_7A"
  },
  "n6wnDfG-eETSraHwqr_uUg": {
    "date": "8/4/2017",
    "text": "I am not a fan of this concept, though the prices are reasonable if you know how to load up your bowl to maximize the protein compared to carbs and veggies.  The open containers of raw meats, poultry and seafood at the self serve salad bar-style stations grossed me out.  It just did not seem sanitary.  Thankfully, I ate my concoction and did not get ill.  I will not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FIZbme7EtIzh359iWjZENQ",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. Concoctions on the grill.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FIZbme7EtIzh359iWjZENQ/o.jpg"
      }
    ],
    "user_id": "G-uv9J_2-0OyeIlNfHuYjw"
  },
  "JuwavJnRGL_dbnKsG46T-g": {
    "date": "12/28/2016",
    "text": "I really used to love this place and it saddens me to give this place 2 stars.   Pros- with an unlimited bowl you have endless options. You also get complimentary sides: white rice, brown rice, tortillas, and lettuce wraps.   Cons- quality has gone down while prices have gone up. If it's busy the wait to get your food cooked on the grill can take awhile. The cooks never really do a good job of keeping others stir fry from flying into yours. After this past trip my stomach was so messed up.   Sadly I think I'll just have to retire this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cmCY-LaUjrQCJJ8mk_erNQ",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. The grill",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cmCY-LaUjrQCJJ8mk_erNQ/o.jpg"
      },
      {
        "img_id": "WFmaazw8SkIW3I8gwD5cUQ",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. My stir fry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WFmaazw8SkIW3I8gwD5cUQ/o.jpg"
      }
    ],
    "user_id": "WgEKUJoh5msZlOlTCKnKtg"
  },
  "3LGZf2rYQkmLPAGL-VQgEw": {
    "date": "8/27/2017",
    "text": "I stopped by here after a bike ride from Millvale to Southside with my wife.  We saw this place in the Pittsburgh enjoy book and liked the idea of a create your own stir fry menu.  We arrived on a Saturday afternoon and were seated right away.  The inside looked like what you'd expect, having a soup and salad bar on one side and the raw meat/veggie/spice bar on the other side.    We started out at the salad bar, trying each soup.  They had an extremely spicy 4 pepper soup that I loved as well as a root vegetable soup. I really enjoyed both soups; the root vegetable had some flavor in it that I recognized from a pasta that I used to get all the time in college.  It was such a great moment of nostalgia! The salad bar wasn't that impressive.  Only containing your typical lettuce tomato onion mushroom etc with about 6 dressings to choose from.  That was just OK.    Finally we ate ourselves around to the main course.  Our waitress brought out brown rice to go with our meal so we could fill our plates with whatever meat and veggies we wanted.  I ended up doing a combination of rib eye, chicken, and sausage for my meats. The sausage was by far the best with a good hearty flavor! I ended up adding some corn, beans, and broccoli to my dish as well and my sauce was a little spicy with red pepper, cayenne and Korean bbq.  This combination turned out alright.    The down side of only having one bowl is that you do not get to make multiple combinations and try things out.  The other option of getting unlimited bowls is tough to control portion sizes given that each cook takes around 10 minutes and at there was a bit of a line to get your food cooked when we were there.  If you're not looking for a quick food experience take your time and enjoy the unlimited bowl here.  Otherwise, a single bowl should be enough to fill you up. Regardless this was a cool experience with decent food!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "p2zG6moVk1JWwxkALfWHVw"
  },
  "Y8bAAA6-Tg7WKsGccq_yEQ": {
    "date": "7/30/2018",
    "text": "Good food all you can eat what more would you want.  The price is decent and the liquor speaks for itself.  It's for sure a great lunch spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Wm26PxeiJOWZd90HzDPyaQ"
  },
  "mVVZG0uaphXZZLu9J3EAzQ": {
    "date": "9/23/2018",
    "text": "I've been to this location twice. The stir fry is good, but each time I have come (unless you order the stir fry), it took at least 30 minutes for the food ordered from the menu to come out. It's nothing complicated...chicken fried rice, fried fish tacos, etc. Each visit, my 5 family members have had time to go to the stir fry bar, fix our bowls, taste the different sauces, visit the salad bar, eat our salads, and get all 5 of our dishes cooked before the ONE menu item came out! So slow, and it's not even busy enough to warrant it!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hBfPiTzW-OJVle-qkQ1Xgg"
  },
  "Xza4Y_tdwwV21AI561Yn_g": {
    "date": "3/19/2018",
    "text": "I was impressed with the quality and value of the food here! I had never been to a Mongolian grill restaurant but had always wanted to try, and I wasn't disappointed. The set up of the restaurant is either you order a pre made meal off the menu or make your own bowl. I highly recommend making your own bowl because you can add as many of your favorite ingredients that you can fit on the plate. Since I signed up for their email program, I received a $5 off coupon, so I ordered the unlimited bowls. This allowed me to get creative with different flavors and sauces, as well as have plenty of leftovers to bring home. The food was fresh and delicious! There is also a salad and soup bar included and I found that a great addition. The soup was excellent and I went up a few times to refill my salad plate. By the end of lunch I was full and satisfied that I had enough food for 3 more meals with all my leftovers. Just know that they only provide you with one go-to box.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oDdjC2zRcdPjke8CydinRw",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oDdjC2zRcdPjke8CydinRw/o.jpg"
      },
      {
        "img_id": "cVoMNB7CPSAHu7G2aP69mQ",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cVoMNB7CPSAHu7G2aP69mQ/o.jpg"
      },
      {
        "img_id": "WajatzMEnerNXPxJJRHGxA",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WajatzMEnerNXPxJJRHGxA/o.jpg"
      }
    ],
    "user_id": "KKblXUNxSGCewpDxiiSRQA"
  },
  "D2Ee0cUVYBO8DdkQ--WGhg": {
    "date": "4/9/2019",
    "text": "Had never been here but ordered takeout on a weeknight. The pad Thai a bit light on the actual noodles but it had good flavor. It isn't your typical pad Thai. Also ordered a \"create your own\" stir fry which was disappointing. There are lots of options but the amount of each veggie was very inconsistent. I got tons of watercrest but only a couple pieces of potato. Worst of all the I got no 'meatless chicken' whatsoever. Would understand if they ran out but would have expected them to ask if I wanted to substitute something else. I was really looking forward to trying the meatless chicken.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cng98OH9JB1CgTgybgPbTw"
  },
  "OQsuAaCMW0fO8HBI4fyacA": {
    "date": "3/21/2017",
    "text": "I have been to BD's a handful of times.  Every single time has been an interesting experience.  You learn tricks from other people about \"how to fill your bowl\" and \"put noodles on top\", etc    My past experiences have been nothing to write home about.  They have not been terrible - but not been great.  Just - Ok.  One time we had overly burnt food you couldn't eat.  One time we had under cooked chicken.    But this last visit was - interesting to say the least.  When my mother visits - she loves to go to BD's.  So on Sunday evening - off we went.  There was probably about 8 other tables in the restaurant filled - one was a HUGE party (Probably 10-15 people).  Our waiter quickly came over, got our drink order and asked about the extra rice/lettuce/etc with our single serving bowls.  Once we had gone up, gotten our food, had it cooked - the large party had left.  We were seated RIGHTBESIDE the door - aka the hostess stand.  There were about 3-4 employees standing around - swearing, yelling across to the bar, etc.  This was really disruptive to our meal.  To make it even better though - The Manager.  This man was RUDE.  He was yelling at employees about how many tables they had, why they weren't cleaning their tables off, etc.  Our waiter - a Gentleman whose name I forget - was rushing around taking care of pretty much all (down to about 6 filled tables now) the tables.  He was more disruptive than anyone in the restaurant.  The different hostesses were too busy flirting with friends, hanging on friends, etc.  There is a time and place for that - at WORK is not it.    The only plus side to the staff - was our waiter.  That poor guy (seemed to be the only male waiter) was hustling butt.  I heard about one girl only having 1 table to take care of, another girl had to clean off her table - but our waiter (I heard from the manager who was yelling at everyone) had 6 tables at one point.  I could point out that he put our rice on a different table - but I didn't care.  He got us drink refills in a timely manner, got us new rice, got us our bill quickly, etc.  He was amazing in comparison to the rest of the mess happening.  He even apologized for the bad service.  The bad service did not come from him - and it reflected that in his tip - it came form everyone else in the restaurant.    BD's - get some new management, new hosts, and some reliable wait staff.  But look at your schedule for Sunday evening (7p) March 19th - the tall, younger male waiter - did a great job.  Keep him.  Not the others.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WPI0YGOSA13eZ5eThfMFkQ"
  },
  "FQOjKsB9UO3npKMRQAMS3Q": {
    "date": "12/14/2017",
    "text": "I'm such a huge fan of bd's! I was very sad when the one in Irvine closed & one of the best things I learned about Pittsburgh when I moved back was that there was a bd's here! It's just as good as my old local restaurant. I wish it were a bit closer. The food is amazing and you get to pick what they make for you from fresh ingredients. If you haven't been there yet, go soon!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZnIaEvJwrxlBUjimIpx2Qw"
  },
  "203WBh8IFsQePkjEXiAWHA": {
    "date": "3/9/2019",
    "text": "Good food, interesting concept but our waitress was horrible! All but ignored us and treated us as though we were an imposition on her free time. Wanted to upgrade to unlimited bowl - couldn't even see her anywhere near us! Took 10 minutes to get a second bowl. Too bad because the rest of the experience was good. Get better staff and we'll be back!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B243C0kRPIpGbmx-g9KBjg"
  },
  "x8pHzfoQbuum_iiuTXNmeQ": {
    "date": "1/30/2017",
    "text": "Really struggled to talk myself into eating here.  I imagined some scene from the 1965 film \"Gengis Khan\" and some old and equally intimidating beef with heavy sauces and just too much seasoning.  I was cold, so I decided to try it out anyway.    Let me tell you, I am THRILLED I did!  I ordered the Pad Thai with Shrimp and it was delicious!  It was light, flavorful and delivered quickly with a smile.  Looking forward to trying some of their other dishes, because I'm intrigued.  The waitress told me about a steak and mushroom soup, which I promised myself I'd try next time I came by.  Wasn't busy for lunch, sat down, ate and was back out the door in less than 25 minutes! A+",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9AVhZTrtF_tkwDDLOkApKg",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. Pad Thai!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9AVhZTrtF_tkwDDLOkApKg/o.jpg"
      }
    ],
    "user_id": "KiUBp6hGhFTs8wOIbP0tcg"
  },
  "0fvmEV8T72_HEvn_N_LNBQ": {
    "date": "3/13/2017",
    "text": "Food was good. Not great. But, we all thought the prices were way too high for what you get. The salad bar and soup we good. But, the plates were so small. How was that going to be a meal?? And what do you consider this place that has Asian stir fry, quesadillas, beer cheese soup, and salad bar.  Not worth another trip in our book.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BJUY0UadA-STNQfNGnpTjg"
  },
  "sst5vIkMSHgfyqq6H3CvKA": {
    "date": "8/12/2018",
    "text": "This was my first time here and the waiter seemed to be rushing. A friend ordered so i barely glanced at the menu but  waiter didn't offer free rice or even give us silverware without us asking. I was unaware white rice was free so half of my bowl was filled with rice from the meat bar, wasting most of my money. Spend 20 dollars on 3 dollars worth of food. I was already full after asking for extra rice (read the online menu) so didn't even bother to ask for another bowl. It wasn't even busy... Could've been good but I'll pass next time based on that experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HoRXzcZsyS_oH8_u-GYPSg"
  },
  "2kO8seeJJo9FnMnHaPkZng": {
    "date": "2/24/2017",
    "text": "Fun fun fun! Great food too! Reasonable prices. The atmosphere here is great. The music consisted of current songs, the food was fresh, and the restaurant was clean. Located in Southside Waterworks. I appreciated the prices as well. I ate from the buffet and had unlimited soup salad and stir-fry bowls.  That was too much food although it was only about $13! I would suggest just one stir-fry bowl a salad and soup. The salad bar had a fair amt of toppings to choose from. There were two soup selections. There were 3 stations dedicated toward building your stir-fry bowl.  You could choose from a variety of noodles, meats, veggies, sauces, and seasonings. You could even add a raw egg to be cooked by the chefs who toss up your bowl mixture at a cooking station that you wait at for your food to get cooked.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hDQuSKOz8y3WYy2ZCIWsag",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. One plate of self made salad and Create Your Own Stir - Fry.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hDQuSKOz8y3WYy2ZCIWsag/o.jpg"
      }
    ],
    "user_id": "jen0KskW0qmZ1jvjbZiVyQ"
  },
  "HqLSlNarc1vimIwfb-Exgg": {
    "date": "12/28/2018",
    "text": "We were at BDs yesterday. They got unexpectedly busy for a Thursday night. I would like to commend \"the Mongolian Ginger\" griller. He was predominantly by himself during this rush. Yes, it took longer than usual to get our food, but he never lost his cool. He kept a smile on his face and kept on grilling. He is a complement to this restaurant. The attendant on the buffet was running like crazy trying to keep up with the customers. I think everyone did a great job.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8DyImLLO4I5y2Gw47Ms46Q"
  },
  "byDY5FS4WkElS9MYJVipDw": {
    "date": "9/1/2017",
    "text": "My husband has been talking about going to this place for a long time. We finally had the opportunity to go when we took a bike ride down to Southside with the intentions of trying this place for a late afternoon lunch. When we arrived, it was pretty empty. We were seated and greeted by a very nice waitress, who thoroughly explained the process and answered all questions we had.   We hit the soup and salad bar first since that was included in the price. I  tried the Four Pepper Chili which I actually really liked, but it was REALLY spicy! My husband really enjoyed the Root Vegetable Soup. The salad bar was nothing to ride home about but served its purpose. Next, we moved on to the main event, the stir-fry! I love making roasted vegetables at home so this was a cool experience. We were able to pick our raw meat/seafood: I opted for chicken, ham and sausage. Then, we moved on to the vegetables. My dish consisted of broccoli, peas, corn edamame, onions, peppers, etc. The idea is to pile your bowl as high as you can without stuff spilling over! Well, not really the point but it was a fun challenge. Finally, there is a sauce bar where you choose/mix the sauces you would like all of your ingredients to be mixed in. I chose sweat and sour and Korean BBQ with some cajun seasoning and rosemary herb.   The cooking process: everyone stands at a numbered location and the two cooks go around and ask if there are any allergies and then they begin to cook everything in the bowl. It took about 10-15 minutes so you have to be patient, enjoy the experience. Once it was done, we returned to our seats where our waitress had brought us some brown rice, and we dug in! I thoroughly enjoyed the sausage and I thought the combination of vegetables and seasoning I chose was pretty good!   We had purchased the one bowl, but there is an option for unlimited bowls. One bowl is plenty for a meal, however the unlimited option would be enticing to try different flavor combinations (as smaller portions of course) but you have to be willing to wait for it to cook each time.   . Pricing was ok as it is a lot of food and you get to create your own meal. However, this was a fun experience. Food was good, service was good, and we were still able to ride our bikes to The Strip for some ice cream!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rFeUNmWzV2sERSTc7-5Ujw"
  },
  "AeioAVjcS8Z8XBmDvcfAKg": {
    "date": "1/15/2015",
    "text": "We stopped here to celebrate my birthday a day late. We literally live a block away but just havent stopped by here.  I piled my bowl high with noodles, chicken, onions, broccoli, mushrooms, corn, peanuts, egg.. most likely some other things that i'm forgetting. yum it was good. I loooove how at the end they have spices because i season my chicken really well when cooking. They had fresh garlic and garlic powder, crushed red pepper and other things that i  cant remember at the moment. I also like the sign that helps you with the sauce (add 2 ladles of this, one of that, this season to make it taste asian) They did that for recommendations of asian, italian, mexican and some other ideas. TIP: keep your chicken on the side to add seasons directly to it.   For dessert, we decided on the brownie sundae--- delicious!! I just may head over one day when only craving a brownie sundae.. They also had fried oreos (4) served with ice cream as well as some other tasty desserts.  We just missed happy hour, but i still asked our server for the HH details for future reference. They have great deals on drinks and appetizers. They also have deals on beer the day of a pens game. Speaking of drinks.. this place made a GREAT drink. We only ordered a crown & coke, but it was STRONG!! do you know how many times i've had a weak drink at a chain restaurant? Enough that I stopped buying drinks when out to dinner. I just head to a bar afterwards if i want a drink lol..   The workers on the grill were very nice and friendly, as well as our server. I'm excited to head back during warmer hours to enjoy the outdoor seating. Oh, this place plays an interesting mix of music.. I heard everything from the newest songs on pop radio to Hanson's \"mmm bop\" & Come on ride the train (hehehe)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "SAiKjSNoA_CO9o8_N3_3Dg",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SAiKjSNoA_CO9o8_N3_3Dg/o.jpg"
      },
      {
        "img_id": "BUVlKicirtwUBf7mauih7Q",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. BROWNIE SUNDAE!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BUVlKicirtwUBf7mauih7Q/o.jpg"
      },
      {
        "img_id": "PTD_i8HjL112m5BVhPqkiw",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. my meal.. plus complimentary rice and my  beverage",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PTD_i8HjL112m5BVhPqkiw/o.jpg"
      }
    ],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "HNR0WyhLGrjIsU_gVp-70Q": {
    "date": "7/6/2016",
    "text": "We really liked this place - huge selection of food, great prices and a great server to boot!  The cooks do sing a bit if you tip them, but more importantly - they ensure that all your food is cooked correctly!  Also - the flavor was fantastic - surely we'd return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "d4vqfqDzNFvYppXMPjJrow"
  },
  "eJ0EGNmsEzrm9urS1_K4WQ": {
    "date": "8/12/2019",
    "text": "Probably one of my favorite places to go in the Southside and the best bang for a buck. This is my go-to place anytime I'm craving a large meal after running or a workout.   Upon entering, the grill can be somewhat intimidating with the mass amount of choices available for consumption. First of all, you want to get your protein first, I normally go with the chicken or pork, but they also have shrimp, scallops, fish, meatballs, etc. Then you want to get your starch and then your veggies. I like to get the unlimited bowl and take home one or two containers for lunch the next two days.  The food is amazing, the service is always pleasant, and the cooks are a blast to work with and will accommodate you if you have an allergy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vCfdOcFHKlp-lmb8dol7dw"
  },
  "ei1ehlXu1gCR9bqTPyEFww": {
    "date": "7/16/2019",
    "text": "I used to come here all the time when I was in graduate school, and perhaps that shaped the way I remembered BD's, but after visiting the restaurant again I know I never want to return.   After being sat, my fiance and I were not greeted or approached by a server for about 5 minutes. We ordered sides of rice and drinks and were given our bowls. The buffet made me a bit concerned because everything looked disheveled. Rice noodles had made their way into the other noodles, a few shrimp were stowaways in the scallops, and nothing looked like it had been wiped down. When I got to the large vats of raw meat, I had trouble believing that enough care was put into keeping the meat at the correct temperature. I stuck with a vegetarian bowl.   Once my food was cooked, I found some stray black beans that I did not add myself -- thankfully my fiance did, so I just told myself they got mixed in from his bowl. The veggies on my plate tasted fine, but the sauce I added was supposed to be garlic chili but it tasted like pure oil. I only got through a few bites.   Service-wise, when we returned from having our stirfry made, our rice still had not arrived and neither did our waters. My fiance finished eating his food before his beer even arrived.   This place used to be good, but everything seems to be going downhill. I will not be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3HR86J_kKOMpS4ad4Lu5yg"
  },
  "7ib8FSPR7FqL9JdPsbw6eA": {
    "date": "8/15/2019",
    "text": "I always loved this place and the concept is amazing. I wouldn't necessarily call it a buffet but I can see why they do. For unlimited bowls now until September 2? I think, they are charging 14.99 with the salad bar. You get to load a bowl with whatever you want, so yea obviously I'm gonna load it with different meats and seafood because I want my money's worth duh. It's lovely and a great meal. Go on a weekday evening while it was raining previously, we did that and there was one other family in there so the cooks had our stuff done super quick. Highly recommend if you're starving and want your money's worth",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VRi7aW1RTEERaphlXzvjOw"
  },
  "yfShKnTxPU71LSkKpOytUw": {
    "date": "5/13/2019",
    "text": "An okay spot in the South Side. Ended up here because the Cheesecake Factory was packed, this place was pretty vacant yesterday around lunch. We were seated right away but just sat there for awhile waiting for someone to come to our table. When someone finally arrived, they explained the process and we were on our way. In some ways, I like the concept. You literally pick exactly what you want in your bowl and there is a lot of variety. In other ways, the execution is off. I was not crazy about handing the raw meat, I thought that was kind of gross seeing it all out there (especially given how empty the place was, I really wondered about how long the less popular proteins sat out...). The way the stations are set up is confusing. The stations are ordered meats first, veggies second then sauces third. Another place it said veggies first, meats second, noodles third. The bowls are pretty small and it's hard to really fit much in before stuff starts falling out. I'd advise to use more sauce than you think you'd need. The big grill where they make everything is cool I suppose. The salad bar is blah and they need better plates there, they use flat rectangular plates with no borders and things fall off. The food was good. We opted to get the \"Unlimited Bowl\" but take the second one to-go. I had to funnel my food into multiple small containers as they apparently don't have large containers, so weird. The prices are reasonable for what you get, the \"Unlimited Bowl\" is really your best bet as you can basically take another meal to go for only a few more dollars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aYUfzjGkg8omn-LgqcfKgg",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aYUfzjGkg8omn-LgqcfKgg/o.jpg"
      }
    ],
    "user_id": "0KhRPd66BZGHCtsb9mGh_g"
  },
  "zXIbCsG-EVjVhbeP8FmFIA": {
    "date": "7/22/2019",
    "text": "I've never been to this type of grill/bowl restaurant or this chain for that matter. We went as a family during a quick Pittsburgh layover. It was very good and a great concept. Pick your own meats, vegetables, and sauce and take it all to the big group grill for it to be cooked. Also, the kids bowl option was a great part of the menu and perfect for kids. Service was just a tad slow, but no complaints otherwise.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i7s-PZxQDqc9_zeaWMU35Q"
  },
  "JkrbiRALZPsTO0G8gtC17Q": {
    "date": "2/19/2019",
    "text": "One of my FAVORITE places to eat. The price is great and its not too fancy, but the quality of the food is awesome. I ALWAYS get the unlimited option so I can try a bunch of different things. I was also pretty impressed with the salad bar (I am obsessed with spring mix). This is def a cool place to go with family or for a girls night!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "DF3pL8EatKCBfsF0ok1qYw"
  },
  "Iwj940Uz_xWMVzk3HndiNw": {
    "date": "4/26/2019",
    "text": "I can't stop telling friends about this unknown gem! It is fresh, delicious, fun, and affordable. And they have a bar. What more could you possibly want? Do yourself a favor and stop in. You're welcome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F3BlpIQXwu9gfjZaccZgjQ",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. Lunch Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F3BlpIQXwu9gfjZaccZgjQ/o.jpg"
      }
    ],
    "user_id": "QDVP_7AQpYmAYRS-d1Njjg"
  },
  "VjKThDObmIou9IaPMj9Flw": {
    "date": "7/1/2019",
    "text": "I came here for the first time it was a Saturday night. It wasn't crowded at first but was starting to get busy. At first I was a little confused on how to make my food bowl but I got it!! ! Then we take it over to the cooks to cook the raw food in your bowl. What a neat and different idea. It was cool to watch them in action they seemed to enjoy what they were doing. They have a tip jar on the counter they definitely deserve it!! We sat at the bar. Chris the bartender was super cool and nice. Great drinks!! ! He never skipped a beat on any of his customers for being busy. Great place will be going back for sure .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s0rJ5eoGcI-gyJCmybsMDg"
  },
  "rryYVEIYh3_Mau9idJ16BA": {
    "date": "9/7/2018",
    "text": "The experience is a lot of fun. Hint, line the sides with veggies to allow for more food to be stacked in the bowl. I suggest sticking with 1-2 sauces max. My friend mixed several and it neutralizes the flavor of all the sauces.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Mu7IcUAglvYIMF0JJf_bbQ",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Mu7IcUAglvYIMF0JJf_bbQ/o.jpg"
      },
      {
        "img_id": "RRhgoICr8-ZhntW6mWMK-w",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RRhgoICr8-ZhntW6mWMK-w/o.jpg"
      },
      {
        "img_id": "2zsZXOogBQ4qBhFZzgkSmg",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. Bowl prior to cooking. Line side with veggies to allow more stacking",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2zsZXOogBQ4qBhFZzgkSmg/o.jpg"
      }
    ],
    "user_id": "rVLTC95ZV7yCmbQbSVdX1w"
  },
  "g2pXrxZ2nLeZqB054YirwA": {
    "date": "8/31/2018",
    "text": "BD's Mongolian Grill is not only delicious dining, but it is an experience too. With a build your own bowl format, you can pursue a wide selection of toppings and sauces for your personalized Mongolian Stir-fry and then watch the chefs make it right before your eyes! Student night is an absolute steal with unlimited stir fry for only 13.00 I believe (every Monday). Also, unlike most unlimited bar style restaurants, you are allowed to take home leftovers. Aside from that, the restaurant is extremely family friendly, but also works well for a fun date or a group of college friends. The wait staff and cooks are all very friendly which is just the icing on the cake. I had a great time at the Mongolian grill and left with 2 days of leftovers. I will definitely be coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "92cJ0azHUNs9vZRVmvA5Uw",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/92cJ0azHUNs9vZRVmvA5Uw/o.jpg"
      }
    ],
    "user_id": "VdVb5Eipk1B5uupaC3J_0Q"
  },
  "G1dTUQBiLDxYWRza3ebrGQ": {
    "date": "5/25/2019",
    "text": "Before even getting our food, the place was extremely dirty. The tables which were considered clean by the staff were sticky. The floors were sticky. The salad plate sticky. You get the point.  This is a fast food place granted, but there is simply no excuse for the conditions here.   The food was passable for the price point.  Do yourself a favor and skip this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4AGhpZ48oFVtWxVK51MXFQ"
  },
  "sVfINfAX9Prf2we_ppbb2g": {
    "date": "6/1/2019",
    "text": "Charging dinner price for lunch meal on the weekend is the dumbest thing I've ever heard. Quality of food has gotten poorer since I last ate here. Last time I'll go in. Too bad- always was a fan but it's gone down hill.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nnpk9HekQiT1njH_Y1n8IQ"
  },
  "w7qpgBKtdWSkI1RVs5zQqQ": {
    "date": "9/25/2017",
    "text": "I like it, the food tastes good, and it's a cool concept.  But they're not very clear on what to do and where to go to with the plates.  And it's not very clear how much stuff costs, like is a side of rice included?",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VOrAsSoak6JOPBL8NAjMyg",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VOrAsSoak6JOPBL8NAjMyg/o.jpg"
      },
      {
        "img_id": "ktbSBnFKtRu0PXhgq-3bZA",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ktbSBnFKtRu0PXhgq-3bZA/o.jpg"
      },
      {
        "img_id": "3--LN0VbYQjaeYsfgTJG2A",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3--LN0VbYQjaeYsfgTJG2A/o.jpg"
      }
    ],
    "user_id": "FE-9sqz_sg-XEx19vsLxaQ"
  },
  "zTVP51ZTjOPcMZrNgNh9xw": {
    "date": "1/21/2018",
    "text": "I came here yesterday for the first time with a friend and my daughter.I have to say I was Truely disappointed.  When we arrived for lunch, the resturant was almost empty. The waitress we had was not in the mood for answering questions. I decided to go with the make your own but after getting up there, I wasn't sure what to make. I decided to order off the menu instead and got vegetable fried rice. My friend had done the buffet and was almost done eating by tbe time our rice cane. When I got it I could only taste salt. It came with an  undercooked, dripping egg on top. I also didn't find any veggies in my rice. My daughter was sharing the rice with me and did not like it either. My friend was also disappointed in his. He said the meat didn't taste right and all together it just wasn't good. I really love the concept, but the food was just bad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GILQoBk5xjojNNOeD8U8FA"
  },
  "8qj0ia-VXEgh7_qbjHQtGA": {
    "date": "12/3/2017",
    "text": "I'm afraid this isn't the most sanitary restaurant to visit, so eat here at your own risk! Judging by the color and consistency of the food, particularly the meats, at the raw bar, I suspect there isn't much turnover here. Furthermore, I saw a lot of children serving themselves and expect the risk of contamination to be high.   As for the wok, the cooks prepared the food well, but I think it would be a lot safer if the raw bar could be positioned much closer to the grill where it can be monitored and replenished as needed.  I did not even attempt to eat any of the sauces at the bar because many seemed to be thick or mayo-based, which does not hold up well to Mongolian stir fry.  There aren't any other Mongolian grills in PGH to my knowledge (aside from the ones at Chinese buffets), so likely most people end up settling here.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zdpn-MrLT_QPhwJ5-KHKCA"
  },
  "vPM7M7icRl2Xh7TD24H8nQ": {
    "date": "6/3/2018",
    "text": "This is easily the most fun buffet style food. Get a bowl, stack it high with a variety of ingredients (anything - meat loaded, vegetarian, vegan), pick a sauce, and you have a personalized stir fry. Although I'm an omnivore I love making a vegetarian bowl - edamame, red and green peppers, bean sprouts, red onion, snow peas, broccoli, chickpeas, black beans, zucchini and yellow squash, noodles, and Thai peanut sauce. That with a bowl of brown rice is always plenty of food for me so I've never even looked at the salad bar. Bartenders and servers are all friendly and attentive, food has been great every time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gH144bG_roPadHLjHag-cQ"
  },
  "MfBnnRnSl5I41RvX1JROvw": {
    "date": "6/29/2018",
    "text": "I love a place that I get to be as picky and annoying with my food choices as possible without annoying any one of the staff. First, you pick all your own things. I LOVE this. Second, you watch them cook it up and it's quite cool to watch.   My rookie mistake was I didn't realize to put the sauce choice on the side and I can ensure you if you select the marinated meat, you don't need a sauce... it was too salty but that was a user error.   The good thing is for a few bucks more you can do unlisted times so if you make the mistake such as I did you can get something else! Yum.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "A0ssDikuj0SQr9mVqnh91Q"
  },
  "KJUnb5fpazr3F2cCFKmgmw": {
    "date": "12/6/2018",
    "text": "If you've been to a Mongolian BBQ before, you know that typically they'll cook the FROZEN meat first then the veggies and your sauce while the chef is constantly moving the food (the \"stir\" in stir fry) as they walk around the grill to ensure it all cooks correctly. Not here.  Everything gets dumped all at once -- including a raw egg, if you added it to your bowl -- and it's left to sit for more than a few minutes, COMPLETELY DRY, without being moved much, or not at all if there are other people up there at the same time. Your sauce will get added for just the last 3-5 seconds (seriously, it's that short) then it's all slopped on a plate. The result is a horribly overcooked, underflavored mess. If you pick unmarinated meat (which is sitting on the bar only marginally chilled, NOT frozen) then you'll get zero flavor because it's cooked to a leathery consistency before sauce is ever added. Onions will come as black charred bits. Noodles get so overcooked they're almost crunchy. Eggs get cooked beyond anything tasty and not even scrambled into the rest of your dish while it cooks, they just make a feeble attempt at chopping it up at the very end and shuffling it all together. The only redeeming point of this place is the bar ... alcohol makes anything seem better, I guess. This isn't real Mongolian BBQ. Skip it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fyi_Mf7UsTNVNQii-RGzTA"
  },
  "EvDD1Mq0WaGGh5EfEWVAUQ": {
    "date": "6/19/2018",
    "text": "Stir-fry is not my thing especially in this fast food setting.   Let's start with the pros of this place.  They have a bar with great drink specials, the staff are friendly and helpful enough, and the food looks tasty once it is cooked.    The cons for me outweigh the pros as I am not sure how sanitary this place is. They have a ton of raw meat of all varieties in a salad bar setting.  How can you ensure the proper tongs are used by people or people aren't touching their raw meat with the veggie tongs? This place gets very crowded and you could have to wait a while to get your food cooked.  To start, you are given a small bowl to top with as much meat, pasta, rice and veggies as you would like. The meats range from chicken, beef tips to crab and salmon.  You have every kind of veggie possible to add as well.  Once you bowl is filled you take it to be cooked.  There are also a ton of sauces you can get mixed in.  The unlimited bowl (go up as many times as you want) is $17.99 which is a bit pricey but if you are hungry you could certainly get your money worth. Since I am not a fan of stir fry I went with the soup and salad bar option which is $7.99 ($6.99 for lunch).  The two soup options were tomato parmesan and chicken tortilla. Both were very tasty and they chicken tortilla soup had a spicy kick to it.  The salad bar did not have a ton of options but enough for a hearty salad.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bu1mtWwxuayzV6b3VScWLw"
  },
  "ARLGHo30SqkmG1GmzuPdGQ": {
    "date": "7/30/2018",
    "text": "Pretty good food. It's not Ghengi's Grille, but it was good considering we don't have any other Mongolian grilles near us. I would go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "McGDwEyJB9RQn-Dkjdztmg"
  },
  "SFMWbx45CEkTdQ0_-DZl1Q": {
    "date": "11/24/2016",
    "text": "This restaurant has the worst servers. Not only are they rude, but it seems they enjoy being rude together. The managers come on a revolving door, the supervisors on duty are young & unprofessional. When calling for take out, because I actually enjoy the food, I am always hung up on. Always. I call back several times. I walk over to place an in person order and THERE ARE NO CUSTOMERS! Why then can you not take a to-go order without hanging up on the patron? ok, so third try, place an online order...foods wrong? oh even though I have a print out, from the actual order, somehow its my fault? Again, geez. I always feel they enjoy being rude. Like a clique of young rebels. I am sure they'll even be proud of this review, and the manager (who's \"new\") wont do anything about it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ph7oubjqlYCCUmUKMP_FwQ"
  },
  "GNPcHSPTd7dhfeI2B-jkbw": {
    "date": "4/12/2013",
    "text": "The idea is a good one in theory:  Make a bowl of food exactly the way you want it, and have fun doing it.  In reality, for $14 a plate, I'd rather have a chef who knows what he/she is doing do it for me.    As it turns out, the bowl I made for myself was good, but not great.  I'm sure if I went there 10 more times and learned about the various sauces I could do a much better job.  But for $14 a try, that's just not going to happen.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B_GMOc3Bi6sw4ATZKnlK5g"
  },
  "E-XgWIkf76mps1cvlNHyHQ": {
    "date": "9/17/2012",
    "text": "Very good options for proteins/vegies/sauces and spices.  The staff is pretty friendly.  Also has a salad bar/soup for those who are just tagging along and not into the whole \"Mongolian BBQ\" thing.    The prices are absolutely reasonable: $8 for one bowl, $10 for all-you-can-eat.  Go for the 2nd, and experiment with smaller bowls would be my suggestion.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Y3CdYo-t56OSiro-o5dWw"
  },
  "KKXp94bwWNCuOWdRyEtc8A": {
    "date": "6/30/2012",
    "text": "Stopped by at BD's with a group of high school kids on a dinner while we went shopping at the southside mall. I am a philadelphian at heart, so the burg is pretty new to me. The general atmosphere of the restaurant is good, waiters are efficient and speedy. We all picked the bowl option, where you pick meats, vegetables, pasta, tofu, and various sauces/spices to be pan seared/fried into a dish. This option costed $13.50, but I think bowl refills were rather inexpensive.   PROS: There were a huge variety of things to put in your plate, including various types of strip steak, seafood (scallops and stuff), chicken, and marinated meats. There were also many vegetables, and tons of unique sauces, including peanut, soy sauce, asian, chinese black bean, etc. The chefs do tricks with the cooking tools while they are preparing your dish, which is cool.   CONS: The bowls are rather small and the portions were not very good for the initial price, but if you are extremely hungry the bowl refills are cheap. Some meat was not cooked fully as I wanted, but still edible. Some meat was greasy, but the entire dish was actually quite good. It's fun to try different sauces and spices.   So all in all, yes I would go here again just to try different combos and such, but the small portions and steep initial price were the two biggest drawbacks. It's definitely cheaper than the Cheesecake Factory nearby, so grabbing some quick lunch or dinner is the best option.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "cBUw8N4owUVo69M8Juh-JA"
  },
  "Fj9jowR4WcEl_NrCnjkBJA": {
    "date": "7/15/2014",
    "text": "Terrible service, OK Mongolian stir fry. Waited 10 minutes for drinks, then asked about them, waited another 5 before they came. Kid's meal arrived cold. Sent it back and waited another 15 minutes for a new one. After we had our stir fry and were eating for 5 minutes I had to flag down a server to get rice because our waitress was nowhere to be found. Now we've been done for 10 minutes with no drinks and no check so I decided to alleviate my boredom by writing this review. Won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ef2cietzppgo68h0EdzFIw"
  },
  "eHqI2USvyCCpbIRc0tn1WQ": {
    "date": "12/22/2012",
    "text": "This place is hilarious - the most Mongolian thing about it are the two (count 'em, two) large, framed posters of Mongolian persons with hawks on their arms.  Oh yeah, that and the terrible - in a good way - Mongolian puns on the menu, such as a cocktail selection that will help you \"Khan-trol your thirst.\"  Other than that, this is a basic build-your-own-grill plate joint, except they have a large selection of Asian-flavored and Mexican sauces, and the grillers are situated behind a large gong that guests may hit at their pleasure.  And you can make it healthy (or not) as you wish.  The one complaint I would have is that it is a tad overpriced.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BMJvLI1yC575XN0oxGa-lQ"
  },
  "a_MgHCdro7b3eIBfD2bUjA": {
    "date": "8/15/2015",
    "text": "Love watching them do tricks as their cooking the food. Also you can choose what you want and watch them cook in front of you. Even though they are new to me I do love their food and would come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D0bhOmXByehddnoK5VNyQA"
  },
  "VPauuu3521GgHBpyJwLmYA": {
    "date": "2/18/2012",
    "text": "If you don't like hibachi then you're not going to want to eat here.    I wasn't sure if I wanted to stay when I first entered, but I am glad that I did.  I didn't get the concept of the restaurant at first, and was CONFUSED.  The menu also confused me too, but our waitress was very patient and informative.  You get a bowl, go to a buffet style area, place any assortment of seafood, meats, veggies and then a sauce and spices. into your bowl.  Walk it over to a grill area and a cook wills grill it up.  There is also a soup and salad  bar.    I am thrilled that this restaurant is located in the Southside works,  this gives me just another dinner option that is within my budget.  We had a bowl each pot stickers a coke and a beer for $34.00.    In my bowl I got shrimp, steak, tuna, snap peas, bell peppers, baby corns, chopped garlic and  pork. I choose the Ginger-chili sauce to go with.   The combinations are endless. B.D Mongolian Grill has at least 10 meat options, even more veggie options and like 15 sauces and various spices.  I am eager to get back here an try out even more combos. One downside is that if you are not very food savvy you can put together food combos that don't taste very good, or are too hot since the food is not professionally seasoned.  Even though the menu warns what sauces are very spicy, it can get very confusing since there are so many options.  I made mine some what spicy by adding additional red pepper flakes.   There are no formalities here, the cooks sing when they get a tip and the customer gets to hit a gong. The music is loud and the drinks are pricey and the restaurant has a college cafeteria feel, but I liked it.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "V7uS5US4oTf-S9u36HJQCQ"
  },
  "syQfTzpsOqyg_3AY5aio9w": {
    "date": "8/9/2012",
    "text": "Having lived in Dallas for some time and being a frequent diner at the Genghis Grill, I was tickled to hear that a Mongolian grill was FINALLY coming to Pittsburgh.  My PIC (Partner In Cuisine) and I rushed down there the first week they were opened and we were not disappointed.  They have a great variety of meats, veggies, carbohydrates (pasta, rice, tortillas), and spices that you can put together in any combination and then have the guys at the stir fry cook it up for you eating pleasure.   Since my PIC and I obviously spend a lot of time together and dine out VERY frequently, it never occurred to me that there is one huge problem with the place.  If you're looking for a place to have a nice, chill dinner to catch up with a few friends or are going out with a larger group, this is NOT the place to go.  If it's busy, there is a good chance you will find yourself waiting in line for your food to be cooked for upwards of 10 minutes so if you don't time getting your food just right, you might find yourself with your food being half eaten while your companions are still waiting for theirs to be cooked.  If you go for your second bowl, you could seriously turn what might have been a 45 minute meal into an hour and a half if you and your companions don't coordinate accordingly.  The motif of the restaurant does not really work logistically .  All of that said, if you're looking for a decent meal with nothing deep fried with someone you can coordinate your food selections / cooking, it's an awesome place.    P.S. Wander around the  South Side Works and you're likely to find one of the employees handing out $2 off coupons that you can use for each person in your party!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dKKTpZ8TeX8qv4gT_otDHQ"
  },
  "8rzVpwQ-eF1FjjTuoU1O2Q": {
    "date": "8/17/2014",
    "text": "My family with three young children have eaten here twice. The staff are super nice to my kids and we love that each kid gets a personalized favorite meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SFWTCnWjFPKiziw6WgqQsQ"
  },
  "oBlWtYVPU_ZkxyBZ4YtkHQ": {
    "date": "5/7/2013",
    "text": "Good choices, great variety. Love Mongolian BBQ. This place has a chain restaurant feeling, but they do a great job!   Recommended, especially during lunch time when the price is lower!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VRR90f5cZ5u4_Sq86BdUA"
  },
  "MCtCIQ3L9SAOGt5q-Y3V-g": {
    "date": "11/26/2014",
    "text": "Visits: Once, for lunch.  Before I start, I'll just say that it's a 2-star Chinese, 3-star Asian fusion place. I'll try to be as objective as I can, but the preface is that I'm not fond of Americanized Chinese food. I thought it would be like some of the normal, non-chain Mongolian grill. Turns out that it's like the PF Chang's of Mongolian grills - maybe even a little less authentic.  Food: Mongolian grills are Taiwanese-style food with Southern Chinese style sauces and ingredients, but I've come to expect that and enjoy them for what they are. That said. This was something of a travesty. The salad bar was puny and not worth existence. There were two soups - beef mushroom and beer cheese, both super creamy. Not a Chinese style soup or salad in sight. Couldn't they at least make some facsimile of a Chinese soup?  Then there were the seasonings. Oh god, shall I get started on those? None tasted like Chinese sauces I've ever had, barring soy sauce, which was, y'know, soy sauce. Some were supposed to be something (like the black bean sauce, which didn't really taste like doubanjiang should). Okay, fine. I get that maybe some people really love their fajita sauce or barbecue sauce (wtf?) on their \"Chinese\" grill. But at least put out some Chinese staple seasonings! Garlic, ginger, chili powder, and soy sauce were the only staples of Chinese flavorings they had. Meanwhile, there were a lot of seasoning varieties of the completely left-field variety - rosemary? Mixed herbs? \"Seasoned salt\"? \"Cajun\"? WTF? Where's the cumin? Where's the ground red peppercorns? Where's the sesame oil?  When I go to a Chinese (or \"Mongolian\") restaurant, I'm in the mood for Chinese food, or at least \"Chinese\" food. This was neither. It's some \"fusion\" cuisine. I wouldn't usually mind, but they don't directly advertise themselves this way, and I left there dissatisfied.  I'm taking two points off for the rating because it advertises as though it's something Chinese/Mongolian, not a fusion place. As a fusion restaurant, it'd only get one star off (for not really incorporating enough Chinese flavors). I get that it wasn't for me. If you're looking for Americanized Asian fusion food, this isn't a bad place to go, food-wise. The vegetable selection is pretty great, and there's a ton of flavorings to choose from. And at least there's he fen. There should always be he fen.  Atmosphere: Eh, typical atmosphere for this kind of restaurant - a kind of Chiptole crossed with a casual sit-down. No real comments here.  Service: We ordered the unlimited stir-fry, salad, and soup lunch. Even though there was exactly one other pair of customers in the entire restaurant, we somehow ended up having to wait for her to come over with new bowls. Maybe it's because she was chatting with the people over at the bar.  The person on the grill that day was hardly nice, either. She's standing in a semi-circle counter. We approached her from the right, after having filled our bowls, and make eye contact and smile. We get to the counter. She gestures us to the left side of the counter, despite only needing to turn 90 degrees to face us and pick up our bowls. The same thing happened every time we approach her and she's not directly facing us; sometimes it was on the left, sometimes it was on the right, so it's not that some of the counter wasn't being used. I don't mind walking over, but when you have food pickup areas labeled on the entire semi-circle, it's kind of weird to be gestured all around, seeming because the person manning the grill doesn't want to turn around or walk two steps.  Between the two of them, that's a point off.  Cost/Benefit: At around $12 per person for AYCE that has scallops and snow peas, it's a decent enough deal.  Bottom line is that if you're looking for Asian fusion cuisine, it's an average restaurant. If you're looking for anything remotely authentic, look elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "knNO9Inp8-7fbVKhhGFuBg"
  },
  "OitisDU6thliYYylLTitxA": {
    "date": "2/13/2012",
    "text": "Went here for their soft opening so maybe I should cut them some slack, but I think I'll just keep it real.  While the concept isn't new - it's new to Pittsburgh.  Here's how it works:  -Get a bowl and go to the buffet style set up Station 1 - noodles/meat -Choose noodles (rice noodles, rotini, lo mein) -Fill it with your choosing of raw \"blank\" (chicken, beef, scallops, shrimp...)  Station 2 - veggies -Continue to fill small bowl with additional toppings of veggies (mushrooms, peppers, water chestnuts, etc.)  Station 3 - Sauce -Pick up a small bowl -Choose preferred sauce (variety of sweet, tangy, savory, spicy sauces available)  Station 4 - Grill -Take you bowl of noodles, meat, and veggies and your small bowl of sauce up to the grill -One of the grillers will take it from you and you stand there as it's cooked and they put it on a plate when it's done and you take it and go back to your table.    Last stop - enjoy your \"made to order\" meal  I will say that I enjoyed the food - I had the chili garlic sauce during my first trip up to the buffet stations with chicken and steak and some veggies and then I chose the BD teriyaki sauce with scallops and shrimp on my next round.  I definitely preferred the chili garlic sauce - if you like spice then I think you'll enjoy that.  We ordered a pitcher of Strawberry Sangria and it tasted more like a melted Strawberry Daiquiri - uber sweet with no wine taste at all.  It was the low point of the meal.  They gave us a complimentary dessert - the brownie sundae.  Oh my yumminess - it was huge so we all shared it and couldn't even finish it.    Overall the experience was good but somewhat generic having been to similar chains before in other cities.  I think it will do well in Pittsburgh initially until the novelty has worn off.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "NnrCwpS1i5mZtkGGzmIk0g"
  },
  "U95WwhgDd69r7OmD2i5ZxQ": {
    "date": "7/11/2016",
    "text": "Very good service.   Nice atmosphere.   Good fresh food.   First time here.   I would recommend it.   If you like Mongolian BBQ.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZBHt4vhaoedbsPrhe0Lq8Q"
  },
  "JQZW_1Q27rjVVcnTfFZAng": {
    "date": "7/5/2012",
    "text": "I really do love this place...  My first experience was during the bomb threat dramz at Pitt. Instead of waiting around for the all clear, our whole staff journeyed down here to stuff our faces. BDs did some recruiting with us before they opened so we figured we'd go check it out. Best decision ever!  You get a bowl, fill it with meat, veggies, rice, pasta- any and everything you can think of. Then you get to pick one of their MANY sauces to adorn your food!  -quick break, I'm drooling-  The worst part is the wait if there are a lot of people and generally watching them cook your food. Give them a tip!  They do fun things when you do (not in the stripper sense...).   Just go!  And if you're still hungry, just pay $2 more and go all-you-can-eat. My tummy can't handle it, but God bless if you can!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "U5Fnsmf3hop4M9DiKDD5iw"
  },
  "bsyW0qcgHqIQM1vYbNHVmg": {
    "date": "5/27/2016",
    "text": "Had the taco's on taco Tuesday . Fish and chicken were good. Didn't care for the pork. For 6.99 you can't beat it. I will say their rice dishes are dry and have too much sodium but overall still a good deal. Staff was friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d_2azqXxTG5bpGlNdHdttA"
  },
  "uAmicx58owO1LgZPSoT2oQ": {
    "date": "6/14/2014",
    "text": "Went here for dinner...waitress didn't explain how it worked very well and then gave my date a hard time about only having a drink and not ordering any food. Since they have a full bar area, I'm not sure why it would be weird to just come in for a drink...the food was good, but I can't get over how bad the service was! Not sure when/if I'll go back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9W8Z5Rc_ylyPmXp8akY0vQ"
  },
  "1vjGg4QrVK8AK7mE6RjE_w": {
    "date": "1/24/2015",
    "text": "Fun concept and thousands of combinations possible.  They even have cheesecake factory cheesecake for desert.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RJj6d2EiRSdw-E5N_mTfRQ"
  },
  "0eSk6j_9Rmcalf2VuIb66w": {
    "date": "11/17/2014",
    "text": "Wasn't really sure what to expect - as I had never heard anything good or bad about the place. I really liked the concept. I would best describe it as a \"Create your own hibachi bowl\". The food was amazing, and I feel like if it wasn't - it's your own fault since you picked what went into it. I love that they have scallops and can load up with as much of whatever you want. At some places I think they don't put enough protein in and too much veggies, or vice versa. We also go some appetizers (the spinach artichoke rangoons) which I wasn't as happy with as I thought I would be. They seemed a little too greasy. The service was ok, but they weren't too attentive and they didn't really make the salad bar/food bar very clear at first. Was very good, though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "scXixoPyudQlNi7TJ7WQ5g"
  },
  "vzAt8qnD-IvTklNA_yFygQ": {
    "date": "7/13/2014",
    "text": "Wish they would put up hand sanitation dispensers near the meat station.  I can literally feel the salmonella transfer from tong to digit after every trip to the meat bar.  They also need somewhere for people waiting to get their food cooked to place bowl and the ramekin of sauce so they can stand there on their phones and pretend not to listen to the people cooking.  I feel like this business model could be in a food court and this way I wouldn't have to get meat slime on my hand when I am dining out.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pd6Sr3n-NZAE_AU9zt8eCw"
  },
  "GTiPu5lyipJ878qm-vGGfA": {
    "date": "4/24/2016",
    "text": "First time trying with group of friends. The selections of fresh items to choose are limitless. You can pick fresh meats, seafoods numerous fresh vegetables and a fabulous choice of sauces. Then after you fill your bowl you take it over to the grill. The guys at the grill are all friendly and entertaining. The food is then grilled to perfection and finished with your sauce choice. The cost for one bowl or unlimited bowls was only $3. And with either choice is the unlimited soup and salad bar. The table service was not all the great but since you select your own food and the grill guys cook it that can be overlooked. So if you want fresh foods cooked in front of you that is healthy and delicious, then eat here.  Just remember to hit the gong and tip the grill guys well, they really deserve it!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LNZrQtiZLVvCNJ6SAK3fSA"
  },
  "7_peHPK6BxZWk6wyzlqT4Q": {
    "date": "4/3/2014",
    "text": "Really love the concept of this place. The only thing a little off is that the sauces were a little spicier (if you follow the recipes) than expected. Okay for me, but some people don't like that spicy. Like the way the food is cooked on the hot stone. Fries eggs on a hot stone...gotta try it if you've never had it before! I like the veggie selection best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HN338Xcgffdw8ofuO2IEig",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States. First trip to the buffet.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HN338Xcgffdw8ofuO2IEig/o.jpg"
      }
    ],
    "user_id": "PuCMCx8LvgUWgZhnt2PHJg"
  },
  "zbKZfD5IOwGA8b_tVCcE2Q": {
    "date": "3/3/2016",
    "text": "We love this place! I only dock a point because the salad bar is plentiful but weak in quality. But, it is *only* the salad bar- the real quality is in the stir fry. Mix together your own bowl of meat, veggies, and sauces- then watch them splash it on a hot grill and cook it to your liking. You get to control your own quantities within each bowl, so it doesn't end up mostly veggies like most Chinese delivery places. You can go one bowl or unlimited. For unlimited it is absolutely worth the price. Both options include the salad bar, which has soup, salad, and fruit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "67ci-zI-Z6ABxAxTJRsd_Q"
  },
  "0ezzXW31QcIfLhmcLCqMKw": {
    "date": "6/23/2012",
    "text": "As much as I was thinking this place was going to be awful, I was very surprised that we enjoyed our experience.  The items in the buffet seemed quite fresh and kept up, which was a huge plus as a lot of places like this can indeed be a tad more iffy.  The staff was friendly and attentive.  The lunch was really cheap.  I will say that my husband was not a fan of the Crab Rangoon, so if that is something that you typically love, you may want to avoid it here.    Will I go back?  Maybe.  It is so close to home, it makes it convenient when we are not up for everything else that this side of Carson St has to offer.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLVq7VSJBHZwqurwWoCmpg"
  },
  "b57qKYjyhvpNNru0voilbw": {
    "date": "5/2/2014",
    "text": "Love this place so much! It is nice that I can mix up and create my meal how I want. The price isnt bad, and it is really worth it to spend the $2 or $3 to have unlimited bowls. I will usually make one to eat there and one to take home for the next day.   Its fun to see how much you can fit into your bowl. Seriously, you can have all your veggies, whatever meats, and pick the yummy sauces. Its all the goodness of cooking at home without actually have to cut, chop, cook, or clean anything. I will take that any day!   The chefs are super nice and funny, and all around it is always a good time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "pp6XLZoL30k6bhSS8JTl0g"
  },
  "5TxG9Ux4gnC1_MI5VxOg_Q": {
    "date": "6/8/2016",
    "text": "Great food. Great service. The grill master was fantastic. They were great about keeping up with the lunchtime rush too. I will be back next time I'm in Pittsburgh. Prices are also good.  Unlimited stir fry for 12.99!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xyc8FKsHwQZ2IgzEwTT7VQ"
  },
  "94twqTVvx7Qjoim-BecTdg": {
    "date": "6/20/2015",
    "text": "I'm really excited about what I just experienced. Wait time was a bit long but it's Saturday night and the result was worth the wait. Our servers name was Mike. Mike was awesome despite how slammed it was.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Smy0dGpF8OVoj6XxC3q9FQ"
  },
  "7n0w99_Ik8LY5kHuNBqKGA": {
    "date": "5/28/2016",
    "text": "Been here a few times. Enjoy the selection of meats, veggies, and spices. Essentially do it yourself style place, but helps if people in your group are more picky!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KOU-OoIjolKlNGw7dwSGnw"
  },
  "iUY51onSZGdbak4iFM8wBw": {
    "date": "9/2/2014",
    "text": "Really great place to load up on food. It's especially good if you're looking for a small change of pace from the regular types of chain restaurants that are so plentiful throughout America.   Food was very good. You go through a buffet-style line and then give all of your ingredients to the grill masters who fry it up and hand it back to you. Pretty awesome. I recommend spending an extra $2 to get the unlimited trips. One could really so some damage with that much power.   I'd go back anytime.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z7dxxPVQUVAqDb52j22kOA"
  },
  "2jCjXEKm35WPCqVcHrId5g": {
    "date": "7/19/2015",
    "text": "Inedible. I think the grill guy forgot my order. It was on the grill for over 15 minutes. Standing there for so long was bad enough. The beef turned to rubber bands. The rice noodles had turned into a hardened mass that would require a chainsaw to cut. Bartender was nice.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fwt8SHITLvAHM5TVe0pB-A"
  },
  "UqYuguqc-xCOLyg2Nwv1hQ": {
    "date": "5/26/2013",
    "text": "Once again, I turn up Mid-Afternoon - Once again the place is around 60% full - once again I am led to a \"Crappy\" table right by the Grill so everyone gets to stare at me eating while they wait for the cooks to make their meal - which BTW the Line of people  was 20 deep - with people waiting to get to the grill.  I didn't eat - but I did take a look round  before i walked - again - they have place 4 tops in prime places, and in a way they can quickly be pushed together for groups. Then just crammed in 2 tops in the remaining gaps.   If its busy - I get it - beggars can't be choosers and I don't expect to be seated somewhere that means a bigger group has to wait. Yes I know I could say something, but why should I have to?  I think this is the only Mongolian Style Grill in Pittsburgh, they clearly have plenty of customers, but if you are dining either as a Single or a Couple and don't like making a fuss, then right now I cannot recommend it.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ltce0atLT9ztnLfeE9ZcVA"
  },
  "3AKMBh_PCYQVRCYaPYzjRw": {
    "date": "10/23/2015",
    "text": "The service was slow and some of the soup bowls were not properly washed. When we told them to refill chicken and fish at the meat sections; they bluntly told us it got over for the day in the kitchen (This was around 8:30pm on a Friday). The food was average.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "htRsxg_Z4OO5XGtLteBOeg",
        "caption": "Photo of BD's Mongolian Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/htRsxg_Z4OO5XGtLteBOeg/o.jpg"
      }
    ],
    "user_id": "VyYwIqPQmSiI8FE6bRzTEQ"
  },
  "x6l-qh8gl3d2tVGcMdAWDg": {
    "date": "9/29/2013",
    "text": "Just wasn't good.  There was hair in the raw meat.  When trying to select what I wanted, there were about 5 men reaching over me to get what they wanted. I'm not tall, also not super short (5'4\") and it was so difficult to see what food they had set out.  The staff on the grill were very friendly.  But just blah food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_vdeoGmEWRNYsgereSUjBw"
  },
  "V4ALuN056ymTyuHxeo1lww": {
    "date": "10/18/2015",
    "text": "This restaurant is barely worthy of one star. They leave raw food sit out on a buffet. They have a very large disk where they attempt to cook your food. Mine wasn't fully cooked and I got food poisoning. I'm never coming back EVER.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tB3uVcZTsUwLtY7KXjVLYQ"
  },
  "0XIvUkBfOIdhBLaHVNO7SA": {
    "date": "3/9/2017",
    "text": "Good place to eat.  My favorite part of a Chinese Buffet is always the Hibachi.  This has a lot more options and also more spices and sauces.  Also, they give you lettuce to make your own lettuce wraps, and tortillas if you want too.  Chinese food on a tortilla!?!?  I was skeptical too, but it's pretty good that way.  The price is a bit more than a Chinese Buffet, which is a downside, but when I guess you're not housing all your workers in an apartment and bringing them to work in a van everyday, you have to charge enough to cover wages.  Other reviewers complain that they've been to better Mongolian places in other cities.  Well sure, that may be, but there's better lobster restaurants in Maine, and the only option we have around here, so I say give it a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Gn52HDDe_aYUN2lYHLQWQ"
  },
  "Ajo_vY4L0ypZ4nrKvmSrcg": {
    "date": "1/25/2017",
    "text": "Friendly and helpful staff - they take care of you here! We only had appetizers and a beer at the bar, but apps were hot and tasty and good beer variety (we are craft snobs). Ran out of one app, manager (owner?) apologized up and down. Super nice folks. Will come back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JOekaeqamSlOj5H-787XvQ"
  },
  "g3NbQ7-EqS4CEFW8IFfnsg": {
    "date": "1/4/2016",
    "text": "I ordered one bowl and stuffed it with many ingredients and strong sauce. The sauce was mixed with Shanghai BBQ, Chili Garlic, Kung Pao, Soy Sauce, Garlic, Chopped Peanuts, Rosemary, Mixed Herbs, Sesame Seeds. This is my Khan's Recipe. With such a strong taste, I swallowed two bowls of white rice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h2daaVYjVpPWjoFgBpSrmw"
  },
  "00QNPd70aj4vhdCo10e1DA": {
    "date": "10/1/2013",
    "text": "I stopped by here a couple of Thursdays ago with fiance for dinner.  I had been wanting to come here for awhile but never made it until my fiance's brother was telling us how awesome Mongolian Grilles were.  The inside of this place looks like what you would expect from a salad bar type restaurant.  Fairly minimal in the decorations with a large area on one side with the food and then a large seating area with a bar on the other side and the Mongolian grill in the back.  The grill did have a gong on it which the cooks encouraged people to ring and there were also ample TV's throughout the restaurant to the point where you could watch one from pretty much anywhere.  For my entree I decided to go with the unlimited bowl.  There are many different choices of what to go with here including about 20 different kinds of meats, 20 kinds of vegetables and 20 sauces or so.  The first time through the line I got the ribeye as my protein with some vegetables and then the garlic chili sauce.  Since I was a rookie at this, I poured my sauce over top of my food instead of in the small cup that I was supposed to.  Whenever I took my food over to the grill to be cooked I got some good-natured ribbing from the cooks about how I had to be new.  My fiance and I also had quite a bit of a wait for our first bowls as the whole grill area was full and so we were two deep.  If there is one complaint that I have about this place, that is it.  Waiting for your bowl can take a while at times and can be frustrating.  However, after my wait my bowl was certainly worth it.  The sauce was spicy as expected and I loved the garlic taste of it and the vegetables and ribeye that I had mixed it with were good as well.  I would eventually end up getting two more bowls, the first as a ribeye with vegetables and a Szechuan sauce and the second as a shrimp with vegetables and a ponzu sauce.  The wait was much shorter the second two times and I have to admit that it was all pretty good and I really enjoyed my meal.  The best part was that I was unable to finish my last bowl and threw in the towel after eating about half of it. Seeing that, that server offered a to go box for me to take home.  Yeah for some free lunch!  The bottom line for me is that I will definitely head back here again in the future and my fiance would as well.  With that being said, I am looking forward to bringing some of my male friends and getting in some good eating.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "397Q06FBVIMuHrVdl7sFrQ": {
    "date": "9/7/2012",
    "text": "In Chicago we had a place just like BD's that was delicious and not a chain so I'm a little jaded.  PROS: 1. I'm a cook so I consider part of the fun trying to mix up the sauces in a way that tastes good. (My husband SUCKS at this so if you're not so sure you can use one of their recipes. I consider this \"cheating.\") 2. They have a million different meats! At my old place, they had the usual suspects (chicken, steak, etc.) plus a special. Shrimp was extra although you got great big shrimp. Here you get your choice of like 15 proteins although the shrimp are miniscule.  3. You get a separate bowl of rice. Yum!  CONS: 1. I think it's the menus, but it feels so chain-y. I hate all the silly language and promotions. There are no booths. The chairs are all those borrowing brown sticks. I feel like I'm at Applebee's. I just want to eat my bowl and be done. I hope nobody hits the gong while I'm here... 2. You have to stand there and wait for your bowl?!? Seriously? You can't just bring it to my table. What are you paying these waiters for? I can think of several systems to allocate bowls to tables to assist you with this process if I'd rather enjoy the company of my dining partners than watch the \"magic\" of the chef. 3. The focus seems to be on the meat. I think there could be a wider selection of veggies. Where is the bok choy and spinach and tomatoes and...?",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "rpK40ZN2rNFJLhfdlQqS-Q"
  },
  "pc2arJzBPJxof9GdI5LEZg": {
    "date": "12/26/2016",
    "text": "I really like it recommend this place.I also like the way it works to make the stir fry and the people who work there are very nice...Shoutout to Snoop.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ObanG8yeT-rQkgpcc8-eQA"
  }
}