{
  "XqN6wOKXfb1Xb0TRy-KvTg": {
    "date": "4/27/2013",
    "text": "You know, with a name like Wiener World it is... difficult not to laugh like a 13 year old when talking about the place.  So please fold your chuckles till the end of the presentation.... Let's get down to business.  Wiener World is one of those \"we've been open since God created the cow\" places.  It's greasy and gross, and everything you'd expect from a million year old hot dog joint.  With that said the Hot Dogs were really good.  They were all beef, and really juicy.  If you are down town and looking for something quick give this place a try.... Ok... feel free to laugh now.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZdQxhh3hCW33imdMHMIR_g"
  },
  "3tPuYVeOBlG3gC56AMgyGQ": {
    "date": "9/25/2010",
    "text": "Bad Ass Old School Dogs!  Let's be real here - any place with the sack big enough to call themselve Wiener World rules.  It's got a gigantic sign with Wiener World on it.  My 8 year old son ate there and 2 years later he still giggles about it.  I have a picture of it on my phone for my out of town friends.  These are old school straight forward dogs.  They don't mess around trying to be fancy.  This is they type of place your grandfather used to eat at and then kick somebody's butt later than day just for the heck of it.  Yeah... you walk up and say \"Gimmie the Kielbassi special\" or \"Gimmie the 2 All Beefs\" and they just \"how do you want 'em\".  No girlie crap here.  If you feel up to it go ahead and eat at the bar and puff your chest out when you leave knowning you're now a wuss.  The quality of the food is a lot like a carnival dog or a cookout.  Not the best thing you've ever eaten, but hey - you ordered a hot dog, not fillet mignon!  On those really hot days stop at the window and grap a milkshake - old style.  A real shake.  I love this joint.  Oh - hands down the best part of WW - they will absolutely ignore you if you are on your cell phone.  YEAH!  Take that you nitwit on the cell holding everyone up and then complaining because you got chilli but wanted kraut.  I love a place that doesn't BS and isn't PC.  Like the sign says out front \"Jared Doesn't Eat Here\".",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jn87I_b9EUVKFaI_jWkJlQ"
  },
  "p8GDYcYZBar-ndT52RGHWQ": {
    "date": "9/16/2012",
    "text": "Solid dogs, ESP if you are a dog fanatic. Gravy Fries are awesome. I have lunch here everyday I am in Pittsburgh. Much better than Franktuary.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9uzk6CJL8AOKYysxVlwv-w"
  },
  "nd0vWOh6uIC_YwP4wdaemQ": {
    "date": "11/16/2009",
    "text": "Wiener World - solid hot dogs , good, not great taste, ok buns, topping are plain.  WW wins the hot dog and bun competition between Franktuary but Franktuary wins the topping contest hands down. Now if we could combine the dogs served here with the toppings at Franktuary  you would have  a 4 star hot-dog joint.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "uohvmcFpNnw-kc9U0T5j9g"
  },
  "EEbXyJLjmIDp44-WO-y0NQ": {
    "date": "7/5/2012",
    "text": "They charge $4 for a hot dog that is not any different from one you can get at any 7/11 for $1.  Not sure how to review it other than to say have you ever gone into any gas station convenience store in America and gotten a \"big dog\" or whatever, and put condiments on it?  It's the same thing but 3 more dollars.  They did have other types of dogs but they were more expensive.  I hate supporting chains but independent places are supposed to offer something more unique than a neato neon sign.  You might pay as much for a dog in Chicago or New York but they're something special.  For less the amount I could have gotten a corn beef sandwich at various places nearby.  Liked the people and the atmosphere.  Next time I'll try the ice cream.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "srb_kRQUSYe4HzKqxk0SRA"
  },
  "1axZGqBFcotyLuWKwZiQig": {
    "date": "8/15/2014",
    "text": "Best dogs and dirt cheap. You can't go wrong. And of course... cheese sauce! But sadly cash only...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KCHbs_KET1F4bbTlrrt5bQ"
  },
  "UlgOBXqR7MPRD2T7olT7dA": {
    "date": "8/26/2017",
    "text": "Came here before 2:30 on a Saturday and it was closed for no apparent reason. Decent hot dogs but I'm not going to plan to go somewhere that isn't open when it says it's open.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PhEPT5ZTaRke21NCxwBWNg"
  },
  "avNkMm4UhQ0nJgm3SOtY2Q": {
    "date": "2/22/2018",
    "text": "Just a good old fashioned eatin' place. Right the middle of Downtown PGH. Not too may places like this around these days.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RppfQX2xDysGFpqDCgoFrg"
  },
  "lzHa5n1yzSZIBcaXM9IXEA": {
    "date": "3/31/2016",
    "text": "Great sheep casing snap dogs.  Stand-up counters for inside eating.  Plus will nor serve ketchup on dogs(yes).  Cash only no credit/debit.  Enjoy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jycrVHaIqAiWgBoyqgE6yg",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States. Wiener world a Pittsburgh classic.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jycrVHaIqAiWgBoyqgE6yg/o.jpg"
      }
    ],
    "user_id": "d8gwCFvNWu7ZKpsqy9r83w"
  },
  "HpC-aAPZZuK1Tq9gFqxlgA": {
    "date": "10/6/2015",
    "text": "A coworker invited me to lunch here today. I took her up on the offer. We each odered a hot dog and a drink then shared fries. I ordered mine with ketchup mustard and relish. After giving my order i shouldve gone with chili & cheese.. next time! I enjoyed the hot dog. The fries were regular frozen kind. On the way out i noticed someone with sauerkraut on his dog. I will try that next time. I was debating on 3 stars but everyone was so kind.. especially the old lady with the cute plastic flowers in her hair.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "FBZkRdFsLlnIm_2Oo6Sj_Q": {
    "date": "10/12/2016",
    "text": "Awesome fish sandwich and fries special. Definitely worth a stop for lunch. Very friendly and pleasant people working here as well. Fun place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k9WQPRFmpWPer0w4ABGU3Q"
  },
  "KOX5qpHeEznfMVpErpOX9g": {
    "date": "8/2/2012",
    "text": "A fine cooked on a grill snappy dog.  A good tasting dog, with natural casing that snaps when you bite into it, that is grilled with they have the usual condiments.  Love the long sliced pickle on top.    If you are not in the mood for a dog, step to the back and get a really good Italian hoagie.    Dogs in the front...hoagies in the back.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "5h0gncdZdMmrgZfGc-9nsA",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5h0gncdZdMmrgZfGc-9nsA/o.jpg"
      }
    ],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "KTnfV3gSCbqY36VB2d0sTA": {
    "date": "6/5/2012",
    "text": "Note #1: For the last hour of each day they are open (Monday-Friday 'til 5PM, Saturdays 'til 3PM, closed Sundays), they only offer takeout through their window.   Note #2:You can dine-in here, but you have stand in front of a counter as there is no seating.   Note #3: Gimme a big...CASH ONLY! An ATM is inside, however.   Let me say that the other day I visited WW for the first time in recent memory and did not come away hungry or queasy, nor did I feel cheated by my tab, which came in at just under $10.    It was just 10AM, and I saw no one inside. A wiry, wily flower peddler observed me. I peered inside WW, turned around, and asked the elderly gentleman if they were open.  \"Oh hell yeah. They open early. Go on in. I'll be joinin' ya in a moment.\"  A fun, good-natured, middle-aged couple straight out of a 70's sitcom runs this venerable business in Downtown Pittsburgh and greeted me like a son who had just returned from college.  WW offers a bounty of other things besides franks, much like Oakland's \"O\" does. My new flower salesman buddy recommended the 1 pound fish sandwich. I thought I saw chili on the menu also, but what I really wanted was their Italian Hoagie, which they also claim weighs in at 16 ounces. Alas, all they had ready at the early hour was their hot dogs, so I ordered up two of the natural casing variety.   That's when I remembered that natural casing weenies give you that cap-gun \"Crack!\" when you take a bite, the skin becoming all the more flavorful when mildly burnt (just enough) by the flat-top grill.   When you use Silver Star hot dogs as WW does, it's impossible to make a mistake, no?  I had one dog with chili and pickles, another with mustard and onion, a Coke, and a pretty generous order of aptly prepared french fries while I discussed the flower-selling trade (it can be pretty lucrative from what I was told), Lawrenceville, and world affairs with a fellow who has obviously been around the 'hood a turn or two and has likely seen everything there is to see, good and bad. A youngun like me doesn't get that everyday. Akin to a good hot dog, conversations like that make life a little tastier. And again, for a 10-spot, I felt I got a fair deal, especially considering fast food prices these days.   WW sells soft serve ice cream for dessert along with milkshakes. I almost ordered the latter but didn't want to become dyspeptic...  <a href=\"/redir?url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D1wUtPpcCvok&s=d300ce3ba67ca79bdaabcd33a2b76d8ca93f0c19d4d3346c2384c1f64dab8e99\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=1wUt...</a>  Let us remain optimistic that the 47 year-old WW survives the same purge that killed Smithfield Cafe and George Aiken's.",
    "rating": 4,
    "rated": {
      "funny": 18,
      "useful": 24,
      "cool": 27
    },
    "photos": [
      {
        "img_id": "YnXUAFCsJVLoP6ht5hUO7A",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YnXUAFCsJVLoP6ht5hUO7A/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "bVNh1_TAcynSD7mpxGnJ1w": {
    "date": "11/18/2016",
    "text": "BEST PLACE! I have a great hot dog place I would usually frequent in my hometown so whenever I moved to Pittsburgh I was determined to find a new place that made me think of home. Wiener world is THAT place! Since then my coworkers and I have ordered lunch from this place more than a handful of times!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vL9irWO2bsmeiEqVX8ulPw"
  },
  "XEmPa6YWsY7KMrgAXyYtXA": {
    "date": "11/18/2016",
    "text": "Had the best kraut dog at this place and the price was amazing. I will definitely be back again and again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gcOb9WOqyxhlG738dyyHIg"
  },
  "lN7Y9YJu_KJab_5s_bdDRw": {
    "date": "10/7/2011",
    "text": "What finer lunch is there than hotdogs al fresco on a bee-yoo-tee-full October day?  Considering that cold weather might be just around the corner, I figured I didn't have much time left in order to enjoy fine encased meats in one of Pittsburgh's many great plazas!   Wiener World's dogs have always had a certain snap to 'em and my beef hotdog was just perfect with all the trimmings (no ketchup of course--I learned that from  my Chicago friends) and topped off with a small order of fries and a diet pop.  So, a tasty dog and great weather.  Worthy of a 6th review, wouldn't you say?",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "UtkjXTiMfGRz4R1zDF3Kxg"
  },
  "uprX8j8Gs5bbLKB6rUTJAg": {
    "date": "10/1/2014",
    "text": "I love a good hot dog and this is a good hot dog place.  The people working were incredibly nice and helpful people.  The inside as others have said just has a standing bar against a wall and that's it.  The hot dogs were full and plump and had good flavor.  They have plenty of options for toppings on the dogs.  I also got fries and a malt.  The malt was very good and the fries were just your standard average fries.  All in all if you like hot dogs you should try this hot dog joint.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QFTgUEdAtxhR44KdeHQXFQ"
  },
  "cJRJM92YELRjSG4XqBk5qQ": {
    "date": "8/19/2015",
    "text": "This is exactly what you would expect from a hot dog shop.  There are a few different types of dogs here, some popular condiments, and a soda fountain.    All in all the dogs are better than Sheetz but there are a few other places downtown that do hot dogs better.   If you are nearby it is worth popping in and grabbing a hot dog to eat standing at the counter, but I wouldn't go out of my way for a trip.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "nbVhicAu_-rOrXKh7xV2dA"
  },
  "U48eOnjF2cF-CJw0l1EA7w": {
    "date": "5/18/2016",
    "text": "A great tasting hot dog with a snap. The service is excellent. The best hot dog I've had in a while. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4r7qAZSUYtdTFiGV74FUVA",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States. Great food",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4r7qAZSUYtdTFiGV74FUVA/o.jpg"
      },
      {
        "img_id": "KLOmXxjS9hd8_gdqnJpLKQ",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States. Beef hot dog with mustard.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KLOmXxjS9hd8_gdqnJpLKQ/o.jpg"
      },
      {
        "img_id": "Hsm5pJV8kpl1BMmKa3S8oQ",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States. Natural casing hot dog with relish, onions, and mustard.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Hsm5pJV8kpl1BMmKa3S8oQ/o.jpg"
      }
    ],
    "user_id": "C_68UNowwSR7dFNTznANnQ"
  },
  "6WBlIVoQUPDYPlpfdPEVcQ": {
    "date": "4/5/2017",
    "text": "Been getting milkshakes here for years (best in the city!) and finally started getting actual food there this year. Very good dogs!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8mr2dSiChy41mHVCGFRb6w"
  },
  "b6CGaufMxTKgvGZClpd1dg": {
    "date": "7/23/2013",
    "text": "I've had fish sandwiches all over Pittsburgh, it's a staple of the burgh diet and one of the dishes we do best.  Sadly Wiener World does it worst.  A bad fish sandwich in Pittsburgh is like bad BBQ in Texas or a bad cheesesteak in Philadelphia, an offensive abomination that denigrates the pride and reputation of the region.  I have never had a worse fish sandwich anywhere (including in fast food hole in the walls) and at $10, this assault on your taste buds doesn't come cheap.  It was bad in every way it could be bad.  Frozen, greasy, tasteless, heavy on bland batter and light on fish.  To add to it, even though the inside of the establishment is large, there are no chairs to sit down (just counters), they don't take cards (cash only, but they do have an atm) and the inside was freezing, I was shivering in the 60* temperature even though it was 80 outside in July.    So why do they get 2 stars instead of just 1?  My server was very nice, the fries with the sandwich were prepared fresh and were good, and I've heard from many reputable sources that their ice cream is fantastic.  That said, I'll be licking my wounds from disappointment for a while before I lick their ice cream.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "MDeA-Gx8NScCyAdziq7IeA"
  },
  "7uHOv0sjWDA1WiPPaN0x6g": {
    "date": "4/10/2013",
    "text": "I miss working downtown, because I used to visit this place a good bit when the weather was warm.  The dogs are a bit expensive but they are big and include all toppings.  They used to have an $8.50 special, two all beef big dogs and a drink.  It was a bummer that they do not offer free refills as the drinks are one size and they fill them with ice. I almost always had to get another drink because the dogs are salty and make you thirsty.  The staff is very nice and I recommend Wiener World for a tasty dog!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "_5fx5gexi9OeZIuukV2gHQ"
  },
  "n_PvqObRcU5k0FJ0V0uzdQ": {
    "date": "5/18/2015",
    "text": "Great place to grab a dog for lunch. All beef, natural casing, or kielbasi ... Whichever suits you, these are good dogs. You can also get a killer fried fish sandwich. Fries and soda extra. Nothing fancy about this place but its all about how it taste.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6xE4b44lXBMyxFo_6OIA1g"
  },
  "VbkDDc0L0U5iiqvVOkaf8Q": {
    "date": "1/6/2016",
    "text": "I am not a big fan of hot dogs but as I was walking past one day I saw a sign for $4 chili on Wednesday's. I stopped in and got the chili and have been a regular visitor every Wednesday since! The man who works there (who I believe is the owner) is extremely nice and even remembers me. I would definitely recommend the chili.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VE1KuMYMVT5hf7ZFZ9R0yw"
  },
  "-EeE18oHhg1EAjSwZrPDqA": {
    "date": "4/12/2011",
    "text": "I had originally rated this as two stars but due to new developments, I am dropping this to one star. 4 out of 4 of our group have confirmed queasiness 3 hours after eating here. This place is a public health hazard.  original review: ------------------------------------------------------------------  This place is a total dive but not unexpected for a hotdog place. Overall, I left feeling hungry. For 2 all beef hotdogs, it is $7. Medium fries are $3.50. Add them together and we are now talking sit-down restaurant prices. I think the price for the volume of food you get is way too high. My stomach is literally growling after eating there 30 minutes ago. Taste? It was a hotdog, 'nuff said. The staff looks pretty scruffy (but friendly) and there is nowhere to sit, but you can stand at a counter in the back where the past 5 diners have left crumbs and droplets of chili to soak through your provided coffee filter hotdog cover.  Another kicker is this place is cash only. At least if I am going to spend more than $7 for lunch and leave feeling hungry, I should be able to earn points on my purchase to get a gift card to another restaurant!  Well, I'm done with my Americana experiment for the year.  Food Quality/Taste = 2 Stars Portion Size Given Price = 1 Stars Price = 2 Stars Service = N/A Experience with Staff = 3 Stars Decor = 1 Stars Clean (yes/no) = not really.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5UDVAuh_gJcjWw5M4-xsbw"
  },
  "vOAmLWAwEBj-E80D8kFCDw": {
    "date": "9/26/2015",
    "text": "Probably some of the nicest people you'll ever meet, making fast, tasty food. 1/4 pound sausage with chili and cheese hit the spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "28oqVTMGYVxQwwKF0_1wCA"
  },
  "fpD3kLs0bxp5ZFw4-HI-KQ": {
    "date": "7/26/2019",
    "text": "Is a hotdog a sandwich?   We may never settle that debate, but one thing I know for sure is that one of my favorite spots in the three river city is Wiener World.  I know these days it's trendy to make wieners into something they aren't, with sauces and even breakfast cereal. But a wiener doesn't need all that. A wiener should be able to stand on its own, with only a bun and some mustard and onion.   If you just want a wiener, this is the place. No frills. No pretentiousness. Just a good old fashioned tube steak.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4ClwdfBK0UZmi8_zWTxn-g"
  },
  "neOHHbRUkpQd50lFjvV_lQ": {
    "date": "1/17/2019",
    "text": "Came here for the first time for lunch.  Friend ordered their lunch special of 2 hot dogs with a drink and I ordered the lunch special of a hot dog with chili cheese fries and a drink.  I ordered the beef casing hot dog with brown mustard and onions.  What's Hot - Price.  For our 2 lunch specials, the total was around $17.  All their items are decently priced.  Their hot dogs, sandwhiches, wraps, etc... are pretty much under $10 a piece.   - Menu variety.  Their standard menu is above the order register and it's pretty straight forward and easy to understand.  However, they also have a regular menu with more items, including their sandwiches, salads, wraps, catering,  and ice cream.  FYI- if you already know what you want and it's going to be quick, go in their \"back\" door, which is a little further to the side of the entrance.   - Quality of food.  Their food is made on the spot.  Their hot dogs, fries, etc... are all made in front of you.  Their hot dog has a nice snap when you bite into it, which I like. - Portions.  Their portions are a decent size.  It's not too much that it'll stuff you, but it's good. - Location.  It's in the heart of downtown Pitt, so it should be pretty easy for yinz to find.  Haha...  :P  What's Not - Quality of food.  I'm not saying their food is bad.  It's good.  It doesn't stand out, though.  For example, my chili cheese fries had the standard canned chili with velveeta cheese.  In other words, I've had better. - Standing room only.  My friend and I went a little before lunch, so it wasn't crowded.  There's a counter for you to stand at and eat.  There are napkins, with malt vinegar, ketchup, etc...  But you're either going to stand or take out.    Final Answer Would come back.  Probably not my first choice, but it's good, decent, and reliable.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "q3s4wiqQzuK5D1SYo7QZaw",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States. Beef casing hot dog with chili cheese fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/q3s4wiqQzuK5D1SYo7QZaw/o.jpg"
      },
      {
        "img_id": "Cr6o_WVv8mEv7sM67qwCzQ",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Cr6o_WVv8mEv7sM67qwCzQ/o.jpg"
      }
    ],
    "user_id": "eYUt3Va-5w-NrCBxD_PrFA"
  },
  "2aJELqjy9ONn-qYMGbm4Yg": {
    "date": "7/19/2018",
    "text": "A co-worker pointed out that Wiener World was a great stop for a quick lunch so I figured why not give it a shot. It is in a cool location and easy to get to from downtown with a short walk. The place is kind of on the smaller side with a long counter for patrons to stand at and eat but no seating. They offer several types of hot dogs, fries, fish and chicken sandwiches along with deli sandwiches from Market Street Deli.  You can also grab some ice cream if you want but we are here for hot dogs!    With Natural Casing Dogs, All Beef 1/4 pound dogs and kielbasa, you shouldn't have a problem finding something. I went with a natural casing chili cheese dog and an all beef Chicago dog. These were made to order and I was really impressed with the Chicago dog! It was delicious and a True representation of the Chicago Dog including sports peppers. The natural casing dog was also good and had that snap you are looking for but the chili and cheese was just meh. It tasted like the the stuff you can pick up at the grocery store. Nothing special.  Too bad I also ordered chili cheese fries because it was more of the same. In the future, I'll definitely get another natural casing dog but too it differently. Speaking of, they offer all the normal toppings including kaurt.  The fries were your standard shoestring style. Pretty good but again the chili was just meh. Gravy was an option so maybe I'll try that next.  I'm not sure how this ended up as a one $ location because I paid $15.50 with a $1 tip for two dogs, small fry and a 16oz drink.  While I think that is a bit high and certainly not cheap, I'm okay with it based on the quality of the actual hot dog you are getting. These aren't Sugardales.  The service was fast and friendly but it gets really busy and crowded so there was some confusion with orders but it's all at the counter so easily fixable.   Over all I enjoyed my experience and think I will even more with a few tweaks to my order.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ZJwVg_FRsJlXHBAFqTBF5w",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States. Chicago dog, Chili Cheese Natural Casing, Chili Cheese Fries and a Drink $14.50",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZJwVg_FRsJlXHBAFqTBF5w/o.jpg"
      },
      {
        "img_id": "_QkQ3KH4Gw5S2K2yMk3ryw",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_QkQ3KH4Gw5S2K2yMk3ryw/o.jpg"
      },
      {
        "img_id": "_jIMPKemwJc5LMzeKxlGnQ",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_jIMPKemwJc5LMzeKxlGnQ/o.jpg"
      }
    ],
    "user_id": "wzItnkHTHKNqJESMSTEYJg"
  },
  "gAVQiYGF5WcJJxWsuKhCTg": {
    "date": "6/26/2019",
    "text": "Their  2 hot dog special can't be beat. Dogs have snap and are  delicious.  I stop whenever I can when in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xrMRE2ce3vq4fnd1Fjij_A"
  },
  "uE02mmQvL37-uiYm1TcVxQ": {
    "date": "11/11/2018",
    "text": "Let me ask you something, is a hot dog a bad choice for breakfast?  If your answer to this is yes, we can't be friends.    I recently found myself Downtown in the early morning hours.  Maybe ten in the morning isn't early to some of you but to me it definitely is.  I was starving and waiting for a nearby store to open its doors.  Wiener World is right across the street from where I was going and a place where I have wanted to visit for a very long time.  It has been a place that has been kind of taunting me over the years, not on purpose, at least I don't think so.  The hours are not that great for someone that works odd hours, but I cannot hold that against them.  This has just been a place that was always just out of reach for me, a place where I would always say to a friend that we should go to and be ignored, and a place I just didn't have enough time to visit while in the area.  Well luck was on my side finally, even if it was still breakfast time.  Great thing about showing up at that hour, no wait.  Absolutely no one was inside when I walked in.  I was greeted immediately upon walking in the door and given a few minutes to look over the small menu above the grill.  I already knew I wanted a hot dog, but of course you have to decide on the toppings you want.  Finally figuring what I wanted on my breakfast hot dogs I was set.  I had gotten the two all beef hot dog combo, which comes with a drink.  Since it was early that meant the dogs came hot off the grill and straight into a bun.  These dogs were massive, not the grocery store kind that you are used to.  Nice and plump, piping hot, and topped to your liking.  All I had on mine was yellow mustard and onions.  The onions gave it a freshness because of the crunch.  For my drink I opted for their fresh brewed unsweetened tea.  You can sweeten it how you like if you want.  They do have a deli section where they offer meals and deals.  I cannot tell you anything about this area since I did not have any intention to buy a sandwich from a place called Wiener World, I wanted the hot dog.  I do know that if you look them up on Facebook they do tell you what the special is for the day, which most times comes from the deli section.  Credit accepted now.",
    "rating": 5,
    "rated": {
      "funny": 16,
      "useful": 18,
      "cool": 17
    },
    "photos": [],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "FzKMmMAsfFT_Ot3EhmUgOg": {
    "date": "5/11/2019",
    "text": "This is definitely the worst place to get a hot dog in town. I had TERRIBLE service from both the cashier and the cook. Also, the atmosphere was gross- it looks like it hasn't been updated since it opened. I ordered the two kaiser hotdog and drink combo with a fry. THEY DIDN'T GIVE ME MY SECOND HOTDOG. I spent $11 for a meal that was COLD. Not to mention it was the worst hot dog I've ever had. It was super small and the bun wasn't anything special. I will never go back and would never recommend this restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JaVpqA3MsDGJqYwQOu56Qw"
  },
  "n-B12aLA2ZRpcTBaoGCzjA": {
    "date": "2/20/2018",
    "text": "Howwwwwwwwwwwwwwwwwwww have I not reviewed this place yet!!!????  My name is Hitt, I'm from Pittsburgh PA.  I do many things but one of the things I like to do is experience everything I humanly can from foods to places plus people and things.  Rather than write a long review and clutter the reviews with anymore long reviews (no knock, you guys are great) I'm just gonna get right to the point...  This place?   -Has a Kings selection of wieners (lol) -Is surprisingly very clean! -The workers are really nice. -The fries are great -The fish sandwich is the sleeper hit. -No seating but stand and eat counters make it really unique. -Gets PACKED at lunch time, go about 10:30 you'll be one of the only ones and the food will be fresh cause it's prepped for the lunch rush. -don't be shy, stuff your face with their wieners.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 9,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "z6-pU9KVzNCBerOLUM_Rig",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z6-pU9KVzNCBerOLUM_Rig/o.jpg"
      }
    ],
    "user_id": "zUQVfRIwoDJb_-8qiWUNwA"
  },
  "QT0Lit_pTgGbfZRcSQ1EbA": {
    "date": "5/3/2017",
    "text": "A co-worker pointed out Weiner World during a lunch walk as a well known and established eatery in PgH.  Sure, why not, I am a hot dog fan (especially with good, hot chili on top).  I proceeded with a combo meal for lunch namely 2 dogs (kielbasa and beef) with drink for about $9.  I walked outside about 3 blocks away and started munching away.  The chili was not quite lukewarm but since I walked about 5 mins, thought that may be normal for food to cool slightly.  The issue was that the hot dog itself was not hot at all and tasted like it was taken straight out of a fridge and not fully heated to the proper internal temperature as it was still cold.   I discarded the rest of the food.  As suspected, I felt like crap hours later and the rest of the night.    I then recalled seeing those dogs on the grill but it none were steaming hot and sitting out cool in rows as they put them in buns.  I seriously doubt that they even temped these weiners before serving.",
    "rating": 1,
    "rated": {
      "funny": 43,
      "useful": 66,
      "cool": 58
    },
    "photos": [
      {
        "img_id": "-ntVqMb98ESYlo-LIfQZpw",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States. Eat a dog outside",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-ntVqMb98ESYlo-LIfQZpw/o.jpg"
      },
      {
        "img_id": "4L3_qCzzUmdVZDI_RGpINg",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States. Hot Dog with Chili",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4L3_qCzzUmdVZDI_RGpINg/o.jpg"
      }
    ],
    "user_id": "6tbXpUIU6upoeqWNDo9k_A"
  },
  "og-K1i7Za_GxTgxjcqYMhw": {
    "date": "4/9/2019",
    "text": "I walked by this place hoping for a dog for lunch last week. The giant signs were gone. Nothing in their place. A menu board on the sidewalk listed lunch items, but no hot dogs. Is Weiner World still here?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L5vVeTiwjpi21d5p4DKHZA"
  },
  "hO8Of2ienhqeZjdEN-HYmQ": {
    "date": "6/25/2019",
    "text": "Stopped in and got a natural casing dog with sauerkraut.  For $4 it was a solid dog, nothing spectacular but nice snap and a good size.  Fast, friendly service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kEaYB4uGiCE7_OX5mirZkA"
  },
  "sDK8LvFeCSbt-7oDk_U0dA": {
    "date": "7/27/2018",
    "text": "Like the new ownership very much. Denny has a deli set up to accompany the hot dog favorites. Try the daily specials!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "7FmHFmKsaUKyAHwdMqG2aw"
  },
  "8YwMooF8SFmy-KMf9ChodA": {
    "date": "3/29/2017",
    "text": "Come for the wieners stay for the love. Lots of yummy things on the menu at this grill-style wiener shop that's been a Smithfield Street staple for years. I'll sometimes get a plain dog or one with cheese and often with fries. Other times just fries or a hoagie. There's a long counter where you can order take away or stand there and eat your way through the wiener love. Because once you've had one...",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "J6Orl5VaD8P4EuWiyTSXqw",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States. Exterior.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/J6Orl5VaD8P4EuWiyTSXqw/o.jpg"
      }
    ],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "RfM9nQ_5Ps1jspmt0sWz3w": {
    "date": "11/29/2018",
    "text": "Very good old school dive hot dog joint! Great toppings and simple menu. Had the original casing dogs and loved them! I am not a huge hot dog fan but these were great! Definitely will go back next time I am in Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "D9_2TAka66qKhXaGnzDceA"
  },
  "oz1UxFw7CTjZAbxGEPLwPA": {
    "date": "10/27/2018",
    "text": "If you're in Pittsburgh, this is a must stop. They also have a whiskey tour where you get to see the distilling as well get three tastings. Worth the money, really an awesome place. Not too much standing room in the general area, so it may be a little squished. Also only one bathroom stall, just a heads up. But overall, this place is fabulous and has a great variety of whiskeys. Super fun environment, hip. 10/10.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Vu-fAw0y6rENi29QUjwZaA"
  },
  "yp_Phsf8mCU6zSfjbRS68w": {
    "date": "8/16/2018",
    "text": "Great dogs. Great deli. Great ice cream. Best soft serve in the city. This isn't the old Wiener World.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-e2XNVwds-L8PwxAGhAXPA"
  },
  "GNXAUerEqcMeoDDXY7IAAA": {
    "date": "8/3/2018",
    "text": "I mean it is a chili cheese dog.  Don't go in expecting something fancier.  However, it is a damn good chili cheese dog and I found service to be quick and friendly even though they were pretty busy for a lunch time rush.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1-WVaosTuwwYglNTl8CViA"
  },
  "4KP7FM5yqsAtAro4mS80oA": {
    "date": "6/15/2018",
    "text": "I dunno how they do it, Combine competent nice people with great hot dogs and Weiners. Have not begun to eat everything on the menu , what I've had is very good, Chicago dog, love it",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ckd5oA7Zv75xOeSaUlkl7Q"
  },
  "VyNIYBisB0b-qEAeqvFmaA": {
    "date": "11/2/2017",
    "text": "There is now a deli counter in one end of the restaurant. They serve salads, sandwiches, and small items such as chips from there. The new owner seems like a nice, personable guy. I met a few people that know him from a previous restaurant that he owned. The Italian hoagie that I had was good.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "89jbA3LpcAaTSaf2DI9VSA",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States. Brisket sandwich with homemade chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/89jbA3LpcAaTSaf2DI9VSA/o.jpg"
      },
      {
        "img_id": "amqF-tXdkKxrheFiVdYw7A",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States. Italian sub",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/amqF-tXdkKxrheFiVdYw7A/o.jpg"
      }
    ],
    "user_id": "Vu3lX-8xw-2j4OFjTILlzw"
  },
  "uNvb28GneYAF2JBKM2nDPg": {
    "date": "12/8/2016",
    "text": "I haven't been here in years but decided to repay wiener world a visit, and compare it to my personal favorite, the original hot dog shop in Oakland. I ordered two 1/4 lb beef dogs and a drink for $8.50. One with brown mustard, relish, ketchup and hot sauce, and the other with kraut and chili. This was a filling meal but the dogs lacked a distinct flavor. Overall, this place serves a good dog and is a better bang for your buck but the \"O\" has a better tasting dog and toppings. I immediately drove to the \"O\" and ordered similar dogs (see review).  For art lovers, one of my favorite murals in the city is above wiener world, of Andy and Andy.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tnJrrz8a9H57tjKUgCQJOw",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States. Brown mustard, ketchup and relish",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tnJrrz8a9H57tjKUgCQJOw/o.jpg"
      },
      {
        "img_id": "XA5BNIKg5JloO3neP8F3ZA",
        "caption": "Photo of Wiener World - Pittsburgh, PA, United States. Chili and sauerkraut",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XA5BNIKg5JloO3neP8F3ZA/o.jpg"
      }
    ],
    "user_id": "O4s9lPLMbT981mu5JMCFYQ"
  },
  "nS5dIUHesnXEOfdHXKSIwA": {
    "date": "9/13/2017",
    "text": "I'm all about a long standing local restaurant and a great hotdog, but this place was Meh. Had the Chicago Dog minus the relish plus sauerkraut for an additional 50 cents. I can't really put my finger on it, I would guess it's freshness. The tomato was flavorless, the pickle was warm, limp and inedible. The dog itself was good but I've had better dogs at a Coney Island in Michigan and Portillos in Chicago. The service was quick, but it was 11:40 and I was way ahead of the lunch rush.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9CR7SVF5IKfqxXAEiFb45w"
  }
}