{
  "F2mGAyBohid4v_vBAFvDEQ": {
    "date": "4/13/2014",
    "text": "I actually really like this place ALOT ........The stuffed pepperoni roll is great it has a sweeter pepperoni in it which is extremely good....I have eaten several things here and none have been bad ...The fish sandwich was HUGE and cooked great,Steak Hoagie was also very very good ....Not Dannys pizza good but still tasty...Spaghetti with meat sauce was also good and very filling ....Id go more often if I could afford it",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "slYpht0GhmDKiojzOVQ8kw"
  },
  "B24SsLGNvyrm995Vl2dWhA": {
    "date": "6/29/2014",
    "text": "It's fine and the portions are huge (as they should be for $15 plates, but nothing except their salad and Alfredo sauce can be made meat-free. So it's not for vegetarians at all, but if you like meat in every part of your meal it's pretty good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LSYMEi2ccC0KNXVWM9aQpg"
  },
  "nbPxYOdVEMBr8FaKCwGaIg": {
    "date": "4/19/2014",
    "text": "We were in a bit of a rush on Good Friday, so we ordered out.  They told us 45 minutes until pickup.  Then, we waited another 40 minutes and went home with what they gave us.  Unfortunately they missed a part of our order.  They cheerfully gave us the missing dish along with a dessert for the trouble  The food was plentiful but varied greatly in quality.  The fried fish was mostly batter and little fish; the bread sticks had its cheese falling off of it.  The pasta was generally overcooked.  The gnocchi was good but surprisingly served in red sauce.  I really don't understand why the long wait and high demand for the experience save for the generous portions",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQ4REXAZWO8rIuy2Fvbr7Q"
  },
  "M1vT4OtKGXU8I2vNzxBJqQ": {
    "date": "8/1/2013",
    "text": "Started off with the bread and dipping oil.  While the oil was ok, it tasted more like someone vacuumed the grease off a cooked pepperoni pizza and bottled it.   We ordered the stuffed mushroom appetizer to start with, I got wedding soup, and my significant other got a salad.  The crab stuffed mushrooms contained shells and tasted like it was made from canned crab.  The wedding soup was most definitely a can of Campbells wedding soup as it was all mushy and had the nice campbells soup taste.  At least the salad was ok as you can't really can or bland a salad.  I ordered the veal scallopini and the missus ordered the chicken cutlet parmesan, both with a side of pasta.  The pasta was cooked al dente but the sauce tasted like an unseasoned can of store bought tomato sauce and was barely salvageable from blandness with the help of parmesan shake cheese.  The chicken parm was dry and the sauce, again, tasteless and bland. the cheese seemed to save it for the dish.  The Veal Scallopini on the other hand had no saving grace at all.  It was dry and as tough as shoe leather as it tasted like it had been previously frozen. The sauce had a sharp sour flavor like it was off and did not look even a little bit appetizing.  A few bites and I brought it home to feed my dog, as that is the only place a mess like that should go...to a dog bowl.  The service was mostly excellent, with our waitperson keeping our drinks full for the most part and being a pleasant and cheerful person, however, not once did she ask if we liked our food or if we had any problems with anything.  The atmosphere felt more like the cafeteria at a retirement home, as it was a drab interior and filled with mostly senior citizens.  I will not be going again myself, but I have been to worse than this which is why I gave it a 2 star rating and not a 1.  They were saved by the ineptitude of other bad Italian restaurants in the city of Pittsburgh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fiDFbaO7H1vgNlM9AiQrVA"
  },
  "uAolD5ChQ3AHHH1o1KsDVA": {
    "date": "9/27/2013",
    "text": "Great Atmosphere, always extremely clean----waitstaff has always been great---they use amazing Olive oil on the food and also served at the table for dipping....  The wait is always long, and it's OBVIOUS they make the lasagna ----freeze it----reheat and serve....  Average Italian food at best----bring in a chef instead of a group of cooks and this place could easily compete for the best Italian Restaurant in the Burgh",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fqu-sGgKVgumKLhvs5MfEA"
  },
  "erWWP7XXK_8qN61cLtgGIQ": {
    "date": "3/26/2014",
    "text": "My husband delivers food to the restaurant and we finally got to eat there. Went on a Saturday night and it was busy. They said 45 minute wait but it wasn't more than a half hour. I know from my husband a majority of their food is homemade. It was amazing!!! They give you so much that we all took home stuff and got another dinner out of it. The meatballs are made with veal and are delicious and huge. I had spaghetti an my husband had chicken parm. Our friends had crab cakes (homemade) and stuffed shrimp Alfredo. The shrimp was the biggest I ever seen. You can't go wrong eating here. We didn't have pizza but a lot of others did and it looked really good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o75sJFl1mETSrAVilAFIgg"
  },
  "aA1sPcT0xA1UtLciE9fydQ": {
    "date": "4/25/2015",
    "text": "Other than a long wait most nights for a table I don't understand how anyone can find fault with this place. The food is wonderful, and they give far more than one can eat in a single sitting. The bread is fresh baked and the Pasta is excellent.  Only caution: stay away from the sausage calzone unless you like huge whole sausages.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3GLZbeJIOIhoZvjeziRv6A"
  },
  "wIsW1dL_aX8EQLViic1aCw": {
    "date": "4/17/2011",
    "text": "Pasta Too is good.  Their kitchen is quite impressive.  On an early Saturday evening (5:00), we put in our name and were told the wait would be 40 minutes (ended up being a bit over 55 min).  Shortly thereafter, the wait was well over an hour.  While waiting, I noticed that a significant number of customers were getting \"take out\".  So the kitchen was pumping out food for the dining room plus TONS of \"to go\" orders.  Quite efficient all things considered.  The food was good, the portions will feed us for three more meals, tables are too close together and parking can be a significant challenge.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KZ40bOby2_SC0ErWnz8gRw"
  },
  "P2l0KFp3WgeD6OiFa2yHEQ": {
    "date": "1/2/2017",
    "text": "service was amazing, pam was our server and she was fantastic, so personable and on top of it!!! the food was amazing, everything was perfect from start to finish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DLV1mnklLZuGyjgJB-u0VQ"
  },
  "EVR_n7Y_2HFYSM4KYMI2YA": {
    "date": "8/24/2013",
    "text": "I've been eating at Pasta Too for years and it has been consistently delicious! I order the chicken parm and am always satisfied. The restaurant itself is on the smaller side, so I prefer the take-out option, which works just as well! I spent a semester in Europe and I still say that the best pasta I've ever had isn't in Italy, it's at Pasta Too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JaECdbp26BEIyaDiImTIIw"
  },
  "iV5qbryjUp2K9nibZtvnEQ": {
    "date": "7/19/2015",
    "text": "Use to LOVE Pasta Too but the quality and service has almost diminished completely. I've worked as a General Manager in the hospitality industry for years and this was one of the worst I've ever had. The sauce tastes like Chef Boyardee, not one homemade noodle in the place in addition to the overcooked mushy boxed noodles that you get, and the service. The service is the worst. Joyce was the WORST server I've ever had. This place needs a wake up call. I cannot believe there is still a line out the door on some days. Sad.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EcadLXoy_b0fhzYq853asA"
  },
  "c_G8uBCOfdnu-f6tlXHGUg": {
    "date": "6/30/2013",
    "text": "Food is great here, just don't sit by the server alley, you will have your chair kicked at least 10 times or more.....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uRrk4iuVNt5sqj2B1E2tFA"
  },
  "RsRywPRUpIuHxezjb-vpqA": {
    "date": "5/8/2012",
    "text": "The rude hostess strikes again. I just arrived to meet a friend for lunch, and the dried up old prune hostess, with a HUGE mouthful of food, said she wouldnt seat me until my friend arrived (with crumbs spraying as she barked at me...nasty!!!).   I'll be having just water today, plus bread, then going to panera across the street where the staff has people skills.  I'll never return to this restaurant again. 3 strikes youre out Pasta Too.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "70A6oonhct1PftwOtQfBCg"
  },
  "DxvN0tz-2wMq_vhcJMdigw": {
    "date": "7/21/2015",
    "text": "Fried shrimp tasted like the oil that it was fried in. Spaghetti sauce was not very interesting and I have had better from a jar bought at the grocery store.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j4PlBVMlM0Tf6WMb9n9epQ"
  },
  "HaJfskzmTn-kCvJu-kP45g": {
    "date": "4/16/2010",
    "text": "I have mad cravings for Pasta Too out here in California, and when I go home to visit - it's the first thing I want to go eat!!   I started going there back when they were in a renovated gas station, drinking out of plastic cups, then they moved to their beautiful new place.   The wait for a table can be excessive, i have waiting an hour+ for a table, but for me - it's worth it. The food is fantastic, HUGE portions, the servers have been there forever...   Try the breadsticks and cheesesticks - they are great! I'm also a HUGE fan of the chicken parm!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "aZ7mxYh8niIIsX6_HPb2mQ"
  },
  "_zP-TkLHBchV32PiVEU2DQ": {
    "date": "7/4/2010",
    "text": "This is my favorite Italian restaurant! They have HUGE portions and very excellent prices. I don't get to go very often, but every time I;m in the mood for some good Italian this is the place I go. They also make excellent hoagies. I'm a big fans of the turkey! Their dipping sauce for the bread is amazing! I'm pretty sure they sell it by the bottle as well. If you are looking for some good Italian food in the South Hills look no further than Pasta Too! Their tiramasu is awesome! It's also huge which is a good thing because I'd never share otherwise.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eiiS0rrIN6orvf4PmsKe-Q"
  },
  "QJSlL2f7s_H_FKlPjIUqOA": {
    "date": "3/25/2010",
    "text": "Last night was my second experience at Pasta Too. The atmosphere is nice, but there are entirely too many tables and they pack too many people in for it to be a comfortable dining environment.  The first time I ate here, we had pizza as an appetizer and I ordered the special. I can't remember the name of the dish, but it was 2 tennis ball-sized balls filled with chicken, cheese, and roasted red peppers. The sauce was creamy and thick and tasted very much like the filling. It wasn't bad, but it was entirely too much food. The \"side\" dish was about a pound of spaghetti.  My second trip was last night. I ordered fettucini alfredo with chicken. Again, I got about a pound of pasta with a small chicken breast on top. The chicken was dried out and had no sauce. The alfredo tasted like Lipton Buttered Noodles. The sauce was basically tasteless.   We also ordered pizza again for an appetizer, but the waitress brougt it with our dinners. I was pretty livid.  I think the draw of this place is the size of the portions - but I'll take quality over quantity any day. Sorry - but there is WAY better Italian out there...even in Pittsburgh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0Tkq4VV8dD6t8NbBxvBPA"
  },
  "olETFVUudUcUfICS__Heqw": {
    "date": "6/23/2015",
    "text": "One of my favorite places in Pittsburgh. Was wonderful once again. Can't go wrong with any pasta dish. Portions are enormous. Salad is fresh and bread is fabulous.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "69o0M2qxrecmH8CwvZiWsQ"
  },
  "AUCfWb3f5FUeCDJALFpzXg": {
    "date": "5/2/2012",
    "text": "Oh Pasta Too, how I heart you!  I can recite this menu in my sleep.  The food is great and consistent.  Thursday's is prime rib night (yum) and they have lobster mac & cheese during the weekends.  The wait staff is great and is a family friendly restaurant.  Love Pasta Too!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HeNrUXWWofX-7rNij8tnkg"
  },
  "qDJqkONvVTjY4EoNfyxHKg": {
    "date": "3/11/2011",
    "text": "Pasta Too has some amazing Italian food!  The portions are HUGE (probably enough to feed three average people) and that makes the higher prices for their dinner entrees seem much more reasonable.  I usually can only eat about a 1/3rd of my meal before I am full, which is fine by my boyfriend because then we get to take home the leftovers! Sometimes I wish the portions weren't so big though, because I am dying to try their desserts that look amazing, but I am always too full to order one.  One tip that I have is to come kind of late in the evening.  My boyfriend and I arrived around 7:15ish pm and were seated around 8pm, which is around the time the restaurant started to clear out.  So if you hating waiting (and standing- as there is not much seating in the waiting area) and don't mind eating late, definitely arrive around 8pm and you'll be seated right away.  OR you can always call in your order and pick it up to eat at home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nq03AD7fOcb5vTig5jgChg"
  },
  "emfm-TyyCh1y-uBI8TDROg": {
    "date": "9/29/2016",
    "text": "Favorite restaurant in the Pittsburgh area for many years! No one touches their chicken parm! Sauces, dressings all made in house too. Can't wait for our next family get together at the only spot we all love !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "RDwjMJ-SB3ysZ1p0PRpQkg"
  },
  "EFx7MO7I5Y8-exUB3hNKOg": {
    "date": "1/19/2018",
    "text": "We had a 40 minute wait at 5:30 pm on a Friday. Food was well priced, but did not live up to the hype. Better than Olive Garden, but I not the best Italian meal available in the South Park area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cIR6FB2orJq7jBEwiFtxqg"
  },
  "SGdnzU1TvUPd2yNVDPdSdw": {
    "date": "1/13/2018",
    "text": "I make an occasional stop. They do a good business, it gets pretty busy. Personally I like the veal parmesan, it  usually takes me 2 meals to finish it! I've taken friends there as well, never had a bad meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XalOX_W-akiyOf26Ro4tLw"
  },
  "7BaZdTKuAhcdQYzDB07gHw": {
    "date": "7/7/2017",
    "text": "First off - I am a vegetarian, so I love a good tomato sauce. I found out from our waitress that the tomato / marinara sauce there actually has beef stock and beef in it. I was SHOCKED! No where on the menu does it list that!!!  I got up from the table and located the owner - she confirmed. YUCK!!!  SHAME ON YOU PASTA TOO!!!!!!!!!!   Meat sauce and Marinara/Tomato sauce are different things!  Why put meat in all of them?! They use it on their pizza too.  So disgusted!!!!  When I expressed my disappointment to the owner, she didn't seem to care and turned into a total psycho.  STAY AWAY!!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NHPjX2jJJBcJP7kz13lbUg"
  },
  "h9UAmBBmc9jiTYuxWCao1Q": {
    "date": "11/10/2017",
    "text": "Really love Pasta Too! Their food is always good. They don't take reservations, so arrive ahead of time and expect to wait a bit to be seated. The waiting area is a little small and limited seating there too. I love the shrimp scampi! SO GOOD! We usually order take out, food is always hot when we arrive and tastes great!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ALDjkcS9OBKk4YTQ89dEgw"
  },
  "nIsnMJ0l2NoHfYUCqyvq6g": {
    "date": "11/4/2017",
    "text": "Had a great meal food is excellent! And portions are huge. I had chicken parmigiana with ziti it was delish and had to take half home.  Service is always fast and efficient.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eiE2ix_dXjvgfEBN4QYq5A"
  },
  "6NsiaZCmTv2wxaDCPwT4_g": {
    "date": "2/8/2018",
    "text": "Average food. Horrible staff. Will never give them my money again. I do not know what people see in this restaurant....they also cram you in the small space like sardines",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UUpU9Kqj1X07Dp5HZFk2JQ"
  },
  "ZVHahB71FrNRe-mS6bGRxQ": {
    "date": "6/30/2015",
    "text": "Being an out of towner ..  It's my favorite restaurant to visit. It's one of the must haves! The atmosphere is relaxing, the service is always wonderful & the food always exceeds our expectations. Asked for the desert tray, you won't be disappointed!!  The Zucchini Parmigiana was simply amazing! Just the site of it will make your mouth water! It is definitely enough for 2 people to share",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jnWqS8pZLWgIrMfWLQQkpQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Zucchini Parmigiana was simply amazing. The site just makes your mouth water!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jnWqS8pZLWgIrMfWLQQkpQ/o.jpg"
      }
    ],
    "user_id": "RTzCVCF0NzALmgDmdrqWJg"
  },
  "oXdmtRwqRVnsWKjGG2SPxw": {
    "date": "5/3/2018",
    "text": "Place is always crowded when I wanted to go but finally was able to get in on not so crowded day.  Have to say it was worth it!  The sauce is one of the best I have had in Pittsburgh area.  Was not impressed with italian bread but the dipping oil was very good!  Will go back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bz9XpvXMAc_D1n2DjW_-0A"
  },
  "vpQgKPakQcWEysOqdSqgrQ": {
    "date": "10/26/2017",
    "text": "Take out is great if you don't want to wait. There is always a long wait on the weekends. Chicken Alfredo and lasagna is amazing. Everything tastes homemade.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cZnqIrRrdUhmWFudbLtf2g"
  },
  "Q37Qsdjr1C-zSMlAsezEeQ": {
    "date": "5/25/2017",
    "text": "Food portions were amazing. However, the food was nothing special and the service was fairly rude. The pasta sauce tasted like a store brand. Our server obviously knew the table next to us and gave us hardly any attention. They even boxed up the food of the table next to us and practically threw our boxes at us. The soups were probably the best part but still not worth the prices. The location is also very inconvenient and the parking is minimal. We also waited a very long time between our appetizers and entrees. And refills took forever.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0aY3hwDUY4HX0F7nQsUpSA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Vodka Penne with Garlic Bread",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0aY3hwDUY4HX0F7nQsUpSA/o.jpg"
      }
    ],
    "user_id": "MqQpSOe0PJFVG6EgTE2uwQ"
  },
  "XXgEqCU8Mz1zHC0NZ5ZqEw": {
    "date": "1/29/2017",
    "text": "The stuffed sole and their fettuccine is one of my favorites.  Food is always fresh and hot.  The servers are usally very friendly.  The only downfall is they do not take reservations.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r88Q1qibdylJtvu7VlKbrw"
  },
  "Z9xFESC5EjXJgxo76B5FuQ": {
    "date": "11/9/2017",
    "text": "Love coming here, though I wish they were bigger as there is ALWAYS a wait.  Their small calzone is awesome and big enough for 2.  We ALWAYS leave with a doggie bag of enough food for 1 or 2 more dinners.  Good place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1fTflLoa2gHyN7JmV4O-wQ"
  },
  "B2TdpwBdf-sixjSqd4O0SQ": {
    "date": "1/30/2015",
    "text": "I have been wanting to try out Pasta Too for dinner for a while, last night my family and I decided to try it.   I am so glad that we did! We got there early so didn't have a wait to get a seat, always a bonus. The food was just amazing, full of flavor and very big portions.  Everything was so pleasant, the service was wonderful.  I totally enjoy the dinner and will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "v-GG4vT1P7tmF8wRozCjbw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. My wife enjoyed crab cakes.  Big chunks of crab to savor.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/v-GG4vT1P7tmF8wRozCjbw/o.jpg"
      },
      {
        "img_id": "swE00oy6gHdWEYZSLunfTQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. My oldest had lasagne and loved it.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/swE00oy6gHdWEYZSLunfTQ/o.jpg"
      },
      {
        "img_id": "kmU0uSMhSiSaIDdOQbMWBQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. My daughter had spaghetti and meatballs.  Enough for 2 meals.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kmU0uSMhSiSaIDdOQbMWBQ/o.jpg"
      }
    ],
    "user_id": "IwAzZe3iN9ZBMxW7lKM3Yw"
  },
  "1aBKKt1NPpILA5c8oBll-A": {
    "date": "3/13/2017",
    "text": "Love this place. Have been coming since he had a tiny restaurant up the street. The prices are comparable and you get large portions. And the service is most often great. We have a couple favorites lol! If you're hungry and love Italian this is your place to come.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "_Rcs-FTMGczWDPrln8wPcg"
  },
  "YuHAecDWqNekNg6oqhGe1g": {
    "date": "6/27/2017",
    "text": "Just moved to the area and noticed how packed this place always is.   Ordered take out on a Friday night.  When we pulled up there was an employee outside having a screaming match with an unhappy customer.   Against better judgement still went inside.   Paid almost $80 for two dinners that were basically flavorless.  Portions mean nothing when the taste isn't there.   Half of each meal ended up in the garage.   Don't waste your money,  ill never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ExHvldCwtZ23ATHkgkmdCw"
  },
  "s9AiAhnUTvC4A5zgmJcb4w": {
    "date": "8/5/2014",
    "text": "I'm a southern guy. Born and raised in Southern Louisiana all my life. Working in the oil & gas industry has me traveling around the country quite a bit.  So I've been in PA for about a month. Saw this place on, Yelp. Thought why not. Let me tell you. Best food I've had since I've been here. It's a bit pricy. But you get what you pay for. It's a nice atmosphere. Not a fast food restaurant setting at all. I highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XDoppNa0LyD-jg_Uias1dw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Caesar Salad with real Bread Croutons",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XDoppNa0LyD-jg_Uias1dw/o.jpg"
      },
      {
        "img_id": "lU-7lgZQ_Var_5yDOOXNmw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Pasta Alfredo with Chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lU-7lgZQ_Var_5yDOOXNmw/o.jpg"
      }
    ],
    "user_id": "uLY1HJANOPC8NKFldBGYBA"
  },
  "86lyrS6uI3bVEsPNXn-WbQ": {
    "date": "4/2/2016",
    "text": "Not worth the hour wait standing out front, and then another hour waiting for your food after you order.  I'm sitting now 2 and a half hours in and so far I got a salad and bread. Super nice waitress but doesn't really do any good when she has nothing to serve.  I'd tell you about the food but I haven't got it yet, so don't come here u less you have an entire night to burn  I finally got my food and it was OK I guess",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ev1wxuR5zlFJBTwoZ8oNog"
  },
  "kFPHh2oz9OdHZiaUH6Km2w": {
    "date": "1/6/2017",
    "text": "We recently moved into the area and have heard really good reviews for Pasta too. Four of us went at 5:45 on a Friday night and were pleasantly surprised to be sat right away. The service was excellent- extremely efficient, prompt, and welcoming. We all got the chicken parm and it was delicious. Sauce has a sweeter taste which I love. Portions were huge- could have easily split a meal. I took half home. My husband and I had the apple tart for dessert which was phenomenal. Extremely pleasant experience. Looking forward to returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "BMAlMr4bpCfpPtm4RkTr8w"
  },
  "T_mnewTOM5tdzvlGjXzRMg": {
    "date": "11/15/2013",
    "text": "Great food with generous portions but far too many rugrats (where's the playpen?).  Another thing that can be quite vexing is that they don't accept reservations, and the wait can be up to an hour during the evening hours.  While waiting, you will experience children screaming and running amok in the waiting area.  Finally, I was looking for a bar to seek refuge from all the screaming, nose-picking, sneezing, etc.  IT DOESN'T EXIST; no bar.   Food - A+  Environment - F",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "UQl5EpV2UHL1juulvk407w"
  },
  "Ndu66PgOJdthbwgSBp1IzQ": {
    "date": "11/4/2016",
    "text": "The portions are so big I swear you can feed a family of four off one dish. I won't eat the entire day we're going and I can't eat the next day (I stay full for 24 hours from these meals). The chicken parm is delish. Juicy and tender. Fresh bread with oil is addictive and it's so hard to go easy and make room for the entree. Dessert is never an option for me. I wish it were but again the portions are huge and I don't have the ability to stretch my stomach that much.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "DZDUFSILbIA8VAsPhkY7wQ": {
    "date": "12/23/2018",
    "text": "ABSOLUTELY AWFUL.  It took 1 hour and 10 minutes IN LINE to get pre-ordered pick-up meals. They were severely understaffed and it sounds like a routine problem with take-out meals. The line was 50+ people deep and was wrapped into the dining room.  We were packed on top of people trying to enjoy their meals as we slowly waited to move forward towards the pick-up desk. On top of that, no compensation for the wait (discount, beverage, breadsticks).  Will never order from this place again and will make sure others know about the bad experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L6BS6qLPMac0bgnd9iuLYg"
  },
  "jCE-t6OcNhQSMuv3QU-tgw": {
    "date": "12/15/2018",
    "text": "Great place.  Long wait, but worth it.  They keep it simple, but good.  Been coming here for 30 yrs, menu is relatively unchanged.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a0RuoXG6Jsfq1S2IqJTPjw"
  },
  "vBVVRIkcrA3qruNtY_Y09g": {
    "date": "5/24/2018",
    "text": "Nice place.  Service was very friendly.  Always kept our drinks filled.  Just enough attention.  Food portions were hige.  Had enough to take for lunch the next day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zzGUiwY-emOE0dkTRV0ztw"
  },
  "BlesN3ZkIxWd3DWBe_Rjkw": {
    "date": "1/5/2019",
    "text": "Ordered take out tonight.  They told me it would be ready in 1 hour.  It took 2 hours.  Not happy about the wait.   Whether its take out or eating in, its just not worth the long wait.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5FWmaskJc1IKi3EMSiqBwQ"
  },
  "lOR5ahXZfsfha83a8GbxWQ": {
    "date": "11/24/2018",
    "text": "So these 2 two stars are ONLY because the appetizers were good. We arrived at the restaurant Saturday at 3pm.  We were seated at  3:30.  Our appetizers and salads arrived quickly and it was down hill from there.  We waited over an hour for our food to arrive and once it did it was cold.  There were a total of 5 in our party including a baby (who also waited over an hour) 3 people sent their food back 2 were fish and 1 pasta.  The fish was put into a microwave or something because it was rubber once it came back out.  The pasta included a meatball and even after the 2nd request it was still cold in the middle. The female manager came over who was VERY rude never apologized and never provided her name. 1 person finally gave in and just said she didn't want her food at all.  They still  brought her bill and then didn't give her back the proper change. Another person was charged an extra tax ironically the same tax amount as an item she was told would be removed. I was very disappointed in the service at Pasta Too and although the appetizers were good I would not recommend this establishment.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rMbOMZ2-23hvxoDWgBqmfg"
  },
  "eL0P5z7oggFwYwrcpZ7r-w": {
    "date": "6/12/2016",
    "text": "One of my favorite Italian restaurants in Pittsburgh but last night was a huge turn off. I don't know if it's a sick joke of some sort but this is the name the wrote on my order receipt \"TRAMP\" rather then my last name that I spelt out to them!",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u1aixmvn72AqZhpBclzyrg",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. I don&amp;#39;t know if it&amp;#39;s a sick joke of some sort but this is the name the wrote on my order receipt!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u1aixmvn72AqZhpBclzyrg/o.jpg"
      }
    ],
    "user_id": "_-yFnMPrRqMqc07SeIBDDg"
  },
  "QFP2uG1Cjo-IM4Sf_zvUfA": {
    "date": "8/17/2018",
    "text": "Oh Pasta Too, how I so badly wanted to like you. The rating is based solely on the food. We don't understand the hype? Service was great but the food was not even mediocre. I ordered the chicken Romano which was supposed to be egg battered and then in a lemon butter sauce. The plate came out with three ample pieces of chicken breast however there was no sauce. There was a slight hint of lemon but again no sauce. My dining companion order the angel hair with garlic and olive oil with anchovy. Also very disappointing. The angel hair was Dripping in olive oil with everybody the garlic was overwhelming and other than that there was no other seasoning to it and not an anchovy or even taste of anchovy to be found in the entire dish. I can honestly say the best part in my entire dinner was the bread with dipping oil and the Italian wedding soup. I don't mind paying money for something that I really enjoy but $42 for what we got just left a bad taste in our mouths. Can't say that we'll go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vAzMIatSJGSktoewdP87ew"
  },
  "2hTBzdfPBSmea-uqmk0rBQ": {
    "date": "3/27/2017",
    "text": "AMAZING!!! I can't believe I've passed this place hundreds of times and never came here.  We came with a large group and everyone was pleased. The fresh warm bread and dipping oil was a  hit, we also ordered a pizza for everyone to try.  My husband got a small antipasti salad which was enough for 3 people to eat and we both loved it. I was unable to eat gluten so I got the shrimp scampi and I was thoroughly impressed by how large and fresh the shrimp were.   I will be returning in the near future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Y5SHjnFi5P2BytM5lPBnBQ"
  },
  "q83GibNj--lKmvUENgXOHA": {
    "date": "3/9/2018",
    "text": "Food was good. I had the gluten free penne with grilled chicken. Sauce was super thick. A little disappointed they don't have much in the menu for gluten free.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z7Qi2nz1tKvomVOCYqaZSQ"
  },
  "avNrC6tBy5wsUx8HDmMhrA": {
    "date": "4/7/2018",
    "text": "Great, great food, anyone that says different is a liar. Yes there is a long wait most of the time and the food is a little pricey, but the quality and portion sizes are great! The Italian calzone and fish sandwich are a must!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E1ygd4cHPPlD0TYKg7Berw"
  },
  "m2PHiYII3OO33j1inyQ0rA": {
    "date": "1/1/2016",
    "text": "Solid option with cheap beers and wine but the lack of a bar that you can sit at is frustrating given that there is usually a wait. The Togo orders and order area for drinks were at the same counter leading to a cluster of people on top of each other  and no real organization.  Bread is complimentary and came with some amazing olive oil for dipping. The fried zucchini appetizer was super crispy and came with quite a few pieces for the price- plenty for the three of us to share.  The portion sizes are HUGE!  The spaghetti and meatballs - a classic comfort food was just okay. The meatball was hard and overcooked- not crumble and fall apart like a real home made large Italian meatball should. But @ around 10$ i thought the price was pretty cheap.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "lhfBYKIUPIB2M7U-Q97BHw"
  },
  "V0XwUWulsLm2hnPXjdNbOw": {
    "date": "1/9/2017",
    "text": "PRICES are very high  Food is above average  But parking and the overall size of this place is a nightmare  Staff could be alittle friendlier too",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "mlPlZWO0mHYI4iTmVKAcYw"
  },
  "1NTkATs_XlpBUVdbW3uX-Q": {
    "date": "7/11/2017",
    "text": "This place is indeed busy, as other reviewers have said. I'm not entirely sure the place is worth the wait since its basic Americanized Italian food of average quality. Sauces were a bit sweeter than I like but not bad. Prices are high but portions are huge....enough for 2-3 more meals. The service was great and employees were very pleasant. I don't think I'd go back again mostly because I prefer more authentic Italian food, and if I'm craving pasta it would be quicker, easier, healthier, and cheaper to cook at home.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "26B_W7ynYvZ1Csv_fz6HoQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. The lasagna was huge! Sauce was a bit too sweet and the noodles were over-cooked. Not the best, but not bad.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/26B_W7ynYvZ1Csv_fz6HoQ/o.jpg"
      }
    ],
    "user_id": "wWPhIUD6Xdd2WD6JCUPntA"
  },
  "yXvvYmDPBZ6BQK9fIiHqww": {
    "date": "3/2/2017",
    "text": "One thing I loooove, is some good Italian food. And this place serves it! The portions are plentiful and the quality of food taste is simply delightful and sets my taste buds off!!!! The Fettuccine Alfredo was good.  I also got a chance to try the Pasta with Vodka Sauce. That was something to definitely write home to mom about! So I highly recommend that. The only thing that I hate is, I live quite a distance from the place. But when I am in the area, this is where I will be at to get my Italian craving fix.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "W0YPUUT-1jxzv0hjUi5mLw"
  },
  "wKoMsm4A8ThRnSewTRqGRg": {
    "date": "1/5/2016",
    "text": "In a nutshell: Huge portions of tasty American-Italian food. Delicious bread and dipping oil. Small dining room = long wait.  As a South Hills resident for most of my life, I've dine here many, many, many times. This is one of my go-to Italian restaurants in the South Hills and I think a lot of people have the same idea, as there is ALWAYS a wait here. Come here semi-hungry because by the time you get seated, you'll be hungry. One thing that keeps me coming back is the bread and dipping oil; you almost don't need an appetizer. In terms of entrees, there isn't much you can go wrong with. My favorites are anything followed by \"Parmigiana,\" the veal, chicken, zucchini, eggplant - I've tried them all. Another favorite is the Alfredo. One thing about the alfredo, though, is you need to eat it there; if you take it home and reheat it, the butter and cream separate and it's just not good. But it is amazing when it's fresh! Shrimp scampi is also great: huge jumbo shrimp. They usually have a huge selection of desserts, but the tiramisu is my favorite: simple and classic. Come here when you're in the mood for simple, classic American-Italian.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vL7HLOtqEjzYOtU6McGUXg",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Tiramisu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vL7HLOtqEjzYOtU6McGUXg/o.jpg"
      },
      {
        "img_id": "hLTckyIwB1pnnGLXt-RATA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Shrimp scampi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hLTckyIwB1pnnGLXt-RATA/o.jpg"
      },
      {
        "img_id": "RvNlTxyxD1Q1CyIvoKSjKA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Veal Parmigiana with side of spaghetti",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RvNlTxyxD1Q1CyIvoKSjKA/o.jpg"
      }
    ],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "gMFEVECmqnZG1qkzpSMeYQ": {
    "date": "8/25/2018",
    "text": "Best food I've had at a restaurant in a long time. I got the penne alla vodka and my sister got the fettuccine alfredo. We shared. Both were delicious, but the alfredo was the best I have ever had hands down. Our waitress Carrie was excellent, we never had to ask for anything, whether it was drink refills or clean forks for the tiramisu. We didnt have to wait at all for a table (430 pm on a saturday) and we got our food super fast. Will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y-LH2CjBF31ZwAciuvlKlA"
  },
  "EFmLOXSgMPiIDiAfAqlVFA": {
    "date": "10/25/2015",
    "text": "To start off my server Joyce was not just in a bad mood but so scary that I didn't want to let her know that I didn't like our food. The greeting just felt like she didn't want to be there which ruined our night. We ordered stuffed yellow peppers and garlic  bread which were tasty. We were left alone a lot of the time.           For dinner we ordered chicken parmigiana and stuffed shrimp. Both of the dishes were okay but our pasta that we got with our dinner was horrible. The pasta  was like rubber. Was not edible at all. So to finish this off by saying I will never return.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XL53ixsLEUr7PnFtTFymNA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Stuffed shrimp. Not happy with it at all",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XL53ixsLEUr7PnFtTFymNA/o.jpg"
      }
    ],
    "user_id": "3xT6by94wrLh-AKAdmV-fA"
  },
  "vUxmKvoYTV0_PCXAtJbB9w": {
    "date": "2/25/2018",
    "text": "Terribly awful business practices. My father worked here for quite some time. Last July my daughter passed away at 5 months old. Pasta too offered to cater her memorial service free of charge, no questions asked because he was a great employee and his granddaughter just passed. We thought they were being kind and caring and appreciated the gesture during a very difficult time in our lives, only to find out when he left Pasta Too recently to accept another position with another restaurant they withheld  $300+ from his final pay saying it was for the memorial food they supposedly donated. Ridiculous!! We will never again support this business and we have told our other family and friends about what they did as well and they too will no longer be supporting their business either. How can you say you are donating then turn around and withhold the cost of said donation <a href=\"/redir?url=http%3A%2F%2Ffrom.an&s=611a25792e2c82dcf33c6179141f6cc0f2dcb3ff93ff80ec43bc78aeba0bdc20\" target=\"_blank\" rel=\"nofollow\">from.an</a> employee's pay 7 months later because they decided to move on to a better position somewhere else? I even went on their Facebook page and thanked them for their generosity at that time.  Terrible, I hope anyone who sees this review will think twice about giving your business to this awful place and their terrible business practices.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 0
    },
    "photos": [],
    "user_id": "IMblAar_ubLYfF-YxEOStg"
  },
  "Y_eURjSHtk8oT8FozW61KQ": {
    "date": "6/23/2017",
    "text": "Takeout from Pasta Too was a disaster! My husband had shoulder surgery 2 days before our anniversary, so I decided to get a takeout feast. We have eaten there before, the portions are huge and it's your typical \"Pittsburgh Italian\" comfort food, and usually pretty good. I ordered two appetizers, two entrees, a large wedding soup, dessert and bread and oil. I was told that the oil, which is free when you eat in, was a .75 cent charge for takeout. It's phenomenal and one of the reasons I wanted take out from there, so I didn't mind paying extra. I get there to pick up my order, and immediately the woman at the register asks the woman working takeout if she made sure to include the bread and oil, and the girl confirmed yes, she did. The woman at the register also went thru everything, so I assumed she was double checking that it was all there.   I walk out happily with my two bags full of food, even though my wallet was hurting a bit (70 bucks for takeout for two!). I got home, set up our feast, then I notice something missing... the bread and the oil I paid for! I called immediately and asked about it, they said they were sorry they forgot the bread and oil and if I would drive back there I could get it. I already had all of the food out and we were hungry, so I wasn't about to get back in the car and drive there. I asked to speak to the manager and he said next time we come in, he will fix it, yet didn't ask for my name or know at all who I was. The manager seemed bothered and like he could care less. If you are going to charge a certain price, I expect a certain service. It would have been nice if he at least pretended to care about my business. Definitely won't ever order takeout again!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xZQNniaB3U5Bm5xlDzXeIg"
  },
  "7f4Gk84dNd4zPmkuryfYaw": {
    "date": "11/29/2012",
    "text": "I want to give them 4 stars....I do...but having to wait for 45 minutes on a Saturday at 7:45pm since just  seems unacceptable to me.    Now on to the important stuff....the food! Everything we ordered was delicious!   I started with their wedding soup, which I enjoyed! The bread and dipping oil was unique and a nice touch.   I had penne alla vodka for my main course, and it was good, but warning if you like more vodka and tomato tasting sauces this is not for you! It was good, just very cream based and I couldn't really get past that taste!   I ordered their meatballs on the side and wish I would have ordered more! They were outstanding.   Now for the best part! I had enough leftovers for 2 more meals the next day! HUGE portion sizes!!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "etU9P4_CgI4S79Ec5KHs9g"
  },
  "hdL93woGTTgOakpagQRtxA": {
    "date": "12/19/2012",
    "text": "Pasta Too serves tasty Italian-American comfort food. It's not the height of fine cuisine--it's delicious pasta with yummy cheeses and a pretty tasty red sauce that goes on most of the dishes. Their manicotti are craveable--the crepes are delicate and the ricotta filling is perfectly seasoned. Veal parmesan is tender and delicious. Their fettucine alfredo is a little too bland for my taste, but the grilled chicken on top of it was perfect, herbed and marinated to keep it flavorful and moist.  The waits can get pretty absurd, and that's even taking into consideration that I've only ever had takeout here. The people who answer the phone tell you your order will be ready in 25 minutes no matter the day, the time, or the food ordered, and it is *never* True. So definitely only plan on eating here--even for takeout--when you have a little time to kill.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tgkjSWCcWXAAk2DScYmQrg"
  },
  "xbe_-wc_4zvjVTzmtBsjKA": {
    "date": "6/21/2015",
    "text": "So I never go here... On account of I've NEVER had a good experience here... But my dad really wanted their  calzone and it was fathers day... So of course I went and got it for him along with an order for my family.  They said 40 min but it took them an hour and 15 min. When the woman handed the stacked boxes to me they weren't in a bag or anything. So as I carried them out to my car all the grease from the food dripped out and now I have a BURN on my arm...And to top it off... Despite my efforts of laying a towel down... My car had a nice big pool of grease on my passenger seat... I didn't call to complain because I already know they won't do anything for me.... You can go here if you want crapy over priced food with a long wait. The people who rave about this place are obviously delusional.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AafuYOGc5e2QvnvbILHExA"
  },
  "wx1Un3xAAq81pmyFSmhTTw": {
    "date": "12/12/2015",
    "text": "My Best Friend & I had Dinner tonight,We only had to wait 30 minutes, not bad. I had the Stuffed Shrimp, and my Best Friend had the Veal Parm, we both agreed that Dinner was worth the 30 minutes +. Oh did I mention the Desert Tray!!!! Yep I got mine to go!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VGhRYEV6LKslckRm3IDRVg"
  },
  "6gm-7Ok2MnB2wVe5fVbSiQ": {
    "date": "11/28/2015",
    "text": "My wife and I love this place .. It's our favorite all around place to go . The chicken Alfredo and chicken parm are the best $ can buy no other place can't compare at all . They get their deserts from signature deserts which is a local bakery .. The carrot cake is unreal",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9f9gH-w2g_Hau7z0bEbLw"
  },
  "jMtrgyswpostqfA40tK-uw": {
    "date": "8/20/2016",
    "text": "We've been going to Pasta Too since they were in the small building that is now a laundromat across from the Tennyson Lounge.  While we are not \"regulars\" who know staff by name, we probably average 8 or 10 visits per year.   The food is great.  They are one of my favorite places to go for pasta and the pizza is pretty good as well.  It seems though that in the past few to years all of the old staff have been replaced and the service seems to have gone down a notch.  The addition of the take out counter, while it is great for the bottom line, slows down the kitchen so the dine in customers are now waiting longer for their food.  We stopped in a few Saturdays back and waited about 35 mins for a table which was a surprise as my wife and I figured the wait would be closer to an hour or more.  It took another 90 minutes for dinner once we were seated (about 65 for the food and 25 for us to eat our meals and pay).  So a meal at Pasta Too took 2 hours from start to finish.  I blame this on the take out counter orders taking priority just like the drive through food is at McDonald's.  I think it's time to find a larger location and expand the kitchen to enable dine in customers to eat in a reasonable time as we're not going to be stopping in very often knowing it will be a 2 hour meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqVeWiBMfOcvjH41f8X-Rg"
  },
  "lEo0NrjNShEseQP0Xg6U2A": {
    "date": "9/28/2017",
    "text": "We hired Pasta Too to cater my daughter's wedding picnic and we couldn't have been more impressed with the service and food, right from the very beginning.  I originally talked with the owner Ray and he helped me choose the best options for our picnic, giving advice and walking me through the choices and prices and made the process very easy and smooth.  Ray was always very accessible and called me right back, which is quite impressive with how extremely  busy Pasta Too always is.  The day of our picnic Sandy came out, set everything up and was very friendly and helpful.  The food was served on time, very hot and fresh and everyone commented on how delicious everything was. Everything was so good!   There was more than enough food and the presentation looked great as well.  We could not have been happier.  Thank you Pasta Too, Ray and Sandy for catering our special day and making it all so smooth and effortless - just perfect!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CyaPpN2F0w2rFmZz66-zOg"
  },
  "zhDR8E-yzKUn8P2yGWdoxw": {
    "date": "9/18/2014",
    "text": "I have to be honest, I did not enjoy Pasta Too as much as I thought I would. The wait was ridiculous. Yes, it was a Friday night, and yes, most places are busy but there just seemed to be wall to wall people waiting for tables. My party was waiting for me to come to the restaurant, so although they were already waiting for 20 minutes, the hostess would not sit their party until all members are present at the restaurant. My family ended up waiting 30-40 minutes for a wait that would have been 20 minutes had I been present to complete the party to be seated. We were about to walk out because we were barely being acknowledged as we waited, wondering if they forgot about us and time and time again, others were being taken before us. The interior is spacious, yet tight. You better be ready to play \"how do I get to the bathroom/exit the quickest\" game while in there as you dodge tables, waiters, and customers in the tight set up. The food was good and the servings were huge. I ordered the eggplant parmesean, which was amazing. I tried my mom's chicken parmesean and it had nothing on my eggplant dish! I also ordered the raspberry dessert, and while it looked pretty and pink, it tasted like a moist, whipped raspberry dessert. It wasn't my favorite of desserts and I would not order it again. The server will come out with plastic samples of their desserts for you to make your selection, which helps the customer to physically see what their dessert will look like! Overall, the food was good, the restaurant was decent on the inside, but it does not go down as a favorite in my book! Cool customer freebie: look for the different colored Pasta Too key chains on the table on the left as you leave! They definitely represent a small, yet tangible token of customer appreciation.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "13URNpJQPWwXehKYaEvLkA"
  },
  "GOw-fnsDPXrOihti-X5t6g": {
    "date": "7/18/2015",
    "text": "Absolutely love this place! The food and service was fabulous! I ordered Shrimp Scampi and my husband ordered the Casserole  we had Tiramisu for dessert...awesome! Wait time was not bad for 6pm on a Saturday. We will definitely be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vDD6UAxDoQh_SYEc2cFODA"
  },
  "IrTEcncRu4CPH-mKxFHNoA": {
    "date": "9/5/2016",
    "text": "Living nearby, I have eaten here many times over the years.  The food and service is always excellent.  I really enjoy their grilled chicken salad, no other restaurant comes close, very very good!  Also their fish sandwich is one of the best, done either way (fried or sauteed).   I would advise going there during off peak times, no food is worth waiting 2 hours for.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "luLGWJXWaG8HZg-mBYWVSw"
  },
  "4p6SaEvS0Oq1MZ0INcif0w": {
    "date": "8/19/2015",
    "text": "While the food was outstanding, the hostess was so rude that it definitely diminished the whole dining experience. We had a table of six, (which can't be seated until everyone is there) everyone ordered something different and all really liked what they got. The waitress certainly tried to make up for the hostess after having observed for herself how rude she was. Food alone was a 5 Star but couldn't rate the overall experience that high. Next time, I will try take out!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_mxxVh86cpwqhkw20CGlJQ"
  },
  "h-GATl6xDfEBa6ukgNjg_A": {
    "date": "2/5/2013",
    "text": "Worth the wait!  The wait seems to be one of the biggest complaints that patrons have, but if you go expecting to wait it really isn't that bad.  The wait is honestly a result of how popular and busy the restaurant is; not because they are understaffed or poorly managed.  In order to avoid the wait, my wife and I regularly order takeout and go pick it up.    By far, our favorite item on he menu is the grilled chicken salad.  It is definitely a \"Pittsburgh\" salad with fries, cheese and hard boiled eggs.  It come with garlic bread and their homemade ranch dressing is amazing.  When we order takeout, we usually get one salad to split and it is plenty of food for the two of us.  We also love the pasta; our favorites are the chicken parm, the baked ziti and the rigatoni.  Their sauce is not fancy, nor is it a chunky sauce with lots of fresh veggies, instead it is a smooth, no frills sauce that is simple yet amazing.  For those of us who have lived in Bethel Park for most of our lives, Pasta Too is a staple.  It was awesome when it was a tiny restaurant up the street with maybe 10 tables and it is great now in the newer, bigger location.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fZs7Jkmny7BRhMnDow0UAQ"
  },
  "2VHoIM6T56dAd2nFDEUexA": {
    "date": "3/16/2015",
    "text": "Absolute most favorite place! Get there early/ or later as opposed to the busy typical dining times. However it is worth the wait. The portion sizes are excellent. Blows Olive Garden out of the water (wouldn't even be a close comparison). The food is fresh. I frequent the place often and have never had an issue with my food. The portion sizes are definitely reasonable to the prices.. However if you have a small appetite, consider \"splitting\" or know you will have some for lunch the next day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BBciXxkAPfarjIjJ6M2Wig"
  },
  "PYxNYMUuT09wLmywxmYKvg": {
    "date": "12/16/2011",
    "text": "I don't really understand why people flock to this place.  Perhaps it's b/c it's in the middle of suburbia and it's a rarity to find non-chain restaurants out this way.  But so many people rave about this place that it leaves me so confused.   I've been here a couple of times and have never been impressed.  The pizza - blah - the sauce is way to sweet and unless you're starving it won't taste good.  Even when you're starving you know in your head that this isn't as good as it gets.    Honestly, I'd rather head over to Olive Garden then go to Pasta Too.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NnrCwpS1i5mZtkGGzmIk0g"
  },
  "Jt1-1yOiaJA3gTfVCQEM3g": {
    "date": "12/7/2012",
    "text": "So we picked up dinner... Turkey Devonshire was AWEAOME. Turkey is tasty and tender, bacon crisp and real and the sauce rich and yummy.  Provolone sticks were very good - nice balance of cheese and coating...  Clam chowder was very good - again!  My only quibble is with the que for takeout - got to be a better way to get hot orders to customers - ours was warm and needed a bit of help from the microwave...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GcYao8ugtrbLESgajrwNRA"
  },
  "S9InG2AnCL94x0pWu6Vy-w": {
    "date": "10/7/2013",
    "text": "To echo what the other lower raters gave this place - I don't know why people come here.  I ate here for the first time Saturday night.  I was not impressed.  I watched the servers grab the bread WITH THEIR BARE HANDS!! and place it in a basket for their tables.  Ew.    Our waitress never told us of the specials.  Apparently, there is a board in the lobby/waiting area displaying the specials but there were so many people waiting for a table, I never saw it until we were walking out.  Still, the waitress should have mentioned them.  I heard other servers tell their tables of the specials, but our waitress didn't tell us OR her other tables.  She also brought me the wrong soup. which she did correct right away.  I watched her bring the wrong drink to another table, too.  Oh and about that soup - it was cream of cauliflower which was so thick, I had to add water to it from my water glass.  This had to be straight from a can.  No way this was homemade.  The red sauce was not that good.  My manicotti was supposed to be baked, it was not.  Probably microwaved.  The portions are large and the prices are low, but I'd rather pay a few bucks more to have an outstanding meal.  Just overall a big disappointment.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ddHya_d8ro93Rz4M7wxthg"
  },
  "sXzsPooTxSbm042QqcVGHg": {
    "date": "11/24/2014",
    "text": "If you havent eaten at Pasta Too you need to! Just tried it for the first time and it was fantastic. I got a sausage calzone, which was only a \"regular\" size...it filled two plates!!! See pic i posted for that. The sauce is delicious and there is cheese for days! The italian sausage inside is spicy and has excellent flavor. My girlfriend got the chicken parm, which is two massive deep fried breasts, not just an average size single breast you get at most restaurants. Everything comes in massive portions, so come hungry! I now have lunch for tomorrow as well haha.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rg3HJlahGGmsuGEwfZw81Q"
  },
  "wj5NcUglrKPrUUOOtdlCWg": {
    "date": "7/3/2014",
    "text": "Generous portions and the food is very tasty. I recommend the linguini with white clam sauce or chicken or eggplant Parmesan but have never been disappointed with their food. It does get very busy for dinner and the waiting time can be long because of a small dining room so I often get take out to avoid the long wait. Definitively my favorite place for Italian in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XWEbLpANMuEajGXWZ3_CEQ"
  },
  "lW8AM-wtw_S-fSWRaUHSBg": {
    "date": "5/14/2012",
    "text": "They have some items that are good, some that are OK. The menu is your basic Americanized Italian restaurant.   I frequently find the pasta to be over cooked which is a shame when italian places can't get that right.  I will give them a big thumbs up for their breadsticks.    Overall the place might be a 4 star place if it wasnt for its reputation which is stellar.  I just dont think the quality of the food matches a restaurant that people rave about.    Also, as a result of the reputation the wait, especially on weekends, can be quite long.  They do not take reservations (and I dont think they do call ahead seating either), so expect to wait.   The decor is OK.  It is an improvement over their old location though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NfoAmvEZ3NVTAtOEshCvwQ"
  },
  "Uh_uM8-A5B_5-s3bnso9DQ": {
    "date": "4/29/2016",
    "text": "Have been there a few times, food is adequate, certainly nothing special, but decent. Very disappointed with my recent dinner, had a bowl of soup which obviously came out of a can, and thought a traditional Antipasto would be a good compliment. Big mistake... It is a messy salad of bag lettuce, with few traditional antipasto elements in it, just a mess....Even canned black olives.   Service was spotty, saw a couple of the waitresses working really hard.... Mine wasn't one of them.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rHVnrwPzTvn0uDtDIbtkIw"
  },
  "d-o7qC54hEfyXj8opZ133Q": {
    "date": "10/21/2016",
    "text": "This is a great place to get some yummy Italian food on the South Hills! My only complaint is the excessively long wait for a table which I have experienced on numerous occasions even during the week! We are talking over and hour wait sometimes and they aren't always accurate with their estimation of how long it will be either. It is small inside but even when we have waited for over any hour and they finally seat us, there is always open tables! The wait is worth it as king as you are not too hungry!   Anyway, as far as the food goes, come hungry because the portions are LARGE! I can eat 3 times from one meal here and my husband and I can often share one meal! The eggplant Parmesan is my fave and my husband loves the chicken parm. Every meal is served with bread and dipping oil which is very good. Their wedding soup is good and I would recommend it to anyone who likes it. Desserts are also to die for. My fave isn't chocolate mouse which was heavenly!   I also highly recommend getting take out from here which is ready pretty quick.   I'll keep coming back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-z-4crJE2U4hcnkD_UoYhQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Dipping oil",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-z-4crJE2U4hcnkD_UoYhQ/o.jpg"
      },
      {
        "img_id": "x6c7_v8jIBMdkh7k0inFKA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Eggplant parm",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/x6c7_v8jIBMdkh7k0inFKA/o.jpg"
      },
      {
        "img_id": "xWaNI_FvoSbzIM1pSKigtw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Side of penne with vodka sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xWaNI_FvoSbzIM1pSKigtw/o.jpg"
      }
    ],
    "user_id": "mm9WYrFhiNqvHCyhQKw3Mg"
  },
  "f3vn8VMHuJ27YWub6Dve6Q": {
    "date": "5/8/2019",
    "text": "Decent Italian food. I enjoy the manicotti, chicken salad, pizza, and pasta with vodka sauce. The manicotti needs more flavoring in the ricotta but that's just my opinion. Being Italian I know what my relative put in their ricotta, this place doesn't have anything in it but ricotta. The overall quality of the food is quite good however the menu is overpriced and everything has deli cuts of provolone cheese on it which is not impressive. I love cheese more than I love a lot of things, but I have to ask for no cheese on items because it's overwhelmingly consumed with deli cuts of provolone. Not my style. You shouldn't have to entice people to eat your meals by smothering it in that. Let the flavors speak for themselves. Customer service is very good for as young as the waiters and waitresses are I've noticed, its very impressive. The manager must be doing a great job.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qZI5i7g_lpFT8SOiuvq4RQ"
  },
  "YWikW_gDsn7fVl3wrkv6Gg": {
    "date": "11/26/2017",
    "text": "I LOVE Pasta Too!! I have yet to find another restaurant that makes fettuccine alfredo as good as they do. It is to die for! There red sauce is also good and can be found in local Giant Eagle grocery stores or right in there lobby. Yummy! Downfall? There seating is not proportional to the demand that walks in. To add, there table turn time seems low and not as quick as other places. They don't take reservations so you may need to come during off peak times or just wait. It is worth the wait though. If only I had more patience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T_mcCDS5mfVfGkYX799aBw"
  },
  "xKogHlRvYuUv9iQFaGRYfA": {
    "date": "11/27/2016",
    "text": "I used to really like Pasta Too but over the years it's just lost it's appeal to me. Now I usually only go when my sister is in town.   The portions are huge and the food is typical American Italian food. You can definitely share a meal between two people. I typically get a small salad, a side of meatballs and sample a little of every ones meal. I love their Italian salad and a small salad is too much for me to eat as a meal. The meatballs this time were a little salty and mushy.   The lobster Mac and cheese is really good. Lots of chunks of lobster! The chicken parmigiana is huge!   We only had a 20 minute wait this visit but have waited over an hour on more then one occasion.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L65h_UHKrlFv11xGZsMzeQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Small Italian salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L65h_UHKrlFv11xGZsMzeQ/o.jpg"
      },
      {
        "img_id": "TUrBfeWt83HdP-BeRFkiqg",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Chicken Parm",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TUrBfeWt83HdP-BeRFkiqg/o.jpg"
      },
      {
        "img_id": "vHUhkfZze8Ov5yExE2fQ5A",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Lobster Mac and cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vHUhkfZze8Ov5yExE2fQ5A/o.jpg"
      }
    ],
    "user_id": "WgEKUJoh5msZlOlTCKnKtg"
  },
  "3efGwaEDGzdQ6drUIVXtmg": {
    "date": "10/2/2017",
    "text": "We've driven by this restaurant dozens of times and always saw it looking pretty full, so we took it as a good sign to visit! Finally after living a few minutes away for a year and a half, we made the trip :)  We got there relatively early for dinner (5:30pm on a Tuesday), so we were seated right away at a table for two. It was already pretty busy when we got there, with many tables filled and several larger parties waiting. Our waitress brought over oil and bread and took our drink/appetizer orders very quickly! The oil and bread combo was already amazing, but we couldn't resist the allure of the stuffed breadstick on the menu! We ordered one serving of the breadstick, Chicken Romano, and Manicotti. The breadstick was really tasty, fried and filled with cheese and spinach. It was also pretty heavy, so with that and the bread/oil, we were feeling full by the time our main dishes arrived! We still wanted to save room for dessert, so we each ate a bit of the main dishes (they were huge) and asked for boxes to go. The chicken was well done and the serving included 3 big pieces. The salad and pasta w/ sauce that came with it was good as well. The Manicotti was very very cheesy and tasty, but also quite heavy, so I was not able to eat much of it there.   For dessert, we got an eruption cake (raspberry mousse & vanilla cake I believe) and a scoop of Spumoni ice cream. The cake was light and delicious, and the ice cream was really refreshing and creamy. The two biscotti to go with the ice cream was also really nice! Unfortunately, we found a hair in the ice cream halfway through, but the waitress took care of everything for us and was very kind and apologetic. We definitely understood that things like that can happen and appreciated how nicely she dealt with the situation!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZqBa_m0006SWbvF-ExC2CA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Stuffed breadstick :)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZqBa_m0006SWbvF-ExC2CA/o.jpg"
      },
      {
        "img_id": "8b5GiUXkaITtY5kKL4X9jQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Manicotti - super cheesy and super huge",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8b5GiUXkaITtY5kKL4X9jQ/o.jpg"
      },
      {
        "img_id": "NXuKOgYf_YX14f_RZu1oEw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Dessert!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NXuKOgYf_YX14f_RZu1oEw/o.jpg"
      }
    ],
    "user_id": "MoFYvOoufOMyVTmUFAhRxQ"
  },
  "8q2W3FoW3c7CmfeAuZzVsg": {
    "date": "12/22/2018",
    "text": "I was very disappointed with my past 2 visits to this restaurant which actually occurred in the same week.   My first visit was with my husband for an early dinner on a weekday. We were seated quickly and then had a lengthy wait to have a waitress come to the table. When she did, she was pleasant but we never received any bread with our meals and it seemed to take forever to get our food. The food was okay, but not fantastic. My second visit was with a friend for our annual Christmas lunch. It was her choice to meet at Pasta Too. We met around noon and it was not busy and we were seated quickly. We waited for over 30 minutes with no waitress and finally my friend went to the hostess to see if someone was going to wait on us. When the waitress did arrive, she seemed aggravated that she had to wait on us, but did apologize. We did get prompt service after we finally had someone wait on us, but again, the waitress seemed aggravated the whole time and it was a bit uncomfortable. I had not been to this restaurant for several years and returned recently to give it another chance.  I was greatly disappointed. I will think twice before returning due to the service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w4bjyjrmUqFT56rwPJ4Hgw"
  },
  "gxk3YbflTxTzEdkt6-FnAA": {
    "date": "3/15/2019",
    "text": "The food is decent but not even close to worth the price. They nickel and dime you for everything. They charge $2.99 just to get sauce on your pasta or chicken. That is such a small amount of sauce that they should be ashamed for charging people that much. The takeout menu says you can substitute oil for butter which is free with the bread but then they charge $1.00 for each olive oil when you order takeout! That's predatory and not specified. Service is so-so. I used to love this place but I'm done with them.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6gPLzIXjVP_YpwqjQ3FdlQ"
  },
  "S9H0RziVuxG6KqAjqYNN_Q": {
    "date": "8/27/2017",
    "text": "This is my favorite Italian restaurant. I love everything about this place. The service is always great, we typically ask for Jamie C. if she is working. She knows us and what we like. They have the BEST oil for your bread. There is nothing like it! I wish they bottled it and sold it in stores! I could just go there for that! Their portions are huge and never disappointing. I enjoy the lobster Mac and cheese and crab bisque the best. But I have tried to many things here that I honestly can say nothing is bad. Their linguine and clam sauce is so good, light but yet very flavorful. Their desserts are also very yummy. They always have so many options to pick from it's hard to just get one. I really like their peanut butter pie! I love this place and it is a must go for you and your family!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GR74JUMpXtexfANvDTgB3g",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Lobster Mac and cheese! So creamy and huge chunks of lobster throughout!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GR74JUMpXtexfANvDTgB3g/o.jpg"
      }
    ],
    "user_id": "bWh--f2MeDNbxP6enbaHuA"
  },
  "aZbmwbuT0s1S_m4r91Kx0w": {
    "date": "11/11/2017",
    "text": "Soooooo good!   The only thing I didn't like about the restaurant was the wait time...  but it was worth the wait!  Yummy food, great service, great atmosphere!   Portions are very large, so be ready to eat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c87O1yo814QIPs-OYkMFAQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/c87O1yo814QIPs-OYkMFAQ/o.jpg"
      },
      {
        "img_id": "TMXT8CKplrji7wdwm0Z9XQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Wedding soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TMXT8CKplrji7wdwm0Z9XQ/o.jpg"
      },
      {
        "img_id": "DTADw7qTHD03UrySAFDSkg",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Oil for bread",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DTADw7qTHD03UrySAFDSkg/o.jpg"
      }
    ],
    "user_id": "ueY3vHSY0qqKtIHjmjnvmA"
  },
  "r0FzLpOMWEzu495jWVfymA": {
    "date": "12/23/2018",
    "text": "I cannot even begin to express my frustration with the to-go ordering I just experienced. I called and placed my order at 1:10 and requested a 2:30 pickup. Never once did the woman taking my order suggest coming in early due to heavy call in orders. I arrived at 2:30 for my order to see an entire lobby filled with people waiting to pickup/make to-go orders. I waited in line over 55 minutes even with my requested pickup time. Upon checkout I asked if they were making any accommodations for the wait which was replied with no I'm sorry everyone is frustrated. We have been loyal customers of Pasta Too and order to-go at least 20 times and never have I experienced such horrible customer service. The food's good unfortunately the service is not.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JcFYGbGtBHqdiU7CU48E1A"
  },
  "GitIKuLZUckgjT0JVumuwQ": {
    "date": "7/22/2018",
    "text": "Some of the best Italian food around however their waiting process is asinine. They don't accept reservations, fine. But it's 2018. Allow call ahead seating or implement the NoWait app like virtually every other restaurant. Why cram everyone in to that small space to wait instead of just being able to call and get on the same list or reserve a spot on an app?   I would come here 3 or 4 times more per month if I wasn't so discouraged by the inefficiencies.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3wxhn9TlgPnNdqvK86hjog"
  },
  "qG72LalT7nbh_emAtNRW0g": {
    "date": "4/10/2019",
    "text": "The food is absolutely amazing!!! Love that they are selling their sauce in stores now. Take out is service is prompt and helpful. They always get your order right. Great place to eat!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v1KMqsYk_xFTQneUEuTyjw"
  },
  "xoqeaRT5Ec93Ze9P1Omgag": {
    "date": "7/31/2018",
    "text": "Pasta Too is hands down my favorite restaurant. We make it a point to go for every family member's birthday just because we all love it so much. The portions are unreal, the servers are always so pleasant and not to mention the food is just delicious. We went today for my brother's birthday and we couldn't have asked for a better experience. The only downside that pasta too has is the rule where you can't make reservations!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Du3PE6QHVKnRXeCPl65ZPw"
  },
  "I0zJ19QHNASO0kuSfY6wHA": {
    "date": "2/16/2018",
    "text": "This is the best Italian I have had at a restaurant, & my go to in the Pittsburgh area!  Portions are huge, one entree could easily be shared.  Prices are very reasonable, even more so due to portion size.  I have had the stuffed mushrooms, calamari, fettuccine alfredo, & chicken parm, highly recommend any of them!  Dessert options are different than the chain offerings, and again, huge portions!  This place is always packed, always a short wait.  Nice atmosphere, good for a date or business meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AjHY16sAzY8khEhQjGOcIA"
  },
  "TKmuNbVIgWdcQ6ktw2N13Q": {
    "date": "6/25/2017",
    "text": "Pasta Too is one of my absolute favorite places in this city. We found ourselves here on Friday night while we were out running errands and starving. It wasn't packed for a Friday night, but I'm sure the cruddy weather played a huge part in that because it is usually packed with a long wait.   Our server was great!  She gave us time to study the menu while our zucchini appetizer (yum!) was cooking. We decided on a 4 cut pepperoni pizza (stepson), penne a la vodka with chicken (me)  and a lobster sauce linguini (hubby). Everything was HUGE!  I seriously only took 10 bites of my dinner and was stuffed and hadn't made a dent in my dish at all! My husband's dinner came with a large portion of lobster meat in the pasta AND a lobster tail.   We opted to have the majority of our food boxed to go because we couldn't finish it, but of course the fellas got dessert. They ordered a massive piece of Oreo cheesecake and shared it. They couldn't finish it, but put an impressive dent in it.   On top of the service being fantastic, our food being delicious and the biggest portions I've ever seen, a nice cold Stella to wash it all down and a dessert to push the boys over the edge... Our total bill was $73! For everything we got, we were beyond pleased with that!    We will be back. Hopefully sooner than later because we love it here, yet don't get that way very often. Great job, Pasta Too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-_pfraODjG1xSLdNglkMaw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Angel hair pasta with lobster in a lobster sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-_pfraODjG1xSLdNglkMaw/o.jpg"
      },
      {
        "img_id": "AqEE7WxAG9_hnlz2TmOUNQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Penne a la vodka with chicken..... Amazing!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AqEE7WxAG9_hnlz2TmOUNQ/o.jpg"
      }
    ],
    "user_id": "_O5ajREINPG9zeyhW5Dmqg"
  },
  "qLw--OiPzzm03pHau2tGLg": {
    "date": "1/31/2018",
    "text": "Is this restaurant proof that there is, in fact, a God? Is this actually Heaven? Well...no. It's a close call, but the fact that there is no call ahead seating or reservations along with the massive amount of people who have to stand in the lobby for hours proved that while there's a Heaven, there's also a Hell. I view the waiting time as Purgatory. You earn your way out of it with time. A LOT of time.  As much as the waiting and lack of reservations drives me nuts, I still feel that the need to give it four stars shows just how amazing the food is here. It is truly heavenly. I first went to Pasta Too ten years ago and ordered the lasagna and wedding soup. I've been there several time since then and I can't order anything else. It's a party in your mouth. I have tried many other dishes (that other people have ordered) and there is pretty much no way to go wrong with their menu.   The wine list is decent and they also sell their sauce  to go. (The sauce is on the expensive side and will cost you $6.99 per jar.) They also sell some other unique Italian foods and Sarris candy.   Some words of wisdom: Don't go here if you're on a tight schedule. You WILL miss whatever you were planning on doing next. Also, come hungry! The portions are enormous and you will more than likely leave with leftovers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dNClm7Zks4LCwkqyBh4pIQ"
  },
  "ZshN-75IefMy0pd6x96_Pw": {
    "date": "6/17/2018",
    "text": "Still my favorite place to visit when we are in Pittsburgh. The long wait for a big table is something we just accept since Pasta Too is really popular. It's worth it though. I LOVE LOVE LOVE the manicotti. Servers are attentive and you really can't go wrong with ordering. Everything I've ever tried it great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dZjAjpEdIoFQMVakp7o1wA"
  },
  "WvrMxSOYoSj3mPyXnr1Kmw": {
    "date": "12/11/2017",
    "text": "Pasta paradise with tons of Italian flare with togo foods and condiments. The service is excellent and friendly. The food is some of the better Italiano cuisine I've had in the Pgh area. Clean restaurant with lots of Italian decor to make you feel you're in little Italy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r5iu6xjD9UEwSlAIiTmaNQ"
  },
  "4hAYQf7PzLZygzHKEj9b7g": {
    "date": "12/24/2018",
    "text": "I attempted to dine here most recently on 22 December 2018 only to be told that the wait was 45 to 60 minutes, not something I could endure, particularly with a hungry young boy in my party.  One must be prepared to waste a lot of time if they wish to dine here on a weekend night.  It is a shame that the restaurant does not accept reservations or phone-ahead seating.  My party and I settled for second-best, dining elsewhere: most disappointing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1jXmA4__4UWIplZk6MJMQ"
  },
  "MdwnB76fXRZtWlSf4cMlIg": {
    "date": "9/16/2017",
    "text": "I realize this is a staple in the South Hills, but I'm not a fan. We took a party of about 8 here for our first visit, most of which were from out of state visiting us. We were seated quickly considering how busy they were. We receive our various pasta dishes very quickly. Nothing was outright bad, but nothing was really very good. Everything seemed to lack flavor or tasted pre packaged. The sauce was very soupy and everything seemed like it needed seasoned. The portions, however, are huge and the prices are extremely affordable so I understand how they keep such a busy stream of patrons. Our service was great for a busy time, but I don't think I'll return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "nDnrQ1BFe6ZgBBXSte5MVA"
  },
  "kAuhsTR9XGgWk1cAqIiS2w": {
    "date": "6/16/2019",
    "text": "Excellent food and the prices are good. Very busy on a Friday night. It would be nice if they had call ahead seating since they don't take reservations.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yHJXnTaxTG1s7isHvOP8CQ"
  },
  "hfA94We5MQMxHZQ3JHkYgQ": {
    "date": "5/8/2019",
    "text": "This place has great food. The service is always good. On weekends this place has a long wait <a href=\"/redir?url=http%3A%2F%2Fto.be&s=5776409badfe2d990c53b9366f6a0f058752a0116ce349587452d0874a7d638f\" target=\"_blank\" rel=\"nofollow\">to.be</a> seated. Prices a very good for the amount of food. We have been there many times.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1TDDxi1iPp9_-elYlcVO2w"
  },
  "NHg4i165NuJm9gFFMNjrZg": {
    "date": "12/5/2018",
    "text": "Oh, Pasta Too. This place is beloved and always has a wait on Fridays and Saturdays. Their garlic bread is insanely good and served with a side of seasoned oil. All of their portions are huge too. Expect your meal to stretch out into lunch and dinner the next day. Favorites are their vodka sauce, fettuccine Alfredo, spaghetti aglio e oglio, and cannolis.   Only downside is the richness of their food. This is Italian American food on steroids. Every time I come here, my tastebuds say yes but my stomach says no. Worth it though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "PijH9-8p1mjgaPg1SONUmw"
  },
  "W_x1CL_IA9n9npSsSajsfg": {
    "date": "6/2/2019",
    "text": "If i could give zero stars I would!!!!!!!! First off, I have never been here. Heard good things. So after driving 17 hours to come visit pa. We choose to go here for a \"good\" meal. We get there put our name on the list are told no more than 30 mins. After 45, we ask how much longer the wait, they say they gave our table to someone who claimed to be us with 2 additional to the party. Ok fine, so you are gonna seat us then since you just let some some one claim our table right? They then sit us. At this point my son is extremely hungry. We quickly order appetizers and our food. After 20 mins other tables around us were seated. 1 hr after being seated we still do not have our food. By the way we ordered a small kids pizza and 2 pasta dinners. Now the other table who were seated 20-30 mins after us were already feed and eating. At this point I had spoke to our waitress who repeatedly told us our food was coming, the \"manager\" said our food was on the way. And then another table was given their food. At this point I was upset, with a child who finally received his SCOLDING -WAY TO HOT(because it was rushed at this point through cooking and to our table) to eat pizza and still no meals for me or my sister. And once again told your food was coming. I then said to box our food. Waited longer, and then asked for a box for my sons still scolding hot pizza and said I no longer wanted my food. When brought a box then manager told me to not be upset and to calm down over it. I then pointed out that literally every table around us, who were seated well after us were served and eating and I was still waiting for food. He then proceeded to tell me to be quite and stop. To which I told him no and if this is how they treat people and children that is ridiculous and why should my child and I be hungry, when my 6 year old is pointing out \"why does everyone else have food mommy?\" This is one of these most disrespectful, inconsiderate places I have gone to in a long time and I live in the south where racism is alive and at times extremely proud. And yet thank you pasta too, you made the south seem not so bad at times with their blatant disrespect. Never again will I try this place. And I will be sure to let all my family and friends know the disrespect myself, my son and my sister received.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A9rhswLviCJoDR56UtgNKg"
  },
  "rHHjqdoAKSb6U5c7rXhjrw": {
    "date": "5/18/2018",
    "text": "Been to Pasta Too twice... It is a nice place and is close to a 4 rating but a few things keep them there.. I'm not a fan of sweet tomato sauce, I like more savory salty sauces So that's one strike for me.. Also they have no steak dinner on the entire menu, so basically your only options are pasta or a salad.. (you can add steak on your salad) I chose salad because I don't like sweet sauce.. The pre dinner oil is ok.. People seem to love it, and my Caesar salad had good grilled chicken on it with fresh romaine hearts",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OEvFBqkrkXtxlLbxmt-DTw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Chicken Parmigiana",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OEvFBqkrkXtxlLbxmt-DTw/o.jpg"
      },
      {
        "img_id": "chZtM8dfvffGRgz-olEDBQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/chZtM8dfvffGRgz-olEDBQ/o.jpg"
      },
      {
        "img_id": "h3-WpSCJLJvcxbsZtSjsfw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Caesar Salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/h3-WpSCJLJvcxbsZtSjsfw/o.jpg"
      }
    ],
    "user_id": "exrXZ2hjraSC6QV2PWaBAw"
  },
  "C-PGOZDaAHVwtU7XmV8nWw": {
    "date": "10/22/2017",
    "text": "My first visit to Pasta Too was on a Saturday night at 7pm and there was an hour wait. They don't take reservations. Once we got our table, we were greeted by our server right away. She kept apologizing for the wait, saying 2 servers called off. I never would have known they were short staffed because the service was amazing. She always had our glasses full, which is major bonus points for me. I ordered the special, which was stuffed chicken breast topped with a roasted red pepper cream sauce. My husband got the chicken parm. Both of our meals were not only incredible, but the portions were HUGE. We both got 2 chicken breasts each. And we each ordered a cannoli for dessert and neither of us were disappointed. My only regret about Pasta Too, is that I haven't tried it out sooner!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Izeh3jSWQ8bB917nSw_uhg",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Pumpkin and vanilla cannoli",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Izeh3jSWQ8bB917nSw_uhg/o.jpg"
      },
      {
        "img_id": "jsVeaaSAMxXxEVsIlRbIsA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Stuffed chicken breast with roasted red pepper cream sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jsVeaaSAMxXxEVsIlRbIsA/o.jpg"
      }
    ],
    "user_id": "royL3mfw4TOy76BRJDj8qg"
  },
  "ahpgTzWr0sfAPt0WB160Zg": {
    "date": "6/21/2019",
    "text": "Employees Are snobbish unless you are a regular. They have a great business and it seems like they don't value their customers because they know they will always have other customers coming in. Employee's attitude and personality leave A lot to be desired.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xfvokNL7Bcwo0IWrg2jwcQ"
  },
  "nF7pvIhavtQkz-JdKtH1Hw": {
    "date": "3/13/2018",
    "text": "Simply amazing! The best Italian food in and near the burg! Let's start with the oil dipping sauce. I know it's said thou cannot live on bread alone. But they can with this dipping sauce. Next off the wedding  soup. It is a plethora amount of flavors all in one . Now the main course, there was three of us and we each had a different meal  all   excellent .Then they walk around with a desert tray that looks like a traveling bakery so much to choose from . Service was great .food price we great I give it two thumbs up !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oRIG0oCw7G4fqZlVgx7F_g",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oRIG0oCw7G4fqZlVgx7F_g/o.jpg"
      }
    ],
    "user_id": "aFCWJ1PM-5Y0bFyBpiK2bQ"
  },
  "PB-ZVyIR4OwG5ihxXMBIkQ": {
    "date": "7/7/2019",
    "text": "We recently purchased a takeout order from this. restaurant.  The chicken parmigiana was excellent but pricey.  However, we were disappointed by the small Italian salad: it seemed much smaller than before, had no shredded provolone cheese and only 2 olives for the whole salad.  We didn't get any bread with the entrees either.  Apparently, since we ordered a loaf of bread, they decided we didn't need the bread that goes with the entrees.  Our daughter picked up the order and had no way of knowing  what was wrong with it.  We have ordering takeout from Pasta Too for a long time, but now we are not sure we will do so in the future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1TQbMC4AiMRzXS8QckLiIw"
  },
  "lETz_hYaFzzQ7zPfWfFpjg": {
    "date": "1/21/2019",
    "text": "Ordered Shrimp Scampi over angel hair. Awesome! Noodles cooked perfect, lots of butter and garlic. Yum! Just needed salt and parmesan cheese. My boyfriend ordered Crab Cakes with fries. Awesome! Tender, full of crab and also cooked perfectly. All excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zZcnffj3QZoqvcBAyjWBUw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Crab Cakes with fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zZcnffj3QZoqvcBAyjWBUw/o.jpg"
      },
      {
        "img_id": "PrBchye37m88TsWuPK8olg",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Shrimp Scampi over angel hair",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PrBchye37m88TsWuPK8olg/o.jpg"
      }
    ],
    "user_id": "georIglG7ZJ-_QpYaoc0gw"
  },
  "UMiy0rW6GlB_SzTxVldwEg": {
    "date": "5/8/2019",
    "text": "Pasta Too is excellent Italian! I'd recommend their lasagna, manicotti, or veal parmesan. It is always busy so expect to wait (especially on a Friday/Saturday night-weekdays are typically full too!) or call for reservations.   4/5 due to service/food wait time can lag when busy.  Bonus: Delicious fresh bread & oil to dip for the table!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uahIaM_umdzEveHGB2_ZWA"
  },
  "rrvZw5cIiATV8XcSlghpCg": {
    "date": "4/27/2019",
    "text": "Yes, this is definitely \"pasta for too\" -- big portions, always busy and bumping, it is no wonder this place is a south hills favorite. Penne vodka with chicken. That's all I gotta say. That dipping oil... mmm. They warm your bread up which is nice. Carb comas for all!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h7kalhw0ifi9CBT7toKwzg"
  },
  "pM9z5nrpVXQ1DppmKeiFfg": {
    "date": "2/12/2018",
    "text": "What a great meal ! All the good things we have heard about Pasta Too are so True ! From the tomato dipping sauce to the sweet spaghetti sauce. The Turkey Devonshire was great love the cheese sauce ! I highly recommend and will definitely return again and again !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "3egcdazws_x1wW35jgXfNw"
  },
  "hvOBhy9ZviSzwAXhqgnhUQ": {
    "date": "4/23/2019",
    "text": "Great Italian restaurant. Great food, service, atmosphere. Not many Italian restaurant I go to eat where I feel the food is made as good or better than I could do. Pasta Too definitely is one of them. The food is good every time and you always have a little bit left to eat the next day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a6_0qBiqLwLDJdGI9HDNfA"
  },
  "DTcY0CRZh7XbzkomejcmfA": {
    "date": "3/13/2018",
    "text": "Let me just say HOLY BREAD AND OIL! I've never had olive oil that delicious!   We were greeted with a really friendly server and staff is to the nines!   We each ordered a dinner but we honestly only could have ordered one! The portion sizes are HUGE!!!!   I had the Alfredo and my friends had chicken parm and penne in a vodka sauce!   FOR DESSERT--- THIN MINT COOKIE CHEESECAKE AND CHOCOLATE CAKE... TOGETHER!!!  This was my first time here and I can't WAIT to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wY6TB9HFz1-5zGmgsuVRYA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wY6TB9HFz1-5zGmgsuVRYA/o.jpg"
      },
      {
        "img_id": "U6jUbf5vmRtyyD4Pd3Qg0A",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U6jUbf5vmRtyyD4Pd3Qg0A/o.jpg"
      },
      {
        "img_id": "DrUIeaLzpFhQlNJdUFTJJw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DrUIeaLzpFhQlNJdUFTJJw/o.jpg"
      }
    ],
    "user_id": "Nr90rsraUqwHdF3EpVTxWA"
  },
  "fJoKL61JlfT2picdbJOpCA": {
    "date": "6/23/2019",
    "text": "Great food. Usually have to wait. It it's worth it. Great for take out and catering too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lw-rMRqhr7MxlnDOtxlHTg"
  },
  "g_1aqTwoW2C82nAl4JxFaw": {
    "date": "5/16/2019",
    "text": "TERRIBLE SERVICE! Our waitress, an older woman named Pam, treated my boyfriend and I as if we were burdens the entire time we were there. My boyfriend decided to take me to a nice place for my birthday dinner, and possibly because we were younger than most of the other patrons (low 20s), she all but ignored us. While we watched her carefully tend to her other tables near us, she touched our table as little as possible. She never made eye contact with us, sneered at my boyfriend with something akin to disgust when he asked a simple question about a menu item, and made sure to take care of anyone but us. As an example, my boyfriend asked for boxes for our leftovers and our waitress told us \"she'd be back in a few minutes.\" We then sat and watched her take another table's order, not offensive at all, right? Then, our neighboring table asked our waitress for their food to be boxed up. She did so immediately. She then brought them their check, cashed it out, thanked them, and they were on their way. We still waited. She then went to the kitchen and delivered the food to the table behind us, well before they had even finished their salads. Finally, she seemed to have remembered with annoyance that we existed and took our food to box it up. It took her about 5 plus minutes to box what was left of our food, again no big deal unless you saw the hustle in which she boxed the food of our neighbors. When she returned with the food and our check, we then sat and stared at her while she stood idle by the server station and my card sat visibly in the holder waiting to be taken. I had to drop my phone loudly on the table to get her to begrudgingly look out way to take our check. We are a relatively easy table, we asked for nothing out of the ordinary, and were as pleasant as we can be. I have no clue what incited this undeserved hatred towards us or why our service was so deliberately poor. Sadly, my only guesses are our younger age demographic or the fact my boyfriend wears a Star of David necklace everyday and maybe that sparked some latent anti-Semitism in her heart. So, thank you Pam for such an unpleasant experience that made us feel like burdens while spending good money for the privilege. At least we know that you're not a bad waitress when you don't want to be because the other tables you had were treated to fine service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JxLduEOIVpez8SFPHIpOBQ"
  },
  "PmDOWOuMxU-c80pqzoU7ow": {
    "date": "6/10/2019",
    "text": "The food isn't bad, it's just not great. I'm not exactly sure why people love it so much, honestly. There's always a long wait, the service is mediocre and it's just okay food. I've never once been impressed by this place. I'd skip it!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BW40U8p1l3VX1HMlpk-q8Q"
  },
  "HlzqS52NeKxcqvJX5sSJ2Q": {
    "date": "12/11/2018",
    "text": "Pasta Too is one of my most favorite Italian Restaurants.  I wish I lived closer to them, as I don't get to go nearly as often as i'd like.  The food is some of the best i've had, especially their Alfredo.  The one thing I wish was that it wasn't so difficult to get in, as they are usually very, very busy and jam packed.  Table turnover is quick, however.  They do a good job of getting things to you fresh, and quickly.  Huge portions, great quality of food, good service.  Can't ask for anything better or more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JtRZJ4lbqH1pqpu0kLyrmg"
  },
  "vXr4cwkSVqtsQwWJXNYEZA": {
    "date": "1/6/2019",
    "text": "If you are a senior citizen that can drink scalding hot coffee without concern this is the place for you. Bland food, over sized to overcompensate, I've yet to try anything remarkable. Lackluster service but at least with an attractive open kitchen things must be kept pretty clean. Beware of the parking lot. It's a terrifying ordeal watching some of the guests navigate in and out",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iEZHFtv4DTAZxUxluMj8yQ"
  },
  "WKcfyQlveCKeerEwPGPQfw": {
    "date": "3/20/2010",
    "text": "restaurant looks nice from outside,but it is very small on the inside. people are packed in like sardines. The baked zita was supposed to be in tomato sauce. It was in marinara sauce with lots of chopped onions and tomatos and the noodles weren't cooked. The service was also very slow. I couldn't wait to leave.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QT9AxJiOHcf0SDO99OwyyQ"
  },
  "8p5Ufzf9YvQ7wOF6ExieYQ": {
    "date": "4/10/2012",
    "text": "another one of my favorite places to eat. they have HUGE portions and each meal will easily give you leftovers for 3 days! yummy pasta, salads, and chicken parm! my mom loves the burgers but i have not tried one yet. yes the waiting area is small but the food is worth it. like a few others have said the pizza isnt the best but explore the menu more and you won't be disappointed. service is awesome as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YzAiaA46aUxxeAwvF98JDg"
  },
  "GozaZJbWjnZFL382ro07ng": {
    "date": "7/31/2011",
    "text": "I'm afraid I agree with the reviews that this restaurant is all about quantity of portions rather the quality. All of the dishes our family ordered lacked any kind of distinctive flavor, but there was a lot of it. Potentially long waits, no reservations, cramped dining room, difficult parking.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hRZgDoSk8f0ME0MOF7cuxQ"
  },
  "XBrb5GvHfN7NXb8ZpOxLCA": {
    "date": "5/17/2013",
    "text": "Everyone I know LOVES Pasta Too. The food is always delicious, the prices are great and the portions are enough to feed for days. When compared to other Italian places like Olive Garden, (which I love, don't get me wrong,) this place is definitely worth the money. Their Alfredo is creamy and deliscious and the dinner portion is enormous. My husband usually orders this and eats it for at least 2 days. I however recommend their ala carte version of the Alfredo, it is not as huge as the dinner portion but still a larger serving than somewhere like Olive Garden.  My favorite dish here has to be the Salmon Rockefeller which is a special and not always on the menu. I love seafood and usually I order tuna or tilapia or other fish if I order fish at a Restaraunt, usually because I am picky with how I like my salmon, being as most Restaraunt salmon unless stated otherwise is farm raised, and while I am ok with that I prefer wild Alaskan or king salmon. However Pasta Too's Salmon Rockefeller is my exception. I love the holland aisle style sauce they serve it atop of, and the bled of seafood stuffing with the spinach, onion an tomatoes is just deliscious. Also a big fan of their housemate Italian dressing and of course their sundried tomato  oil with bread. My husband could feast on the bread and oil alone, he loves it. I know usually whenever I go here, no matter what I order I am going to love it, and I can guarantee a lunch the next day that will make all my co workers jealous.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ik3pu6ypuBcDAhV-gAE7yw"
  },
  "J7hW-TWo255DZqa9JmsKIg": {
    "date": "7/18/2019",
    "text": "Exceptional food.    Very good appetizers. The fried mozzarella sticks, fried zucchini, stuffed peppers and more,  are all fantastic. Our party had the shrimp scampi, chicken Parmesan, linguine Alfredo, and fried shrimp. Portions were all so large that we all had meals the next day.  We will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "938tjYa6jI0gsg1yxm-PNQ"
  },
  "S1w72SAqXRrrTib3eh6CrA": {
    "date": "8/18/2019",
    "text": "Do not eat here. My entire family got sick because our sauce was spoiled. Stomach problems all night long. Our waitress was rude as well.   Better off to go somewhere else",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NX6SrOvDVJpULY9PDZF1xQ"
  },
  "dgWZ49afW_e3wuBOZT80-A": {
    "date": "5/24/2019",
    "text": "This place has some of the best Italian food from pasta and chicken Parmesan to hoagies. Right after being seated you are greeted with bread, butter, and dipping oil (tastes even better with shake cheese).  Everything on the menu is served in gigantic portions, but they aren't compensating for lack of quality. This is high-end food, definitely a step up from Olive Garden without being pretentious. Their menu is also very clear and descriptive for an Italian restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ukqMLCHQJUiuBEX5fYMtiw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Italian Hoagie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ukqMLCHQJUiuBEX5fYMtiw/o.jpg"
      },
      {
        "img_id": "TB49EXOJ3t_Z8Lbr-UUHOA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Italian Hoagie",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TB49EXOJ3t_Z8Lbr-UUHOA/o.jpg"
      }
    ],
    "user_id": "7l0zTMR4_dgw8vKFr1p3qg"
  },
  "6491ruDE2JmvxuL7Z_DuWg": {
    "date": "8/26/2019",
    "text": "Absolutely incredible Italian food! It's no wonder why the restaurant is always packed. Even starting with the fresh bread and olive oil, you know you're in for a treat. The bread is still warm and the olive oil has perfect seasoning that you don't even want the butter provided. I ordered the lasagna,  it was incredibly delicious. One of the best (behind my mom's recipe and a restaurant in Italy) I've ever had. First of all, the slice they give you is the size of a textbook. There are so many layers of flavorful ingredients that perfectly complement each other, you don't want to stop eating. But I highly recommend saving part of your dish for the next day (It heats up great and they give you extra sauce to keep it fresh) because dessert is also delicious. They bring out a plate of different cakes to choose from, basically an impossible task to select only one. We ordered the double chocolate cake and were not disappointed. It was rich in favor, not too heavy, and also a huge slice great for sharing. Highly recommended coming here for a date night or treating your family to fantastic Italian food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZkqAJ_kAtYqgjBBKVeLGAw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Double Chocolate Cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZkqAJ_kAtYqgjBBKVeLGAw/o.jpg"
      },
      {
        "img_id": "xc4Z5E8G-mMZvryZujn_uQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Lasagna",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xc4Z5E8G-mMZvryZujn_uQ/o.jpg"
      }
    ],
    "user_id": "KKblXUNxSGCewpDxiiSRQA"
  },
  "DaXepH-2GSNnqgAfsTV_qw": {
    "date": "8/19/2019",
    "text": "Party of 9 for my birthday.  We had to wait a little while but it was worth it.  Our waitress, Catherine, was FANTASTIC!  She handled our orders perfectly and even brought the cake out and served it to all of us after singing to me.  I felt so special.  She was funny too - which was great with my family.  We'll be back for sure!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5nyRsjVNUwY9odCr-FQV6g",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Zucchini Parmigiana",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5nyRsjVNUwY9odCr-FQV6g/o.jpg"
      },
      {
        "img_id": "bKcqUJZ-qrJgkclYNeLANA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Chicken Cutlet Parmigiana",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bKcqUJZ-qrJgkclYNeLANA/o.jpg"
      },
      {
        "img_id": "zAdtTvi8Slftm0QImGWSWw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. My cake!!! (It was from Bethel Bakery)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zAdtTvi8Slftm0QImGWSWw/o.jpg"
      }
    ],
    "user_id": "VblVPsnCGff5a9MF6HGouQ"
  },
  "Dk1BB0ZWyBl62tqAOQqfCg": {
    "date": "7/12/2019",
    "text": "Got some takeout from here recently. I had the chicken fettuccine alfredo. Unfortunately, once I reheated it, it was so oily. There was really no flavor and the noodles just sat in a pool of oil. Overall, I was unimpressed. The prices are reasonable as the portions are large. Maybe I should try something else next time.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gofnmwo5ptoEnQI47zCBYg"
  },
  "_C6vnb21S9Eay5G5CChjZg": {
    "date": "2/23/2019",
    "text": "My family and I have been coming here ever since I can remember. The food is always incredible and made with love.   Prices are very reasonable, service is great, and you'll definitely leave feeling very full. Almost every meal comes with a choice of a side salad or soup and side pasta! You get endless amounts of fresh Italian bread with dipping oil and butter...yum.  There's one downside: the wait. They do not take reservations, so the wait can get pretty long. Saturday night dinner service, you're looking at a solid 40 minute wait, so be prepared. I will say this though, if you are craving Italian food, the wait is well worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xgeZRBwKME4xyWwek3sPCg",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Fried zucchini",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xgeZRBwKME4xyWwek3sPCg/o.jpg"
      },
      {
        "img_id": "5dlkTMHMyaFGtO_X8a6xpA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Side salad with ranch",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5dlkTMHMyaFGtO_X8a6xpA/o.jpg"
      },
      {
        "img_id": "YMZLZiMYSMiPiT02E0TSDQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Chicken Parmesan",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YMZLZiMYSMiPiT02E0TSDQ/o.jpg"
      }
    ],
    "user_id": "jhm1OR3WVUpk_hBTi4Fh3g"
  },
  "AenpnPUIkR-KhVe_aYc_3A": {
    "date": "6/16/2019",
    "text": "I have been going to Pasta Too for years and it is my favorite restaurant in Bethel Park.  The red sauce is delicious!! I usually get the rigatoni with meatballs and a side salad.  The portions are ridiculously large especially for the price so you always leave with another meal in a to go box.  The area is mostly dominated by chain restaurants so this is a great family owned option in the area.  I would recommend going a little early for dinner on the weekends since the wait can get pretty long.  It's worth it though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "24Y51zeSlZ7ODhAjnuJkUQ"
  },
  "5Sa84K-smLiQTiXw8HsDEw": {
    "date": "8/13/2019",
    "text": "Way overpriced. Pasta sauce tastes like a number 29 can of tomato sauce with no spices. Campbell's soup makes a better sauce.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VWmox-R0b2-RaWxkctlzJw"
  },
  "5Ot388MDCI-uVoxwVA-UZg": {
    "date": "6/2/2019",
    "text": "After years of driving past this place I finally decided to stop in and give it a try after hearing many things about this place. It was around lunch time on a Monday so the wait was not long at all maybe ten minutes. I was surprised at how small the dining area was and the decor felt really outdated in my eyes as Italian spot. I did appreciate the fact that there was real flowers in the table. After being seated the waitress came over and was friendly and brought menus and advised us bread and oil would be out. I was shocked at the large bread portion for the table. The oil not so much as it didn't really have any flavor to it. Me and my guest could not decide on the fried zucchini or the stuffed breadsticks so we got both. The bread sticks where pretty interesting and good I have to say. The crust was awesome and it really reminded me of a more light pepperoni roll. The zucchini on the other hand was terrible it was so soggy and greasy. I asked for a side of horse radish for dipping and sadly it was sour so that didn't help. My guest got a Caesar salad and said it was average and somewhat overly salty. On to the main food course I got the lasagna and the portion was MASSIVE. I was shocked as to how big it was but I guess it's understandable being it's Italian and it's served by its self for almost fifteen bucks if I remember correctly. It was very average and nothing impressive flavor wise. My guest got the chicken parm with a side of pasta. It was pretty large as well easily shareable being two large cuts of chicken. She enjoyed the pasta but the chicken was bland. It goes to say we didn't eat all of our food and had a few bites and called it quits. It's so disappointing to have such a negative experience after all the things I've heard about this place but not all Italian places are equal. It could just been a bad day for the cooks I'm not sure but it left a bad taste in my mouth. Overall I won't be returning here in the future because if I'm looking for Italian food there's other places I rather go to.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KFclc3dpJNMTyArdzO3Xfw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Fried Zucchini",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KFclc3dpJNMTyArdzO3Xfw/o.jpg"
      },
      {
        "img_id": "__HRqJ58GPX_u0XzskMSmg",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Bread for the table",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/__HRqJ58GPX_u0XzskMSmg/o.jpg"
      },
      {
        "img_id": "c9-3veWeEHK-ydkusJpiJw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Chicken parm",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/c9-3veWeEHK-ydkusJpiJw/o.jpg"
      }
    ],
    "user_id": "NQBQj7tHxETHf4PDkAtKUA"
  },
  "lm3nUXoZfA-QAIGqNhka3A": {
    "date": "8/5/2019",
    "text": "Chicken Parm!!  Nobody makes a chix parm Sammy like the deuce!! Been going here for years even back to their old place. Their takeout operation is the best in business. So on point. The employees work their asses off to get you in and out ASAP. Love the meat sauce too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C5VU7MdASGZ7STayuaq3zA"
  },
  "3TYy8f3lgWNOUeQbXK0bNQ": {
    "date": "2/23/2019",
    "text": "I visited Pasta Too on a recent Wednesday night with my wife, figuring that we could grab a quick dinner. After all, how many people eat out on a Wednesday night? The answer is that a lot of the people that eat out in the South Hills all seem to converge on Pasta Too. We were faced with a 40 minute wait to be seated, which ended up being about 20 minutes. Based on other reviews, I'd say if you want to eat at Pasta Too, expect a hefty wait... and if ends up being a short wait, you won. If you wait a long time, then you're even.  The menu consists of typical Pittsburgh Italian staples like pasta, pizza, calzones, and all of your usual appetizer selections. We started with fried mozzarella sticks which were average to below average. The portion was large, but the cheese itself was chewy and the tomato sauce for dipping was too sweet for my taste (if you like sweet tomato sauce, you'll be good). If I go again down the road, I'd try something different.  Being a typical Pittsburgh Italian restaurant, Pasta Too serves you as much Italian bread as you want. This wouldn't be that big of a deal, however the dipping sauce (olive oil, garlic, and maybe some red pepper) is wonderful. It wouldn't be a terrible idea to skip an appetizer altogether and just fill up on bread.  For my entree, I had lasagna. I immediately cut it in half and set that portion aside for lunch the next day. Their lasagna is all right, a heaping helping of meat, sauce, pasta, with a big slice of mozzarella on top. It's not hard to make a better lasagna at home, but theirs is executed well enough. I honestly thought the portion I had for lunch the next day tasted better- maybe the flavors had time to properly meld?  My wife had linguini with clam sauce. I tried it and we both agreed that it was average to slightly above average. Again, there was a huge portion of it which she ended up getting multiple meals out of.  Even though I was full after dinner, I was tempted by dessert. The server will bring out a tray of desserts to show you and tell you about a bunch of other desserts available that aren't shown. Perhaps a dessert menu would be more efficient? In any case, I ordered a huge slice of peanut butter pie with was delicious. The chocolate crust on the outside was particularly tasty. I had a little bit and packed up the rest for the next day. Noticing a theme? I assure you, there was no one we saw that night that was able to finish their meal.  Considering that you will be taking home leftovers, Pasta Too's prices are very reasonable. The service was great. Our waiter, Jacob, was outstanding. He was friendly and stopped by frequently to make sure that we were taken care of. My wife forgot her scarf at the table after dinner, and Jacob ran out of the restaurant to give her the scarf back before we left the parking lot. How often do you experience that kind of service nowadays?  While the food at Pasta Too isn't necessarily the best, if you check your expectations going in (a wait to be seated, friendly service, huge portions of OK food), you should be happy when you walk out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N_FhZ9rW8LaZGxyZo5c2HQ"
  },
  "fxY8PB89-OYN1K5t1ji_7g": {
    "date": "2/11/2019",
    "text": "My husband grew up in Bethel Park and Pasta Too is a family favorite. They always talked about it like it was the best pasta they had ever had, and after I got to try it the first time, I saw why. I don't have a lot of feedback about the staff, although I have always been impressed, because we get it as take out a lot for family dinners. But I will say that you NEED to go into the restaurant expecting a lengthy wait. They are extremely popular, especially for dinner and on the weekend, so I wouldn't arrive starving. I waited for an hour and a half while 8 months pregnant and I was still a happy patron because I knew it was going to happen :) The wait is another reason we like to do takeout.   The house salad is good. Your average restaurant salad, but always very fresh. I LOVE the dipping oil that comes with the bread. I've tried to do it at home or find a similar one at Italian restaurants, but it's just the best.   I always get the eggplant parmesan because it never fails to disappoint. The red sauce at Pasta Too is the perfect level of sweet and the eggplant is always crispy and delicious. No matter what you order, you WILL have leftovers to take home.   If by some miracle you save room for dessert, the portions are even bigger. All of the options are great, but I specifically like the tiramisu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oL8RzMJFgrgahm8Ew2QeMQ"
  },
  "24qSrbeVksIBEnCQOEBWbg": {
    "date": "3/24/2019",
    "text": "We arrived around lunch time and had a wait of about 15-20 minutes to get a table.  The interior of the restaurant had an Italian theme with hand painted murals and colorful flowers.  The seating is a bit tight but not too cramped.   The oil dipping sauce has a nice color. Fair warning the portions here are wonderfully huge. The small calzone can be shared the full portion is huge.  The ala cart portion of pasta was plenty for those in our party. The meatballs like everything else are handmade. Deserts are not made in house but made from a local bakery, and they were all very good. We for sure would come back here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NWO-zy0yxMeGcVNWcKstbQ"
  },
  "MhgAiL0OxW6zl4do2LAtvg": {
    "date": "4/8/2018",
    "text": "Whenever I visit Pittsburgh and have the time in a Sunday the family and I like to go to Pasta Too.  We try to get in line (before 1:00pm) for the first searing.  If you miss that seating you could be waiting a while for a table.  It isn't u usual to come at dinner time and wait for an hour.  People who love this place know and accept this fact.  While waiting in line today (only 10 minutes) several people were coming in to get their take out.  It seems that Sunday is seafood day for their daily specials. The soup is usually crab or shrimp bisque.  The crab bisque is our standard for how we rate other places' crab bisque and well we haven't found better bisque anywhere.    The specials were lobster Mac and cheese, one daughter got this and enjoyed it again (probably had 10 times at least over the years).  Another in our party had the linguini and white clam sauce... another favorite.  We shared the beans and greens appetizer which never disappoints. I had the baked scrod which was very flavorful and well cooked.  We passed on the desserts this visit ...  but have gotten them to take home with our dinner leftovers.  The sun dried tomato dipping sauce that is complimentary is outstanding and the bread is always warm for your dipping pleasure.   If you're In Pittsburgh and have never been here, please give it a try. I don't think you will regret it!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "I9UIr-Rs5O6eyBJ1QKlRxg",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Baked Scrod!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I9UIr-Rs5O6eyBJ1QKlRxg/o.jpg"
      },
      {
        "img_id": "wUwXbJG87NPVl1LF36slkg",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Lobster Mac n cheese!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wUwXbJG87NPVl1LF36slkg/o.jpg"
      },
      {
        "img_id": "O1YolkSt-Vt-W9xoGstThg",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Crab bisque!!  Amazingly awesome!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O1YolkSt-Vt-W9xoGstThg/o.jpg"
      }
    ],
    "user_id": "RxPX1FyuPzGqYaqxEmhxNA"
  },
  "t8srkeW1GGXKbh4ExY0veA": {
    "date": "5/8/2018",
    "text": "The bread they bring out was AWESOME! It was slightly warm and super soft. I ordered the linguine clam in white sauce. It was a huge portion and made for two BIG meals. The flavor was a bit odd. The sauce was liquidy. It was still good, just way different that I expected. I wouldn't say it was great, just good. I couldn't get over the portion size. Way to much, but not a bad thing if you are looking for value. I would have liked to see the menu price go down and smaller portion size.   I would come back here as many of the other menu items looked delicious.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QChqlMcmCc7I1IxXryJUrA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Linguine Clam with white sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QChqlMcmCc7I1IxXryJUrA/o.jpg"
      }
    ],
    "user_id": "rVLTC95ZV7yCmbQbSVdX1w"
  },
  "MbiDVm8UHamLSQWXy7v9WQ": {
    "date": "2/12/2018",
    "text": "This used to be a place I frequented regularly throughout my life.   As a long time vegetarian, I appreciated and enjoyed their \"vegetarian\" options.   Servers have routinely recommended the pasta with marinara, zucchini Parm, cheese ravioli and eggplant parm.   I've often enjoyed breadsticks or cheese sticks with marinara.   I've often sampled their sauce at the local Giant Eagle stores and we bought a jar yesterday.   On the menu - it is listed as tomato sauce.   After dumping the sauce into our pot of ravioli, I read the ingredients.   Chicken flavor, chicken fat, beef flavor, beef shortening and beef extract are not friendly.   I don't have a problem with something not being vegetarian.  I completely understand that the majority of the population consumes meat and support their decision to do so. However, I expect that if I ask an employee, that they will know that it isn't suitable for a vegetarian. It would also be appropriate to be more descriptive on the menu.   After reading the ingredients in the pasta sauce, I won't be back...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yWG0HfdPx70kMUIaN3qnQw",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yWG0HfdPx70kMUIaN3qnQw/o.jpg"
      },
      {
        "img_id": "WAa7OPhxJ3gMBYlR4RNIjg",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WAa7OPhxJ3gMBYlR4RNIjg/o.jpg"
      }
    ],
    "user_id": "YEaYdTrF2JVebGbPVe5K6Q"
  },
  "weJCTTRaJCOr2sUOOgmKMg": {
    "date": "2/25/2018",
    "text": "Oh. My. Gosh. My first time at Pasta Too was unforgettable. This is now one of my favorite restaurants in Pittsburgh if not my favorite.   I've heard amazing things about Pasta Too from everyone that lives in the Bethel Park area. I was warned by friends and Yelp reviewers that I would probably have to wait at least an hour for Saturday dinner but honestly, I usually don't mind a wait as long as the food is worth it. And it was so, so worth it. I would wait 2 hours if I had to in order to eat this food again.   We started off with a bottle of their signature wine (only $15!) which was tasty and complimented our meals. Then, the bread came and as soon as I tasted it with the olive oil dipping sauce, I had a feeling the meal would be just as good. The salad was pretty good too- I got the balsamic vinaigrette which is made in-house.   I asked my friend who went with us what is good at Pasta Too and he said without hesitation, \"everything\". So, I decided to order my favorite Italian dish and i can't imagine myself ordering anything else there again because it was INCREDIBLE. The chicken was so tender and the texture was heavenly. The sauce was sweet, but not too sweet. The cheese was the perfect amount. Since I had such a hard time deciding between the chicken parm and penne vodka, I asked if I could have penne vodka as my pasta side. The sauce was probably the best vodka sauce I've ever had. It was creamy and so tasty.   My boyfriend ended up getting the manicotti and was really happy with it!   We didn't get dessert but they did bring out the dessert tray to the table next to us and it was a really, really hard decision to not get anything but if I was so full I could burst. Everything looked amazing.   I have more than half left over from last night and am so excited to eat it again today. This review is really gushy but trust me, go there. Go to Pasta Too and eat carbs on carbs on carbs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iHmssQyd11NKKUCLhr0yDA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Chicken Parmigiana - the portion was bigger than I made it look.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iHmssQyd11NKKUCLhr0yDA/o.jpg"
      },
      {
        "img_id": "xPb8qccGC7JG4kYXdzZanA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Side of Penne Alla Vodka",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xPb8qccGC7JG4kYXdzZanA/o.jpg"
      },
      {
        "img_id": "-y06RRmkc4235VK4_WIrHQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Manicotti",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-y06RRmkc4235VK4_WIrHQ/o.jpg"
      }
    ],
    "user_id": "dTMhVGbU-BGpnCDmikhgfA"
  },
  "hI-7pjRmU3_Figsn0v_oDQ": {
    "date": "6/18/2019",
    "text": "Sadly I have to rate this place a three. There was a time where their takeout was legendary. No matter how complicated the order it would always be perfect. We are now at about 8 orders in a row where they forgot something or messed something up. At this point we are no longer doing takeout.    You may think, no big deal, eat there. Only the wait almost always exceeds 45 minutes with no call ahead or reservations available.   So, after 20+ years of patronage we have given up on Pasta Too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0rBzYbVYkPelQ8c96A9CWA"
  },
  "Rc607dJdYcQNJernpUdv6A": {
    "date": "4/10/2019",
    "text": "Always a great choice for pasta, but be prepared for a wait.  My favorite is their special, chicken Saint John. Their breadsticks are to die for and the vodka sauce pasta is pretty good too.  Don't forget to ask for Barb, she's their best waitress.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IETq2uSW_sPKK-MdyaqZUQ"
  },
  "0mmc8mwL_9EWSS5oNyGtqg": {
    "date": "2/19/2012",
    "text": "Just visited Pasta Too tonight. I liked it. I thought the servings were gigantic. They were large enough you could split them. Ravioli and the manicotti were good. Wedding soup was also good. The service was just ok. The meal came quickly, but the server barely came to our table. There was a long line for the take out so apparently people like that. We sat at a small table that shared a bench with other tables. It was a bit tight. Next time I go I would like to have a less conjested table.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "BiTMbXtxQ9agLSBUk1b13w"
  },
  "6TvrpUBz6hb1JZIwzLIiGg": {
    "date": "11/17/2013",
    "text": "I am shocked by some of the reviews on here.  I've been eating at Pasta Too for years, and a relative of mine is a cook here.  They do not serve \"canned Campbell's wedding soup\".  Or freeze the lasagna.  Or use jarred sauce or whatever else you want to accuse them of.  This is one of the very few places in the South Hills that DOES make everything from scratch.  I know I've had better wedding soup before, but if you think it's canned, you're an idiot.  Anyone can tell its homemade.  A place that half-asses it's food can get by in this city, but they certainly won't have 2 hour waits for tables at 4 o'clock in the afternoon on a Tuesday like Pasta Too.  I'm very critical of food and I love everything they have.  Ignore the clueless people who put uninformed reviews on here.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "yP-Mrt1gdHLesMiFAQ8e1g"
  },
  "a_KzmkG4dVWUxuR9k6i42g": {
    "date": "12/29/2012",
    "text": "I usually don't get cravings for Italian food, but the family decided to come here so I begrudgingly agreed to go for a free meal.  I was pleasantly surprised.  The place is obviously popular, at 5pm on a Saturday, there was a line to the door for take-out and a 20 min. wait for the dining room.  This place could definitely use a bar to help keep the waiting customers happy (and boost sales).  The dining room is very nice, looks like it was recently renovated, and our waitress, Kelly, was very friendly throughout the meal.    We ordered a few things including the Eggplant parm, sausage pizza, ravioli, and Spaghetti Aglio e Olio.  The Eggplant Parm was great, with very thin fried coating.  The sausage pizza was good, I would prefer it slightly more browned all over, but good flavor.  The ravioli were huge and very tasty. And the Spaghetti Aglio e Olio was very good, although I would have liked the anchovies to be incorporated a bit more (rather than have chunks of it).    Portions are HUGE so you definitely won't go away hungry- we probably had enough food for 2 meals each.  Even my side order of the Spaghetti was probably more than one actual \"serving\" of pasta.  Overall, a nice place for Italian food if you're ever in the mood, and come hungry.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FAG1VYolZSt32sg2hnW4ug"
  },
  "Lzfww1LKbwVMfIu52CIWHw": {
    "date": "2/19/2012",
    "text": "Darren brought me here over a week ago, and I liked it as well. I don't have much to add other than that my linguini with shrimp was not only generous but delicious. Linguini with any sort of seafood sauce is one of my favorite pasta dishes and this was as good as any I have had anywhere. The Chocolate Chamboard cake was scrumptious. Pasta Too has a pretty big menu with lots of specials that aren't online. The dessert tray was mindblowing. Darren and I couldn't decide! The dining room was fine. We didn't feel cramped at all. Also, the service was great.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7AGLlj5YzqdBfCPiZCa1mQ"
  },
  "qA-yuMOyJOhE_8AC_78-wg": {
    "date": "6/11/2013",
    "text": "Great food, and VERY large portions!!  Chicken parm is amazing!!  One downfall:  they cram the tables way too close together!  Much better than Olive Garden.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C7pVJtxnqReTjs7Gz7gjcA"
  },
  "uafGtYc7qfQVdXuAWiMEAA": {
    "date": "1/8/2013",
    "text": "We get takeout here a lot. It's easy to order over the phone and easy to pick up. The clam linguine (red wine sauce), stuffed banana peppers, and stuffed mushrooms never let me down! The prices are reasonable and it's consistently good food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "idx41sRD6jbrNDuDILMlvA"
  },
  "VNohYpia7BFUTjBdHod0Ug": {
    "date": "10/19/2011",
    "text": "NOT vegetarian friendly. All their red sauces have a chicken base. So a vegetarian can basically get the alfredo sauce if they want a pasta. Our waitress was apathetic and i wanted to request a new one but didn't because my boo said that's rude. She neglected to remove extra plates and empty glasses through out the dinner and was fond of passing by us without asking if we needed anything. Portions are HUGE and HEAVY like any other americanized italian joint but the decor itself isn't all that bad. Anyway, I won't be back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qIossUhtsJ55_ciRTEqiPQ"
  },
  "1_ZK_u7KHMXjwILiEDVa_w": {
    "date": "8/20/2012",
    "text": "Great ravioli and chicken parm sandwich. Their portions are huge so you may Want to get a side order of pasta which is still plenty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A69QAmKSdW45kUIqd4FESg"
  },
  "oEOf4IhX-U0lGVX-DNURCg": {
    "date": "1/18/2012",
    "text": "We visited this place last night on our way down to the Pens game.  It's been a long time since we've eaten here.  I ordered the scallops since they were the special for the night.  It wasn't clear to me from the waitress that they would come swimming in butter and breadcrumbs.  They had no taste at all.  I had to add salt, something I never do, to get some flavor.  The sauce is way to sweet, in fact I think it's possibly the worst sauce I ever tasted.  This is C-Rated Italian at best, they get large crowds because they have generous portions.  I now know why we haven't been there in a long time.  Never again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLoIBboTeBdIzDI6TXd-qA"
  },
  "ndpsViF-VlQ_E2yP9UyufQ": {
    "date": "12/29/2013",
    "text": "Good, reliable Italian-American food.    What others have said about the wait times is True, if you hit them at a busy time (which is generally mealtime) you will wait.  It's a fairly small dining room and they do not take reservations.  If you don't want to wait, everything on the menu is available for take-out.  If it's a Friday or Saturday evening it's not unusual to drive by and see people standing outside waiting.  On the other hand, my family went today and got there at 1 as they opened, and we were seated almost immediately.   The menus haven't really changed in years, and the specials don't tend to change much either (or else we always seem to hit them when the same ones are up) but there's plenty to choose from.  Today I had the lasagna, which is actually one of the lighter meals on the menu.  I'm not saying that because it was small (it was more than ample, probably almost 5 inches square and 2 inches high) but because the other pasta dishes that arrived completely dwarfed it.  A \"normal\" eater would probably be better off with an appetizer and a side order of pasta, something that is comparable in size to a dinner portion at many other restaurants.  I'm not sure what they put in their house salad dressing, but they should probably bottle it and sell it. The tomato sauce is a little on the sweet side for me, and sometimes the pasta comes out a little past al dente, but other than that I have no complaints.   Other dishes I order often are: Stuffed shrimp - 5 large shrimp each wrapped around a ball of crabmeat-based stuffing, probably one of their smallest dishes and still enough to fill me up. Fish sandwich - a large round toasted roll (5-6 inches in diameter) and a piece of fried fish that you have to fold twice to make it fit.  There's easily over a pound of fish there.   Steak calzone - thinly sliced beef, cheese, and onions wrapped up in pizza dough and baked.  Where the price fits in comparison to the other items on the menu makes this look like an individual serving, but it's better to split with someone.  You can get it with tomato sauce for dipping, but I like it as it comes. The wedding soup is homemade and excellent, there are times when I'll just pick up a quart of that to go and call it a meal (or two).   Others I've been with have said they enjoy the Alfredo and vodka sauces, but I'm not partial to cream-based sauces to I'll leave them to others to evaluate.  Overall, as I said at the beginning, it's a good, reliable restaurant.  You know what you're going to get, and the prices are very good even without considering that you'll be taking an extra meal home with you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "StddXvP59PNWdF0UV9Pf2Q"
  },
  "IIdaER1EaqxvxHlt-VIFrA": {
    "date": "11/8/2014",
    "text": "Slow service. Waited 15 minutes for bread and drinks. Once food came it was large and very good. Salad was awesome and the baked ziti is so good! If it weren't for the slow service this place would get 4 stars. If you want large portions and good food and have time on your hands, go to Pasta Too!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YpembInnbOIwtACqic026g"
  },
  "QD5rQ38xSagMeUO5bZmVXQ": {
    "date": "10/20/2012",
    "text": "My husband and I LOVE Pasta Too! Great staff, really good food-especially their Carrot Cake YUM, and an awesome atmosphere. There is usually a pretty long wait so be prepared if you take children. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d9brPeYtYioIXNvFreCbZw"
  },
  "Q3H5zOs9M1KHI_gWO2ckvg": {
    "date": "8/15/2011",
    "text": "I don't understand why people think this restaurant is good.  I guess people think that adding a bunch of SUGAR to your pasta sauce makes it SWANK and wonderful?  I have had nothing but extremely mediocre meals at this place, and the service has always been less than exemplary, but still, the parking lot seems to be full most of the time, and I simply don't get it.  I guess SHEEP get hungry too?",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gdJasOzvva2NxSpNjVXwvQ"
  },
  "NFQEfsEay5dOzjdWBgG2bA": {
    "date": "8/23/2014",
    "text": "After much hype for this restaraunt from some coworkers the girlfriend and I decided to give it a try. They did prepare me for a long wait if stopping in but the hostess explained only a 20 minute wait.Nearly an hour later we were finally seated at our table. After waiting another 10 minutes for our waiter to show up without knowing what the jights specials were. Luckily we had already decided on our food while waiting. I ordered the baked ziti and she got the lobster mac and cheese. We also got the stuffed pepper appetizer which was good. I did not think the baked ziti was much to rave about it was not bad by any means but being a pasta place I expected much more flavor in the sauce. The significant other did however absolutley love her Lobster mac and cheese. All in all the food was ok but the service was terrible. Other reviews explained you git huge portions for the price but the small dish for my 13 dollar ziti did not agree. I am not sure I would even recommend this place over a chain like Olive Garden.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_yIRKE4ELzKcoPgEohGDwA"
  },
  "lHcvE1-pDoQPD1Qh2PIG7g": {
    "date": "8/12/2012",
    "text": "If you don't mind waiting for a table, Go to Pasta Too. Our half hour wait was actually one of the shorter waits we've had there.  Stuffed breadstick appetizer was unbelieveable. Breadstick stuffed with cheese & spinach. Also had a chioce of pepperoni. Lobster mac & cheese entree was also fabulous. Brought home a slice of carrot cake that's delicious & big enough for 3.  Waitress left a little to be desired. Nice, but slow. From what I saw, she was an exception to the rule.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AGiuxNVAYMMfes3Z4-M1OQ"
  },
  "vw0kKJhVaPipaPmF5ERmCw": {
    "date": "11/2/2011",
    "text": "Good sized portions. A bit on the large side. Delicious. Veal is perfect. Fettucine Alfredo to die for. Waitstaff is generally not very warm but is conscientious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1rWc1ruNhDInRmegfAda-A"
  },
  "7F2t4oh9anyX0RN25trUwQ": {
    "date": "7/28/2011",
    "text": "I've been here so much over many years, I can't get passed the chicken Parmesan or the grilled chicken salad to try other options! Huge portions (At least 3 servings per entree.)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uHDpa4eO3oH9ndvLuFQVzA"
  },
  "GqO91cQMjBcDZX-fr23zKQ": {
    "date": "3/20/2014",
    "text": "my family went there last night and we were totally impressed with the service and completely satisfied with our meals.  This place is busy for a reason... YUMMY!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AMaRHa8lGEKFKOkdT61Mhg"
  },
  "IHzFbYD2JN4de359TsaTGg": {
    "date": "6/23/2010",
    "text": "My family has been going to Pasta Too since it was in a tiny shack.  I used to love it as a kid.  I don't remember what it was, but they had the best desert I have ever had.  Anyways, a few years back they upgraded to a larger, newer building.  Its still good... one of the better homemade style Italian places I've eaten at.  I think it may have been better when it was made in the tiny shack, but I'm not disappointed one bit.  The food is good, the portion sizes are great, and service is good.  I would just recommend eating at oddball hours to avoid having a long wait for a table.  It can be brutal sometimes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QW11_6RZaNp5G1oGdsOd_A"
  },
  "OKd8XSpXJcdzXsYzkAKltA": {
    "date": "6/23/2012",
    "text": "I am sitting here reading all of these great reviews and I just don't understand them. This place is horrible. I went there because of all of these great reviews plus it's close by. We got right in on a Friday night around 8pm which I was shocked because that never happens!! I ordered a glass of wine and the server brought it in a orange juice glass. Part of drinking wine is the beautiful glass it comes in. If I want an orange juice glass I can get that at home. We ordered wedding soup which I could tell immediately it was from a can. It tasted like canned soup. Then our meals came out. Which were extremely large. They could have been 2 meals. Mine was pasta with mushroom sauce. I was starving I couldn't wait to eat . It tasted like spaghetti O's. It was disgusting. The other meal was pasta Alfredo with chicken. It was creamy and looked delicious. My guest said Oh my god this is terrible, taste. So I did. The pasta was complete mush and the sauce tasted like dairy creamer with tons of butter. And the chicken was cold!! We each only had a bite and told the server we couldn't eat this food. She went to talk to the manager and he wouldn't take them off the bill. We had to pay for this food and they asked if we wanted to take it home. I said I wouldn't feed this slop to my dogs and walked out! I was appalled. The service was terrible the food was disgusting I don't know how anybody can eat here. We left and went to Olive garden which is always reliable and has good food.  I just don't understand how they could charge us for meals we didn't even touch I am dumbfounded by that in itself. Don't waste your money here just because it's family owned. That was the appeal for me too. Go somewhere you know you will have good service and good food. Try Talotta's in Carnegie 513 West Main street 15106 it's family owned little hole in the wall restaurant, but it's amazing...",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fe8DGcvnTZfWOGJJr95SoQ"
  },
  "ZUoGqc1n5z0EDLal35Ku8g": {
    "date": "9/18/2014",
    "text": "Pasta Too's food is absolutely delicious!!!! The prices are super reasonable for the quality and quantity of the food. The atmosphere is very nice and the service is wonderful. It is decorated nice on the inside and is very family friendly.  Best meal by far is the the fettucinne alfredo, it is out of this world. You will not want any other fettucinne alfredo but their fettucinne alfredo, I promise!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "l3ryB3Q6WZ3uHDHVe2HgoA"
  },
  "b_Op2dxh1QJJLGxyvfEDdg": {
    "date": "9/24/2017",
    "text": "Great family restaurant.  Huge portions.  We have been going there for 10+ years.  Highly recommend for casual, family friendly night out.  Also take out is good and reliable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FFwuzNDtK-oqgolC7qHZdA"
  },
  "Ot-h-DzoAYJLrV1qWxMhAA": {
    "date": "2/6/2013",
    "text": "So I've only been here a couple of times, but a few things I noticed are  1. AMAZING DELICIOUS dipping oil. Pretty good bread too. That's actually the biggest stand out. 2. HUGE portions. Plus, by the time the entree comes, with the bread and the soup I'm pretty much full 5 bites in. A shame tbh. 3. A lot of very heavy pasta dishes, which can mean \"comforting\" to you or be more of a bad thing, like for me. I like the clam pasta very much. Rich yet relatively light.  4. This location is very popular! We went at 1 on a weekday for lunch once and it was a 15-20min wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jXX-G_goCYZZrLSDY8qXdg"
  },
  "-2ppLyOpWhBKczjuc2QtBQ": {
    "date": "2/12/2012",
    "text": "Considering that this was my birthday weekend, that it had been three years since I had been to Pasta Too, that my initial review was sparse, and that it has gotten some negative reviews in those three years, I felt I had to return to see if I had simply been imagining things or just have atrocious taste as some are wont to infer.   Well, banish me from Yelp forever for having unreliable opinions because I liked Pasta Too even more than I did approximately 36 months ago.   Yes, I was hungry. I had an endoscopy earlier that day. Did that color my perception?  One could call the dining room \"cramped\" or communal. I'm not bothered by someone eating right next to me. How much elbow room does one want? The dining room is rather spacious, by the way.   Nobody \"yelled\" at anyone as we dined Friday evening, the service was far from rude, we had no trouble getting seated, parking was facile, and...that sauce still owns 'em all.   I mean, did you guys actually come here or are you telling fibs because it's in \"unhip\" Bethel Park and because I FTR'ed it? C'mon children. I'm kidding, relax.   The sauce was what I most wanted to try again...on something. Now I had planned on getting gnocchi until our awesome server had to go and tell me that they had Lobster Mac 'N Cheese on the menu that night. Since I'd never had it before, well, do I even have to state what I ordered?   Beneath a layer of bread crumbs laid the macaroni at the zenith of al dente in a lake of cheese sauce, swimming with a loving helping of sweet, consummately cooked lobster claws. I can see why this take on comfort food has become such a hot trend and am on board with it.   Yet...I continued to long for that sauce, so I asked politely for a cup of it on the side so as to dip pieces of our complimentary bread into...just to see if it held up to my last experience. As soon as the red, red, bloody, rosen red gravy touched my tongue, I knew that the detractors were gravely wrong...  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DAsDYkRYghxA&s=b6e49d2cb71500c1ad2bde7821bd0bc0cef7ce5df50e4dd4df33bc140769830b\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=AsDY...</a>  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DjPIWfT-m9GQ&s=174e0e6f7504723f18a1a9a1aafdc10c4d3ba9760fabfa2803f9c3392a937616\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=jPIW...</a>  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Di9nWCfcnzsw&s=f9d4a61fe3ab3a32b105375124575c543d79776e733d338435e71eb09c054b77\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=i9nW...</a>  How anyone could call this sauce saccarhine makes me wonder all the more whether or not people truly sampled some of it. Surely there's a touch of sugar to the proceedings taking into account the fruit from which the sauce is based, but more than anything I found it to be deeply savorous, luxurious, and embracively spiced. It is a sauce that is almost too rich, too flavorful to have with anything but some bread to soak it up with. Once again, I proved to myself that Pasta Too's sauce is a culinary opiate. I don't know what else is in it, and I want its ingredients to remain a beautiful mystery.   My salad was possessive of a rather pungent, potent house Italian dressing that, like the sauce, ranks among the very best I've ever had. The Italian Wedding Soup: Masterful in every way. All of its components worked brilliantly.   Kay had one of their other specials of the evening, a superhuman portion of linguini with shrimp, and yes the portions are hefty. Those who eat like birds needn't come to Pasta Too.  For dessert, we both came close to scaling the Tower of Chocolate, the restaurant's signature confection, but once Renee brought out the vast arsenal of decadence (they have way more desserts than are listed on their menu. even  the tray they present to you in person doesn't hold them all), I fixated on the ivory-iced Chocolate Raspberry Chamboard cake. I don't know if this was made in-house, but I can tell you that it was airy and not richly sweet, belying its thoroughly indulgent appearance. One supernally good cake, Kay and I took turns on it, slowly, relishing our post-dinner reward.   Which restaurant did you guys go to again? Hell which restaurant did I go to? Was the Pasta Too we visited on a parallel Earth?  Am I on a parallel Earth? *looks around*",
    "rating": 5,
    "rated": {
      "funny": 10,
      "useful": 13,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "6MD7kVkvM6OHNdEoxkS6gg",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Chocolate Raspberry Chamboard Cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6MD7kVkvM6OHNdEoxkS6gg/o.jpg"
      },
      {
        "img_id": "do-OiBiew04Qe6_kmIY3qA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. An interior shot of the restaurant. The Tower of Chocolate Cake can be seen if you look hard enough.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/do-OiBiew04Qe6_kmIY3qA/o.jpg"
      },
      {
        "img_id": "wLEgij10r7p1976UVCjIHA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Lobster Mac &amp;#39;n Cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wLEgij10r7p1976UVCjIHA/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "FvD_I4y_C2QKcEaTL4Yx6A": {
    "date": "5/18/2014",
    "text": "Perhaps I'm a little harsh with my rating, but when I added up the pros and cons of this place, the cons took over.  The cons: The restaurant is too small for how much business they get. Be prepared to wait for a long time, even on weeknights. It's always busy in there, even though the tables are packed together. There are never any parking spots in the tiny parking lot. Due to the size of the restaurant and the number of people they pack in there, it's always loud. I can handle a normal decibel level of chatter, but people scream over each other. To top it off, the kitchen area is open to customers. I assume this is meant to be charming in some way, but it just adds to the noise while the cooks and waitresses yell back and forth.    The food always tastes bland. You can't order anything without it tasting exactly like everything you had there before. The pasta sauce they use is unbelievably sweet. My husband ordered the Turkey Devonshire and we were appalled at what came out. Massive gobs of melted cheese that looked like the cheese you get on nachos at a stadium. My husband felt sick after eating only a few bites.   The absolute worst part about this restaurant though? The hostesses. One of them is the owner, I believe. Both of them are unbearably rude. Neither of them should be in customer service because neither of them know how to service customers. My family and I steer clear of this place just so we don't have to deal with the hostess, all other cons aside.   The pros: I have to assume the main allure to this place is the fact that you can eat for two days off the portion they give. They are humongous. Obviously this makes for relatively decent prices, given the portion sizes. Their desserts are massive and shareable, if you're even hungry enough after the meal to order one.   Conclusion: I'll skip Pasta Too. There are better places to get food in the area.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FVaRrIHKb-HzIYKAfz4LRg"
  },
  "VTw9ykJ_t1kU1taV5r0iPA": {
    "date": "11/14/2015",
    "text": "Ok, popular place...Why because of price and huge portions.  We had six.  Were told 20 minute wait on a mid-week night.  One hour and 20 minutes later we were seated.  There were a two more groups of six behind us and the had a longer wait.  Warm bread with butter and dipping oil were good.  I had the fettuccini alfredo that was rich and creamy on some good pasta that was al dente.  Had enough to take home for another meal and then still had some leftover. Not sure how anyone can have desert when you get so much to eat.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "Dm3ZQsFMqGMh8q_lXpbWcA": {
    "date": "4/22/2016",
    "text": "Ordered a \"small\" Italian salad for lunch and got a medium sized plate with a mound of food so big I was able to eat only 1/3rd of it. It was a good tasting salad with nice ingredients like artichoke hearts, olives and shredded mozzarella, but I would not have ordered it if I knew \"small\" on the menu is not to be taken seriously.  I'm not a fan of big food. Judging by the ginormous customers at Pasta Too I'm in the minority.  But... I am a fan of good food and Pasta Too has served me on more than one occasion some tasty meals.   Other reviews about Americanized Italian food are accurate, although I do not agree the marinara is overly sweet, and I detest sweet pasta sauce.  I'll be back and will continue my quest to find at least one reasonably sized entree for one person eating one meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lx4qae4sfIovjT-MT57Axg"
  },
  "95O3NzU5YM7DfN3plIU3ZQ": {
    "date": "2/9/2014",
    "text": "Decided to come back and give them another chance. Old hostess? Still rude as ever. There was one booth available that was being cleaned. We said we'd wait for it. She basically rolled her eyes at us and walked back to the lobby. We almost decided to walk out, calling her a bad name to her face in the process. Seriously, if you greet customers for a living, smile and act like they're about to give your busines their hard-earned money. Retire if you're that miserable. She earned this place one star, again.   The service from our waitress was great. Tables are too close together. The bread basket contained 3 pieces of mangled stale bread. I've never been a huge fan of their food, it all tastes the same, so I went for something  safe, an Italian sub. It was decent. My daughter had a grilled chicken salad. Way smaller than they used to be. Carrot cake was delish.   It'll be a while before anyone can talk me into going back. I'll stick with friendlier places. :)",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "5RxyZjPA1f14JTj7dY2_zw"
  },
  "mdQaE16MiQKyl2D1dWY_zQ": {
    "date": "1/29/2015",
    "text": "It had been awhile since I had eaten at Pasta Too. They do a great business and no matter what day you go for dinner you always have to wait.  I went tonight for a going away dinner for a close friend. There were 12 in our party.  One of the ladies went 45 minutes early to let them know we had a large party. Our wait was half an hour and that's pretty remarkable.  Once seated our waitress came right over. She was quick and efficient in getting our drink orders. As soon as she passed out our drinks she gave us baskets of fresh bread. Their were saucers of dipping oil and herbs on the table. Our waitress again was quick and efficient in taking our orders. That's not easy with a dozen women. Our orders were all over the place.  I ordered the Veal Parmesan. It comes with a salad and a side of pasta. You could choose between spaghetti, rigatoni or ziti noodles. They have me two large pieces of veal. They should have just brought me a To Go box because I can't imagine anyone eating all of that in one sitting. The veal was pounded out thin and fried crispy. It was covered with sauce and had melted mozzarella on top. To make homemade spaghetti sauce at home and there is no sugar in it. Pasta too's tasted good but really sweet.  Others ordered a meatball hoagie, a large salad, stuffed peppers, linguine Alfredo, and other dishes. Everyone's food looked good and people enjoyed their food.  The restaurant is decorated to look cozy. They do a great take out business and have a small section of shelves filled with chocolates and other goodies for sale.  It is a True representation of local Italian food and much better than any chain Italian restaurant. .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "exyaCvXXxNyFq-dlGVXVTQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Large size salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/exyaCvXXxNyFq-dlGVXVTQ/o.jpg"
      },
      {
        "img_id": "_yQ46kfXvrqvcChgkGiE6Q",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Veal Parmesan.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_yQ46kfXvrqvcChgkGiE6Q/o.jpg"
      },
      {
        "img_id": "PWunFVdhjspougclPq6UZg",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. A peek into the restaurant.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PWunFVdhjspougclPq6UZg/o.jpg"
      }
    ],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "RlOLM1B_wnt7m_5qhkUW3A": {
    "date": "1/22/2016",
    "text": "Pasta Too was amazing.  Great service.  We were traveling and staying in the area.  The food was delicious.  Portions were huge.   I had a pizza bread appetizer, Italian wedding soup, chicken parmigiana that had to be at least a pound of chicken, a side of spaghetti, and a cannoli all for less than $30.   My friends got pizza and it looked super great.  I throughly recommend this to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xvYkvFYB3kfgYJzwsXNf9Q"
  },
  "C5B-AC1nfi4vgf5QU0IBsw": {
    "date": "3/5/2016",
    "text": "Thank you Pasta Too for your incredible catering!!  I ordered from Pasta Too on 2/27/16 for my daughter's 16th birthday party.  The cost was very reasonable, the food was packaged in perfect trays and boxes so that it would not spill on the trip home, it was hot, and it was delicious.  I received so many compliments on how good the food was!  Huge Success and I would highly recommend Pasta Too for your next event.  Save your time in the kitchen and let them cook for you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "djCPyBBGqTgXffbouDZv2A"
  },
  "NZxF8XWtg3WFZ7Bcg1LSBg": {
    "date": "2/29/2016",
    "text": "Where do I start? The portions are exceptionally large, the food is awesome and the prices are down right reasonable. I would highly recommend splitting dishes. A highly recommended stop for Italian dining. The only downside is you have a bit of a wait as the dining area is small.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HMlh6mHxCDQ5uHcbG6-VsA"
  },
  "s_lHy7K569_DBEE0ff59NA": {
    "date": "7/2/2014",
    "text": "I've only eaten in twice...  but my family orders the baked ziti often. Yum! It holds well in the fridge and tastes great. Comes with a loaf of yummy homemade bread. This place is pretty pricy, but I've never had rude service as some people have listed. The food is always ready when we come to pick it up. Delivery would be great tho!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K4SmcbJsC0Fhq6OTZXNrfQ"
  },
  "QVMXym-DIP0i2yh-uEs6Ng": {
    "date": "8/9/2015",
    "text": "I love pasta too and I will forever...got that out of the way! But seriously, it is amazing! Great food, great service, nice people, the only thing I'm if-y about is the prices!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "im6z8k6e-hI7GRrIzj4_nQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/im6z8k6e-hI7GRrIzj4_nQ/o.jpg"
      }
    ],
    "user_id": "bbsUn_rZHB64g14FC_sKZw"
  },
  "ExQR-CT4NxnFcJ5U4ktCjA": {
    "date": "11/24/2015",
    "text": "I'm writing this review not because of the food but because the server and management where unbelievable. I've been here more times than I can count, and since our regular waitress was busy, they put us with someone else. Well not everyone is cut out to be a server and this was a perfect example. After speaking with George the manager I can see why our waitress left little to be desired in the service department. I love the food but can't believe I spent money for service this rude. I usually only write reviews for exceptional service but I'm so disappointed that they treated us this way I had to put it in writing. After sitting at the table stewing the manager came over and told us we were in fact speaking with the assistant manager and that he was very sorry and he would rectify the situation.  Thank you for the apology and the great food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NR3--89cMS1wIYodxT_s8Q"
  },
  "3_m7QfWXv0AHXnX_AQ-4zA": {
    "date": "3/4/2017",
    "text": "Our go to Italian place in the area. Homemade red sauce is my wife's favorite. I would make sure to get a dish that includes this somewhere in the meal. Wedding soup is also a go to. Service is always great as well. The place can get really busy on weekend nights and parking can be rough so plan ahead. Take-out travels well if wait is too long.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FrVD18DmMNOlXKMyVBCpvw"
  },
  "ZC9eJeg1HhJ-X_RqF4bASQ": {
    "date": "12/28/2015",
    "text": "Always go here with my wife and in-laws when we visit Pittsburgh. It's not a chain and it has some pretty decent food. Fried bread sticks are tasty but not for the health conscious mind you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cV_pYyBmcSs4d2MyH57UnQ"
  },
  "D2uMkGponvokty12e1grrA": {
    "date": "5/13/2013",
    "text": "I have always loved Italian Food & Wine, Pasta II makes Italian just like my Mother use to make. I was here tonight and ordered the Spaghetti & Homemade hot sausage !!!!! Delicious (As usual) Ad a bottle of Merlot and This is Heaven !  Jamie was our waitress and although she looked very busy , She did an Awesome job of keeping us in fresh HOT Italian bread and drinks. She brought out this desert tray that will make tears come to your eye. Even though , I needed a freekin crane to lift me out of my seat , I ordered The Chocolate Moose & coffee.  Well ,I guess I'll be skipping meals for a MONTH.  The Parking is Tough , and the wait was about 30 Min to get in , and leaving the parking lot is a bit tricky. That being said , You have gotta try this place. ( Again )   Very reasonable prices. Excellent Staff , and the BEST Italian ( so far ) in Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "67IMqiMGTTlobnDMEWszmw"
  },
  "eKZXRyI8BF0Ij5LL_R3Wvg": {
    "date": "4/19/2015",
    "text": "Just wanted everyone to know Pasta Too has gluten free pasta now.  I missed going there since becoming Celiac, but when someone mentioned they had gluten free, I ran to try some.  Excellent, and I have to say I really missed it.  Prices are great, and there's enough for another meal. Also, a delicious brownie dessert that is gluten free.  It was wonderful, and I will be adding it to my weekly dinners.  Thanks Ray, it's nice to be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hQqWvcs5VYOUfdVsH9LrYg"
  },
  "WbLM4Vl_2Ct9JzY4AFvQ-w": {
    "date": "2/13/2017",
    "text": "Cari is the only reason we go there. Any other time, we have waited too long for food and when you have kids, that is OK OK.  Cari makes the difference, if she is not there we don't wish to come.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HrCx_xt-EBlLWmKABfsA5w"
  },
  "PspVYnhMLG2mUN7mL9Pi0A": {
    "date": "2/14/2016",
    "text": "Great size meals that usually allows me a nice take home box for the next days lunch. The desserts are big enough for 2-3 people per slice. The service is always good but the wait times are always long. The food is well worth the wait in my opinion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5Ci7FP9Qh_Kw21Doy9WCYA"
  },
  "nJWaJycN16b6lxpqOZXClA": {
    "date": "7/28/2017",
    "text": "Bob Shepard and I ate lunch and it's five stars all the way would recommend this place to everybody I know. Beautiful Decour friendly waitresses and the best damn Italian food around. You would be a damn fool not to go to this place up in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eRNy2SSNXQGPyO-RGipBUQ"
  },
  "NBu37dTN-TAnT8P56Otx8w": {
    "date": "5/8/2017",
    "text": "My all time favorite restaurant in the Pittsburgh area. Love everything that I have ordered here. Portion sizes are large, always have more for leftovers the next day.   Love the warm Italian bread with dipping oil, salad with homemade dressing and pasta dishes. Their homemade meat sauce is delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iRLWfXrc0t-76Ic4tYgQMQ"
  },
  "NP6OZe_nVBzYvJYrK9_OTA": {
    "date": "2/1/2018",
    "text": "Overly crowded for an uninspiring experience. Decent portion sizes, clean and polite staff. Food taste is never outstanding. Have been multiple times and have always left feeling like I could have had a better experience for the prices, elsewhere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XTfscCc2RGWpVdMmIBCkuQ"
  },
  "F9dbyRoqHKPIEBtDCuJLuw": {
    "date": "6/9/2017",
    "text": "This place was actually really fantastic on our first visit! I thought my expectations of this place would be pretty average but it definitely exceeded my expectations. We ordered the fettuccine and it was wonderful. I don't know about the other pasta dishes but if you have fresh noodles your likely an above average establishment. Bread was also delicious. A couple months back we went to Cleveland and ate at essentially the best Italian joint there in Little Italy and I'd say that Past Too tasted better! So yeah, we will be returning in the future. Also a bonus that it's close to where we live.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NMj_TsW5OrLVC-wmXGmN3w"
  },
  "dP3R1I1-Io5KXpCjGB85_Q": {
    "date": "11/18/2016",
    "text": "My absolute favorite restaurant in the entire world and I'm fat so you know I mean business! Everything is homemade to amazing quality and you won't find better Alfredo in the Pittsburgh area probably the world. The fettuccine is handmade to perfection. Try the sundried tomato oil with warm fresh baked bread, or the wedding soup, or the great salads with house dressing. All top notch no skimping! The whole experience can be topped off by the best carrot cake or white chocolate raspberry cake, which I never have room for so we always get it to go and trust me my husband and I share it for 3 days it's that big.  We love pasta too so much,  great place great service!  Also highly recommend their wedding catering, my sister used them for her wedding and they were super organized, clean,  and they had so many compliments on the food.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YDrzNReGuqunaWp4GS9aJg"
  },
  "ct3DE0728IVo42m8OIgitA": {
    "date": "2/21/2017",
    "text": "First time here... got a table fast. Mediocre services... forgot to bring out drinks. Pasta was bland...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ieIBRew44USZgP-XsOXJ4g"
  },
  "2wUJLpM7hihZGCNuzrze-g": {
    "date": "11/19/2016",
    "text": "I LOVE PASTA TOO! I get take out here often and have sat in the restaurant too. We always have great service: quick and friendly. The pasta sauce is the best pasta sauce and I don't even like pasta sauce. I highly recommend it and you can even get a container to go.  Highly recommended",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UcrLRR44yUqlGT8wYOltjA"
  },
  "opEOkmmP8_M0UMEWXwgklg": {
    "date": "12/22/2016",
    "text": "The food is fantastic but the wait is always extreme.  It would be nice if they did call ahead because they have next to no room to wait inside.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hiq56qJ0uYQjYGTyMgl5XQ"
  },
  "NmjJ_8pkhuG6C8QW0Hfg1w": {
    "date": "3/15/2017",
    "text": "Absolutely love this place! They have the best pasta sauce, salad dressing and desserts! On weekends, they get really busy but it's certainly worth the wait! I always have to go here for my birthday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kbt4_quUVoYcj3hs8Av4aw"
  },
  "oZDp9tgJCRnInq6upKja9w": {
    "date": "2/28/2017",
    "text": "Place we never visited. Did not know what we were missing. Had the fetacinni and pizza. Best ever. Go before 4pm. After you will be waiting for table. One of our favorite s now.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tzBVuXKV5RW1krsF9QdPWQ"
  },
  "e6mLq-lmoxlB1Hu1e5zo8g": {
    "date": "6/24/2013",
    "text": "This was my first time here over the weekend, and boy am I happy we stopped!  Our server, Lauren was very attentive and polite and started us off with dipping oil and bread. The oil was super tasty and we devoured the bread!  I went with the Fettuccine Alfredo with chicken and was beyond satisfied with it!  First off, I could not believe the amount of food I got! It was HUGE!  Enough for 3 meals, easy. (YAY! leftovers!)  The pasta itself was done perfect and the Alfredo sauce was so amazingly rich, creamy and cheesy. I was in heaven!   The chicken was moist and had a delicious season that paired perfect with the pasta.  I could only eat about 1/4 of it before I was stuffed... but we saved room to share a cannoli!  The cannoli was flaky and the filling was very rich and it was the perfect finish to our meal.  My fiance got the Calzone, and though I cant speak to the details, she said it was great as well!    I CANNOT wait to go back here, it was a great eating experience all around!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7QNmfWTfGmRBzcwPM3Sy_A",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Cannoli, PERFECT finish to the meal!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7QNmfWTfGmRBzcwPM3Sy_A/o.jpg"
      },
      {
        "img_id": "a3wibP-08bssoYwfxX_0AQ",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Fettuccine Alfredo with chicken.  It was AMAZING!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/a3wibP-08bssoYwfxX_0AQ/o.jpg"
      }
    ],
    "user_id": "f-91SsqRc9q9JpiormX1tw"
  },
  "Htcky5TQ_35fn4mpQ4ZOEg": {
    "date": "8/17/2015",
    "text": "We arrived at 2:45 on Saturday and got seated right away. This was our second visit. The hostess on this day was much, much nicer than the one that greeted us last time.   The lasagna was very good with a portion large enough to feed three. The service was good, we would go back again.  Beware of the hostess that should in no way be dealing face to face with customers..",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xP6dUwqdwu0iI3RatpewHA"
  },
  "0g22ha1xSpByDKr2YmqbuQ": {
    "date": "5/2/2015",
    "text": "Chicken parm is a goto for first timers. Upgrade your side to rigatoni with the vodka sauce and thank me later. Fettuccine Alfredo is as creamy and heavy as it gets, a table of 4 could share a side! Just wish they had the NoWait app or reservations.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Sqp5fnEVMaA1VAo0HMLftA",
        "caption": "Photo of Pasta Too - Bethel Park, PA, United States. Chicken parm n rigatoni with vodka sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Sqp5fnEVMaA1VAo0HMLftA/o.jpg"
      }
    ],
    "user_id": "Ajxmy4WvqnEilZLu4kkvkg"
  },
  "tpOz1AtlCshrhW4CHNrk-w": {
    "date": "1/2/2017",
    "text": "I love their homemade soups!!!! I normally alway do take out because of the wait but I do dining a lot as well. What really annoys me is the take out service. The staff are extremely rude and always give me a hard time about getting an extra packet of bread. I have called and spoke to the owener numerous times but it doesn't improve. If you eat in you can have as much bread as humanly possible but to get an extra packet of bread to go is like pulling your teeth out. I have decreased my ordering and don't use them for events because of this. I know nothing will change and the owner will continue to get business from others but a NICE staff would be nice at the take out and an extra packet of bread.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dAqqCFsChJ_GoDu0GCwlTw"
  },
  "Ttw9muCSIhrPtcN_zwrUSg": {
    "date": "6/26/2016",
    "text": "This joint was PACKED on a Saturday evening! After a 40 minute wait (for 2 people) we knew exactly what we wanted. And man, the other reviews weren't kidding- talk about huge portions. I had the Chicken Parmesan, which was enough for at least 3 meals. I upgraded the side of pasta to the vodka sauce, and it was well worth the upcharge. My mom ordered the grilled chicken salad, *Pittsburgh Style*, which literally could have fed an entire family of 4. Our server Cheryl took great care of us, and everything was really good! Would definitely go back the next time I stray from my diet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vDix29L-XkjAL3pRGaSxcQ"
  },
  "vV4p-lAwVFcicTs6uIv17Q": {
    "date": "7/16/2014",
    "text": "Pasta Too! The Italian restaurant that completely decimated the competition and still blows my taste buds away to this day. Never will I forget the first time I ate here with my family back in the early 90s at the original location off Library Rd before they moved to the newer building a mile or so away.  This is a message to all the haters out there who rated this place so poorly... you don't know what you're talking about. I have never had such good Italian in my life. The waitstaff has always been exceptionally courteous and the portions extremely generous. I never leave hungry.  Sure, the wait times aren't the best, but in my mind, that's the mark of a great restaurant when people are clamoring for a place at the table in order to savor delectable dishes, like the pasta rigatoni, smothered in their signature marinara sauce and topped with their homemade meatballs from heaven, or the baked ziti with cheese that melts in your mouth. The bread and oil is some of the best I've had as well. Seriously, nothing to complain about... at... all!  Also forgot to mention that they make their Bleu Cheese dressing in house daily. So good.  My family is always sure to order gallons of the marinara sauce frozen for future use at the dinner table back home. Since I come from a large family, the sauce is gobbled down in short order.  Please Pasta Too! Don't go out of business. If the crap does hit the fan though, please open source the recipe to your marinara sauce at least so that legacy can live on forever and ever.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "OQ027dJ_YZOv_Nh_ImE3Ug"
  },
  "QW-uvGHS0pGUZznHUv4Gbg": {
    "date": "6/29/2015",
    "text": "PastaToo has been a family favorite location for the past 15 years. We typically do takeout 1-2 times per month and go in for a sit down dining occasionally.   The food is excellent, along with their drink selections and beautiful deserts. Their wait staff are always very friendly, although not always the most attentive.   The only cons are the very long wait times due to its popularity and the hostess isn't usually the most friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QbdMp3irBF5u5Y9IOOC0iQ"
  },
  "NfBZVbfaAYoRYhnwIy860g": {
    "date": "10/3/2017",
    "text": "The food is fabulous, large portions, bring home the doggy bag! Excellent service and reasonably priced!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z5WyHcJ7_pDGZsb0k952yg"
  },
  "PMYDEXuCgM915Yx-2jmybA": {
    "date": "6/7/2015",
    "text": "Portions are huge! Atmosphere is nice! I Drove over an hour to eat here and would do it again. Since I am driving so far I don't like how they won't seat you until all of your party is there. They lost out on prob an additional $50 in sales with drinks and apps because of this.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ZB3S82Bwktd-XuwRFRPTw"
  }
}