{
  "y_nGyP2BAK88tsBOTtu8tA": {
    "date": "5/1/2018",
    "text": "Wasn't sure at first about the hipster vibe but the food and service were excellent. Enjoyed sitting outside people watching and sunshine. The smoked Gouda Mac n cheese was incredible so creamy and delicious. My dining partner had kale Cesar salad that looked delicious full of veggies and cheese crisps. Large beer menu as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6RASmBkHfRNA_dEXBfTeTg"
  },
  "RLX1BXT72YhCUNXaWX7PmQ": {
    "date": "6/25/2018",
    "text": "Good food and beer selection for all types of personalities and diets! And great deals like $9 for select beer/cider and a shot. Also very easy to make a reservation, I came here with a party of 6 and we had many choices for times for a reservation. Hard to find parking though on Highland. The cauliflower app was delicious and we all enjoyed our burgers. I recommend this place for meeting up with friends or happy hour!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "czUV7FX8HxdBJ0wZWbXeQg"
  },
  "f_13FigV4ukGb04qCpt6cQ": {
    "date": "9/22/2017",
    "text": "The place looks very inviting and has a cool interior, in which the bar with one hundred or so beer tabs takes center stage. They also do cocktails which are pretty decent. The food was very disappointing though. The best was the brussels sprouts with bacon and parmesan, while the wings, pork belly sliders and fries all left a lot to be desired. The service was good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PORH5Zu4wAEObMbPwTUFJg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PORH5Zu4wAEObMbPwTUFJg/o.jpg"
      }
    ],
    "user_id": "pKwvq2b36z704LihHAqSyA"
  },
  "L4iLu60pyaGoY7g4q5OEgA": {
    "date": "7/7/2018",
    "text": "Great beer selection, but the food was mediocre and limited. Everything we asked for was either out or something they \"don't do anymore\". We came for brunch and weren't impressed by the brunch menu, and even though it was 30 minutes before the full menu was available they were completely unable to accommodate anything from that menu we asked for.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xG4N5iYqxi-vGrHKT7JQZA"
  },
  "J8cXZzV39YLgiI8Qc3GTKg": {
    "date": "8/4/2018",
    "text": "Took them close to an hour to make two easy appetizers. We never got our food we just up and left. Terrible service as well, our waitress never offered us any complimentary drinks during our long wait. Manager looked like he didn't have any control over the kitchen as they were backed up from larger parties. Bottom line...any place this big with this big of a menu is most likely going to be bad",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D-xLEAn6IzJ676r-XgzRlQ"
  },
  "QhY2LRlt3hEP39rZP2cv7A": {
    "date": "11/12/2017",
    "text": "Let me preface my 3 stars rating by stating the food is delicious for a different audience, but was a bit too rich for me.  I would go here for a happy hour type event for a fun atmosphere and for decadent bar food.  Their brussel sprouts are delicious,  fried with bacon bits, but I am more of a simplistic eater and really appreciate the taste of food without a lot of added sauce/cheese etc.  Otherwise this place has a really fun ambiance!  Of note to the wise: AVOID chipotle parking lot. Did not realize this was a tow away zone, but discovered this to my dismay after dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "by9WgccrFe3DNxUkwJUkOg"
  },
  "oBibTPX7IZn_45-ybYH-UQ": {
    "date": "1/22/2017",
    "text": "Giving Urban Tap a 2 star rating (for now). I know this location is relatively new so maybe it just needs some work.I have gone to the Urban Tap on Carson St multiple times for drinks and maybe ate there once or twice.   The atmosphere inside the Highland Ave location is awesome! It's huge and very industrial. The bar when you walk in the center of everything with giant beer on tap list. Perfect for beer lovers! The wood tables and unique seating I definitely loved!    We went here Saturday night for a friends birthday dinner so we made reservations for 7 and it took us a few extra minutes to get seated, which was fine because we had some drinks at the bar. When we were seated, I ordered a flight of beer which took about 25 minutes to receive (I'm pretty sure the waitress forgot) and others in my group took awhile to receive their drinks as well. For my entree I ordered the hot chicken sandwich which was about 30% chicken and 70% breading. I probably wouldn't order it again and I am not a huge fried chicken person to begin with... just trying something different. Everyone else at my table agreed their meals were just OK.  I will return to this Urban Tap location but probably for drinks only.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v8qrGav5XG2Z-NHRAzGRUQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Cool bar!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/v8qrGav5XG2Z-NHRAzGRUQ/o.jpg"
      },
      {
        "img_id": "fZLkmUBm7T6BqOi-gEwgPQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Beer flights",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fZLkmUBm7T6BqOi-gEwgPQ/o.jpg"
      }
    ],
    "user_id": "1ZPnQs-tdvbX8ROjtnzcEg"
  },
  "CMZRM1oN_KDSySGhi_kNSA": {
    "date": "5/30/2018",
    "text": "I was incredibly surprized by this place, the fried chicken and waffles was one of the best I've had!   The PORK BELLY SLIDERS, aren't sliders at all but they were so delicious!   Only reason it's not 5 stars is I ordered the AVOCADO & EGGS and didn't really enjoy it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cnTb7cgeGkqVDTsCpn6_GQ"
  },
  "JnxucWqCNAzxkY0C8rUhyw": {
    "date": "10/29/2017",
    "text": "This place is huge--I didn't even realize until after finishing my meal that there's an extra dining room behind the restrooms! Their claim to fame is that they have 100 beers on tap--and amazingly, they also have wine on tap--weird. I have to admit, I wondered a bit as I ordered my beer just how many weeks it had been since the last time someone ordered this variety--perhaps one of the problems of having so many on tap--some are bound to go mostly un-drunk. That said, the beer tasted mostly okay, although it did smell pretty weird. Hmm.  Honestly, the menu is what drew me in for lunch in the first place--lots of the dishes looked creative and interesting (curried cauliflower, shrimp banh mi tacos, etc.). Imagine my disappointment when I realized that the food was actually...bland. The pulled pork nachos were perfectly fine, except they had almost no flavor or spice. They really needed some good salsa and guacamole on top--and no, the Tabasco sauce they handed me when I asked didn't help much. The pork egg rolls were edible, but nothing I'd order again. Same for the General Tso's cauliflower--basically just fried bar food.   Anyway, to sum it up, this place is _fine_ and the food is okay, but it's certainly not worth what they're charging for it, and I wouldn't _choose_ to eat it. It'll fill you up in a hurry if you're hungry, but I can't imagine actually wanting to seek it out.   PS: their \"small\" plates are actually enough to feed at least two people!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ZZNOoMQ7WFvFoxDUFw1wg"
  },
  "Hlrp3v7pV7_VkOOf169Qaw": {
    "date": "9/11/2017",
    "text": "Excellent place for brunch! They have a very unique menu with a lot of choices. I got the merguez and pierogi hash, mostly because it had lamb which I loved (a little bit on the undercooked side but safe to eat). The kale and vegetables were on the saltier side but it balanced well with the pierogies. I ate with a group and we also shared some donut holes which I wasn't a big fan of because it was very greasy. Prices are good for the amount and quality you get and there's also a lot of seating so it's good for groups.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7TmCPhseG2kxYMutOQJdsQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7TmCPhseG2kxYMutOQJdsQ/o.jpg"
      }
    ],
    "user_id": "fZI7Cqj3QOnOfcBNGtLWlQ"
  },
  "zLUcY60elAZRFDSL_BVW8Q": {
    "date": "6/19/2018",
    "text": "I hosted a birthday party in their private room for about 35 people and it was absolutely wonderful! The staff were fantastic, so helpful with everything I asked and didn't even have to ask for! They were attentive to my guests and made the event great! The food was fantastic, I would highly recommend it as a venue for an event!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CDds6V_d2MFFpQG6Aqg4Bg"
  },
  "RjYernZH5_vJe23yEWINLQ": {
    "date": "6/16/2017",
    "text": "This is such a fun spot for happy hour specials and a quick bite! Very diverse menu with unique options. I can totally see myself going back until I try every item! They also have 100 beers on tap so it's awesome for a game or meeting with friends. They have this huge screen they pull down for games!! The staff is super friendly and is really good about paying attention to refills and concerns.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RWl_MOMMkxj5XXjc9c0TFQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Pirogies",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RWl_MOMMkxj5XXjc9c0TFQ/o.jpg"
      },
      {
        "img_id": "fflzlM4ggtpYFBMT6qnorA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Urban BLT",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fflzlM4ggtpYFBMT6qnorA/o.jpg"
      },
      {
        "img_id": "wv9gQC5aIXvQ70Ju0M4ihQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Avocado and eggs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wv9gQC5aIXvQ70Ju0M4ihQ/o.jpg"
      }
    ],
    "user_id": "1R7rDFDjsudFFEQLeWRUBQ"
  },
  "Of1amWJfoHLCTj1e73jMTQ": {
    "date": "6/5/2018",
    "text": "Everything about this place is great. Even when it's busy, you can always seem to get in. Beer selection is great, nitro cold brew on tap, and the brunch is incredible. Definitely a hidden gem if you're looking for an alternative to the crowded brunch places around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rc-hG9g0GEDVl-410oK99Q"
  },
  "amP2xWfW0vVijTAcqC36qA": {
    "date": "2/26/2017",
    "text": "I went to Urban Tap late on a Saturday night. I expected the place to be packed, but it's surprisingly spacious inside. A lot of folks stood around the bar, but there were plenty of open tables as well. A bartender greeted me almost immediately after approaching the bar. All the staff members I interacted with were incredibly pleasant! Service was quick and friendly.   If you're looking for details about the beer list on the wall, they have a paper draft menu designed to look like newspaper with full descriptions. With so many unique and local options, I would highly recommend a flight. They are reasonably priced and include four 4oz pours.  Overall, a really good experience. A lot of patrons, but more than enough seating and staff to accommodate. A great place to explore new beer! My favorite find was the Atwater Vanilla Java Porter :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_RxkgWWloHK25NDlDgBq1g",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Draft list on the wall is easy to read. Ask for the printed menu for descriptions!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_RxkgWWloHK25NDlDgBq1g/o.jpg"
      }
    ],
    "user_id": "ut-2gD2FXzKnXmMwYshHNQ"
  },
  "k_izz0-npwtn0K9xLlw46Q": {
    "date": "11/15/2018",
    "text": "The bartenders from new castle are great. Well, the one in the yoga pants is. I love the tater tots but can't stand the music.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-iBmTBhJYMsCu72m0du7eA"
  },
  "x6k70Rfqk2x_lXRv7AqubA": {
    "date": "3/15/2017",
    "text": "I was happy to see something open in this location after Buffalo Blues was gone but sadly this location has nothing on the South Side one.  I've come here a few times, typically just for drinks but have ate here twice. From the presentation to the taste it just doesn't compare. Also, having 100 beers on tap worries me about how often these barrels are circulating so I typically stick to something I know sells well.  You can't go wrong with the Brussel sprouts as an app and I personally enjoy the grilled chicken sandwich, it changes toppings/add ons with each season.   The staff is friendly but it's easy to tell many of them are new, not very knowledgeable on specials or even menu items. More of a management issue I'd guess? Parking here can be an issue but they do offer valet. The location is pretty huge so even during a weekday happy hour it feels slow.   This location still needs to find its footing and I believe they will! But for now it's just a 2 star review for me.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "3VSXGpollr0CAee0_BROtw"
  },
  "XFcZE0MwaadC_ACDNXe5sQ": {
    "date": "4/30/2017",
    "text": "I really want to give the best possible recommendation for having an event at Urban Tap.  I am a person who would, and did, have a baby shower at a bar/pub.  Only regret is not being able to drink all the beers. (Writing this as the pregnant one, not the hostesses.)  Granted most of this was organized without my involvement, but I can say that the weekend-of was really excellent.    The back room is a really nice space and perfect for a private event.  We had 35 people and fit really nicely.  I love the decor back there-- lots of greens, natural light-- very classy.  John was our event coordinator, and my mom had only nice things to say about working with him.  I myself can attest that he seemed to be a perfectionist and did everything he could to make sure things went off perfectly.  The day before, we swung by at lunch time and found that the small menus that had been printed for the event had a typo, and he immediately had them reprinted.  The food and drink were excellent.  We had 4 items from the brunch menu to choose for a sit-down brunch, and before that there were donuts (amazing- must have), fruit, and a bloody mary bar, which was no ordinary bloody mary bar, with not only fancy pickles but charcuterie!  Guests chose from standard breakfast, duck and waffles, banana bread French toast, and shrimp and grits.  Only wish that I had tried all of them but heard they were all good.  In particular, my husband, the pork connoisseur, was thrilled by the Neuske's bacon.  The service was excellent-- shout out to CJ-- and everyone had a great time.  I would highly recommend this place for events/parties.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lzsuPbiE96k7aFnAn6HoCA"
  },
  "9Ox4NFA1uibUw1XjWFHVWg": {
    "date": "3/25/2018",
    "text": "The best local bar,I have been there so many times we just love katy berry,staff so friendly and always good service and atmosphere.Thank you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fTlzaq_6dZWbVGz4znfk3g"
  },
  "hH-HSa7vJov39m1i2coMiQ": {
    "date": "11/11/2017",
    "text": "Although the atmosphere is nice, this was overall a terrible experience. The server was inattentive and seemed annoyed when we asked questions about the menu. When we finally got our food it was mediocre at best- my friend's eggs were cold, and my \"omelet\" was more like a pile of greasy scrambled eggs. My other friend ordered the Benedict and it was on a bagel, which made it nearly impossible to eat. Not worth the stop. The picture is of the \"omelet\" I ordered, which had literally a whole, uncut sausage patty inside....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WJEmFC5Kra9n2UoyBg324Q",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WJEmFC5Kra9n2UoyBg324Q/o.jpg"
      }
    ],
    "user_id": "dfdTjRAuVDG18JBgg9hFXA"
  },
  "whULmOFw9zit9swRO37Mzw": {
    "date": "2/11/2018",
    "text": "Brunch awesomeness- great service! Donut holes are an absolute must! And their pierogies & hash are a yinzer dream!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vzlLOupVFpNgll_TKjdI9Q"
  },
  "VK-_gnDf6kLJ7lejQokjPA": {
    "date": "11/9/2018",
    "text": "The food here was the worst food i ever had. I had shrimp and grint and it tasted aweful; regardless of just having 4 shrimp in it!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RbMcB3yffmqppkIM91VJiQ"
  },
  "kk1qpNQGYb7T_I7xl94mKA": {
    "date": "6/12/2018",
    "text": "This place was delicious. Their donut holes were more like beignets but they were light and doughy and not heavy at all. I got the classic breakfast and a side of Belgium waffles (aka, I got 2 meals). I wasn't able to finish them but that's ok. The sausage I got with the classic breakfast was definitely homemade and wasn't greasy at all. And those Belgium waffles were almost as good as the ones in Belgium itself! Perfectly sweet and a little crispy, just the way I like it. No ice cream on top tho haha",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7WfI1fElUO-mu3VQTi2Mjw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Belgium waffles. So good!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7WfI1fElUO-mu3VQTi2Mjw/o.jpg"
      },
      {
        "img_id": "C3mFQNppqTRH0s-2BfWCHg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Classic breakfast. Very delicous",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C3mFQNppqTRH0s-2BfWCHg/o.jpg"
      },
      {
        "img_id": "Y3nG6waNMuCCq8h4oC9KQg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Donut holes, aka beignets",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Y3nG6waNMuCCq8h4oC9KQg/o.jpg"
      }
    ],
    "user_id": "2PuCGcHnqCSkJZ-VzA3siA"
  },
  "p-O7pt24RXFMmy7J0cgTVw": {
    "date": "5/30/2017",
    "text": "Urban Tap. Delicious. You know how you sometimes come into these environments and you are fooled? Great atmosphere. Cool location. Smartly designed. And then . . . The food is terrible?   Yeah.   NOT HERE.   I looked down at the menu and saw a turkey sandwich with brie. Brie?? I knew something was different here, and I'll tell you what's different . . . A pub with quality quality food. I was very impressed with the food at Urban Tap. You obviously have to get the turkey, bacon, brie, sandwich. It's killer.   I loved the atmosphere here. They have tables that sit right next to an open garage. It's urban designed with plenty of seating. I could sit in there for hours.   If you're in East Liberty and can peel yourself away from Noodlehead for a minute (yeah, you know it's True), check out Urban Tap. It's a bit pricier but worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "m7xREeeHpMC1GEac9f2tZw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Get this turkey, bacon, apricot spread, and brie sandwich. Get it!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m7xREeeHpMC1GEac9f2tZw/o.jpg"
      },
      {
        "img_id": "VP9QwnQ7ifgVj5JZpU70Bw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VP9QwnQ7ifgVj5JZpU70Bw/o.jpg"
      },
      {
        "img_id": "N2YuwHrhU-YJoeEx7LZ8qA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N2YuwHrhU-YJoeEx7LZ8qA/o.jpg"
      }
    ],
    "user_id": "2O_6Wku6xFCGoPTl8TjMWw"
  },
  "mXQTabt-UcvvSemb_uVMzg": {
    "date": "5/24/2017",
    "text": "This was a great find in Shadyside! The atmosphere was beautiful with there wall of over 100 beers on tap! The music played also enhanced our experience! The server was great, and our food was amazing! We shared a burger and a giant pretzel! The giant pretzel was great with a an amazing beer cheese sauce! The burger was great and cooked perfectly! We enjoyed our experience and would highly recommend!   ***neither of us are of age, and could not drink. But like I previously said there beer tap selection was impressive, and I'm sure there drinks were great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wVovnSafkOcLASuV1xgwPQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wVovnSafkOcLASuV1xgwPQ/o.jpg"
      }
    ],
    "user_id": "BxDsaVNeWxc5mNyA1HtSHQ"
  },
  "Jyu9y-rv7YTWEY0890MDuA": {
    "date": "4/7/2018",
    "text": "If I could give 0 Stars I would. The service was absolutely terrible and it wasn't even busy. The waitress never wrote anything down and forgot almost everything. She also forgot one of our orders and then 30 minutes later brought out the wrong order. The food was burnt and dry.   Man do I miss Buffalo Blues",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3bm32T2x1rHZgvp3EmwsaQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. The &amp;#34;Fruit Cup&amp;#34; and you can see the burnt waffles",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3bm32T2x1rHZgvp3EmwsaQ/o.jpg"
      }
    ],
    "user_id": "SnMI0pze7C-7xif724UHFg"
  },
  "nCoEZjz4khmOG-0fuVtCFg": {
    "date": "10/30/2018",
    "text": "The Brussels sprouts small plate is the best thing on the menu. Our waiter split the checks for 8 people and was kind to let us use the table for three hours.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ri9v9ALmJwPS4v2AOq9BUA"
  },
  "a9O1dSC6gOKEq2PEG8simg": {
    "date": "7/20/2017",
    "text": "Urban Tap is a great choice for any beer lover! With 100 beers on tap in all varieties, you can't go wrong. Although their menu is pricey, catch them at happy hours for awesome deals. The atmosphere is unique and fun, and the service in my experience has always been friendly and efficient.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZZPCvYJ4vgKmy5g3QHZ9Wg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. So many beer choices -- and even some wine and cocktails for those not into the brews!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZZPCvYJ4vgKmy5g3QHZ9Wg/o.jpg"
      }
    ],
    "user_id": "LaiylSIbrA3aPvOYtl-J4A"
  },
  "Bo0EPV1FPmeWT2GJzqe_oA": {
    "date": "7/3/2017",
    "text": "100 beers on tap is always a good thing, tho they waste (or not, depending on your POV) a few taps on things like Miller lite and bud light. Lots of food choices, most of which look fresh and taste great.   Avoid the bison burger though - For $16, it's the most expensive sandwich on the menu, but the meat patty is the size of a hockey puck, or maybe slightly smaller. When the group of seven I was with received our food, the bison burger was, by far, the saddest (yet most expensive) meal on the table.   I won't let one bad option on one occasion ruin the review, but I really hope the establishment does something to improve that dish. I would certainly go back, but I won't ever be ordering that again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FKRz94Ehuni4dO04vuw9Uw"
  },
  "dLBHwg3x1ikhjLtQGK0sQg": {
    "date": "2/26/2017",
    "text": "This experience was a potentially bad one turned wonderful! We went for brunch on a Sunday so it was busy as expected but there was a mistake putting our order in so our food didn't come for 45 minutes. The server and the owner stopped at our table multiple times and apologized profusely which was very kind. They also gave us free homemade donuts (which were delicious) and offered us free drinks. They also comp'ed our entire meal which was unexpected. Overall the food was amazing and the service was so nice even after the first mishap",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "L19D5XbQAwJxiI-5pkWfog",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L19D5XbQAwJxiI-5pkWfog/o.jpg"
      }
    ],
    "user_id": "2cxpzqJ7bxyYh7UnyvxVsQ"
  },
  "QP3eNpdCi2slYqHSdwfjQg": {
    "date": "9/16/2018",
    "text": "Went on Friday got seated right away. The only plus of the night. It took 15 minutes to get a waiter and another 10 to get a beer. I ordered the Spinach and Beet salad with Shrimp it came with no beets or Shrimp!  I don't think I will try again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F4H_Arw-A-rYazrN_SoKNA"
  },
  "dZrJkKZ1XA6zRm_8DXQtag": {
    "date": "6/16/2017",
    "text": "I finally made it to Urban Tap and I'm glad I did.  The renovations done inside are great.  They really utilized the space well - lots of room at the bar and plenty of seating for your meals.    I was slightly disappointed that the first two beers I requested, from the menu, were unavailable.  The waiter said they were waiting on the manager to reprint the menu and list only beers available.  I decided not to try for a third beer and instead ordered a glass of wine. During happy hour beer is half off and wine is $2 off per glass.  I believe that the small plates are also half off during happy hour.  Our waiter was very knowledgeable and helped steer me in the direction of the bison burger, which was pretty delicious.  I loved the jalapeno jelly on it mixed with the cheese and bacon.  I'd definitely have it again.  My side dish was the brussels sprouts and they were so tasty. The seasoning was great, and pretty addictive, because I shared with my table and no one could stop eating them.    My one friend ordered the turkey sandwich and said that it was really good, especially with the melted brie.    I look forward to coming back and having a beer or two.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYTpi63Tv_UTjsaTMCZUvg"
  },
  "z2BavyNZOThe0-jwxVBERg": {
    "date": "6/20/2017",
    "text": "Urban Tap is located in Shadyside which is a neighborhood that's on the east end of Pittsburgh. It's known for their upscale shops and boutiques. It is also becoming more popular with millennials moving to the area.   I was in town visiting my sister and brother in law for the weekend and Urban Tap is one of their favorite places to eat so we stopped in Friday afternoon for lunch. It was fairly empty so we're able to get seated right away. It's very spacious with plenty of seating available. One of my favorite details about this place were their stools they have at the bar and also at the long \"picnic\" like tables. They are attached by a metal bar that you're able to swing in and out which makes for easy maneuvering.   They have quite a wide selection of beers on tap that is all listed on the wall behind the bar. You can't miss it as it takes up pretty much the whole wall. The items on their food menu are pretty unique. They have certain items that you won't find at another place.. i.e. Collard Green Eggrolls and Duck and Waffles. I got the Lemongrass Pork Bahn Mi with a side of the herb fries. This is definitely unlike the Bahn Mi that you'd usually get at a regular Vietnamese restaurant but that's to be expected. The pork was nice and tender, and paired with the veggies, it was very flavorful. The only downfall was the bread was a bit too hard for my liking. No big deal though and definitely wouldn't mind coming back the next time I'm in town!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P3nODCYkcrdigwG1x7Jtgg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P3nODCYkcrdigwG1x7Jtgg/o.jpg"
      },
      {
        "img_id": "lZ41TkZurgVK80IUG0NRew",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lZ41TkZurgVK80IUG0NRew/o.jpg"
      },
      {
        "img_id": "rIGE_KfBUR0b-EuqvlyzMg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rIGE_KfBUR0b-EuqvlyzMg/o.jpg"
      }
    ],
    "user_id": "a8msctARpuLzsyOljtMo-Q"
  },
  "pEtpac83LMEJfzOWItibeA": {
    "date": "8/4/2018",
    "text": "Delicious brunch. I got the pierogies and hash which was perfect for morning comfort food. My boyfriend got the huevos rancheros which he also enjoyed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FDcFHfrlliA_syEIlVsDCA"
  },
  "CCb9AQRoTnDfn338nfENDQ": {
    "date": "6/30/2018",
    "text": "I'm watching FIFA World Cup. Good crowd. Your trendy neighborhood hangout. Decent choice of tap beer. Ordered a Small Plate. Was really slow arriving. I could have had 3 beers waiting. It arrived, had one more draft. They are right, small plate, but very tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ckd5oA7Zv75xOeSaUlkl7Q"
  },
  "byfrvFNIcnzJRFDcIjN8nQ": {
    "date": "1/26/2017",
    "text": "So we haven't eaten here yet and plan on going back to try out the amazing food we saw being delivered to nearby tables. Stopped in for a couple of beers and not at all disappointed. They have 99 different pours on tap and the ones we tried were really good. They're not at all shy about offering samples of the brews available. In fact our server was like our very own beer concierge, He was knowledgeable on every beer we questioned. This latest Urban Tap location is fun and a great addition to the neighborhood of South Highland.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "PfHX547ipKarfhOb-gbQ1Q",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Sagutuck Neapolitan Mil-Stout. So good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PfHX547ipKarfhOb-gbQ1Q/o.jpg"
      },
      {
        "img_id": "DJUzdw-R-tov0AU_uhaoiw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Booze menu.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DJUzdw-R-tov0AU_uhaoiw/o.jpg"
      },
      {
        "img_id": "xd3J6nziYdBFLfj97MXPMQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Bar.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xd3J6nziYdBFLfj97MXPMQ/o.jpg"
      }
    ],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "zg83YS3dl8JCp9qsoYa2jg": {
    "date": "6/2/2017",
    "text": "What a great place for happy hour! I stopped in here last Friday with a friend and we were seated right away. After browsing the huge beer menu, we both decided on sour beers. Mine was some sort of melon beer (I can't remember the name) and it was delicious. And our beers were only $3 each - it's too bad we came towards the end of happy hour, otherwise I definitely would have sampled a few more.   We decided to split an appetizer and got the pulled pork nachos. They were HUGE! Easily a meal size portion. The toppings were plentiful and the sauces were really delicious as well, I only wish they had put more of the green sauce on top. My only gripe is that the appetizers and food overall are on the expensive side. They should definitely consider making their happy hour deal a little better foodwise.   Other than that, I'll definitely be back for happy hour again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Hey0hr3K-zcGnV9nGHZA6Q",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. pulled pork nachos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Hey0hr3K-zcGnV9nGHZA6Q/o.jpg"
      }
    ],
    "user_id": "wgTvhNy5-Q1razSWHhWs9w"
  },
  "mPxamdWbdcZXB45thADbVw": {
    "date": "3/19/2018",
    "text": "We go to Urban Tap often and we're NEVER disappointed.  The food is always spot on and the drinks delish.  I have celiac disease so I need to take my gluten free diet very seriously and everyone I've spoken with has been equally serious and been able to make meals for me that I didn't feel like I was missing out on anything.    We were just there on St Patrick's day, 9 of us including 5 kids!!!  It was excellent.  Courtney, our waitress had 3 orders of donut holes in for the kids before we could say Boo and drinks for the adults in hands too.  It was a fun day!   The kids were happy, the adults were happy, how could you go wrong!  This is a place we head to often with the kids, we always feel welcome and never out of place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a9zCmQgJrI8-9-bRPtRLVg"
  },
  "nV2L9XOKLHKsXUD0DV9SfA": {
    "date": "2/8/2017",
    "text": "I legit enjoy Urban Tap.  I've been here twice before and enjoyed my meal both times.  The first time I ordered the Butternut Squash Gnocchi and practically licked the plate clean.  The second time, I wanted to try something new so I went for the Pulled Pork sandwich.  I still think the Gnocchi was better, and would order it again the next time I go.  The atmosphere is definitely trendy. The bar seems massive to me and each time I've gone (one weekend night and one mid-week) there were a crowd of people around it.  I don't drink so I can't speak to what's on the menu, just that they give you a newspaper-looking list of options.  I definitely could see some kinks the restaurant is sorting out, but I never had rude service or even an exhausted server (justifiably so).    They are on the No Wait app, which I liked because this place can become easily and quickly crowded.  If you're passing by Urban Tap, it's worth a stop.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "agGWDhkVvIHaf8w16jLTng"
  },
  "XTFs-Ek0tbthj1CFQ3SfUQ": {
    "date": "5/26/2018",
    "text": "Superb draft selection, being a craft beer fan, I was pleasantly surprised to get that option. The menu was very interesting as well, perhaps I was expecting very basic bar food, but it was a treat! Curry cauliflower, ginger chicken sandwich didn't fail to surprise",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "2E3sU_qh_RMZUkiRT9NlUQ"
  },
  "ylXQ4zoA1rufxbwNqcsQAg": {
    "date": "1/31/2017",
    "text": "We went to Urban Tap last Sunday for brunch. 3 adults and two children, both under 2 years old. Some \"trendy\" non-chain places will give you the side eye because of the kids. Not here though. In fact, the owner stopped by our table several times to make sure we were enjoying everything and to let us know there was a family restroom with a changing table to accommodate our little ones. This was quite refreshing to see this attention paid to the needs of patrons with families. They even have a kids menu!  As for the rest of the experience, I have no complaints there either. We had an order of the donut holes for the table. They are enormous, were just the right temperature, and were not super dense as you might expect considering the size.  Personally, I tried the Chicken on a Biscuit. It was very good. A nice piece of crunchy, boneless fried chicken on a good biscuit covered in sausage gravy and home fries.  Overall, it was a great day out and we will definitely return. Thanks again to all the staff for being so patient and welcoming to us and our kids.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "mKmcm50zTCd8S4KWr-Htow",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Bloody Mary Bar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mKmcm50zTCd8S4KWr-Htow/o.jpg"
      }
    ],
    "user_id": "rhRGDLVEcF1sDXxHSuPwWQ"
  },
  "GERA0gryCwzUgbCOJa0e8Q": {
    "date": "3/15/2017",
    "text": "This is a nice new place with great food and very friendly staff, and an excellent and changing selection of beers and ciders on tap.  The small plates are actually meal size portions.  My meat loving friends absolutely love the wings.  There are not many vegetarian options, but they are very tasty. The Samon poke is delicious.  If you go during happy hour, you can make a meal out of the small plates and get drinks for a great price. Weekend brunches are also great.  The atmosphere is relaxed and happy and friendly. Great place to hang out, grab a drink, watch sport, and get a good meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_KFS7jHFYVbB86Wwdw3k3w"
  },
  "OU4LhDfOmjtV3oNCnaysjw": {
    "date": "2/27/2017",
    "text": "I met my girlfriends here for brunch on a Sunday. The food was amazing! 3 of us got The Benedict which had a generous portion of salmon and another person ordered shrimp and grits which she loved. Service was attentive and friendly, shout out to Bear! Will definitely be returning here for dinner so I can try some of the 150 beers they have on tap!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FDA8VK3WM23Lew-SJJDJoA"
  },
  "8VmKoOsXks2fd7NpVsfFhw": {
    "date": "5/19/2018",
    "text": "The worst service experience I've ever experienced. I have been working in the service industry for ages and never experienced such disgust from a staff as I did at urban tap. I arrived exactly at 2 I didn't know brunch was over at 2pm. However I told the hostess it would just be me and it's at 2pm. I could see if it was 2:05 2:10. Anyways she said do you know what you want I said yes, she proceeded to ask a co worker if I could be seated which I didn't see the big deal it was 2 and there were people who just sat down and haven't ordered yet. The server said she would ask the kitchen then, then the hostess said it's ok you should be fine. I ask the hostess if I could sit at the bar. After being ignored by the bartender who was very rude. I told him I would like the burger on the menu. He said I can't order it's pass two I said I cAme at 2pm the hostess said I could order which she confirm with a server. He gave me the most disrespectful look and said who told you that? With an attitude, which I gave him back an attitude. I repeats what I said to him, he went to ask some guy who was on his phone at the bar, I have no idea who that was but if it was the manager I would say shame on that person. I just walked out, because not only have I gotten the worse reviews from my fellow co workers and friends in the industry I still insisted on trying. I love to try new restaurants and review them and of course post them in Instagram. It was my first time and let me tell you that I will never recommend this place to anyone. I've worked so many restaurants and hotel and we never turn back people at the exact time. If the restaurant closes 10 and people come at 10 we still seat them. Your running a business to exceed your customers expectations whether it be by service or food and to what I have heard you guys lack none. Not only will this be a awesome pre-shift convo at work, this is definitely a reason for me not to recommend Urban Tap!! 0 for me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iB6fePznJ1-sW_S7K3ehIw"
  },
  "SKbGb-QvHZHLNIilmDVOMQ": {
    "date": "1/29/2017",
    "text": "Why does this place need valet parking? Talk about putting a pig in a prom dress. This place serves wings and beer, that's slob food not fine dining. Just park your lazy ass around the corner or take a bus! Stop trying to make these places more highbrow than they are.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bcpVPgbU0t8u0qboKQ_K1A"
  },
  "2o-Loc_E4BMyf9Oh2LyCNg": {
    "date": "9/15/2017",
    "text": "Great beer list and competent service.  But the worst clientele possible.  If you want to meet someone from the Jersey Shore, go here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d5HTnyLNf6pSYv4hKYx7Sw"
  },
  "hzhZkfWc975sGr7cxuT-CQ": {
    "date": "8/13/2017",
    "text": "We came here just as happy hour had ended on a weeknight but enjoyed a wonderful meal and a not overly crowded restaurant (though I'm sure it's packed during HH times). There are 100 beers on tap so it's almost too overwhelming to order, but the waitress was knowledgeable and friendly in helping us decide. I ordered the sesame grilled chicken sandwich which was honestly the best grilled chicken sandwich I have had in a very long time. It tasted fresh and homemade, and the flavor combination of the ginger sesame grilled chicken with the avocado, arugula, roasted red peppers, Sriracha, and grilled pineapple was truly scrumptious! The waitress told us that everything is made fresh to order, and we could tell. I got the house tots on the side and they were adorable-- hash browns cut into blocks (oversized tots, really) that were delicious too. We also tried the hawaiian pork egg rolls and they were just as yummy. Loved the restaurant ambiance and the chairs at the bar swivel and have a retro feel to them. I can't wait to come back and try it again on HH and to come for a brunch meal soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A6hGU4Q2Lgq9pndYjt6pPw"
  },
  "ajK9yXAkWCpGnPuruJZHtA": {
    "date": "8/6/2017",
    "text": "Great beer selection, but can't say the same for the food. My burger was burnt and hard as a rock. Disappointing for a $12-$14 burger. My fiance's burger was burnt too.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rKfWbiQiTlFM0HtxIW4vrA"
  },
  "37Fnvi0PFpS8houzv1NDfA": {
    "date": "12/18/2016",
    "text": "Arriving at 1:57pm, we were told that they would not be seating anyone until 2:30pm as their kitchen needed time to \"transition to the dinner menu.\" In an area where literally right next store is another restaurant, turning away business seems odd (especially only being open a short time). Additionally, we utilized the No Wait app prior to arriving which gave us an estimated time of 7-14 minutes for seating, to then find out it would be 30+ minutes. As a restaurant, I would feel like your customers shouldn't be effected by whatever is happening in the kitchen. We subsequently took our business to the restaurant next store, which had no problem seating us immediately. Disappointing first experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ootBFQ6VZfzC5NQoYuu7rw"
  },
  "Zi88dKULMVR--K6Ro0cBbQ": {
    "date": "12/20/2016",
    "text": "Went to Urban Tap Shadyside for a weeknight happy hour. I checked the website beforehand to find out when happy hour started (4:30-6:30) and what the deals were. The menu online must have been for their Southside location as the prices and deals didn't match. At the Southside location, happy hour is half off appetizers and $2 off most drinks. The Shadyside deal is half off drafts and $2 off appetizers and cocktails. Additionally, the appetizers were in some cases $2 more than their presumably equivalent Southside counterparts. The prices generally deterred me from trying anything on their menu. I hate to pick on the menu more but their expansive (~100 beer) drink menu didn't list any prices! That said everything I ordered was about what you'd expect to pay elsewhere and with the happy hour deal, drafts were a steal! I'll be to order more off their awesome draft menu, and maybe I'll see if those food menu prices are worth it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oZ9J-BxA59HYwYls9ZKbhA"
  },
  "JFtWi0Pq9ca4YGJvsdt2WA": {
    "date": "8/7/2017",
    "text": "The food was pretty good. The decor was very urban and modern. My omlet was pretty bland in taste for brunch. I tried my husband's pierogis which were amazing though. The waitress was very nice, however I would say service was satisfactory. May try this place for dinner next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WtuMdXV82BbE9fLBa3qZ1g"
  },
  "nsi6NCK0iyStcex8ljMhQQ": {
    "date": "8/4/2017",
    "text": "I don't understand the low reviews for this place. I came here for lunch and it was amazing. The food is objectively super good and high quality, especially for the price. The bison burger was not small at all as other people have claimed, and the brussel sprouts were some of the best I've had. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lmtK23f4cg2_luU1REyYSQ"
  },
  "wXQnR4_Y5ToHQ1tFfbAAXQ": {
    "date": "12/10/2016",
    "text": "Went Friday night for drinks. The tap list is extremely impressive, and the bartender offered taster glasses of a few beers that I asked about. Drinks are a bit pricey, but not outrageous. The service was solid overall, and the ambience of the space was very good. Definitely a good addition to the Shadyside area. I will need to go back to try out the food options, but I recall enjoying what they had at the South Side location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4YyGS5IJ1nVUeMm1huv-7w"
  },
  "6vjZqR6c4EJtkwsJhPSSYg": {
    "date": "5/1/2017",
    "text": "Obviously fantastic and reasonably priced beer selection. Beautiful decor and wonderful staff. My only complaint is that the food is a bit pricey for the how much you get. However, their shrimp tacos are one of life's greatest pleasures and I'm dying to hit them up for brunch one of these weekends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tshyzd3CJ04gq1-HCaXb0Q"
  },
  "PP_AA2Y3EGKQDCpVUG0nQw": {
    "date": "2/10/2017",
    "text": "The bison burger is awesome, I added some Tabasco, but I add hot sauce to everything. The collard greens and cornbread side is perfect. A great little portion size of each to have a taste of what would otherwise be sold as two separate sides. I also liked the beer selection and found a Dogfish Flesh and Blood that I have never seen before.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UBS5twwlim116WBpJTRSDw"
  },
  "OJ597_TfjzNp7ylMHaa-Wg": {
    "date": "2/7/2017",
    "text": "Food is delicious and our waitress, Kat was great!  I had the pulled pork sandwich - so much flavor.  Very messy, but worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JnfIoZ5ibr1r2PyEa3RDjw"
  },
  "59djSijQ1OJO6fxVkl_QDA": {
    "date": "1/21/2017",
    "text": "There is a great beer selection at the Urban Tap, but the food is overpriced and not that good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3s2e4gU0sRtGFdNoq7GHbQ"
  },
  "JqBR8ok3YXPT5JDznUYqPA": {
    "date": "12/5/2016",
    "text": "The place just opened and it's very impressive inside- beautiful bar & ambience! The food was delicious, I can't wait to try more menu items! The menu was diverse, but not too big.  We had the short rib entree, and the curried cauliflower (yum!).  They have a huge beer selection with 100 drafts- there's something for everyone.  I was impressed with the service being we were there within the first couple of days upon opening.  Our server was very friendly, attentive, and knowledgable. Also, they have valet parking, which for this block, is amazing!  We will definitely be back very soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P-VsrJXB3OGt3q58s1cu8g"
  },
  "TufWDjh0MkHu6PP9VAZnyg": {
    "date": "1/29/2017",
    "text": "I've tried this restaurant twice, once for Sunday brunch and once for dinner on a Saturday night.  For brunch, we got there shortly after they opened so it wasn't at all busy.  The service was really good, and the food was solid also.  The banana bread french toast was really delicious and more than filling (it's essentially a half of a loaf of banana bread), but seeing as this was after a night out, the carbs were welcome.  The waffle was just a waffle.  Nothing special.  For the price, I wouldn't recommend that particular dish.  For dinner, they use the NoWait app but they also have a reservation request system online, and the two don't seem to work together.  In fact, they never even got our reservation from online until we called three days later.  Not a reliable system.  The service was friendly and attentive, but we were curious to try a beer flight because of the sheer number of drafts on tap, and the waiter was pretty aggressive about telling us not to, that it isn't worth the money for just a taste of beer when you could have a whole glass.  Isn't that the point of a flight?  Whatever, as I didn't want to be shamed, I just ordered a whole glass.  Great beer selection, something for everyone.  The breads and spreads app was really good (even if it does come with Ritz crackers), and the pulled pork sandwich was decent (nothing special, but nothing to complain about).  We also asked about the beer cheese risotto, which sounded good, but the only thing the waiter could say was that the people next to us had it, and then pointed to the empty bowl on their table.  Overall, it was an interesting experience.  I'd go back for the beer if nothing else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1co99pw7jc2ohMap0ISJBQ"
  },
  "i3USG-0zPKqXeeR3gIbR8w": {
    "date": "6/14/2017",
    "text": "When you walk in, you can't help but see the impressive list of their beers on tap. I came with a party of 11 and we got seated in their back room behind the cool 'beer wall'. (Being seated in the back seems to happen if your party size is over 10).  I ordered the smoked turkey sandwich. Oh my soOo good. Our food took awhile, but we also had 11 people.. so yeah. The apricot preserve gave the brie sandwich just enough sweetness in combination with the turkey and bacon. Dang I was surprised, because I wouldn't usually get turkey but I was deciding between the banh mi and that, man I don't regret it.    We were here for a friend's birthday, and it seemed they didn't have any birthday dessert or anything but that is likely due to us having provided a cake.. (Note: there is no cake fee here!) We intended on it being a surprise and our server had brought out the plates at least 5 minutes before he brought out the cake which left our birthday girl in confusion.  Successfully we played it off, and he eventually came out with our cake. We kind of felt that although we were in the back room, that maybe they forgot about us..?!  Judging by the other Yelpers who have came here, I would love to return for their brunch and/or happy hours. (They serve \"duck and waffle\" here?!) And did someone say bloody Mary and mimosa bar...  Food: 5/5 Service: 3.5/5",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A_X3lWsjdRg2bZG9uCrQFg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Weekly Specials",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A_X3lWsjdRg2bZG9uCrQFg/o.jpg"
      },
      {
        "img_id": "Rt6FwFnRqIaj6ekO_yFWWA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Cocktail menu (2/2)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Rt6FwFnRqIaj6ekO_yFWWA/o.jpg"
      },
      {
        "img_id": "4PosnOlmWc9sDX8VZzHHWw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Cocktail menu (1/2)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4PosnOlmWc9sDX8VZzHHWw/o.jpg"
      }
    ],
    "user_id": "E1FJIPr-VRPotG8v6c2kaA"
  },
  "GSrrXzvGakrXooQ19kIyeA": {
    "date": "4/3/2019",
    "text": "Awesome bar with 100 beers on tap! The food menu for brunch is great as well. I will be sure to frequent this establishment when I am in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XHILHzYk1zK-Ay66j6gcZQ"
  },
  "e3JJCOP2yVVcFCfFHvceew": {
    "date": "8/9/2018",
    "text": "This is a child friendly pub.  The macaroni and cheese is really delicious.  The children loved it.    My chicken kale Caesar salad was really heavy on the dressing.  Ask for it on the side.  The fries were outstanding.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wyJ6UV1huG3vH0dodBD3Dg"
  },
  "hp__hYJZ9ajIuXstylL00g": {
    "date": "12/6/2017",
    "text": "Speaking from brunch experience:   Came here twice, both for brunch, and loved it! Both times were on Saturday and seating wasn't a problem. The service is great, there's always someone at the front and our waiter came multiple times but perfectly timed for our questions & requests. She also split the donut holes and mimosa carafe that we had on all our checks!   Brunch has a bit limited of a menu, but the chicken on a biscuit and Benedict were both HUGE portions and pretty good. Not sure if I want to try anything else, but would def get those again. Mimosa carafe was so worth it for 5 people, we had like at least 2 or 3 flutes each, roughly $3 a person! The donut holes were also delicious to share for the table, it came with a coffee chocolately cream yummm.   Good for groups or smaller parties! Would come again and try the drinks on tap.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "eZysUNF2OZq5TxFyEtYsjA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Chicken on a biscuit",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eZysUNF2OZq5TxFyEtYsjA/o.jpg"
      },
      {
        "img_id": "ihIWY9USaozAa7Txpr4hqw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Benedict - on a bagel, little difficult to cut through but salmon and toppings were yummy",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ihIWY9USaozAa7Txpr4hqw/o.jpg"
      }
    ],
    "user_id": "hwpNR2qUDMbyRmhfPnCGyQ"
  },
  "DpsYFk0xmCp4B1oUMkwtdA": {
    "date": "3/23/2018",
    "text": "I was very excited to try the SPICY salmon poke. However, they did not say on the menu it was on crisps which I was taken aback from. I am used to poke bowls. However, my main disappointment was it was not spicy at all! It was sweet! Why call it spicy then? Very disappointed. Also, on each crisp (total of 4), there were barely two small pieces of the salmon. I would say this dish is a rip off.  I also ordered a side of fries and I have to say they were over cooked and hard when you bit into them. Very disappointed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I4E2efXmtjkn2l0I_dlEQg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I4E2efXmtjkn2l0I_dlEQg/o.jpg"
      }
    ],
    "user_id": "Y0nOHL8NDNQHejOODZTWwg"
  },
  "BgE75vqhjGMP1WqaT-cM1A": {
    "date": "10/30/2018",
    "text": "Nice happy hour. Ample room. Large assortment of beers on tap. Feel free to ask for a few samples.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z9jcbf_VBBdgyOiUfHC8iw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z9jcbf_VBBdgyOiUfHC8iw/o.jpg"
      }
    ],
    "user_id": "Inx4NwdxC4o0Ko7CrV0T2Q"
  },
  "pvCniEJErRaAsfyLoWWrFw": {
    "date": "6/26/2018",
    "text": "The food is unique, you can get a bison burger or ~curry cauliflower~ like, what? A little pricey, but probably the only place I'll order roasted brussels sprouts over fries as an appetizer! A good place to grab drinks with friends or brunch",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "-Ds0hzlQwZUukmOwnapaFg"
  },
  "5JfbhaMfQRrlKiqqhPuOyQ": {
    "date": "7/17/2017",
    "text": "I really want to give Urban Tap 3.5 stars. Randomly ended up here for dinner because Mad Mex was closed. Large beer selection which is great and since we went during happy hour my beer was only $2.75. The food is a bit pricey. I got the pulled pork sandwich which was 12$ and the hubby and I split the curried cauliflower which was $16. Both were good but not the best i've ever tasted. The fried pickle on my pulled pork was pretty amazing though.  Staff were super friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ejH75w9l-oosKZEiZEhBnQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Pulled Pork Sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ejH75w9l-oosKZEiZEhBnQ/o.jpg"
      },
      {
        "img_id": "so4R3VKtFaCxFUNvCKw58w",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Curried cauliflower",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/so4R3VKtFaCxFUNvCKw58w/o.jpg"
      }
    ],
    "user_id": "HvDBT2whHCalPX7eWgmrqw"
  },
  "AGIzeqZlY-Ue3i8KaAfAlw": {
    "date": "8/9/2018",
    "text": "Extremely wide selection of beer, almost anyone could find a beer they like, even if they don't like to drink beer! There's also cocktails and wine and great happy hour deals. The small plates are pretty unique also and it isn't just your classic bar food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N657YsSiqLXd-FAGXHB--w"
  },
  "kYFnqOy2p6SxneWqh7vTqQ": {
    "date": "7/1/2018",
    "text": "Everything here desperately lacks seasoning. Bland bland bland. Service is also terrible. Both times I've come in I've had to wait 10-15 minutes before even being acknowledged once sat. Even then, the severs really have no sense of urgency or care to help you it seems. They have a good beer selection but that's about it.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qrVAvNmRBAYsXuqjl7jR3w"
  },
  "M1uEGVwlp-M9OPh6rCtDZw": {
    "date": "2/20/2019",
    "text": "My husband and I live just around the corner -- it took us a while to skip Mad Mex one night and finally try this place, but we're glad we did! We have visited four times and intend to come back more.  We love the atmosphere -- we've been in for two weeknight happy hours and two weekend brunches. We've always sat in the back section, and we loved how chill and relaxed it's seemed. The place is huge, so we've never had to wait, even with a group of 4-6.  Brunch - is absolutely delicious. Husband can't stop ordering the chicken and biscuit, but I've tried both the eggs benedict and the banana bread french toast (mmm). Family and friends have had other items and lauded their deliciousness. The donuts and anglaise sauce are scrumptious. It's not the cheapest brunch option around, but on average it's only a few dollars more per entree than other places, and it comes without the hour long wait and feeling rushed. Completely worth it to us!   We also love the huge selection of half off happy hour drafts. The first time we came, we tried to share the gouda mac and cheese and almost got a divorce because it was soooo delicious that we were ready to fight to the death to hoard as much as possible. The fries are also great -- a huge pile of deliciousness at a hard to beat price.  The service has been quick and friendly -- the last two times we had a waitress named Annie who was phenomenal!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NOOHUcC5GRsewX9svRBCOA"
  },
  "qTZkvBemlnuAko9cqR51cA": {
    "date": "3/9/2019",
    "text": "Went for brunch on a Saturday right when they opened at 11am. Had to wait 45 minutes for food and it wasn't that great, they don't have very many breakfast options. The drinks were bomb though but overpriced. I got a mimosa float for $14 and the carafes were also $14 (only enough for one person)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CJOaZxBRMV7gUDNYevguAw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CJOaZxBRMV7gUDNYevguAw/o.jpg"
      },
      {
        "img_id": "hfKH1CLS9iNGz75Y8HdLtQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hfKH1CLS9iNGz75Y8HdLtQ/o.jpg"
      }
    ],
    "user_id": "GP0NvpGZHFdWx-22OW6Dug"
  },
  "yFByDb25WXIBSrw-pOMDmg": {
    "date": "4/16/2018",
    "text": "So after my last review I was contacted by the wonderful manager (through yelp) and was offered a gluten free compromise.  That is to say, that though the chips of of the pulled pork nachos were usually fried (and thus not gluten friendly) that the Urban tap was more than happy to bake the chips.  Well a few weeks went by and I was talked into going back to the Urban tap.  I decided just to stick to the tacos which i knew were fine (it had been a long day and I didn't want to address the nacho situation).  Well what do you know... the manager found ME!     Just after the tacos came out, I see a shadow approach the table out of the corner of my eye.  It was Chad, the manager, and he was holding a plate of pulled pork nachos with baked chips on the house.  He, and really The Urban Tap, have gone above and beyond in terms of customer service and continued attention to detail.  I was blown away that Chad would remember his suggestion/ offer, unprompted, on a rather busy evening!  One could say: speechless.  The nachos themselves with the baked chips are a little less crisp than the fried chip variant.  That being said the chips still crunch and are delicious with all the same topping goodness. I highly recommend this alteration to any celiac out there.  I have definitely gone back since and may even stop in this evening!  Great place, atmosphere, food and a manager who really cares and is exceptionally friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "42-TPT76zFSrJC9KuRIIXA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. close up of pulled pork nachos with baked chips (i.e. gluten free/ friendly!)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/42-TPT76zFSrJC9KuRIIXA/o.jpg"
      },
      {
        "img_id": "5bLeHUnH7fdX92PUzUa7HQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. pulled pork nachos with baked chips (i.e gluten free/friendly!)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5bLeHUnH7fdX92PUzUa7HQ/o.jpg"
      }
    ],
    "user_id": "O__X_Mr0pHGcG7l1zK7h2g"
  },
  "i3fo1IyXrOXYd9mBdFqYOg": {
    "date": "12/17/2016",
    "text": "I tried this place in the company of friends and colleagues on a Friday afternoon/evening for Happy Hour. I loved the industrial, simplistic decor and ambience. The set up allowed us to have several people in one enclave of a space. And let me tell you, this place is much larger than it looks.   From 4:30-6:30p, only drafts were half off, which included ciders. And small plates were $2 off. The small plates ranged from about $10-15, which I think is rather expensive. Now, you can imagine what the large plates cost. I tried the Beer Cheese Risotto, and it was alright. I added salt for a little more flavor. I also tried the herbed fries which were much better and cheaper ($3). The Strawberry Shortcake was amazingly delicious! It was $10, but I very much enjoyed it. If I were to come here again, it'd be for the drinks and not so much the food. The menu contained items like whole smoked wings (these are not regular wings, ask before ordering!) and steak frites that just weren't my taste.   We had a great time and an awesome waitress who really held our large party down. There were a couple oddities like the chair breaking out of nowhere (no one was hurt) and the holiday wreath randomly falling (because it was taped to the door?????), but what is life without a little randomness?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3o5xCOOlmhUwA1IO_axCUQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Get the pulled pork and be sure to eat it with the cheese &amp;amp; slaw---trust me, it makes the difference!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3o5xCOOlmhUwA1IO_axCUQ/o.jpg"
      }
    ],
    "user_id": "UyXqGEKod-veD6m6Hq0EDw"
  },
  "GxaNLvwk5sFvaSV7G2ccEA": {
    "date": "5/11/2019",
    "text": "I love the large beer selection, and the happy hour is tough to beat! I'm never disappointed coming here for a burger and beers. The poutine and nachos are also very good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6eMr9aD7IeGnhoREx3R1Mw"
  },
  "ORnHJCh9BqoelowzdNp9Zw": {
    "date": "1/3/2019",
    "text": "Love this spot. Huge beer selection and great rolling deals for brewery of the month. Food is always good, I recommend the fish sandwich and almost anything on the brunch menu",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6_tGFy-lHefDEwxMNmz0oQ"
  },
  "kIv_sZhuQSxoI-vDLkKNjw": {
    "date": "3/24/2018",
    "text": "The food and the atmosphere is right, but it just seems a little too pricey for what you get. I like it, I really do... but in a city filled with so many food options and better prices, it's hard to justify making this your next destination unless you happen to be in the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gfpQPBZGwn7KUedz6B9B2A"
  },
  "7goqj8jAJMB7ITCBPrxCWA": {
    "date": "10/8/2018",
    "text": "We sat down for appetizers and drinks and had a good experience. The food was awesome- general tso's cauliflower & cheese curds. Both worth it!!  I ordered a Moscow mule but the ginger beer was flat. Fun atmosphere, I would definitely go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vdq4DWKGC1KZVX91P3xl3Q"
  },
  "pnW4DGtMFa4oq-LAIPZH-A": {
    "date": "6/16/2017",
    "text": "Two of my girlfriends had a joint birthday party at this new(er) location of Urban Tap, and I was excited to check it out! We met up late Saturday afternoon, and I love that one of the birthday girls was able to reserve one of the large tables by the open windows in the front of the restaurant to hang out for several hours. The weather was gorgeous that day, so it was truly the perfect place to be hanging out.  Service was strong! As women came and left the table, our waitress did a good job of catching people when they arrived and making sure they had ordered beverages and food. I split the giant pretzel with my friend. It was soft and warm with a good accompanying beer cheese sauce. Though I wish that I could have enjoyed one of the many beers on tap, I had to stick with non-alcoholic (due to my pregnancy). However, I loved that my waitress was super helpful with my order and had the bar create me a custom fruity beverage. Yum!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "cCke3VtFLtqgzkgYSrSE2g"
  },
  "6GEo_1RzrYB92FPw1UiL1w": {
    "date": "8/12/2017",
    "text": "This location is in Shadyside in Pittsburgh.  This is my go to spot after work.  The bone is great, the music is great, the crowd is great.  Never TOO crowded which is a plus!  The beer selection is always plentiful and the food has been great every time I've eaten here.  The Urban BLT for brunch might very well be THEE BEST BLT I've tasted in Pittsburgh!  It comes with a sunny side up egg... which I personally love... it's kinds cheating, but the sandwich is DELICIOUS! ;-)  I highly suggest this place.  The only downside is parking is limited... I've always found parking within a 3 block radius... but they sometimes have valet service which will help those who don't feel like looking for a space.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GAXsG-DRNZV3vIsGgB3Q6Q",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Beer selection...  WHAO! :-)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GAXsG-DRNZV3vIsGgB3Q6Q/o.jpg"
      },
      {
        "img_id": "EXHHzVy1mZqsMbsWSmJ35Q",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Best BLT in Pittsburgh!?!?!  I think so! ;-)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EXHHzVy1mZqsMbsWSmJ35Q/o.jpg"
      }
    ],
    "user_id": "pfKtcmw2KNloi_ZaelCUBg"
  },
  "j3dft4ne3JqiloDJDSWpAQ": {
    "date": "4/21/2018",
    "text": "Decent brunch in that there was good service and ambiance, but I was not a fan of the food.  Salmon Benedict: bit too salty; couldn't finish. However, my friends were fans of the huevos rancheros and the banana bread French toast.  With the variety of beers on tap, I'm sure this would be an interesting place to get dinner.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "U6fk4kCifFNm34zv_oZQig",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Banana Bread French Toast**",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U6fk4kCifFNm34zv_oZQig/o.jpg"
      },
      {
        "img_id": "RMAU-5bU98r3SLcarCMZrw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Huevos rancheros",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RMAU-5bU98r3SLcarCMZrw/o.jpg"
      },
      {
        "img_id": "N5NX7ASgi_cqUEZ1W3rDOQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Benedict*",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N5NX7ASgi_cqUEZ1W3rDOQ/o.jpg"
      }
    ],
    "user_id": "p6RurvWCPEqR8PP4siwiVA"
  },
  "DhduJq7yQIzMFKwAde9k1A": {
    "date": "6/10/2019",
    "text": "My parents were visiting for the weekend and I wanted to take them somewhere with a variety of options. urban tap has a diverse menu and each item sounds better than the next.  The appetizer pretzel was delicious, and the wings are full sized , quality wings.The dry rub has a Cajun taste to them- I'd recommend getting a sauce. The bean burger was DELICIOUS and huge. Fried Brussel sprouts  were outstanding. My parents absolutely loved the atmosphere, variety of beers and food options. Will definitely be coming back to UT again and again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RSuNk6y4-RZvY_mVkPSTSQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Bean burger and Brussels Sprouts",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RSuNk6y4-RZvY_mVkPSTSQ/o.jpg"
      }
    ],
    "user_id": "vALsmFpFRR95Li9FpobHVQ"
  },
  "Kfhqmj9sgVH6hx5VACsp2g": {
    "date": "4/26/2019",
    "text": "Went here last night with some girls from work and it was a great time and experience. For starters, our waitress Kiersten was awesome. She was super nice, funny, accommodating, and patient. She answered any questions we had and never rushed us, despite us staying for awhile after we finished eating and chatting near close. The food was also amazing. I got the bison burger and it is BIG. I finished it quickly though. It was so juicy and cooked perfectly, with so much flavor thanks to jalapeno cream cheese, thick bacon, and arugula (yum). I got a side of tots and they were huge!!! My coworker got the general Tsos cauliflower and it was amazing!!! When we go back I'll get that for sure. I truly can't WAIT to go back. Such a good find.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EOxmDIA_t5lcBWeYyOv9vw"
  },
  "P8hRXKs5fijWh0M4ksISIA": {
    "date": "9/14/2018",
    "text": "Came here for brunch on Sunday and was pleasantly surprised with their brunch! I had the chicken biscuit, which was a huge piece of fried chicken on a biscuit with sausage gravy, egg, and potatoes. The portion was huge. The fried chicken was nice and crispy and had a nice kick to it. It was a delicious meal and I had enough for leftovers! My friends had the special of the day, which was a potato pancake, brussel sprout hash, benedict and they all enjoyed it as well. The prices are very reasonable too. Overall, a great place to grab brunch in Shadyside. They have tons of different options from sweet to savory, so I know I will be back to try them!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ux_MgT-kwgciGR0uson66g",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Chicken biscuit with special of the day on back!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ux_MgT-kwgciGR0uson66g/o.jpg"
      },
      {
        "img_id": "PQa_pWzMsY4DYJAfjbizVw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Chicken on a biscuit",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PQa_pWzMsY4DYJAfjbizVw/o.jpg"
      }
    ],
    "user_id": "gofnmwo5ptoEnQI47zCBYg"
  },
  "LE0hiu9G2crXgoQsOYgWzQ": {
    "date": "6/29/2019",
    "text": "Always a great vibe at the Shadyside location! The beer selections is amazing, and I'm more of a wine drinker and they have a nice small selection of wines on tap too. We usually sit at the bar, cause it's the best.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NXw6iEDY_4SJtu1zG5kS6w"
  },
  "VncM612xRsU4tK9nYCef7Q": {
    "date": "3/18/2018",
    "text": "Urban tap has a cool atmosphere. The interior design is nice, including the wall design. I went with a group of 14 and they had no issue taking a reservation and organizing table space for us to sit together. It was for 10:30, although by 11:30 the place was filled up so definitely wanna get there early for brunch.   The drinks are really good, with bloody Mary's and 4 fruity mimosas as the options including a flight for all 4. I stuck with a coffee since I was recovering from st Patty's day still.   I ordered the eggs and avocado. I was not a big fan and wouldn't recommend it. It was a bit bland for starters. Also, the avocado was served as two separate halves but I had to slice out the inside which I was not a fan of. A pre-sliced avocado would've been better even though the whole avocado made for a nice display. Most other las enjoyed there's though.   The server was great. She was really sweet and patient. With such a large order it took a while to get the kitchen pumping out the food but that wasn't an issue for us since we expected it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jTyZa4CgGQ6DHe3Souc-Ew",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jTyZa4CgGQ6DHe3Souc-Ew/o.jpg"
      },
      {
        "img_id": "AuB7iynlc9EbgpG3dN6_Xg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AuB7iynlc9EbgpG3dN6_Xg/o.jpg"
      }
    ],
    "user_id": "uOuH6gb4Qcs7FlpRcxOZDg"
  },
  "vv-yx3h0_xf4JbyoAZW1Nw": {
    "date": "3/18/2018",
    "text": "I came here for drinks with a friend on a Friday night. It was reasonably full, but we didn't have much trouble finding seats at the bar.   The bartenders were fantastic! My phone had died on the trip over, and one of them managed to find a phone charger for me :) they were also very helpful in recommending beers to us, the list of 100 on tap was a little overwhelming, but the staff really took their time to explain different options to us and provide us with samples. It's so much fun to go to a place where the staff really seem to enjoy their job  We ended up getting a flight of stouts. They were exactly as described, with \"hints of chocolate\". I also had a wheat beer, purple haze I think, which was quite good.  The crowd is generally young, 20-30s.  4 stars because I haven't tried the food here, but I would definitely go back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-PNfxyrGrxVay7u2YhRt6A",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-PNfxyrGrxVay7u2YhRt6A/o.jpg"
      }
    ],
    "user_id": "YhKdhoEhxD8A7ldxdhPPOw"
  },
  "vxPYtJ3bUS-vNfTecbrt2w": {
    "date": "1/6/2018",
    "text": "This is a new gastropub in the space that used to be Buffalo Bills.  It has been transformed from sports bar to gastropub, but still has enough TVs at the bar if you wanted to watch the games.  The draft selection is immense so it works if you are a beer aficionado.  I came here for lunch so no beer for me.  I had the fish sandwich was good.  Lightly battered and fresh.  Fries were good.  Service was slow, but it was lunch over the holidays so maybe they were just short.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "uPvcmnmK7Ra0sLb2gID86Q",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Fish sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uPvcmnmK7Ra0sLb2gID86Q/o.jpg"
      }
    ],
    "user_id": "VCj__r1jfuZVpnBRrzuTNA"
  },
  "Kdzucv-vUxDGNQK5J7_dEg": {
    "date": "1/20/2019",
    "text": "Came here for brunch and had a great time! Brunch is until 2pm so plenty of time to get it. I got the chicken and biscuit which came with sausage gravy and an egg on top. Instead of the potatoes I subbed the fruit cup for no extra cost and it was great an actual cup of fruit with pineapple blueberries cantaloupe and strawberries. All were good except cantaloupe which was too hard and had some seeds still attached but so much better than 90% of fruit cups which often cost extra! I had a screwdriver which was only $6 and my friend had huevos rancheros which was huge (as was my main!) and had a mimosa that was only $4. All together we each paid less than $20 before top for a huge main (my friend even took a box home which I should have done!) and a cocktail!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9XbTAoX0ZX2rjDwZxGJqKw"
  },
  "Y7qjQdcwxbXctQvst3gd8w": {
    "date": "6/21/2018",
    "text": "I was in Pittsburgh on a business trip and a friend had suggested going to dinner in Shadyside. I'm glad I took him up on his suggestion. Parking is limited. My colleagues and I ended up parking on a side street and walking a couple of blocks until we stumbled upon a restaurant that we good all agree upon.  It was a night of sampling food and drinks. We each had a flight of beer which consisted of 4 selections from over 140 options to choose from. Our waiter was very knowledgeable, making suggestions based on each of our personal preferences. Needless to say, I was very happy with my choices.   Oh and the appetizers! We shared the duck confit chicken wings, general tso's cauliflower (my personal favorite), short rib poutine, and a burrata (cheese) platter. The cauliflower was crispy and had just the right amount of seasoning. It wasn't smothered in sauce. The poutine was a mound full of delight. The short rib was perfectly cooked and was amazing with the fries and the fried egg on top. I'd never had burrata cheese before. I was pleasantly surprised. It was similar to mozzarella it softer and creamy on the inside.  I know what you're thinking. That's s lot of food but the 3 of us made a valiant attempt to eat all of it.   I would definitely come back here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "twiSe8woQa4ilF0spLEZiQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/twiSe8woQa4ilF0spLEZiQ/o.jpg"
      },
      {
        "img_id": "3ZCHY1_hMihmZC5sIzqsCg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3ZCHY1_hMihmZC5sIzqsCg/o.jpg"
      },
      {
        "img_id": "78QEjfEd6NRorT71PuvgFQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/78QEjfEd6NRorT71PuvgFQ/o.jpg"
      }
    ],
    "user_id": "UzORoQ_fU_IOneGWx_wpVw"
  },
  "PllIKPN8EHmL23RXxoFaeg": {
    "date": "2/23/2018",
    "text": "Stopped by here for happy hour today (4:30-6:30) with a few friends and it was a reasonably good time. Our waitress took forever to take our orders and was pretty difficult to flag down most of the time. She was really nice and brought us what we ordered pretty quickly but she was AWOL a lot of the time so that was inconvenient.  Their happy hour special is 1/2 off drafts (they have a pretty big beer list) and $2 off cocktails and appetizers (which is better than nothing but not that great considering a cocktail is still like $7 and appetizers are $10+).  The ribeye sandwich was really delicious and I got a side of fries with it. It was similar to a Philly cheesesteak but it was really tasty.  Banh mi shrimp tacos were meh. I don't know what it was about them but they were just underwhelming and not very good. I don't know how else to describe them.  General Tso's cauliflower was delicious!! If every Chinese American restaurant served this, I would definitely get it over the standard chicken.  Salmon poke was just salmon on what seemed like fried wonton wrappers. The salmon was really fresh and really tasty, but the chips and everything else on top seemed kind of unnecessary and didn't add anything to the dish.  I didn't have the Reuben but she thought it was all right. Nothing special. It looked hella good in the photos though.  Overall, this place isn't really college student budget friendly since my sandwich + beer + cocktail put me back about $24 so I would not come here very often. But the food was okay and they have an extensive beer list and the restaurant itself has a nice environment, looks modern, and is clean.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9kTXrUVxLuJK3mijht_N4w",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Cocktail",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9kTXrUVxLuJK3mijht_N4w/o.jpg"
      },
      {
        "img_id": "zHSoERSwnIYUEqT4F58OZA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Reuben",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zHSoERSwnIYUEqT4F58OZA/o.jpg"
      },
      {
        "img_id": "BK6kWnRJvraAjuPhSHxsJg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. General Tso&amp;#39;s Cauliflower",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BK6kWnRJvraAjuPhSHxsJg/o.jpg"
      }
    ],
    "user_id": "pspJkQgUOap1OjTZVMbdsQ"
  },
  "r5y7Oi9OZ2Clnw5Mk3djGA": {
    "date": "5/19/2018",
    "text": "I'll admit it - I have a love-hate relationship with Urban Tap. On the one hand, I really like their vibe and ambience, but there's a good number of cons that make me give this place 3 stars.  To begin with, the service leaves a lot to be desired. The waitresses are either rude or too busy serving multiple customers. On top of it, they are very pushy when trying to sell you alcohol. I understand that bars make a lot of many off drinks, but you should also accept my decision not to drink alcohol if that's not why I came here.  Having said that, this place can still be perfect for certain occasions. They probably have the best fried chicken and biscuits I have ever had, which makes it a good brunch destination. Otherwise, their other items on the menu are fine, and not too expensive, but will most definitely not blow your mind.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wtOjTo1KZF411-VrhaCo4w",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wtOjTo1KZF411-VrhaCo4w/o.jpg"
      }
    ],
    "user_id": "QmK4mY5lmzpDrnSHzZDEpQ"
  },
  "O7H51FmeRYvRajDl-Zwzig": {
    "date": "11/20/2018",
    "text": "I always forget about how much I love this place. Stopped in last evening for some drinks with a friend. My Cabernet did not disappoint and my friend enjoyed his Moscow Mule. This visit was just for drinks, although I have enjoyed their food menu on previous visits. Nice bar selection of food as well as drinks. They try and add in some seasonal items - I do remember trying their seasonal fall salad last year and it was amazing! Not sure if it got out back on this season. If you're looking for a bite to eat, chill night out, date spot.. this is the place to go for sure. Both locations have not disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Rfy598B1ElBFv8uH4cVLJg"
  },
  "iVc6I3l0oE4BFHFQvJSMDQ": {
    "date": "4/9/2018",
    "text": "Recently visited The Urban Tap for dinner. We got a table immediately, even though they were extremely busy, which was awesome! For an appetizer we order the General Tsos Cauliflower, which was amazing. The portion was very sizable, and so, so delicious! It was very light, but packed a ton of flavor. For my entree I ordered the steak salad, which was ok.  If you are looking for somewhere quiet and chill, this is not the place for you. It was very, very busy. The seating is very close quarters as well. It probably wouldn't be a place I would frequent as it was just too busy for me.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZzZPZyg7uAX5-GFulr6OvQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZzZPZyg7uAX5-GFulr6OvQ/o.jpg"
      },
      {
        "img_id": "hHUnrLrJZV8amaFEnYtjtw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hHUnrLrJZV8amaFEnYtjtw/o.jpg"
      }
    ],
    "user_id": "yBJUEJtyjNc-HD1s-mx3Ag"
  },
  "Z1ULe2QYef9ZsTxNQ3lWIA": {
    "date": "5/20/2019",
    "text": "Lunch Salads are very good but very overpriced. I tried the steak salad and it was amazing but there was literally no lettuce in my box. For an 18 dollar salad I'd expect to get a larger portion... hmmm..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZNxMpeAtEKsH5TmvBZyYJA"
  },
  "gN2XHKOUyJjDcg9BapYIVA": {
    "date": "1/29/2019",
    "text": "Nice staff, really bad management.  Went in a couple of weeks ago for the Tuesday \"half priced burger\" and fantastic beer menu... went in a couple weeks later expecting the same deal only to find the manager decided only the \"tap\" burger was half priced now... after we got our bills...  As a vegetarian this is a really crappy deal. I don't want your meat, Urban Tap.   Also the beer and cocktails don't list prices and I probably wouldn't have ordered another round had I known it was a $10 beer.   Overall the food, and wait staff are very good. But the shoddy business practices have cost them another customer.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QLkpgy1oL52UzLPJxFCLOg"
  },
  "BkaRMEBdbLtJwxzSBdo1Xw": {
    "date": "9/9/2018",
    "text": "Had brunch here today, and it was delicious. I started with an Irish coffee, which was perfect on a rainy day like today. I then had the special, which was latkes with brussel sprouts and panchetta, sour cream, eggs, and hollandaise sauce. It was very crispy and flavorful. Unfortunately, the service was quite slow, and our table went without water for much of the brunch. I am definitely looking forward to going back and trying other brunch items here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vFcLhGJ4dFvgur1uv9m4hA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vFcLhGJ4dFvgur1uv9m4hA/o.jpg"
      },
      {
        "img_id": "WvNiWuHDYFGcdCqcvx1flQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WvNiWuHDYFGcdCqcvx1flQ/o.jpg"
      }
    ],
    "user_id": "iEJAlXOJFbw4lJNx-P2Hpg"
  },
  "2k9zOCMinj9I-NVwSJdk_A": {
    "date": "3/19/2018",
    "text": "Ok. I really liked this place. Casual yet items done excellently. I tried 3 small seafood items and they were all done great.  Reluctantly, I have to give them a 5. Riley is a good host & attentive. Go on Monday's to get half off \"small plates \". If they are this attentive to small stuff- then they really got it going on. I think adding a sweet-sour tamarind sauce to sriracha salmon is brilliant. Why didn't I think of that;) Mussels were slightly gritty but that happens with fresh mussels - so I am good with that.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "BJtlbJfGVvKQlj0FaiU_8Q",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BJtlbJfGVvKQlj0FaiU_8Q/o.jpg"
      },
      {
        "img_id": "C2EcNrj_Qg-Rgb8o74DZoA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C2EcNrj_Qg-Rgb8o74DZoA/o.jpg"
      }
    ],
    "user_id": "mw071rj-CZ7QnIiPzRr1xg"
  },
  "9u0g464-_aOJbqhrUJ9NFQ": {
    "date": "10/1/2018",
    "text": "Yikes. Great beer list, but man, the food is awful. Everything on the menu sounds like it should be delicious, but what you actually get is offensively bland. Nothing is seasoned well and the texture on all of the dishes seemed really off. I'm not sure how you manage to make a tater tot gummy on the inside, but The Urban Tap has cracked the case!  This place is like a more hip version of the Walnut Grill with--and this is saying something--worse food.   Also, you will pay for the privilege of your completely-memorable-for-all-the-wrong-reasons meal. Our app, two mains, and two happy hour drafts topped $60. I would have rather just eaten the $60.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xTQqzDHSx0_yPN33XLg93Q"
  },
  "DdC2nU6ygcawd8tnfMiMMw": {
    "date": "5/23/2017",
    "text": "Great food, wonderful beer selection, creative menu, and good service.   I was interested to see how this Urban Tap compares to their South Side location, and it passed with flying colors.  Just a few suggestions, I didn't see any beer flights. I think they have a good selection of beer to make flights interesting.  Although the vegetarian fare is somewhat limited, at least they had a couple of options. They listed one veggie dish on the menu that is no longer available, and the waitress was a bit embarrassed it has not been removed.   In all, a very good dining experience, maybe next time I'll bump my rating up by a star.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 11,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "ny7IeOQi78GE7HIJitvTbA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Cheese Grits",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ny7IeOQi78GE7HIJitvTbA/o.jpg"
      },
      {
        "img_id": "8G9ZHydrGi8e0-jpuhdq0A",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Muffuletta",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8G9ZHydrGi8e0-jpuhdq0A/o.jpg"
      },
      {
        "img_id": "xnp4aa8Q0pIRkFDX2xrj5g",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Cobb Salad sans bacon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xnp4aa8Q0pIRkFDX2xrj5g/o.jpg"
      }
    ],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "S0zR3tAkEXRi-ARrs02F_w": {
    "date": "9/2/2019",
    "text": "*HIGHLY RECOMMEND* ***4.5/5 Stars***  I've been here so many times (once for dinner, and like 5 times for brunch) and I have to say, I LOVE their brunch. Everything is decently priced and in large portions. They have specialties every so often so you will always find something new each time. However, their dinner is a bit of a let down.  *BRUNCH* Mimosa Flight - 4 mimosa for only like $14, that's a steal. The mimosas tasted like the real fruit, not like the artificial ones. When I ordered it, it came with an original, strawberry, blueberry, and mango. My favorite was the mango and strawberry. Hmmmm so good~  I've had lobster toast, Benedict, chicken and waffles, chicken on biscuits, french toast, and waffles. They are all really good! Portions are huge so I always take half of it back with me. I really don't have much to complain about their brunch except the toast on the lobster toast was a bit too hard for my liking.   *VERDICT* I would go back again and again just for brunch",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UO-XkmsLLYlK8Sw8WLN28w",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Carafe of Mimosa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UO-XkmsLLYlK8Sw8WLN28w/o.jpg"
      },
      {
        "img_id": "RoFvbRQXdSB_hbYwU83gTA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Benedict*",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RoFvbRQXdSB_hbYwU83gTA/o.jpg"
      },
      {
        "img_id": "3MXnmSIlNsTYsNfo-_YKPg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Lobster Avocado Toast special",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3MXnmSIlNsTYsNfo-_YKPg/o.jpg"
      }
    ],
    "user_id": "tvG1daVmZtkOKKaAOMAE0g"
  },
  "03rrbyfcpqsYE_NdUKjFFQ": {
    "date": "6/16/2019",
    "text": "Great place to come for a large variety of beers. I think they have over 100 different beers.   We got the banana bread beer and it was delicious. You could taste the banana bread.   They also offer some food options, but we just came to try out their large selection of brews.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zx5TaYxLXcMRXcx5cy8oUg"
  },
  "yEJCg5yHCp5o8O258d9-Tw": {
    "date": "6/13/2019",
    "text": "First off, it's funny how whenever I try to find a new place to eat (I live in North Oakland), I always end up at a restaurant on this strip. Noodlehead, Mad Mex, Pizza Perfectta, and now the Urban Tap.   I was looking at the menu online and it didn't have the prices listed so thankfully Yelp had more information but still wasn't sure about a few things like how many wings came with an order (5). For the price, I didn't really see it worth it but I can say I did like the flavor of the Buffalo sauce a lot.  Overall, we tried coming for happy hour and barely made it with 5 minutes to go and got a couple drinks half off but that's about it. it's definitely a little more expensive than I thought it would be but you get what you pay for!   The food all had great, balanced flavors and pretty generous portions. Between my boyfriend and I, we ordered the Gen Tso's Cauliflower, plank salmon, fish sandwich w/ Brussels sprouts, fried calamari, and a side of fries (photos to come).  Don't really have anything to complain flavor wise but we definitely way overspent what we meant to for dinner. But I think that's more on us not having complete information when we were looking for it.  Good sized bathrooms, and this place is definitely larger than it looks from the front! Also includes windows near the front if you like people watching while the weather's nice.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ODFAhnDZNnL6cYkag2Fd2w",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ODFAhnDZNnL6cYkag2Fd2w/o.jpg"
      }
    ],
    "user_id": "Sy14CDiDGdGfTB_0uJIcXw"
  },
  "YpQTmIfLFjYTzne4J7xHBA": {
    "date": "9/2/2019",
    "text": "Huge beer menu. They have 100 beers on tap. I opted for Fat Head's Zeus juice which was a Belgian style ale. Lots of different local and craft options.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "SqVUNVeYJblyoUz4e-Fiqw"
  },
  "sG738aeOWIEMDjqENWzVKg": {
    "date": "9/1/2019",
    "text": "Went in for brunch today. We were given the brunch menu and ordered the flight of mimosas. Mimosas were delivered and shortly after the server came back to tell us they were no longer serving brunch.  It was 2:15 and they stopped serving brunch at 2 according to the menu. We'd only been in the restaurant for a few minutes, so the server messed up. We were very hungry and nothing on the lunch menu is appetizing, so we were stuck with flights of mimosas. I chugged my flight quickly and my wife left 3 of the 4 mimosas on her flight (what a waste).   The server should have presented us with the correct menu. Because of his mistake, we left hungry and upset and the restaurant gets this bad review. We won't go back after this experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VIhc2TIt_tImhbJVN8ZBtw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VIhc2TIt_tImhbJVN8ZBtw/o.jpg"
      }
    ],
    "user_id": "VVRLCQGTrHMWatRVeMNNxQ"
  },
  "jI0V3FiTE2rOUTdPxyBvJA": {
    "date": "9/6/2019",
    "text": "This is our go-to spot in the neighborhood for brunch, appetizers, happy hour, and reasonably priced brews. The beer menu is particularly impressive - can't recommend it highly enough! Also, there is some outside seating so sometimes we bring our dog when we come and it works out fine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I2Uxd1MWaBpDpFTjLnB8lA"
  },
  "R7aYbEtvJsJS1W6rh7kULw": {
    "date": "9/4/2019",
    "text": "The urban tap is the perfect place to go for a quick bite or a nice brunch! I love that they have so many beers on tap there's always something new to try especially with the local craft beers! I love it the general tso cauliflower it's my favorite and I get it almost every single time. My boyfriend loves the chicken sandwich! The brunch is also great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PbITp6jES0q7DhBJnyGNAA"
  },
  "wJ5r9ZqpjFmRlxaSwzyk-g": {
    "date": "4/9/2019",
    "text": "My wife and I have been to Urban Tap before and have thoroughly enjoyed it each time.  Parking: Tough in Shady Side! We found some parking just a block away near a church.  Seating: Seated immediately! The one thing I wish is that they would seat you someplace with a little more privacy. When it's busy I get that they just give you what they have. However, on a day like this there was a TON of more private space available.  Service: Server did a great job and provided us with quality service.  Food: The burger saves this one. They make an AWESOME burger! Weirdly enough they actually messed up the pretzel. Pieces of it were cold and it was very apparent that this thing is pulled from a freezer and simply heated up. I guess I shouldn't expect much from a menu item like the pretzel but seems like they shouldn't be able to mess it up!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y84qxs26xHsrhPBjPZgbjw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Pretzel with beer cheese and mustard sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y84qxs26xHsrhPBjPZgbjw/o.jpg"
      },
      {
        "img_id": "RCvD97y4GDsBYIXJLdGHAg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Burger with bacon added!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RCvD97y4GDsBYIXJLdGHAg/o.jpg"
      },
      {
        "img_id": "N1XhdQxQ5uW-1NDukCAbKg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/N1XhdQxQ5uW-1NDukCAbKg/o.jpg"
      }
    ],
    "user_id": "0H_n0mdiBBCfFuLYibod_Q"
  },
  "HJMu6cTQ09M9vxAtkkMowQ": {
    "date": "3/31/2019",
    "text": "Surprise!!  Came in to town to visit a friend for his birthday. The staff were very accommodating in helping us to arrange a surprise dinner for him and about 20 our friends. They sat him and his girlfriend in a section alone, and allowed us to show up whenever and continue to add tables together, eventually taking up an entire section.  So thank you very much to the staff!  As for the food... this is genuinely the best duck I think I have ever had, the skin was crispy and the meat was succulent and juicy. I can not recommend it enough. The Tater tots were very good, but for the price I would expect a larger serving or vice versa.   The Urban Tap is definitely a place that I could see my self returning to the next time I'm in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nBMGOz6colgW7-PpF0FXtA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Tater tots",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nBMGOz6colgW7-PpF0FXtA/o.jpg"
      },
      {
        "img_id": "GYBk2Zo8vcDQYkCsLaPWDQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Front",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GYBk2Zo8vcDQYkCsLaPWDQ/o.jpg"
      },
      {
        "img_id": "lwLz1DS3vxdex9zSOhswmg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Duck Wings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lwLz1DS3vxdex9zSOhswmg/o.jpg"
      }
    ],
    "user_id": "T-ttP6zg6UbbzAJVRcEr-g"
  },
  "f3d3OJOJgQsx_oF4MSUz9g": {
    "date": "2/15/2019",
    "text": "A good option if you are in the area of shadyside and want to grab a drink. The beer/cocktail options are great and there are numerous tv screens if you want to catch a game. Service is good and the staff is on top of things.   I am still not sure why their small plates cost more than if you were ordering a full sandwich with a side. Therefore, you are left without an option of having an appetizer or starter to grab with that great beer or cocktail that you are having. Unless you go for a special like $5 tap burger or get the $5 beer of the month, it's going to be a bit pricer evening for more than the low key casual, hang out with friends or groups vibe that I think the Urban Tap gives off.  Last night I did have the fried green tomato \"small plate\" which I was pleasantly surprised by, but I think i'll continue to stop in here when it's convenient and just stick to grabbing a cocktail or beer there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Pj777i1ITOiaUHFlrZZ7Pw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Pj777i1ITOiaUHFlrZZ7Pw/o.jpg"
      }
    ],
    "user_id": "iOHdpvxNuMwJaer8lZUW9g"
  },
  "RgWzyMPy5pU-QF8H9CtLGA": {
    "date": "5/21/2019",
    "text": "The most uncomfortable bar seats. Ya they look cool but that's it. The swivel and are to far from the bar for anyone who is short. Happy hour is still overpriced.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D9VZAfLWvYXZCB2mZmFs4Q",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Uncomfortable bar stools",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D9VZAfLWvYXZCB2mZmFs4Q/o.jpg"
      }
    ],
    "user_id": "e4V4WN6wSbCWl6BzyGBEuQ"
  },
  "yab4SyOnHMGsRNirdD66ew": {
    "date": "5/7/2019",
    "text": "I've been to Urban Tap a million times and keep coming back for a reason. There's an extensive draft list, seasonal cocktails, and the menu constantly turns over but keeps it's staple options year round.   There are probably 50-100 beers on tab at any point and there's always a wide selection. All cocktails are good and provide a nice option and you can get wine on tap as well and it can be served in a carafe or half carafe which is very good for sharing.   All of the appetizers are good. While you generally can't go wrong with nachos, pretzels, Mac n cheese, or tacos, what is shockingly good is the General Tsos cauliflower. It is lightly breaded and sauces and tastes just like the chicken.   The two burger, fried chicken sandwich, and turkey panini are always delicious and the other sandwiches that are on rotation are always good. I have never ordered an entree, but they are enormous portions and are worth the price. You can't go wrong with any of the sides - the fries are addictive and the brusselsprots are great for lovers and skeptics alike.   Weekday happy hour runs to 6:30 and features half off drafts, $2 off cocktails and appetizers. There are also daily food specials later in the evening and very generous beer and shot specials offered daily at all times.  As for brunch, again all the options are great and you can't go wrong with a more traditional or modern take on a classic breakfast. The perogie hash and chicken and biscuit are both top quality choices. The mimosa flight is fun to split or if you're a Bloody Mary lover, there's a full build your own bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kv3uj1tYwr7sxoDCquc38g"
  },
  "riqaBy42Sxp7aIDa3wrVUw": {
    "date": "9/17/2018",
    "text": "We came from dinner for drinks so I can't comment on the food.  The atmosphere is very loud and lively.  I know they serve food but seems more like a bar that has food VS a restaurant with a bar. Maybe this was because the day of the week we went and that it was past 10, but since we weren't eating it worked for us!     They have 100 beers on tap.  A 100!!!  Now that is impressive to say the least.  We found a few worth drinking and a spot at their huge bar!  Again more of a bar atmosphere as the bar, as stated, is HUGE.  I guess once you walk past it and towards the back you do find an area more suited to dining.  The prices were about on point with the area meaning overpriced.  Service was not bad considering how busy they were.",
    "rating": 3,
    "rated": {
      "funny": 17,
      "useful": 29,
      "cool": 29
    },
    "photos": [
      {
        "img_id": "oM54t1qGYbuKsp4vGuiR2A",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Tap list size is impressive",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oM54t1qGYbuKsp4vGuiR2A/o.jpg"
      },
      {
        "img_id": "UdOm1-CnSBBMAsh9tSo7lg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UdOm1-CnSBBMAsh9tSo7lg/o.jpg"
      }
    ],
    "user_id": "_5fx5gexi9OeZIuukV2gHQ"
  },
  "grssEmdgOdkYkuA8jPbwbg": {
    "date": "7/24/2019",
    "text": "I live close by so my friends and I frequent here quite a bit. When the food is good it's good but otherwise the quality can be a little inconsistent. Like one time I went to brunch and my avocado meal was great but the next time I ordered the same thing my avocado was rotted and eggs rubbery. The beer selection is really good but it always seems like they're out of whatever beer I try to order or I end up with the wrong beer and have to send it back. But other times everything is fine. I really recommend the Mac and cheese, steak sandwich and salad, and poutine fries as well as the mimosa flight!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VnTnSktQR-naIVKLcrg4lQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Steak sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VnTnSktQR-naIVKLcrg4lQ/o.jpg"
      },
      {
        "img_id": "rUexyCdQpK6IB4R79oLbuA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Steak salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rUexyCdQpK6IB4R79oLbuA/o.jpg"
      },
      {
        "img_id": "vBaMKHATU003Z0SIEx9Crw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Donut waffles",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vBaMKHATU003Z0SIEx9Crw/o.jpg"
      }
    ],
    "user_id": "8rvHcy1Og2qWBupTejmq0A"
  },
  "uPtngzR3vSiB4HEYaWBEVQ": {
    "date": "3/23/2019",
    "text": "This is a great place for both food and drinks, alone, in two, or in a group. The waitstaff are very accommodating about dietary requirements. Our group recommends the Jamaican jerk wings, the General Tso's cauliflower, the beer list, and the cocktails. (I really liked the Katy Berry.) The sandwiches are quite large and come with a side. My spinach and chevre salad was delicious but a little one note (maybe get it with a protein; I didn't). Also the roasted Brussels sprouts are delicious, and the tacos are unobjectionable. It's always loud, but due to the quality food and drink, you can see why I gave Urban Tap 5 stars!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SkAFVPqfTUg6yAArCoJNCQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Spinach and chevre salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SkAFVPqfTUg6yAArCoJNCQ/o.jpg"
      },
      {
        "img_id": "HHpw3-OV4lpggrpfGuZ_7g",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Friends!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HHpw3-OV4lpggrpfGuZ_7g/o.jpg"
      },
      {
        "img_id": "yIiRfkFlp0CKZLNWSqI3LA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Katy Berry signature cocktail",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yIiRfkFlp0CKZLNWSqI3LA/o.jpg"
      }
    ],
    "user_id": "6ogYJ0jztqMrxAhhslQnzg"
  },
  "eJROLRh0s-rWvR03rdgrtQ": {
    "date": "2/23/2019",
    "text": "I've enjoyed my multiple visits to the Urban Tap. The space is cool, the beers are cold, and the food is gastropub fare. Service is good--the staff is attentive and pleasant. I also appreciate the different dining atmosphere options available at Urban Tap: you can grab a stool at the bar and watch the Penguins or sit back in the dining room for a date.    At the end of the day, Urban Tap is a good option, but the food just isn't phenomenal. I ordered the mussels on one occasion, and the flavor was good, but they were over-cooked and rubbery. However, I've had some of the more pub food options, such as their burgers and salads, and they've all been good.   My recommendation for Urban Tap is to stick to the classics -- burgers, sandwiches, salads, fried appetizers. Then, grab a beer at the bar and catch a game.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3HR86J_kKOMpS4ad4Lu5yg"
  },
  "nhEY801HkidiEjEqEHg1_A": {
    "date": "11/29/2018",
    "text": "We had a real nice time at this location for a couple late night drinks. First of all it's a big area with a nice bar. Televisions are all around and they had like 100 beers on tap. We were amazed and they had all of them too which we have learned at other bars with a lot of taps that they get kicked a lot. The bartender was busy but she took some time to give us samples to make sure that we got something we liked. We found some good New England Ipas and had a real nice time. The old bar/restaurant that was here before was ok and had good wings but the Urban Tap here now is 10 times better. When we are in the area again we will be stopping by for some drinks and hopefully some food next time!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 16,
      "cool": 17
    },
    "photos": [],
    "user_id": "WO-8BmpIuaJJnzgEU5D42g"
  },
  "ASDGfm9Xku83kU-TxmIx1Q": {
    "date": "5/3/2018",
    "text": "Tonight was my first time at The Urban Tap and I loved it. I had thought about going there numerous times before, but never jumped in.   We arrived around 6:15pm - we were able to get street parking on S. Highland. Once we got into the restaurant- we were offered a table outside, a high top, or a circle booth table. We choose the booth table. The forecast called for rain and I hate high top tables.   Their happy hour runs from 4:30 - 6:30pm, so our waitress asked if we wanted to start with any drinks. My friend ordered the original margarita and I ordered the Katy Berry cocktail (Raspberry absolute vodka) and muled strawberries. Once we ordered our first drinks - we decided to order awesome beer list for the next round. They have 99 beers on tap!   Since it was still before 6:30pm - some of the small plates were half off, so we ordered some appetizers. We ordered the pretzel & the nachos. For our entrees, my friend ordered the general tso cauliflower and I ordered the Mac & cheese.   The only downfall was that all our food came at once! We started with the traditional apps (pretzels n nachos) and then moved to the other entrees. I enjoyed all of the food and would get it again.   Heads up! It does get busy during Pens games, but how I loved the atmosphere!   I also want to give a shoutout to our waitress Kiresten- she was awesome. She was so friendly and got us whatever we needed. She also loves soft pretzels, so we got to talking about twistburgh. I hope that I can request to sit in her section for my next visit.   I will definitely be back to visit The Urban Tap soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2yUTjqFOfsSaY3yGzy_pfg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2yUTjqFOfsSaY3yGzy_pfg/o.jpg"
      },
      {
        "img_id": "vGNstbeVtZqhV-PGsrD3nA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vGNstbeVtZqhV-PGsrD3nA/o.jpg"
      },
      {
        "img_id": "4lW0NQsm_MQomEiu3ec8Hw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4lW0NQsm_MQomEiu3ec8Hw/o.jpg"
      }
    ],
    "user_id": "Lph6pJNcM2Hhrb6_5i3oBw"
  },
  "f4uWoG-TAoTUu7YzZm6zLw": {
    "date": "4/14/2019",
    "text": "Eater beware: their online reservation system doesn't work. I used the link on their website to make a reservation. When I didn't receive a confirmation, I called and was told by the hostess, \"yeah we advise people to not make reservations online because the requests never go through.\" Probably would be a good idea to fix the system or take it off the website if you don't want people to use it.   Anyways, the food: we ordered a the general tsos cauliflower, the Mac n cheese and herbed French fries. The fries were great, some of the best I've had in a while, and the Mac n cheese was slightly crispy on top, creamy underneath (really good). The cauliflower was meh, mostly because it was too hard. The leftovers tasted better the next day because the cauliflower had softened.   Ambience is laid back but nice, beautiful wood throughout with tall ceilings and big windows. I recommend the urban tap, just make sure to call for reservations.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lyeR3IwagroikOiPEbUfqQ"
  },
  "jw6i5-1ZDFCDZuGoc2f8cA": {
    "date": "7/26/2019",
    "text": "Their portion sizes are humongous. Definitely worth it for their price. I got a short rib burger with fries and it was absolutely amazing. I loved every bite of it and would definitely come back again. My friend got a small plate of poutine but even that was pretty large in size. The service was nice as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AAtIcTb2kRy-6Gn1QzK5mw"
  },
  "sqTKYeJ3qM3wy3Ur_2-IAg": {
    "date": "11/26/2017",
    "text": "I'm sorry to say that our experience at Urban Tap Shadyside was the worst of the worst. Two weeks ago a group of five agreed to meet there to watch the Steelers. My husband arrived first and waited five minutes at the front desk but the Host refused to look at him or acknowledge him, so DH went over to a large table and asked the group at the other end if he could sit there and wait for his friends; they said yes.  I arrived next and shortly the other three arrived. The waiter came to the table to help the other group but walked away from us without speaking. My husband got up and asked the host if we could move to a booth that had just been vacated and the Host told him that he wasn't allowed to sit at the booth. When asked why, the Host told him in the most haughty manner that HE made the decisions of who sits where and that we would NOT be served in that bar because he didn't seat us when we came in!  IT'S A BAR for heavens sake! And this guy is acting like it's a five-star restaurant with reservations that need to be made months in advance. He was just a total jagoff. We picked up and went next door to Mad Mex and had a wonderful time running up a large drink and food tab. Never going back to Urban Tap. They hire complete a55hats.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3g_VoaVuXvw9vRX1WN_wRw"
  },
  "vRHJIk5PB026OFbLsv8LqA": {
    "date": "6/17/2018",
    "text": "I ordered the steak salad over here.but It was only 4 small pieces of beef like the tea spoon.that is not worth for $16.never again",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RegvLCW5wKLCLmNGsQeC4w"
  },
  "jN8KMnVdvOHMalzbKMeImQ": {
    "date": "2/5/2017",
    "text": "So we stopped in to check out Urban Tap last night. We had a large group and when we showed up the place was really packed. We were about to leave and then I ran into our server Bear and he really took care of us. He was able to accommodate our large group into a small booth. Bear was on top of everything great server. He remembered everyone's name and drinks. I just wanted to say Thanks again Bear!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ml7slLWbHmxl0RiqVswFlg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ml7slLWbHmxl0RiqVswFlg/o.jpg"
      }
    ],
    "user_id": "TuVVCZsUinqovzv6WmG1ew"
  },
  "S0w7fcxaUD2rOsS-FvIEDQ": {
    "date": "5/22/2018",
    "text": "I was prepared not to love or maybe even like this place. Mostly, because I'm not college-age and the music is bit loud. I'm new to the area and  went because I live on the block.  But, damn! I had the most fantastic steak sandwich I can ever remember eating - and I am picky about my steak sandwiches.  It was thinly sliced Ribeye (still medium pink), topped with yummy melted beer cheese and pickled onion on really good bread.   I took home half the sandwich and it was even better the next day after 45 seconds in the microwave.  I think even the Tots are homemade.  I also want mention that I sat at the bar and the service was excellent.  Good recommendations on beer, friendly and prompt.  I will put this place on my regular rotation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dencaXkb2HMhRppDpOzxNg"
  },
  "w24XRGdHh1UYFA8_Lf5MZw": {
    "date": "2/15/2017",
    "text": "I decided to take a visit to the new Urban Tap location on Highland Avenue with a few friend for dinner recently. Having been to the other location which I felt was a decent experience, we were looking forward to seeing the new venue. Once we entered, we were impressed by the design of the restaurant and the overall environment. It was very welcoming, and very clean, which set a very positive vibe for us. The welcoming staff also were very welcoming, and seated us promptly since they were not that busy this particular evening.   Once we got a chance to look at the menu, there were plenty of options to choose from, and I was impressed by the beer and drink selection. I decided to go with a simple appetizer of the smoked wings, while my friends chose to get the pulled pork sandwich and burger. Personally, I found the wings to be a little tough and under-seasoned, but overall wasn't a bad choice. The sauce (I chose the tangy/mustard BBQ) was alright. My friend who chose the pulled pork sandwich really enjoyed their meal, and from the size of the sandwich I would agree that it was a solid choice. I personally don't like sauerkraut on pulled pork sandwiches, but having tasted a small bite, I thought it was an interesting addition.   While generally our visit could be described as average, unfortunately the positive aspects of our visit were met with some frustrations that left my group slightly dissatisfied. While we had enjoyed the wings and pork sandwich, our other friends burger came without toppings he had requested, and also was with the wrong cheese (which was also one dollar extra). While normally this would not be an issue, they returned the sandwich with a new bun and correct toppings but left it with the original patty. We felt it was a little unusual to return a plate with the same patty but replace everything else. Additionally, for a medium burger, the patty itself was overcooked and definitely overpriced considering the size and quality of the sandwich. Service was slow at times, which they explained was due to the kitchen, however, it was difficult to get the staffs attention for drink refills and questions given there weren't many other patrons there that evening.   Overall, I had an ok time at Urban Tap. I would return if invited by a friend another time, but I would not rank my experience as anything more than alright, and would probably prefer other places with similar options.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "-nF0zsSNCCXb1XHLL5yNAw"
  },
  "QIyhnmgOerTtSw12i4xvug": {
    "date": "10/15/2017",
    "text": "Three stars based solely on the 100(!) beers on tap and the cool layout of the place. But after looking at the closing time online AND on the door, which said 2am, we get there around midnight only to be told last call? At least change one of the times on the door or online to match what it actually is. I was so excited to try this place too. I'd understand if it was a slow night but including my party there was probably 25 people in there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gLj1QC8WIX0_r-SY6HGE_g"
  },
  "il2n5M6ZyVM7eArRAUMjvg": {
    "date": "5/21/2017",
    "text": "A 100 beers on tap this place is a great addition to the neighborhood. Really good brunch spot too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oyCsqlq7UnyZzl9WVcRyqQ"
  },
  "YJtni5rq7hMCgK1Um90PBw": {
    "date": "7/29/2017",
    "text": "Came here on a Sunday afternoon with a party of 11 for a bachelorette party. Hostess refused to seat us (we had not been drinking) and refused to give us an estimate on wait time. Terrible customer service and didn't apologize.  Not the best way to start the day with the bride. None of us will ever be back and we hope you don't go either. Negative stars would be more appropriate.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1_KSumh5IQn_XdWQB8ARAQ"
  },
  "pMi6yhcXfiftUx10IW9ctw": {
    "date": "2/1/2017",
    "text": "Beer selection is great. 100 beers on tap. Had beer and nachos. Happy hour is 1/2 off drafts and $2 off small plates. Got nachos. They are really good. Aside from they are very small for the price $13",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6XajMxdcbiHHlvrD8z_Xlg"
  },
  "VzCdiWFbUXJgOwXFxPBSuA": {
    "date": "3/23/2018",
    "text": "Friendly staff, great atmosphere, and a large variety of drinks. One of my favorites!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VgiJlWj5eYKL6xU2q7dSTQ"
  },
  "7mVxR-KxqEGlEc6mhsZcDg": {
    "date": "3/22/2017",
    "text": "We frequented the South Side location numerous times when we lived in that neighborhood and were happy to see another location in Shady Side open up now that we live in the east end. I prefer the physical space of this location, then in South Side. Just seems like there is more room and it's way less noisy. Came for brunch last week with parents and baby in tow. I had the shrimp & grits, which was so flavorful and rich. Husband got the merguez/pierogi hash, stepdad got the eggs benny, and mom had the tortilla espanola and everyone was a bit of jealous of everyone else's plate. Visually all the dishes were appealing and we'll definitely have to come back to sample more of the brunch menu. Also took advantage of the bloody mary garnish bar, but it was a bit picked over by the time we got there at 1pm on a Sunday, but that's on us. :) The manager is also super nice and very sweet to our baby, who was being a bit of a piss-pot. We ordered a simple scramble egg for her, which they were totally able to do, but she wasn't interested, just milk for her.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ydgusldx4ulZxR1kiFGmnQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ydgusldx4ulZxR1kiFGmnQ/o.jpg"
      },
      {
        "img_id": "HBFMffi7xWUfFAmbdWCbQg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Shrimp &amp;amp; Grits",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HBFMffi7xWUfFAmbdWCbQg/o.jpg"
      }
    ],
    "user_id": "EFfQZFfWWlxZ4ckTJdBLtQ"
  },
  "9KRTfNhhRuniettYL3PwHw": {
    "date": "2/19/2017",
    "text": "The food was savory and delicious. I got the duck and waffles with a side of pepper hash and it hit the spot. They had great atmosphere and were playing some cool music. The mimosas were excellent, didn't get to try any of the beer yet but will have to next time we go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lx0iGs5bKQ0JtzApcYUe-A"
  },
  "z9mpPa-9D8VVQm44sKCQnA": {
    "date": "1/1/2017",
    "text": "So the staff is friendly, the decor and design is good, and the menu looks good but that's about it. Food was ok but came out cold after waiting for 45 minutes when they weren't busy. No one working here knows what they are doing. Everything takes forever and isn't done right. It just lacks most of what you want in a place to hang out, eat or drink. Maybe it's because it's a new place but it's no excuse, not coming backup find out.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gaPKs7Nysh48TqcdZo1e3Q"
  },
  "XH_bHEkHXcRspkyzdvB5rg": {
    "date": "5/19/2017",
    "text": "The Urban Tap hoists a middle finger to PGH. $13 apps are an insult to customers. Who the fsck eats $13 of pretzel or cauliflower? cauliflower: $4/head. You might think you can graze a cow on this, but actually, it's more like ordering a mugging as a side dish.  Frying brussel sprouts is dumb - roast, my good man. The hot chicken is bland - srsly; bring your favorite hot sauce - you'll need it. Your ketchup is portioned into a small cup, just like Europe. Mmmm, bland dill-covered fries.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Ts922suXRW2LW9SBZSo-w"
  },
  "Nn2keIKb93pwR2-OW94Xow": {
    "date": "7/14/2017",
    "text": "Urban Tap tries too hard to be hipster. I took my parents there for brunch after church and they couldn't order with out asking the waitress 50 questions -- most of which she didn't know the answer to. It's a good bar for a variety of beers and I will admit they are the only bar that serves bumbleberry with blueberries in it the way that fat heads does..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n1bVYxUn87yTSAJa_wiCvA"
  },
  "BRkDoPOOEz_79DwRw1XPuA": {
    "date": "12/7/2016",
    "text": "We checked out this new establishment on a Tuesday early evening after work. It was a great experience! Very impressive tap list, and honestly the best beer menu I've seen in terms or organization and description of the options. Lots of good food choices, too. They have the menu categorized in small, medium, and large plates so you get a really good sense of how much food you're ordering, too. The options are more than just bar food; you can get mussels, salmon, etc., as well as burgers. Also a great playlist of music in the background. Servers were kind and very attentive. I suspect it will get totally packed and crazy on a weekend, but for a weeknight dinner it's a great choice!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-uuQ6nRHvnwW42s7C_NUeA"
  },
  "VCM1UZMCrmjuDJmmvipPGg": {
    "date": "1/31/2017",
    "text": "Mom and I came here for brunch after getting our nails done. The spot used to house Buffalo Blues. It's nice to see how they redid the space. I loved the openness of it and the rustic decor. Buffalo Blues always seemed dark and crowded. The staff were very pleasant and welcoming. The food portions were large and very tasty which was nice. Unfortunately our experience this past Saturday was not what we anticipated. Our waitress was a bit ditzy. Mom made it very clear that she is a vegetarian and ordered the shrimp and grits meal and the full omelette (which is made with 5 eggs) filled with spinach, tomato, cheese, and mushrooms. I ordered the avocado meal. We had the donut holes to start which came with blackberry jam and apple cinnamon jam. The donut holes were excellent! A must get when you're there. Then this happened...our waitress brought us two orders of shrimp and grits which included sausage. Additionally she brought a half portion of the omelette (2 eggs) with kale, asparagus, cheese and tomato. When we questioned her on what she brought she seemed confused and tried to convince us that this was what we ordered. When we asked her about the sausage in the shrimp and grits, she claimed that she didn't know. We were pretty upset and made that known. Her response: \"so, will you be content with your meal?\" Um...no we are not content because this isn't what we ordered. Because we were pressed on time, mom settled for the half omelette ($6) and I ate the shrimp and grits. Mind you, everything was tasty. It just was NOT what we ordered. A manager stopped by to check in and we told him how we felt. Our meals were taken off the bill and he gave us free desserts which I thought was great. He handled that situation well, was kind and funny. Honestly, he saved this from being a 1-star review. Unsure if I will return...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Hug1Cwtioq_AsprCogOB0A",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Half an omelette (2 eggs)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Hug1Cwtioq_AsprCogOB0A/o.jpg"
      },
      {
        "img_id": "r35--em-JwSCCL4Eatv4-A",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Donut Holes!!! Yummy!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/r35--em-JwSCCL4Eatv4-A/o.jpg"
      },
      {
        "img_id": "IxaMNLQH3GKgiQ2oN8zK2g",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Shrimp &amp;amp; Grits with scrambled eggs",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IxaMNLQH3GKgiQ2oN8zK2g/o.jpg"
      }
    ],
    "user_id": "BfX5cChtKJZMhWHLB1K1eg"
  },
  "aexUY7rEAZOdzrnhPTyVnA": {
    "date": "2/11/2017",
    "text": "Went in for lunch. Bartender was very, very sweet and accommodating. Beer selection is wonderful, but the food is sub par. Black bean soup was yummy but I got the mushroom tacos and I wasn't impressed. Atmosphere makes up for it though and I will be back for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aPl7Dim9dt_QCf6NPH9kbA"
  },
  "Q5hSjlZPNrJtWfnezpri_w": {
    "date": "1/2/2017",
    "text": "Craft Beer Heaven. 100 beers on tap and really top notch selection. Came in from Las Vegas to visit family over the holidays and ended up making a couple trips here. The Burger was really good, Salmon was cooked perfectly. Brussels sprouts app was really good. Didn't try to wings but they looked very good. Front bar area is really really nice. Wish I could transplant this place back to Vegas, will be here anytime I'm back in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DNqPa732Sx8dPIuBDwGXcw"
  },
  "nSt8_VFUB8YuYehanZPC0w": {
    "date": "2/1/2017",
    "text": "I stopped by last night to check out the draft list, which was awesome. Bartender was inattentive so service was slow, despite it not being very busy. He served my last beer in a glass that had a huge chipped crack through the bottom of it. When I pointed it out, he dumped the remaining half of my drink into a new glass. I told him that I had asked for a replacement in case there was glass in the old one. He set it back on the bar and said, \"there's no glass in there\" over his shoulder as he walked off. Unacceptably poor service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gM1YC0o6okeTTAJBWX2A4g"
  },
  "Elje0MssxaumOMj5BH_9fQ": {
    "date": "7/11/2017",
    "text": "I really enjoyed the atmosphere in here. The service was great and we got our food right away and the wait was not long at all! I HIGHLY recommend the doughnuts as the server was right and there is never any left on the plate when someone orders them. They have a really delicious bloodily Mary bar for brunch and is a great date spot or somewhere to go with the gals.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f00XNRxkRDoawVwI_fE9qQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Brunch: doughnuts",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f00XNRxkRDoawVwI_fE9qQ/o.jpg"
      },
      {
        "img_id": "sGjv3XyokN3IDRtp-swMbQ",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Brunch: chicken waffle, eggs over done, bacon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sGjv3XyokN3IDRtp-swMbQ/o.jpg"
      }
    ],
    "user_id": "umwODX6bt3lLUZ3NsscZdw"
  },
  "eMl_RFQ1kxDSwibsrKAWtQ": {
    "date": "3/6/2017",
    "text": "So many beers on tap, but hard to find anything exciting or hard to get. The goji caipirinha was not balanced, but the gin gin drink was good. Banh mi tacos-not much banh mi flavor, but decent. The duck and waffle- burned duck with bisquick tasting waffle. Cauliflower curry was a way over priced vegetarian dish with a floret of cauliflower, a half a potato and a leaf of kale- it was not even listed under appetizers. My partner was so disappointed with his meal and still hungry-he wanted to go to the kitchen and yell at someone. Not impressed. Not. Even. Satisfied.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WKrzVxoNF5qxLf79sy54Mw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Duck and waffles, cauliflower curry.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WKrzVxoNF5qxLf79sy54Mw/o.jpg"
      }
    ],
    "user_id": "AemcaZdZBVW7sO9KsT3UnA"
  },
  "Sq_fSo0-CnQ6zu2WzFzFmw": {
    "date": "11/25/2017",
    "text": "This just missed the mark. The urban tap came recommended from several other sources but I think the Yelp reviews hit it correctly. It's a very nice facility and the service was good. The food, however, was just okay. It wasn't bad but it wasn't good either. We had the goat cheese and beets. The beets were canned in the whole dish lacked any flavor. The pulled pork nachos we're okay but a little bit on the bland side. The braised short ribs were probably the best dish we had but the polenta was more like goop than polenta. I think the polenta would work well as wood glue. The roasted vegetables and the short ribs themselves we're pretty good though. On the positive side they have a nice selection of beer. I'm out!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WmvHz8S1BqwyfaSKFF4d9g"
  },
  "W8Vk9UZvlWDePiQTQe20Pg": {
    "date": "1/17/2017",
    "text": "Best brussel sprouts I've ever had, perfect texture and flavor. Worth it for that alone.   Crispy tofu was really disappointing though, it's not crispy at all it was completely soft on the outside, was expecting some level of crunchiness.   Beers are fairly priced.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "U0yWqxj_eG0DSpprr2RDKw"
  },
  "LY90kzkA1wQHJYQWJyu6Sg": {
    "date": "2/11/2018",
    "text": "I have been here 3-4 times and will continue to come back for food and drinks! The happy hour deals are excellent, the cocktail and beer list are quality, and the food is surprisingly great for what I thought was mostly a bar--it was a pleasant surprise. Good service, good specials, and good atmosphere. It can get a little crowded on weekend nights but there are other food and drink options right next door. I think it's worth it the wait! Favorite regular menu item is the fried brussel sprouts",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Eo5qBTFYdZJYwvWkCkqBDA",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Eo5qBTFYdZJYwvWkCkqBDA/o.jpg"
      }
    ],
    "user_id": "8A7iQimd42iBhXjiYYLoEw"
  },
  "vpfxYgShuUVCADkH78zTbg": {
    "date": "9/16/2017",
    "text": "Beer beer beer, also really good food. Can be a little too hipster at times, but still a cool place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W2CFANx-AFpKGIJrp0TO6Q",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W2CFANx-AFpKGIJrp0TO6Q/o.jpg"
      }
    ],
    "user_id": "KmQuE_tOFQyq5xVNEDxuiQ"
  },
  "dsv6TVii9RfEwaQybLhBQA": {
    "date": "3/16/2018",
    "text": "I mean, if you like a bar that plays Backstreet Boys, N'Sync, and Spice Girls, then yeah, this bar is right up your shitty alley!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EebIfNcwVcfMpjB0bct_Bw"
  },
  "ClCIqj4h8GsS8KvaN1VUwA": {
    "date": "9/6/2018",
    "text": "I have dined here before, I love it, the food, the ambiance, it is fun and the service is always excellent, the wait staff is also super friendly, prompt and courteous. Tonight they have gone above and beyond; I placed a take out order, I live a block away,  they said it would be 10 to 15m. When I got there, it wasn't ready, they couldn't find it, we figured maybe I called the wrong location (they have a few)  I had my dogs with me, the nicest, kindest guy (I wish I had asked for his name) took my order again and said he would have it done quickly. I was grateful they were going to rush the order, I left, walked my pups a little longer and came back. I handed my credit card to pay, he said not to worry and that it was a priority to take good care of their costumers, and didn't charged me at all, this was not only generous but so classy that I was totally taken by the superb way the situation was handled, I'm beyond grateful for such an amazing gesture that I will always recommend their restaurant over other places. I have a lot of people asking me where to dine, (they are aware that food is my number one hobby)  Thank you Urban Tap for your outstanding, beyond parallel service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JoHpCbfMoxPDjeCRMzOSWg"
  },
  "VxbI0fSxz5kVO-mOfAcAoA": {
    "date": "5/14/2017",
    "text": "Admittedly, I don't remember if I've ever stepped foot in the Southside location, but the Shady location is the best! I'm a sucker for a fabulous aesthetic and Urban Tap knocks it out of the park. I've only come for brunch, but all three instances have made it my favorite brunch spot. I mean, a great bloody bar and a mimosa flight??? Who can resist that? Though just a tad pricy, I think the cost is right for the quality of the food and drink that you get. I think it's hard to have a bad experience at any place that blares Louis Armstrong radio.   Go for brunch. Get the avocado and eggs!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t3FKu7xMv6UkyGegAewWCw"
  },
  "hqS7tgBHftRzHPRWaO70Iw": {
    "date": "3/21/2018",
    "text": "Stopped into this Urban Tap location on a whim having peeped the extensive draft list through the window, and I had the MOST delightful time. I sat at the bar and was promptly handed a list of 100 drafts which featured plenty of every style, and not too many light domestics taking up space.  The two bartenders working both went above and beyond during my visit. They offered me plentiful beer samples when I had a hard time choosing a drink, were SUPER knowledgeable about the menu and seemed genuinely enthusiastic about the food when answering my questions. I felt so welcome. Can't wait to return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IPoM6kNPLhnHAHxoIgIthw"
  },
  "Da4fMOrY9UP1Zd_421JomQ": {
    "date": "3/18/2018",
    "text": "This place is nasty. Waited exactly an hour for food - appetizer came out at the same time as our entrees - which were just okay. There was actual shit on the floor in the bathroom. I'm so annoyed and disgusted.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOPdyyX4k0xO24W-FhiFKw"
  },
  "0SC-SHni6-MCTObiUQw-PQ": {
    "date": "1/13/2017",
    "text": "I came here for lunch with some coworkers and we had a great time. The restaurant is gorgeous, really modern with tons of seating. We started off with the pretzel and bier cheese risotto which was INCREDIBLE. I highly recommend. I got the fried chicken sandwich as my lunch with a side of Brussels sprouts. I thought that both of these were really heavy on the oil/butter. Otherwise, they were good- but the grease was a little overwhelming and made my stomach hurt. Although my experience for lunch wasn't the greatest, I would def come back again to try some other items.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "cli6jxL1CTVPtoW38pse5g": {
    "date": "5/22/2017",
    "text": "We held a graduation dinner for 6 students and their families (35 total) at the Urban Tap and could not have been happier with the hospitality and food! The service and responsiveness of the Manager (John Yakopcic) and the staff helped to make this graduation party incredibly special for my son and his friends! He worked with us to select a set of menu items for our guests to choose, and printed cards for the event to make individual ordering easy.   All the families commented on how perfect Urban Tap's space is for parties and how much they enjoyed the food.   This is the third event I have held there, the prior ones being smaller business dinners with 10 and 17 guests.  The food has always been excellent, no matter what the party size.  And in addition, there are 100 craft brews on tap ...  'nuf said.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O15mWqNMJaxberWjXC6G_w"
  },
  "3LbXoFehsttUD7EEzdsUDQ": {
    "date": "1/10/2018",
    "text": "Amazing food! I got the pork belly sliders, goat cheese fritters, and pulled pork nachos to share with friends and they were all delicious. They also have 100 beers on tap! Great service thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dHuNQlAHuXCbP8tR5ysOiQ"
  },
  "zgJBvFZCbBifHinPjNFMnw": {
    "date": "3/10/2017",
    "text": "Our friends brought us here because they know of my love for craft beer.    As we drove up S Highland I was reminiscing about Buffalo Blues and Oh Yeah next door.    Turns out that the Urban Tap is in the old Buffalo Blues location.  But Oh Yeah is gone.   :(  This place has a very industrial and hipstery feel to it.   When you walk in you are greeted by the giant board with all 100 draft beers listed on it.   This was the highlight of my visit.  At first glance at the menu I was slightly off-put by the prices, but it's fitting considering how this neighborhood has changed I guess.  I got the pulled pork sandwich and it was pretty decent, but wasn't anything to really rant and rave about.    The beer selection and atmosphere are spot on.  The food was okay from what I ate.   Prices are a just a touch higher than what I'm used to.  But the service was pretty sad.     Since it's still a pretty new place, I will be back again in a few months to see if they get their issues figured out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_c_qAv00T9RIkYudBCy3NQ"
  },
  "MD07HdH2SK3WIyNL0jMbPw": {
    "date": "12/1/2016",
    "text": "We came to urban tap two nights after their opening. The environment was exactly what you would hope for dinner and drinks with friends. We were welcomed with friendly faces and the food followed suit. Definitely order the salmon poke and shrimp tacos. They could definitely experiment a little bit with their mixology but over all a great experience.  We will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "03yF6e_nbLDFyJc3np7sBg",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States. Great night out with friends! Loving the shrimp tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/03yF6e_nbLDFyJc3np7sBg/o.jpg"
      }
    ],
    "user_id": "0XbmD3DdIJ41aIi62LihHw"
  },
  "xMQ79fvkFaSg18QJcIkSPg": {
    "date": "5/4/2017",
    "text": "Excellent beer selection. Had great waitstaff very attentive and thought it was raise my price. I love the sample platter of the beers. Have only tried a few appetizers like the pretzels and grilled brussels sprouts. Both are very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q5-SpR_B14Qm5u6ymU9OFw",
        "caption": "Photo of The Urban Tap - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q5-SpR_B14Qm5u6ymU9OFw/o.jpg"
      }
    ],
    "user_id": "SDAaf4534L47GRfGmtTnUw"
  },
  "QYN2pb4M9w-cBxBDnpOwXQ": {
    "date": "11/7/2017",
    "text": "I've been here for dinner and brunch and I have to say the brunch is pretty amazing. Usually there is a huge wait at restaurants during brunch hours but Urban Tap is big enough where you will get seated super fast despite the crowd. Great location, easy seating, get service! Place is also great for vegetarians as well! I got the avocado and eggs and it was delicious! Highly recommend for brunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tVhfgl23YF4d-aMFWhLRNw"
  },
  "OOiQ2ioQjstxUPPdYbuDvg": {
    "date": "6/12/2017",
    "text": "We had a good time and good service.  The brussel sprouts were the best.  My Banh Mi shrimp tacos were just OK, shrimp was overcooked and didn't have a lot of flavor.  Everyone enjoyed there meal and they have a few beers on tap (150).",
    "rating": 3,
    "rated": {
      "funny": 8,
      "useful": 13,
      "cool": 13
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "S-LRKh9qYkCPZ7YTspalQQ": {
    "date": "10/28/2017",
    "text": "This was a weird brunch. Truly trying too hard with baked avocado (who does that?) and salsa with black eyed peas over red potatoes that were too big and not crispy as promised because of the odd salsa. Yikes! I wish these places would just do simple well instead of trying to be fancy when it's just not necessary. My husband's corn beef hash just looked...tired. He said it was ok, and his brother got the banana bread French toast. Just trying way too hard. And our waiter was very weird and not welcoming at all. We were just something to get done. I usually appreciate this place for being so close and open late with friendly staff and exceptional bar food. I won't be back for brunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S9SVKOcVDc8E9LoeFWBJIg"
  }
}