{
  "lbrK0IP0Z_8vzL4xkh330g": {
    "date": "7/22/2018",
    "text": "Great location but the food is piss poor.  You might get a better burrito at Taco Bell than at this joint.  When the rice tastes better than your burrito that is also another problem.  Save yourself and go to mad mex.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m9-g8ci6uRc-zEmiEwpmbA"
  },
  "APFHA45EM8YbboUbkWG1EQ": {
    "date": "8/15/2017",
    "text": "Cheap beer in plastic cups and the tables are sticky. There are plenty of other places to choose around this area.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5LU1Ek35dCoOa6_EYeLXTA"
  },
  "JdCIbkNHwIZE2dnOetX_Zg": {
    "date": "1/1/2018",
    "text": "Worst new years experience I've had. Super basic open bar, no coat rack, a tray of cold ground beef as an \"appetizer\" and trying to make a taco while standing is almost impossible. There was no description anywhere about what drinks were included or not. The bar closed at 1 when the ticket said it would be open until 2. The bathrooms were not ready for 400 people and every worker we interacted with was extreamly rude. Thanks for ruining our friends first visit to Pittsburgh.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s3TPOmeBirA9ex2l013tuA"
  },
  "3x049Ty29q3V8nWUPqF0Iw": {
    "date": "10/14/2017",
    "text": "This place is so disorganized and filthy. People who work there look drunk and like they are going to throw up. I ordered a water and nachos. The water took 20 minutes, I asked for a refill and it never came in the hour I sat and waited. My nachos were given to a different table and took an hour for me to get. I recommend to go anywhere else. Waste of time and surprised they are still serving by the stadium.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dtfVyY5lO0KrxYxrjT0YSA"
  },
  "XcI4zTLWquqRjbzFrVldXg": {
    "date": "8/24/2017",
    "text": "I've been here a few times before and it was okay. Service was pretty lousy and the food was meh. Went back today with some coworkers for lunch. I was a little worried due to all of the bad reviews. We were seated promptly and service was actually very good. Our waitress was attentive and took our orders quickly. We didn't have to wait too long for our food to come out. The food was a little better than I remembered, nothing special. I got the mexican cobb salad. The avocado in it was a little strange, I can't really pinpoint why. The jalapeno ranch was tasty. All and all I would come back but not as a first choice. Just felt like I should help redeem this place!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xH3NAUbz0FIkgENPsQIIHw"
  },
  "4HffPta-FUR8KlI1jEJaBQ": {
    "date": "9/22/2017",
    "text": "We were seated by 1215, waitress took our drink order and returned quickly with drinks.  She didn't check on us again until 1250.  Told us 'food will be out in a minute'.  We could see the food sitting at the pickup area ready for her to pick them up.   She walked by several times and didn't get them.  We walked out at 1257.  She never came to refill our drinks Despite walking past our table a dozen times. Go somewhere else for tacos or to Slice on Broadway for quick easy service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-kE5zO-54cQUmcG6zvfZtA"
  },
  "dkTVYYBXb-QGcoYgukmItw": {
    "date": "6/15/2016",
    "text": "First of all, I love Mexican food and Mexican restaurants - authentic or generic. The vibe in any Mexican restaurant is always fun. I've been to the location in the Southside before a pens game and had a pretty good time!  I was anxious to get my hands on another lime yinzerita(lime margarita with a corona beer bottle added in the mix). However, we were seated within seconds of arriving but we sat and waited at our table for 10 minutes with no service. Three waitresses walked past our table many times and they made many glances but no one ended up acknowledging us. Total bummer. We decided to leave. Maybe another time, maybe not. Would love to recommend but do not at this time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KV50BAZ04f0lW7jSTpspTg"
  },
  "S0uWpSy_1JW_n6QfuMN1nA": {
    "date": "7/5/2016",
    "text": "We came for lunch on Memorial Day and had an excellent lunch outside.  It wasn't busy but wasn't dead by any means which I'm sure changes on game days.  We shared chips and guac, I had their pinot grigio and Bobby had a Dos XX.  Chips were fresh and guac was super flavorful.    I ordered their Mexican cobb salad with the chipotle ranch and Bobby had the chicken burrito.  Honestly our food was really good and it was shocking because we have been to the Shadyside location twice and both times, the food was absolutely awful.  We will only eat at this location from now on.  Service was great and we had no complaints.  I assume the lack of consistent service mentioned in other reviews is because they are still new and establishing a routine in such a busy area.  Hopefully they get it together, however we had no issues.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NIJWrUAz7-9IEqwZnGBT9g"
  },
  "TN4e3o7EpnaZ0G7DWZEMHw": {
    "date": "5/29/2018",
    "text": "I love Mexican food but this was very sad. The waitress completely forgot to put in our chips and queso and blamed the kitchen. Our tacos came out and the 2 that I ordered weren't even the same (which is ordered 2 of the same tacos). My fiance ordered $2.50 taco Tuesday tacos. He ordered 3 and got 2. The bonus: he was not supposed to get rice and beans but he did. The beans were terrible. The rice was good. The chips and queso finally came  out right before our food. We got the 3rd taco they forgot and they made 2 instead of 1. Okay, cool, we got extra tacos but he can't eat tomatoes which he told the waitress when she took our order. It was a cluster. $52 later... I'm sorely disappointed in this place. It's not hard to make some tacos... not sure if it was her first day but it was bad. I tipped her well but don't feel bad for posting how terrible the restaurant was. Think long and hard about this place... I wouldn't waste my money here ever again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1w7twSdcfSNAlSSsuVgArA"
  },
  "Ka980Rqly7inp2rhxK2G5g": {
    "date": "4/4/2017",
    "text": "Hooooo boy. Let me start with the end: we left without offering to pay a dime. I don't remember the last time I tipped less than 20 percent. I have never, ever been driven to walking out of a place without paying. What a shitty experience. It wasn't even a mess there or particularly busy, or understaffed, which is the most puzzling part of all this. Here is a list of stuff that happened on our visit. Most of them individually are totally forgivable, all of them experienced in one visit is just not great guys. Not great! Sad!  -11:40 we arrived and ordered -drinks take so long we contemplate asking the bar for them. Coworker does not get drink ordered but no fuss is made because she is happy with water. -dips come, wrong queso given to us. It's fine we are happy with the regular queso. Mistakes happen sometimes. -order more drinks. They do not come and after 25 minutes we ask the bar for them. They've apparently been sitting there waiting for the ever-absent waitress to bring them to us. -when seated at the bar, I overhear another patron saying \"I think they forgot my tacos.\" I feel you, my friend. They seem to have forgotten our tacos as well. Coworkers tell me they watched two people waiting to be seated storm off because the hostess is MIA. -table of 5 that arrived 15 minutes later than us have been served their tacos and are given their checks. They leave.  -waitress doesn't check on us until around about 12:50 when she tells us for the very first time that the kitchen is \"backed up\" does not offer any other details to help us understand or sympathize.  -we agree we are going to get the check and leave regardless of what happens by 1 pm. -1pm my coworker stands at the podium waiting for the hostess so he can discuss our situation. We have 1 hour for lunch and have been here going on 1 hour and 20 minutes. She does not acknowledge him and stares at the podium.  -I stand up with my arms crossed and say, \"Ok, that's enough. We are leaving.\" Hostess looks at me clueless and says \"What's wrong?\" Like she hasn't been here the last hour and a half and isn't aware of what is going on in the restaurant she is supposed to be hosting. I pointed out the table of five we watched arrive, get served and leave before we got our food and could barely get served drinks. -we stand and stare at her waiting for some type of reaction, or acknowledgment and get none so we leave.   It's like everyone here was really stumped by how tacos work. Unfortunate for a taco place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "JD_5FylNZsnW813pLlzkBw"
  },
  "ONMcQcOExx_bPM4JB2OMPg": {
    "date": "4/29/2017",
    "text": "The serving sizes are laughable - two tiny tins of rice and beans to accompany 3 sad, small \"specialty\" tacos. I laughed when I saw the plate. Salad was mostly lettuce. Also- service was super slow. No free chips! Not to mention they tried to take away my dad's food AS he was eating it. Avoid!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RVYHEWFLoN64UaSXpMewTw"
  },
  "6u40dphbq6GuVUDbOKzzvA": {
    "date": "5/26/2017",
    "text": "I have Pirates' season tickets, and this is my go-to for per game food and drinks. The staff is great and I've never had a bad meal here. I highly recommend stopping by!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6bk9v-J1Er5NW4ng6Md-qQ"
  },
  "EuHOeHOu3mA5sG0CUfXkew": {
    "date": "4/26/2018",
    "text": "The food here is really disappointing. Their chicken soup was tasteless, as was the guacamole. I had to put hot sauce and salt in both just to get some taste.i don't know how they killed the taste of avocado. Amazingly for a Mexican restaurant, the tortilla chips were the worst part of the meal. They had no salt on them at all and tasted like they'd been fried in really old oil. I'd never eat here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yn9eC8H0-eRkWjrs2fDhqw"
  },
  "9wtfphtzeOwm_iYZ_o4fxA": {
    "date": "10/22/2017",
    "text": "Worst Mexican food I've ever had. Seriously, do not waste your money here. You are welcome!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rBWQQSuko33VLVR4ZbYtmw"
  },
  "Dg1_bt_3o2Hj-kXMU2vcng": {
    "date": "10/9/2017",
    "text": "I had a few hours to kill on the North Shore before getting a ride to the airport and had a hankering for Mexican. Melissa, the bartender, was great, and the Camerones de Chili Lima (shrimp tacos) were awesome!!! Great stop on game day (or the next day in my case). Highly recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jlPpnrVSQLqDZCVpyRGGKw"
  },
  "9c4y9j01HdCy0wcUcGLbSw": {
    "date": "6/9/2017",
    "text": "Service extremely slow for time of day, (roughly 1pm). Food decent but not exceptional. Price average for the area. Generally not impressed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v8VyBrpJaP8z4mQcSPeNWg"
  },
  "PiD6NRiq4gGCZQZxa77UDQ": {
    "date": "5/11/2017",
    "text": "Got some steak tacos from Steel Cactus today. I got them through UberEATS and the service was spectacular. In less than a half hour I received my steak tacos with rice and beans guacamole and chips. The guacamole was OK nothing great nothing horrible. The steak tacos were probably some of the worst tacos I've ever had. I have no idea what the meat was but it was definitely no kind of steak. It was very mushy and you could squeeze it flat between your fingers. It literally looked and probably tasted like Alpo. Never again Steel Cactus!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WrZCqga8_ZMTZSYkhwC2ow"
  },
  "lIbqJZYn44xXkmgZEeueGw": {
    "date": "4/22/2017",
    "text": "Had a great time here before and after the game. Stop in and say hello Melissa. Live music game days. Nice drinks, great atmosphere and good food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_vZlDNqHiVikB5_LS_ZlUA"
  },
  "C1DbIG4zhDBa6EAFrrrMSA": {
    "date": "7/24/2018",
    "text": "We have always gone to the Steel Cactus restaurant on Carson Street and loved it so we decided to try this one since we were kayaking on the north shore. We entered the restaurant around 7:40.  The server didn't come to check on us Until 7:50.  At this point we were getting nervous because we heard the hostess send away four sets of people, telling them the kitchen was closed.  (BTW the website listed their hours as being open until 9.  We were able to order, however 10 minutes after we placed our order, we were told we couldn't get the $5 margarita special because they ran out of the well liquor.  We were told we could up charge a dollar for the next level up of tequila, which we promptly agreed to, only to be changed $7 for each margarita.  It was taco Tuesday and they had also run out of several of the protein options for the tacos.  The service was very slow from beginning to end.  Yes, the food tasted very good, but the rest of the experience experience was sub par at best.  Management needs to step up their game if this restaurant is to succeed!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-f6-HFgark4-ALRHJCPoaw"
  },
  "MWxoAEmw514pLlatY8_tuA": {
    "date": "7/31/2017",
    "text": "First time here with a few friends. We were looking to have a few drinks and a light snack before heading over to the festival. We headed over to the bar while we waited for our table to be ready. I tried the spicy margarita, wasn't my favorite - it was a bit too bubbly for me for a margarita, but every place has their own recipes.  Once our table was ready, we sat down and looked for what we wanted. Again, we wanted something small, so we were going to split a chips and queso. We are told that they are completely out of chips. As a restaurant serving Mexican food, that was a huge letdown. So back to the drawing board.   We order another round of drinks while we're deciding what to order. The drink I asked for had a floater in it. Usually, those drinks come with the shot floating on top. The waitress told me to let her know if it was in the drink. I've never been there before, and as a first timer getting that drink, how am I supposed to know? So she did bring it back to the bar, and they poured a shot in there, so not sure if I was drinking double what was supposed to be in there.  After we placed our order (an order of taquitos and the boys split the 3 taco order) - we see tables around us receiving baskets of chips. This was disappointing - the waitress told us they were out. If they were just making more, we would have waited. Disappointing to see around us.  I do give the place 2 stars, because their food was good, and drinks weren't bad. They just seem all over the place - places have off days, but was just really disappointed with everything as a business.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ucSWoUCOkZX8xM_ANkkBpA"
  },
  "JsexJwB_lLFdzlMUXgQZUQ": {
    "date": "5/10/2018",
    "text": "Be afraid, be very afraid.....looking for out-of-towners to dupe...clearly posted on each table for happy hour half priced apps...... But upon ordering 3 apps we were charged full price, and correcting it was a big deal. Our server was nice but was covering the outside tables and inside tables....food was cold and some of it was inedible.....go across the street to Local Brewhouse ...amazing food and service!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u3wi91ZV9-fJ-JViOkdtxQ"
  },
  "lyy5mUI1IOCeLHg5eE_3ww": {
    "date": "1/16/2019",
    "text": "Went there for lunch right before Xmas and had a very rude server. The food was soooo bland and the drinks were weak.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hB5CGdZ53W0bXVNfcZ-lCg"
  },
  "K1BCgziVIu3U1SPj9_EVag": {
    "date": "11/9/2016",
    "text": "With so many good taco joints in Pittsburgh these days, it's more and more rare for me to make it to Steel Cactus. I was in the area today and decided to stop for a quick lunch.   Let's get this out of the way first, as far as chips and salsa goes, they lag behind their other Pittsburgh area counterparts. The chips are a little bit thicker than most taquerias and are not my favorite. Neither was the pineapple salsa that I tried today. It lacked any real balance of flavor or much spice.  I decided to build my own chicken flour tacos (Mexican style) and added avocado creme. The chicken was over cooked but had nice spices. The rest of the taco was forgettable including the avocado creme which lacked much flavor. The beans and rice that came with the meal were pretty good however.  Over my many visits here, I've come to realize that this is the place to come to drink. Of all the Mexican joints around they have the overall best drink specials.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhQOA8-FdpA6D0hNhXEYIw"
  },
  "xOEIiSq6Jc_AJORx5zgDiA": {
    "date": "6/23/2018",
    "text": "The taquitos were good but the salsa is made fresh and delicious. The staff is friendly and helpful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "THCfgwd-mYzGoImAnN9kyA",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Taquitos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/THCfgwd-mYzGoImAnN9kyA/o.jpg"
      },
      {
        "img_id": "wL2FxBEXlgQ-nfXXdFq92w",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Had the taquitos for lunch. They were good. The salsa is fresh made and very good. The staff was friendly and helpful.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wL2FxBEXlgQ-nfXXdFq92w/o.jpg"
      }
    ],
    "user_id": "9nPageOrngB6UAnu5Lx8mg"
  },
  "WAZpfppVyd1CZATLZRRP9A": {
    "date": "6/22/2018",
    "text": "Went there be Pirate game . We friendly staff . Willing to set up for a table of 10. Didn't have to wait for the entire party to arrive before we were seated  . Excellent waitress . Tasty food and drinkswill return",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yaFOJZgmbOssmF6sz7QxcQ",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Great drinks",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yaFOJZgmbOssmF6sz7QxcQ/o.jpg"
      }
    ],
    "user_id": "P-jRgoDzynI32AhNPQEVCw"
  },
  "WPGMrQOECe1eiW00cfkqYg": {
    "date": "7/16/2017",
    "text": "We came here after participating in a clinic at PNC Park and in before a game between the Pirates and Cardinals.  Our server was friendly and helpful with questions we had about the menu.  The food was really good.  My son and I split three tacos your way.  My son is a picky eater so the fact that he ate says alot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4Bhym3v-uR3-2Cnk88DHLA",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Three taco Gringo Style",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4Bhym3v-uR3-2Cnk88DHLA/o.jpg"
      }
    ],
    "user_id": "KM1KHMgZeStjFx7dz1n3fA"
  },
  "8Pvh2A1ZQajdjoLtvQqb6w": {
    "date": "6/21/2018",
    "text": "First time in Pittsburgh from Arizona. Here to watch our Diamondbacks play the Pirates. Stop by to have a drink. Service  was great and my margarita was very good. Here for  the weekend and will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ani9gBxnRDMAtUhdQqxyQ"
  },
  "c08OlT4RZyUWQUiXGhPOVQ": {
    "date": "6/21/2018",
    "text": "Great location next to PNC park. Food was good and the service was excellent. We had taco salad and tacos and both were fresh and tasty. Chips were freshly made and crispy. Would definitely come again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xLlDdk1lRCPngX1BqlFIig"
  },
  "aGG6ue3Aa7J0aZJ51r9pGw": {
    "date": "7/25/2017",
    "text": "I took my daughter here after visiting the Andy Warhol Museum on a Sunday afternoon. There was no Pirates game in town so it was quiet. We were first seated inside, but the music was too loud, so we moved outside. Our server was very friendly and helpful! My Bloody Mary was good but my meal was a little spicy for my taste. Overall a pleasant experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cLmkVmKxgb42-pQzFKdwXw",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Enjoying the day out with my beautiful daughter :-)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cLmkVmKxgb42-pQzFKdwXw/o.jpg"
      }
    ],
    "user_id": "i0stmUSCoxA9cpq00y_2aA"
  },
  "rh6WlaPFM0H5c77qtxhTRg": {
    "date": "5/31/2018",
    "text": "Guacamole tasted bland. Salsa was like tomato puree. Do not recommend this place. Limited menu, not much to choose from",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "46aavKhxsuPHbj3xj4daBg"
  },
  "XB257vqT9dyV-cqsA3Y7TA": {
    "date": "5/30/2018",
    "text": "Waited 15 minutes and not one person approached to even say hello. We were seated by a host. Yes it's a baseball night, no it's not busy as we sat down at 4pm. Obviously the service sucks, so not sure about the food. A bunch of other places in immediate area to choose from.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iqe82OZLRGcyfn8z7WSH_A"
  },
  "Dku1Xg--ERTs2YR_uf5UFw": {
    "date": "4/4/2017",
    "text": "During lunch today, 4 of my coworkers and I decided to have a nice lunch to celebrate my birthday. We arrived at 11:40 and were promptly seated in the outdoor area. As it was before noon there weren't too many people there yet. The waitress came and took our drink order.   She did not come back with our drinks for 15 minutes (which was not at all complicated). She then took our food orders and we all ordered tacos.   A group also consisting of 5 people came in around the time we were being given our drinks, ordered their food, paid, and LEFT and we still didn't have our food.   The waitress basically forgot about our table and 2 of my coworkers had to go to the bar to order more drinks. At this point, we have been there for an hour and a half and still no food. One of my coworkers went to the hostess to ask to speak to a manager and she IGNORED HIM. Finally, the hostess comes over to our table and asks us \"what's wrong?\" like she had no idea we've been sitting in front of her for so long. Another colleague frustratingly told her about everything and she just stared at us without so much as an apology. We only have an hour for lunch and were being completely neglected. We got up and left without our ever receiving our food because the staff refused to acknowledge there was a problem.   I have never done that in my life and this was honestly the worst restaurant experience I have ever had.  EDIT: I wrote to the restaurant and the manager quickly responded saying that they were training in the kitchen and ran into some issues. While that in iteself is understandable (and we would have understood if the staff had told us) that fact remains that the waitress and the hostess repeatedly ignored us and clearly had no problem with several groups of people walking out due to lack of service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "MZFfAucI3N8gKv1l48pTCw"
  },
  "7-d7GnQF8ixu--vCPCEaZg": {
    "date": "9/22/2018",
    "text": "Poor service. We had to correct the waiter twice on our receipt. Poor food quality as well. The cheeses tastes like it cake straight from the can and the queso was super chunky. The meat itself was pretty good but with the plastic cheese poured on top of everything it just took over. Wait staff was not that kind either. They didn't come to check on us and just seemed like we were bothering them. Go to the south side location for sure.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WIqWJ8elE-arxBZGf-ivWA"
  },
  "UL9WHtuO4rlBHrbZp5AKpQ": {
    "date": "6/9/2017",
    "text": "My son got 2 tacos for $6 whatever, cool. Well, I got the \"specialty taco\" which was steak and a mixture of coleslaw and stuff for $14.... ok whatever they're probably good. Um, they were the SAME LITTLE TACOS that my son got for his kids meal. Omg I just paid $14 for an upgraded version of a kids meal they offer. I'm not kidding...these things were like baby mini tacos.   Oh, and the \"queso with chips\" tasted like  velvetta cheese, microwaved, on high for 2 minutes with a topping of tomatoes ...burnt my tongue. Spent $50. Next time I'll just go to Taco Bell for my Taco Tuesday fix.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5BCPQ0TyfOe656bM2uW7bQ"
  },
  "e4NJUSTIHOtdZ8gBPoGvVw": {
    "date": "6/16/2018",
    "text": "Good service. Good drinks. Good food. Great location. Right next to the stadium. No complaints.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dnae55btU9YO-u-Tm1fefA"
  },
  "R5V1wL4BPYY2nrxXGGGa5w": {
    "date": "12/14/2016",
    "text": "Just came back from lunch at this place and holy shit, I think I'd rather be a member of the Donner party than ever experience that again. First of all, it's about five degrees warmer than outside and that might be generous. Our waiter told us there was a draft and that they had purchased space heaters, but they weren't up and running due to some reason I can't remember. They don't serve warm drinks - you would think if they're going to force you to sit where it's 40 degrees, they would spring for some Swiss Miss.   My friend ordered the Mahi tacos and I ordered queso with chorizo. I don't even know why we stayed at this point, but we endured the elements of inside the restaurant as we prepared ourselves for a mediocre meal. We waited almost an hour to get these two things - at that point, I was contemplating that Jack London story where the guy freezes to death and thinking that would be a better way to go than starving. The waiter apologized as he brought our food as they had a large catering order that day (this dude was nothing but kind and polite by the way - the one star actually goes to him).   So I dip into the queso and it's lukewarm, nearer to cold than not - perhaps it froze on the way to our table. I actually asked if he could heat it up - he said he would just get me a new one. This took another 25 minutes and to be fair, the waiter was nice enough to take it off the bill without any prompting. The hilarious part is that the new one he brought didn't have the chorizo. I didn't complain again - partly because I felt bad for the poor guy and partly because I only have like 40 years left on this planet and complaining about average faux-mexican food already seemed like a waste of time once.  In conclusion, if I was to recommend this place, it would be in July when you have a couple days of vacation.  EDIT: I really appreciate that they responded. I want to reiterate that the people there were all extremely nice and it's not their fault the heating was down. I just wanted them to get that fixed ASAP and I know this kind of thing helps. I would honestly give them another shot as my friend enjoyed her mahi tacos. I just don't want to freeze while doing so. It was my friend's birthday lunch while we stepped away from the office for a bit so it was disappointing that it was so cold. Thank you guys for responding and I look forward to trying it again in the future when things are sorted out with the heating.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "e_zCQQX9XzyYApdbRhbv5A"
  },
  "BaR_UviK9UAPKEUqucROdA": {
    "date": "9/20/2018",
    "text": "Pay no mind to the bad reviews on here, they're all BS. The best tacos I've ever had were here at this awesome place located right along PNC Park. Forget the crappy stadium food, and get a quality bite here. You'll be glad you did. As I said, best tacos I have ever had. At least give this place a chance, and don't be steered away by the low reviews.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CcCO6Jp_ryIgWdALV7CPaA"
  },
  "GIV8lRpWe7oiSRIJyxbvNw": {
    "date": "8/16/2018",
    "text": "We came here last Saturday afternoon and the service was some of the worst we have ever had.  Our server took forever to get to our table, when he finally arrived he wasn't able to take drink and appetizer orders together, he said he could only do drinks first and then come back for appetizers.  Every time he left he was gone for a ridiculous amount of time.  We had to remind him we had yet to get to order appetizers.  It took well over 30 minutes to get our checks, but he surely didn't forget to add 20% gratuity which he did not deserve.  We asked for a manager, but no one ever showed up.  I reached out via their website to provide feedback and no one ever followed up.  The food was nothing great, the service was terrible and the lack of being able to find a manger is unacceptable.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CBa56hK3nW_xm4pOKk3s1g"
  },
  "mnoXZpaxqmrT6UwEarQXhQ": {
    "date": "7/3/2018",
    "text": "...Yayyyyy Taco Tuesday & $5 Margs !!  Great Patio to People Watch & Friendly Service. Perfect spot to Pre Game at PNC Park. Just a short walk from Downtown.  Check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pgK6veFWg7AhAuxWGqCoMA"
  },
  "PSKd8eg6fHhCWDYNLsjNLg": {
    "date": "10/9/2016",
    "text": "Came in after a Steelers game.  Lots of tables open, 4:30pm.  The host promptly informed us he was \"overwhelmed\" and gave the 3 of us 2 menus.   Twenty (20) minutes later, we hadn't seen a waitress/waiter, so we left.  On the menu, it let us know that there were no substitutions on game days.  So I assume they are somewhat aware of when games are?  And maybe people are coming to eat?    We moved on.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "E_9Ss4n6bVJmAe1Grc8-Bw"
  },
  "DSAWrU_av80OdhYFOIccyQ": {
    "date": "1/16/2017",
    "text": "We came here prior to a Pirates game on a Saturday afternoon during the 2016 season and the restaurant got crowded pretty fast. We were here from 1-2pm and there was a high traffic of people throughout that hour waiting for the gates to open. The great thing though is that not only do they have seating inside of the restaurant, but they also have seating outside.  Our stop here was brief, but we ordered 2 appetizers while we were here - The Traditional Guacamole and Nachos with Beef. Unfortunately, both appetizers were very disappointing. First, the Guac. The Guac appetizer came with a lot of tortilla chips, but the amount of Guac for it was very small. We were quite surprised at how little Guac was in the bowl, if you can call it that. In addition, the Guac lacked flavor and we had to salt it on our own to give it a little kick. The Nachos with Beef wasn't that much better. Once again, there were plenty of chips on the plate, but the lack of beef was disappointing. Some of the beef and ingredients were on the bottom, but the spread of the ingredients on the tortillas was still not as much as we would have liked. If anything, we enjoyed eating the chips with the Chohula Hot Sauce on the table more than we did with the Guac or Beef!  The critiques don't stop with the food though. The service wasn't horrible, but it wasn't great either. The waitress we had seemed semi-friendly, but we felt she checked up on us way too much constantly asking if we needed something else. In our 1 hour there, she probably came back to ask the same question about 5 times. We ordered 2 appetizers because we felt 1 would not have been enough monetarily with the both of us at a table, but the waitress was a bit too aggressive coming back to our table over and over again. Sometimes waiters/waitresses don't give enough attention, this was an example of TOO MUCH. Just when we thought she came by too often, when it came time to pay, she was no where to be found. I gave her my credit card, but she ended up going to other tables to take down orders and didn't return until 10-15 minutes later.  I hate saying these things about establishments, but the truth is the truth. Not only were we served below average appetizers, but the service was right there with the food. The good thing is that this restaurant has major potential and it's not out of their realm to fix these problems because they are definitely resolvable.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "54uH9DhA2LyPpBVCO7kaLw",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Traditional Guacamole",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/54uH9DhA2LyPpBVCO7kaLw/o.jpg"
      },
      {
        "img_id": "iyOU12Xmv7OWZADbs6hv_A",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Traditional Guacamole and Nachos with Beef",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iyOU12Xmv7OWZADbs6hv_A/o.jpg"
      },
      {
        "img_id": "qZ3RhPb_DwcaRWFNPxmJzw",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Nachos with Beef",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qZ3RhPb_DwcaRWFNPxmJzw/o.jpg"
      }
    ],
    "user_id": "m1AUK8tI19tUT_N3DMkyIQ"
  },
  "yhxgHZoNiDspQR6GB-TYLg": {
    "date": "1/4/2019",
    "text": "I am not a fan of sports and usually stay away from chain restaurants especially ones that lay claim to being a \"Mexican Restaurante & Cantina\" but as it is my partner's cousins were in town and it somehow became my job to entertain these humans that have ignored me at every family event we have been seeing each other at for the last few years. However I solidly believe I deserve to be punished for any and all sins I have perpetrated in my unfortunate life so I took this charge with a sprinkling of penance and headed to my car to pick the phone staring twosome up.   Neither \"fashionably\" dressed teen appeared to have any interest in modern sports but they somehow decided they would \"enjoy\" taking in a Pittsburgh Pirates game and as we were walking to the entrance mumbled that they NEEDED to eat at Steel Cactus as if it were some sort of institution or they had actually ever heard of this establishment before. I put one foot in front of the other, breathed slowly and hoped my check had cleared in my bank account. I tried to be discreet in asking our server what sort of \"vegan options\" they had and was met with laughter from these young adults I was now legally in charge of. The server was more than helpful and whilst I felt slightly embarrassed I reminded myself how lucky I am to not have any children of my own. I knew they would order appetizers and entrees and not really eat both but I felt no reason to tell my pseudo family humans what they could or could not do.   I think that our server could see the subtle distress that lay haphazardly in my eyes and asked me if I wanted \"something else to drink.\" She and I both know that our time on this Earth is both brief and forlorn but is made to be slightly less atrocious by tequila. This was a turning point for not only me but Sary, Connyr & I's relationship(Yes those are their actual names.) A few drinks and some surprisingly well refined tofu tacos later and I was ready to waste more precious resources at a professional sporting event.   If it was up to me I would have eaten at Taco Bell and poured my own swill into a Baja Blast but this was much more enjoyable than I would have guessed it would be.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iLyC_rIlg0Iw9mcyKUAc5Q"
  },
  "z4Io3oCQZSXXJo7TTlClVg": {
    "date": "7/21/2018",
    "text": "It has a great location across the street from PNC park and next to a couple hotels. If your going to the game or staying at one of the hotels it's really convenient. If it's your main destination you have to park in one of the lots and it makes it expensive. The restaurants really nice with a big patio to sit on. The menu is big and the prices aren't really to high. It gets busy on game day but if you can get a seat the foods good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gp1VrieDuTfY_bGu0SHEJg",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Nice menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gp1VrieDuTfY_bGu0SHEJg/o.jpg"
      },
      {
        "img_id": "dmz8MUGLVrAa66ahl5Givg",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dmz8MUGLVrAa66ahl5Givg/o.jpg"
      }
    ],
    "user_id": "3xBFFH866WoySDG7uuwBSQ"
  },
  "F4kmgbVER5O7q-jDyP3u1Q": {
    "date": "6/9/2019",
    "text": "The only reason I'm giving 2 stars instead of 1 is that the waitress we had was trying her absolute best while completely understaffed. However, I was disgusted by the chef who came out and YELLED at a customer at the table next to us because she kindly asked for her tacos to be remade because they were incorrect. This kind of behavior is absurd and I will not support a restaurant that stands behind that. In addition, our food was mediocre and not at all like the food I've had at other Steel Cactus locations. Very disappointed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AWHIqL73-r53VtdFZv1GAw"
  },
  "OFVvZbAoR2TnxIRyW1m62A": {
    "date": "10/31/2017",
    "text": "I love coming for Taco Tuesday just because they're $2 tacos. Keep in mind that they're not the greatest tacos in the world, but they are $2. There are also Dos Equis specials on Tuesdays. Overall, if you're craving a Tex Mex chain restaurant, Mad Mex has better food and margaritas, but if all you need is a cheap taco and a beer, this place will work.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SYZafgbAm9w8Sfxskey-Tg",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Margarita and chips and guacamole during happy hour",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SYZafgbAm9w8Sfxskey-Tg/o.jpg"
      }
    ],
    "user_id": "Zw_V_Hd-2bDCymvfII-8uQ"
  },
  "2vG2GMHZ9LaOHFLWyk2Zjw": {
    "date": "6/8/2019",
    "text": "Terrible food. Slow service. They forgot to bring the drink and the app and then acted like they were doing us a favor to take it off the bill.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KoHnDmXHexq3kF0uwSGqpA"
  },
  "gNwEl3flGUfdl3QWcNog1Q": {
    "date": "8/4/2017",
    "text": "Not a fan of this place.  But since I am a baseball fan, I usually end up here before or after a baseball game due to its proximity to the ballpark.  It is the same disappointing experience every time. Food and service can best be described as mediocre.    They rush to take your order the second you are seated, even though you haven't even opened the food or drink menu yet. Once you do place the order, it seems like eternity before your food arrives.  What is even more frustrating, is that we ordered items that were supposed to be easier and quicker to prepare. Not sure what the time frame would have been for items more complicated.   I understand that game day dining can be hectic and the service is compromised, but an order of nachos shouldn't be swimming in water due to improperly washed and drained lettuce.  I asked for a side of rice and beans, and was told by the server she would see what she could do.  Steel Cactus is spacious and offers great outdoor dining, but it certainly needs to step up on their game.",
    "rating": 2,
    "rated": {
      "funny": 9,
      "useful": 21,
      "cool": 17
    },
    "photos": [],
    "user_id": "ZLS7cwa1UplSB8nRrwrHIQ"
  },
  "f3PqMpNFDAQOKW6n2n2hiA": {
    "date": "9/30/2018",
    "text": "I was here a few weeks ago and was impressed with the flavor and quality of the guacamole. NOT so today. The waitress removed it from the bill, but I am not sure I'll come back. There are too many other great options in the city ( eg Tako, Condado). Also, the bathroom toilet seat was broken and no toilet paper in one of the stalls. Sigh.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "352fF1zm7TbTThTUGoNK9A"
  },
  "VADKQfi3LOteSRSKXEqLoQ": {
    "date": "9/21/2018",
    "text": "On pup night I'd go and eat outside at Atria's but now that it's closed we've found the Steel Cactus. Outdoor seating for the pups and great food and beer. We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0fq238YFVW5qWcWwebQaQA"
  },
  "cCGwg1wOKduk9xch5BiszQ": {
    "date": "8/5/2016",
    "text": "After walking around the city, we stopped in here to grab some drinks and a bite to eat. Lucky for us we'd made it just in time for the happy hour. So we sipped on $3 drinks! They weren't super strong but hey for $3 we were happy. Then we decided to order some chicken nachos. They were good, but nothing fancy. I'll have to come back and try something else from the menu and see if they kick it up with the entrees.   But overall, this is definitely a pretty solid place to grab drinks and a bite to eat. And you can't beat the location!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "yj9ICsWx9CcT6PkujyFNYQ",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Chicken Nachos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yj9ICsWx9CcT6PkujyFNYQ/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "wMCRBEf12DRw86Pm8GJetg": {
    "date": "9/25/2018",
    "text": "The happy hour deals were good and mango margarita very good. HOWEVER: before I can even speak about the abysmal quality of our meals, I have to mention that it took one whole hour to bring out our tacos (the happy hour special, how long can they take?).. and in the end they were honestly terrible. The hard shells are actually just fried flour tortillas (not stated anywhere, terrible and dangerous for gluten free people). All of our taco meat was at most room temp, definitely not within food safety standards. Couldn't taste the cilantro or the onions. Roja salsa is super spicy (no warning). Most of the sauces are some sort of bizarre, poorly flavored mayonnaise. Service was also horrendous. No apology for how long the food took, didn't check in with us between delivering food and taking our credit cards. Definitely won't bother visiting again and wouldn't recommend coming.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m7Wu3LLzq0hHJPB9lS5SUw"
  },
  "WDdDR0Q-Ns3Y8WlsUCWmgg": {
    "date": "12/2/2018",
    "text": "Do not waste your time! This place had the worse service I have ever had.  No eye contact,  no friendly service,  no one in this place knew how to treat customers.  The food isn't great either.  Pick a different place,  you will thank me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MQ5Cc_1cqxbusPNjIN9veQ"
  },
  "rY2YjJ2SaaZBclQ_e9_BEg": {
    "date": "7/4/2018",
    "text": "Stopped in to meet some friends before going to a nearby museum.  Since I had already eaten lunch, was only going to have a drink.  But ended up eating a leftover taco someone did not want.  Since I did not order or read the menu I just have to guess at some of the ingredients but it was grilled chicken with some buffalo sauce and pico de gallo, lettuce and cheese with some added flavor, maybe some ranch flavor.  Anyway, the taco was tasty and good.  Our service was up to par and the overall experience was nice.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 13,
      "cool": 9
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "BaeNaONmOW3pkRj1HFj5AQ": {
    "date": "7/8/2018",
    "text": "I wouldn't eat at this place again if you paid me.    It was dirty, food was bland and stale, the staff was disorganized. Blah",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "W9ue2d_I-Asoi8gDKyG7dg"
  },
  "XzYqNoLbja6Vjekfs-2dGA": {
    "date": "12/31/2017",
    "text": "OMG is not enough.let me explain.  Meat head bouncer.  You know the guy.  Kinda fat.  Arms with zits.  Didn't graduate anything.   Sad life.  My buddy was physically removed.  It was ugly.  And not necessary as we are all old.    Literally old.  We are in our 40's, doing 40 year things.   I'm sad for the owners and especially the bouncer.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X64O1mhWH_DNJSzkiuTJTg",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X64O1mhWH_DNJSzkiuTJTg/o.jpg"
      }
    ],
    "user_id": "qm_cSxjyo21NLJNAAbsbVA"
  },
  "RUico2wpvLPbFzQqNsJI2A": {
    "date": "9/25/2018",
    "text": "The deals for happy hour were good and the mango margaritas were tasty. The first blaring problem that we came across was the whole hour it took for our 8 tacos to come out. I mean c'mon, how do happy hour specials (and tacos, no less) take that long? The worst part is that the food was atrocious! I ordered three tacos: beef, carnitas, steak. None of them were hot; all of the meat was at most room temperature, which is NOT food safe. The meat was flavorless and tough. I couldn't taste the cilantro. The hard taco shells were just flour tortillas fried within an inch of their lives, saturated with grease (what's more, the menu said nothing about the hard tacos being flour. One of my friends is gluten intolerant and couldn't even eat the shells she ordered). Even the \"salsas\" were awful: a sad attempt at making (maybe) mayonnaise taste like something else..  The service was horrendous. We received no apology for how long the food took and our waitress never came to the table, not even once, between giving us our food and taking our cards. We had to call a manager over to get our checks in the first place, and she was dismissive.  I would not recommend coming to this establishment. I know I won't ever be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Vmz8Q_EcMA3btZt6RoAOw"
  },
  "JTj1uiZN_T6-qF6m3so8Ng": {
    "date": "7/7/2017",
    "text": "Decided to eat here before a Pirates game.  At first we were happy because they had great happy hour specials but then we found out they weren't active during baseball games (which is understandable).  My sister and I ordered the guacamole and then we wanted to split the beef tacos.  We asked the waitress to please bring out the guacamole first as an appetizer.  She did, but then the tacos came out about 1 minute later, so they got cold while we ate the guac and chips.  The guacamole tasted like they used avocados that were not at all ripe.  The tacos were okay.  My sister said that she was pretty sure her mojito had hardly any alcohol in it but I just got beer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lkaiBycdMJVJ1Sji_Ke-9A",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lkaiBycdMJVJ1Sji_Ke-9A/o.jpg"
      }
    ],
    "user_id": "bS0J__G2ApuGI42t2Azsyw"
  },
  "Mq4lEAmGACAwpWoCNXviMg": {
    "date": "8/10/2018",
    "text": "My husband and i ordered delivery from here off of Uber Eats.  I had the queso for an appetizer.  It tasted burnt and wasn't very good.  I ordered the 3 tacos for my dinner.  The beer was over cooked and the shells were burnt.  My husband had a steak burrito and said that it was over cooked and dry.  He also had chips and salsa, but you can't screw up salsa.  This was disappointing, as the Steel Cactus on the South Side has never disappointed.  I wouldn't order from here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3_lXZmCkafRHM8jOUrlJEA"
  },
  "L4M2kx43UeKXRpngnF4Gtw": {
    "date": "8/3/2018",
    "text": "Attended Pirate game August 1. First time on Federal St and was looking for a decent meal prior to game. Service at bar was average at best but it was very busy. Ordered steak tacos and was extremely disappointed in the quality and quantity of steak. Very bland and small. Other food in stadium was superior.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nGWeAnwjnb6xZDcMgv2eIw"
  },
  "p1Aje1SwsUkXJNuA9b1waQ": {
    "date": "6/16/2018",
    "text": "I love Steel Cactus!!!!! The queso with chorizo is out of this world and their margs are so refreshing. Regina was the nicest server and she was so on top of everything! Muy buno!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZfZmjLV2HvksHVqMXg60HQ"
  },
  "M0cztm80ZB71_Q0G8D8t6g": {
    "date": "8/2/2019",
    "text": "If you have all day to wait for a drink this place is for you. 40 minutes for a house margarita. I had to go up to the bar to order a tequila shot to water down the overly sweet no liquor having house margarita (or wait another 40 min.). One hour later still no Chips and queso. Tacos came but were wrong and the waitress never brought the right ones. We left after canceling our food order to move to a different spot with better service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J92rr0llZQjzeausSom0IA"
  },
  "T0mG-EgQ3gtAqxz7iBFnxw": {
    "date": "6/1/2019",
    "text": "Highly recommend avoiding this place. We were in town and came in for brunch. Eggs were cold and we found hairs in the French toast. Fortunately, the server was apologetic and admitted that the quality  of the food was unacceptable. Chips and salsa were solid. Stick with simple foods at this place if you have to eat there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L9gN1Sm9JnUzkuvFqlYrqQ"
  },
  "WbRdEhfeOli9CWaNUtrMtw": {
    "date": "8/2/2019",
    "text": "The food is always good,  we go there on our lunch break which is limited time .. today the service was god awful. And they weren't even busy. First didn't get asked for a drink for at least 8/10 minutes. Then waited for those for a while and they came out to us warm .. which we ordered 2 bottled beers.. gross it's 84 out ! Then I ordered a burrito for my lunch and chips and salsa for an app. Our app came out maybe 30 seconds before our food did, and she said she willI be back with silverware. We sat there with our food getting cold for felt 5 minutes  with no silverware.  Finally I went and got our own from another table a few down we spotted. Couldn't find our waitress to ask for sour cream so told another waiter .. he went and told her .. waited prob another 6/7 mins .. Needless to say we were not happy ! they definitely need more staff outside especially during lunch. I would hate to see there service during a game ! We will be taking a break going there for lunch.   Julz S",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eFPa7GjWzltbBwenCwD5-A"
  },
  "FjY2ZtRM-nlNXhOhf9gX5g": {
    "date": "4/20/2019",
    "text": "How do you mess up salsa?????? How do you mess up a standard beef taco?!?!?!? Complete waste of time. 1 Star because the jalapeno margarita wasn't terrible. AVOID THIS PLACE AT ALL COSTS!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dJhEFPhIxVhCmF4hAwe_iw"
  },
  "ZPMVzDtPGceEUqInZk_ZFw": {
    "date": "9/13/2018",
    "text": "The Steel Cactus is right by the baseball stadium and off of the Roberto Clemente Bridge. It was packed when we arrived but we managed to grab a table. The drink specials were good, even on a Saturday!  We ordered the nachos and the chimichanga dessert.  The nachos were \"okay\". They definitely needed more chips because once we finished the chips we had, we were left with a lot of a soupy mix at the bottom of our plate They tasted good, but there was room for improvment.  The chimichanga dessert is what gave this place 4 stars. 3 mini chimichangas, filled with cheesecake, covered in cinnamon sugar, deep fried, and topped with whipped cream, AMAZING. I highly recommend ordering this when you're here and sharing with the table! They are the perfect little size to eat after dinner and satisfy your sweet tooth.  The service we receieved was great as well. Dawn, who was our waitress, was funny and personable the entire time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "XQvKMKR3Lx7_dEvRdUFpmA"
  },
  "2Zj4szYgjBVNUbmlSJoIxw": {
    "date": "7/14/2019",
    "text": "Extremely slow service on a quiet Sunday afternoon. Food delivered but no fork to eat with.  Waitress never returned with a fork had to go inside and get it. Asked for water before food arrived. Finally had to go inside after eating to get the water. Never did get a napkin. Taco salad was below average.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uamc0Jq1ER9i_W-5XKyabQ"
  },
  "xkG4rQ3L3Efnxhaz2t0GMg": {
    "date": "5/28/2019",
    "text": "I went there 5/26 for a beer & burrito before a baseball game. Brandon took my order and came back with the beer and I never saw him till I wanted the check. He never checked on me once to see how things were. When I said I thought you forgot me he actually said no- really? Another guy brought the food. Another person came back with my card for me to sign. I told the woman who took the slip he got no tip as he never checked on me. All she did was say I'm sorry and not try to fix anything. That and the bland food really disappointed me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9lulEFVBlXIUJRBSevp-Eg"
  },
  "N6XGBBj76mT96nt9PkjCeQ": {
    "date": "7/5/2019",
    "text": "When we arrived the place was not busy at all. Order food and after 45 minutes the food had still not arrived. Told them to cancel our order and left. Watched another table leave without eating also. Horrible service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YDD2Fyo9w-I0P5ZPDSwZpg"
  },
  "8NF9vaOmr7dQicfTrszKKA": {
    "date": "9/9/2018",
    "text": "I think in some ways you have to be a little lenient when visiting a place on a game day but at the same time this place is a business connected to PNC Park so you'd think they'd be used to handling a decent crowd. They do get 2 stars instead of 1 because their nachos are some of the best nachos I've had in Pittsburgh. Their queso is fantastic. What was frustrating about this place was the service. Our waitress was super swamped. Another person I was with ordered beer that we never received, I figured no big deal, we'll just have them take it off the check once they run my card. Well it was actually a bit of an ordeal, our waitress had excuses why it couldn't be taken off but later brought us the beer anyway. It just took a good amount of time and was really off-putting.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0KhRPd66BZGHCtsb9mGh_g"
  },
  "DDOj821DvJvHKPR1i7Zvcw": {
    "date": "8/9/2018",
    "text": "The food is just OK and that is the main problem... Often bland and lacking flavor... quantities are not horrible and you do get a decent amount of food, but there is just much better Mexican options available in Pittsburgh  I'm not saying it's the worst food I ever had or it made me sick or anything it's just three stars because it's just OK  A friend of mine who is less adventurous with food did have the Buffalo chicken tacos one time and enjoyed them very much he said",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SPPieDvwnkvQoI7lj5vFYg"
  },
  "FbHX3oOqqcZDmWqMqjHegw": {
    "date": "7/13/2019",
    "text": "Despite how hard the waitress tried to work...the food was dry and my moms cilantro rice was more buttered rice and her fajita salad was not a fajita salad. I asked for a side of guacamole and I didn't get it and my burrito was very dry, I only had to pieces of chicken. We also waited for a hour for our food.we watched several people leave and the people that stayed were unhappy with there meals.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tAxVTUUnCvtuwH7cyjHwyg"
  },
  "QKjQZMCyq_xsj2fF_lHnZg": {
    "date": "4/4/2019",
    "text": "Unfortunately, my friend and I decided to visit here for tacos earlier this week. When we sat down we asked what the happy hour specials were and begin to check out the menu. My friend ordered a frozen margarita and she was then told the machine was out of order. So I decided to have draft beer, again when I ordered I was then told the draft system was not working (Both of these options were on the Happy hour).  Ok so 3rd time is a charm, right? My last attempt to order was a bottled IPA, that was on the menu... Guess what? They did not have that either. So the bartender then tells us to go across the street to a different bar because they have what we are looking for and they are owned by the same company so no money lost for them... Naturally that was all we needed to know and decided to leave and seek tacos else where. Never ate at Steel Cactus and probably never will.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6aJA2JaDwsYnP3aERzKb8w"
  },
  "rHf3rNqqDWPb8IBmtq06xw": {
    "date": "12/22/2017",
    "text": "Moved jobs and had to find a place to eat in Northside. Everyone told me that this place sucks but I have to give it some kudos...first tacos. I'm happy to have TACOS within walking distance of work! Also, happy hour. They have $3 glasses of wine and a bunch of other discounted drinks. I couldn't find a happy hour appetizer menu though....  Finally, no one is there at night. It's quiet. Everyone is down the street at Souther Tier and such. This place is clearly a game bar as its in PNC Park. So my service was tremendous! The staff was super attentive and the food was pretty good too.  The one thing I have to say is that they tend to run out of things fast. First time is was bacon, second the keg was kicked.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "ajvtJjaUcgukamiyCiwuYg"
  },
  "8jNvS8tnhW3VoQdM6fMnXQ": {
    "date": "7/6/2018",
    "text": "Food is good. Messing with this ap during dinner is no fun. Really bad marketing idea. Makes you miss out on conversation and enjoyment of the time you could have spent with family and friends.  Wow! Our waitress read this review, came to the table and was adamant that we remove it. (And not very nicely) That just added to the fun! Originally gave this s place 4 stars, but well......",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "w6jZhZmesIXOfTsvlRdzjw"
  },
  "qzbEWZWo_v1eykEERyq2oQ": {
    "date": "8/20/2018",
    "text": "I actually really liked this place. Went here before a Pirates game and had a burrito the size of my head. It was super spicy and it paired well with the Coronas and Spanish rice. They had chips and queso before the meal. Delicious.   They were super accommodating to our party of 10 and I must say this was some fire Mexican food. I'll be back for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yWrGdmKxq1k854j7vwl7mg"
  },
  "Rxu0RjnVbcbr2ts3bb-tbQ": {
    "date": "4/8/2019",
    "text": "Seemed like a great stop to hang out before the baseball game.  The location is great but we spent most of the time laughing at the incompetence of the entire situation.  After waiting for 10 minutes for somebody to come (which was fine, we were in no hurry), a waitress came over and apologized and greeted us.  When I asked for a drink menu she gave a look as if this was an odd request and told me \"she could check\".  She comes back with one as I suspected and when I looked at the menu and told her I would have a Lagunitas she gave me the same dumbfounded look as before, paused, and then says, \"we might have it, I can check.\"  I told her it was on the menu so there's probably a pretty good chance.  We reminded her we needed some water as well and off she went.  She came back with the beer and water for the table next to us but none for us.  No big deal, just another reminder.  After 5 more minutes without water we gave another friendly reminder and got it within 2 minutes.    While eating the queso (which wasn't bad) it was obvious this is a place that does well because of location only and not because of a quality staff.  We got our tacos (buffalo chicken and pancetta) and again laughed.    Buffalo chicken was comprised of charred 3 day old chicken and franks hot sauce poured on top.  it wasn't even cooked with the chicken.  Pancetta must have been put together by the child or our server and the tortillas were still cold from being in the refrigerator last night.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bx9p1WiqoidbDQMCjGPZ6A"
  },
  "e_p-OnknrCBMV9GELjDAJQ": {
    "date": "5/19/2019",
    "text": "We stopped there before the Garth Brooks concert on 5/18/19. Was never here before and will never be there again. When seated and asked what we would like to drink we said we would like a few waters and a couple of margaritas. We waited 15 minutes and still no waters. Our food order actually came out before we ended up getting any drinks that we had ordered. We had to actually go to the bar to get water. Eventually our margaritas did come out. We ordered frozen margaritas, these were on the rocks. We were then told that the frozen margarita machine was out of order. The margaritas that we received were absolutely dreadful. We were told that there was a bartender in training. That is not a good excuse when you're paying good money for a drink. The food was edible at best. We ordered loaded nachos. They came out on a tray with a piece of cellophane underneath and once the cellophane was saturated it would tear into pieces and get mixed in with the loaded nachos which at this point we stopped eating (very disturbing that they would not serve on a regular plate.) We ordered extra guacamole and sour cream which we did not receive until our meal was almost gone. At this point we received our napkins and utensils and still no individual plates. I would not advise anybody to eat at this place customer service is absolutely horrible. Granted it was on a Saturday while Garth brooks was going on But they should've known to have more waitstaff on and be more prepared. Oh I almost forgot the chicken that was on our loaded nachos was canned chicken (disgusting). The hostess we had was actually very nice but she was overwhelmed and overworked and she wasn't receiving much help from the rest of the staff. Shame on the owner of this establishment! ...... in my honest opinion I would advise all people to stay away from this restaurant! I had high hopes for this restaurant but they were quickly dashed!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AKvMAZGjfcIOGw-hlc98Vg"
  },
  "fZHxHTXgAyPkdAigZJTwAw": {
    "date": "6/17/2018",
    "text": "Just skip it. The food was okay (needed a squeeze of citrus at the least) but our waitress was a mess from start to finish. Didn't introduce herself just asked for our drink order. She sent our food to another table and after we ate she sent another table's food to our table. She never checked on us once or asked how the food was or asked if we wanted another drink order but had time to check her phone and chat with coworkers...they got a smile from her, we didn't see one...then she dropped off the bill and took a very long time to come back for payment. I thought the restaurant template was to increase sales by 1. bringing more drinks and 2. turning tables over. Oh well. We'll try another restaurant next time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-zoKnhRd4Knnj_P-qO0GPQ"
  },
  "PFQD77rCsUJ1VJDLfTuldw": {
    "date": "1/17/2017",
    "text": "I've been to other locations before and this one in the North Shore did not change my opinion of the local Steel Cactus chain. Steel Cactus, to me, is just average all around. I came to this location for a work holiday lunch and to my surprise, we were the only ones in the entire restaurant. The dining space was also surprisingly small, which I think other locations might be larger.   Our table ordered a selection of chips and dip and the red salsa was my favorite. I thought the guacamole was bland and the queso was ok, however resembled more of a beer cheese than a queso. I ordered the shrimp tacos and thought they were pretty tasty. The sides, though, were an embarrassment. My sides of rice and beans came in little cups that you typically get condiments in, which might not even be so bad if the platter everything came on weren't so large, highlighting exactly how small everything was. For $13, I expected a bit more.   Steel Cactus is not my first pick if I'm in the mood for Mexican, unfortunately. Will I return? Maybe, but probably not anytime soon.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "z8pCinCCuW9cmNX2g4XLqw",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Camarones De Chili Lima -  chili lime shrimp tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z8pCinCCuW9cmNX2g4XLqw/o.jpg"
      }
    ],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "bYydF7OtfHIwNyYLRFw-fA": {
    "date": "5/21/2017",
    "text": "Visited here while attending NSEA conference. A fellow conference friend and I were wandering around and decided to try. It took a while to be served but the waitress was warm and friendly. The nachos I had were enormous and so delicious. I also enjoyed the margarita but wish it was presented in a better cup instead of the regular short clear plastic cup. All in all the food was delicious .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WILYlWH6sA4pVsCl2aUV9A",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WILYlWH6sA4pVsCl2aUV9A/o.jpg"
      },
      {
        "img_id": "Zx_kJvZSQPfNz_fydfBDvw",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Zx_kJvZSQPfNz_fydfBDvw/o.jpg"
      },
      {
        "img_id": "PI3cOBYgngTPwcPhgLxo_g",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PI3cOBYgngTPwcPhgLxo_g/o.jpg"
      }
    ],
    "user_id": "Ia1pKb5wl7UmGU1718nKkQ"
  },
  "H0PLTE0Wj_kCyW8lb_FjWQ": {
    "date": "6/1/2019",
    "text": "Food was good and fresh-their only downfall was they didn't have enough staff to accommodate game day crowds. Our poor waitress was running 10+ tables and we didn't get our drink until after we were finished with our food. Would definitely give this place another shot if we came back to the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "83wOv5emfU3tGZiVXKfEHg"
  },
  "NLyP39FUpo09lVNLKkbkQw": {
    "date": "5/24/2019",
    "text": "ZERO STARS. There is nothing good to say about this place. The service was horrible and we waited over 10 minutes for water. Even longer for alcoholic drinks. Also, they don't have any specials during Pirates games. I've been to several restaurants around sporting venues and I've never encountered one that suspended their happy hours because of a game or offered no specials whatsoever.   They were out of guacamole and the frozen margarita machine was broken. (To be fair I'm glad I didn't get a frozen margarita because I'm sure it would have melted before it got to my table.) They didn't bother to ask us what sides we wanted and when we did finally get food it was cold and bland. When it was all said and done the tickets were not right.   The only reason this place is open is because it's at the stadium. I understand that it can get busy at times, but why build a restaurant in a premium location if you don't have systems in place to properly serve guests?  In summary... DO NOT WASTE YOUR TIME OR MONEY HERE!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "IHIXx6Rk81aFQ_ZxsnwrvA"
  },
  "MSF7wErL9cMDgvmRQ317mw": {
    "date": "5/11/2019",
    "text": "**AVOID AT ALL COST**   Our food came out smelling like literal dead mouse.  The avocado was old tasting- the guacamole was bland, the salsa was bland, the rice was bland and hard. The food was not good at all.  The only thing that was good was the margaritas.  The waitress was kind, but the managers and cooks were not very friendly when we had to send the food back.  One of our friends even threw up from the burrito.  No where close to authentic Mexican.  Please save yourself and go somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NBYnAQz5R1KzusAe_mDnxg"
  },
  "692WaAiMKO1SXBdzFVtEjA": {
    "date": "8/6/2019",
    "text": "My meal was so inspiring, I have committed to starting every day henceforth, writing bad reviews so that YOU, dear reader, can have a nice dinner somewhere else. Anywhere else is guaranteed to be better, so just go there.   Here's a picture I prove I actually paid this place in exchange for something edible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TGVQlZ3E3o8HD3s4zDtIuw",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. $11.50 (8.00 in menu) taco salad!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TGVQlZ3E3o8HD3s4zDtIuw/o.jpg"
      }
    ],
    "user_id": "ofQ3WbX5w7ItKnAOzmT71g"
  },
  "GgeZtq7yfrUDDfCz-HjThA": {
    "date": "12/8/2018",
    "text": "This is solid corporate Tex Mex served in large portions. I wasn't overwhelmed, but I was hungry during my visit and my meal hit the spot.  Extra points for location and convenience. I dined over lunch, but the restaurant space is in a building just outside of PNC Park and is in a perfect spot for some pre game grub.  My server was on the ball and quite hip. I let him know I wasn't from the area and he gave me some good tourist suggestions as well as some nightlife tips. I'm glad he was there and his help was appreciated.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5S0BCa-9fP9LfAr_LzqPtQ",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5S0BCa-9fP9LfAr_LzqPtQ/o.jpg"
      }
    ],
    "user_id": "xsfMwM_WyWGFUz1bOddc4A"
  },
  "-keKj-jOd5IX96ZGayaAkg": {
    "date": "7/28/2019",
    "text": "We showed up during Picklesburgh & they claimed that their kitchen was about to close, but we could still get something to eat. We ordered queso as an appetizer, which tasted like it was just made with a whole case of beer. I ordered the create your own tacos with hard shell & the shells were half hard/half soft. The waitress went on to tell me that it was how their tacos were. I would 10/10 recommend the Steel Cactus on walnut street in Shadyside, it was delicious, clean, and great service!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vq30T6b_6qy01500US-FCQ",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vq30T6b_6qy01500US-FCQ/o.jpg"
      },
      {
        "img_id": "odYqWKa9Ov0qG5O0dhNnbQ",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Walnut street steel cactus tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/odYqWKa9Ov0qG5O0dhNnbQ/o.jpg"
      },
      {
        "img_id": "3FzE1iMHKgt4gjy2Oa4bPw",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3FzE1iMHKgt4gjy2Oa4bPw/o.jpg"
      }
    ],
    "user_id": "EVlNABHfTGNzWJ1r2rlqxA"
  },
  "41KB_yyIAL64_2R4XcOWPA": {
    "date": "6/4/2019",
    "text": "Decided to eat at this place on my first ever trip to a Pirates game. Enjoying tacos in all fashions I was excited to see what this place had in store. This place was crazy packed due to the game with a great patio to sit and people watch. I sat at the bar and ordered their 3 taco entree of brisket tacos. The meat was just all right and had some decent bbq sauce on it, but the tacos were overall very bland. Nothing more than some brisket that had no smoke taste with some cheese. If I was there again I would just wait to hit up some food inside the park at one of the food stands. Bartenders were way slow and not really focused on us at the bar.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZnRkKXQsyl2i6aaEuJXhHA"
  },
  "TBfc3q1w2FSR984sHiA_1Q": {
    "date": "12/26/2018",
    "text": "Looooved eating here before the Ed Sheeran concert! They have several different margaritas and awesome queso. It's a great spot before a game or concert!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vxPIaM1cZ5r30fDBmHIyGQ",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vxPIaM1cZ5r30fDBmHIyGQ/o.jpg"
      }
    ],
    "user_id": "lDpZwPOzcHXpctxU9ORTFA"
  },
  "TmfcPsgOJXC-fFPkWLBHWA": {
    "date": "8/6/2019",
    "text": "Long wait to be seated, and the iced tea resembled tea flavored water in looks, but managed to taste horrible.  I had to order a taco salad but due to my current dietary restrictions, I had to avoid cheese, and instead got 3 measly slices of discolored avocado which cost us $1.50.  I can't eat beef but the cooks must have initially forgotten this detail and half-heartedly scraped it off, leaving some remaining.  Menu said salad was $8 but rang up as $10.  On the bright side, I didn't have any iceberg lettuce in my teeth afterwards.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sC3boGbhg1wn0syxm0JqjA"
  },
  "dRgjTQCP6anYkrspAIr8Cg": {
    "date": "6/6/2019",
    "text": "Sunday afternoon Bucco game, so it was busy.  Service was not great, slow with some mistakes on order.  Everyone said their food was at least OK, but my steak tacos on flour tortillas were bad.  The men's bathroom was memorable, flooded floor and the door handle was missing.  I should have listened to the horrible reviews, but we rolled the dice and lost.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z4Vj9TILOjTMO8ncTlUALg",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Men&amp;#39;s bathroom &amp;#34;door handle&amp;#34;",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/z4Vj9TILOjTMO8ncTlUALg/o.jpg"
      }
    ],
    "user_id": "iRLVKJVkGa470ayZFiYOug"
  },
  "wxMAAOIoneYzuC-9yaviFQ": {
    "date": "6/17/2018",
    "text": "Great place to eat on a game day!   We decided to eat here prior to the Pirates game, and it didn't disappoint. They had excellent tacos and quesadillas. Also, our table ordered guacamole, queso and salsa. They were all very flavorful and started off our meal with a bang! Yum!!  We also had margaritas, and the price was $18 for a pitcher which had approximately three glasses each. Or you can buy one individually for around $7. So if you have enough people, I recommend the pitcher. The strawberry margaritas are AMAZING!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fZsYuzEmQsyo3OvJjR4DCw",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fZsYuzEmQsyo3OvJjR4DCw/o.jpg"
      },
      {
        "img_id": "gS4VSPpde7hoTEHT3u-fTQ",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gS4VSPpde7hoTEHT3u-fTQ/o.jpg"
      },
      {
        "img_id": "iJKnDr8YBZFUG_G2lc68Aw",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iJKnDr8YBZFUG_G2lc68Aw/o.jpg"
      }
    ],
    "user_id": "u2DMRWzZbDs_WNlVni5ogQ"
  },
  "ZTSjEYW8w_TibBTbhT1xiA": {
    "date": "5/25/2019",
    "text": "Stay Away! Stay Very Far Away! Zero Stars!!! Worst Dinning Experience Ever. Came for a Saturday Night Game. Waited 15 minutes for someone to acknowledge us and another 15 for Water. Even the Manager was Nasty. The Food was Garbage. I Eat Out All the Time. This was once Again The Worst Dinning Experience!!!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xuHT_DNNgcrMSetm77296Q"
  },
  "OtVB0ymG3lh9o4uj5n3DmA": {
    "date": "7/14/2019",
    "text": "Terrible! Service extremely slow and food is terrible! Kitchen staff arguing with each other....just a bad place. Chipotle would have been 10x better AND cheaper!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ftmRzCU-i81TnAn7GKrz9A"
  },
  "xqjZQMI1kqr62-ZknwVoZQ": {
    "date": "7/27/2019",
    "text": "Didn't make it past the extremely rude host. The guy had a serious attitude problem and basically yelled at us about how long the wait for food would be before even asking us about our party or where we wanted to sit. Won't try again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "whvZtNi7OuHGWvwNjR7Zpg"
  },
  "FUH3Fcpc0ditriqF4RFSMQ": {
    "date": "7/2/2019",
    "text": "Worst ever. Before the game I ordered Picante Guacamole and a bowl of soup. 20 mins later I asked the waitress - who hadn't been back - what was up. Suddenly she comes back with regular guacamole and my soup. She obviously forgot to order and then screwed it up. Never eating there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q7gsEa2806RCvuaBrCQm_Q"
  },
  "N_EA2HnJqpee2mwn53bU-w": {
    "date": "7/23/2019",
    "text": "Had dinner with an out of town guest and was highly embarrassed. We arrived on a Saturday afternoon and the air conditioner was broken.  Server claimed it was repaired and they had all the doors closed (this was in 90 degree weather).  We nearly passed out from the extreme heat inside.  You'd think they would have compensated for this huge inconvenience. Waited patiently for our food to arrive and it was the most HORRIBLE Mexican food we're ever eaten.  How can they continue to serve food with no taste to it.  If it wasn't for a Groupon purchase, I would have really been angry.  Positively will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vYicWduWjQQzX-kTIqZo5A"
  },
  "AV7_YnvyxMGjVdxMcYMLTg": {
    "date": "6/2/2019",
    "text": "Trash. Worst restaurant experience ever. I can't believe they served us the tacos. Horribly cooked meat in a taco shell that tasted like cardboard. Had a stomach ache for 3 hours after taking 3 bites of my tacos. Felt like I was living the part of Bridesmaids movie where they get food poisoning from the Brazilian restaurant.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xtleux322QjJd4TRvyTVxQ"
  },
  "242YI40yJHFUAHvQYXuq-Q": {
    "date": "1/15/2019",
    "text": "Well, it was okay I guess. Not really my cup of tea when it comes to Mexican but it's not like it was awful. We went for lunch and ordered from the lunch menu which had good prices in my opinion.  I had a Chorizo Burrito with Poblano Sauce and cheese (Extra $1 charge) and an order of Guacamole for the table.  The Burrito gad good flavor, a little sweet heat but was super greasy. To the point that my stomach has been uneasy most of the day. Just a lot of grease.  The chips were mostly crumbles with no full chips and the Guacamole literally looked like green ice cream...I mean, check out the picture...are they using an ice cream scoop on this stuff? Clearly not fresh.  But I will say it tasted decent.  I'm shocked we didn't get complimentary chips and salsa which is almost a given at Mexican joints but oh well.  The service wasn't terrible either.  Our waiter was pleasant and attentive.  The food came out within five minutes of ordering which is great speed but again screams pre made dishes heated up.Props for flavor service and price but that doesn't offset greasy burritos and pre made ice cream guacamole for me. I think I'd pick somewhere else for my Mexican fix.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zLkaK9VGITPoxHA8XAK0vg",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Lunch Chorizo Burrito...good flavor but super greasy!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zLkaK9VGITPoxHA8XAK0vg/o.jpg"
      },
      {
        "img_id": "dzPJ6rnhdPM_9_53Oy2sZg",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States. Am I crazy or does this look like Guacamole Ice Cream?!  Obviously not fresh and scooped.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dzPJ6rnhdPM_9_53Oy2sZg/o.jpg"
      }
    ],
    "user_id": "wzItnkHTHKNqJESMSTEYJg"
  },
  "yM5jOEj5iz1PegkimvnyuQ": {
    "date": "8/17/2019",
    "text": "Really bad service.  Sorry but when you wait 20 minutes waiting for a server to come to your table you have to wonder did I make the right choice coming here.  Message to ownership there are so so many restaurants out that care I don't see you surviving if this is this the status quo.  I've read many reviews here and there not good.   Either change and learn how to serve the consumer who pays your bills or close and let someone else take over.  Food was not hot generally average.  My advice is walk by",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ptfE0d14-c-ttJa0vjKB7Q"
  },
  "20rCxgphFSrdgy1xd4-Vgg": {
    "date": "5/18/2018",
    "text": "Service was ok and the food was also just ok. I've been here multiple times for different things and this time was the worst. Our server blamed the kitchen that the food was wrong and then said she take off the price of the chips and queso. The queso tasted burnt. My friend was gluten free and the server acted like it was an inconvenience to tell her what she could eat with out getting sick. She suggested a few things and kept saying oh wait no you can't eat that. Go to the one in the south side they have better service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r8KMVrFY02kNnus_tAjjjg",
        "caption": "Photo of Steel Cactus - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/r8KMVrFY02kNnus_tAjjjg/o.jpg"
      }
    ],
    "user_id": "7KKKimQHBb8BVCN249SZIg"
  },
  "2iV96q8llTBXS6F09MTEhw": {
    "date": "7/27/2017",
    "text": "I've been to the North Shore location more than once and always leave with an overall sense of less than average service/food. Out of all the North Shore destinations, I probably wouldn't rank this very highly compared to Local Brewhouse/Burgatory/The Foundry. Once was here enjoying a beer at 8:30 and they closed at 9:00 pm despite posted hours being 10 pm. I would not make a point to visit this location at the North Shore. Shadyside and Southside locations are much nicer in terms of service and atmosphere.   UPDATE 7/27 ****** Visited the North Shore location again to try it out, and see if anything has changed. Sat at a table for 20 minutes, then left with no service. Will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-A59c9pyOnD7U3M2rlFZTQ"
  },
  "geR1kG1NVI-0f_WJSZItDQ": {
    "date": "5/12/2018",
    "text": "My fiance and I were walking around the area before the Bucs game yesterday afternoon, and he got hungry and thought Mexican sounded good. We were right out around the corner, so we stopped in to eat. We're not local, and this place is good enough to be attached to the park, so we figured it was good enough for us. Well, first of all, the hostess looked at us like she was confused about us being there. Not in a mean way or anything, she just genuinely looked confused. Like, squinty eyes, \"why are you here?\" look. Then our waitress seemed like she did not want to be there at all. I understand not wanting to be at work, and I know we all have bad days, but it just wasn't a great customer experience to be served by someone wearing a coat and day-old makeup. We sat down and she immediately asked us for our food order before we even got to look at the menu, but when we did order, the food came out in a reasonable amount of time. I ordered the chorizo tacos and my fiance got a chicken burrito. My food was super greasy, but I know chorizo is very greasy, so I gave it a slight pass. I did have to drain my tacos before I ate them, but they were tasty. My fiance said his food was not warm at all. He said it tasted okay, but it was hard to get past the fact that it was cold. At one point, I said it felt like we were in the twilight zone because of the weird vibe everything gave off. Everything was served promptly, and drinks were refilled quickly, so it wasn't a terrible experience. It was just a weird one.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9-FxpbeibxPalvJH8fFw6g"
  },
  "BDyADJlMYg2llmiJ0xv9iQ": {
    "date": "5/26/2017",
    "text": "This is the best place for pre Pirates eating and drinking.  The Mexican Cobb Salad is the best thing ever.  And now they have a beer created just for them, called White Cactus, and it is fabulous.  The staff is the greatest you'll ever find.  You will not be disappointed with anything there.  And the prices are great.  I love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wh5cLpZuZ7BjkRiVywbb4A"
  },
  "pXf7zwBhG4nLXKf7zGD2rA": {
    "date": "12/31/2017",
    "text": "Awful place.  Bouncer used aggressive force on our friend this evening.  What happened to asking questions first before using Force?  They knew we were leaving establishment and our friend was thrown out of restaurant by bouncer.  No questions just removed...thrown into heating lamps and broke his glasses.  Avoid this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dkz_hPR2i8DNdFk4DDveHQ"
  },
  "4K1sseejovfafyMvq7w-nA": {
    "date": "6/7/2017",
    "text": "The service was amazing! I've only been there twice and both times,  I enjoyed my time. Armania and Rachel were our servers and they're personalities and energy made it well worth it. Oh! And the food was good too!  We told Ian the GM who was delighted to hear good news. Great place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B_haMVZ80LgUbdCQ2Df4tw"
  },
  "3VZBQnnCSj_ZO0l-6W2Hgg": {
    "date": "3/6/2017",
    "text": "Being a buiness man on the go I must say that this Catus is  really efficient with great customer service. The food is quickly served and always very good !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uHYkHtpD8QG4VjMJ4RPf7w"
  },
  "qrbqcaC8SJq5sc3T1EPYsQ": {
    "date": "2/7/2017",
    "text": "My first time and probably my last. I ordered through a mobile app for delivery. The food arrived at the right temperature so that was no issue. I ordered a quesadilla with beef and queso con chorizo. The quesadilla was alright, the ground beef was seasoned but over cooked. The queso con chorizo did not contain chorizo, it contained beef. I don't know if that's how it's really served or if it was an error when they made the order but either way it was disappointing. The chips paired with the queso dip were very greasy too. I probably should have popped on here first to check reviews, oh well.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9hozjSNcHV77shHl1aQASQ"
  },
  "ssD6yEH-Xm4imtMF8ok82Q": {
    "date": "9/17/2016",
    "text": "Let me start off by saying that I admit to being somewhat of a Mexican food snob, especially after living in Los Angeles for 26 years. While my server was very friendly (the only reason this place even received one star) the food was probably the worse Mexican food I've ever eaten. I ordered a margarita and we shared carnitas tacos and nachos. The food tasted like food made at a gas station in the morning and not bought until late that night after sitting under heat lamps all day. The avocado sauce for the taco looked like it was squeezed out of a tube, I wish I could say the l margarita was good, but then I'd be lying. Avoid this place at all costs.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O6YAXxKRPxYWDggIa0JEag"
  },
  "eh2issRK_bADug5uekjWnw": {
    "date": "6/12/2016",
    "text": "Great service!   Went before a Pirates game!  Fun atmosphere and the food was great!  Very authentic fresh Mexican food!  Carnitas were great and the habanero salsa was spicy but so delicious!  Would highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-MPB2Le0TXOoOcAY_kKNpQ"
  },
  "fYTA5R-XYfj1pTwnpv-MWQ": {
    "date": "8/10/2016",
    "text": "Three of us got three different things and three different reactions. I got the chicken taco salad with chipotle and actually liked it quite a bit. Server said the dressing was not spicy but I found it pretty spicy. This is the location right next to PNC Park and jt was pretty busy. But the staff was attentive and helpful. Prices exaggerated but overall it wasn't too expensive.  For sure there are plenty of other good choices in Pitts.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S_OS6YCQwIDvTpoVp1NMMA"
  },
  "Jj2PuGyPfNMpVdQwRgXrGQ": {
    "date": "8/14/2017",
    "text": "I normally don't write reviews.   But since my horrible experience with ECCO shoes, I've decided to write reviews when I've had a positive experience.  Ate lunch (no Pirate game).  I had the chicken tacos Steel Cactus way with mango habanero sauce.  Spicy but mouth burning.  Really liked the black bean side dish.  Tea was very good which is important to me.  Service was very good.  Great day to sit outside in the shade and people watch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YzHQB2TBANXS9Kq9mcaoOg"
  },
  "bSYs8kzeO9p-2irZEQiYGg": {
    "date": "4/12/2017",
    "text": "I've been to the south side location multiple times and received better service. We chose to sit outside and we waited 15 mins at least to get a glass of water and meet our waitress. Very disappointed in the service at the north shore location.  Also they do not offer happy hour specials during game days. All around a bad experience",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oQjo0WdSmoCO_jMzQiEgfg"
  },
  "mF85TPLWIGr_ANYFcqmj2g": {
    "date": "6/19/2017",
    "text": "Stopped in for dinner because I wanted to go for a beer at the Beerhead bar across the street and they don't serve food. Server came and took my drink order and it took a while for my drink to come out despite a limited amount of customers. Server came back and took my order for a pulled chicken burrito. I waited quite a while when she came out and said she forgot to place my order and asked what I had ordered. I repeated my order and she said she'd put it right in. After a while my food was brought out. It was barely warm. The \"Hot queso cheese sauce\" looked like they had melted a slice of American cheese on top of the burrito about an hour prior.  In cutting the burrito and it's barely warm contents open there was an unidentifiable chunk of black charcoal like material. To top everything, the table was very dirty also. I would not recommend this place with so many other great choices nearby.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p-GUim44L7XxBds_7TNPfg"
  },
  "0HkmY7UJ-ById-h45bZLkA": {
    "date": "6/7/2017",
    "text": "Yikes! the food quality and service at this joint was awful! The interior and exterior of the place looks amazing and fresh, honestly a job well done, love the all woodwork. That being said I felt like I have had better at Taco Bell. No joke. The meat was dry as a Steel Cactus would be if you tried to eat it, sauces tasted like they were out of a jar, cheese tasted moldy. One of the guest at our table said his taco tasted like it was dipped in perfume.. How do you mess up tacos",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w3BzTukHK9EIoE7NzwiMIA"
  },
  "0kKq9uX5hnjHR3K7J8h2cA": {
    "date": "5/10/2017",
    "text": "Was hesitant based on other reviewers, but decided to give it a try.  Never been to a Mexican Restaurant that charged for chips & salsa ($4.00).  I could get over it, but it was very bland.  Burrito was also bland.  Why would they serve a wet burrito on paper?  It was a mess!  Not something I would recommend.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NQ0SrbcCGQ18Ic5D683NJQ"
  },
  "khKYOiYRV9e05bdPbw16yg": {
    "date": "7/7/2016",
    "text": "Typical Mexican style food- appetizers ok. Speciality tacos made the visit though- recommend the brisket tacos and the chorizo tacos.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K1JnlpNwhaEsWLwkyA-dKw"
  },
  "cRJjgwl8O35bJNQtHWHOLg": {
    "date": "4/18/2017",
    "text": "I went to Steel Cactus for lunch today with a few co-workers.  I normally don't take the time to write a review but I had to today after the staff made us feel so special.  Our server took the time to take a photo of us in front of the park as the manager checked in with us a few times.  We all felt welcomed, the atmosphere was perfect, and the food was delicious!  If you want some sun, some fun, and great food then visit this cute little patio! As suggested by the staff, I will be back soon for a pirate game!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XI3Q28rAPKZsrYJHDlPXBA"
  },
  "ZTTINCqj_rxSxjVDz3hkIg": {
    "date": "7/22/2016",
    "text": "Went for lunch with a friend and our children (4 kids combined). The service was outstanding. Our server Emily was attentive and went above and beyond to make our clan feel welcome and comfortable. Great kids menu with delicious grilled cheese and chicken fingers. My friend and I both had tacos that were outstanding...I was happy to have so many vegetarian choices with tofu included as a protein option for all of the dishes. (And it was cooked perfectly) Lunch prices were very reasonable. If I had to find a fault I would say that the sides were lackluster, but the tacos were so fresh tasting it didn't matter.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sCFlOL00thmbDu5hhfVHvg"
  },
  "QuLBPdV-u2za79ycU5yP0A": {
    "date": "7/12/2016",
    "text": "The hip modern decor and nice atmosphere drew me inside but the food was nothing special. For a nice looking upscale restaurant, they serve water and sauces in disposable cups and even supply plastic flatware, which I thought seemed out of place. The salsa and queso were way overpriced for the amount you're served in a small plastic ramekin. The tacos were on what seemed like store bought tortillas that were not cooked at all. We went during the Pirates game so there were only two occupied tables in the restaurant with at least 5 servers on duty, but we were still mostly neglected as ours was more interested in socializing with her coworkers and being on her phone at the bar.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jx0XinQ9SuEHoanzsY9lkQ"
  },
  "Blb03vk0DCkWYMetT8LIMA": {
    "date": "8/20/2016",
    "text": "After visiting the nearby Warhol Museum, we stopped in to get out of the sun and grab a bite to eat. While I'm not a huge fan of mexican food in the middle of the day, the Chicken Burrito with hot queso hit the spot. Additionally, their chips and guac were pretty stellar too. I only had a lemonade, but from the looks of their bar and alcohol selection, they seem to know what their doing. The only real bad thing I can say against them was that I wish I knew about this place before going to a game!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1VQxmHTwsZ3z4x-Gc1LUXw"
  }
}