{
  "2GuQibcDuGClEsfbMDZG-w": {
    "date": "7/2/2013",
    "text": "This is one of the best Chipotle's we've ever eaten at. The team members are quite attentive, and the management check in with customers from time/time to see how things are. We've been there quite a bit, so the staff remember us. Big plus for them. They execute the recipes well, recognize any of their own errors, and make sure that supplies are stocked up. If you're in Pittsburgh, or visiting from out of town, this is a good Chipotle experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qm8u9eNZST1fSrdYB9L_Xw"
  },
  "W49zToTVawGBoUnfWjqCKw": {
    "date": "5/30/2015",
    "text": "I have been coming to this place for over 5 years. This was so good. Recently customer service has become so worse you dont even feel like coming in. Today was extreme. Rice was not even half cooked and burnt chicken. Looks like im eating sour cream only. Liaded me up with it. Employees look like they are not ecen awake, very untidy and on the top they are ignoting you talking to themselves.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T0rOjxF5-crzwDcJ8JRDAA"
  },
  "O8HA7-ZMys9qAhQMBNNZ1Q": {
    "date": "11/20/2008",
    "text": "Welcome to the neighborhood, Chipotle!   My co-workers and I have been eagerly awaiting the Grand Opening for this Chipotle, just three blocks away from our office. We have a Qdoba nearby already, but we all agree that Chipotle is much better. For the past few months, we've seen the old building get torn down, a new building go up, and one day after we all wondered what was going to be there, a sign went up that said \"Chipotle, Coming Soon\". Giddy, giddy, giddy. You can imagine our excitement since all of us are fans. But that sign was mean, because it was up for over a month without any indication as to when \"soon\" was. Come on! That is just way too long to be teased, wouldn't you say?  Well, the time has finally come. November 21st is the GRAND OPENING, as the sign outside now says.   I did pass by today, the day before the grand opening and the inside was curiously crowded. Turns out they were having a \"training day\" for the employees, so thanks to an invitation by the greeter outside, I strolled in for a sneak preview of my - soon to be regular lunch - steak burrito bowl, tortilla on the side, with corn, tomatoes, hot salsa, sour cream, and cheese. Optional is the guac, cuz sometimes I feel like a guac, and sometimes I don't. Or rather, sometimes I feel like spending an extra $1.80, and sometimes I just don't.  Yay, for Chipotle! (that rhymes even tho the spelling is completely different)  (Note: I will refrain from reminding myself and everyone else that you typically run yourself about 800-900 calories on a Chipotle burrito.)",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qDgApqioN9qReeLiNytQqw"
  },
  "1X0KmCLzYRFcJaKgSpMocg": {
    "date": "12/22/2009",
    "text": "Yes, I know it's a huge chain.  Yes, they only serve burritos.  But I had a friend in from out of town who'd never eaten at a Chipotle, because friends told him it was mediocre.  This is the best fast food restaurant I know.  Five stars.  I have never had food this fast/cheap/tasty in any form that was repeatable.  If you're not eating the vegetarian options, the carnitas pork + pinto beans is hands down the best combination.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BWFF5dX7oE5F-IB8hc36Kg"
  },
  "_kJ_V1Mn3QB-6WdFxe8XNg": {
    "date": "10/14/2010",
    "text": "These burritos are so huge that they give you directions on how to eat them on the napkins!! Every meat is so delicious and well seasoned, the rice is mixed with cilantro and lime juice, and chips are lightly coated with salt and lime juice. I love this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OTQkQmA7XxFFttfM5eky1A"
  },
  "azcGG23RqBzFda2Pml26OA": {
    "date": "1/12/2010",
    "text": "Not authentic Mexican food, but for fast food, this is, perhaps, the best option. The food is filling,  the staff here are well mannered, and it is clean.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XG6Km0GdawTHwZqpP5TfqA"
  },
  "tMR6ahSdZ6QXp28nPKxSvA": {
    "date": "12/31/2008",
    "text": "This is one fast food place that I go and eat and don't feel guilty.  Not because what I eat is really low calorie and I am going to suddenly get skinny, but because it is good hearty food that fills you up without a lot of other junk.  These burritos are huge, and are mainly stuffed with rice and beans, with some other tasty treats as you desire.  I think I've found a favorite with the Veggie Fajita Burrito - which includes the guac that is normally extra $, and also peppers and onions.   The parking lot is a bit cramped, and the place is pretty busy around lunchtime, but the lines go very quickly.  I would still walk the extra minute to the Qdoba (literally right next to the Chipotle) if I wanted a Quesadilla, or a little variation on the burrito.  Most of the time my burrito is bursting out of its shell before they wrap it in foil, so I have to go at it with a fork, so make sure you get some napkins too!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "i7W9euiwSuCklfkJgpSIkA"
  },
  "BVyTDSFUwmt6AgeYQniQ0A": {
    "date": "9/13/2010",
    "text": "I absolutely LOVE this place!!  I prob eat here 3-4 times per week.  Usually after my workout or after work.  For fast food,  it can actually be a healthy option, depending on what you put on ur burrito. The management staff is very friendly,  & sometimes they go around to each customer and make sure their food is okay.  Great customer service! The servers are very nice too and will talk to you while they make your food if it's not too crowded.  They are always busy,  but the line is always fast moving.  I have never been unsatisfied with my food here,  sometimes I have to take a break from it because i eat it so much.  I hate to cook, (I'm pretty bad at it too) so it's just easier to eat here.  I just wish they offered brown rice as an alternative to the white cilantro-lime rice.  It is delicious but I try not to eat white rice that much.  The chips are also AMAZING, but they are kinda fattening.  Love this place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "loUtkSGUs6MRmXLo8G8dUw"
  },
  "8SLqOXxMSWhmYF1AP8eX1w": {
    "date": "3/22/2016",
    "text": "I am a huge fan of Chipolte and it is one of the only fast food places that I will frequent because they are committed to using all natural, non-GMO ingredients.  The food is high quality and a great option when you need to grab something delicious and nutritious on the go.  This location is always really busy so I've only gotten take out from here.  The store is generally clean even during busier times and my only complaint is the customer service which is typically close to non-existent even during their slower times, which is why I don't give this location 4 or 5 stars from me.  The employees just aren't very friendly here, and I realize that they get slammed during lunch time but it still doesn't make for a pleasant experience to feel as though my business isn't appreciated.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "HWonvGt2a73y_4_1xNmxCQ"
  },
  "nfhiAOoowuMXK1B00QGqDw": {
    "date": "4/6/2017",
    "text": "Has there been a change in management recently? I used to love going to chipotle here, but over the last few months this place keeps getting worse and worse. I mean how bad could a chipotle be? They're all the same, right? WRONG. The most recent experience made me never want to go back; the chicken (that they just cut up!) was freezing cold, the peppers were so burnt they weren't edible, the chips were so stale and it seemed like they never trained the guy serving food, he put the chicken all on one side and gave beans when I said not to. I'm not sure what's going on with this place but they should seriously consider hiring a new manager.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VJApSNXUA-Xa2oV6VRzlDg"
  },
  "PspZrbO0xuMhwCH05pJAsA": {
    "date": "9/1/2014",
    "text": "I never have any complaints when I come here.  The food is always seasoned,  hot,  and fresh.  I wish they would offer queso and then I wouldn't cheat on them that much with Moe's. The only damper about this place is that today their customer service wasn't up to par. Another reason I like Moe's.  They always welcome you. They were distracted but I'm a stickler for customer service.  Having worked in a field where the customer deserves all the attention,  I know how I want to feel in a business I frequent often. Otherwise come and enjoy a good meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lBD8AfrNefAyFx-yljL6Cw",
        "caption": "Photo of Chipotle Mexican Grill - Pittsburgh, PA, United States. Yum yum",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lBD8AfrNefAyFx-yljL6Cw/o.jpg"
      }
    ],
    "user_id": "PHilqp3w6eyo6nztpToOPw"
  },
  "rOXxYadibIZeis4gMi86GQ": {
    "date": "12/1/2013",
    "text": "I love this Chipotle. The staff is fantastic, and even though it gets really crowded, especially at lunchtime, the line always moves quickly. The parking lot is really small, so you may have to park in the Qdoba lot (be sneaky about it), or drive around for a while until a spot becomes available.  I usually get a veggie burrito bowl, but I love the barbacoa (spicy shredded beef) as well as the carnitas (shredded pork). Their salsas are always delicious. I especially enjoy the fresh mild and the corn salsas. Their fresh guacamole is by far the best \"take out\" guac I've ever had. I just can't resist it.  There is plenty of seating at this location, even though though the parking can be a bit of a problem. But really, the staff is the best part. They are always attentive and friendly. It's always such a nice experience. I try not to go more than once a week!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xsZ4s7a4MaBIh48MdMkkPw"
  },
  "kNUJbbixkY2Di8W6GpGBsQ": {
    "date": "1/3/2014",
    "text": "Ok if you are in a rush. Not very tasty but staff is nice.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEBj1ua6MrlFFU_MKaggqQ"
  },
  "Wwm0c6OaAsVx-RPmTeeTRg": {
    "date": "1/13/2011",
    "text": "I know it's a chain, but I LOVE Chipotle.  I've been to 20+ locations across the US and eaten 200+ burritos.    I'm particularly a fan of this location because they're very friendly and generous with the portions.  They also offer a kids meal.  (See my picture.)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "rpK40ZN2rNFJLhfdlQqS-Q"
  },
  "XmNLwFnhlAlFIuudLdA4Mg": {
    "date": "3/4/2013",
    "text": "Chipotle is a concept restaurant, so no its not going to be \"authentic mexican\" nor will it be authentic mexican portions prices and sizes. Try to remember what state you're in....  But I love them for other reasons, like their attempts to use more humanely raised beef, pork and chicken.   Also the Chipotle in Midvale, UT used to donate food to the treatment center I worked at for women and children. So two days a week I got to eat it for lunch, and one time they messed up catering order. I was asked to pick up 40 free burritoes, hell yess I would, damn that was one heavy box but I got to take home 8 free burritoes!   Anyway back to the basics, the beef is the closest thing to Carne Esada you will find in this town, the Carnitas are pretty good. Chicken is not my fav, ask for veggies on your burrito, and add Guac its worth it.   I like that they have a variety of salsas to choose from, mild, med hot, and stock extra hot sauce. I just wish it was Cholula hot sauce but oh well.   Someone said this location was dirty and gross, I didn't find it to be. I think Guac could be a little cheaper, seeing as how i can make it for half that price but that is my only gripe. Love these guys!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bwa7MWEM88FtiNLaXWCkww"
  },
  "O4OXrY0J_rDROeq5mlU6QQ": {
    "date": "10/22/2015",
    "text": "Worst. Chipotle. Ever. They take forever. No parking. And today...they ran out of guac!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3AwL7CpwtyJfYmvuFBg50Q"
  },
  "lvu7Dq7h5KoGFc-hyqmxiA": {
    "date": "11/16/2016",
    "text": "Chipotle is great but this location is the worst. Every time I am here they are out of something. Last time, they were out of chicken, guac, and even burrito bowls--I got my meal in a salad bowl. This is pretty much the usual for this location. I'm not sure how they manage to stay so perpetually under-supplied. And it doesn't help that their service is super slow too, so even if there aren't that many people, you will be waiting for a while. If there are a lot of people, you'll probably get your meal quicker if you walked over to the Oakland chipotle.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q8yvh8qXfhZc2ZcyIyVpOw"
  },
  "dgjr6Z8xT-w41ox_SP8zLA": {
    "date": "11/17/2015",
    "text": "LISTEN my girl megan's granny got outta rehab last week so i took her out for a treat. I said \"where do you wanna go?\" n she said CHIPOTLES. IT'S THAT GOOD. one star knocked off because i thought it was a poser atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lDlOTB0OSPxqimh_s_KbFw"
  },
  "C_RcDr89Cw9qFqW4Fy3TuQ": {
    "date": "4/21/2011",
    "text": "Pretty much like every other restaurant in the chain. If you like one, you will like them all. Having always lived in areas with much better burrito restaurants (Freebirds in TX and CA, Boca Grande in Seattle), I only hit Chipotle if I am on the road or in a hurry.  The carnitas burrito is OK, too much rice and I don't like the fact that guacamole is extra at this price point. Also it would be nice if they just tossed in chips too. I don't get the review that stated generous portions. I assume the tortilla size  is standard, and it is definitely smaller than most burrito places I have gone too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x9rkVoNB92HR_bFOe6MFTQ"
  },
  "8AMDcUE7gGRY2MXP5nTfIw": {
    "date": "9/14/2012",
    "text": "The food is the normal Chipotle fare.  It's just as good as any other good Chipotle, so talking about the food really isn't needed.  If you don't like other Chipotles you won't like this one.  The location was very close to the hotel my company put me up in, which made it great for me.  There wasn't a lot of parking, so if I had to drive here that might have been an issue.  Inside it's the typical Chipotle setup, with some tables, booths and stools.  There was a good line, but still plenty of free seats so that's good.  The best part was the staff.  While I felt they were a bit slower than at my local Chipotle, they were very friendly.  We had a few laughs and it made waiting for my burrito that much better.  Overall this is a great Chipotle and if I'm back next year, I'll be sure to stop by again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pta-L4bIsr0dl8sOiapTFg"
  },
  "ko_IuqWGSSbI53uFxur-3w": {
    "date": "2/16/2015",
    "text": "This Chipotle delivers Chipotle's classic fare but in a more secluded location than the one on Forbes. This Chipotle has much shorter lines and their food quality is generally better than the other one. It also has a parking lot. CMU students, you guys should flock towards this one. It's actually closer, but the walk there is sketchier at night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VuNLIBPCktM38vbs6yD4Fg"
  },
  "1nAByQXkaXDfFk2bGQMgSA": {
    "date": "4/6/2014",
    "text": "Last time they had no beans, this time no rice. Not sure what's going on hope they get their act together.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "n4H2JJFrJ102ukvgz7oaFQ"
  },
  "tfX2B8iYfSpgyE6UG2Dv-w": {
    "date": "9/23/2013",
    "text": "Yep, it's a chain, but a pretty good one overall. The ingredients are just about always very fresh and tasty. You can get your items customized pretty much anyway you want as long as they have the ingredients. In particular, the meats are all very good and well cooked, unlike Qdoba which tends to dry everything out. The pork in particular is excellent. One nice thing:  you can get tacos priced per each one. So if you only want 1 taco or want 15 tacos, they will accommodate that. The price per taco is 1/3 of the menu price (where you get 3 tacos).   One other point I want to make is if you eat Paleo or Whole30 or similar. It is surprisingly hard to eat at Chipotle on those programs. While the chain boasts of their sustainable practices in regards to ingredients, they often prepare items with non-Paleo ingredients. For example, except for the pork, all of their meats have soybean oil (Paleo/Whole30 no-no). Same goes for their fajita vegetables. This severely limits what you can order if you are eating on these programs. In particular, I wish they would change how they cook the veggies, as I really enjoy them. Chipotle does make changes to their menu items (for example, they just made their pinto beans vegetarian friendly) so it may be worth reaching out to them to request a change. Anyway, just something to keep in mind. Luckily, the pork is so good  and the red salsas Paleo-friendly I usually put that on a basic salad and am good to go.   This location is a little small with limited parking, so be forewarned it can be a pain during busy lunch/dinner hours.   Despite my issues with the use of soybean oils, definitely a good place for a quick meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zif8mMqckZy5FIkqCzpevg"
  },
  "npbeG7s6yGby6AC0tHHYuw": {
    "date": "11/5/2013",
    "text": "Great chipotle location. They make large burritos and are generous with the guacamole. If you plan on driving to this location, be aware there is extremely limited parking in their lot. Lunch time is also extremely busy on weekdays. Waiting in line for about 15 mins before I got to the counter to put in my order.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "N-pi-twvDI08ubRth9q0kw"
  },
  "0NSx78XlZcUGsDnSglIl0A": {
    "date": "4/18/2011",
    "text": "It's probably dumb to review a chain fast-food restaurant, but I will do it anyway.  Such is my devotion to Yelp.  I like that this Chipotle has a parking lot; it makes it much easier to satisfy our cravings for burrito deliciousness.  Every time I've been here, the staff has been very friendly.  It looked to me like their scoops of rice, meat, and salsa, were a bit meager, but I didn't say anything about it.  Largely because Chipotle can be pretty high calorie as it is - I don't usually count these things, but I did today for kicks and my burrito was 810 calories, and I didn't even get sour cream!  But on the bright side, they claim to use organic produce, cows without hormones, sustainably raised ingredients, and you don't hear that often from a fast-food joint.  The food always tastes fresh.  My burrito was a little colder than I'd like it - maybe they're all that way and I'm just picky - but I had to put it in the oven to bring it to a good temperature.  Nonetheless, it was very tasty as always - \"it\" being a chicken burrito with corn salsa and cheese.  omnomnom.  It's a lot of food and the price is right.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "yaBIVHDxaUBN2YHQ8-YiuQ"
  },
  "RaafTokjvskrQ9DTmj3zIw": {
    "date": "11/30/2013",
    "text": "This place is always super busy so I order ahead! Not as consistent as the chipotle in West Mifflin, but I still love going. One bad experience with really cold food, steak and chicken ice cold..but it was rectified. Chipotle is still my #1 fast food restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9hozjSNcHV77shHl1aQASQ"
  },
  "2OPk8HTNRK91Zsf4Hh6CFw": {
    "date": "5/14/2015",
    "text": "This is the best chipotle I have ever been too in my life and I've been to many. They have wonderful customer service and the food is always fresh no matter the day or time. The portions are what you are paying for so they're a good portions of food. I choose to eat at this chipotle over any other Pittsburgh location because it's so good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rGL-6mvOm0RHVfFw4uLtRA"
  },
  "4Dz33MLbO0VlNeWcXBVNew": {
    "date": "9/5/2013",
    "text": "Well, it's another Chipotle like any other, except this one has a small parking lot behind it as well as on street parking which is usually available. My favorite thing about Chipotle is the fact that they keep the menu extremely simple and use high-quality ingredients such as hormone/antibiotic free meats. Try getting the soft tacos with corn tortillas which are available on request; they're much better that way. Also, the bottled chipotle hot sauce is excellent on said tacos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ZZNOoMQ7WFvFoxDUFw1wg"
  },
  "oQQ1Zw6HDyC9bau5zeKpfQ": {
    "date": "3/16/2018",
    "text": "I have never had a problem with this location since I started coming here about four months ago. Their lines always pass quickly so I've never had much of a long wait, and my food is always presented exactly as I requested with good temperature. I usually order online and simply pick up my food for the sake of convenience. I work nearby and it's always ready for me to pick up by the time I get there (only a few minutes after ordering online.)   I ordered online today and got there before the food was done, so I had to wait about 5-10 minutes. The staff was friendly and even gave me a coupon for the inconvenience! I will definitely continue to go here for lunch or dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wB8gyu8b_bfI7TlGiDCqDw"
  },
  "Bmso4uGhtWpvNKvMP_8zNA": {
    "date": "8/18/2018",
    "text": "I tend to love Chipotle as it is fairly healthy for a faster food service place and I tend to feel that the price is good for the amount of food you get for your money! I also love the vegan and vegetarian options they give you and feel very impressed with the vegan tacos. I also love the half foil and half cardboard boxes they put foods in as it gives you choices for heating it up later.  I'm still knocking them off a couple stars though because some of the chips were stale and sometimes the food is just overly salty - also not impressed with the cheese dip. Furthermore, the lemonade does not have fresh lemons. They still have a lot of great choices though so I think they should just take off the less great ones ;) Oh yeah, someone else mentioned that their burritos tend to leak a lot of water - that's actually a thing too.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dxN53gSmqPI_u8rYvlik_g",
        "caption": "Photo of Chipotle Mexican Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dxN53gSmqPI_u8rYvlik_g/o.jpg"
      }
    ],
    "user_id": "cgecfJZ46npwKX2iOIbVWg"
  },
  "ekYXpjrrRkNYlEowrTHFaw": {
    "date": "3/18/2018",
    "text": "I always go to this location because it's so close to my apartment and I don't know if they've had a change in staff but my experience today was great. Everyone was really polite and courteous and not to mention, nice. I usually come for dinner and the employees are always super rude, not attentive, and whispering to each other and laughing (which is hella annoying) when I just want to get my food and leave. I don't even ask for anything special and they're being rude. But this afternoon, I didn't recognize any of the previous employees and the service was fantastic.  They give you a lot of food and there really never seems to be a crazy line like the one near Pitt campus. So you're in and out pretty quickly, so you can go about the rest of your day. Restaurant is always clean and there's plenty of seating. 3/5 stars because this was my first pleasant experience out of the like 20 times I've been here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Cj7_3L2XlXfqnBUrnxwknQ",
        "caption": "Photo of Chipotle Mexican Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Cj7_3L2XlXfqnBUrnxwknQ/o.jpg"
      },
      {
        "img_id": "eZkImb4g9XJQB3h_reUuvQ",
        "caption": "Photo of Chipotle Mexican Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eZkImb4g9XJQB3h_reUuvQ/o.jpg"
      },
      {
        "img_id": "iRp06GDFd5sbSj14_ECR1A",
        "caption": "Photo of Chipotle Mexican Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iRp06GDFd5sbSj14_ECR1A/o.jpg"
      }
    ],
    "user_id": "pspJkQgUOap1OjTZVMbdsQ"
  },
  "InXWtuTqhnCnElwIsUskuw": {
    "date": "7/20/2018",
    "text": "This chipotle is honestly the best one in Pittsburgh aside from the one in market square. My boyfriend decided to drop by for me after he got off of work and he didn't have his wallet with him. I asked him if he would go inside and ask if they could take the card numbers over the phone, so he did. Unfortunately they said it was against their policy but instead said that they would take care of the meal for free. This honestly was so nice as we eat there often and it was just such a nice gesture! Thank you to the manager who offered the meal for free, it is greatly appreciated!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_YtQn70FoYRpSl1uT1yESQ"
  },
  "3XfLd9VilWM3i3V4RjmbwA": {
    "date": "9/5/2017",
    "text": "When I got my burrito to go, the staff placed it in their brown bag. Then as I was walking to my car, my burrito was leaking so much apparently that the bottom of the bag ripped and my burrito feel right through onto the ground. Thanks a lot for that.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3IBiLPp5TIivhTo1eJbPEQ"
  },
  "bt4ICJAfSucwK8G5QvdDTA": {
    "date": "7/4/2016",
    "text": "Of the three Chipotles I frequent in Pittsburgh, this one is my favorite. It is always clean, fast (short wait times no matter what day of week or what time of day), and friendly. Food is fresh. A lot of people who come to this Chipotle seem to take it to go, so I have never had a problem finding a table. Nice that it has a parking lot too.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "HC5zLdut4caN1VPqxqRsMw"
  },
  "AG-1eUXmB2hQP5Hh7ENPSA": {
    "date": "10/26/2017",
    "text": "The service was very fast and the portions were definitely larger than the ones from the Forbes Ave location on the Pitt campus. There wasn't anything special about this, just another typical Chipotle location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9MU6L4v83qo9jmutekcWMQ"
  },
  "hsD8DeIzLd2lP2q_WPtPzg": {
    "date": "8/14/2014",
    "text": "After passing the billboard above this location countless times my family and I finally gave in and gave Chipotle a try. After going over the menu for a few minutes we knew what we wanted. The menu is simple.   You choose from one of the following, either a burrito, burrito bowl, three crispy tacos, three soft tacos or a salad. For ingredients you can choose from the following:  Grilled Chicken or Grilled Steak (both marinated in smoky chipotle chili adobo.),   Barbacoa (spicy, shredded beef, braised with chipotle chilies, garlic, oregano, cumin,  and cloves.)   Carnitas (pork braised with thyme, bay, juniper berries and cracked black pepper.)   Fajita Vegetables(Bell peppers and sweet red onion sauteed with fresh oregano.)   Four different salsas:  Fresh Tomato Salsa (Mild) (Diced tomatoes with sweet red onions, jalapenos, cilantro, and fresh lemon and lime.  Roasted Chili-Corn Salsa (Medium) (Sweet white corn, roasted poblano peppers, sweet red onions, jalapeno, cilantro, and fresh lemon and lime.)  Tomatillo Green Chili Salsa (Medium) (Fire-roasted tomatillos, tomatoes, jalapeno peppers, sweet red onion, cilantro, garlic, cumin and oregano.)  Tomatillo-Red Chili Salsa (Hot) (Chile de arbol, tomatillo, garlic, cumin and Tabasco sauce.  Pinto beans, Black beans, Cilantro Lime Rice, White Cheddar and Jack Cheese, Guacamole, Lettuce, Sour Cream . They also offer chips & guacamole and a kid's menu as well.  I went with a steak burrito with black beans, fajita veges, roasted chili corn salsa, lettuce, cilantro lime rice and cheese. It was spectacular. My wife went with a barbacoa burrito and our daughter went with the steak tacos. They both loved their food as well.  Yes the line can be long at times but, it goes fast. There is also a small patio outside to enjoy the warm summer weather while it lasts.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "BjtJ3VkMOxV2Lan037AFuw"
  },
  "c1Suj3VHBjfemJ2-DR3EKg": {
    "date": "5/26/2015",
    "text": "Don't get me wrong, I am a huge Chipotle fan. This is strictly about the poor customer service at this location. Don't waste your time...go to the one in Bakery Square it is 3 minutes away and they actually know how to treat customers. The past 3 times I've been there they give tiny portions. Last visit I had 1 piece of chicken in a soft taco. I politely asked to wait for a new batch because they had scraped the bottom of the barrel and had half a spoon full. I was given attitude and told \"this is a portion\". I politely pointed out that one taco had one piece of chicken and I was asked, \"so what you want double meat?\" This was the first time in my entire life I have walked out of ANY restaraunt, let alone my favorite one. Go to the Bakery Square location, trust me.   P.S. This one always has a line out the door and one person behind the counter on a regular basis.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Yk4Qm_3R_bvk5M1i-w0kg"
  },
  "b14HAx5i5oLJ5MS0ouiiWg": {
    "date": "2/2/2017",
    "text": "Probably the best chipotle I've walked into for awhile. The lady that worked this evening with the dreadlocks was awesome! So professional and full of character even as the line kept growing at 9:45pm! She's why I'm giving 5 stars!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DyAPLNmYlicXenUPpHFReg"
  },
  "oovHTOQwiqutQlAaCqng-g": {
    "date": "2/20/2015",
    "text": "I was a skeptic of this chain at first, I blame that on the South Park skit, now I might just be a fan.  I am surprised by how fast the food is prepped and how fresh it tastes.  The portion size is something kind of huge.  I can't believe how much there was.  Enough for me to eat two meals from.    Not really much more I can say about this place that hasn't already been said by previous yelpers.  Did I mention this was my first visit to one of their establishments?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "9BMNhMcOgRk7SeyGKsk8aQ": {
    "date": "12/2/2016",
    "text": "2.5 stars, but rounding down. On the plus side, portions tend to be large and food is usually good, but service is ridiculous. If I wanted to spend lots of time at a restaurant, I would go and sit down somewhere. The staff is absurdly slow and lethargic and it is not because they are focusing on every little detail of burrito rolling--it's because they're socializing with each other and not caring. Even when the line is only a few people long, I always wait at least 30 minutes, which is INSANE for a fast food place. If I am in a rush, I go to the location a few blocks away by Whole Foods instead of this one.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "lLZxjm_7eDxUCDNVaE1fcA"
  },
  "FpRDWlEeRYZL3PBiplQ9_Q": {
    "date": "1/8/2018",
    "text": "I'd like to start by saying my family and I LOVE chipotle, but the service at this location is atrocious.  We came in on Monday January 9 at 8 pm. The staff was as rude as it gets, sarcastic, and racist.  We asked for extra cheese and salsa fully expecting to pay for it (not a problem) and the staff member waiting on us rolled his eyes and pretended to add extra but did not.  They barely filled our tacos, there was more shell than anything else. We ordered a bag of chips and guacamole and they forgot to give us the guac. After inspecting our order in the car we realized it was missing and went back in the restaurant.  The staff didn't want to give it to us and we had to ask several times before they reluctantly slid it down the metal counter at us and walked away.  Our bag of chips that went along with it had literally 15  chips in it. We actually counted them. It barely covered the bottom of the bag. For $3.00+ I felt that was not acceptable.  I asked the girl running the register if this was the normal amount for an order of chips and she rolled her eyes at me and tossed another bag across the counter at me. She said \"they look the same?\" Very sarcastically.  I asked if  they could please add some more chips to our bag, but she just stared at me not saying a word. At that point I'd had enough and didn't want to waste anymore time talking to these people who clearly just wanted us to leave. As I was walking away I heard the girl working the register, who I had just spoken with, say \"stupid white bitch\" under her breath.  Normally I would have said something to say to this young woman but I had my children and husband with me and wasn't trying to cause a scene with my family there, Nor was she even worth the time if that's the type of person she is.  If you can avoid it, don't go to this location.  I can't stress enough how upsetting the staffs' comments were. I was truly disgusted with the service all together.  If I could leave zero stars I would because they don't even deserve one.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "om-ZNA-FYm5sli06vX96PA"
  },
  "GU5sCasNMOGENAy-3_BBiQ": {
    "date": "4/8/2016",
    "text": "Fyi. Comment on only their burritos because thats what i get. Always really short with amount they put in the burrito here. Only pleasant experience was the red headed girl who helped me tonight at 940pm. Only pleasant person.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "97oQ0R7GrUEXPPMJJog-Ng",
        "caption": "Photo of Chipotle Mexican Grill - Pittsburgh, PA, United States. Chicken buritto",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/97oQ0R7GrUEXPPMJJog-Ng/o.jpg"
      }
    ],
    "user_id": "34obrntAU6D2B3yCJAZxog"
  },
  "yF-b9OCsxa9mdZsybrgyuQ": {
    "date": "4/25/2013",
    "text": "This Chipotle is no different than any other Chipotle in the country. I also find it no different than Qdoba. The food these two competitive chain restaurants sell are too similar to each other. I find this mind-boggling.  Anyway, I tend to go to this particular Chipotle because it's closer to where I live. There is a parking lot, but it is very small. Good luck finding a parking space. It tends to get extremely busy during the usual times, lunch and dinner. The lines can get pretty long. The staff works as quickly as they can to serve the customers. However, if the line isn't moving, then I'll go next door to Qdoba.   I've switched from steak bowels to steak salads because I do not need the extra carbs from the rice. The guacamole is delicious, but I don't get it that often because it's too expensive. Other than that, this is one of my favorite places to go to when I don't feel like cooking!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "qQxRRzTT0U75A3mTVRh8xw"
  },
  "23hyHBHaNpFXnTfP46L4vQ": {
    "date": "11/7/2017",
    "text": "This location really disappointed me tonight. They rushed me through my order and before I even finished they were going to the next person- they closed my bowl before I even had a chance to ask for everything I wanted then got annoyed when I asked for lettuce . They also charged me for a chicken bowl when it was a veggie. You need new staff here",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a0u9m78r2WLCuQP__vGFfA"
  },
  "H-okjqeKzEdErpz_k9G0Eg": {
    "date": "6/20/2014",
    "text": "I love this place is quick good yum fast on the healthy side FOOD!!! And workers are super nice ..",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "9XX_MlVNPBZ43ieG6bbJiw",
        "caption": "Photo of Chipotle Mexican Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9XX_MlVNPBZ43ieG6bbJiw/o.jpg"
      },
      {
        "img_id": "inQd7_6m7RYOwGYx7AR_tg",
        "caption": "Photo of Chipotle Mexican Grill - Pittsburgh, PA, United States. Yum",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/inQd7_6m7RYOwGYx7AR_tg/o.jpg"
      },
      {
        "img_id": "N5MNO8zsq8gOMX3wdSPonA",
        "caption": "Photo of Chipotle Mexican Grill - Pittsburgh, PA, United States. Chicken burrito to go.. Yum",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/N5MNO8zsq8gOMX3wdSPonA/o.jpg"
      }
    ],
    "user_id": "uLWWpi62JJLnTh7UciJFHg"
  },
  "NSwRxaDVbkOHu1aMeCBa7A": {
    "date": "6/6/2016",
    "text": "Honestly my boyfriend is a huge fan of Chipotle, but I don't really see anything special about it. Everything taste the same, because it is all the same, may be plus or minus a tortilla. It's fast, it's convenient, it is better than McDonald's. I guess it's a wanna-be Mexican type subway with lesser number of options. It's ok once in a while when there are no other options but wouldn't go out of my way for it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "523swCiFbRBGYSA8iq8a2w"
  },
  "Ci_tjUOVBxyZpkAnKPCJ9Q": {
    "date": "10/4/2015",
    "text": "For a chipotle this is awful! The food obviously on point... However the service is always awful. I cannot reiterate enough how awful the service consistently is.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ChHjObLDwenhrm_iH6XSWw"
  },
  "ztZUV_k_YpSnYn66gi57vQ": {
    "date": "7/5/2015",
    "text": "I'm a huge Chipotle fan but this location is just so-so.  I generally order ahead via their mobile app and the last time I ordered from here the food wasn't ready by the time that I got there.  They hadn't even actually started to make it.  There was hardly anyone in the line for a Friday afternoon and they told me there would be a wait for my food.  I could've gotten into the line and had my food quicker.  I asked them to just cancel my order and give me my money back.  They obliged and that was that.  Very weird situation.  The parking situation here is awful.  Their parking lot has less than 10 spots and there are people constantly circling around the lot trying to find a spot.  It's easier to just park on the road in one of the 3 metered spots in front of the Pep Boys across the street.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "91koVXu54Y6tIiZKKxVmrw"
  }
}