{
  "jimJijMPgIvqNb6S8K9PRw": {
    "date": "2/25/2018",
    "text": "Had a delicious homemade pasta dish last night. The tomato basil sauce, wow!! And the zucchini appetizer was so light and also delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "am-_8HWqP2YewQ8RxBpe5w"
  },
  "H4ihag8ipF1cQuXdkbz9Sw": {
    "date": "4/15/2017",
    "text": "The food is fantastic. Great atmosphere.  But the server was not friendly. Took our order and walked away.  Never offered sides or talked about the menu. Didn't make direct eye contact which is a huge thing in customer service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gpVUB7P-F1KzxaZPQpTLrA"
  },
  "Dief_LAvsnyMO_07Y_KHzA": {
    "date": "3/5/2017",
    "text": "Same old restaurant disguised with a new name and decor.  This is the Franco Ristorante in disguise.  It was the restaurant that urged me to join YELP and write a review.  Ok...the new image in much improved. The same unpleasant hostess remains as several years ago.  The food is mediocre at best...way to pricey for mediocre food.  If not for it's location in the Cultural District this place would have closed up long ago.  I still wish it would.  Went there as friends wanted to go there.  I was interested in trying it again.  I will not go back when there are so many excellant and inventive places to try. Mediocre pricey food and in reality the decor is already dated.  Go elsewhere!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0cbyQSqHvk57yjiMZPv4mg"
  },
  "G1DHpUdiTGXR8a0iQxj0ag": {
    "date": "1/1/2017",
    "text": "Remarkable! It is absolutely remarkable that an entree that would be perfectly average at $8 should cost four times as much. The $32 sea bass consisted of two dreary rectangles of poorly filleted, bland white fish adorned with parsley. College cafeterias do this dish better. It was by far the most disappointing restaurant meal I have ever had.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tt4n-pgcE4svXkaOSV_U9A"
  },
  "IXdP5gaR19W0FcYyqGqWcw": {
    "date": "9/25/2016",
    "text": "From the time we checked in with the hostess to verify our \"reservation\", to the time we spent at the bar waiting for a cocktail  TERRIBLE  SERVICE.... Food was \"average\" Wait staff substandard. There are DEFINITELY BETTER Restaurants in downtown Pittsburgh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "xn_JAsZdlQPsiQ1LRGeBsQ"
  },
  "XgG3bEEQf-MOHLHKuMnBuQ": {
    "date": "5/1/2017",
    "text": "Good location for downtown theaters. Inconsistent service. Inconsistent food. Carol the hostess in charge is generally rude. When they redecorated and changed the name of the restaurant from Franco's to Peter Allen's the prices went up but the food quality remained inconsistent and side dishes are no longer included as before. On 3 of our visits within the last 2 years we were charged more for the wine we ordered on our bill than the price listed on the menu!  When considering this restaurant, keep in mind the following: close to theater; inconsistent service and food quality; decent uptown decor but, crammed and tight; hostess can be abrasive and remember to double check your bar bill.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jqKfpp2fEvI035ZJ6LftGQ"
  },
  "ZhHohqtPV29r4yTtsp2H_g": {
    "date": "10/27/2016",
    "text": "Went for dinner last night and was disappointed.  The decor was clean and uncluttered with a black/white color palette and bright (way too bright for fine dining) fluorescent lighting that was reminiscent of a hair salon.  I came early for my reservation and sat at the bar while waiting for my friend.  Bar was clean and well stocked and the bartenders were competent and friendly.  Once seated for dinner we were greeted by an enthusiastic and knowledgeable server.  Unfortunately for her the restaurant makes her serve food on cafeteria dishes.  They were ugly and old.  Not quite sure how an allegedly new restaurant has old \"family restaurant\" style plates.  That would be ok for say Grant Bar in Millvale (which is actually a great place to eat - go there) but not for dining downtown before a show.  Appetizers:  crab stuffed mushrooms - they were good.  Nothing special, slightly greasy and bland but not offensive in any way.  Fried zucchini- really good.  Fried perfectly with a nice marinara on the side.  Unfortunately the marinara was filled to the brim of a cafeteria cottage cheese/apple sauce dish and dripping over the side.  Really sloppy plating.  Salad: basic side salad.  Fresh greens.  Your garden variety family restaurant salad.  Entree - Veal Romano.  It was a suspiciously large portion of three sizable pieces.  The plate was grease splattered and was not plated with any elegance.  Upon cutting it I realized that only two of the three pieces were veal the other being Chicken Romano.  The chicken was actually better than the veal and I was thankful I had it as the veal (which I didn't finish) was over-breaded and soppy with grease.  Got mashed potatoes and broccoli as a la carte sides.  The mashed potatoes were lukewarm, tasteless smashed redskins with ne'er a pinch of salt for flavor.  The broccoli was steamed, poorly cut into shrubbery sized pieces with large brown spots on the stems.  Completely inedible, unappetizing and should have never left the kitchen.  This wouldn't be served at a hospital yet at Peter Allen's it's an a la carte side.  It's absurd to complain about food being yucky and then in the next sentence complain about small portions but the a la carte sides were in those cafeteria cottage cheese dishes they love so much.  This is NOT an a la carte portion -at least not one you would get at a premium steakhouse, but the charge was similar and in my opinion a disservice to diners.  Dessert- Salt Carmel Truffles.  This was really good and I was happy our server (who again was really nice and deserved to work at a better restaurant) recommended it.    Overall this was a poor dining experience and I won't go back.  (Two stars only for the staff - otherwise it would be one). Putting the wrong protein on a plate is a serious no-no and the rotten broccoli was scary.  The prices are lower than many other restaurants on the block, but it's still fine dining prices and they do not deliver a fine dining experience.  I was happy to see Bravo Franco go away and get replaced with something new because this is a great location and the city deserves a great place here, but it's menu is uninspired, dated and the food is slop.  Basically Bravo Franco with a fresh coat of paint.    If you are seeing a show and do not have a reservation to any of the really good restaurants in the cultural district and need to just walk in, I would advise to stick to appetizers and dessert.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "4qdabQmbP_Fk6LBwbLSK1w"
  },
  "mlMtdOprN3OGBag1n-m5dA": {
    "date": "6/23/2016",
    "text": "This is a pathetic establishment. Everything started off badly when Carol, the maitre d', sarcastically lectured us on the definition of a reservation (which we had). Her poor manners and lack of service oriented mind set left a bad taste in our mouth. The food that followed didn't help much. For $30 a plate we were given tepid pasta that I could have made at home with a chicken breast, jar of prego and pound of linguine. The food would have been a rip off for $10 but the actual cost was absurd and insulting. I felt duped. The ingredients for the salad were slopped on the plate with no care for presentation. To call the dishes unimaginative would be a great understatement. Things went from bad to worse when we were left without service for 20 minutes and had to share Parmesan and balsamic with the table next to us. To cap it all off, the cappuccino looked like it could have come from a college diner with drips down the side and grounds on the saucer.   We were desperate for a place near the theater. I wish we'd just hungry.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "-t2XyliHPHxjsqI6ln7TWw"
  },
  "_jcUejJmypKdN-uglcrbRQ": {
    "date": "12/15/2016",
    "text": "My experience was the same as most of the other reviewers. I had two negative experiences at the same location when the restaurant was called Bravo Franco. The renovation and name change was like lipstick on a pig. My office decided to go here for our Christmas luncheon (I voted for another restaurant), and it was OK for that. I order spaghetti and meatball with bolognese sauce, thinking it was a safe choice. The spaghetti was mushy; shouldn't a place like this be able to cook pasta al dente? I couldn't tell if the sauce was good, because they didn't drain the pasta; there was visible water filling half the bowl. Big portions, though. And their chicken pastina soup was tasty. To sum up: mediocre food and plenty of it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "U0egkRRQcwUk3R0Zv8uD2g"
  },
  "eM6NoeMfysN7_NjGpKsZdg": {
    "date": "9/13/2017",
    "text": "I have lost my faith in Pittsburgh yelpers... How can Meat and Potatoes (with its satanic \"hostess\" and manure smell) get 4 Pittsburgh yelp stars while this gem gets only 3??? I understand thats its across from Heinz Hall and depends on theater traffic but this is a hip, art deco eatery with fabulous food and hospitable, Pittsburgh people! I was pretty frazzled and upset after storming out of the nastiest dung heap of a restaurant I ever saw (Meat and Potatoes) and this place was my oasis... The food was FANTASTIC!!! I challenged our agreeable server by going off menu and he never batted an eye! I ordered capellini but I insisted on garlic butter in the gravy, with extra hot sausages on the side and the meal was culinary MAGIC!!! It was so good that I actually wept tears of joy all over myself... And the onion soup was made with a highly unusual chicken broth that really complimented my entree nicely! And the sensual jazz music (that played the entire time we were there) really rounded out the evening nicely... It was like eating in the Cotton Club. Do yourself a favor and ignore the 3 Yelp stars and make a reservation here! You won't regret it....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "deJ81MFyetN9EXzBtiT4rg"
  },
  "KtAzf2VxFTnUSR5UcflM6g": {
    "date": "12/16/2017",
    "text": "Probably a fine place to have a drink and appetizer after the theater but as a restaurant very poor.  Calamari is frozen restaurant supply quality; Veal Piccata was bathing in a watery sauce and was over cooked.  Bread was stale.  NY Strip was cooked properly but was very tough.  Sauteed mushrooms came to table nearly raw and had to send them back.  Go to Vallozzis on 5th...wonderful Italian food and great service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GLef4iexQNH4vFH2bUggCQ"
  },
  "SYjbOr39igzW8hqJqbvjEQ": {
    "date": "12/16/2017",
    "text": "Tables very crowded, waitstaff can't get to you to serve your food, instead they hand you the plates. Food was mediocre at best, lobster ravioli was fishy tasting and they were stuck together,  appeared to be thrown on the plate with sauce. Reminded me of froEn ravioli. Salad was lettuce with some tomato and slice of cucumber.  Coffee was served in cups that were dirty and waitress seemed annoyed and stated she would redo them. Pecan ball was scoop of ice cream with pecans on top. Not what I would call a pecan ball.  I would not recommend poor value for the price.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rQNDIkNnZcJmYEVZlvAd0g"
  },
  "BrjmCnGQpVkgxXk5NqvPjw": {
    "date": "10/7/2017",
    "text": "Food was great but the hostess is a serious angry grandma. Steer clear and do not think you can sit at the bar or a table without her crabbing at you. EEK!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bmooPn_dzwcX7oawgVV03w"
  },
  "EETYeoy7NmCgsPHvMpt5wg": {
    "date": "6/13/2016",
    "text": "I will never return to the restaurant....waited over 30 minutes to get my soup and salads for the table. Then waited over 50minutes for the entrees. Food was subpar had to get the manager because our party of 4 was disappointed in each dish. Wait staff are unprofessional",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xh2BXZfWsMmJJoMnZlEz4w"
  },
  "RDpCKNoz9n4AhDwbDtZ1aw": {
    "date": "12/18/2016",
    "text": "Overall, it was not a good experience. The food was good, but not worthy of such steep prices. The staff were also not very friendly, and some were even rude. I asked a simple question and I could hear them talking about me behind my back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xYbztlzkUwbqofjsQ2NNtw"
  },
  "QJb16VyQQEJ2YZjkHAGfyw": {
    "date": "8/4/2017",
    "text": "It looked nice & upscale. And the menu was truly interesting. Waitress was friendly and prompt. But 2 things bugged me. None of the food was really that great. The cacciatore was $40, but I don't know why. It lacked flavor, & I used the salt shaker a good bit. My wife felt the same way about her meal. But what truly bothered me was the older woman at the door. She was so proper and overly professional in her demeanor that we felt unwelcome. A smile goes a long way. The place was packed with diners. So people must like it. But I can't understand why. It's really just an okay place. There are tons of other great restaurants in town to choose from.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "F4fzipDpsDD9wrKr7LnJGQ"
  },
  "6Imz37zy26kbkn0vkL8Xig": {
    "date": "7/10/2016",
    "text": "I wish I listened to the reviews before coming.  Dirty bathroom doors. Bugs were flying around our head the entire meal. The food was completely mediocre and I lost my appetite before I started to eat. I can't even finish the post because I don't really want to waste anymore of my time on this establishment. Just stay away, like I wished I had.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "v0qB5Ctr38_AbeND7ydb_g"
  },
  "d4-DNJDGhDTxQ2AYOfZsGQ": {
    "date": "11/21/2016",
    "text": "We happened into this restaurant after checking out two others, which were both loud and crowded. Peter Allen's was like an oasis--courteous service, lovely music, quiet enough to converse, friendly patrons at the tables near us. The food was quite good, especially the pasta. We had one problem (fish too salty) which was kindly and promptly replaced. The portions are generous, and the desserts were the perfect size for us, ample but not huge. Service was efficient and we had plenty of time to get to our show. Overall a very positive experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x8ieWzF9bPaR0MqupDwPPg"
  },
  "jNnzog78LreKiW5oPA-3Pw": {
    "date": "7/19/2016",
    "text": "Absolutely the worst meal I have eaten in any restaurant in Pittsburgh!!!!  Took a friend there for lunch for her birthday - the Mushroom Ravioli was terrible - floating in a brown liquid that was supposed to be a sherry cream sauce and Fettuccini Alfredo with sauce that was oily and tasteless!!!  The fried zucchini appetizer was average at best!!!!!  $80 later, neither the manager nor the chef were the least bit apologetic or compensatory!!!  Save your money!!!  There are much better pasta places in and around town!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mjumggS1MCTXydljPOJN0A"
  },
  "2qzloBcvtpv4dg6Wdslq4A": {
    "date": "7/23/2016",
    "text": "This place is great ! Newly remodeled, food is solid. Carol is excellent at the door and Sean incredibly attentive at the bar.  I live in Chicago and travel quite a bit- this would hold its own anywhere",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8UC58Q2uxeDknYmDsbO17A"
  },
  "Hx0h4lawUXVOv-L1OXurnw": {
    "date": "6/24/2018",
    "text": "This was the worst Italian food I have ever eaten. The lobster ravioli was definitely something that you get out of your freezer section of your local grocery store. The lobster in it had a not so fresh quality taste to it. The fried zucchini wasn't cooked long enough. The chicken Romano had no seasoning/flavor to it. It was like breaded chicken tenders with no seasoning, with a lemon wedge. The bolognese sauce tasted like marinara from a can, and the noodles were not homemade. Over all quality of the food was POOR. The best part of the meal was the iced tea. Went to Wendy's for a frosty afterwards! Would definitely not recommend, and will not go back for a return visit!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3DlLiUHhV-QuMmVaFgaQwg"
  },
  "Kz0pITuAqBuaOicNi0gcrQ": {
    "date": "3/26/2018",
    "text": "I was skeptical to try this restaurant due to the low rating on Yelp but thought the location was convenient since we were seeing a show. Arrived early for our reservation and walked to the hostess stand where an annoyed woman asked \" if we were normal\" because they need \"normal people\". The hostess and waitress proceed to gossip about a couple who were just seated. Against my better judgement, we stayed and had a drink at the bar while we waited for the rest of our party to arrive. Bartender was helpful in explaining their beer variety and once we finished our drink, we asked if the drinks would be transferred to our table or if we needed to settle at the bar. A waitress mentioned that the bartender would transfer to our table until the rude hostess than cut her off and awkwardly told the waitress that she was wrong. We settled our bill at the bar. We sat at our table and the restaurant was getting busier with patrons. A group of 8 came in and were split into two tables. We overheard the waitress say \" I don't know what the hell were you thinking coming in here without a reservation on a Saturday night?\" to this group. Very unprofessional and disrespectful. While we were eating, the hostess went and sat down at the table and said something to them again. Next thing we know, all eight  people stood up and told the waiter to cancel their dinners. The nicely dressed gentleman did not cause a scene but I heard him tell the waiter that \" they did something  very wrong\". The food was decent but with an experience like that, we will not return. The hostess should really consider another line of work, perhaps one that does not involve human interaction.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "BMAlMr4bpCfpPtm4RkTr8w"
  },
  "lz_jZ83x2PCi2wHfItgMAQ": {
    "date": "2/10/2018",
    "text": "This is my first time ever reviewing a restaurant so please be patient with me. I'm disappointed that I didn't read these reviews before going to this restaurant. Went there before going to the theater. I should have known something was amiss when I received a phone call a few days before asking if I'd mind if they moved us from the dining room to a table by the window. Then when we arrived the elderly lady had to search for our names, then she finally sat us. About 5 minutes later she came back to our table and asked if we would mind moving to another table, my wife was not happy, there were 3 of us and the table in the corner was smaller, and I am not a tiny person. My wife say jokingly that since we are being so accommodating that we should maybe get a free appetizer, at which the elderly lady said, not jokingly, everybody wants something for free. We sat down our waitress finally came over and we ordered our meals.I had the Veal Parmigiana, my wife the salmon and my sister-in-law, the special...trout. I will say this the Veal was excellent and a very generous portion, thankfully because my sister-in-law eventually ate half of it because her trout was that special. My wife's salmon was also very good. Now to the service or should I say lack of service. I food was prompt, and wasn't delivered by our waitress, we needed more bread and drinks by this time and asked the person who delivered our dishes for more, she eventually came back huffing under her breath that this isn't her job. That was the last time we saw anyone and had to search for our waitress to get out check. And I could not wait to get out of there. As for tipping and I really hated this, our waitress got 15% and if my wife had her way it would have been 10%. We will never go back here again. And I've learned a very good lesson....read the Yelp reviews before booking.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WYFdf6hNIZFOaaTOpSHqMQ"
  },
  "7QVoUJNwyicZLJSkULUdQA": {
    "date": "4/22/2017",
    "text": "DON'T BOTHER: As the place is across the street from Heinz Hall, thought we would try it before the symphony. WORST SERVICE EVER! I will never think about going to this dump again. Seated at the bar by hostess. Waited 10-12 minutes before any acknowledgement. Ordered drinks. Another 7-10 minutes before we left. No drinks. Had we waited for the food we ordered I suspect the concert would have been over.   I won't speculate as to motive, but this is now 'Merica.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pFcm5tydZ47lrsgJzrmRwA"
  },
  "qOcKkwrn5621NX5TwlP6Ig": {
    "date": "10/21/2017",
    "text": "First. We had a reservation for 7 pm but they called my sister-in-law, asking if we would mind moving to 7:30 because it would be more comfortable dilute to the plays. They knew we were not going to the play so they wanted our table for a play goer. Thought they would offer a complimentary app. Nope. When we were seated the place cleared out and it was the 6 of us and 2 other tables. I ordered the linguine with red clam sauce. The pasta was too soft and there was very little clams. One of the ladies ordered a steak that turned out too rare for her.  It seemed that we were an afterthought when the play crowd left. We should not have agreed to a later time. Maybe the meal would have been better. We go to a lot of events in the cultural district. This restaurant is off our list for return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "jYEb4zt5p3eINiLWsFw54w"
  },
  "1_2J-k9gHYEYffk7JFIxRw": {
    "date": "1/20/2019",
    "text": "waited an hour for the blandest \"italian\" i've ever had. whole table was really upset and the food really lacked flavor. i wish we could've had better service, but the waiter did look like he was trying his best.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hqYbu1n0JB5EKWbAtyqmg"
  },
  "L6v__jwnBwLSdCZ2iYvstg": {
    "date": "3/12/2018",
    "text": "We had 4:45 reservations on a Sunday night.  Show at Heinz was at 7pm.  I ordered Chicken Piccata - which was good, but only came with a salad.  Over priced and not worth the money.  I don't mind paying for a good meal, but after I had my salad, the dinner came with 3 pieces of chicken on a plate - nothing else...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "BYEoZNtwAmQuJFE4rfkkQA"
  },
  "CudhExwWaz0BfDv6yOzgfw": {
    "date": "11/27/2017",
    "text": "My husband and I went here after we got married to celebrate since we didn't go on a honeymoon. They were short staffed but they did okay. We didn't have the wait to long and the lobster ravioli I got was amazing. I'd go here again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kVlKEzoGUiaMAnLRJvi0Tw"
  },
  "1hLqlTWqd9ckFSLklWEksw": {
    "date": "4/6/2018",
    "text": "The absolute WORST restaurant I have ever been to.  Let's just say I didn't even get to the main dish before I RAN out of there.  The hostess, whom did not even greet us at the door, wound up at our table after we requested to sit closer to our party.  She plopped herself down at our table, commanding one of our guests to \"MOVE OVER\", complained about her sciatica, before rudely asking \"Now, who wanted to see me?\"  After listening to HER making extremely blatant unsettling remarks about women & denying our request to sit closer to each other, my party left.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "GP7g3pcaJ9tf9PcFD7Sz7Q"
  },
  "smPkXf6cYwBz092Y0cPS5g": {
    "date": "12/30/2018",
    "text": "Took almost 10 minutes to be acknowledged by anyone. We had a reservation and when we were finally greeted, they said our reservation was cancelled! When we called that morning to be sure it was good to go and we're told yes. Then the host acted as if she was doing us a huge favor seating us, when we had a reservation in the first place. Drinks were good and service was good. Loved the atmosphere, but the food was overpriced for portion size and flavor. Food was good but nothing amazing (not worth $25-$45 a plate). I have no problem spending that kind of money on a meal, but it should be well worth the price. Food could be improved or prices should be lowered. (Ravioli was $25 and it came with 4). On top of that, the Brussels sprouts were horrid, tasted like frozen Brussel sprouts that were boiled. Don't think I'll ever be back, there is so many better places to eat in area in the same price range! Hope they work to improve their food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZIRiUMTI4Gm2bxvBFpcKIw"
  },
  "GVH7PemMEm6TaRAo14lKKg": {
    "date": "8/6/2017",
    "text": "This review will be as short as our time at this place last night. We walked in hoping to grab a drink and some food around 7pm. The place was dead inside with maybe 3 couples... and there were at least 4 waiters and waitresses and a bartender standing around. We passed a few dirty tables while we made our way outside, which just sat there the whole time. We went and sat at the table outside, which was directly across from the bar. Multiple staff members were standing around by the bar... doing pretty much nothing. The couple at the bar even noticed we were never greeted. Not one staff member came over. We gave it about 10 minutes and walked out. Basically I can't comment on the food or anything they serve here but their customer service alone will eventually shut this place down. Terrible. And obviously bad management.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "jV_xAviAhrL1-96-kHx-Yg"
  },
  "RK8in_nXOEZNRq82f0Wqrw": {
    "date": "5/27/2018",
    "text": "We decided to go here even though there weren't many people in the restaurant. That seemed odd as it was a Saturday night and busy downtown. Here's why:  they need a complete overhaul of the front of the house. Too many seats, too formal without the trained staff to support the attempted ambiance.   The food was very good so it's obvious the chef knows what he/she is doing. I would overhaul this place into rustic Italian, train the staff, get rid of the white leather or remove half of the seats and upgrade he wine list.  For the prices charged there's just not enough quality upscale service to support them.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "olh9rKduhJ2X0mi45VAD8A"
  },
  "CWN5Xksn6-IdnVE3yC6S8g": {
    "date": "2/24/2018",
    "text": "Our group of nearly 25 had reservations this evening as a kind of family/friend/ in membrance reunion.  For most of us, it was the first time in this restaurant.  There were 5 physicians and several engineers, teachers, professors, and other professionals in this group; most of the group was from Africa. I say this to give you an idea of the nature of our group. Reservations had already been made so when we came in, we expected to be seated.  The tables were not yet arranged so we were patient during the confusion of seating us all.  The food was okay... In fact, I think that most of us would have been tempted to go again had the service at the end of our meal not been so impolite.  They wanted us to leave at 6:00 p.m. though at least 15 minutes of our time was wasted in seating.  Anyway, that's when the comments started about getting us out of our seats and out of the restaurant began; that's when the bumping (3 times that we know of) came about when the waitress bumped up against several members of our group..... The husband to one of the women who was bumped several times and I went to speak to the lady in charge that evening; she seemed somewhat apologetic, however she insisted that people were waiting for our seats.    She and her staff will certainly never have to worry about seeing any of us in her restaurant again; we got the message that our patronage was not appreciated.  Never again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "WoDR2zY9us-EnE1Nmecyjw"
  },
  "0Acy1lrpzVjwdILwvZpeJQ": {
    "date": "9/9/2017",
    "text": "Enjoyed the Pork chop special with cannelloni bean and aioli last night.  The presentation was out of this world only to be topped by the awesome flavor.  We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uc8PSb6mLHr6MiZ7IXLFKg"
  },
  "MXENuwN9sIMooNPHsT88Jg": {
    "date": "6/22/2016",
    "text": "Are there on 6/18.    Entree and salad were  okay but not great.   The dessert, Death by Chocolate, was more like paper cut by chocolate.   Very disappointing.    Overpriced for this micro portion of gelato.   A Fancy Fail.    Service was fine.   However, the greeting was basically rude.   We were told we needed to be out of our table by 10 minutes of 6.  Really, when has anyone told someone they NEEDED to be out except for closing time.    Overall experience is worthy of a never return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "CZ1x1uuFPdHgbX7D3FikFQ"
  },
  "ojYPBL1fACfQC_13bEuWfw": {
    "date": "2/4/2017",
    "text": "Horrendous. Terrible service. Waited ridiculously long time for drinks.  Then, get this, they told us they ran out of bread.  An Italian restaurant running out of bread???  Then, the most incredible part: our son's salad has glass in it!  When we complained, they wouldn't even apologize. See pictures attached. But avoid this dump!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IXMltFZ1iEte7eZzyFVXZQ",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States. Chipped glass on our salad. Our son, a singer, almost swallowed. Awful.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IXMltFZ1iEte7eZzyFVXZQ/o.jpg"
      }
    ],
    "user_id": "lJ7OuFMOmnH3NIyYdcLkMg"
  },
  "aL59pochs4lODFHLSd6R0A": {
    "date": "3/25/2016",
    "text": "I can honestly say that I will never return.  This place attempts to be upscale but lack the quality to do so.   Service was beyond slow and I had to keep asking to have more to drink when I could find the waiter.  The food is a LA carte and I paid $8 to have a side of pasta that was the smallest portion I have ever seen.  Definitely not the Italian way! Very disappointing and not worth my money!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "X_y_b2ZjHkJufmZE8TtOyw"
  },
  "VS9mHCm_5LqLvoYjdXHZZQ": {
    "date": "10/5/2017",
    "text": "The bartender is great! The service was okay. The food is very disappointing. We will return for drinks....nothing more.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qgTg9rNKxmrqP4tlxTYP_Q"
  },
  "BPMsFQXXGs8-QO62Zp5s5w": {
    "date": "2/2/2017",
    "text": "Ate with three people; none of them liked their meal. That's pretty much all you need.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "xNRh49i75e6DRB9Ff1GDMw"
  },
  "lZgfoel3aBHYUa7HuadRYg": {
    "date": "5/17/2017",
    "text": "We weren't going to stay but the hostess was so dear we did. Our server Courtney was delightful. Our food was delicious. It took a little while to get our main dish but well worth the wait. I don't think they cook tons ahead. I felt like our meal was cooked to order and perfection. Courtney brought bread and butter quickly. Mine came wit a Christ salad and hubby's veal stew was scrumptious . I can't imagine the negative ratings. If you want quick Italian.. go to Olive Garden.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fNZUpnFHvEfUkab0Quc-Zw"
  },
  "KuJZZIPD9Cgi94mP6JXqIA": {
    "date": "4/19/2019",
    "text": "Thursday evening April 16 my girl friend arrived at Peter Allen expecting to meet her dinner party not knowing the event was canceled and reservations were not made. As she spoke to the host and attempted to contact the person responsible for making the reservation a female employee began insinuating that my friend didn't know what she was talking about in an insulting way  although she was not involved in rectifying the mix up. As this went on my friend asked the abusive employee to please stop by putting her finger too her lips and saying  \"shhh I'm on the phone\". The employee began moving around the restaurant going up to fellow employees, the cooks, waiting personnel, bar tenders so on making the shhh gesture while being verbally degrading. Keep in mind all this is taking place in front of patrons who are there simply trying to enjoy their visit. My friend explained to the employee that she is acting in an unprofessional way and please stop. She also spoke to a manager who defended and was fine with the employee behavior. As my friend left the restaurant the employee followed and continued her verbal assault and abuse all with the managers approval. Needless to say this is a restaurant that I along with those involved in the mixup will never visit and will relate this experience to everyone. My my girlfriend and I spend many evenings visiting the Cultural  Trust venues including speaking with fellow patrons.  We also speak with many employees and volunteers of these venues regularly and we will sadly share this experience and hopefully this is something they will pass on if asked about Peter Allen.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "9L3D7t8v05ToFckcPccArw"
  },
  "yNwd_HgEWi2eITYkamt0lQ": {
    "date": "4/4/2018",
    "text": "Absolutely awful service. Treated me and my friends terribly. Said blatantly racist comments to me and my friends while denying easily accessible requests of pushing tables together. Disgusting establishment. Do not go here.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xb0CAASrak3Y0tVUikgaEA"
  },
  "2gsgYpwz9frh2fqZqcd3-A": {
    "date": "4/26/2018",
    "text": "WASTE OF MONEY!!! I will give this place one star because it was clean and the interior was lovely. However the food was almost in edible. What they called a vodka sauce looked like it was made from tomato soup. On top of squishy frozen ravioli. And the $20 salad my companion ordered, had canned mushrooms and peppers on it which made the salad limp and soggy. The tomato was so pale and grainy it disintegrated paired with this soggy mess. I was actually angry that I made the mistake in going to this place. It really ruined our night out. It's obvious why they had so many open tables.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "vJLH7Xzyyk19C88cSdy5tA"
  },
  "__fUTDri1UiuhYG1JNYfHA": {
    "date": "12/10/2018",
    "text": "Made online reservation for tonight, website says open 11-9. When we got to restaurant, it was closed. We were in town to see a show, thank goodness we found a place close by to eat. There were 2 people eating there  who also had made reservations online and found the restaurant closed. Very disappointing. Phone message didn't even say closed, just said unable to answer.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "w9uQ8CZXhm4uGF7e9S6GIg"
  },
  "TTmMtzwubLfrTvuCWg_4EQ": {
    "date": "3/27/2018",
    "text": "Hair in my soup. And subpar welted salad... i decided to deny the main course and get the hell out of there lol. The lack of attention to detail was concerning. So i didn't even attempt the main course (lobster Ravioli) couldn't get my mind and stomach to stop picturing the hair inside/on top of the ravioli. Especially if it comes out lukewarm like the chicken soup.   I was in town on Business from San Diego... a very reputable \"meat\" place within walking distance of this subpar place restored my opinion of quality food in Pittsburg!!! They managed reservations and seating better also....  i saw so many upset customers while seated...do citizens in Pittsburgh have to come in and argue with owners about reservations like this daily?! Sheesh that place was stressful, you'd think they would create a better system. Atleast someone was able to sit at our table's when we left early. I just didn't complain, denied the main course, paid for everything and wished them farewell!!! #NeverAgain",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "sotopqFXpHPSh6_bbEeYgQ"
  },
  "NvCzc3yZKxxqqitEHaAY7Q": {
    "date": "3/11/2018",
    "text": "Boo!  Not sure how they stay in business ... never again.  We (party of four) were going to an 8:00 show at the Benedum Center - and made 6:15 reservations (which were accepted).  I showed up at 5:40 - 'checked in for my reservation' - I had a drink at the bar, and the rest of our party showed up at 6:00 (15 minutes before our reservation).  We were told we would need to eat at the bar no tables available.  I told her she had a reservation for us ... too bad for us.  We didn't like that option - but at that point, we didn't want to risk being late for the 8:00 show, so we didn't have much of a choice.  That being said, there were only three seats available at the bar - so the manager said that one couple was about to leave, and we could have their seat.  Unfortunately, that couple waited for their check for about 10 minutes - so they couldn't leave (so we all couldn't sit) ... putting us to about 6:15.  We finally got our four seats at the bar - and ordered drinks and got menus.  The one bartender in the packed bar didn't get our drinks until about 6:35.   Mindful of the time, we immediately ordered our dinners mentioning we were going to the 8:00 show.  Salads were delivered to us about 30 minutes later (7:05),  At that point, we were asked to 'move down a stool' as they were cramming another party of 5 at the bar... so we moved our salads, drinks down one and moved down.  We again reminded the bartender we were going to an 8:00 show ... and he said everyone in the restaurant was doing the same.  Nice.  Our dinners arrived at 7:30 ... two of the four were rather cold ... but what could we do?  No time to send them back. Nobody to complain to as they were dropped off and he moved on to the other side of the bar.  Again, since we were going to the show, we had to eat and run.  I asked the bartender to bring the check when he dropped off our dinners as we were in a time crunch (did I mention the 8:00 show?).  We ate our cold veal parm and cold ravioli (which may have been very good if served at least warm).  Now - I don't mean to whine ... and if we were planning on having sandwiches and beer at a bar, I'd understand and wouldn't complain.  But our check was about $200. I have no problem paying for a nice meal and experience; however, to be denied a table when we had a reservation ... and to be moved, bumped and nudged during our meal - only to get served a cold meal.  Nah - never again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 0
    },
    "photos": [],
    "user_id": "jrPaREZroSwk70TnXeWRrQ"
  },
  "sDKD7LkOxDCtcpgHPe0-5g": {
    "date": "9/4/2017",
    "text": "My husband and I were headed to see the show \"Million Dollar Quartet\" at the Benedum. We totally forgot to make reservations. UGH. We drove down hoping someone could squeeze us in. We started walking and found ourselves drawn to the aroma coming from Peter Allen's. we asked if they could possibly seat 2. The food gods opened the sky and showed us favor. We had a nice table right by the window. It was fun watching people walk by to dinners and shows. We let the server know that we were theater bound. Our server did not disappoint.  I ordered the Shrimp Scampi with fresh pasta as my side. Where do I begin???  The pasta was fresh made and pillowy soft but not mushy. I could have eaten a portion of just that. However it was topped with huge plump shrimp. They were generous in their serving of shrimp. The shrimp and pasta were tossed in a Scampi sauce that was outstanding. You could taste the butter, white wine and the fresh garlic. Thankfully I had Altoids so that I didn't carry my garlic breath to the theater with me. My husband wanted to try mine but I didn't want to share. Then I saw his dish and traded food. He had Chicken Parmesan. Holy Cow!!  It was two huge pieces of real chicken that were juicy and fried perfectly. They were topped with some of the best marinara I have ever eaten. It was full of flavor and the perfect consistency for this dish. Then it was topped with gooey, melty cheese. It was like the icing on the cake. Speaking of cake they had fabulous choices for dessert. Everyone around us was ordering it and it all looked delicious. I was so full I thought I was going to have to roll to the theater. I asked if they would be open after the show because I would have gone back for dessert. Sadly they weren't going to be. That's ok though because I'll be back to try more dishes and I'll save room for dessert. Great service, great food, and a beautiful dining room = 5 stars",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "yrOz0AINdk5TzyvUUwI6cA",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States. Shrimp Scampi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yrOz0AINdk5TzyvUUwI6cA/o.jpg"
      },
      {
        "img_id": "E7FXA3TkyMSOkHUeJuF_EQ",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States. Chicken Parm",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E7FXA3TkyMSOkHUeJuF_EQ/o.jpg"
      }
    ],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "31_KPdd865vTkDFHg_q-0w": {
    "date": "4/30/2019",
    "text": "Had dinner at Peter Allen's Saturday evening.  Took waitress 25 minutes before she waited on us.  She waited on 3 other tables of customers first that came in after us. When she finally waited on us she was not very pleasant.   Service was very slow.  Got there shortly before our reservations at 6 PM.  Finally waited on us 25 minutes later and got out of there at 10 minutes to 8 just in time to get to our show at 8:00 PM.  Could not even enjoy our meal as we were so rushed.  Not even enough time to enjoy coffee and maybe dessert.  Did notice several tables around us people complained about the food and service some even left without finishing their meals.  Have eaten in this restaurant for many years.  Have noticed lately that the service, etc.  has gotten bad.  Everything is ala carte, drinks are expensive compared to high end places.  Had Chicken Marsala and meat was swimming in the juice. Tables are so close together very crammed.  Can not have a conversation without table next to you hearing it and can hear conversation of people  next to you.  Very disappointed not the same anymore.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "r9IEfQS2c9ClT6VXH1gN0g"
  },
  "DG4LD5YkZ1axRqZgUk3B5g": {
    "date": "3/14/2018",
    "text": "Worst restaurant in Pittsburgh. Poor service. Dishes and plates look like they were bought secondhand from Goodwill's.  And food tasted horrible. We were forced to go there because of the shows. Never again.  Even Fast-food place can do better.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "yMuQuE0L6Ntg4RlzmLeTlw"
  },
  "5WFyMw8kFmjHGB1bGbgpSw": {
    "date": "4/14/2017",
    "text": "This has been one of the most disappointing restaurant visit. It started with the Moscow Mule I ordered.  Half ginger beer half seltzer water and vodka.  It was very bland and tasteless.    Started with shrimp bisque.  This is where the decline becomes steeper.  The bisque was mediocre at best.  The letdown was a couple of tiny salad shrimps at the bottom.    Now the entree.  I ordered seafood pasta.  The first bite was the mussels.  It was rotted tasting. Then I saw the same tiny salad shrimps.  The calamari, I found 2 rings the size of a dime.  Look at the photos I posted.  You can see the tiny shrimp and the mussel in the shell that looks like a black raisin.  The taste of garlic was non existent.  Just oil and noodles.  $35.00 for the most disappointing entree ever.  Our whole bill was $272.00 for all of us.  Never again will we go.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LBHCKFfn-hGHAEg9xBAIvA",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LBHCKFfn-hGHAEg9xBAIvA/o.jpg"
      },
      {
        "img_id": "IDqXlPwCJeznzi0H9xAYDQ",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States. Terrible mussels and salad shrimp???",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IDqXlPwCJeznzi0H9xAYDQ/o.jpg"
      }
    ],
    "user_id": "VRdJSHIZnJ376f2fv5NYBA"
  },
  "ne6gbIQZxr63Q6V84uv-xQ": {
    "date": "10/26/2016",
    "text": "We stopped in for drinks before a dinner elsewhere and enjoyed ourselves so much we stayed for 2.  The place is newly remodeled and has a nice atmosphere.  We had martinis and they were extremely well made.  Stirred, not shaken.     The bartender was friendly, but does something that seems to be the new trend among restaurants and retail shops.  Even though they are waiting on you, if a co-worker starts talking to them they totally drop what they are doing with you and focus on their co-worker.    The Pittsburgh symphony was on strike, so some of the musicians sat in the restaurant and played.  It was extremely enjoyable and fit well with the atmosphere.    We had nice, friendly customers around us, so all in all, a good stop.  The restaurant was packed with what looked like many regulars.  That should mean something.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AXBsPgSbyjGkAqPLSwiTYg"
  },
  "bErh4IB5vLlfpheRFuUQ7g": {
    "date": "7/28/2017",
    "text": "I've been in PGH 7 years and never had the urge to visit Peter Allens. Then they got a modern makeover and on a blustery day, I shuffled in from out of the cold & decided to test them out.   It's really gorgeous inside- clean and chic. Before our entrees arrived, a basket of mixed breads arrived at our table with butter. When we ran out, the waitress asked if we wanted more, which was unexpected but nice. My SO and I are both vegetarian and I ended up ordering fettuccini alfredo and he got mushroom ravioli ($19/plate). My alfredo was rich and delicious. The noodles were cooked to perfection. I hate an overlooked noodle so I pay close attention to that. Like most Italian places, the plate of pasta was huge. The mushroom ravioli my SO got was also delicious but we decided my dish was the winner. The entrees also come with your choice of soup and salad. The salad came it with a bowl of freshly grated Parmesan, a nice touch.   I kind of didn't want to like it there. It's a little more $$ than I usually like to spend eating out... but I know we'll be stopping in there more regularly now. In the future, I think we'll actually just split the fettuccini alfredo entree and that will put the restaurant back in our price range for a quick bite to eat before or after a show.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "myKVt2Hf-FhuEBuLMDztbA"
  },
  "cj_CmCBq4JP9u977O8aMJA": {
    "date": "11/21/2017",
    "text": "I tried their chicken marsala. The sauce was watery. I complained to the manager who blew it off and said that that was the way it was made there for the past 20 years. Pathetic. Very rude, told me it was comped on him and to never come back to the restaurant. I wont.  Anyone who has a taste bud which works knows that a marsala sauce has some body to it. If you look up this in the food channel it specifically says something to the effect of a thick sauce.  Wikipedia indicates that the marsala sauce is a reduction made from the juices of the meat and marsala wine. Again, not like water. I hope the owner of this place gets his or her act together and gets someone competent. There also needs to be a major cook upgrade. Please note that I used the work cook and NOT chef. Horrible, bad marsala for an italian restaurant. Horrible rude manager.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zpohd93kIjLW8ZTuua0Exg"
  },
  "8qn3EiDjKf9Zbp-h5BaScw": {
    "date": "5/5/2018",
    "text": "The worst service I have ever encountered. After being seated, we waited 35 minutes (and that was after I spoke with the hostess) to have water served. They were out of nearly everything on the menu. Once the salads arrived, I realized that they had also neglected to give us flatware. They so disorganized and clearly untrained. Absolutely DO NOT RECOMMEND. There are a number of other great restaurants just down the street.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9W5HlQ-ryKMiFIDx1fLAAA"
  },
  "-D8kNOKgEXKWRht3-p3NFg": {
    "date": "1/26/2018",
    "text": "Wow.  Such terrible service. Sat at bar.  Bartender, who later identitfied himself as the owner, did not offer any specials, never checked after the meals came out and was too busy schmoozing with some of his regulars to make sure we had the bare basics in service.  We would have ordered more drinks, but he never checked back in. Then threw a public fit when we told him the service was sub-par.    Food was decent, not wonderful.  Service was a zero.  Won't go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "zOwvn2M9gZCgnRQDD5HsBA"
  },
  "x560T8ySbU2LL2LgnxerQg": {
    "date": "11/18/2017",
    "text": "there are no words for such horrible treatment   watch my video   <a href=\"/redir?url=https%3A%2F%2Fyoutu.be%2Fvh3sc4le-cs&s=6d7f5757c37315976e178a6bf4a1be21d9354e1cb3f8168c46f9781552b98d25\" target=\"_blank\" rel=\"nofollow\">youtu.be/vh3sc4le-cs</a>  Watery sauces and I was told no bread or garlic bread here at all . This is no Italian restaurant with a name like Allen   We sent back a watery masala sauce entree and were told they've been doing things the same way for 20 years   Then we were told to leave and never come back by the owners brother no less  There were 10 or so other customers listening as he yells at us in a condescending fashion   The waitress seemed like she was abused by a domineering boss  Other yelp reviews explain this joints dining disappointment   They need to close shop and leave town  as they are an embarrassment to pasta and tomatoes  Universal bad experiences here",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "iH_fFp5HO4DI1DmZM4vQcA"
  },
  "XvaywPjlD_lo7VBeqygZtQ": {
    "date": "2/3/2018",
    "text": "The fact that we could get a reservation on a theater Friday should have been a clue!  The main issue last night was NO WORKING BATHROOMS during dinner service!!!  They should not have been open.  Unacceptable.  Food was mediocre and service the same.  We will not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WP4fxh1_O7JycFmeIntw_w"
  },
  "hAZLxtQpPQDaSWIX3rmgBg": {
    "date": "7/15/2018",
    "text": "Some good things, but mostly bad.    We stopped for dinner on Friday night, and I was looking forward to eating here.  Unfortunately, the experience wasn't great.  Food - The food was mostly good.  We shared the fried zucchini that was excellent. I had the mushroom ravioli that was very good.  My wife had the tortellini that she said was good, and my son had pasta with bolognese sauce.  He said it tasted ok, but the bolognese only had a few flecks of meat in it, when usually bolognese is full of meat.  I added a meatball to my entree and it didn't taste good at all.  Definitely not worth five dollars for a small meatball with an off flavor.  Cocktail - I ordered a Manhattan on the rocks.  The bartender obviously didn't know how to make this classic drink, because it had been shaken with the ice like a cocktail, therefore watered down and tasteless.  Service - The service is just the worst ever!!!  First, we were given the wrong menus.  I'm assuming it was the lunch menu because it was basically the same menu as the dinner menu with lower prices.  The waiter comes over to our table and literally rips the menu out of my wife's hand.  Then says, you have the wrong menu.  He brought us bread with butter that was ok, but the tables around us got butter and also dipping oil for the bread.  There were only a few tables, but everything took forever to come out.  I even waited 15 minutes for a watered down Manhattan from the bar.  He brought the entrees and we had to ask for Parmesan cheese.  This is an Italian restaurant, that should be an automatic thing!  The table next to us got their entrees before their appetizer.  The table across from us ordered the fried zucchini as recommended by the waiter.  He said it is the best in the city.  Then, brings them fried Calamari, and no zucchini.  He took the calamari back and brought them their zucchini when they were half done with their entrees.  We ordered dessert, and once again it took forever to come.  When it did arrive, the waiter said there were plumbing issues in the kitchen that he had to take care of.  Really?!  I had the house made tiramisu.  It was just ok.  Nothing special.  My wife ordered the pecan ball, that wasn't a ball at all.  It was just a scoop of vanilla ice cream with a few pecans sprinkled on top.  Got the check and was surprised to see a $2.00 charge for horseradish sauce.  When I ordered the zucchini, the waiter asked me if I would like both marinara and horseradish sauces.  I said yes because I like horseradish and my wife likes marinara.  He never said anything about an extra charge.  It was ok though because I took the $2 out of his tip!  The food here has potential, but if the staff doesn't get some serious training, this restaurant won't be around very long.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XL-i-mpvP5Sf0y3mMNJOZA"
  },
  "NIkcBwe3R_dVuc3o6GRDdQ": {
    "date": "1/4/2019",
    "text": "The one star review is for the hostess (I believe her name is Carol.) We were greeted angrily by her as if entering the restaurant was disturbing her.  To be fair, the food is very good here. Service is hit or miss. I've been here several times before shows and some servers are good and others are bad. I didn't have a reservation this time (Don't tell Carol!) so I happily sat at the bar. The gentleman at the bar was excellent. He refilled drinks in a timely manner. The zucchini was great and was served in a timely manner. We enjoyed a lovely meal and I forgot all about how rude Carol was. Then the check came and we were about to pay it. When I was just about to fill in the tip line, Carol was standing behind me and said we needed to get up because two people wanted our two seats. I explained that I was signing the credit card slip and would be finished in a minute. She said I would have to fill it out some place else because she needed our seats. And right when I was about to fill in the tip line. What wonderful timing on her part. I apologized to the couple waiting for our seats and said we would be finished in a minute. They were horrified and told us not to rush. I try to give this place the benefit of the doubt because generally the food is good, but I'm done. Treating me like that when I'm paying a $150 bill is unacceptable. This is the last time I make this mistake.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u3Qiz5xic5NImWcEFGtDxg"
  },
  "XniC1HXhQ8GBOLpbz43Xbw": {
    "date": "12/11/2016",
    "text": "Super slow service. I don't know if they were short a cook or a waitress or both.   The fried calamari was delicious and generous. I'm glad we ordered it with our drinks because it was another half hour before our waitress took our dinner order.   I ordered the sea bass.  \"We don't have it.\" I ordered the scallops.   An hour and a half after we sat down, our food arrived. It tasted fine. Maybe I'm ignorant but i feel like for $30 i should get more than 5 or 6 scallops and a tiny cup of soup. Maybe like a veggie or starch (or dare i suggest both?) to accompany without paying extra.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HSmZpPZhcQhcNUJfImWkhA",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States. Scallops entrée. For those small of stomach and large of wallet.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HSmZpPZhcQhcNUJfImWkhA/o.jpg"
      }
    ],
    "user_id": "x__ynWxbRxuqjFX9CbDy7g"
  },
  "izSec5xD7Uy2ijp5MvgqFA": {
    "date": "11/18/2018",
    "text": "Great environment and staff. Very pleased with pasta selections as well as seafood dishes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "htBlNRioJdm1ptve9Iwm9A",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States. Oyster App to start the evening...Fresh Horseradish is delicious",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/htBlNRioJdm1ptve9Iwm9A/o.jpg"
      }
    ],
    "user_id": "BB4YYk-gfyitfbnu5SdnrA"
  },
  "Oq1BeEfH-OnestoAPgBDbQ": {
    "date": "1/8/2019",
    "text": "Yikes! We had a reservation and the hostess with (not) the mostess was eager to tell us we didn't have a reservation. Even after showing we did via voicemail, we resigned to the fact that we should just sit at the bar. (She was very confrontational.) After being seated at the bar and enjoying ourselves, she approached with a packet of papers to further prove the now mute point that we did not have a reservation according to her records. The food took 1.5 hours, it was highly salted, and we watched an open table never have people seated for the duration of our visit!  Won't be returning but enjoyed the adventure with family and friends.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "m5DKyn4kvtfeLatjwmC5Ag"
  },
  "3oiN6K-KEnZzrWt7gPDjAg": {
    "date": "3/1/2019",
    "text": "I highly recommend reservations and an early one if attending a show on Friday evening as our group of 4 did.  We had a 5:30 reservation and were seated very quickly, there were fresh rolls and bread and butter on the table and we were given water quickly also.  Our server took our drink orders quickly and gave us a few moments to check the menus and returned to tell us the night's specials.  We all 4 ordered salads, the balsamic dressing was very good.  One of our party was given balsamic instead of the ranch she had ordered, but, liked the balsamic so much she chose not to mention it.  I ordered one of the specials, lemon chicken with mushrooms and artichoke hearts over angel hair pasta, it was excellent and quite a few mushrooms and artichoke hearts which surprised me as most places skimp on both.  One person ordered the fettuccine Alfredo with chicken and said it was very good and the serving was quite large.  The two others both ordered ravioli, one had meat filled and one chose cheese.  The person that had ordered the cheese ravioli was given meat, but, they quickly brought her what she ordered and she said it was good.  We did hear a few tables near us who were later than us being seated complain about slow service or a lack of any service after being seated and we did notice two tables walk out due to not being waited on.  Our experience was good, maybe the people that came in late did not have reservations.  The servers were all very busy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n9Yj2EdQwDRjREji3r4ZkQ"
  },
  "gX8T76WBm00xF8uf3Gbxhg": {
    "date": "3/5/2018",
    "text": "Worst Manager I have ever met. If negative stars would be an option, the screen would be completely full. I am 47 years and have Never seen someone with such a negative attitude.  Stay Away...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 0
    },
    "photos": [],
    "user_id": "74Y6ze0K4PBRcODUhsaNKw"
  },
  "-Ch1QS4wFqcDdbLfQ57EmQ": {
    "date": "9/18/2018",
    "text": "Wish I would have read the reviews before deciding to eat here, but we had limited time before a show and made a quick decision. The food quality is poor and overpriced. They were also out of several items. Service was pretty good. We had the ravioli and ordered the zucchini appetizer. Unfortunately, the ravioli were not homemade and to be honest tasted like poor quality frozen ones. The zucchini was salty and some pieces were not fully cooked, so the breading was pretty much raw. As we sat waiting for our meals on the patio another couple leaving was complaining to the hostess about their meals. I find the reviews on here about this place to be pretty accurate. We will not return, and I don't see how this establishment can survive if food quality and service continues to lack as they currently   Follow up to manager:   If every dish is made to order and you are telling me that my ravioli were homemade then your establishment is missing the mark even more so, Dan. From the comments made by your other guests it appears they also have the same distorted impression that I have. I work in food service industry and through by my experience onsite and your arrogant replies to other customers on here, it's obvious that your customer service approach from top down is a critical element that is lacking. Customer service, hospitality and courtesy significantly impact guest satisfaction and unfortunately this appears to be worse off than your food quality. I would never return and will be sure to pass the word along to others as well.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "kMWzWzAGxc6Zvo4kuSvx4Q"
  },
  "UDodvCBFwn3fVj2i_n1DWg": {
    "date": "1/29/2019",
    "text": "Server Dustin made sure our dinner was amazing. Our server gave us great recommendations on food and wine pairings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yAw2g8Y-VXrIAEoW2TzImA"
  },
  "ugn6CAGMAU5cX8h874GUxQ": {
    "date": "2/10/2018",
    "text": "I will NEVER go here again. We were over charged and the waiter made derogatory remarks about women!  First, we (6 women) were greeted indifferently by the owner, as if she was doing us a huge favor by seating us. We were there for an early dinner after a show and the place was empty at that time.   Our waiter was obnoxious. He kept suggest we share things. That really bothers me. Also he often mixed things up. He'd say they were out of a certain wine then come back and say he was mistaken.  As we were waiting for our dessert, we heard the owner tell our waiter, \"We need to get these ladies out of here.\" We had been there an hour but this was not our fault. We were only wait to be served.   The waiter came to tell us that there was only one ice cream roll (2 of us had ordered that). One switched her order. However, he brought random desserts to both women who ordered the ice cream roll!   When our checks finally came, they were all wrong. We politely asked him to adjust them and he argued about who ordered what! I assumed he wouldn't charge my friends to whom he brought random deserts, but he actually charged for both desserts! When he gave change, he short changed one friend then argued about it and yelled, \"I'll never split the check for a table of women again!\"",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "0LMXfK_SreN1q1DcuE8vJA"
  },
  "SnP4dgq2PRpxQ4e9Q5uZMg": {
    "date": "3/25/2019",
    "text": "I was there this past Saturday arrived on Time for my reservation at 6:00 was there 1 hour and 40 minutes and still no food the waiter keep saying its coming I said cancel my food I have to go to a show in 15 minutes he still brought the food out put on the table behind us and said it's there if we want it I said just the bill they still charged me for the coffee and one appetizer the service sucks and the host is nasty did not care a bit the 3 couples next to us said they will never come back they do not deserve even 1 star sucks all the way around close your doors",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "CwPJaCQazyKMOcpTw58Q5Q"
  },
  "aR-4zGbLnWBBDj_AWvTBWQ": {
    "date": "3/1/2019",
    "text": "Very rude hostess to start.  My husband was just going to get soup with our zucchini and we were told that we would be charged a $25.00 sitting fee if he did not order an entree!  WTF is that?  I didn't even know that was thing!  Plenty of other good restaurants in town to go to with less snotty atmosphere.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "SfGBimy_RhQmtMo5_yB59w"
  },
  "eUa_2B321Ve-EtP1Ll6kbQ": {
    "date": "6/9/2019",
    "text": "This was the absolute worst dining experience I've ever had. I was here tonight with my family to celebrate a birthday. Our reservations were at 5. We placed our order at 5:20. At 6:40, our waiter came out to tell my father in law they were out of what he ordered. At this point, we had a 7:00 show to get to. We asked for our food to come out in to go boxes (meaning we'd be going to our show hungry). My sister in law, who has severe food allergies, ordered a steak after being assured there were no sesame seeds in the entire restaurant. After seeing bread with sesame seeds on tables, she was told it was too late to cancel her steak and it was still on the bill. The manager was unbelievably rude and unapologetic about our experience. After multiple conversations, the steak was removed but the remainder of the bill was presented in full. On the way out, we had one last encounter with the manager/owner. At this point, she actually became somewhat aggressive with my husband, who was holding our one year old son. Can't comment on the food since we never actually got to eat it!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9jip7qbY97cep4yRp82mA"
  },
  "J5RgOMedGnqM99uDv5cBnQ": {
    "date": "8/1/2018",
    "text": "Abhorrent.  We sat at the bar for dinner arriving 1.5 hours before the symphony. The bartender, Lisa, feigned exhaustion and was overwhelmed with simple requests for menus and drinks. The food was terrible and over-priced and the service was worse than the food.  Entrees took 1.25 hours to arrive and we ended up being late for the show. I'd say this place is one of the worst restaurants in Pittsburgh.  Run. Don't walk, away.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "DYQkOZaLaosmC2fjBRsVPA"
  },
  "ptj4H2xfIwtCo6nI8RALRg": {
    "date": "11/6/2018",
    "text": "3.5 stars. Allergy friendly and a large menu of fairly good food, but with prices on the high-side. Service is ok. However, super-convenient to Heinz Hall.  The fact that this restaurant often has seating when the other restaurants are booked is a tell. However, if you have tickets for a nearby show this is much better than a Slurpee and hot dog at the 7-Eleven next door if everything else is booked.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fEo1C7GJlK8HlfRfNouLbw"
  },
  "2E_SS96r4xvNh9_uOvnv9w": {
    "date": "8/24/2018",
    "text": "Great location, mediocre food, worst possible service  Location: closest restaurant to Heinz Hall and the Benedum Center-- but there are other, far better restaurants just steps away.  Food: you'd do much better at Olive Garden.  Service: Appalling. World's rudest hostess. Some waitstaff are pleasant enough, none that we've encountered (3 visits) is competent. It's not unusual to make a reservation in plenty of a time for a show, advise the waitstaff you're going to the show-- and then either not get your food *at all* before you have to leave, or have just 5-10 minutes to gulp it down. When it arrives, it's often bland. Chicken is loaded with gristle. Bread is ice-cold. And your bill will probably be wrong. If you complain-- no matter how politely-- the hostess will be snarky, snide, and very publicly unpleasant. This place wouldn't survive if it weren't for its location.  Bottom line: 3 strikes and they're out-- we're never going back. Save yourself some trouble and go elsewhere. You'll be glad you did.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "JXUlLovTdKaN9iUBwdEe_A"
  },
  "1Yv9rZRcQj4NL-FGPpmkkw": {
    "date": "7/22/2018",
    "text": "Noodles were still hard, bugs continually flying around and into food, kitchen made substitutions to food they were out of without even discussing with us first, found out they were out of various food well after ordering.  Our $50 bottle of wine was a $8 screw top.  Waitress was very nice and apologized for the embarrassing experience but was unable to adjust the bill.  She did buy us desert out of her own pocket.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "xMVPBWAap_bTi-MiTid8-A"
  },
  "G6Xa2LtCSFGEQFjV8Im7JA": {
    "date": "7/15/2018",
    "text": "This was the absolute worst experience I've had in Pittsburgh. The atmosphere looks to be elegant, and sophisticated, but the entire experience was just the opposite. The service was terrible. There's fruit flies, and flies all throughout the restaurant. The food was extremely salty. It lacked the detail, and attention of a fine restaurant. What ever you do please don't waste your money on this place. It was not relaxing, or enjoyable in any way.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "DdZxYRdxg2ynCBeGawl4Nw"
  },
  "KulbbXhY-fBWe3O6o9Czgg": {
    "date": "4/15/2019",
    "text": "I've been to Peter Allen's twice for dinner.  Both times have ordered the greens and beans as my entre, although it's listed as an aperitivo. You have a choice of Italian sausage or potato to go with it and I've gotten the sausage.  Their version includes a homemade tomato sauce plus onions and altogether this is THE MOST DELICIOUS DISH!  The dish is generously sized, so it works well as an entre.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O-a2CAZ6hzzqtknJvSJfBw"
  },
  "bBHm6O5whyXBurRLnebUAw": {
    "date": "12/17/2017",
    "text": "We went by the Google rating and landed up for some pasta at this place and within the first 5 mins of us being very indifferently greeted and seated at the bar by the hostess we realised it was a bad bad decision !! I ordered a basic pasta with olive oil and garlic and it was so oily and terrible !!  The service is terrible with the staff lost in their own conversations ..  Lesson learnt - Never coming back here !!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "DvDTvGTSAt7mc7fC9ZKoTw"
  },
  "wQZg-PZtjQEIaLt6SIj1qA": {
    "date": "2/2/2019",
    "text": "This was our first time at Peter Allen's. We had tickets to a show across the street at Heinz Hall so it was very convenient. Pricing was typical for a downtown Italian restaurant. It would have been nice for the meat dishes to come with sides for the price you were paying instead of having to pay a la carte prices. The pasta dishes were rather small in portion size but still tasty. My father really enjoyed his portobello mushroom ravioli. The atmosphere was pleasant but very tight. When we first came in there was a line to be seated even though we had a reservation. When we reached the hostess stand the hostess (who we later found out was the owner) was rather rude and was not very friendly when we told her we had a reservation but she couldn't find it. She told me \"I should be nervous\" with an arrogant attitude when she couldn't find my name. I showed her my confirmation email that we had a reservation. I wanted to say you should be nervous because we can take our business elsewhere. The waiter, Dustin, was the best part of the whole experience. He was extremely personable as well as attentive. He was very funny and knew his job well. Besides the rude hostess it was a pleasant experience. The wine was delicious also.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "h6DjQJG-dNPoymH5tMonsQ"
  },
  "ZSYYv_d_R9W_n0p3CfX_3A": {
    "date": "1/20/2019",
    "text": "Food was very mediocre. Veal was tough and seafood pasta was tasteless. We won't be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "G1hANYOOkR0ZOvuRvFXo5g"
  },
  "gQG2BwAjSUHOUJ_EeDeZKA": {
    "date": "11/10/2017",
    "text": "I would give this place zero stars if I could. Calamari was greasy and totally overcooked. Thought I'd get the fettuccine Alfredo because you can't mess that up, right? WRONG! The sauce was watery and tasted like bleach. Service was not great. Watched a waitress have a conversation with someone while pouring water out of a pitcher onto the floor. Would never go back again even if someone paid me. Wasted $60 on hot garbage",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "kaG8FJ4ISF6p9KDVwOulMQ"
  },
  "GCkLudgWOJ4OA-eqdu_YAg": {
    "date": "6/10/2019",
    "text": "Stopped in for a late dinner after the Pride Parade. They were extremely busy with guests coming and going to the theater. We were offered a seat at the bar. Heather, the bartender was busy, but very attentive to our needs and got us another drink when we finished our previous one. We chatted with another couple, Suzie and Mo, seated at the bar while waiting for our meals. Everyone who worked there, from the servers, Dusin and Crystal, to the owner Carol , were friendly, personable and chatted with us after we finished our meals of chicken Parmesan and chicken Alfredo. They were very welcoming, accommodating and made us feel as if we were part of the family. We will definitely be going back when we are in town again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KzZZQ0a4Dwg2AEuYSG-a1w"
  },
  "la_rVJHgcdOf-HnKyMx-xw": {
    "date": "3/28/2019",
    "text": "Its never good food and good service, one or the other fails in my experience.... and it goes like this  I work in town and the menu at Peter Allen's is lovely and such a treat, today we order the famous zucchini ribbons, stuffed peppers and beans and greens.  My guest and I enjoyed the 3 slices of bred, when I asked the waiter, who did not share his name, for more bread he said \"its only lunch girl\".  Such a funny man.  When he came with three more pieces of bread, I asked him if he could smile, he said there was nothing to smile at.  (This reminded me of NYC dining at its finest.)  Our food came plated beautifully and very hot, yummy to dig right into but   my guest asked for a serving spoon so we could share our three appetizers, our waiter was gone for a while and returned with water, no spoon.  We reminded him, he brought one spoon back, we had three plates.  Not to be derailed from our intentions, we made it work.  He returned a while later and asked if the food was up to our expectations, and I remarked how we only come for the zucchini its so good.  He shared that it he learned it tasted like Tambellini's.  Very good fact to share, thank you.  Meanwhile he dropped the silverware on my friend and fumbled with the plates.  Of course we had left overs and he came back to box them and placed them in a bag.  We calculated the bill and tipped 18%.  He left with the cash and then came back asking if the service was not superior as he usually asks that when the tip is less than 20%.    I kid you not, this has never happened to me ever, he did that because he believed he was owed another two dollars.  My friend opened the bill and told him we would work on it.  He stood over her waiting (awkward), she said we will get back to you on that.  We discussed what to do and left the money in the black book on the table, as we were so astonished at this occurrence.  Usually the manager is at the bar or front hostess area, but she was not.  I waited a bit and then chose not to say anything as we left.  They had four tables in service during this lunch-hour.  Peter Allen's ... food -vs- service food won today.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "y_Z79IzC-R-BDtqjOikmVA"
  },
  "Mj74LdSxQYN9reW9fRfYKA": {
    "date": "2/10/2019",
    "text": "On a Saturday night this place was SLAMMED so I get it. But it took an hour and fifteen minutes from walking in the door to our getting food. It was a little annoying to watch the two nearest tables get their food before us, despite coming in AND ordering after us.  My husband started with the chicken pastina soup which we both loved. I got the soup du jour which the waiter described as \"some sort of chicken pot pie soup\" lol. It was so boring the crackers were my favorite part.  My husbands chicken Alfredo was good. The chicken had good flavor but several pieces had that over cooked rubbery texture. I got mushroom ravioli which had amazing flavor, but had clearly been sitting out a while before coming to my table. I would have eaten all of it if it weren't room temperature.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W0WcSYkVaE1wMt8ESaSpIw",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States. Mushroom ravioli",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W0WcSYkVaE1wMt8ESaSpIw/o.jpg"
      }
    ],
    "user_id": "oDYCzHu82JI9BYhmRt4pKA"
  },
  "VkbWrvS0ea9pcMY7KkZo2g": {
    "date": "9/15/2019",
    "text": "This is probably one of the worst restaurants I have ever been in my life. The food is not good at all and even worst is the service. We were badly treated by a male server who didn't even think we had the right to ask for silverware. It's a real shame since it is such a great location in the theater district. If you want to have a nice evening please avoid this restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gJpvI-_mhnAHhCV4l8Wk4Q"
  },
  "BHGUYiA6yX3PkjhlPjYXKg": {
    "date": "2/26/2019",
    "text": "I hadn't been to Peter Allen's since they remodeled from Franco's Italian and renamed it. I like the look better now and the atmosphere at the bar if you're just getting a drink is better. However, the food is the same overpriced food that's just okay, the tables are SUPER CRAMMED together (when they seated people at the table next to us, one of the people at our table was as close to their table as ours) and the service wasn't that great.  Service was fine until he dropped off our check, then the waiter completely disappeared. For AGES. He came to surrounding tables, but I tried waving my arms like crazy and he never looked at us. Remember how close I said the tables were? Imagine how he could have managed to talk to those at a table we were practically on top of WITHOUT noticing us...   There are so many great restaurants in the area (many of which aren't even as expensive). I'd rather pay a lot of money for great food and service than a lot of money for a cramped table and service that's only okay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "ZnIaEvJwrxlBUjimIpx2Qw"
  },
  "aTr7e37ZbTiJxOhDdPXqXg": {
    "date": "11/25/2018",
    "text": "Here we are presented with the age old dilemma of Italian places.  Is it better to have a name that kind of rhymes with Italian (like Peter Allen) or to be actually, you know, Italian  In search of this answer I ventured to Peter Allen's Italian (hey that kind of rhymes!)  I kept asking myself \"How can this pasta be so bad when Peter Allen kind of rhymes with Italian?\" Surely actually being Italian wouldn't help with cooking Italian food so the decided lack of Italian-ness in the name was of no hindrance  As I slogged through a rubbery plate of Calamari my mind wandered   Why name your Italian restaurant Peter Allen? It kind of rhymes with Italian and maybe that helps a lot with marketing but I'm now finding out that doesn't help at all with the actual cooking. I had been very wrong.   The name got me in the door but I was finding the lack of cooking skill to be a real problem now that I was eating the food, how wrong I was. What else am I wrong to assume  What if he only picked Italian because his name kind of rhymes with it?  If his name had been Peter Herman would I be eating terrible weinerschnitzel right now?  I'd write more but this place has robbed me of my will to live  0/10 Don't be fooled by cheap rhyming tricks",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8FbnfMDyB_nGXIzU0-Y2xA"
  },
  "QNTRnTj_tS_PwM9-JJ3wuw": {
    "date": "8/4/2019",
    "text": "We ate here after a matinee at the Benedum. It was not busy and the convenient location across from Heinz Hall influenced our decision. Service was excellent - Deb was very attentive and our salads were brought out promptly, followed at a decent interval by the main course. My wife and I both ordered a special. It was good - nothing spectacular. As others have mentioned here, seating is very tight.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KVqZbvdEMovU2kVaZqA1fg",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States. Lemon Chicken special",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KVqZbvdEMovU2kVaZqA1fg/o.jpg"
      }
    ],
    "user_id": "G0pvGqZ45xy4XGhTRJj0aQ"
  },
  "51Esh1CBqUcRPD5rffTeKw": {
    "date": "11/3/2018",
    "text": "My wife and I visited Peter Allen on a Friday night. The restaurant wasn't completely full the time we were there. However the dinner seating area is pretty small and crammed.  My wife had the chicken romano ($24) and I had the chicken parm ($26). Both dinners come with either a soup or salad. These dinners do not come with pasta (extra for $8).   We thought the food was good even though for two pieces of chicken seemed a little pricy. Looking back we should have at least split the pasta for some different taste. The wine prices are reasonable. With food and a bottle of wine look to spend around $100 for two people.  One thing we wish to change, is more selections of Italian bread with homemade olive oil dipping sauce.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6T27agvS423_eVg64q3Q_A",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6T27agvS423_eVg64q3Q_A/o.jpg"
      },
      {
        "img_id": "vfGKfoM7FHwAZB6VXo2Kqw",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vfGKfoM7FHwAZB6VXo2Kqw/o.jpg"
      }
    ],
    "user_id": "29QPn3Iw0jEB4PiHB-iwrQ"
  },
  "RDsB9pc52JQSk0tVzOX3_Q": {
    "date": "7/25/2018",
    "text": "Very basic Italian dinner.  There was not one thing that was the slightest bit impressive about this restaurant; which would explain why it was the only place that we could get seated at (6:30pm on a Saturday).  We tried 4 other restaurants and each had over an hour wait. We ended up getting 3 baskets of bread because our food took FOREVER.  My friend got the chicken piccata - literally 2 slices of chicken and no pasta or veggies for $24.  Ridiculous.  She said it was good but certainly not worth $24.  I got the lobster ravioli.  The insides were dry.  Never had that issue with ravioli before...  Anyway, don't waste your money.  I only wish I had checked Yelp prior to dining here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2joS0SE239mLbmSEumGCWg",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States. Just chicken...no pasta...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2joS0SE239mLbmSEumGCWg/o.jpg"
      }
    ],
    "user_id": "UcSWk8yWJL5uGEklwW5HMw"
  },
  "39OvPlDHLKsqSeQC_Fvymw": {
    "date": "2/9/2019",
    "text": "When I walked in there was no one to greet me despite them not being very busy. I went and sat at the bar a just hoped that someone would take my order. I got the lobster ravioli the food was ok but not really worth the price. My bartender/ server was very nice and attentive but the manager?/hostess was so rude and so loud. She was cursing up a storm talking to one of the waiters andI thought it was just very unprofessional. When I was getting ready to leave I saw a group of elder black women leaving and the hostess was shouting at them and making a scened and being extremely rude. As I walked out and talked to them and they told me about the terrible experience they had. They said they came 5 min late to their reservation and the hostess immediately started yelling at them and tried to turn them away. Then when they finally got seated and ordered, it tool over an hour for them to get their meals despite only getting salads. They told me that people who got seated after them even got their meals before they did. They think the manager/hostess had something to do with their meals taking so long. Overall the food is decent but not worth the high end prices and DEFINITELY not worth the harassment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ewBToyfEQkXbH8JZLrmmJQ",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States. Lobster Ravioli",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ewBToyfEQkXbH8JZLrmmJQ/o.jpg"
      }
    ],
    "user_id": "dcaM83FOnpuqxGJt4EABZA"
  },
  "ofDHkoHE6mHy_i8fvafxZg": {
    "date": "7/15/2018",
    "text": "Beautiful authentic Italian restaurant. The food was amazing. I haven't had anything so flavorful in a long time. I ordered Chicken Marsala and the soup. Delicious. The waiter was fantastic.   Very fancy place. Dress for it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KvaSeO7O4VKXaXCfmDr64A",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KvaSeO7O4VKXaXCfmDr64A/o.jpg"
      },
      {
        "img_id": "dRaj1TKz_kLSvkTAAy9UPA",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dRaj1TKz_kLSvkTAAy9UPA/o.jpg"
      },
      {
        "img_id": "NOJxsFYuMfVnKWuRAGHBgQ",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NOJxsFYuMfVnKWuRAGHBgQ/o.jpg"
      }
    ],
    "user_id": "DYufrEeJfRQGETbdOyfUFQ"
  },
  "lBllHa6V3ZwsIyzRstyeeQ": {
    "date": "1/21/2019",
    "text": "I was really hesitant to try this restaurant after reading some recent bad reviews, but its super convenient location in the Cultural District made up my mind.  We got a really good table and our waitress Deb was fantastic. It was super busy due to Hamilton being in town. Got our drinks really quickly was told the specials and watched our waitress deftly wait on a large clientele! Our food order was placed and it all came out hot and in a timely fashion. I ordered French Onion soup which was pretty good, and the Chicken Romano. The portion size was a little small, but no problem. It was my birthday and my table shared an incredible Tiramisu which was brought out by smiling Deb , with a candle. I think if you have a heat waitress it makes all the difference.  I will be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nv-IMn6yXyidflwflrM4ng",
        "caption": "Photo of Peter Allen's - Pittsburgh, PA, United States. Fantastic Tiramisu! Happy Birthday to me!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nv-IMn6yXyidflwflrM4ng/o.jpg"
      }
    ],
    "user_id": "HluNYgf3sbpCItHXCMpJnQ"
  },
  "VkKzqPMq21gINctNxlGVZQ": {
    "date": "12/22/2018",
    "text": "Lovely place. Accommodating to dairy allergy. Quiet  and elegant food was excellent. We loved the fried zucchini! Coil have used a small portion of pasta to sop up piccata sauce. Tiramisu was incredible. As a place for a meal before a show, a great choice.  The bathrooms although clean we're a bit cramped.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qf1Q4CZxiNy8X2ItSF6Gqg"
  },
  "kM8TFEl-Ey6vpOdV-aEW2Q": {
    "date": "3/1/2019",
    "text": "I first came here a few years back. I remember the food was a bit old fashioned but decent enough. No overly negative memories.   Oh man, what happened. I have never had a restaurant experience where every single thing was bad. Yes, everything. From the staff to the food to the coat check. One of the worst experiences.   I was at Peter Allen's this past Tuesday. I was there with someone to see a show at Heinz Hall. At the same time this sold out show was playing, Phantom of the Opera was playing as well. So the theatre district was very busy for a Tuesday. I originally wanted to take my friend to Proper, but unfortunately it was a huge wait, and that was the same for every restaurant in close walking distance. Except for Peter Allen's. This should have been an omen.   We walked in and saw several empty tables. We stood for a bit before a rude older woman with long gray hair said we could be seated. Out of all of the empty tables, she brings us to the back wall, where we were seated at a very small table next to three other twosomes. Our waitress came and immediately I was turned off by her attitude. She just had the look of \"I don't want to be here\". She announced that since she was taking care of us and the two friends next to us that she would just say the specials once and we all should listen. She then proceeds to read out a ridiculous number of specials. Way too many for one dinner service and got snippy when anyone asked her to repeat them. We took a bit of time to order apps and drinks. When we said we would need a few minutes, she rolled her eyes and left. We finally ordered the greens and beans app with the italian sausage and I ordered a vesper martini. Now I would usually order this drink with higher end vodka, and I suppose I forgot this time. But wow, the cheap house vodka they used made this drink taste like everclear, for $15. Boxed wine would have tasted better. The appetizer tasted strange. It was just kale, white beans, and sausage in sauce. Pretty sloppily presented as well. There were raw kale stems left in the app and the beans tasted like they came fresh out of a can without being rinsed. When she took it back only half eaten, our waitress didn't say anything or asked about it. We then ordered dinner. My friend got veal parmesan and I got the bolognese. Now my pasta came with a salad or soup. BUT! It can only be house salad or soup, if you wanted any one on the menu it was extra.  So I decided on the french onion. Our waitress said again, \"You do know that will be extra right?\" Saying it in a way that she didn't believe I could afford to spend the money. My friend asked for some pasta on the side, because this is one of the only italian restaurants where a parm dish doesn't come with anything but the meat, covered in sauce and cheese. Again, we were reminded it was extra. After we assured her that we heard her the first three times, we then settled in to wait. And wait we did. For context, our show was at 7:30 PM. We got the Peter Allen's around 5:30 and maybe had everything ordered by 6 PM. We did not receive dinner until 7 PM. An hour. For pasta and a piece of thin, fried veal. In between I was given my lovely french onion, that was so salty it was inedible. Upon flagging down our waitress and telling her, she just said oh I guess I'll tell them then. Not, can I get you anything else? I'm sorry. Nothing.  When we finally got the entrees, to say they were mediocre is an understatement. My \"bolognese\" was literally their sauce, which was pretty much canned hunt's tomato sauce, with some chewy ground beef and a carrot thrown in. Last time I checked, bolognese is a dish that is cooked down low and slow over time. This was terrible meat sauce that they called bolognese in order to charge about $25 for. It was highway robbery. As for my friend, her veal was overcooked and soggy. And her side of pasta was swimming in so much oil it looked like soup.   As a couple of side notes, there were out of almost every overpriced dessert, so really no one ordered anything. It is also worth noting that the tables near us also had issues with their meals, and looking around the restaurant, no one looked happy. Everyone looked frustrated or disgusted by their food. They were severely short staffed given the popularity of the shows going on that day. Also, don't check your coat here. They store them right next to the kitchen where food is coming out.   In the end, I paid $95 for food I barely ate. Needless to say, our waitress barely got a tip for her awful service. When I got up to grab my coat, my waitress very haughtily grabbed my coat and said \"Here.\" when she handed it to me. This was while a woman next to me was asking to speak to a manager about the food and service.   I am sorry reader for this long review. I just happen to find it ridiculous that this \"restaurant\" occupies prime real estate and is able to serve this food with this level of service. Disgusting. Pittsburgh can do better.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "tIXn4wYKnhryt2qmW6fQWA"
  },
  "h54VYYPAgw-WtkxUb0D96g": {
    "date": "12/4/2018",
    "text": "When I came here on Light Up Night, just about every restaurant in downtown Pittsburgh was packed, but there were several open seats here, so we decided to try it. It took us about 10-15 minutes to even be acknowledged by the hostess or any member of the waitstaff, even though they weren't particularly busy. I ordered ravioli, and they weren't anything remarkable. They weren't terrible either, though. A friend of mine ordered Alfredo and hated it. Apparently, it had a \"strawberry aftertaste\". I was not impressed and my friend was very disappointed. It's a shame, because our waiter was very nice and the restaurant itself has nice decor. Hopefully they get that alfredo up to par!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c6QuFIpeAZgziUN7biCz8A"
  },
  "wDwA0yhwbG6Jb00B5RxE8Q": {
    "date": "8/10/2018",
    "text": "Really awful. Lobster ravioli certainly frozen product, with what tasted and presented like jarred pasta sauce. The presentation also awful. It was like eating a TV dinner. Ambiance also off. Elevator music. Very weird. Elevator music & a heated frozen dinner. Walk a few steps further to Meat & Potatoes! That place is fantastic! Re: to manager Dan. I was in from out-of-town, my only motivation is to describe my experience to be helpful to others, and that was precisely my experience, regardless of if you wish to accept it. I had a superb meal the night prior at a nearby spot, and that is why I notate it. To suggest you aren't serving up items that were just heated up frozen items is ridiculous and if that is not reality than the \"made from scratch meals\" are tragic.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "XoyiIdPhN-GuazhJhdbNdQ"
  },
  "OKSrTHcps4Y_1aBv0XBcPA": {
    "date": "7/11/2019",
    "text": "Carole is amazing and because of her I'd come back!! She understands CX!!  She is an amazing cx!!  Who would ever think at 80 one would know!!! Love her!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9_TG_EFy-7xAm3MZUbY0A"
  },
  "yJ2vTbdLGf3WJ610IMspvg": {
    "date": "6/9/2019",
    "text": "Horrific experience. Let me repeat... HORRIFIC experience. Average food that was overpriced and we had to get the food to go because it took over an hour and 45 minutes to come out and we had to get to a show. We thought with a 5pm reservation we could make a 7pm show on a Sunday. 1.5 hours into our stay they came out and told us they ran out of oysters which my Dad ordered for his meal. Dustin - one of the waiters was incredibly rude to us. My mom (it was her birthday) tried to talk to the owner and he basically told her to get lost. Brian - our server was a great guy and did the best he could. Bill still came out at full price. I told the owner I was shocked that no accommodations were made to the check. Still nothing done. I told her we've received such better customer service at other places and the owner told me those places spoiled us. This place is now at the top of my list places to never go again. Mostly because of the ownership, no accountability.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "IdndDzGDugdLsj-ys89Nfg"
  },
  "_BjemX4fBjjJYjIp9tY7Cg": {
    "date": "1/8/2019",
    "text": "Second time at this place. If I can give it zero stars I would.Absolutely awful service by the hostess with a horrible attitude, borderline discriminatory against anyone under the age of 55. She was rude to me about reservation they confirmed for the wrong date and time. Tried to blame me for THEIR mistake. In the hospitality world, you would never blame a customer for being wrong. She asked for \"proof\" of our reservation, \"let me see the voicemail on your phone.\" After having to be seated at the bar for our reservation, we ordered our food. Which ended up taking 1.5 hours to arrive. Food is terrible. Nothing we ordered was even remotely good. Olive Garden has better food. The only good part of this whole experience was our bartender/server. She was friendly, welcoming, and efficient. She apologized for the hostess horrible attitude. Even after the conversation with the hostess, she (hostess) came to me at my seat while I sat with my party and showed me a piece of paper and said \"see, I have you down for tomorrow at 6\", adding fuel to the fire. What was i supposed to do then? Show up the next day? I replied \"I am here today, and will not be tomorrow.\" Put a welcoming and friendly person in that position. After all, it's the first impression for the establishement and it just went downhill from the moment we walked in. To blame the PAYING customer for the restaurants mistake? Come on! That's hospitality 101. Make it right.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "HbXsufeXyRw5NgJJdmz2yg"
  },
  "3Img8RAvOKa_hyEDY7Bquw": {
    "date": "2/15/2019",
    "text": "Absolutely terrible...food was below average (oysters are not fresh)plates are dirty... I did not believe that the staff there were interested in improving their services or running a restaurant for that matter. There won't be a second time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DH9DSyp2v5pxoR8-tlIGPQ"
  },
  "Ew0hEcOSemJiqluW8jk3HA": {
    "date": "4/5/2016",
    "text": "If you like mediocre food,  you will not be disappointed here. English spots Romano was on the menu. One might think if something is on the menu, someone in the kitchen would know how to prepare it. Nope! The entree initially served was deep fried fish. After being sent back, the next attempt was pieces of fish with something white and cheesey melted over it. The hostess even said she was appalled when she saw the dish that was now being served. But, she let it be served. It was all white and pasty looking. It was also tasteless. A third try produced some fish, finally resembling something \"romano\". But you could see the grease shining on the fish. Another entree ordered was scallops. These were tough and rubbery. Absolutely no care was taken to make any of the dishes appealing looking, either. Both dishes were each $30. The only food that was anywhere near decent was a baked potato. And that was $8. I do not mind paying for good food, but it is appalling to pay so much for such mediocrity.  A restaurant can change its name and redecorate, but in a foody town, this mediocrity is pathetic. Like the two previous evaluations, we will never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1pzz_I913IIZW7WGRfqmOQ"
  },
  "mIO3zVrAOj55q7FJRZOL3w": {
    "date": "6/29/2016",
    "text": "We choose this location to have our annual family birthday dinner.  It was really good.  We started off with three pasta dishes as our appetizers. We had the pappardelle bolognese, spaghetti with meatballs and the linguine pierto.  All delicious!  Meatballs were melt in your mouth. Everything was fresh.   I ordered the stuffed shrimp, it was ok nothing special but others had 24oz porterhouses, black and blue filet and the seafood platter.  Omg the steak was amazing, cut like butter!  The lobster on the seafood platter was huge, that's what you were paying for.  All meals came with a nice salad.  We ended dinner with bread pudding.  That was very good too!   The chef came out and was very nice.  Checked on us twice.  Everything was very fresh!  I would go back and try another dish!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3FdxbCUj0QFrBpRl2QS5cw"
  },
  "ZAVIqFdoPBO0-xGk05m4sg": {
    "date": "7/15/2016",
    "text": "The Restaurant was beautifully renovated from the Old Bravo Franco. The prices were as you would expect on the high end for an upscale restaurant but not overly priced. I dined with a friend. We had a couple of drinks which were size wise pretty large. We ordered two appraisers.I had oysters Rockefeller which consisted of 6 beautiful and tasty, my friend had their famous zucchini which was great and lots of it.  For our entree I had Pappardelle Bolognese the portion was large the noodles were great and the meat sauce was sweet with plenty of meat.My friend has the Veal Romano he said it was great  there were two large pieces. We did not order dessert as we were full. We went to the bar and has sambucca the pour was good. As to the service it was excellent. I can't wait to go back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "04f63ASxzex1eQc464m8YA"
  },
  "CSnm6M9vywW8oTlggKE__g": {
    "date": "12/16/2017",
    "text": "First let me say this is not the place for a quiet dinner. Patrons are shoved into little tables and practically sit  on top of each other. Over priced, mediocre (at best) food.  I had Pepperadelle and it  was  bagged egg noodles. My friend had lobster ravioli that were obviously frozen as they were stuck together very fishy and cold.  The service is terrible. Glasses (both wine and coffee) had food and a gelatinous substance and waitress with attitude when we requested new. I had something in my wine and she states, It's just cork, took it over and fished it out.  Both coffee cups that we received with dessert had a gelatinous substance all over them and she was put out that we asked for new cups.  The pecan ball is an 8 dollar chocolate syrup sundae.. small bit of ice cream with some pecans and chocolate  syrup squirted on, bit of whipped cream. Just horrible. Avoid at all costs as there are so many other better restaurants in town.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nAeJKiCxMH3rcVWYVKyaFw"
  },
  "GjAmq0aX0V-Ss72orINDNg": {
    "date": "7/31/2017",
    "text": "Not great. Unpleasant manager was very abrupt speaking to my wife about possibly moving a couple of tables to accommodate our group.  Should have left then. Food was only OK. Upcharges for sharing a plate, $2.00 for blue cheese sprinkled in a salad, \"includes soup or salad\" means 1 soup - any others are more... . Cafe Milano around the corner has better food and more pleasant staff for 1/3 the price.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vi5PLqsxlAUtMQEqszcrPg"
  },
  "DC4hnhksvkjnyFUWvfKCbw": {
    "date": "6/9/2017",
    "text": "I am a frequent diner here! Enjoyed chicken parmigiana last night!!The food is delicious! The regular menu is great, accompanied by nightly chef specials! Never disappointed with my choice! The decor is modern & comfortable.  The diningroom & bar are beautiful ! The cocktails are great! The waitstaff is efficient, even at the busiest times. The dining room is supervised by a sophisticated, friendly hostess. She always makes us feel welcome and appreciated! Enjoy a lunch, dinner, or after the show meal! You will become a regular!!! An added perk ... very close to Cultural District theaters!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0CXBwcrtVd2z3mc2WGwDCQ"
  },
  "yDVSWaDj1Zm6qJ2fxmDjHA": {
    "date": "6/5/2017",
    "text": "Won't be back! Service was so slow that when my salmon entree arrived raw - we sent it back and did not have time for them to try again. No one ever came to our table to apologize, not the manager, hostess or anyone. In addition, there were multiple 'extra charges' we were not told about and that were not on the menu: for gorgonzola on our salads, and for the appetizer which was listed on the menu as greens and beans with sausage or potato, and there was an extra charge for the sausage! Hostess was rude when we arrived. One of the worst dining experiences I've had in Pittsburgh in over 25 years!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JR9GTN634TLCpy86f1ZdEA"
  },
  "hTQTZIJ2kj7WeN9hqFv-BA": {
    "date": "7/4/2017",
    "text": "I used to work there....still have not received my paycheck....and that was four months ago.....i was given the run around about my pay check...was also told that i was going to have to pay a thirty five dollars..checkcancel fee.....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TJWi5zh05Ot9wSw9QMoA6A"
  },
  "S4jS0PWYFmVWE72fZQuKog": {
    "date": "4/29/2017",
    "text": "My husband & I dined here when it was Bravo Franco and were unfortunately very disappointed the last time we went. Once we saw it reopened as Peter Allen's, we figured we would give it one more try... and tonight is the last time we will ever return. The service was awful, food was decent, but certainly not worth the price. Keep walking if you're considering dining here. Spend your money elsewhere. Also, there is no space that they haven't shoved a table... get cozy with the people sitting next to you, because you're pretty much dining with them also with how close you are.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OVy-OgOZ9pjyE7Tspq0ckA"
  },
  "qzOzMK4LnA_-oCxyXvC6nQ": {
    "date": "4/8/2017",
    "text": "Food was good but surprised no sides served with your meat entree. With being an Italian place would have been good to have a small spoonful on the plate ..,just meat doesn't taste good",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qwmX0XpBW2K4fWP-TQyqCA"
  },
  "zXumPRy5FUCF4so2BhE6rQ": {
    "date": "1/1/2017",
    "text": "Went here 90 minutes before a play.  Started to worry a bit when it took 20 minutes to get our drinks. We asked if we should just order an appetizer since if the food will take as long we will run out of time. We did order the meal and made the play at the first call chime. Food was good. The atmosphere was very pleasant. You could carry on a conversation since there was no loud blasting music like most dahntahn restaurants which are primarily TV bars. Will go again in a few weeks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c14PAVzMMRjK36FG_NvU1Q"
  },
  "LKuzyDR2B9ry6KR66GafcA": {
    "date": "6/24/2016",
    "text": "A night at the theater as usually to begin with what was SUPPOSED  to be a wonderful dinner to welcome my daughter and her boyfriend back from a year working abroad but NO \"Carol the hostess\" immediately changed that plan. Reservations had been made days ahead but her greeting to us was condescending, beyond rude and totally inappropriate as we merely asked about a table near the window and she replied \"see that Reserve sign\" well yes we saw it and when we said well we have reservations she went into a rant explaining what reserve meant.  Treating my daughter, who I'm sure has been to many fancier, international and domestic restaurants than this awful woman has ever known, as though she were a person who just walked in from the street to beg a drink with disdain. With that we asked to be seated outside. She begrudgingly took the three of us to a too small table with the continued rudeness. Ok so we are seated and hopefully at least the outside service and food would outweigh her horrific attitude but we were totally wrong. We should have known the mistake we made when even the server said she was so used to Carol's bad behavior. Now bring on the good service NO the server barely had time for us. We tried to order oysters and even though it was only 6pm they were out of that appetizer. So with a 10 to 15 minute delay in serving two simple glasses of wine we order the entrees. We order still hoping to save the experience only to have one of the most disgusting examples of even good  dining we have all seen. Bring on the overpriced chicken special, another pasta dish that was edible but not great, and a salad that looked as though it was thrown on the plate and bread that was so hard one could not bite it but had to take it apart to eat. Get the picture? There was no picture and I regret we did not take a picture especially when the cappuccino came. The cup in which it was served looked as though it came from an all night diner with drippings and coffee grounds all over the saucer and cup. I won't even mention that the people next to us had to ask to borrow the balsamic dressing and cheese from our table because the server also neglected them.. What a night, thank goodness the play was excellent and we do have alternative restaurants near the theaters that we attend regularly! Oh funny story at the play I was talking with a person next to me who asked if we go to dinner prior to the plays and I said yes but NEVER again to Peter Allen's. I told her about Carol and she laughed and said \"Oh Yes we know about her\" and not in a good way. Over priced, poor service, most importantly poor food quality and presentation all describe \"The New Peter Allen's Italian\" top that all with Carol and you have a sad addition to the Cultural District.  So changing your name, putting in new tables ( which are too crowded) has not helped one bit. Will I return to this place? An emphatic \"NO\" until a new establishment replaces this one in more than name only.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "JdLLm57C9SMDEHTAtEgCSg"
  },
  "GY3fkuaEzhtt4Epj27TceA": {
    "date": "2/5/2017",
    "text": "Accident happens, my son and I have both worked in a restaurant, we get it. The way this owner, Carol, reacted to me telling her my son bit down on broken glass in his salad, was unbelievable. I can't even describe it. She ridiculed me said \"honey this isn't glass see how I can roll it between my fingers without being cut\". Then we showed her the chipped salad plate, which I have a photo of, and she aggressively leaned over the table at my son said \"do you want me to call you an ambulance. Do you want to go to Allegheny General\". We weren't trying to get a free meal or anything comp. it was a safety issue and I thought she should be aware. This woman wasn't even remotely concerned, never even asked if he was cut.  I never raised my voice, we all simply got up and left.  She escorted me to the door and rudely told me not to come back. I eat in town at least monthly, I won't be back neither will my family or anyone else I know.  Social media is a powerful tool.   I'm appalled any business would permit her to work the front of the house.  I looking into contacting the health department.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4oraFQVDvO_C2Nai7lhjrg"
  },
  "d-Vt44q1xSUxMEGHpj5BzQ": {
    "date": "1/14/2017",
    "text": "My fiance and I have been eating at Bravo Franco for years. We loved the food, customer service, and romantic atmosphere. We were so excited to try Peter Allen's when we were back in the Pgh area but a little disappointed. Our waitress was very friendly and nice. She had great recommendations and was attentive. However, the menu is basically the same as when it was Bravo Franco but with jacked up prices. The break was pretty stale. Our entrees were hot and tasted fine, but they were out of 2 options that my fiance wanted to order. He ended up with a baked potato that was no way near worth $8. I had the chocolate mousse for dessert which tasted like regular pudding with Hershey's syrup dumped all over it..not what it used to be. Might try it again..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uW3nhQt5AwWGqi2gZOiUwA"
  },
  "tscR8FE4sRHtuojU3fRaJQ": {
    "date": "6/23/2016",
    "text": "Entree was very good as was service.  The \"hostess\" was not friendly and dressed in all black and white (way unattractive attitude). No vinegar /oil on table.  Cold bread not very good .  Salad was soaked in salty dressing. They charge $8 to split entree so we each got one. Ample but not overwhelming. Not sure if we will return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "EkXI2BICIS-G1-HpXFhG8w"
  },
  "vpQx1KUrgRES_YkHq8krQw": {
    "date": "9/11/2016",
    "text": "We were very lucky to get a last-minute reservation for our party of 11 on the Saturday night of the Pitt-Penn State game. The maitre D' was excellent, and gave us our choice of 2 table arrangements. Extremely slow service is the only reason I couldn't give this place 5 stars. The entrees were excellent at our table ~ for me, the best veal Marsala I've ever had. The waiter could use a bit of polish, but he won points by comping our table with 2 excellent desserts to make up for the wait time. I'd definitely go back, and would look forward to having that veal Marsala again!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LO0kK4TLgL_co5YcaLnH1Q"
  },
  "8_GWg5gYszHw5CNe-YUv1g": {
    "date": "9/28/2016",
    "text": "This has been the theater go to restaurant for me and friends for several years. This remodeled and renamed restaurant remains a favorite. I love the new decor. I truly do not understand the negative and overly snarky reviews I have read on this site (you can ask my wife how critical I can be). None of the four of us has ever had anything but a tasty and satisfying meal served by a courteous staff. If you have theater tickets, give yourself plenty of time and mention it to your server. We've never missed an opening curtain.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WlFUBCobMKgN-yeBdVscfg"
  },
  "DCxtsT2mdsJr5Qoo4bcohA": {
    "date": "5/10/2016",
    "text": "Overpriced.  Bland food.  Rude service.  Hopefully something worthy of this location will take over soon. Save your money.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ymu04kz0GhBauaoF3KVPUw"
  },
  "XHVejsbP2TuGJ0YP4ZVDfA": {
    "date": "8/17/2016",
    "text": "My family and I ordered take out from this restaurant. The restaurant is beautiful inside and the staff was very nice. The food was great my husband and children enjoyed their food and I did as well. I didn't know that anchovies were put on caesar salad so they were on there but I just picked them off. I was not a fan of the dressing. There was nothing wrong with it I just personally didn't like the tastes of them. It was nothing that was there fault. We got food from them August 16th, 2016 and we were very pleased.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "boJ242F4azLIZn8Od93QFA"
  },
  "2Jc82VWt2szfaTzkYvOsIw": {
    "date": "6/12/2016",
    "text": "Based on their seating arrangement, I'm giving it two stars. The bank of tables to the right of the restaurant is TOO CLOSE TOGETHER. If you have to move the table to get your customers into the booths along the wall, the tables are TOO CLOSE TOGETHER. Everyone who was seated along that wall was very verbal about how much they hated being like sardines. It's horrible and uncomfortable. Also, the waiter's butt was in my face - literally - every time he handed something to our neighbors. This is just not acceptable. The food, we thought, was actually decent. I had the pastina soup and fettuccini with marinara.  The sorbet was not sorbet, though. Very flaky, not creamy or smooth at all. The seating, however, will keep us from returning. There is no way in the world we want to sit that close to strangers, nor do I want a waiters backside in my face all night. No thanks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UMrt8aUYRexoL3V4X4LbsQ"
  },
  "1OyDmd_X5uZBCOu-7F0lXg": {
    "date": "7/20/2016",
    "text": "This restaurant has a great location.  This is the only thing about it that is great.  The service was mediocre and the food was overpriced and really, really lousy.  The very meager portion of bread was dry, the salad was mostly cheap lettuce, and our $34 dollar \"special\" entree consisted of tiny shrimp, canned clams, and cheap boxed pasta. The waitress knew nothing about the wine, and couldn't have cared less if we enjoyed our meal or not. I will never, ever eat there again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mvk1qhRmBVKgSgnrShylBQ"
  }
}