{
  "NNnEOVNagu5W7L4DLa3ymA": {
    "date": "8/25/2015",
    "text": "Ate here with my wife and college-aged son during a recent visit to Pittsburgh. Decent parking. Easy to find.  The good news was that our food was really, really good. The bad news is that we ordered too much food :-)  Ordered pepperoni roll, gnocchi with meat sauce, and large thin crust pizza with mushrooms and italian sausage. Meal also came with salad and garlic bread. Everything was terrific! Pepperoni roll was cheesy with a good pepperoni-to-dough ratio. Gnocchi had good texture and the meat sauce was tasty. Pizza was my favorite. Really, really awesome crust that wasn't as thin as you might find at well-known pizza chains.  While I love Primanti Bros... Juliano's is a great alternative if you want something other than a great sandwich.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Z0ybUAa4VXj_yCV1lnBFg"
  },
  "BmqRD63RWTkWM6ZB8g2dyg": {
    "date": "5/11/2017",
    "text": "The best sauce in town! Juliano's has been our go-to for Pizza for a few years now and we have yet to be disappointed. Their breaded cauliflower and calzones are great too! They are a little pricier but it's totally worth it! I've also tried their catering several times and have received many compliments on their food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P9oo311Cwcy4Xan065b-iQ"
  },
  "7GBbqZh8jkxrEYdGS3l8BA": {
    "date": "1/16/2018",
    "text": "Had the Tuesday special... a heaping plate of spaghetti with the upgrade to meat sauce. Very good sauce and they offer you 3 options on the pasta. The garlic bread was a little too \"floral\" for me, if that makes sense. But I loved the service from the staff, the family ambiance, and the noise level is awesome to just carry on a nice conversation. Make this a stop when you plan to pick someone up at the airport and have time to kill. Or just for a solid meal with someone you care to be with.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C3YcI-HmjTwYFJZZkBec5g"
  },
  "0MxNhDpmkBYpHtU-AH5vrw": {
    "date": "7/29/2015",
    "text": "Staying at Candlewood Suites and ordered deliver from here tonight  Got a cheese pizza was good, cooked well medium thickness crust, bland but good sauce and enough cheese.  Got mild wings (had the kids). Wings are not the greatest, bland flavor and not crispy enough.  Got a steak and cheese sub.  This sandwich was about the best I have had.  Great bread and tons of steak.  A+",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gRkhaXNXQOjOCvRfIiaqww"
  },
  "mMeu1wM5KkAQy-e49GaENA": {
    "date": "2/23/2015",
    "text": "I was visiting PA for a hockey tournament and had a lot of ups and downs during our trip.   Other than my son winning the championship of the tournament our biggest up was visiting julianos for a team dinner.     30 people, including eleven 8 year old boys piled into a small restaurant and my first thought was this is going to be a disaster.   To my suprise the staff was So accommodating.  They understood the needs of the boys and we're extremely pleasant.  It was our home away from home.    The food was amazing! My only problem with the place is it is 3 hours from our home! My 8 year old, 51 lb son ate 10 slices of pizza it was soo good!!! My husband and I had a white pizza with chicken and brocoli that I'm still craving.   The other members of our team got everything from salads, pasta, and sandwhiches. There wasn't a person at the table that was disappointed!     If you're in the pittsburgh area I HIGHLY suggest you give this homey restaurant a shot.   You won't be disappointed with the service or the food.  I know when we head up to Pittsburgh for a tournament or a just a trip to ikea we will definitely be revisting this gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "iOuRNOcpE7hoL7v_ACNPwg"
  },
  "oYOLwXpdxEzQh_LDobYaXA": {
    "date": "3/2/2015",
    "text": "GREAT pizza and hoagies.  You know the food is good when it takes a while to get through to order  - our favorites are traditional pizza with pepp/mush/banana peppers and the yinzer eye-talian hoagie.  I remember getting pizza here when I was a kid... the quality hasn't changed a bit.  We usually order take out and have rarely had trouble with the timing -  I do wish they'd update the dining room a bit, but it's clean and comfortable as it is.   It is a little pricey, but I'd rather support this local business than a chain. I do appreciate that he hires local kids... you can tell they have fun working there and are learning a bit about a good work ethic.   Well done, Nick!  Keep up the good work!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "gJtj4p-ym-lszJaq411zoA"
  },
  "hNjtDtf5aRDygPqjtxzgXg": {
    "date": "12/21/2016",
    "text": "My husband and I stopped here on a whim after our intended destination was closed, and I am so glad we did!! It doesn't look like much, but the food was delicious and the service was fast and friendly!! We ordered bruschetta and wings for appetizers. The bruschetta was very flavorful, and the bread was super fresh and perfectly toasted and seasoned. The wings were actually breaded boneless wings with the sauce served on the side, but the buffalo sauce was super tasty and I was glad we could dip them as much as we wanted to! My husband had the gnocchi and it was very clearly homemade... so fresh and so delicious! The marinara sauce was really good too! I had the Pasta Julianos, which was a huge portion, and definitely worth the price -- the sauce was excellent! I definitely plan to return here in the future - great find!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PF3GcpdrXPVovdPqdrAGBQ"
  },
  "r0cTId3DxHxL52OHeYyEEQ": {
    "date": "1/5/2015",
    "text": "We are indeed fans.  Being a native of the Harrisburg, PA area with the Sandwich Man as a regular spot, it was nice to find a comparable G5.  The Sandwich Man G5 = turkey/swiss sub in the oven.  Juliano's can do this.  We've also been searching in the area for a good thin crust pizza and found it here.  Love the thin crust.  Glad we found this place.  It's our regular delivery place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "x3_WktDd9Xw96-OuKPG-nA"
  },
  "4MdsaZWx2F_9u0WNyAhDAA": {
    "date": "8/28/2016",
    "text": "Best pizza in Robinson! My family orders takeout from here all the time! The service is excellent! They have different crust options and I've tried them all with no complaints. The zuchinni app is my favorite though it can be a tad greasy. The men always order wings and this time they got the teriyaki. They must have been good because they disappear.  My father inlaw loves the chicken parm sandwich it's big and usually gets shared. If there's a wait I'm telling you it's worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "b4DS6aKcyAc2m-URu3p5Lg"
  },
  "TWEcTjIz8M8JkFAQvV2dhA": {
    "date": "2/15/2015",
    "text": "We came in town for a hockey tournament and they went above and beyond to accommodate our team of 30. The food was absolutely amazing. The service was impeccable. They treated us like family. Thanks so much for making our last night in Pittsburgh amazing. A must if you are in the area or worth the drive if not. -Wooster Blades Mites",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "tv3FhKe-a9UCodDs26I4Ug"
  },
  "RGwVl3tjtIi5H2q0M9fGUg": {
    "date": "9/8/2016",
    "text": "OUTSTANDING!! We were in Pittsburgh overnight, flying out early the next morning. We wanted some good Italian food since where we live there isn't any. We read the reviews of Juliano's and they delivered. We ordered the Chicken Parmigiana with spaghetti. It came with Garlic Bread and a side salad. We ordered an extra salad, extra bread, and extra marinara sauce. It was delivered on time. The delivery guy had everything in a box for us. He was friendly and helpful. The food was GREAT!! It would have fed four people!! Too bad we couldn't take leftovers on the plane. And it was less than $30 - including the delivery charge! WOW!! Well done Juliano's!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CJUZYOmi6RAzfUf0ABkzYQ"
  },
  "mQ2OzA0lqJwErORGlcnGwg": {
    "date": "2/10/2015",
    "text": "Was here today for Lunch with our Cousins. Always wanted to try their Pepperoni Pizza and pleasant surprise it was very Tasty and our Waitress was very nice.  Will definitely have to make a return trip to sample other things on the menu !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UFluJsfDeBb0jBbZLF3cbg"
  },
  "Par5ARp2PIIxR5hawJYpTQ": {
    "date": "9/20/2016",
    "text": "Pizza was great. The thin crust isn't really that thin, comparable to hand tossed in most places. Husband loved the wings!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EpXUpwebSyhhGX7mnJrFng"
  },
  "82FT-VTpea_lQbKxij0KRA": {
    "date": "8/14/2014",
    "text": "First of all, and this really bothers me, if you scroll through the reviews for Juliano's on UrbanSpoon, you will see a TON of glowing reviews, all from new users who have never reviewed any other restaurant. They have an unusually high number of reviews & \"likes\" over there & you usually only see that when a restaurant is padding their own reviews.  I've eaten here maybe 10 times over the years. I was just there the other day for a friend's birthday dinner - his choice. The place is old & worn down & in desperate need of being redone. Another friend commented on how dirty the place looked. It's not an appetizing place to eat.   The pizza was ok - not terrible but nothing great. I made the mistake, however, of ordering the buffalo chicken salad for $9.99. It was, literally, a bed of iceberg lettuce, four cherry tomatoes, a sprinkle of cheese & two pieces of buffalo chicken (two tenders). There was nothing else on it. The menu said it also came with fries, but there weren't any on my salad. The dressing wasn't good & the waitress even told me, point blank, \"we don't use real bleu cheese here, the kind with the chunks of cheese in it.\" Well, ok then. They gave me a cold slice of white bread to go with my salad too - why wouldn't you give me a hot breadstick? I can honestly say that it was the worst buffalo chicken salad I've ever had & the price was crazy considering what it was. Had it not been my friend's birthday, I would have sent it back. We also had the fried zucchini and it was completely soggy.   The prices are higher than they should be. Check out the pizzas on the menu to see what they charge for toppings and speciality pizzas & you'll see what I mean. The pasta, the salads - everything is overpriced. This restaurant needs an overhaul on the inside, much better quality food & service & prices that reflect what they actually serve. I definitely will not eat here again after my last visit.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "SqZGnxh0nxIdx31VGEaUkg"
  },
  "Z8Qu8WPs_raHZ-wD5XKrXw": {
    "date": "4/30/2016",
    "text": "It's hard to find quality food and a great waitstaff, but Juliano's has both. We have been here several times and each time better than the last. We recently went an hour before they closed with a party of 13 and they accommodated us as if we were the first people there that evening. Every single person enjoyed their meals. I'd recommend the wings, fish dinner, calzones, and their meatballs; though you can't go wrong with whatever you choose.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WmmderUUlJFN6V8UtGb2sg"
  },
  "XUj1LFVK5rF42HU16yyNew": {
    "date": "8/12/2017",
    "text": "Great pizza and salad catered!! Very friendly staff!! There are a few pizza places around Robinson area, but Juliano's is excellent!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m979W4CDBDNb_yeT-jdqSA"
  },
  "R6adAaUPC3DS4hFpeqLUXA": {
    "date": "10/28/2013",
    "text": "As far as I can tell, this place puts out some good quality food at good prices, too!  My floor in the office building I work at just had a lunch catered exclusively by Juliano's and if their catered offering are as good the in house meal entrees then I can't wait to stop by.    We had chicken salad sandwiches (I would have put hot sauce on it had there been some NBD just personal preference), sandwich rings, potato salad, and pasta salad.  Overall, the meal was great and we got more than enough lunch for everyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "2uPSqD8q1qMEqrxMo7LbKw"
  },
  "toPfR_FWQDneASISFdUaQw": {
    "date": "10/16/2015",
    "text": "Best gluten free pizza in Pittsburgh! Order Extra sauce on the side -- my spouse is from New Jersey, and claims their sauce is as good as she has \"back home.\" Ambiance is not much to speak of (dusty rubber grapes decor) but it has grown on me. food is definitely reasonably priced. Zucchini is fresh and delish. They are always busy but we never have to wait either. Come as you are -- family friendly and relaxed. We had the most charming teenager refill our drinks one busy Sunday night -- everyone seems hard working.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ujSNN5u8lxmmRYgCLB3fIg"
  },
  "M7gzoCMqnz9nYfwXoh8piA": {
    "date": "7/27/2013",
    "text": "Great Italian food with amazing and friendly service. I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZnIaEvJwrxlBUjimIpx2Qw"
  },
  "uyPGdCEYGkNVUDFPCHdSUQ": {
    "date": "12/29/2015",
    "text": "I had this place about six years ago on a passing visit, and almost forgot about it until I moved into the area. We had a \"complicated\" order as we call it it the restaurant/service industry. The guy on the phone was real laid back and guided me through the menu. He read back my order, gave me my total, as well as an accurate time estimate. Really friendly when my girlfriend and I arrived. The man up front even recognized me from our order. Another man came up and showed us our order and asked if everything looked ok. Everything looked, smelled, and tasted fantastic. We will definitely be back considering the excellent guest service they provided is  something hard to find in any  establishment nowadays. How did I forget about this place?! My family couldn't stop saying how good the pizza was.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3iNM5vT33PhjmXC7jglusw"
  },
  "y-EWMqVYWNAR0OmVWxI4XA": {
    "date": "3/28/2016",
    "text": "If you like deep dish, that's he way to go.  They use quality ingredients and the service is good I've had pizza in many different places in the world and this place is high on my list.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0J4KflK17cN1-oJD4T_95w",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Cheese, pepperoni, green pepper and onions - the best",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0J4KflK17cN1-oJD4T_95w/o.jpg"
      }
    ],
    "user_id": "e_VJa6d-k1c81N4Fc_7Arw"
  },
  "UmoC6KiQ5vzek0Bp0eySfw": {
    "date": "2/12/2018",
    "text": "My boyfriend and I went for the first time on Saturday night and I must say...the pizza was amazing. It was somewhat overpriced, but it was definitely worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sArS3PeBrBmj4VhwqDV2Aw"
  },
  "Gml-u7Dft3p62Qgcm0XPcw": {
    "date": "6/14/2017",
    "text": "Hungry tonight & Julianos took care of me spaghetti & meatballs, and delicious chocolate cake! When I feel like I need some Good Italian food  JulianoPizza is who I Ring Up!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VGhRYEV6LKslckRm3IDRVg"
  },
  "v-3zsmNSpW3umw6KJifY0g": {
    "date": "5/23/2015",
    "text": "This was our first visit, when entering we were greeted and seated quickly. Our server, Kim was absolutely phenomenal!   We ordered jalapeno poppers, which to us, tasted like they were filled with ravioli and cheese. They were cooked to perfection. We also ordered a pepperoni roll (not knowing now larger it was, could easily be considered an entree). This was also, cooked perfectly.   We order chicken parm and tortellini Juliano special (for Saturdays). Both were cooked well and steaming hot when when received. The portions were generous and served with fresh garlic bread. We were given fried dough as a special birthday treat.   They take great pride in making sure every dish is served with perfection and the customer is top priority, making sure they are completely satisfied. If for some reason you are not pleased with your service, you have the opportunity to email or call to express your concerns.   I have a strong feeling we will return as Juliano's is top notch! We couldn't be more pleased with our experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z1ZHy_HN4ANQW0DRnJrycw",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Fried Dough",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Z1ZHy_HN4ANQW0DRnJrycw/o.jpg"
      },
      {
        "img_id": "ZbH8-O64oAGP9peHOLubXA",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Chicken Parm",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZbH8-O64oAGP9peHOLubXA/o.jpg"
      },
      {
        "img_id": "p18vqYjdSDgEP2BuLdxxPA",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Pepperoni Roll Appetizer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p18vqYjdSDgEP2BuLdxxPA/o.jpg"
      }
    ],
    "user_id": "XXBy1qXvig6xAyQZR6aRSA"
  },
  "dhSbeszmrZVdiSMKH5oYaA": {
    "date": "3/8/2018",
    "text": "One of my family's favorite places.  Great food, awesome customer service and the Juliano's Sauce is the best pink sauce around!  I even order quarts of it for parties at my house.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4SgrOqNMl8uoKkMfk4U1xg"
  },
  "WEh_NXIfmlFa-uH7uoCD1g": {
    "date": "3/27/2018",
    "text": "We ordered a pizza and a pepperoni roll. We had plenty to take home for left overs. Nothing super exciting about the place. It was busy and the staff was nice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "AKLa47hGjoz2ZeTvRC-lMA": {
    "date": "6/18/2014",
    "text": "Love this place! The food is excellent. It had a neighborhood, family atmosphere.  Delivery is always accurate and prompt. They do catering too. The ranch dressing is amazing and homemade.  Don't forget they have a lunch buffet too! Wonderful deal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V_mDcibcAaDJajziWq5z5Q",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Grilled chicken salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/V_mDcibcAaDJajziWq5z5Q/o.jpg"
      },
      {
        "img_id": "NvlOnRalABsQv6cxH022KA",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Cheese thin crust pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NvlOnRalABsQv6cxH022KA/o.jpg"
      },
      {
        "img_id": "ruE9O5zG-8tDRxkinJDy_A",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ruE9O5zG-8tDRxkinJDy_A/o.jpg"
      }
    ],
    "user_id": "KqItBIJXO_UhZ6MktvuI0Q"
  },
  "zRq1n7DbR6CKqU0c-b4r7Q": {
    "date": "6/10/2016",
    "text": "Like 100s of other people in our area, I sometimes get tired of the same old - same old pizza joint I always go to. I like to try something new and venture in to new places; and then Yelp brought me here!   Reading the reviews, I had to give this place a try and I was not disappointed when I did. I went in, grabbed a menu, decided on just a pizza with pepperoni and a pepperoni roll (since I saw that they were delicious), and then I ordered. I ordered as take out and did not have to wait long albeit extremely busy.   I loved the phenomenal service of the employees taking and giving out orders. I especially like how they show each customer their order inside their boxes before heading out. As a customer seeing that, I feel like they appreciate my service and want to make sure that we get great food and what we had ordered was correct.   My pizza and pepperoni roll also passed the taste test, especially the pepperoni roll. It's something to dream and drool about! I definitely can't wait for my next visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rGuevqz7WCka0f4UfkHurQ"
  },
  "1BGf0EMzCEvAvm0lMTS5Ug": {
    "date": "7/23/2014",
    "text": "Great mom and pop joint. Stopped in on the way to the airport for late lunch. Pizza by the slice was great and by copilot really enjoyed his steak and cheese hogie...made me wish I had ordered one.  Stop in a support your local non-chain restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U0uJW-o5h9EDvr9aKZoj_A",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Steak and cheese hogie.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U0uJW-o5h9EDvr9aKZoj_A/o.jpg"
      }
    ],
    "user_id": "BZRF1Wtt01kd3XSCjM2MXQ"
  },
  "Rz9GlFeQ0Bk6b096fi5rtA": {
    "date": "9/17/2017",
    "text": "Local place in Robinson offering the best Sicilian Pizza I have ever had! Served with fresh, high quality ingredients.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZnLwnq8KeXbbqK2qXyFI6g"
  },
  "xIasN4o3nVB3MRpECnmNBg": {
    "date": "9/15/2017",
    "text": "I've been to Juliano's a handful of times and each time is better than the next. The owner made sure to come up and greet us during the dinner rush, which we felt was nice! The restaurant is small, but not too cluttered. The food is amazing. The pizza is amazing, the lasagna is top notch! I've never tried something I didn't like at Juliano's! I highly recommend this restaurant to anyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DEDhs2NVmGtIpMTFVC_tIg"
  },
  "IdpN7RNSLv-swpC0LHN2HA": {
    "date": "7/15/2016",
    "text": "I am obsessed with the pepperoni roll appetizer!!! It is the best I've ever had!  Service is always great and you can't beat the prices!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wHE92YKvRgO3okTT2mmL2Q"
  },
  "fyR667e04Lq1S0b5HgqKFA": {
    "date": "1/11/2018",
    "text": "All around fantastic. Best wings around! Delicious pizza and homemade ranch! Nicest family owns this restaurant. My daughter worked here as did many of her friends from high school. They catered  both of my kids grad parties and everyone loved it! We have been coming here for 25 years and have never-not once-had a bad experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s07Oijo7v-sXvjcLA1KlEg"
  },
  "rd7es3H8DL6__MfgeXhCTQ": {
    "date": "7/7/2016",
    "text": "Vic got the chicken parm and I got the crab and shrimp pizza. They both were delicious! The wedding soup was also very good. I will recommend this place to everyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p7RBNrV42SXZFPjX7wp33w",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p7RBNrV42SXZFPjX7wp33w/o.jpg"
      },
      {
        "img_id": "nxEpoH6qwI1ih0UrXCpMeg",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nxEpoH6qwI1ih0UrXCpMeg/o.jpg"
      }
    ],
    "user_id": "lPM6D5pvEAWN7NCct9fB7g"
  },
  "8zbRwfgQuHgtm54vSk605g": {
    "date": "5/26/2017",
    "text": "This is the best Italian restaurant in Robinson.  Food is always fesh and delicious.  The pepperoni roll is worth the wait. Try it you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hAYlqCOVnhnr0SfiQSAFdw"
  },
  "AIDN-eEoFz0B36g8jp4u_g": {
    "date": "6/25/2016",
    "text": "Great family Italian food. Tasty meat sauce and plenty of it on any pasta dish. My wife gives the sauce and garlic bread two thumps up, so you can rely on that recommendation.  No need to dress up., nothing fancy but you are here for the food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ANIeC6vQUyEfgP7_Ifq9g"
  },
  "u4HHiuIRc62iVc_Wzfw3nw": {
    "date": "7/13/2016",
    "text": "I had an issue, the owner was kind enough to call, he understood the mistake and fixed it. I think he is a very nice guy and this was just a mistake. I will go back now, because he is so willing to help his customers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z8NtNeWmeAZsQcglcUKCIw"
  },
  "EgcpVZ5F7Jt2K4kvggmsaA": {
    "date": "10/8/2011",
    "text": "Sicilia You are Breaking my Heart!  I took a visiting engineer here based on the reviews and was not disappointed.    My engineer had the pasta and I had the Sicilian pizza with a few glasses of vino.  I likeed the references / signs how they are committed to quality - it was refreshing they won't comprimise.    The place has pretty good food.  We placed our pizza, pasta orders, and vino orders.   My engineer received his salad and garlic bread.  She returned about 15 mins later with our food.  The pizza was very good.  (almost tasted like a butter crust I have had in the midwest - very soft in the middle but crunchy on the oustide.  I expected the crust to more dense (Bad Sicilian pizza = a thick piece of bread wtih sauce... but that was not the case).    it was all really good.  No leftovers remained - we signed up for our cards (rewards program).  Pizza / Entree - Around $15 per.  The pasta came with salad or soup and garlic bread.   The 8 slices of Pizza almost filled a large cookie sheet.  Vino per glass - $5-7 per  Atmonsphere - It was okay -  there were TVs - this is not a Bravo but rather more on the Pizzeria side  Service - Awesome :-) - Our watiress was really engaging and streered us on the right choices.  I will go back if I am craving italian :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GM_CcXRrHUcfVWpGcLi3Hg",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Sicilian pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GM_CcXRrHUcfVWpGcLi3Hg/o.jpg"
      }
    ],
    "user_id": "JgOcyMF1lTwSVCarSZrrrA"
  },
  "Y29BC5hGbWMFdXfukRyAOg": {
    "date": "8/11/2017",
    "text": "Excellent excellent food; you can tell they put a lot of dedication and love into it. We were personally greeted by the owner who was so hospitable. We were even given free dessert when he learned that we were out celebrating a college grad. Always great to support local restaurants, especially a family-owned one such as this. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aj6RZu67AJ8UO9dMUlDE1g"
  },
  "jyVw_oldT_vdShAmika9Gg": {
    "date": "10/4/2013",
    "text": "Pretty impressed with their pepperoni pizza. The pep was very tasty .. not your average pepperoni pizza.. totally recommend !",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "DOZsa8Ue8Im6B14Si55MGg": {
    "date": "7/31/2012",
    "text": "We recently moved to the Pittsburgh area and had yet to find a great pizza and pasta place. Well, we found it in Juliano's! This place is simply the best. We were greeted even before we sat down and asked for our drinks. Our Server, Diane, should be on the Pittsburgh Visitors Bureau. She went over the menu with us and pointed out some specialties and later on at our request, she passed on her Pittsburgh favorites and lots of free and welcome advice to a couple Pittsburgh newbies. We had the pepperoni roll which could easily be a meal for two-excellent. We ordered a marguerita pizza-outstanding, and I had Chicken Ala Nico, which may be the best pasta dish I've ever had anywhere. The portions are large, the service was world class and the food is out of this world. Seriously, check this place out if you haven't found your favorite pizza and pasta place. Juliano's offers a quite complete menu of Italian gems with plenty of variety for all. They also offer a  special pricing on a different menu item every night (e.g., half off pizzas and wings on Monday and spaghetti special on Tuesday, etc)This is it for us!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "wdDdwIJe-t4z0DgILVyMtg"
  },
  "SSvTwUeMXqbdcrEYch2dPQ": {
    "date": "8/11/2017",
    "text": "One of our Go to places. Not fancy or pretentious good food at a fair price.  Grandma Anna says the wedding soup is just like her mother Carmella made.  We've come here for years, and years. If you are in robinson come in and get yourself a pizza and some fried dough.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zlwDMVMTM9WeQTZYXKfHpQ",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zlwDMVMTM9WeQTZYXKfHpQ/o.jpg"
      },
      {
        "img_id": "0iOq5SVYyRnPjAhFPSdSQQ",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Add some hot peppers and anchovies",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0iOq5SVYyRnPjAhFPSdSQQ/o.jpg"
      },
      {
        "img_id": "nqhV-C2qVDRjU4bD_ll_AQ",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Thick Sicilian cheese and mushrooms",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nqhV-C2qVDRjU4bD_ll_AQ/o.jpg"
      }
    ],
    "user_id": "g94Ml1oo2qQe_iGBJL8nAA"
  },
  "vdUKOhnBNnpHEqLz7OQD3A": {
    "date": "4/9/2017",
    "text": "I LOVE this place! Their pizza is great, homemade ranch is the best I have had along with the breaded zucchini. My go to dish is the buffalo chicken salad that is piled high with cheese and fries.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KlTfYnII5mJ3ELUmVqVvqw",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Buffalo chicken salad. Gotta get the homemade ranch with this!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KlTfYnII5mJ3ELUmVqVvqw/o.jpg"
      },
      {
        "img_id": "jtUEK9lMt2dkktJPBxsW1A",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Breaded zucchini. This was the large. Delicious!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jtUEK9lMt2dkktJPBxsW1A/o.jpg"
      }
    ],
    "user_id": "T_mcCDS5mfVfGkYX799aBw"
  },
  "T9PBR5cidXGODCISk_FJ7w": {
    "date": "4/2/2016",
    "text": "I visit Julianos at least twice per month. The service is always great (we typically have the same waitress) and the food is delicious.  Nick, the owner, takes pride in his business and the quality of his food.  M-F they have a self-service lunch buffet which is always a good time to sample some of their menu items. I really enjoy their pizza. Buffalo chicken and just a simple cheese pizza would be my faves.  They also have daily specials- the tortellini is Saturday's and it's great.  My all time favorite menu item is the pepperoni roll. They are homemade by Nick's wife, the sauce they come with is awesome, but I dip mine in blue cheese- because I'm a glutton.  Nicks promise is that his quality does not change with the economy, meaning he doesn't cut corners. This has been True for every visit we have had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "71p-gtXEhXgElHBVUgOvbQ",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Motto",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/71p-gtXEhXgElHBVUgOvbQ/o.jpg"
      }
    ],
    "user_id": "y_XgW02VKRwDKGhHq17yuA"
  },
  "JpKFNcIKxd2Kxvc7H-aB-w": {
    "date": "8/6/2018",
    "text": "Being a huge pizza fan, Im always skeptical & try new places to find the best.  I have to say this was one of the best Ive had around Da'Burg!  Both red & white were excellent, as well as the steak hoagie!  And of course the kids loved the fried dough, apparently a favorite.  We'll definitely be back even thou we live in South Hills!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fqIGwk9eZKEs7QWBtlK5HQ"
  },
  "22DTlB0wla9nVGedtdcisg": {
    "date": "11/25/2017",
    "text": "We found Juliano's on Yelp while our shopping. Amazing, phenomenal, delicious all come to mind. We had jalapeno poppers, a Juliano's calzone, and Sicilian style pizza. I could eat the marinara sauce with a spoon. Very homey, family style place. Just sorry we don't live closer to eat here more often, but we will definitely plan to return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xabMWMdY8y_X9DdQbI8Y-g",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xabMWMdY8y_X9DdQbI8Y-g/o.jpg"
      },
      {
        "img_id": "7UG2BP0W4qi6NvXgTwY_rw",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7UG2BP0W4qi6NvXgTwY_rw/o.jpg"
      }
    ],
    "user_id": "DT1K5vXQnSIUayTLNr5wuw"
  },
  "soXCOXw8KxAISxIB36KQ1g": {
    "date": "8/4/2018",
    "text": "Love this place. Someone from our office orders from Juliano's at least once a week. Hands down my favorite buffalo chicken salad I've ever eaten, and I've eaten a couple in my day. ;) The container is always packed full with tasty goodness and comes with soft bread and butter. Yummm!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uOE9N4RkoxPH4dIPiAtjMQ"
  },
  "d6uo5yVemVdF-Tk1hW2ZIg": {
    "date": "10/22/2017",
    "text": "Great staff and Pizza. Delivered to my hotel Hilton Garden. Wings also really good. Would recommend. Takes about 45 minutes worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pJ5yJblUWuQrVha8oyVnjg",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Pepperoni sausage and peppers",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pJ5yJblUWuQrVha8oyVnjg/o.jpg"
      }
    ],
    "user_id": "MLv_J9DhkdfscKSnBfMYLg"
  },
  "2YgM0e8hiPCXTJB3BjIY_g": {
    "date": "6/15/2018",
    "text": "You will see a negative review below (funny how its the only one) please disregard. Apparently the lady must have been drinking or high. As being Italian myself, I can attest that the sauce is not a katschup tasing sauce. Not sure where she ate, but it wasnt here. We lived here for several years and have loved everything we have ever had. We are in town now for a very brief time, but the food is so fantastic that we carved out some time, to go outta our way to come here. Believe me, if you want fantastic food, a great ambiance, and excellent service, Julianos is the place to come",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "v0R29YgC6vXpq9qgTT6lJQ"
  },
  "XqYP39SmAMPI7pbeJ80iHw": {
    "date": "10/8/2017",
    "text": "We ordered a veg pizza n loved it with jalapenos!!!! Ask Kirsten anything n she will happily answer  and help u! Excellent service excellent pizza!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tr9M1QBkAmgRsS834rl1tQ"
  },
  "ttL9MEHrj8Bcfmk1jqN83g": {
    "date": "1/15/2019",
    "text": "Came here for the first time a few weekends ago. Really good pizza and amazing customer service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZCY1_6aewXbi9ZV2CFzZiA"
  },
  "fMAs8AXn6s8upC7k6Hx8qw": {
    "date": "1/7/2019",
    "text": "I am the girl who stopped by your restaurant last Friday in search of Spinach rolls. Juliano\"s is own my way home and this was my first time here.  You recommended a spinach calzone & gave me 2 cups of dipping sauce- the garlic white sauce and the red sauce which I'm assuming is your spaghetti sauce. The calzone was quite good and what absolutely made it was the RED SAUCE. Incredibly delicious!!!! It is the closet spaghetti sauce to my deceased grandma's that I have ever tasted! I though I was never going to be able to enjoy that unique flavor again in my life.   My husband is a chef for 30 years and thoroughly enjoyed it. I have already began raving about your place to family and friends, & will certainly be back as I'm excited to try more dishes with you unique Red Sauce. Please don't ever change that recipe as it truly makes you stand above the rest.  Just wanted to thank you for a wonderful dining experience!  Happy Holidays from your new HAPPY satisfied customer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZyvD2eQIa0xvM_gI9vBbbA"
  },
  "3ZflqPpz26WUrmZLJppZ9g": {
    "date": "11/14/2018",
    "text": "Excellent little lunch buffet. Several kinds of pizza, a nice salad bar, and fountain drink for $10! Glad I stopped. Very nice folks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yo287xhcTZ-Nt_yb0SYumQ"
  },
  "rWWC_4orP2XKUvMIRy2KBA": {
    "date": "9/15/2017",
    "text": "This local whole in the wall is the real deal. We traveled from Oklahoma for a football game and we were craving some authentic pizza, and boy did we find some. We ordered a traditional style pizza, and they knocked it out of the park.   The staff was very welcoming and the waitress came and sat at our table and told us everything we needed to know about Pittsburgh gamedays!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EJhmllvm-xD0Y0w5g9k9Mg"
  },
  "UGpGIg3jDgcxL7o2RV40ZQ": {
    "date": "11/16/2018",
    "text": "First time here. Really great food.  Waiters were a little confused on who was taking care of table but food made up for it. FYI a small pizza is about 14\". Unless you are really hungry plan on sharing w others",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wo3K7NI6HIZVMlyT5fmQHQ"
  },
  "WOqBDi0RPLzg94f3gISsBg": {
    "date": "3/13/2017",
    "text": "This place has been around forever I swear. I remember ordering take away as a college student from my part time evening job. Years later and quality of food is still the same. Consistency is key. I've had better and worse food. But it's a place with a decent meal if you're in the area.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "w685Uv5UO7-ldfo9JghNlw": {
    "date": "1/16/2018",
    "text": "This is a fine choice for Italian food if you are in the area.  I started with a house salad that was ok.  Iceberg lettuce, two grape tomatoes some cucumber slices and a couple of canned black olives.  The house Italian dressing was good.  I also had the wedding soup.  Not the best that I have ever had but passable.  For my entree I ordered the veal parmigiana with a side of rigatoni (with meat sauce).  This was delicious.  The veal was flavorful  and the sauce clung onto the pasta.  Yummy...  To top things off, the service was excellent as well. I have already bookmarked this restaurant and will return the next time I am in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "UrY7qgbtN-99RsDFjJkvBw"
  },
  "FVqrNne7dPikXmuQcMylww": {
    "date": "2/27/2018",
    "text": "A few weeks ago I had a disappointing very average hoagie here, and subsequently left a poor review. The proprietor promptly replied to me that it was an anomaly and offered to comp my hoagie. I thanked him but turned down his offer, and said I would try his product again and hopefully get the best hoagie that they were noted for.  Today I got an Italian hoagie that was excellent. I highly recommend this place. Food is excellent.  I'll continue to be a steady customer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6RXYSl88GniPJ2XBJOFe_g"
  },
  "hjfOFHkXfVAnx1BnAcGOzQ": {
    "date": "4/1/2017",
    "text": "I ordered a Gluten Free Pizza for pick up last night and it was INCREDIBLE! As someone who has been gluten free for 10+ years, I know it is hard to find a good pie in Pittsburgh that tastes like the real thing. This is it! And it was worth the $20 I spent on it (veggie pizza with bacon added.) I promise you won't be disappointed with this choice!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WO7j4eA-jTwZbD2jXEAF9w",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Gluten free veggie and bacon pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WO7j4eA-jTwZbD2jXEAF9w/o.jpg"
      }
    ],
    "user_id": "j_XUyKHWIaTJwxRFqNgsxg"
  },
  "w7jk7e2rZrqcs87vaI15IQ": {
    "date": "7/12/2016",
    "text": "Juliano's catered my Bridal shower 7/9/16. The food was delicious and the staff they sent were outstanding. My family and friends won't stop raving about how great the food was and how nice they were treated by both staff members. We also had so many leftovers due to the generous portion sizes that we were able to take home for later. I could not have asked for anything better than service Juliano's provided to us on such a memorable day of my life. The sauce reminded me so much of my grandfathers.  I truly appreciate all the time Rosanne and Nick took to workout all the details with my venue and providing us real silverware on such short notice. My day was absolutely perfect and it was a huge thanks Juliano's. We hope to have many other events to use Juliano's for in the future. THANK YOU SO MUCH!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "chbCROaKWm2pj5uUT-ruGw"
  },
  "LlsTj534GKA9yBsYFVPw1w": {
    "date": "1/13/2018",
    "text": "Fantastic! Wish I lived close.. I'd be a regular. Loved the food and the ambience. Owner came by and introduced himself and really cared if everything was good.. it wasn't good, it was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ng2lcVxm61QTt9KDnsYQyw"
  },
  "R4B8Cmuy5ah8fzFpnKBDDA": {
    "date": "7/26/2019",
    "text": "Fantastic pizza!  Being from Chicago, I'm spoiled by some of the best pizza in the US, and my wife and I really enjoyed Juliano's.  Will def go back next time we come through the Pitt area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "079o6-fMqTAE8eT1vUKOTg"
  },
  "EwFjEs6qtBEsUkpGHuVM5Q": {
    "date": "11/20/2017",
    "text": "Call me crazy, but every once in a while an ideal Friday means getting a pizza to go and enjoying a quiet night in. Juliano's is rather close to home, so after living in the area for over a year I figured it was time to give it a shot. This is a choice that I absolutely do not regret, as Juliano's is now a place we can call a new favorite!  First off, you can never go wrong with a classic Italian hoagie. We ordered a 12\" and an 8-cut Sicilian-style pizza. For toppings on the pizza, we chose Italian sausage, green peppers, and onions. Toppings vary in price depending on the size pizza you get, so keep that in mind while you're ordering. We were pleasantly surprised at the beautifully melty cheese on top of the mound of toppings on ours, but the biggest kicker was the buttery, flaky crust. Sometimes when you get a Sicilian-style it's overwhelmingly doughy, but this was one of the better crusts I've had in my pizza-eating career (if only that was my day job). The hoagie was also generously piled high with meats and toppings, and the Italian dressing complemented the flavors of the meats just like it should. The whole meal totaled out at about $35, which was fair for the amount we ordered.  Living in the city a good pizza place is usually a stone's throw away, but this one is worth traveling for. Not only was the pizza good the night of, but it was almost as good reheated for lunch the next day! We will definitely be back, but it'll be a hard choice of what to try next!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6tmQ3bn7oqP-zfOMgYa-zg",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Deep dish goodness",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6tmQ3bn7oqP-zfOMgYa-zg/o.jpg"
      }
    ],
    "user_id": "1VVHf1BvtGC0aSCCIjQyiA"
  },
  "idyPJFHAQ32oWuTaSPbIAQ": {
    "date": "7/30/2019",
    "text": "Maybe the best pizza in The Robinson area.  Always good and worth the price. Never had a bad pie from Juliano's.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0nxzG-WAxV6ROi6gEPPzRg"
  },
  "sX8xziI31iTKRXCQYbaLfg": {
    "date": "12/20/2018",
    "text": "Excellent Food & Service.  They have Great Pizzas and their Pasta Sauce is just like mom use to make if She was Italian.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xNrLyDqmTwlqAw32lRE1xQ"
  },
  "14Swoy-whsISQBHMRYmHJw": {
    "date": "11/16/2018",
    "text": "Just got into town from California. First meal ever in Pennsylvania. AMAZING! Great service. Great food! Linguini with clam sauce and pepperoni roll. Was more than enough to share between me and my wife.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "smlrxN8yK6uABdppP0F6tA",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/smlrxN8yK6uABdppP0F6tA/o.jpg"
      },
      {
        "img_id": "LISJfgSIylbk4JpFI8A8ZQ",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LISJfgSIylbk4JpFI8A8ZQ/o.jpg"
      }
    ],
    "user_id": "IJVpJeNvznptlJXYI5G7bg"
  },
  "eGfqSejPFw4sAA9_yNYBzQ": {
    "date": "4/7/2018",
    "text": "This was not our plan for the evening, but everything happens for a reason and occasionally for the better. Tonight was just such an occasion. From the time we walked in the door until the moment we walked out we were made to feel welcome and important.   The food was out of this world. You will never find quality or portions of this quality or quantity in any chain restaurant. This place is a hidden gem and a definite treasure to their community.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i4KOhhf1-JuDqt90C4ATOg",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i4KOhhf1-JuDqt90C4ATOg/o.jpg"
      }
    ],
    "user_id": "zmbWAD5YD0zFz88oIAEttA"
  },
  "whBiPnzYZCYLIBJUXAmrWA": {
    "date": "6/30/2019",
    "text": "I came here with my husband and kids after we had been out and about for several hours. Because of this, we got there at 8:20 and the place closes at 9, so we ended up staying past closing. You never would've known it from the smile on our server's face. We had the best experience with friendly customer service and great food! This place is clearly a family restaurant, and it's definitely worth a visit if you are out this way. The cheese ravioli is fabulous! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oBDuRET6hcSaO1c4OeLpog"
  },
  "t3zeidoXQi10t24WR2Qt4g": {
    "date": "5/18/2019",
    "text": "Best pizza and Italian food around! Fresh delicious salads, delectable home made ranch and Italian dressings, scrumptious wings and appetizers. Oh, and did I mention the awesome waitstaff??!!! Excellent people who try to please you and make sure you're satisfied with your meal. This is our go to place when we are craving some good Italian food or pizza. The restaurant is a bit dated but we love the \"comfiness\" of the place...and the old Italian songs playing in the background just adds to the atmosphere. The owner always checks up on things to make sure your food is just right and you are happy with everything--including the temperature in the restaurant! Kudos to Nick for a consistently great restaurant.  Update: two years later and their food and service is still consistently great!!! Love their house Italian dressing, their sauce is delicious and their Sicilian pizza is the best!!! Fresh, crispy salads, Calzones the size of your head stuffed with goodness, hot sausage hoagies so tasty you could scream and so much more! Same awesome waitstaff and Nick is still there checking on everything to make sure you get delicious food and service as always!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_Bhi59TIR5kSzM66kkDx8w"
  },
  "KA210CUGSu3GJNo7GoDppg": {
    "date": "3/31/2019",
    "text": "I threw a surprise party and had it catered by Juliano's. The order was for about 35 people, and I'm pretty sure that just about all 35 people asked me where the amazing food was from!   The chicken parm, sandwiches, stuffed cabbage, everything was perfect! You could tell everything was freshly made and came piping hot. The order was correct, the prices were affordable, and the food was (as always) delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_xwIRKh7SXvsh5ICxdSqiA"
  },
  "H64ut2chj_G82n8W5Yq0MQ": {
    "date": "5/18/2018",
    "text": "If you are searching for authentic and delicious Italian fare look no further than Juliano's. Thankfully we arrived for an early Saturday dinner after the ballet and were seated immediately, because by the time we left there was a line of people ready to come in. Lots of families with younger children so you definitely know it is a family friendly establishment.  I would like to mention that I would love to see them update the decor in here to help liven the place up but you can definitely tell this restaurant has been around serving some fantastic food for over 35 years. The service was super friendly and fast and after a quick look at the menu I decided to go with one of their \"daily specials\", you usually can't go wrong with a special. Those tend to be the dishes that have been perfected and are loved by many. The Saturday special was a tortellini covered in a pink sauce(for those who don't know a pink sauce is a combination of a marinara and an alfredo sauce), garlic bread and a started of either soup or salad. Since I heard their wedding soup was a favorite of many I went with that and it didn't disappoint not to mention the bowl was huge and honestly that could have easily been enough of a meal for me!  My main dish was also very large as was my husbands chicken parmigiana and spaghetti, we took more than half of both these dishes home for leftovers.  If you know anything about Italian's, they LOVE to feed their guests so the huge portions were no surprise to us! The marinara sauce here at Juliano's is just about perfect, it doesn't taste like straight tomatoes and it isn't overwhelmed with spices either. It's on the more mild side which I like.  For dessert we were treated to another fan favorite the Pane Fritte...homemade dough that is fried and sprinkled with powdered sugar and a vat of chocolate sauce on the side for dipping! Hello, this was divine. I want to just stop by and order a plate of these with a nice cup of cappuccino. Overall the meal was fantastic, the service was fantastic and the laughter that you could hear throughout the dining room full of people was heartwarming. What a great little Italian family restaurant. Juliano's also does catering, hosts parties, has call ahead ordering and a diner rewards program. They also sell gift cards if you are looking for a fantastic gift for someone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K960hI3r4bx4SX_TaR2b9A",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Pane Fritte...homemade dough sprinkled with powdered sugar and chocolate sauce for dipping",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/K960hI3r4bx4SX_TaR2b9A/o.jpg"
      },
      {
        "img_id": "OECoKohttuuqEP_d3UWePw",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. (Back) Chicken Parmigiana and Spaghetti (Front) Saturday Special Tortellini with Pink Sauce Garlic bread included with both",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OECoKohttuuqEP_d3UWePw/o.jpg"
      },
      {
        "img_id": "_DTp4een7B-fdLZZGn7-Nw",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Wedding Soup. Customer favorite! Chicken broth, meatballs, spinach and pastina.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_DTp4een7B-fdLZZGn7-Nw/o.jpg"
      }
    ],
    "user_id": "NUjPmuf284g5J6EGT-Uhjw"
  },
  "cOAL_ApOnpwjwsuwqztCug": {
    "date": "10/17/2017",
    "text": "We drove a little way off of our path to get to this place, but it was well worth it. We kept finding pizza place after pizza place and we were in search of pasta for the kids. Lucky for us, they even had a gluten free menu for my son who has a few tummy issues. Perfect! We had Italian wedding soup, chicken noodle, a pizza, gluten free pasta, and a huge slice of cheese pizza for my daughter. It was amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C59H5t1PjFcCU0RgUQVD9A",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C59H5t1PjFcCU0RgUQVD9A/o.jpg"
      },
      {
        "img_id": "LMoYcE7CHrONIAIdUI0cAA",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LMoYcE7CHrONIAIdUI0cAA/o.jpg"
      },
      {
        "img_id": "L_jl8Dr-ku45Vp4mK5VFAA",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L_jl8Dr-ku45Vp4mK5VFAA/o.jpg"
      }
    ],
    "user_id": "LmaOptmkvxVEvftB3_AsFw"
  },
  "puAaQUhTMcNbH0caCovgiA": {
    "date": "7/22/2018",
    "text": "My dear Yelp friends, in finding Juliano's, I realized that the quest for great pizza should never end.  A little over a year ago I was in sort of a Pizza Zen zone.  I had my list of regular places for pie and I stuck to it.  My relationship with local pizza had sort of come into the comfortable zone.  Then one fine day I attended a party at which they were serving Juliano's.  The pizza was great! I was intrigued and began asking how far I had to drive for this Pizza.  To my surprise, I found that it was only few miles away.  In fact, I drove past this place all the time!  Since then, Juliano's has become part of my regular rotation.  Their traditional pizza crust is out of this world.  It is thin and crispy on the outside but like home made bread on the edges.  Being a cheese person, I often request extra cheese.  This love is especially True with the cheese that they use at Juliano's.  It is so full of flavor that even the members of my household who aren't traditionally extra cheese type people love the extra cheese pizza from this place.  And that sauce.... man their sauce is pretty close to perfection.  It is obviously great on the pizza but you really get an appreciation for it when you eat it with their bread sticks.  I could go on and on.  We've had their wings, which are great (a little pricy) but tasty none the less.  Thanks to a lunch time buffet Welch tried numerous arrays of toppings from buffalo chicken to crumbly sausage. All have been really good.   Sadly enough I haven't branched out into their actual pasta dishes.  When I do I'll provide an update.  To think, I almost missed this place... in my own back yard, because I got into the pizza comfort zone.  Moral of the story, stay hungry my friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZdQxhh3hCW33imdMHMIR_g"
  },
  "g9kgN8KhRuqr19vcKgg_mA": {
    "date": "11/5/2017",
    "text": "My girlfriend and I are traveling out of the area and picked this Pizzeria based on the reviews and pictures. They did not let us down! I ordered a spicy Sicilian pie, she ordered a plain cheese gluten free pie and we split a large cheese fry. They were both delicious! Good sauce, good cheese, and dough was cooked golden brown with a crisp at the bottom. We will definitely be ordering from them again before we leave.  The only downside to my experience was that our cheese fries came with shredded mozzarella instead of cheese whiz so be specific when ordering. I thought cheese whiz was the default cheese of choice when preparing cheese fries. I was wrong. Also it would be nice to include utensils and napkins with the order.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_ujTvZkZi5gFOn28-OD9qw",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_ujTvZkZi5gFOn28-OD9qw/o.jpg"
      }
    ],
    "user_id": "EAepMn2I9CzkqLm9H2C4JA"
  },
  "GnR9gbAt38addgGTwd_bkQ": {
    "date": "8/2/2018",
    "text": "Food was delicious.   Service was friendly.   The portion sizes are huge!!!!!   Tables or booths as option.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n8Y5Ut7GWDe7kYv8PjUoJw"
  },
  "uU0y42NEuQB6ktC39L-HVg": {
    "date": "9/20/2016",
    "text": "My work ordered a variety of pizzas from this restaurant for our team gathering. I was pleasantly surprised by how good the pizzas were as was expecting something similar to a chain store and these ones were nothing like that at all!!  I tried three kinds of pizzas - the White Pizza which was my favorite, then just a regular Cheese Pizza and finally a Veggie Pizza. I especially also liked the robust mushrooms and great flavour of the calamata olive on the Veggie Pizza. The crust on the pizza was great, the tomato sauce tasted home made and best of all was that the cheese did not taste plastic at all!  I really quite like how good the pizzas tasted, and so wouldn't mind coming here to try their other food items.  Note: #323 of Yelp 100 challenge for 2016",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ku2m6vvrIZOXxNhpIw8WIA",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Cheese and veggie pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ku2m6vvrIZOXxNhpIw8WIA/o.jpg"
      }
    ],
    "user_id": "Fd3GvZTer-2_EwMzL3ptAg"
  },
  "GP_epvpAI9UfCNnbsJemyQ": {
    "date": "12/9/2018",
    "text": "We love Julianos, especially the calazone and house salad with ranch dressing. The thin pizza is awesome, add your own topping and enjoy as if you were in Naples. (We have been) We are repeat customers for many years.  But, yes there is a But, the bathrooms are not clean, where the floor meets the wall is really nasty. I have alerted a waitress several times while dining there. Nick, please send an employee in the bathrooms with orders not to come out until those bathrooms are sparkling, and then inspect them. We will see you before Christmas. Thank you!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rSI5pIdRIFcStXVT1hFM0Q"
  },
  "24OVvfCsXgvvCEwMQgbwqQ": {
    "date": "8/29/2018",
    "text": "My son was just diagnosed with Celiac.  He missed pizza and a fried recommended Juliano's.  We had a great lunch there.  Service was great.  Gluten-free menu includes pizza, penne, ravioli, brownies, and strawberry shortcake.  They also deliver to our home.  Owner was very nice and gave us a free dessert when I mentioned my son's issues.  I am thankful there's a restaurant close buy for my son and the entire family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ee1Qzhqqq8PSQDN_25eFSw"
  },
  "2sMz_PJ2yvy7NgkqmmwDlQ": {
    "date": "5/9/2017",
    "text": "Our family - 4 adults and two toddlers - went to Juliano's on a Friday night for dinner - I was impressed, right off the bat, that at 6pm we were seated immediately.  Our waitress was attentive, despite having a number of tables, and gave my twins extra special attention.    Our appetizers were good - we had breaded mushrooms and jalapeno poppers - both were well-cooked and they came out first - I love when appetizers come out at the right time (especially on a Friday - they're not rushing you out, they're letting you enjoy dinner!).    My buffalo chicken salad was delicious- generous sized buffalo tenders, lettuce, and homemade ranch dressing.  My kids had rigatoni and it was also pretty good - the inhaled it!   Drinks/refills and everything else were on point.  A great family spot for a good Italian meal!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "MCzlzlOw7IGbRAKVjJBPtg"
  },
  "RVDvw3nYizKbnnMF2C2NpA": {
    "date": "3/24/2018",
    "text": "My family came here pretty regularly growing up bc it's just always such a great meal and now that my husband and I live within a 10 min drive, we're regulars also. Dine in or delivery, it's all delicious. Top pizza place in Pittsburgh but their entrees and sandwiches are no slouch either.  And the zucchini -so so good, especially with ranch (like a True Pittsburgher)!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "phsDm7coAiXBV4rCEURedA"
  },
  "vIQPtqjQafyhfBAE2o8t_Q": {
    "date": "2/1/2016",
    "text": "In today's world of take out and delivery, the good old fashioned sit-down pizza shop seems to be a thing of the past. I have fond memories of going out for pizza with my family when I was a kid, and Juliano's is the kind of place that takes me back to those simpler times.  This is not a fancy pizza shop. The decor is old and dated, but it still feels homey and welcoming. The staff (from the servers to the cashiers) have always been nothing but incredibly pleasant. But of course the main reason we come here is for the pizza. It is, quite simply, delicious. We're fans of their square Sicilian-style pie (one of their signature pizza types), which has a wonderfully thick, fluffy, slightly sweet crust that is crispy on the edges (I don't normally eat the edges of my pizza, but I devour these!) The sauce is well-seasoned and also has a bit of sweetness to it. The portion of toppings and cheese is more than adequate and always tasty. Juliano's makes a very simple, very good pie with high quality ingredients. They serve other Italian dishes too (pastas, etc.) that I'd love to try, but it's hard to tear myself away from their pizza. Maybe someday.  I don't live nearby, and in general I hate driving out to the Robinson area, but they are worth braving the tunnel monsters for. I only wish they'd open one in my neck of the woods. :)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "7_nSH0B6E2CyoI92nKCQ0Q",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Mozzarella sticks",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7_nSH0B6E2CyoI92nKCQ0Q/o.jpg"
      },
      {
        "img_id": "19ZBUOpJm_K9EpScObAzZw",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Large Sicilian-style pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/19ZBUOpJm_K9EpScObAzZw/o.jpg"
      }
    ],
    "user_id": "0EhPIlDozxGKpbbHRr6vZg"
  },
  "JVxWn63UHerOvna3AwTuNQ": {
    "date": "4/5/2019",
    "text": "Had dinner here.  The food was great.  HUGE portions!  Come hungry!    Staff was excellent.  Family run business and the owner was very pleasant to talk with.  I look forward to going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8dAeS64su-LbQFFIrjEvA"
  },
  "fMuzSiTyLC6yitoVFQJvZw": {
    "date": "9/7/2019",
    "text": "Whenever I am in town, I pick up pizza from Juliano's on the way in.  My family was from Robinson, and I've been a fan of Juliano's since they opened.  Always awesome pizza and great service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1pQDBAA5KbULbWeGqLRrrA"
  },
  "-O7lvYqPEt9mxyAUdGqaXw": {
    "date": "11/29/2018",
    "text": "Finding good Italian food is difficult. Finding good GLUTEN FREE Italian food is even harder.    Fortunately Juliano's provides those with gluten intolerance/allergies a chance to enjoy something special. Juliano's prides themselves in having a separate area to prepare GF meals and also provides guests with a specific menu with all GF items.   My husband ordered a pepperoni pizza, and let me tell you, this pie was DELICIOUS.  Lots of pepperoni, yummy red sauce, sturdy gluten free crust.   Meanwhile, I personally ordered ravioli (all gluten) with a red meat sauce and three pieces of garlic bread on the side. All of it was HOT, flavorful, and made to order.   We came in on a weekday, so my order also came with a salad (which I could make from their lunch buffet).   To top it off, when you pay at the counter you get a chance to win gift cards by spinning their money wheel!   Good times had by all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7HUOui_nU636sZytxxRxZQ",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Yummy yummy garlic bread",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7HUOui_nU636sZytxxRxZQ/o.jpg"
      },
      {
        "img_id": "OSchLSt7gvpWpQ4iFWGDzQ",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Gluten free pepperoni pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OSchLSt7gvpWpQ4iFWGDzQ/o.jpg"
      },
      {
        "img_id": "mliLXoGXhxhUZf0MT2zgkA",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Meat sauce and cheese ravioli",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mliLXoGXhxhUZf0MT2zgkA/o.jpg"
      }
    ],
    "user_id": "e7CcnU1sjv1BuBfbbGDZSQ"
  },
  "jEPgIKF1_bbLQWaPRl5bow": {
    "date": "4/19/2019",
    "text": "This place was amazing.  Only complaint was the long delivery time.  However.  The food outweighed that.  It arrived hot.  The staff on the phone were super helpful and friendly as well as patient.    Loved listening to the Italian accent. Ha.  Mio amore Ordered rigatoni with meatballs.  Upgraded to cheesy garlic bread.   Side salad came with it as well.  The salad was beautiful really, for a side salad.   The ranch was tasty.  Rigatoni was perfect and not drowned in sauce.  The garlic bread was amazingly flavorful.   I ordered baked penne with meatballs.   Also came with a side salad.   The penne was also delicious.  The meatballs were genuine for sure.  Far surpassed the meatballs we had at the place that's all about meatballs in Pittsburgh.   Extras add up so be mindful of this.  Will order from here again for sure!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TBGJLKcQvr_K61A45ZBCYw",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Cheesy garlic bread.  Yum.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TBGJLKcQvr_K61A45ZBCYw/o.jpg"
      },
      {
        "img_id": "GupxhnDvw_QGaUE5v7-YDA",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Meatball.  Comes with two.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GupxhnDvw_QGaUE5v7-YDA/o.jpg"
      },
      {
        "img_id": "IR49wYrqhtB8JZ6vSHyVNQ",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Super authentic.   Like when I was growing up!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IR49wYrqhtB8JZ6vSHyVNQ/o.jpg"
      }
    ],
    "user_id": "6yVXezMxbFjTeVUFrigtuQ"
  },
  "gEcpU5AEW7CwmEdLNST9FA": {
    "date": "8/16/2019",
    "text": "We found this amazing Italian Restaurant on our way home from Myrtle Beach to Erie. This place is awesome. Not only was the food fantastic the owner (Nick) was so pleasant and our server was great! Nick even did a magic trick for the kids which was the icing on the cake to our beach vacation! Nick and Juliano's thanks for taking such great care of our family! You are worth the 2 hour car ride for the best Italian food!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E5LOi26dK3lOTVgR9i6NcQ"
  },
  "NRQfwllxEpNgA_0xoXWiAA": {
    "date": "6/12/2018",
    "text": "Before reading the rest of my review, I would like to say that my service was great and I tipped accordingly.   Alright, what? Italian? No way.   Not from the area, I did a quick Yelp search for the nearest place that served spaghetti, and picked Juliano's because of the strong Yelp reviews. Yelpers, you guys let me down- so I'm here to save the next poor soul who would want to try this place.   If you like tomato-ketchup-soup and angel hair pasta with meatballs that taste like straight oregano then this is the place for you. If not, stay away-far away.  I was really disappointed and left barely eating the food that I graciously paid for ($20 for one person, my pasta was straight up $14). And I left really confused because, despite the sincerity of this place being Italian, the menu dotted with phrases like \"the finest ingredients for our customers\", the food was awful. God- awful. The bread was just drench with butter and didn't have any flavor. And the sauce tasted just like ketchup.   With the nice service, I felt bad sending my plate back and I'm not the type of person who does that, but man, it was hard not to.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jCfRstNweMonGBm9xpGovQ",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jCfRstNweMonGBm9xpGovQ/o.jpg"
      },
      {
        "img_id": "iXhtsjHUO9xuZcD0F3Ijgw",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iXhtsjHUO9xuZcD0F3Ijgw/o.jpg"
      }
    ],
    "user_id": "IzzvqiiSFshen8_NZFhJ0w"
  },
  "8W_biJnVw44wH2BvCxg7BQ": {
    "date": "1/15/2019",
    "text": "Nice authentic Italian food.   Real veal parm, bruschetta was delicious with home made salad dressings.  Huge portions.  Garlic bread was really good with real minced garlic. Small family owned restaurant atmosphere with very friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I6ScbcQ1MTMfao3-UlBPRg",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/I6ScbcQ1MTMfao3-UlBPRg/o.jpg"
      },
      {
        "img_id": "t3zbpKuzQnFbxH7_9ynS5A",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t3zbpKuzQnFbxH7_9ynS5A/o.jpg"
      },
      {
        "img_id": "Zw0ZR1ucaJsMlMdjkqUKgQ",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Zw0ZR1ucaJsMlMdjkqUKgQ/o.jpg"
      }
    ],
    "user_id": "u_zhjxCz3TXuq8Glt2o9og"
  },
  "6D8zZxCfWM05xpETXdufUg": {
    "date": "8/31/2019",
    "text": "Overpriced & Underwhelmed. My experience, no drama, just truth. I see the owner jumps in to defend bad reviews & that is his right. However nothing to defend here -this was my 2nd try & I really wanted to love it. Disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YxBsMkreDFLkLMSVruavtQ"
  },
  "gOnc8IhCU36ke8oXsyvL0w": {
    "date": "7/13/2018",
    "text": "We were passing through Pittsburgh and Caen across this restaurant for dinner. It's a pretty standard Italian restaurant, no frills. The staff were super nice. It was a medium to small location but was pretty packed for a Thursday night. We got a few different things and overall it was good.  What we got:  -Chicken Parmigiana: This is quite a large portion! You can definitely make it into another meal for tomorrow. The pasta was good. The breading for the chicken was a little soggy but it still tasted good. The entrees come with a side salad and let me tell you the ranch here is actually really good!  -Veggie Pizza: We really liked the pizza here! It was the thin crust pizza. It wasn't overly cheesy or greasy, which I appreciated.  -Plain Ravioli: This was a pretty standard ravioli dish with marinara sauce.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ojr_c5sC-Y9UxRIcRd7Ebw",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Greek Salad with olives, tomatoes, onions, cucumbers and feta cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ojr_c5sC-Y9UxRIcRd7Ebw/o.jpg"
      },
      {
        "img_id": "JTvlq-ZI-G25a_xAn0jgLQ",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Custom Veggie Pizza - asked for it to be made &amp;#34;well done&amp;#34;",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JTvlq-ZI-G25a_xAn0jgLQ/o.jpg"
      },
      {
        "img_id": "QWhlv21HAkd6LBAysusOIg",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Chicken Parmigiana with Angel Hair Pasta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QWhlv21HAkd6LBAysusOIg/o.jpg"
      }
    ],
    "user_id": "rcUZPZPQjUrmTaug61yC-g"
  },
  "YJgg9VJ0svtQp4Y2vboN3g": {
    "date": "5/5/2018",
    "text": "A fabulous family owned establishment that doesn't serve a bad dish no matter what you order. On this particular visit they forgot the misses salad but it happens at times.  We started with delicious mushrooms and a side of sauce. I had a 50# calzone which you get 4 toppings to add for $14. The misses ordered lasagna which was belly blasting yum as she put it. The kiddo had a 1/4 pound hamburger with French fries. To cap off our we are a fat family extravaganza we had the fried dough and chocolate sauce.  The owner Nick checked on us and was very cordial. As we wobbled out of Julianos we burped and gassed in total food euphoria. Thank you Julianos for another 5 star evening.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "b14YQ5U8efHNrYj0-EwwiQ",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. 50# calzone",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b14YQ5U8efHNrYj0-EwwiQ/o.jpg"
      }
    ],
    "user_id": "5Ci7FP9Qh_Kw21Doy9WCYA"
  },
  "GFM3p0C9uXkWGDXMNRGdIA": {
    "date": "7/22/2019",
    "text": "Great good ! Never really dined in but always ordered out ... Buffalo chicken salad is delicious !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q3kq8Tx9wdCUfOexGQtAEQ"
  },
  "VNRi9CfgCV_vT35oKN0LCQ": {
    "date": "3/29/2018",
    "text": "My boyfriend and I went here yesterday for a late lunch, which was actually the best time to go because there wasn't really anyone eating here at the time, we had the entire restaurant to ourselves. Service was excellent, food didn't take long at all to arrive at our table.  For an appetizer we ordered the famous pepperoni roll, and had it covered in garlic butter and Parmesan cheese. Oh heavens! So amazing! Came with a home made marinara sauce to dip them in which was to-die-for! He ordered a deep dish pizza with extra cheese and jalapenos on it, he loved it. And I ordered fettuccine Alfredo which came with a salad or soup, choice of dressing, and garlic bread. You can definitely tell the sauce was home made and so fresh! The dish was piping hot when it came out! The garlic bread was amazing too! Ate every single piece of it! Crispy around the edge and nice and soft and garlicky in the center. I ate every bite too, I was so hungry    This place also has a huge wine and beer selection, my boyfriend actually got a 6-pack to go, only 8.50, which I think was a good deal.   Overall I really enjoyed the experience here and will definitely have to return to try one of their other entrees, this menu was so huge too, might I add. Soups, salads, pizzas, hoagies, calzones, and a huge appetizer selection. But I'm a die hard Alfredo lover so every time I go to an Italian restaurant I have to try the Alfredo    The bill was exactly what I intended to pay for so no complaints there. I tipped the waitress well, she was friendly and checked on us multiple times to make sure everything was satisfactory. My boyfriend even commented to me about how quickly she refilled his drink after he finished it.   Very wonderful service and wonderful people, would highly recommend if you love homemade Italian cuisine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DKz8bsqlbm7B75-SDWLdEg",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Beer selection",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DKz8bsqlbm7B75-SDWLdEg/o.jpg"
      },
      {
        "img_id": "EnJg1LX4rAoTJmO916Tj6w",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Beautiful garlic bread",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EnJg1LX4rAoTJmO916Tj6w/o.jpg"
      },
      {
        "img_id": "YEAL5r0TUh_Oi0iVDKMNlw",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Fettuccine Alfredo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YEAL5r0TUh_Oi0iVDKMNlw/o.jpg"
      }
    ],
    "user_id": "I4wplanZZZbL7rYPA7RVrQ"
  },
  "x1BolBTSyaqK5N4hOHFTlg": {
    "date": "2/18/2019",
    "text": "In Pittsburgh, there seem to be more pizza restaurants than there are Steeler fans at Heinz Field on a playoff Sunday...but if you are looking for one that outshines them all, look here.  In terms of ambiance, it has a diner type of feel, which is very low key and casual, but what sets them apart is how truly amazing every single one of their dishes are.  Their hoagies are not only delicious, they are larger subs than the S.S. Requin at the science center!  My personal preferences here are the Italian and the Steak.  Their pizza contains a house made sauce that is one of the single best I have ever tasted.  If you order a large, plan on having some cold for breakfast the following morning.  As to their wide and varied selection of Italian entrees (I am doubtless going to catch some flack for this), their veal parmesan is the best I have ever tasted in the state of Pennsylvania.    Their prices are extremely reasonable, the atmosphere is laid back, the service is very friendly and of the many times I have eaten here, I have NEVER had a single negative experience.  If you enjoy Italian food, this is, far and away, your best choice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "oz7Vex6bxIbVhMTbVYKD-w"
  },
  "ELgc2JABz5zgfjdD2UUrsQ": {
    "date": "6/30/2019",
    "text": "Delicious pizza and food overall.  Delivery service is exceptional.   Probably best pie you will find with delivery.   Sicilian Pizza is great too and has grown on me.  They are very careful putting some wax paper to keep the integrity of the cheese.  Here is a tip: order this pie and I guarantee you will have enough for multiple meals and it tasted even better after putting in the oven.  It gives it some crispiness.  Only one con to Julianos: pasta is way overpriced.  For the price point, it's just not worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2j54q0SIJSujVf-utjCPKA"
  },
  "DlCIfHndVekfFTfyJ8MqXg": {
    "date": "7/25/2018",
    "text": "What a great hole-in-the-wall place for great food, drink and service.  Easy to miss if you're not from around the area. Also an older building, which gives it even more of a local and home-like feel.  They had drink specials for Happy Hour on a Wednesday, which was great. And they had half off wings, which was their special that day.  I opted for a glass of Pinot and did the pasta combo -- spaghetti, ravioli, sausage and meatballs. Sauce was actually good with lots of flavor. I was expecting a bland and watery sauce, but it held up. Awesome prices for the amount of food you get.  Our server was really nice and was actually the one taking care of the entire restaurant. And the tables were seemingly full for a Wednesday evening.  Would come back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "5elDILcQojTsX7GtU_N1Og"
  },
  "T_SG2uXzuMyiwXes0dq95g": {
    "date": "7/3/2019",
    "text": "Fabulous local Italian.  Family owned (owner is there often) and they use his mom's recipes.  So this is seriously good Italian.  My teenage boy LOVES their buffalo chicken salad and requests to go there specifically for that.  My six year old daughter makes me order her own pizza so she can have her own leftovers.  And my husband and I bounce between the calzones and lasagna which can feed multiple people.  It is the perfect go to when I'm too tired to cook...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R_zoev6dx7jssDDrNL8sRQ"
  },
  "PoD4VtoMv09ckKsruxa7IQ": {
    "date": "9/23/2018",
    "text": "I've been wanting to try Juliano's for a long time. We moved to the area a few months ago and this is one of the flyers we received in the mail. I saw the reviews on Yelp and knew I would have to try it eventually.   We got a large pan pizza with sausage and pepperoni, a buffalo chicken sub, and breadsticks. I liked it - it's not my favorite but it was a nice change of pace. The price is a little high in my opinion but the ingredients are probably better quality than the other pizza shops in Pittsburgh that all taste the same to me. I wasn't a huge fan of the amount of cheese on the pizza. If you're someone that doesn't like a thick, chewy layer of cheese on your pizza, you might not be a fan.   The breadsticks were good - I like them a lot better than the ones that once again, taste the same in every other pizza shop in Pittsburgh. They were less chewy.   The buffalo chicken sub was decent and I really liked the hot sauce, but I've had better.  I almost feel guilty writing this review because I understand why people like this place, it just won't be our go to. I'm giving it 3 stars because we probably won't be frequenting this place but I don't want to turn others away that might like this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dTMhVGbU-BGpnCDmikhgfA"
  },
  "_wV7z5CirObdw5zw71Qp7g": {
    "date": "12/28/2018",
    "text": "Nothing was good that we ordered. I love wedding soup and this was seriously the works wedding soup I have ever had. The bread had too much butter and my friend said their pasta tasted like old ketchup.  Definitely would not recommend.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RFaIsw20f4khVfBTQ5qL3Q"
  },
  "SCzzX8x-AJJ_-PkK4oAmfg": {
    "date": "12/14/2018",
    "text": "We found Juliana's here on Yelp, and we were pleasantly surprised!  We decided to get just the normal things on the menu and no specials. We ordered two things and split them. We got a small pizza...half pepperoni and half plain, and we also got a rigatoni with marina sauce with the wedding soup. Our waitress forgot our wedding soup, but brought to us after we asked. Everything was great with huge portions. We loved everything, and we brought home half of our pasta and half of the pizza to eat for lunch the next day. Also the garlic bread that comes with meals was outstanding. I would give a 5, but decor and ambiance was a little older, which truthfully doesn't bother me in the least, but in the end not worth a 5...SOLID 4 stars!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_cnwVxxitxOox6oJzbpZLA",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_cnwVxxitxOox6oJzbpZLA/o.jpg"
      },
      {
        "img_id": "9JBsOLXAXsR23xSVqEoVaQ",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9JBsOLXAXsR23xSVqEoVaQ/o.jpg"
      }
    ],
    "user_id": "_V9wYMkXMfflqCR8eabt9A"
  },
  "tqfwS8LRiusKTtPh_X751Q": {
    "date": "1/22/2019",
    "text": "I would have given four stars until I tasted my husband's veal.  He said it tastes weird and I had to agree. Not spoiled or anything just weird.  This was for the veal parm.  He liked the sauce but I didn't particularly care for it.  I had the Chicken Ala Nico.  This was delicious with a nice garlic cream sauce. Wedding soup good with plenty of meatballs. Their portions are enormous.  Wish they would have half and full portions.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s_Vv_AMkPQFX4hFiJcNsuw",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Chicken Ala Nico",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/s_Vv_AMkPQFX4hFiJcNsuw/o.jpg"
      },
      {
        "img_id": "nn39mVVjwJE8Kxg2LbX2Xg",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Wedding soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nn39mVVjwJE8Kxg2LbX2Xg/o.jpg"
      },
      {
        "img_id": "dvHx48bsGbfIbOeIvx-Qbg",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Veal parm and garlic bread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dvHx48bsGbfIbOeIvx-Qbg/o.jpg"
      }
    ],
    "user_id": "m2uTGkOKcXqQJSmvsYvtMg"
  },
  "kuP6YYZJbT32ttaxmgqLHA": {
    "date": "6/7/2011",
    "text": "Two types of pies!  Oh my!  Then I found out about the lunch buffet.  Wow! Lots of varied food and a salad bar.    Also, a great service person who replenished the buffet and also waited on tables when she had time.  The pizza's on the buffet change so if you don't like the toping, just wait 5 or so minutes a new different pizza comes out.  Had two styles of pasta, one was a cream sauce with chicken the other was marinara, both good.  Pizza was good too!  They had a hoagie sandwich on the buffet but was to full to try it. Also, there was a little desert some type of fried cookie.  Yum!  You can't beat this buffet for lunch and the place was hopping!  Place was full of people that worked nearby.",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 15,
      "cool": 12
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "LwDmoHDT0HXULD8U5aRn2Q": {
    "date": "12/26/2015",
    "text": "I stopped by Julianos on the way to the airport.  Only had time for a quick bite since I had to catch a flight.  Food was so great I had to come back when I had more time.  The next week I brought my grandson Batchagalupe and his wife Estella with me.  Estella is from Italy and she is an expert on fine Italian cuisine.  Batcha had the pizza and Estella had chicken parmigiana.   Both were excellent.  Estella is still raving about her pasta. -- she can't wait to go back.  You should not wait either -- great food, great service, reasonable prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IDYLZFb2laBQyCDEO5nxSw"
  },
  "gXle56mAB90p6EynHoZpFw": {
    "date": "5/11/2016",
    "text": "I was thoroughly amazed when I ate here the other night. The place is rather plain on the outside, so I wasn't expecting much. Figured we would have some pizza and be on our way. Boy was I wrong. They served the largest and best red clam linguine that I have ever had. I rarely leave leftovers on my plate, but could only finish half of my meal. Our waitress was very nice and attentive. We weren't the only people in the place, but she treated us like we were. My wife has had the pizza here before (that is why we stopped) and said it is great. Can't wait to go back and find out for myself. It's a little bit of a drive for us, but we will definitely be back. Great food, great service and good prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U8tbqp0XGfsmHw9hdmWayQ"
  },
  "209oDSJFZ16QgyW88a_ebw": {
    "date": "4/16/2013",
    "text": "One of the few good pizza joints in Robinson and one of the only places in the area I've been able to find decent, home-made Italian food. The staff is polite and friendly which is refreshing, given how most independently owned pizza places seem to think the only way to make a name for themselves, or at least to get the customer to remember them, is by being exceedingly rude. A great place to go on a Friday night for beer, pizza and wings, or on a Saturday afternoon for a home-style Italian dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "vuH41CWzOYlwKmMmZnjV7g"
  },
  "gW14inAZuDk7sU6I3mvhMw": {
    "date": "3/16/2016",
    "text": "Stopped in for the lunch buffet the other day on account of the reviews here and their convenient location. Their pizzas weren't bad, but it wasn't good either. First, there wasn't much of a selection. Pepperoni, cheese, and some sort of ham and bacon. Second, the pizzas weren't hot.. just luke warm sitting on the little buffet hutch without a heating lamp. Pasta was lackluster (a light angel hair with chicken+olive oil and a rigatoni/penne-type noodle in marinara)- sitting in a heating tray and noodles seem to have gotten soft over time. They had some hoagie sandwich item which I didn't try as it seemed mostly bread and a tomato brushetta item which was ok- but again, not hot. Salad lettuce was fresh, but julienned carrots were completely dried out. The dessert was a fried dough with some powdered sugar on it or powdered sugar and chocolate syrup... this was pleasant as it just came out. Perhaps ordering off the menu would be better, but I wasn't willing to spend more than $10 on lunch.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SLW4pyYubfr4eKbA-egiMg"
  },
  "aCFkL1HUyELVt71gbFKO4A": {
    "date": "7/29/2015",
    "text": "I was looking for a place near ikea and found Juliana's restaurant on Yelp. I am really happy I stopped by for dinner. I had the Pan pizza with mushrooms and pepperoni. It was delicious. The crust was baked to perfection.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Abj3PfCORGD_PayLM41Tg"
  },
  "jxRdTJhBFHV7UsdxvbKDew": {
    "date": "10/25/2015",
    "text": "Always an awesome dinner! Have eaten there at least a dozen times. Wait staff is friendly. Pasta dishes are giant helpings of incredible food! Wedding soup is phenomenal. Wings and appetizers are just as delicious. Highly recommended for a great meal at a great price!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yTii4xepVgNsl_j07XTwzQ"
  },
  "JySdawPDKpte00ZytX4KFA": {
    "date": "2/1/2016",
    "text": "My husband and I tried Juliano's for the first time tonight, recommended by a friend of a friend, and enjoyed the food, but was very shocked at the waiter we had. He was rather rude, and when he wasn't talking our ears off about useless things he was too busy chatting with another table to take our orders or answer questions. I don't want to dine in again after this awful experience, but maybe I'll consider take out, so long as I don't have to deal with him again!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uayUHLjKjgk7bWDKJ-rayw"
  },
  "7dquualBLE7dcPdm2yGarw": {
    "date": "3/6/2010",
    "text": "Ok, if  my last few pizza experiences were horror films ranging from excellent (Beto's) to schlocky (Vinny's in Brookline), this was a feel-good summertime hit, and it ain't even spring yet!  I'll ignore the bland pre-wrapped salad with the house dressing on the side. Jeez, even a chain Italian eatery like The Olive Garden serves their most excellent unlimited salad bowl already dressed. Unimportant.   Now, Juliano's has a traditional pizza (round and thin), a Sicilian (thick and square), and a Pan Pizza (round and thick).  We went for the Pan Pizza, which to me was a Pizza Hut pizza with an IQ of 200 and the emotional intelligence of Oprah Winfrey.   I mean, I felt LOVE when I merely saw the pizza let alone bit into it, which was brought out by a guy named John who even looked like an up and coming Hollywood actor. I mean this guy came straight out of a commercial or central casting. He'll be on a soap opera someday. Watch.   And speaking of commercials, I thought pizzas like this only existed on TV. It was deep. The crust was thick, crispy, chewy, somewhat light, heaven-sent, more than good enough to eat plain. It came in a cast iron pan. YES! Throw the horns like Ronnie James Dio! The cheese was, get this, and again I have only seen pizzas like this on TV, ATOP the toppings.  Who does that? Pizza Hut doesn't that's fer sure. Damn.  That's the kind of indie eccentricity you don't find in chains. Ever.  Speaking of toppings, we went with onions, green peppers, and yes, meatballs. My date, who recommended the place, got a chuckle out of that. She says I \"order good.\"   This pizza was like cake. CAKE. Mmmm. Not even a grouchy mother-in-law would complain if you served this at a wedding.   You could taste everything, the olive oil, the fresh, it's so fresh, fresh like a summer breeze, stringy, web-like mozzarella, out of which the \"undertoppings\" bulge. We got the \"Chunky Sauce\" (a buck extra, ask for it) which has garlic and all kinds of spices you can see in it.   I mean, this pizza is open. There are no secrets here. It's a pizza that hugs you and tells you its life story, thanking you all the while for eating it. We didn't finish it btw. The remaining two pieces were taken home by me like a pair of lost kittens. So the pizza won. But it was a friendly contest, ending with a handshake, and...  ...Panne Fritte. Fried pizza dough. No we were not at a state fair. I've had similar desserts, but this was stratospheric. They were pillowy, soft, dusted with powdered sugar by a little winged Italian faerie one with imagination would want to think. And if that weren't enough, you get chocolate to dip them in. Oh you get 10 to an order too. Oh yeah. It's the sopapilla married to a fondue, and it's a happy union. Father Guido Sarducci would perform the ceremony and bless everything else on the menu.   The atmosphere was terrific also. Families and cute, loud bambinos and bambinas abounded, jumping up and down in their seats excitedly everytime something was brought out.   If you don't walk out of here happy, you hate food, you hate life.",
    "rating": 5,
    "rated": {
      "funny": 13,
      "useful": 16,
      "cool": 13
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "CSTqzU6kNgFowg8i1VVSUg": {
    "date": "1/7/2013",
    "text": "Loved it here hays the pasta Ala Nico so good! The balsamic salad dressing is great too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vfeFeY4KDsLqElkkrduQSQ"
  },
  "xLLAy4062YMadvtKGmviaw": {
    "date": "12/27/2012",
    "text": "This place has THEE BEST gnocchis ever!!! Homemade, perfect al dente. Sauce is great, a little on the sweet side, which I love. Pizza is great too....love the sicilian.  Waitresses/staff great...just like coming home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NvH2_5vFLpnYGHfAJTGYog"
  },
  "UzAPGOIxZat6uGEtFGzWjQ": {
    "date": "3/24/2015",
    "text": "Rarely do I do a review in anger because after all this is a very subjective endeavor. Opinions and tastes vary. But I have to tell you if this place is touted as having great pizza I am wondering what a bad pizza would be like. I ordered an 8 cut with 2 toppings and the damn thing was almost $16. This pizza was very small and you needed a microscope to find the toppings. Quality wise it wasn't even close to the frozen, rising crust pizzas you can buy for less than half the price! Taste wise it was garbage. Never again. Over priced, poor quality and a real disappointment. Again, This is one man's opinion and the reviews, if they are all legit, go squarely against my view but the fact remains I will never buy anything from this business again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ywsZpo-j2SSNExeM45t2Dw"
  },
  "yZneEYE86P-F4tO5JcGX4w": {
    "date": "3/7/2011",
    "text": "I already can't wait to go back. I got the Pasta Alanico which is similar to a fettucine, but not as heavy of a sauce...incredible. Absolutely amazing. I had to try their pizza obviously as well and was looking forward to having leftovers for later. It was also amazing and this is coming from a True dego. Everything I had was extremely authentic and fresh...my only small complaint is that the pizza was pretty greasy. It is pizza, so I'm not going for health here, but it did seem to be a little too much. Italians make food with love and that usually translates to oil, butter and/or cheese. All fine by me though.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "7D9dPxyBhZ-wOKxRz0eSTg"
  },
  "yTGa3YPkelrzjVLTLgnfww": {
    "date": "10/2/2013",
    "text": "I have eaten their pizza several times and always enjoy it. I opted for an itanian hoagie and regreted it...very very little meat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "X7kr_i1Os7YVuRLiaZ8GNw"
  },
  "7xs1qAcJWSdYjD5QN6GdXw": {
    "date": "4/14/2014",
    "text": "I give 2 stars for my girlfriends gnocchi.  My burger was no where near good at all. The frozen patty, cooked to charcoal was bad. Really bad. Service was good. Owner or manager sitting in dinning room talking very loudly was a distraction. The dirty table was a turn off also",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6GIO0ivoZ2WJuGgLom-NqQ"
  },
  "qTj9gK8OCVCZ2j3ybAtxug": {
    "date": "2/24/2011",
    "text": "One wonderful Saturday afternoon after getting my \"hope\" tattoo up the street from this place my cousin and I decided to stop here for lunch and to our surprise they have really good pizza. The building is older but the service was great and the pizza was good. We haven't tried any of their other food yet but hope to soon. When you walk in, you have the choice of calling ahead and picking up your order or having a seat and enjoying some down time. :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "vzAojVzcALJVBXjHOGgeiA"
  },
  "okHCWR268M9kI5eUXmzPXA": {
    "date": "10/18/2010",
    "text": "The best pizza always comes from little family owned dives like this one.  Housed in what appears to be a former site one wouldn't expect to find an award winning pizza shop that has been around for years.  Had the tradition thin crust pizza, it was really good and I regret filling up on soda first. Loved the sauce, I'd be willing to be it was homemade and not out of a can.  Some places tend to drown the pie in sauce, this had a nice even application, tomatoey, sweet, and tangy.  Our waitress was wonderful, put on a fresh pot of coffee just for my family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "n92P9CuF59GbaxZH_ctPaQ"
  },
  "TJJ92Q1jFZqZFjVv6XBFpg": {
    "date": "11/6/2010",
    "text": "Seriously, best pizza ever. Their garlic bread sticks are awesome, and their Sicilian pizza is so thick and delicious! The people who work there have always been very nice. It's well worth going out to the middle of bfe for. Delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "EOJwlTPy7gy485rOchz5aA"
  },
  "blvKGBVT8jKIzkfYGv0guQ": {
    "date": "12/4/2012",
    "text": "Great food.  Local place and busy, but worth the wait.  Lasagna, riggatoni, and ravioli were all awesome.  Go here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ewF9GdozAPui4fujmAjdqw"
  },
  "dxcJDQDbkYHXrhy4Ob7ahw": {
    "date": "4/25/2014",
    "text": "the best (and only) \"homemade' pizza in Robinson Twp., love the white pizza! the red sauce is excellent also, and delivery is super fast, the people are pleasant. jus a good old local pizza place with good fresh food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-2PpbzMBzwBMppsZd1FQVA"
  },
  "AYyPhi5LgRIIVfG3vJQsIQ": {
    "date": "11/10/2015",
    "text": "Been here twice now. Like the pizza. Sauce is sweet. Cheese makes it work. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ojJblXPup-gvfsc7EiMDuA"
  },
  "7abVcKKIOYJLKUL9DTmBjw": {
    "date": "1/23/2016",
    "text": "Being a bit of a city food snob, I had my doubts about finding good pizza here in the burbs (and away from the coast.) I was pleasantly delighted with the quality of the pie from the crisp cheese along the crust to the rich tomato sauce.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sBy8gr3iX3GtAxv9ubpCDg"
  },
  "FVJhhoTBgSQ3BTHxfYAzEg": {
    "date": "2/26/2016",
    "text": "Yet another Yelp user thrilled by an excellent restaurant. Looked at a long list of restaurants in Robinson and came here after the long list of great reviews. We weren't disappointed. The food was excellent, service was great, atmosphere was awesome. It seems like the owners really care that you have a good experience (they give you a survey card to fill out at the end) which is refreshing. A great restaurant and would steer any reader to give this place a try! (...and do yourself a favor and order the pepperoni roll!!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k1EbL-K8ZiwFpZHMsH0gjg",
        "caption": "Photo of Juliano's Restaurant &amp; Pizzeria - Robinson Twp., PA, United States. Pepperoni roll was awesome!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k1EbL-K8ZiwFpZHMsH0gjg/o.jpg"
      }
    ],
    "user_id": "wfpClv6Ol-UDVLYXzFRfZg"
  },
  "1wRdRUylC0nRpCWyzYL9Yg": {
    "date": "2/20/2013",
    "text": "I can't say I was surprised by my experience at Juliano's, since I think every town has a classic, family-owned restaurant. The reviews were good, but I'm having trouble figuring out why they were this good..  Food: I had the Sicilian pizza, and it was ok, but I didn't enjoy the flavor of the dough. It tasted like it had been frozen or something. My friend ordered the eggplant part, and it was probably 5lbs worth of food. It wasn't awful, but it offered nothing new. It was heavily breaded and soggy and under mounds of pasta. He also mentioned that it appeared the plate had been microwaved.   Atmosphere: traditional family restaurant. Hadn't been updated in years, but it's what you'd expect and is fine.   Overall, I wouldn't choose to go back unless someone else wanted. I wouldn't turn it down, just won't be on my short list.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-2OB54nQ6FsGLUM-R1KXnA"
  },
  "4Xb2g6I5C_G3VuL5q2RT-Q": {
    "date": "9/2/2012",
    "text": "Juliano's is just down the road a little bit from the Twin Hi-Way Drive-In, so if you're heading over there for a movie, it makes a good meet up spot.  Which was precisely what my gilrfriends and I were doing.  They've got a fairly large menu here so if not everyone in your group wants pizza (the horror!) they can order something else.  Ah, but we were here for pizza and we indulged in one of thier specialties--thin crust Pizza Fierenzi with mushrooms, peppers, and green onions.  Okay, meatless but I didn't cast the deciding vote and it was delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "UtkjXTiMfGRz4R1zDF3Kxg"
  },
  "cXoYSkCB27Pikh7XDrNdPg": {
    "date": "2/19/2015",
    "text": "I just  ate there  spaghetti  meatballs. And chicken  soup  was very  good.     With  excellent  service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HvjaLr6OlW10Z-JbDgu_ug"
  },
  "q9qP5WvgTUuY_l9axuVU_g": {
    "date": "1/3/2015",
    "text": "This place is a class act. The food is always good and the service is even better. We have been going here for over 20 years  and he really rewards repeat customers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6_STj29C0Gs2QlJMb3I_jg"
  },
  "2nLk267YAqLBtUIb3PnTPA": {
    "date": "11/20/2014",
    "text": "We live in Monroeville but, when we want quality Italian, we travel to Juliano's. Honestly, best Italian food in Pittsburgh. Pizza to die for!!!! Huge portions, too. Does a wonderful job on catering as well. WARNING: Once you try it, YOU WILL be hooked!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kNr-JQVZoAnfrvXmyZEPXQ"
  },
  "-5ad2Pyhv36eaMCGU1LPng": {
    "date": "10/26/2016",
    "text": "Best Pizza in Robinson. Other food is pretty good too. I like how (when you pick-up/take out) they show you your pizza to make sure you like it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cw14LY2bKptsltz_2b8rdw"
  },
  "ccvh6Xd-EhtL_uCDvM1FMw": {
    "date": "4/20/2015",
    "text": "I'm not from the area, but every time my family and I is in town, we try our best to stop by and eat at Juliano's. We got their kinda late, but it didn't take us long to wait for a table. The waiter was awesome and checked on us at least 5 times. I hope I'll come back again because this Juliano's restaurant is amazing!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zZrEFzLDEUmOknCYbLUL_Q"
  },
  "xDAU29LCAjVk5_qQa1RxaA": {
    "date": "5/14/2014",
    "text": "Passing through to see family in the area and stopped for dinner - Amazing food and amazing service! Linda was great!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "qZwFS2t7p5NXHAjDrSv2aQ"
  },
  "n9rB_-i3QjX59f50eAvI3w": {
    "date": "6/7/2014",
    "text": "Hidden gem in Robinson.  Affordable, good service, all you can ask for.  Excellent pizza!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZNgUoA3dB0bBuzWMWW7Xtg"
  },
  "QgMFwltiS_S2aWqwDAJyag": {
    "date": "6/15/2016",
    "text": "Pizza NOT as good as people are saying! I know pizza and it is okay at best. Had the pan. Was NOT impressed whatsoever. Pizza prices are high and toppings are like $3 or more per topping per pizza. The thin looked the best but I did not try it. Chicken salad was very big, but very basic, low quality. Dressings were very good. Wings are okay. Overall just okay. Pizza is far too expensive. I do not understand why everyone has such great things to say about this place, other than its not a chain and the staff is super nice and helpful.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "iBDFkBX18I2wUzyOWRKSVQ"
  },
  "vLic7b2To71vWbzJkSkhpQ": {
    "date": "2/6/2015",
    "text": "Me and my family have been coming to Juliano's for over 10 years.   We made the trip monthly all the way from Weirton, WV, especially since Monday's was 1/2 price pizza day.....BUT NO MORE.   Last year, they done away with the 1/2 price pizza day and since it is so far for us to travel there is no longer any incentive to travel so far.   There are just too many other options closer to us to pay for nearly full price pizza.  The only way it makes sense to eat there now is if we happen to be around the Robinson area for other reasons.   Thanks for the memories. Goodbye my old friend.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DCj47Eu0IDNowUyWlm3Fog"
  },
  "LMYeg56Ch13Y5-noNLV0XQ": {
    "date": "1/29/2012",
    "text": "I'm sorry, did I make a wrong turn? I was very excited to try Juliano's after seeing all of the positive reviews - even led to believe that this may, in fact, be the best pizza ever. We stopped in for lunch. The atmosphere is a tad bit antiquated, but I can get past that. I figure if the food is good enough - I don't mind what the restaurant looks like. Even still, they could have wiped the mounds of dust off the ceiling fans.   I was very happy with the service. We were greeted and shown to our seat immediately after walking in. The waitress was pleasant and worked very efficiently despite being the only one working the floor. The food, though, was underwhelming. We ordered the Jalapeno poppers and pan pizza - with sausage and mushrooms. The poppers were exactly what I would expect from the freezer section at Giant Eagle, although the marinara sauce they came with was good. The pizza was just ok.  The crust was cooked well - soft on the outside and crisp on the outside, but the overall flavor was bland.   Overall, we weren't overly impressed. Perhaps something was off today, but unfortunately I don't see us going back to find out.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "iqhra1MRbjLWxrTkw4yqkA"
  },
  "q8rTFvCcbLBmGFaUn-5L6g": {
    "date": "5/25/2016",
    "text": "IMO, the best mom & pop pizza in the western suburbs. Have dined there once, ordered delivery many times. The owner-operator is hyper focused on reputation. If you have a legit issue at Juliano's it will be addressed promptly and appropriately.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lx4qae4sfIovjT-MT57Axg"
  },
  "dGYH0ljFmUOUX8k77x9IFw": {
    "date": "1/12/2014",
    "text": "Juliano's was recommended to me by one of my college buddies when I moved to the area about eight years ago and we've made it a staple ever since.  The pizza and wings are always good and consistent.  The service is friendly and you can tell that the management trains everyone well.  The Italian Lunch Buffet also has something for everyone and is very reasonably priced.  If you hate \"chain store pizza\" then this is a place for you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "dT9tIZL037bO4jDEZruX9Q"
  },
  "wlBYYpF0cGjO9jAaSBArcQ": {
    "date": "8/6/2011",
    "text": "Julianos has my heart, i strongly believe that if it was in ANY other city it would be far and beyond the BEST italian place there and most likely cause all other resturants to go out of business, but since its in pittsburgh, it has a fight with betos, mineos, campitis, angelias, garden of eating etc. (all the good little local pizza places)  Anyways, what sets julianos apart from other places is that it serves a full menu (kinda like olive garden)   It has a different special everynight of the week (mondays is half price pizza OR wings ;) )  I have yet to have a pizza from here that i havent liked, pepperoni, pepperoni and chicken, just everything is absolutely amazing, and for half price on monday? its hard to beat  Now this place also kinda seems like its a hidden jewl for the wings :) I LOVE their buffalo wings with ranch dressing, it is so sweet and tasty, they make me incredibly happy every time i eat them.  All their dressings are homeade and you can certainly tell by the taste of them  The wedding soup there is really really good also. and so is ther pepperoni roll which they dont have on the menu anymore but if you ask theyll make it :)  but if you go for pizza or wings on any other day than monday it gets a little pricey :/",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "SfkCNaq_JLYkutheYo_sIg"
  },
  "aurddnqas5bP52ddgjQmlA": {
    "date": "10/31/2011",
    "text": "Robinson area is blessed with several excellent choices for Pizza and other Italian-American fare.  Juliano's certainly never disappoints with a wide offering and decent prizes, they even do discounts for local business that order en-mass.  Pizza & bread-sticks are my default choice, although I  have also had their hoagies which are quite good.  Mostly recently I tried their Cheese-steak and it was delightful.  Even after the delivery time the hoagie came hot and not soggy which was my fear since I knew they said delivery would take 30 minutes.  Pizza is always tasty (I've had better) and it always hits the expectations.  My favorite part is their marinara for the dipping sauce when you order bread-sticks...I could put that marinara on  EVERYTHING.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "B-60XQ_fR72PevFzHM-ieQ"
  },
  "_eD0ocQJpZuBzAQaU0lB2g": {
    "date": "2/10/2012",
    "text": "I can't honestly say anything about the pizza... I am visiting from the Midwest, staying in a local hotel. I called to place an order at 9:30, and they said they closed due to the weather. They list 11pm as their close time for today. I understand closing for weather (I delivered pizza for 5 years) but there is barely an inch of snow on the ground. Then again, with the way people drive around here (no blinkers, slow, clueless) I shouldn't be surprised. But still, an hour and a half early? Too bad.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "0d9LIWcxvC5DOjcHLUxN7w"
  }
}