{
  "tUCUYfeJ5w2cZ_EFA5V5ig": {
    "date": "5/9/2014",
    "text": "Alone in my dark apartment, having worn my 3 Wolf Moon T-Shirt as well for countless weeks, found this restaurant to be my heaven. I entered the restaurant, looking at the menu of this restaurant, deciding what would satisfy my hunger. Always pilling up the pizza boxes, leaving some greasy Chinese food in the kitchen, I was beginning to get tired of the food. I recently lost my job as a Custodial Consultant for sniffing the amonia in the utility closet. My funding for my gourmet meals from such world reknown chefs as Boyardi and Uncle Ben had begun running low. Stumbling in a drunken daze through the local building, my legs carelessly walked inside of the restaurant. As I looked closely, I saw the name of the restaurant, \"Sushi & Rolls.\"   Curiously, I glanced at the menu and decided to grab a food. As I began glancing at the menu, the cashier (very pretty and nice but seems tough) named some popular meals. Naming the popular meals including sushi and Korean food, I began to realize that this was no ordinary restaurant. No my friends, this was a restaurants passed down from the Gods themselves, displaying the infinite beauty of their messenger cashier and Korean beautiful and loving couple in the restaurant. Not just displaying the beauty, but also giving the full taste of the food. I ordered Teriyaki Chicken along with Korean Spicy Pork. I knew at that moment, that these meals would change my life. I put a big spoonful of food in my mouth. What is my review of the food? Because of this restaurant, I now feel like living. I finally realize the world is beautiful and it is covered with beauty and taste. Tonkatsu? California Roll? Korean food? Its all in here. Not only do you never need to go to another restaurant, there will never be a restaurant so deliciously cooked ever again. From that point, I have divided my life into two different categories, life before Sushi & Rolls and life after, much like the Old and New Testament.   From this restaurant I have made more friends than I can count, gained 30 pounds of rock hard muscle, and have a new job as VP of a major financial holdings company. This restaurant worked for me, and I am sure it will work for you.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yeMRmlLZC-AIrP85TSRibg"
  },
  "l8mCcN2oq9E7WFLQY-O2_g": {
    "date": "12/20/2012",
    "text": "This will be short as I'm typing this from my phone (there may be typos, just a warning).  Best tasting sushi I've had in years! I couldn't believe that the 3 reviewed have this place 5 stars...until I tasted my order. I got the bento #2 box. 2 rolls, 2 dumplings for $7.99. It's made fresh right in front of you. No more than 5 minutes wait time. The menu isn't as extensive as most restaurants and it does have a mall, food court kinda look to it. There's nothing and I mean nothing fancy about the dining area. All aesthetics aside, the food is simply wonderful. I haven't tried Nakama or any of the other overpriced sushi places in the 'Burgh yet but so far, this food court looking place located in Oxford Center is my choice for best tasting sushi in Pittsburgh. Feel free to give me suggestions but its going to be hard to top this place. Minus one star for the lack of 'ambiance' and the fact that its CASH ONLY! But seriously, do your taste buds a favor and try this place, especially if you work downtown and want a quick, delicious sushi lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pq6SX85MwHW7dMRo_RhDHQ"
  },
  "JoN-0Mn5NkyfHskpSpItBA": {
    "date": "10/29/2011",
    "text": "I had the gyoza and the volcano sushi from Sush & Rolls. The gyoza was real tasty, but the serving size was small. It was only 2 dumplings for $1, so I recommend getting 2 orders. The volcano roll ($7) was quite filling (8 pieces) and whatever topping came on it rocked. It all seemed really fresh and the rice was sticky enough to hold together. The staff is quite friendly and the service was speedy. Thumbs up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "46EeWt_sbXkHCl3pyLC5aA"
  },
  "e7BAXcFboulpWrMfHqIMMg": {
    "date": "4/16/2014",
    "text": "Good prices for dowtown sushi.   Quality was decent and service was quick and friendly.  I got the Bento #1 meal for $8.50 (if my memory serves my correctly).  Very tasty but not particularly filling.  Only held my hunger off for only a couple hours.  To be fair though, I would have to eat a ridiculous amount of sushi to feel full from it.  I will likely come back the next time I have a sushi craving at work.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hC2CJVlsR6A7SupOLS_4WA",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States. The Bento #1 meal (half eaten of course)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hC2CJVlsR6A7SupOLS_4WA/o.jpg"
      }
    ],
    "user_id": "gKP6BLutYN8FXRqd-8t-AA"
  },
  "exUvZd1SNcdfAMUE1lYVVg": {
    "date": "6/22/2017",
    "text": "This is a great little place. I was able to stop in and pick up some lunch with no problems; even with several customers ordering close together, they were quick and friendly. The sushi was tasty, and very reasonably priced. The seaweed salad had a bit too much dressing, which made it sloppier than I prefer, but overall it was a good experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IN4o74WM2RPJ1PtvA3KuAw"
  },
  "0BQbTXe_KqErRJ7yPzaedw": {
    "date": "4/21/2017",
    "text": "Excellent sushi! The dishes from the kitchen are also tasty. This is a hidden gem - much better than other sushi and Korean places in Pittsburgh. The owner and workers are so kind. Miso soup was surprisingly good. Come here for fresh sushi and a simple, clean, no-frills experience. Will definitely be back again soon. Too bad they don't open for dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iOp6tRt46_uJbLW3ZLcB2Q"
  },
  "LinSZ7UbfEdEvVTS9naqXA": {
    "date": "10/26/2016",
    "text": "Cheap well made sushi here. Nice location in the oxford building across from the au bau pain. Bento boxes are really convenient and tasty. Try the spicy California roll.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDjlNGzLWLKik4pnpwZAwQ"
  },
  "OsZEN9FPvIcDscvOyFt-MA": {
    "date": "1/26/2012",
    "text": "I love this place.  The owner is so sweet and always greets everyone with a smile.   He seems to really love what he's doing because he always ask how the sushi was.   It's comfortable like a mom and pop sushi place lol   He even makes sushi on the line.  Sushi can be hard to come by downtown, so any one passing through, hanging out , or working downtown please go into oxford center and try sushi and rolls. Take the escalator down to the food court.    This is a favorite lunch date spot for myself and my boyfriend.  He actually encouraged me to write this review.  I normally stick to one of the bento dishes The Bento I get  it's normally 8 pieces of sushi spicey tuna, or california roll, gyoza dumpling and chicken terriyaki. I have also had the nigiri shushi so yummy.  Sushi and Rolls Edo sushi is worth trying to.  The flavor of the edo terikaya  sauce is heavenly and sweet. I can tell in the flavor that who ever has made the sushi rolls has had a lot of practice.  Cast away any prejudice you may have about food court sushi.  There are premade benton boxes that you can choose from, but the owner has no issue making your order fresh.  Sushi and rolls is always fresh and fast they make the sushi while you wait,  if  what you want isn't already on display.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "V7uS5US4oTf-S9u36HJQCQ"
  },
  "VrnreLs6V1q8M_CCdkyktw": {
    "date": "2/18/2014",
    "text": "This place is an absolute Savior to a Downtown employee who needs a lunch-time pick me up. Sushi and Rolls is located in the heart of Corporate Pittsburgh, and it brings in a large crowed of suits and ties, daily.  They offer every kind of sushi and maki, all of which is prepared in front of you.  The food is always extremely fresh and tasty. I swear, their Miso Soup is leagues better than any other.  Their prices are fair, but it is CASH ONLY, so prepare for that.  I'm looking forward to 2:00pm so I can make my way down there today!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gXfo71N-a3Vv-OVhlFXPYA"
  },
  "R_2tnl8oauqtNw-0gcT19Q": {
    "date": "4/13/2016",
    "text": "The Tofu don was very delicious.  I asked that it be spicier and they obliged.  Prices are very reasonable.  Although the restaurant is in a food court the food quality is very high.  Family run restaurant with really great home cooked taste.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WzHJSDk9K7osuF_7V2NnZA"
  },
  "EU3W6M1lkx4N_QdtBNmMUw": {
    "date": "4/28/2016",
    "text": "First time to this place. Pretty good.  Actually quite tasty and nice portion for the price. I had the Chicken Karayiako.  Next time I'll trying the Chicken Teriyaki.  Fast friendly service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BFhzxeGeiDelh7Wsf90dIw"
  },
  "D5SIb_bS7hjE5Tn881JTRw": {
    "date": "5/28/2015",
    "text": "Don't let the food court vibe fool you.  This little place is great. The staff is friendly and the girl at the register was extremely helpful and polite. They have a variety pre-made bent boxes that all looked fresh.   I picked a box with some sort of monstrous roll and 3 pieces of sashimi for about $10. The roll was delicious and the sashimi practically melted in my mouth.  I thought it would have been too much food for me to eat by myself but it was so delicious that I ate it all.  As others have said,  they are cash only but there is an ATM right outside their front. I think it was a First National and had a $3.50 service fee so come prepared!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DXcIZRU8Et8hoYgyX1r5pA"
  },
  "uV2gI9OUnHeKZNT1IMEuVw": {
    "date": "6/21/2015",
    "text": "I am glad that this place has gotten more reviews. This was my favorite place for lunch when I was working in Pittsburgh downtown. I took all of my coworkers there and my coworker took our boss who works in NYC. They all love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-VVSLzMsaVsLOeSce8fVA"
  },
  "NaifNDiKzZLM6zv5pz_oHQ": {
    "date": "7/21/2015",
    "text": "Sushi has an odd taste to it.  Some people apparently like it, but I don't.  I've given them several chances.  Not going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OcIFpzBcRMMFa2d-bVFAxw"
  },
  "tNvkdoeQaS--kThqFXKSpw": {
    "date": "10/15/2015",
    "text": "Wonderful place for a donburi fix! I am so happy to have found this place. I grew up on Asian food and miss it so much since moving to Pittsburgh. I have not tried their sushi, but their katsudon and curry are delicious! Just expect a bit of a wait (15 - 20 minutes) if you go during weekday lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1kq6aPoohpRGIoB1jUH10A"
  },
  "ZgCe-HQEM4tyC0GbbxLqZA": {
    "date": "8/4/2016",
    "text": "This place enables my sushi addiction. I also enjoy the friendly people who work there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lho6tvw0Ke8eBiTxznu1sg"
  },
  "gY7F8i6RUEx_tYSW-4jfFg": {
    "date": "6/21/2015",
    "text": "The food from Sushi & Rolls is delicious. I've tried the bento box #1, a handful of the individual sushi rolls, salad, and miso soup. Every time, I have been very satisfied and full. They make the less-popular rolls when your order them, but even the rolls and other food in the deli case is fresh because of the high volume of orders. As others have said, it looks like a cafeteria and is a cash-only establishment, but the food is great, and I will gladly stop at the ATM over lunch or on my way home from work because it's worth it. Sometimes I even skip lunch and leave work early to pick up rolls for dinner before they close at 5. It's by far my favorite sushi downtown.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_mP7IbSbZne8JI955oiNEA"
  },
  "k9cTqHzh_eFQ5fSyJBwOZA": {
    "date": "1/6/2014",
    "text": "I haven't had many different meals because I am in love with the spicy kimchee pork. It's amazing. Yes, the atmosphere is food courtish, but it is a food court, after all. CASH ONLY. Did I mention the spicy kimchee pork is to die for?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DWhu81_FD29XrmRXP1-HCA"
  },
  "R5fkXoh_Um-Z6mVUJF81DA": {
    "date": "9/12/2013",
    "text": "I am a regular at sushi and roll and always get the salmon combo. The sushi is always extremely fresh and the prices are great!  The staff is extremely friendly and kind and have even come to remember what I order which really makes you feel like you are paying for great food and service.  They have some of the best ginger dressing around. The only bummer is that they are cash only, however there is an ATM within 10 feet of the place so it's not a big deal. Added bonus is that there is a lot of seating inside and outside the restaurant.  I would recommend this place to anyone looking for a great lunch downtown!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FrCFfkO3gif7RkFy67aeYw"
  },
  "66OwLaXNm4ZorQ1Ph_LqbA": {
    "date": "10/27/2015",
    "text": "The owner is a very sweet man who takes pride in his food and always ask how it was. The sushi is amazing, I always get a Bento 3 lunch special and it never fails me. Always yummy and filling. No ATM so come prepared. But its def a place worth trying out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4-AS3TFGFveB9yAGcxqM4Q"
  },
  "R9V53EeuZhldzmp3si5jFQ": {
    "date": "5/10/2012",
    "text": "This place is, by far, my favorite sushi joint in Pittsburgh. I stop in at least once or twice a week for lunch and always walk away happy.  They sell prepared bento boxes (made fresh each day), as well as a handful of hot Japanese entrees (chicken teriyaki, udong). I've never had anything here I didn't love, but I'm personally partial to the rainbow roll, Oxford roll, and inari (stuffed fried tofu). If you're not very hungry, the salmon or cucumber maki are light and tasty.  The family that runs the place and their employees are some of the friendliest people, and always stop to ask how you're doing and how your meal was.  In terms of ambience, well, it's a food court, but the restaurant itself is fairly isolated. I've had a few lunch meetings here and haven't had a problem with it being too loud, even when it's busy.  Prices are decent - I usually wind up paying around $15 for a roll and a drink. The only downside is that they don't take credit cards, so bring cash.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "GzjgiuNKrdr3BPw-eVUQAw"
  },
  "JvEX2gEZMkdACdlSUljZxQ": {
    "date": "7/22/2013",
    "text": "Great lunch place. Fresh, well seasoned food. Has more than sushi.  Kimichi pork was tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uO0TTOWFXc_H0xC4QTkQnw"
  },
  "EnasXqFqjnLREXUvwo5sEA": {
    "date": "5/23/2012",
    "text": "I used to go to this place all the time when I lived in Pittsburgh.  I really miss it!  I'm no sushi expert by any means, but I found their sushi and rolls to be wonderful.  They also have other dishes beside sushi.  Don't be put off by the food court - this is not fast food quality.  The owners are super nice and, as stated in another review, they always make sure to ask how you've been and how you liked your meal.  You can buy the pre-made, chilled bentos or they will make your sushi fresh if you ask.  If you are in downtown Pittsburgh and you love sushi, give it a try.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Nh9XPvC0zXjd-VfPC90F8g"
  },
  "dPzWX-WSsaouS1Cz9vOjgQ": {
    "date": "6/26/2019",
    "text": "This place is an absolute hands down favorite place to go get sushi. I work upstairs so it is very convenient plus the quality and the price is outstanding. The Philly roll is one of the best. Plus if you love spicy tuna, theirs is actually spicy which is surprising. Get the Ruby Roll too, its spicy tuna with extra spice and seaweed salad on top. I have never been disappointed here. The only downside its cash only. But luckily there is an ATM in the building.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IdbaRCFtRUzmu3AZjNc_rg"
  },
  "3uocmdXITUt5hP44w3fsgQ": {
    "date": "5/27/2019",
    "text": "Really good sushi at a reasonable price for downtown.  I went with the Bento combination number 2, which was a combination of California, spicy tuna, salmon, cucumber, and gyoza rolls.  The spicy tuna was one of the best I have ever had.  It had a great amount of flavor and heat to it.  The others were pretty good as well, but the spicy tuna definitely stood out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZXojQqyi5SKfiUrU6vdXEw",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZXojQqyi5SKfiUrU6vdXEw/o.jpg"
      },
      {
        "img_id": "4ZVqdDAA8RSjIiB1RW-UUA",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4ZVqdDAA8RSjIiB1RW-UUA/o.jpg"
      },
      {
        "img_id": "IDKSeEP0zbJfGR8OnW7Oaw",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States. Bento 2",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IDKSeEP0zbJfGR8OnW7Oaw/o.jpg"
      }
    ],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "qMMx34uZ2FDl-LmNzGpZ8g": {
    "date": "6/6/2018",
    "text": "Downtown for jury duty and haven't been in town in a while. Looked at the reviews for this place and they are dead on!!! It's awesome.  I got the Bento 2 Box.  Very good.  Tuna was nice and spicy!!! Only wish they had brown rice.  If I have to come back down (which I'm hoping I don't) I will come here again.  Great price, delish food!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EbMTC_4hHFX59ssOFmn9Xw",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States. Bento #2",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EbMTC_4hHFX59ssOFmn9Xw/o.jpg"
      }
    ],
    "user_id": "VblVPsnCGff5a9MF6HGouQ"
  },
  "BWC-NVYdm9dbbP71YC6QFQ": {
    "date": "8/8/2019",
    "text": "Favorite lunch spot downtown for good sushi at a good price. Their spicy tuna roll is actually spicy and never disappoints. Super fast service and make it for you after you order, even the preset Bento boxes are fresh. I've never waited longer than 5 minutes during a lunch rush. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dSzs3MzGMI0nA0nAPXMHIg"
  },
  "7DmWkCGjhT1QsVQe6deg7w": {
    "date": "4/27/2018",
    "text": "Great lunch spot! Although the name is call sushi and rolls, but they have awesome Korean dishes. The stuff speaks Korean that makes me think it is pretty authentic. I had the kimchi spicy pork. It was delicious! Unlike a lot of other Asian stores the meal usually comes with a side of salad, it is extra here. It was quite spicy and the portion was huge, I was not able to finish. I can see myself be a regular there! One thing I would like them to change is to start taking cards. But I think there is an ATM in the dining area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TbEiGJNXzas4OQucrp6mLg",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States. Spicy kimchi pork",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TbEiGJNXzas4OQucrp6mLg/o.jpg"
      }
    ],
    "user_id": "pW_XkS9BfbnAQ_JMxNA-8w"
  },
  "iqxmGWxSzZbRMVXlCQIlyg": {
    "date": "6/11/2018",
    "text": "CASH ONLY !!!!  First this place is legit.  Looks like a cozy mall restaurant in the Oxford Center Floor 'P'. First time I've ever had a spicy tuna roll that was actually spicy !  They have Bento boxes ready to go right in front and they have sushi that they make fresh as well. Great sushi & rolls at a decent price.  A must try ;-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "raIaQTOK9tR9KbH3oY9nKA",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/raIaQTOK9tR9KbH3oY9nKA/o.jpg"
      },
      {
        "img_id": "fV0aG-MdTabR8ov5NcEuig",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fV0aG-MdTabR8ov5NcEuig/o.jpg"
      },
      {
        "img_id": "vh5rlhhovSCu-MbY2SiFUw",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vh5rlhhovSCu-MbY2SiFUw/o.jpg"
      }
    ],
    "user_id": "iJSvri1sARt4dttrcnAibw"
  },
  "PydrxJPnKYmzTPKc2X6E0Q": {
    "date": "2/8/2019",
    "text": "Sushi at a great price and they do not skimp on the quality or ingredients. Been here a few times and every roll I've had is great. The tuna tempura roll is incredible (they actually fry the ENTIRE ROLL) and their Crunchy roll is delicious. They don't skimp on the sauce or toppings. It may be cash only but it's well worth it. Sometimes you actually get more than you ask for, the crunchy roll says it's a 9pc but they always give me 12! Definitely my new go-to sushi place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4RgYuLb5h26vSDeHqPf9Rw"
  },
  "WkGTZuNUspZ8wQfRQBTFJQ": {
    "date": "3/19/2018",
    "text": "This place is yummy! I come here at least once a week for the Sushi. The place is super clean and the service is good. Super quick! Sushi is always super fresh, salads are too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ixhrZfX5qu7SEp3HLG6TWg",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ixhrZfX5qu7SEp3HLG6TWg/o.jpg"
      }
    ],
    "user_id": "zSa7JJgMsnIALQcvqIzeXA"
  },
  "huCUKF-LsbtuwrV4Y3iULQ": {
    "date": "2/8/2018",
    "text": "Tried this place for the first time this week. Like most people I am skeptical of where I order sushi from. A colleague said I should check them out so I did.  They offer I believe 4-5 different bento box options that range from sushi, sashimi, and teriyaki chicken. Their options of sushi rolls is very extensive and they have a nice selection.  I ordered the dragon roll, which is California roll topped with eel and avocado. The roll was delicious and fresh. And the service was nice",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3gwqM0K5iPDugcy75Qal5A"
  },
  "VmkRnpP7TwgKYnqTivMFtA": {
    "date": "8/15/2018",
    "text": "Never had a bad meal and the service is always good. I've had several different items on the menu and, although I couldn't tell you the names, I will say that each one was delicious. Also, whenever I let the owner/manager know that I enjoyed my meal, the next time in he suggests something else on the menu that he thinks I might like also. I highly recommend this place for a filling, delicious and inexpensive lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BPPOfVhrLHPNPUxHfS94gw"
  },
  "MI8iLjdlGAbpVm1OtwDmMA": {
    "date": "7/11/2016",
    "text": "I'll be honest: I don't usually buy sushi from hole-in-the-wall establishments. And that's literally what this place is, as it has its own little dining room built into the walls of One Oxford Place, hidden behind the escalators. But, now that my office has been working downtown for six months, I can safely say that the food here is legit. Myself and my coworker's eat here on a fairly regular basis. I won't pretend that this is the greatest sushi EVAR - however, it's fairly fresh sushi, and that's all I ask for with my fish.   In addition to offering a surprisingly lengthy menu of sushi rolls for such a small place, Sushi & Rolls also offers soups, standard Japanese eatery salads with ginger dressing, gyoza (which unfortunately has a tendency to be overlooked), and teriyaki and noodle based dishes. Diners who stop in have the option of ordering sushi, ordering a normal entree, or even picking up a sushi bento box that comes with a mix of what this place has to offer. I admittedly avoid the bento boxes because they tend to come with spicier sushi rolls that I don't like. But the rainbow roll and California rolls never disappoint.  No matter what you order, it's typically prepared quickly, meaning Sushi & Rolls is a healthier fast lunch option in the area. As long as you remember to bring cash, you'll be set to enjoy a fresh, tasty, and affordable lunch downtown!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "K3DG4uAFnux0wa5WpUldSQ": {
    "date": "6/2/2017",
    "text": "I LOVE SUSHI ! Sushi & Rolls have Excellent sushi! I love watching them make the sushi for me. The Chicken Teriyaki from the kitchen is to die for. The very best Teriyaki I have ever tasted. Sweet and rich taste. This hidden little gem is located in the Oxford Building, Downtown in the food court, behind the escalators. It is so worth the trip or a stop on a day in town. Downtown workers don't miss this inexpensive, excellent lunch.  The owners are so friendly and a pleasure to talk with. Here at Sushi & Roll you will find fresh sushi, a clean and inviting eat in or take out dining experience. Highly recommend and support regularly when possible.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "3egcdazws_x1wW35jgXfNw"
  },
  "j1Z3AiI-DGI7z7v92l_rnw": {
    "date": "8/28/2016",
    "text": "For someone who doesn't eat in downtown very much (especially so during weekday lunches), this was like a hidden gem. It's one of the few places nearby where you can get casual Japanese food, both sushi and not (especially the non-sushi!), at reasonable prices. For less than $10 I was able to get a large bowl of katsu curry rice. The curry was very tasty, and there were vegetable and potato pieces all over, plus tender pork katsu chopped up. I would get this again.   We also ordered a beef bowl (kyudon or gyudon), which also had a lot of tasty and juicy meat, although that was a bit too watery with a lot of sauce at the bottom.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EyUWI22h6trWpFGHFYnJXQ",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States. Katsu curry rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EyUWI22h6trWpFGHFYnJXQ/o.jpg"
      }
    ],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "xSsrWOmY6TEC9OWU32S9Zw": {
    "date": "8/1/2014",
    "text": "I've ventured here before for the teriyaki chicken as well as the pork dumplings.   Yesterday, I couldnt decide if I wanted to hit my usual Chinese spot for general tsos or head somewhere new for sushi. My friend at work brought up the bento box here at Sushi & Rolls & I decided to try it.   You choose your box of sushi and then they make whatever comes with that certain box. I ordered the bento box #1 which came with teriyaki chicken, white rice & 2 dumplings (& the sushi of course) The sushi quality was good and everyone working was extremely friendly. I'll head back soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XnE-Q8Q-90BNDYGwjQ3NOQ",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States. Bento box #1. Sushi, teriaki chicken &amp;amp; 2 dumplings.. about $9 after tax",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XnE-Q8Q-90BNDYGwjQ3NOQ/o.jpg"
      }
    ],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "a18flBmEgzhIkNikWsec8w": {
    "date": "1/13/2018",
    "text": "Great for a quick, decent price lunch downtown! They're downstairs at the Oxford building. They are cash only; but there's an ATM in the same area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wTeDYZHO__r4MXSKF3gXKQ"
  },
  "XoEJK-Ur7aD9jcFYjOSb3A": {
    "date": "2/14/2018",
    "text": "For the 5 years I worked downtown, this was my favorite lunch spot. Probably went once a week. The sushi is always fresh and consistently delicious. Never had a bad meal here. I typically always got the same thing, but would go with coworkers and friends who would get a variety and they were always happy with their sushi or hot food. Everyone running the place and working there are the best. Very friendly, fast service. In fact, I went so much that they had my order memorized. As soon as I got in line, I'd get the nod and they'd just start making it! It's the only thing I miss about working in the city.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5tbG8idAJCXueVvGbwLVtw"
  },
  "tjNmV3qqKhVgOdrmXIwl6A": {
    "date": "4/2/2015",
    "text": "I don't profess to know a lot about sushi. I've only just recently gotten the nerve to try it and, to my surprise, I discovered that I really like it. I now see what all the fuss about raw fish, seaweed and rice is all about. Secretly I think it's that green horseradish stuff that you carefully dip your chopsticks into to give it that kick that I really like. I think that stuff would make even mushy boiled brussels sprouts taste good. But I digress...  I tried Sushi Rolls in the lower level of the Oxford Center today. I think they've got a good thing going on down there. The sushi was relatively inexpensive, the location is great, and if you don't feel like eating in the restaurant itself there's plenty of seating in the courtyard right outside the place. The cardboard plates that the sushi is served on are sturdy and they look rather impressive with an elegant Japanese style design to them... economical and keeping the price down but an attention to detail that doesn't make them \"look cheap\".   I had the spicy tuna roll today. I normally don't go for tuna but I liked the look of it. The gentleman behind the counter told me that it had Sriracha Sauce in it. Sriracha and that green horseradish stuff... for $7.99 how could I go wrong.  It was delicious!   I'm not sure how long my self-education with sushi will last but if I'm in the area again, I'd consider getting another roll from Sushi Rolls.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "BZMP4S_hqj_na3_ULhP8Zw",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States. Spicy Tuna Roll Upclose",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BZMP4S_hqj_na3_ULhP8Zw/o.jpg"
      },
      {
        "img_id": "g61G_m6S1rt7idbV8jKUmA",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States. In the Oxford Center",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/g61G_m6S1rt7idbV8jKUmA/o.jpg"
      },
      {
        "img_id": "JkrfWa07ELWhGn-zwOPmqw",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States. Spicy tuna roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JkrfWa07ELWhGn-zwOPmqw/o.jpg"
      }
    ],
    "user_id": "cUqU7UfSaamDg0L5TIJPRg"
  },
  "JaS-xmkwYuR4ewi8YlgBIw": {
    "date": "10/13/2017",
    "text": "Fast service and great bento boxes. I got bento #1 and the sushi rolls were great and fresh. The teriyaki chicken and rice was also a nice addition. The chicken wasn't fried which was a nice surprise. Good price too. Don't be turned off by the food court style layout of this restaurant. It is great food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pI_JD192pI7LqCraLhHBBA"
  },
  "IqozFnxreAkR5pEEmdu7OQ": {
    "date": "4/29/2017",
    "text": "Small restaurant, good food. it is in the basement of a big building in Pittsburg's downtown. Cheap and fast service.The only thing it disturbed me, I parked across the street in a private lot. The hour of parking was 10 dols, almost the price of two sushi rolls.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "tUXYc2jYf1Kjaih6KXmfzA"
  },
  "I0SHbwQHHQkmakVD-UvVRQ": {
    "date": "8/11/2016",
    "text": "I work downtown so for lunch I often want some quick sushi. Sushi & Rolls has boxes of sushi lined up and ready to go for the lunch crowd. They are cash only so make sure you've got some mulaa. The staff there always answers my questions and are super helpful. They also have black rice, a healthier alternative to white rice. Their rolls are always fresh and delicious. I wish they'd label the boxes with what the contents are, but eh it's okay-- like I said they have great customer service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3LI-b_WLo5C_HHVc82IAXA",
        "caption": "Photo of Sushi &amp; Rolls - Pittsburgh, PA, United States. California roll with crab and black rice. Delicious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3LI-b_WLo5C_HHVc82IAXA/o.jpg"
      }
    ],
    "user_id": "iq1S2vEO14_TLEBW1I10XQ"
  }
}