{
  "TSNit4ApR46pFw0JU8AvQw": {
    "date": "7/10/2015",
    "text": "I will say-- not the BEST Thai food I've had but the portions are good for the price and the service was really friendly! I didn't like the brown rice (it's a mixed grain blend vs. plain brown rice). I liked the green curry though! Eggplant was also delicious!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JUni5GRnJ0BVFcoEn1KsiA"
  },
  "PuOnAFpXU42EMzvTkE4L4A": {
    "date": "8/29/2015",
    "text": "We ventured out of the Northside last night in search of something new and chose Squirrel Hill. There were so many interesting choices and we decided on Curry on Murray since we didn't have Thai in a while.  The evening started off so lovely: the windows to the street were wide open, the place was pleasantly crowded, and we got seated at a 4top and sat next to each other on the cushioned bench (one of our favorite ways to dine!).  I ordered the lemongrass soup which was decent.  Ever since visiting Thailand I've been searching for the perfect version in America. This wasn't close but it still was tasty. I also ordered the Panang Curry with vegetables and that too was acceptable. My boyfriend ordered the duck noodle soup. He is a soup aficionado and will eat it even when it's 90 degrees outside! He was enjoying it very much until he neared the bottom and came across a plastic lid from a take out container! Very concerning! We immediately notified our server who brought the manager. He was extremely apologetic and comped our meal.  Even though everything seemed okay on the surface we were left unsure of the kitchen conditions and food preparation techniques. Probably won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "evjYObW_ZdOBLqeWu9rq2Q",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Plastic lid found in duck noodle soup.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/evjYObW_ZdOBLqeWu9rq2Q/o.jpg"
      }
    ],
    "user_id": "6zHOrbA5a3hRykoCBxY9VQ"
  },
  "wnnttDFS_UkqVwf3LA_lfg": {
    "date": "10/6/2014",
    "text": "The food was good. I ordered a pumpkin curry, a decision that was influenced by the other reviews on Yelp. The chicken was good, but it tasted/looked very similar to that typical taste/texture found in fast Chinese food. It wasn't bad, but I had a feeling it was frozen and not fresh. I'm used to my mom's curry in which she uses freshly torn/shredded/pulled chicken.   The wait is what brought down the star rating. I'll admit what might have caused the extreme wait was that I did go with a party of 9. However, when you see two other tables who arrived after you, not only get served, but also leave before your own food comes out, it's disappointing and slightly aggravating.   I'll return with only one or two friends and update my review another time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PlGOItOtSgiiHvwpIM__Sg"
  },
  "voeFWFwwZs1D5Fg8P2o9PA": {
    "date": "8/4/2014",
    "text": "When I lived in Pittsburgh, I was lucky enough to live up the road from this place. I was so addicted to the Pineapple curry with Duck that I had to have it every other week. Their Thai Iced Tea is also so delicious and very complimentary to any spicy dish. I really miss this place. I will always make sure to return to this restaurant when I go back to visit Pittsburgh. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yhk-6HU4bezgOTYv8jJmEg"
  },
  "4Q8v7vh7SfI0xF62FZb1Vg": {
    "date": "1/2/2013",
    "text": "Ok food, pretty average so far as Thai food goes--I'd rate Bangkok Balcony a bit better, and the food trucks at CMU are the best bargain. The service is pretty good here, and the prices are reasonable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YE54kKTuqJJPNYWIKIpOEQ"
  },
  "yHsH31pGh3JeQlID6pRyWQ": {
    "date": "9/26/2012",
    "text": "We went days after they opened, so I'm going to chalk the flustered service/miscommunications to that, because she was very nice and attentive but she just kept getting everything wrong.    Moving along, their summer rolls were standard and delicious, maybe priced slightly higher than their multitude of Thai neighbors, and the same boded for their curries.  I got the duck yellow curry and my dad got the the pineapple red curry with chicken: both completely unoffensive, tasty but standard and a bit more expensive than maybe down the street.  It was nice that it was BYOB, I can't remember the corking fee exactly, but it felt fair.    The main perks were that there was no wait and the service was friendlier than average.  To me, as a retired server, service is really important.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lnJrAr7VQqwp5TqIqqqjmA"
  },
  "p1wXGqgMDSHZFuT-0pd-tw": {
    "date": "9/27/2015",
    "text": "The service is always friendly and attentive. The food is awesome, hands down one if the best Thai restaurants in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_i-C6WrpZKCIGGeye6AANQ"
  },
  "DjbTf34rmAnC30j1WRFTOw": {
    "date": "6/30/2014",
    "text": "Absolutely delicious  pineapple curry.  Pad Thai is also solid.  Sit by the big garage window during the summer and people-watch the Mineos crowd if at all possible.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GnIF_y3gD6Ytq0CGnlUr8g"
  },
  "EEZkVqM7gUHaqbqKo946gQ": {
    "date": "7/24/2012",
    "text": "Full disclosure: We ordered take out, so I can't evaluate the eat in dining experience.  Hearing all the fantastic things about this place, we had to try it since we live nearby. Sadly, the food here was passable, but only just. We sampled a selection of appetizers and one of their entrees for lunch.  The \"Fresh Roll\", was had a nice refreshing feel to it, but sorely lacked in flavor. It was very bland, something I would have expected the accompanying peanut dipping sauce to remedy, sadly it too was dull, and did little to compliment the roll.   The \"Crab Rangoon\" was the highlight of the meal, we ordered a side of the sweet and sour sauce to dip in, which I would highly recommend doing.   The \"Fried Marinated Pork Strips\" were very salty. I have been accused of putting salt on my salt and even I thought this was a bit much. The provided Jaew sauce only exacerbated the problem.   The \"Chicken Curry Puff\" was a little dry, and at three pieces for nearly six dollars certainly not a very good value.   Finally the Pad Thai, our entree, was a disappointing finish to the meal. Somehow it was at the same time bland and spicy. No flavor, only heat - like noodles in a bad hot sauce.   A shame. I was excited to have a Thai place near the house.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ugd_yB1RecZMCWfSsr3GQ"
  },
  "3G8zWljJID5DX5HNKj9EVw": {
    "date": "7/14/2016",
    "text": "Food was absolutely wonderful.  Service was pleasant but not great considering it was a slow night. The prices were very reasonable.  I would definitely return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u92foP9R0Helo4h5vLfL8A"
  },
  "o4seDTwMoXr394rirefsGQ": {
    "date": "10/1/2012",
    "text": "I'd been meaning to try this place for some time and I finally did so last week. We started with an appetizer platter that included crab rangoon and some fried egg roll thingies; the former was pretty good but the latter was kind of bland. I wish I had ordered the fresh rolls instead. On to the mains: my girlfriend and I shared an order of the duck curry and an order of the prik king. Both were quite good, especially the curry, which was very rich and flavorful. Portions were ample. Neither dish was as spicy as we hoped for, but as a white guy I'm used to ethnic restaurants underestimating my capsaicin tolerance.   I enjoyed my meal at Curry on Murray and will return to try more of the curries and perhaps some Pad Thai. I think this place is the best Thai in Squirrel Hill, especially for the reasonable prices. Not quite as good as either of the places on Liberty Ave in Bloomfield, though.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vd5wfQ2L8fszYBHDPza9yw"
  },
  "mooMGVJhVNAfFQ5G3a_NZA": {
    "date": "8/30/2015",
    "text": "Curry on Murray is a solid thai place that is our go-to for takeout.    I'm consistently pleased with the quality of their food without loving it.   I usually get the green curry or green curry fried rice (either veggie or with chx).  They provide a decent amount of fresh veggies either way, which I like.  My wife usually gets the pad thai (either chx or veggie) and rates it as solid.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l44tgWB_Kl0CCmfEfZgeZA"
  },
  "gSWFM_cPFIYZeB3E_g9Tfw": {
    "date": "8/16/2014",
    "text": "We tried this place on a whim today and our experience was mixed. The tofu summer rolls were good but not great, the lemongrass soup was stellar, and my pad se ew was good but a bit too sweet. My husband's experience was bad enough that we probably won't go back, unfortunately. My husband hates coconut and ordered the Penang curry on the understanding that it was not prepared with coconut milk. Unfortunately, our very nice server was wrong (the dish was tasty but for the coconut). My husband exchanged his dish for the pad Thai but that dish was very sweet with a hot pepper kick. Overall, Curry on Murray gets a thumbs up for decor and service but the food is merely OK.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p_OlY_uSdI6qyqJnC2-oRw"
  },
  "lzg-91Yn7nLLSe0-sIMyLg": {
    "date": "7/28/2012",
    "text": "I was so hoping that this was going to be my new walking distance thai restaurant, but I was wrong.   Decided to order some appetizers and an entree to share with my husband for lunch.    The fresh rolls were pretty disappointing.  I didn't like the chemically smell that they gave off and the accompanying sauce tasted too much like melted peanut butter with no acidity to cut through the richness.   The crab rangoon was delicious and not oily and the accompanying sweet and sour sauce (I don't know if it comes with them or not I requested it) was very well balanced.  The fried marinated pork strips were very salty and the Jaew sauce was also salty which just overpowered everything.   The chicken curry puffs were also delicious but it was also a very small portion for the price 2 dollars per puff seemed a bit steep.   The pad thai was probably the biggest disappointment.  We did ask for it extra spicy and it was, but there was no accompanying tangy peanut sauce that I am used to on the pad thai.  They also did not put in the extra lime I requested.   Overall I might give them a try again after they have time to get used to the flow, but with so many other great thai restaurants I won't be rushing back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kXt6tPSGLWhWTiXO7XPjuA"
  },
  "WP527G30ALcxQmu48XSNsw": {
    "date": "7/17/2012",
    "text": "First off, the food is absolutely delicious. I've had three different curries down there and all have sported an array of spices that pleased my tongue and palate. The waitresses are friendly and the seats are comfortable. The prices are good for dinner and alright for lunch (I've always been a believer in keeping lunk around $5 and with a drink, it averages closer to $10 before tip).  There is a great variety in a small number of seemingly similar curries available for lunch. Fair warning, there's some degree of variation from day to do too. As I understand it, the cooks constantly experiments to make the dishes better. So far, everything has been delicious, but it's not always consistent. Speed of service can also be a minor issue. Each dish is cooked individually, which means that a half hour lunch is not feasible, as it takes around 20 minutes from the time of ordering to when you get your food.  In terms of aesthetics, the room is laid out nicely. The atmosphere tends to be fairly quiet, such that you don't have to shout when conversing with friends. The photographs up on the wall are absolutely first-rate, with the owner obviously having spared no expense on securing excellent museum-quality glass to prevent glare. The layout has some minor issues, such as a corner with a sharp edge about kidney-height for someone sliding into place, but it's their first weekend, so there's still time for them to even things out.  Ultimately, a very nice place and a welcome addition to the food choices on Murray Avenue.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VkW2lEgIlZJZGjOTqAialQ"
  },
  "yrTq7OIxbEXmdsbX6FvseQ": {
    "date": "3/11/2015",
    "text": "The staff is friendly. The atmosphere is nice (i especially like the orange-painted walls.) And this is where my praise stops.  Both times I ate at this place I tried their curry. A total disaster, to the point that I am not willing to give them a third chance.   Granted, I have not tried too many dishes, but what I ate there last evening could not be called \"curry.\" Perhaps a greasy dish in which some vegetable were floating on a pool of oil, a green dish for an extraterrestrial being, who has never had real curry in its life. The subtlety of flavors, the smoothness of the coconut milk, the freshness of basil: all the ingredients that make an authentic curry dish, were absent.  My friend had the tofu eggplant dish. Absolutely underwhelming; too spicy and again soaked in oil.  Maybe we were out of luck. But that's it for me.   So long, Curry on Murray! I would not eat there again even they paid me to do it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yJgwh5alHcquvx2bvmVUGg"
  },
  "5wTatz8zTmZd6shrR3tA_g": {
    "date": "8/26/2014",
    "text": "Had a repeat visit to try additional dishes. Not as bad as my first experience, may have gotten a bad chef that day. Seems like a solid place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VgrfY7oeGfYcWiSVA_64Lw"
  },
  "5YKUBDy3AaaoUVr8xAR1Gw": {
    "date": "8/10/2012",
    "text": "Went there on a Sunday night with a couple of friends. Only half of the restaurant was full at the time. The restaurant did not have much decorations. if any. Clean is probably a good word to describe it. I like the peaceful ambiance, but they really should put up some art pieces or two to make the place pop.   The service was pretty good-- attentive, but not obsessive. We ordered a pineapple curry, red curry, and bean thread pai thai. The food was descent. Nothing was a wow-factor, but good enough. I'd go back again to try something new. Perhaps, not exactly curry this time, although the name itself definitely makes you want to try all of their curry.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rgv-SWSwKElnZeUCCV7u6g"
  },
  "fLwunxywcPoGeedRfLLHEg": {
    "date": "5/4/2013",
    "text": "This is my first review on Yelp, and I am writing it because I love Curry on Murray. I've tried the fresh roll with tofu and the Green Curry, but the Massaman Curry has stolen my heart. Every weekend I get a craving for it and either convince one of my friends to accompany me, or order takeout. Excellent food, great service and a nice, casual ambiance. Definitely going back for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "lgpiQ9pPDyTIdfXhzYqACQ"
  },
  "nZtEJPSrRp-BhdVqzZu4gA": {
    "date": "4/27/2016",
    "text": "This is now my favorite restaurant in Pittsburgh since moving here. The staff is always friendly and attentive. The atmosphere is great and I love sitting by the door when it's open. The food is absolutely wonderful and fresh! When I go, I try to order a new appetizer but stick with the same meal each time because I love it that much (chicken cashew nut). I've had the crispy tofu, crab rangoons, and the Moo Yang, which have all been delicious! I've recommended this restaurant to so many of my friends and family and any time I have visitors from out of town, I bring them here. Prices are completely reasonable for the delicious meals we receive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6JdlxAUJ9esAv7n4pkMgng"
  },
  "j0xELgycopYUnTpTVvHb9Q": {
    "date": "6/22/2016",
    "text": "My wife and I eat here often. The place is always delicious. We only order 2 things but there both really good including there rice. Chicken with cashews and pad Thai.good service a well",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EPtLBL1q6Z0y3__n-T_tJA"
  },
  "KFbvdRI7E9IqOdGsKfd4xA": {
    "date": "7/11/2017",
    "text": "This is my go-to Thai restaurant in a neighborhood full of good Thai restaurants. I like the low-key atmosphere, the fun of sitting by the big front window, and the fact that it's not noisy or bar-like. It's also a tiny bit cheaper than Silk and Bangkok Balcony (both of which are in the same area, also good, and get my business too). My favorite things at Curry on Murray are the Pad Thai and the Pad Kee Mow. I also like the Massaman Curry and the Tofu Eggplant (inconsistent on this one--sometimes underdone or under-sauced compared to Bangkok Balcony's). The green curry is great for eat-in but when we get it take-out the sauce is always broken by the time we get home (perhaps heated too hot before packaging? It's mysterious). The place has its imperfections but I frequently find myself back there for eat-in or take out. The people who work there are friendly, and the location couldn't be better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KLedXGxTgebJ9kq-koZedg"
  },
  "bR8zUTwCjXfW4IkEYFG1Sg": {
    "date": "10/9/2013",
    "text": "Went to Curry on Murray with the wife for a rare meal without the kids. I was a little concerned with the few folks in the restaurant, but it was a Wednesday night.  The menu was easy to understand and had a nice variety.  Decided in the fries dumplings (nice delicate balance of flavors and textures with neither the shrimp nor the chicken overpowering the other) Pas Thai (should have ordered hot, medium wasn't enough kick)  and Pineapple Curry(delicious, sweet, spicy.) Friendly service, reasonable prices ($10 a plate). I will definitely recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "wAHvCjMffHf9xCWFhgkRzg"
  },
  "MzXf7s2NQVkc-ay5aEnhyg": {
    "date": "3/19/2017",
    "text": "Went here for lunch. It was very dead, which was a bit alarming at first. It turned out okay though. Our waitress was very nice and seemed to know her stuff. The food came out in a timely manner. The food was great. I just wish they had more food options for children.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Pk25bOBsvemFaWKDBVBzA"
  },
  "B3TyNYfBXz3Ls_VTPV_FSA": {
    "date": "1/3/2014",
    "text": "The restaurant has authentic food, but the taste was average. Waiters are friendly and service is good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEBj1ua6MrlFFU_MKaggqQ"
  },
  "hRSWr5ZlqVVFp-nqYhorTA": {
    "date": "4/2/2016",
    "text": "I love the appetisers here. Best Dumplings and Crab Rangoons in Squirrel Hill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YXW3e-GwvdDufYAbIbbSeQ"
  },
  "lEStGMN9ORjjTFSCQwwn2Q": {
    "date": "5/23/2014",
    "text": "I have been there so many times and this place never disappoints. I wonder why this place is not busy enough, for the food is much better than many thai restaurants in town. I have tried their muscles in coconut sauce, red/green/pumpkin curries and amongst them red curry is my favorite. The servings are OK size but value for money. The papaya salad and muscles great. I tried their pad thai and pad kee mao and wasn't satisfied both times. The taste was fine but the noodles were super hard, so I would not recommend anyone coming here to try their noodles. Go for their curries and muscles and you will always return happy. They keep changing thier staff really very often but the staff is super friendly",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FQzuZmQ3_UUrGV5YR8xQyQ"
  },
  "Sj0U9TEqrtEf0IEPfjXfZA": {
    "date": "2/6/2016",
    "text": "I've always had a positive experience at Curry on Murray. Most recently, the staff made the wrong dish for me, but the waitress noticed before I did and immediately offered to correct it. I didn't want them to go through the trouble, so I kept it and of course it was delicious as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zDitgVR1oDbrgSpsgoHyfg"
  },
  "nm7tG0wJ2P5AYXAY8JJ9RQ": {
    "date": "4/28/2016",
    "text": "They cooked Thai curry very well. My friend and I were impressed by their curry and dessert.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CcCb5XiyuIS60sJ1watjmg"
  },
  "ujWOFi1cE7QrqgljGHqKpQ": {
    "date": "11/20/2016",
    "text": "The place was clean, the service was so nice, the food was good especially crab Rangoon and ka-prao. Because it Saturday so it too many people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YuMJFN9BYbJh_DKel3E7kg"
  },
  "c5IIHto52x02V5SKl47tbg": {
    "date": "6/12/2014",
    "text": "I have been there so many times because it's close to my home and I like Thai food. Curry food and service here has been consistently good. One thing I like about Thai curry is it always gives you a stunning feeling on your first taste. So once in a while I may get tired of that flavor. but when I get through that phase, my stomach just again starts craving having Thai curry. In a word, I totally recommend this restaurant.  P.S. Just tried sticky rice with coconut milk. Emmmm...... It's like heaven with a bit mysterious salty flavor in the coconut milk cream. Just be careful it's really hot inside and the waitress should've warned us.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DFQmDSSmyW5pSBBYgzp5AQ"
  },
  "kBDJCxf5XXveXk0lrcLTpQ": {
    "date": "3/24/2016",
    "text": "We've ordered take-out from here twice (using Wheel Deliver or a similar service).  The food was amazing!  So far I've had Pad Thai, Pad KEE-MAO, Thai Beef Jerky, and Massaman Curry.  I will be ordering from here again.  The beef jerky... what a delight.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iAnlodL1PfKki5x-BJSDmg"
  },
  "weYkqP2DxJDnfjBcSjmbIQ": {
    "date": "2/10/2013",
    "text": "I was not expecting a lot from this place.  The location has hosted a number of restaurants over the years and they have been of varied quality but they have generally not done well.  I expected mediocre food; the name itself leaves a lot to be desired as it cold easily be mistaken for an Indian place \"curry\".    I was really and pleasantly surprised.  I have not yet tried Nicky's Thai, but this is the best Thai I have had in the area and I have tried a number of Thai restaurants.  The food felt very healthy, not oily or greasy; it was well spiced and seasoned.  I personally would have like more heat but that is a personal thing.    Highly recommended.  The good news was that it was hoppin'.  I hope that they stick around.   The service was a little slow, but the place was busy.  Good for them.  Best of luck.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "RvdWOF9kC5Q4qgjw9PbVow"
  },
  "5-yEyakPEx4PBcn9kvpYMg": {
    "date": "2/24/2013",
    "text": "I came here to use up an expiring Groupon Thursday night.   The place was pretty empty, and we were welcomed quite enthusiastically.  I had the pineapple (red) curry with chicken, and it was delicious.  One note--their spiciness scale is shifted to the right of what's typical for Pittsburgh--I got their \"spicy\" (above moderate and below \"very spicy\"), and I'd say it's an 8 or 9 on Smiling Banana Leaf's scale.  My dining companion who is less enthusiastic about spiciness got moderate and it was almost above her tolerance, so caveat eater.  Our water pourer (a server-in-training) was quite good at topping up our glasses, so it ended up not being a problem.  Service was very enthusiastic but not without flaws.  I presented my Groupon in the beginning and the server offered to take it then.  After our meal, she asked us about dessert and mentioned a favorite of hers--a curry puff filled with taro root which is actually on their appetizer menu.  We tried to express thanks for the suggestion but a polite decline, but somehow this got translated into \"Yes, we want dessert.\"  Also, we were first presented with a bill that did not account for the Groupon, although the server realized her mistake and corrected it.  The Tofu Tod-like tofu appetizer was pretty good, and the curry puff was tasty though it had nothing to do with curry from what we tasted--more like a sweet taro-filled empanada.  The curries are good enough that I'll happily eat them again next time I'm in Squirrel Hill, but SBL remains my favorite Thai in Pittsburgh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ri4xmSrehzGEqbR1EWAhAw"
  },
  "IwKzjE_UMIXfhc4waakFfA": {
    "date": "9/1/2015",
    "text": "My favorite restaurant! Everything is so good!  Especially Mango salad and Tom yum noodles are awesome! :D I love thai food and this restaurant is best in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6pNK_7PIbzs6G9D0VuyT5w"
  },
  "mvucCu-plXiw5czMOP2I6w": {
    "date": "12/8/2015",
    "text": "I had the chicken pad thai at Curry on Murray. The food was average, and exactly what you would expect from a pad thai box you could make at home. They were already out of their Thai iced coffee when we sat down at 12:45 PM, which was hard to believe, but became less surprising as the meal continued. It was obvious the place was understaffed and poorly prepared for customers. There were 4-5 tables occupied when we were there, yet, the service was incredibly slow. We waited about 10-15 minutes after being seated before the waitress even visited the table. On top of that, the waitress' English skills were lacking, a which made her difficult to understand. I would recommend visiting Silk Elephant or Bangkok Balcony when seeking Thai food in Squirrel Hill.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Z1k6lp3JLBU5hk48vitSA"
  },
  "aEPHkDbql3uFNcSJuu3LEg": {
    "date": "9/22/2012",
    "text": "Curry On Murray creates some more competition for the 25 other Thai restaurants in Squirrel Hill (ok, I'm using a slight hyperbole, but there are a lot of Thai places in the area).  Anyway, where was I?  Oh yeah...Curry on Murray offers a decent variety of curries and noodle dishes all of which I tried were delicious and filling.  The crab rangoons were probably the highlight of the meal, but my Pad Kee Mao was probably a close second.  My one criticism is - and this goes for ALL Thai, Chinese, Indian, etc. restaurants - when someone says extra spicy, they mean extra spicy!    The service was exemplary as we were waited on by a lovely young lady who spoke fluent English which made our dining experience somewhat easier (come on, you all have to agree that no matter how delicious a restaurant is, language barriers can be a challenge.)  Of all the Thai places in the area, I think that this is probably the most \"down to earth\" as it lacks the ostentatiousness and higher prices of some of their  competition which I why I'll very likely make Curry on Murray my first choice for Thai in the area.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "dKKTpZ8TeX8qv4gT_otDHQ"
  },
  "ZJFXYFRw3tXiBxHH4wV1ww": {
    "date": "1/11/2016",
    "text": "I can't speak for everyone, obviously, but I need to confess: when the world is cold and I need some serious comfort food, this is the place I call (affectionately saved to my contacts as Curr on Murr). My go-to is their addictive crab rangoon and the Massaman curry with chicken, which is huge fork-tender chunks of white meat with potato simmered in a savory peanutty drink-it-straight-if-you-run-out-of-rice curry sauce. The lemongrass soup is another love of mine, and the curry puffs.   Service has always been great when I dine in, and the nice people at the counter never fail to offer me a glass of water if I come in before my takeout order is ready. The window seats are a nice place to bask in the afternoon/evening sun, and I never find the music to be too loud or annoying. It's the kind of place where you can relax, sip some tea and read a book or enjoy a quiet conversation over some satisfying nosh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SgO3mPGmsNqd5fZMNUUl6Q"
  },
  "j73uhGFFD5gF9ODOtEoAfg": {
    "date": "3/16/2013",
    "text": "I've been here twice now and tried the Pumpkin curry and the Chicken Pad Thai. I thought both dishes were very good. The food was not overly greasy and had a good flavor, though I didn't actually get asked about a spice level and I forgot to ask so my food wasn't spicy at all. I'm going to remember to ask next time since I would love if it were a little spicier.  In the past, they had live music but I'm not sure if they do this anymore. There wasn't anyone playing last night. The service was quick and friendly. The only thing that was a little weird to me was: my boyfriend and I split an appetizer and our friends split a bowl of soup. The soup was brought out and then after that was taken away, our appetizer was brought out. It would have been a little better to have all had our appetizers at the same time.   Overall, good environment and tasty food and I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6djyuTKCGCJHMk79AeiFYg"
  },
  "I29Zr7jJVOop36TGafZs_g": {
    "date": "9/15/2012",
    "text": "Another fairly mediocre restaurant on Murray.   I went there two weeks ago around 8pm during the week. It was empty, which is not very pleasant. (On the other hand, it seems fuller on Friday and Saturday).  We had a curry and a pasta dish. The food was not very tasty, and, while it is not very expensive, it was not worth the price we paid for. Unimaginative thai food (which is too often the case in the US).  I probably won't be back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LMl9Z43ZVPh5wrz4LeYd6Q"
  },
  "_pkn88DN9Qw4rFaE_AsKmA": {
    "date": "7/23/2012",
    "text": "I had high hopes that this place would be good since I heard good reviews through word of mouth. However..this was the WORST Thai I've had in Squirrel Hill, Silk Elephant and Bangkok Balcony being much better choices. I was highly disappointed. The food was only adequate and the service even worse. I ordered Pad Thai with tofu, which was probably one of the worst Pad Thai with tofu I've ever had - did not taste authentic at all, and the tofu wasn't full cooked. I also tried the pumpkin curry, which had too much of some flavor (fish, salt maybe?) My friend was also very disappointed with his Pad See-Ew with Beef. The noodle dish portions were also considerably small for the $10.95 price. That's just the food review.. First off, our table was not set with napkins or silverware, and we didn't get any silverware/chopsticks until I had to ask for them. We did not receive napkins during the entire meal. (good thing we aren't messy eaters!). My friend had to prompt the wait staff for a water refill since his glass was empty for at least 5-10 min.  Overall a very disappointing experience. Consider your other Squirrel Hill Thai food options before going here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wt2KS-973dW5QBt9K_D2sg"
  },
  "ogniYeSQqPHJWVSrtcQXPw": {
    "date": "2/17/2013",
    "text": "I'd like to give this 3.5 stars but I'm willing to round that up to 4.  We got take-out here a couple weeks ago. We had to wait a while (25-30 mins) but they told us that at the start, which is commendable.  The food was pretty good - not the best I've had in Pittsburgh but above average.  What impressed me very much was the ambience - the place had a very nice feel. [unlike one of the reviewers here, I do NOT like crowded restaurants . . . but this place was far from empty]  Anyway, I digress - my daughter ordered Pad Kee Mao and asked for it spicy, and they did a nice job (she often complains of under-spiced food, so that's a good thing).  My Ka Prao was very good as well.  As for my wife's chicken salad w peanut sauce . . . we'll never know, because they forgot to include it!  This, even though they ASSURED me that they double-checked everything was there.  After a long phone call the next day, they refunded us the value of the dish plus 10%, which is appreciated; but it really should NOT take a long conversation with the manager to right an egregious error.  Having said that, the people there were very nice, and that is why I am giving 4 instead of 3 stars.  I am not sure I'd go too much out of my way to go here, BUT if you are in Squirrel Hill and looking for a good and pleasant Thai meal, by all means, you should try this place.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RrQXgP0fVDaNa44X1Z41Cw"
  },
  "rKeM1wCvYDWjPnZby4rg4w": {
    "date": "5/1/2016",
    "text": "the pad kee Mao with tofu is one of their best dishes. Had it twice so far and I'm in love with it. You can bring your own beer or wine and chill and drink and eat great food. Love it. Totally recommend it for a chill evening or afternoon.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MO_ghGEwxkWo7XHH-5XE8Q",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MO_ghGEwxkWo7XHH-5XE8Q/o.jpg"
      }
    ],
    "user_id": "9byPjXAC04cppb8vcDW2tg"
  },
  "T4GfAsW_lYd3zSepu2XVmQ": {
    "date": "7/24/2016",
    "text": "A good Thai place with very reasonable prices. I had the green curry sauce with chicken. Very good flavor, and good heat (if you like heat). They seem to be <a href=\"/redir?url=http%3A%2F%2Fable.to&s=ef7479cd41c0936fbcfdcf0a9a759869a172e510a9c0fe916939b7e35abe49e3\" target=\"_blank\" rel=\"nofollow\">able.to</a>.adjust the heat of the dishes well. My daughter had the pad Thai, it was very good too. Definitely a two thumbs up!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9ofvsq_VFSpdLeKrH5CZA"
  },
  "JqNWLekMZFBFWKdj4dZyOw": {
    "date": "4/15/2014",
    "text": "For many restaurants, whether I like it or no really depends on what I order. Since I came here with a friend who loves this place, I got some great recommendations.   I had Ka-Prao with pork. The portion was huge. I couldn't finish it and took the leftover as lunch the next day. The dish has some kind of smoky flavor which I really like. I mix the bowl of rice with the dish and it was tasty.   I also tried my friends' red curry and Thai fried suki. I love both of them. The red curry was creamy and kind of heavy. The Thai fried suki was sour and spicy, a interesting but good combination. The chicken in the suki was super tender.   They are pretty good for 10 bucks.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "nH1VHUujOV1D2Q7hAB1r3g",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Sticky rice with mango",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nH1VHUujOV1D2Q7hAB1r3g/o.jpg"
      },
      {
        "img_id": "abQaUs6Shlo8bkb1RQ-5Pw",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Ka-prao with pork, and a bowl of rice not in the photo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/abQaUs6Shlo8bkb1RQ-5Pw/o.jpg"
      }
    ],
    "user_id": "JjDR060LJQcNNVWKuU64fA"
  },
  "9Zwdf2uSubsEfOxbNQ0mUQ": {
    "date": "6/5/2017",
    "text": "The best papaya salad and beef waterfall salad I have ever had in pittsburgh it was so good and they are so nice and real thai people are cooking in the kitchen. The papaya salad was made exactly how it was in Thailand amazing. Don't review Thai restaurants only on pad thai i'm sure the padthai is good here too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cnAnfMugHvzrAf5-Hhy7Zg"
  },
  "bpwgsIKjH7bAZvmiHbpDZA": {
    "date": "2/23/2018",
    "text": "This is my favorite Thai place in Pittsburgh! Their pad Thai is excellent and so is there massaman curry. Good to dine in or order out. This is my go to Thai place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GvZiX0sFJpntoAVqRGpIWQ"
  },
  "4pJU0eD1Pd-K6zltsqzlCg": {
    "date": "12/7/2014",
    "text": "I like Curry On Murray. I really do. If only I could say I LOVED Curry On Murray.  I love parts of Curry On Murray. Like the food. I order their tasty crab rangoon every time I eat here, and mmmm, the curry! They do offer other dishes and appetizers, but the main reason to eat here is definitely the range of curry dishes here. So far I stand by their pineapple curry 100% - so yummy! - and I really do want to try their pumpkin curry sometime soon. I admittedly wish they offered a green Thai iced tea, not just regular Thai iced tea - so far Nicky's is the only place I can get that particular drink in the 'Burgh.  A quick note: even the mild curries have a bit of a kick to them. So while some Thai places are pretty good at going light on the spice based on a scale of 1 - 10, this may not be one of them. But I always order mild since I'm comfortable with it, so \"not at all\" might be an option. I just don't know since I don't feel like I need to order any lower than their mild option.  Unfortunately, Curry On Murray isn't perfect. The curry is excellent but some of the dishes can be pretty average. Worse, their service in particular is not always spot on. The last time I came in with a friend - note, one friend; we were not part of a large group - it took 15 minutes for a waiter to even come to our table to take beverage orders. We just ordered our food with our drinks at that point - and that food came out another 40+ minutes after that. Sorry, but that's unacceptable, especially since the place wasn't exactly hopping crowd-wise. I only stuck around because the company was good, but if my friend had asked to go I would have gladly left with her.  I don't mind stopping in here periodically, but I don't think it'll ever be my #1 choice for Thai food, especially if I'm in a rush. It's a good place to eat and meet with friends in the area when we all really want curry and a good place to chat, at least.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "kErBaXEfRLvKrDjS4FBszQ": {
    "date": "9/9/2017",
    "text": "We ordered the Chicken Cashew, Green Curry (Beef) and Thai Iced Tea. The chicken curry was reminiscent of sweet/sour chicken but with a little less sweet and a little more savory and quick fried (rather than deep fried in batter). Conclusion: YUM! The green curry was good, nothing special but still flavorful and well portioned. The thai iced tea was a refreshing balance to all of the flavor of the dishes. The local is nice enough and the service was very good. We will definitely be going back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M7TRBFEaMIAhZCkJt6NHHg"
  },
  "Q0cSfwlMRMIsNP17U75Z4A": {
    "date": "2/4/2018",
    "text": "I've been eating at this restaurant for years, and it is absolutely delicious. I have never ordered anything that I wasn't impressed with. They probably have the best wonton soup in Pittsburgh. Fresh rolls are excellent, as is the sweet red chili fish, and, the pumpkin curry is out of sight. This is also a great place to impress out of town guests, or in town friends. Not sure what's going on with all the negative reviews here, but I think that they're giving the restaurant a bad rap. I have, very occasionally, had slow service, but on the whole the wait staff is friendly and helpful.  Seriously some of the best Thai in town, and yes, I have eaten at Silk Elephant, Bangkok balcony, and others, but Curry on Murray is the one I come back to on the regular. Huge fan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvECOQzXtG-Ydyo5T2iyBQ"
  },
  "idx512084zhZWjdBHAO1zA": {
    "date": "11/19/2015",
    "text": "I had the spiciest Green Curry I've ever had in my life. And I loved it. For all of the curry-lovers out there, this is the place to go.   The decorations were very cute and the server was super friendly and made great recommendations. I was there with a group of food-lovers and what better to accompany food than wine? The corking fee is merely $2 per person. My meal was about $11, so while it's not quite the price range of say... Chipotle, it's definitely worth shelling out a few extra bucks for the experience.   It's apparently a good place for all kinds of nom-nomers. There was a group of middle-eastern dudes at the table in front and a Netflix-watcher to my right. He got through an entire movie while enjoying his dish and the servers didn't seem to mind. He's got the right idea! Why dirty your own dishes when you can Netflix and Chill at Curry on Murray.   Go here. It's a great place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kb36ZHxGLdPU5p63Mj5u4w"
  },
  "FY7guwNKLAoj4jyl-D5SiQ": {
    "date": "3/6/2014",
    "text": "Four stars because, \"Yay, I'm a fan!\".  I'm always shocked this place isn't busier, because it's legit curry (son).  But maybe because I've only eaten here on weeknights.  Located on Murray Avenue (go figure!, Curry On Murray!) it can be a pain in the you know what to get parking near the restaurant, but keep circling, it's worth it.  Each time I've been here I've ordered the pumpkin curry.  I can't stray from it, even though there are several other very tempting options.    Start with the fresh rolls, they won't disappoint.  I look forward to coming here in the spring/summer when they can open the garage door window and let in some warm air.  Because let me tell you, this is one cold place to eat at during the winter.  Like - keep your jacket on and order some tea cold.  That's my only complaint.  And it won't stop me from coming back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYTpi63Tv_UTjsaTMCZUvg"
  },
  "kvykfIO-pjjPMD8qC7zniw": {
    "date": "8/24/2015",
    "text": "I was with a group of friends and we were out celebrating a birthday. The birthday girl chose this restaurant to celebrate. There weren't many people in the restaurant which I thought was off for a Friday night. It was very warm, like the air conditioning was off.  We were seated quickly. Water was poured for all of us and we were given menus. A few minutes later our waitress came to take our appetizer orders. I ordered Crab Rangoon.  When the Crab Rangoon arrived it was some of the best I've ever had. They were pillowy pockets filled with crab. The edges were crispy and they were served with a sweet & spicy sauce to dip them in.  It was awhile before our plates were removed and our entree orders were taken. Then there was a very long wait for our entrees. I don't know exactly how long but when a group of very chatty women stop talking and ask about entrees, you know it's been awhile.  Finally our entrees came and several of us found them to be disappointing. I had ordered Pad Thai-mild. It was barely room temperature and it was \"meh\". It was not worth the wait. It had almost no taste. I only had a few bites and asked for it to be wrapped up to go. (I have boys at home who will eat anything.).  We asked for separate checks and the waitress gave us one saying that she didn't know who had what. We divided it and paid.   Poor service and poor food equals no return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6RzVWHG97xq1fovvcK_-dw",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Pad Kee Mao",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6RzVWHG97xq1fovvcK_-dw/o.jpg"
      },
      {
        "img_id": "KzjcwCqYzO6ic8YAFZg9qg",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Pad Thai with chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KzjcwCqYzO6ic8YAFZg9qg/o.jpg"
      }
    ],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "X8Eefdykx_6BH7mjdb_eyg": {
    "date": "11/19/2017",
    "text": "By far our favorite place to go. Delicious pineapple curry. BYOB and highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WUwIekZis7huPymVL26KVA"
  },
  "7Q5HskmFcmdstBmOmuGl9A": {
    "date": "12/22/2014",
    "text": "Nice Thai ...  Trying to expand my that experience I tested the lemongrass soup, bean thread noodle salad. And crab Rangoon or fried wonton.   Lemongrass soup.... chock full of yummy veggies... Good spice balance. And well I love  lemongrass spice factor was spot on.   Crab Rangoon was to die for! I could sit in a bathtub filled with these amd eat them till my death.  A happy death.  salad : noodles and spice were great shrimp and chicken were dry I'd suggest frying the shrimp adding more garlic. Otherwise great.  My guy had red curry it was very yummy but just not very spicy as he has ordered, my dishes were hotter at the spicy level.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Bwa7MWEM88FtiNLaXWCkww"
  },
  "sCYOxytHV6T8uViq2fZ9tA": {
    "date": "11/20/2016",
    "text": "What is more embarrassing than to take a guest to dinner and have it be a disaster?  It was my guest's choice to eat here, and I didn't hesitate, as I have had a couple of decent lunches here.    The food was not good.  Greasy spring rolls that I could not eat, a flavorless green curry, and my guest's noodles that were glued together in an inseparable ball.    But the service was the worst.  I am pretty tolerant of less than spectacular food, but...seriously understaffed.  No ice in glasses, No napkins or cutlery until we asked.  Server who seemed as if she couldn't wait for us to finish ordering to get on with things.  Most embarrassing is that the food was not served to us, but lined up on the opposite edge of the table, so that we had to get out of our chairs to reach it.   Okay for a quick snack, I guess, but for a nice dinner out not the best choice, and it wasn't all that inexpensive.  The prices were comparable to the Thai restaurants closer to or on Forbes, but the quality of the experience was far, far down the ladder.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOfcacN-xecOXwUR2rJIaQ"
  },
  "MIDvH7P1SruCmMtIZA8T2Q": {
    "date": "6/15/2015",
    "text": "I had a fantastic experience at Curry on Murray. Having a Thai server made the experience even better. I ordered the moo yang beef which came with sticky rice, the mango papaya salad special, and crab rangoon. To complete my meal I had a Thai iced tea. The beef was cooked very traditionally, that comparable to how it is made in Bangkok. The salad was very refreshing. One of my guilty pleasures is grab rangoon, and I loved it! In my opinion, this is the best Thai food in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2ucpHXfPOqZ7D9uQVW2_6Q",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Mussels in coconut sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2ucpHXfPOqZ7D9uQVW2_6Q/o.jpg"
      },
      {
        "img_id": "fjOFMAI5wAGah5Et3sxqsg",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Sticky rice, moo yang beef, mango papaya salad special, crab rangoon and Thai iced tea.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fjOFMAI5wAGah5Et3sxqsg/o.jpg"
      }
    ],
    "user_id": "Pe5eoZvuQYif9-jPfrFSTQ"
  },
  "dXHRSAHAExiEcBM3HT-t1g": {
    "date": "3/15/2016",
    "text": "I am very glad to be their Royalty rewards member. There are quite a few Thai places in squirrel hill, but Curry on Murray has grown on me; it is my personal favorite. I have had tried lot of Thai places in Pittsburgh, and I almost can guess what to expect when I order a curry or a Pad-thai, etc. But, the same curry at Curry on Murray always turns out to be better than I expected. I have tried their Red snapper on raw mango and chilli sauce which was a bit pricey ($23) but totally worth the $$. The rightlevel of sour-hot and crispy. It made my day. I have also tried their soft-shell crab, raw mango salad with prawn, green curry, masaman curry, red curry, chicken with cashew and rolls. I am very picky about food and prefer cooking at home than eating out (also a very egoist cook; in other words: whenever I eat out I comment,\" I can cook this dish at home and it would have been tastier\" :P), but food at Curry on Murray has managed to betray my instinct. When I dine here, I actually feel good to have decided to eat that meal out. everytime it's a new experience for my palate and I can proudly proclaim that I might not be able to recreate the same taste and texture when I try making it at home. I totally recommend this place. There's lot of seating, great service and ambience as well!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5BEKewOKpYh39zdTZ2AEMg",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Chicken with cashew and red curry in the background",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5BEKewOKpYh39zdTZ2AEMg/o.jpg"
      },
      {
        "img_id": "TeNx841RB2uCBLP3xfbgPQ",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TeNx841RB2uCBLP3xfbgPQ/o.jpg"
      }
    ],
    "user_id": "cRD5J3VDPbj_OdF_ucxtBw"
  },
  "3ya_bWnx7AGQsskgcrBzAQ": {
    "date": "3/13/2015",
    "text": "We were stuck in traffic on our way to DC. Kids were getting car sick and whinnying they they are starving. I pulled off hwy, parked, and walked in the first door we saw. We had the chicken satay appetizer, the curry pineapple shrimp, rice, a noodle, and taro w coconut milk for dessert. My kids said it was the best food ever. They literally licked their plates clean. We will be back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "25FOwYLZuVoPh64k394x_g",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Hungry kids!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/25FOwYLZuVoPh64k394x_g/o.jpg"
      },
      {
        "img_id": "6OQeQ2A7tirDJ9bSDT4OQg",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Pineapple curry w shrimp and noodles",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6OQeQ2A7tirDJ9bSDT4OQg/o.jpg"
      },
      {
        "img_id": "Upac4a4i8g7J0CW67P3u2A",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Dessert: taro in coconut milk",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Upac4a4i8g7J0CW67P3u2A/o.jpg"
      }
    ],
    "user_id": "Y5R1kbdRvSk6XC9adW-bCQ"
  },
  "fti6Z10gRiavXfxfba46CQ": {
    "date": "7/6/2015",
    "text": "Food was excellent. Very fresh. At 2:30pm in the afternoon we had the place to ourselves. Nice atmosphere. Front has garage door which was open and very relaxing even with cars passing by. Service was very good. Helpful and pleasant. Food was great. We're big fans of Bangkok Balcony and were apprehensive about this place but honestly it stood up to the comparison. Cashew Nut Chicken was even better! We will definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "poksP3qH_DYXpyDGmprl9A",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Chicken Cashew Nut",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/poksP3qH_DYXpyDGmprl9A/o.jpg"
      },
      {
        "img_id": "inRp0KexPB1jLG_kVCgCpQ",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Pad Key Mow",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/inRp0KexPB1jLG_kVCgCpQ/o.jpg"
      },
      {
        "img_id": "8ko10tSLtedGS4vccW08YQ",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Open air dining, nice.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8ko10tSLtedGS4vccW08YQ/o.jpg"
      }
    ],
    "user_id": "0p4VKR4V7kaU4Ts_YQ6KSg"
  },
  "ZaR6PurrN43V7a4kf9UItA": {
    "date": "2/15/2014",
    "text": "I have been here twice with two very different outcomes. overall good price for good atmosphere and what i think is fantastic food. the massaman curry is fantastic with a very good portion size. the first time i was here the service was good and i had a great time, the second time the service was slow and not great. still the food was delicious. id recomend this for a date especially in the summer when the glass wall is open",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ssldmg9QPCb-VYOWGKAgug"
  },
  "P6rv-xGBO1W02Ryf4XSScw": {
    "date": "4/3/2016",
    "text": "Giving this 5 stars now. Update on corking fee is flat $3 per person. Very reasonable!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UBUV0ElEvm8kgxZvcdDo2Q"
  },
  "kcAVNAxzbdWBNxL6uVlpzg": {
    "date": "3/23/2019",
    "text": "Pad Lee mao is amazing!!! The waiter is extremely kind. The interior is extremely clean and open, comfortable to eat in. Definitely recommend and will return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L0pvKbaxlKpw-BHPFIYozA"
  },
  "ra88UjllpcJs_HHSR-VLRQ": {
    "date": "1/28/2018",
    "text": "Nice neighborhood Thai place. Relaxed atmosphere and a casual clientele. It's not haute cuisine, but that's not why you would go there.  I had the lemongrass soup, fresh roll and pad Thai. I got to taste someone else's curry; it was good. The dishes were all good if not exceptional; I would go there again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EIUWrPJYxaZA3TiU0mGkbg"
  },
  "jQbtD458vSkMnL2kQfk4YA": {
    "date": "5/29/2018",
    "text": "Best pad thai I've had in a while, not dry like many of the others I've ordered recently. Great flavor too.  I also ordered the green curry - they certainly didn't skimp on the vegetables although it could have benefited from a little bit more of the protein.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U7wi-kok_DyYmh5lJzJb2w"
  },
  "F0XiRd-_zqxh8jY2sVeWOg": {
    "date": "6/5/2018",
    "text": "Food is always great and the service makes take out so simple. The curry entrees and pad thai are amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rc-hG9g0GEDVl-410oK99Q"
  },
  "e64UncuI-XfOuOCZH44-WQ": {
    "date": "1/4/2015",
    "text": "It's a well-lit, clean and spacious restaurant. The service was phenomenal, but maybe a little too attentive. The waitress was very patient and accommodating. The restaurant was not packed, but they do get decent flow of customers.   I had the chance to try the pad kee-mao noodles, which are flat noodles with pork, thai basil and stir fried vegetables. The dish was a bit too greasy for my liking and too salty. If they went easy on the grease and salt, it would've been perfect. The tom yum noodles were not bad, but not spectacular either. The broth was extremely fishy in smell, but once you get past the smell, the taste was quite refreshing with a hint of citrus.   Overall, I enjoyed my experience at Curry on Murray, but the dishes need to be better executed to ensure my return in the future. Curry on Murray wasn't bad, but I had better Thai food elsewhere. I recommend this place only if you're in the area, but not a restaurant I would go out of my way to dine at.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XzXXNRpq2TiLPc5cowYfFw",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Pad kee mao with pork and veggies",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XzXXNRpq2TiLPc5cowYfFw/o.jpg"
      },
      {
        "img_id": "sT5viAp-XsIaK7kixP6_6A",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Tom yum noodle soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sT5viAp-XsIaK7kixP6_6A/o.jpg"
      }
    ],
    "user_id": "H_09-Wr5JcN5hpp5RnSLTA"
  },
  "y4-xN6YZINB_YrL4s-XTxQ": {
    "date": "12/14/2016",
    "text": "I went down to squirrel hill to get some food. I just point this place with my friends. I has mango salad and my friend order another salad I can't remember name. It was good. I love mango salad it was fresh and testy. We ate.    My main course I order suki soup it was so good for cold day. This place is relax I like music here.    Overall is great I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Az_rin2ok2EOEvMSWSJNsQ",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Az_rin2ok2EOEvMSWSJNsQ/o.jpg"
      },
      {
        "img_id": "LryYHm6S5SJgt7fTP4F34Q",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LryYHm6S5SJgt7fTP4F34Q/o.jpg"
      }
    ],
    "user_id": "WDiHP5FuBaL9LL6lkfEj6A"
  },
  "QGCrEPqAlMWSNGfKiZHkJw": {
    "date": "7/8/2016",
    "text": "Would I say no if someone really wanted to go here?  No.  Would I choose this place on my own again?  No.  All in all, I think there are far better options on Murray and Forbes, so I'd probably not make this a go-to place.      Here was our experience.  We stopped by on a warm evening and it seemed warm in there.  The service was pretty slow overall.  She was friendly enough, but not on top of some of the basics (filling drinks, clearing plates, etc.).  We sampled two different dishes and a Thai iced tea.  The tea appeared to be from a mix and was not very pleasing at all.  The two dishes were tasty enough, but both of us had some \"distress\" later in the evening that we think was from dinner (the only common meal we ate).    So it's a \"meh\" from me.  I might give it another try, but I wouldn't seek it out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "h9LPugJk2cpIh0gmQb5LnQ"
  },
  "Axvv7zHXhS5zCMEPqpX4cw": {
    "date": "3/4/2017",
    "text": "This was a terrible experience overall, and I do not expect to return.   We decided to come here after trying to go to Cafe 33 Bistro and finding a line almost out the door (we had called when they opened at 11, hoping to get a table for 7pm, but were told that they only reserve tables for parties of 5 or more but that it should be easy to get a table. Ha). So, we called Curry on Murray and were told we could easily get a table. We hurried on down to find a half-empty but comfortable dining room. We were promptly seated and ordered hot tea while we waited for our friend to arrive, hoping to ward off the cold (which was unsuccessful since the continually opening door caused a strong blast to cool the dining room repeatedly).   When our friend arrived we ordered the fresh spring rolls as an appetizer. While we waited for these, a longer time then normal, we ordered our main courses. Finally the spring rolls appeared and were fine but underwhelming and small when compared to those at other Pittsburgh-area Thai establishments. And, before we could eat them, we had to go up to the waitress stand and ask for plates and silverware. When we were done with the appetizer, our waitress returned and let my husband know that they were out of a sauce needed for his dish and he was forced to order another meal on the spot. Thirty minutes later we were still waiting for our meals, and I asked the waitress in passing when we could expect our meals. She looked perplexed and said that she would check on them. Fifteen minutes later we are still waiting, and I again went up to the front to ask when our meals would be ready.   Finally my meal and my husband's appeared, cold of course, and without the brown rice we had ordered because they were suddenly out of it (they couldn't send someone to Giant Eagle to pick some up?!). My friend's meal didn't arrive with ours, and we had to ask, when our waitress appeared, we told her our meals were cold and asked about our friend's food. She took our meals to heat up, at our request, and came back about five minutes later with all of the meals. They were adequate but by no means as spicy as they should have been. My green curry was mediocre and still cold. My husband's meal, the Ka Prao, was small and cold as well. The coconut rice, which was a replacement for the brown rice, was probably the best part of the meal.   The waitress was kind and apologetic, and did take our beverages off the bill and did not charge us the corkage fee. Probably because we had almost finished the bottle by the time our meals came.   Again, we will probably never return here. The food wasn't bad. The restaurant is just VERY poorly managed and not worth the aggravation.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "KAsmY6WCUWRYQXE_50AkQA"
  },
  "c3NyHGeasDg2p4Oe7zb-zg": {
    "date": "3/30/2018",
    "text": "Curry on Murray was were I had my first taste of curry and I fell in love. I have gone here multiple times and risk trying to park in Squirrel Hill just for their delicious food. My usual has been the pineapple curry or the pumpkin curry. I have also tried the cashew chicken and curry puffs, both kinds. If you like sweet, I would recommend the taro puff. Everything I've tasted has been delicious and worth the parking hassle.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4FvrM9S76kkP5u50G81Nhg"
  },
  "8JpAzaXTDfKaGQwCU8EchA": {
    "date": "4/7/2017",
    "text": "I came here with a friend on a beautiful Friday evening. It was really nice outside, so they had the windows open. People watching in Squirrel Hill while enjoying our delicious food was enjoyable. Our server was great and paid close attention to our needs. We started off with some fried shrimp rolls and crab rangoon- both were really good. I ordered the masaman curry as my entree. It wasn't the best I've ever had, but it sure was tasty. I really enjoyed it. Overall, this is a solid spot and I am looking forward to coming back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "ZwvIO494Ao3tOQSzPwWcmg": {
    "date": "12/8/2017",
    "text": "This was our last stop on the way out of town. We are so glad we found this little gem on Murray! The Mussaman curry and Pumpkin curry were absolutely delicious! Our waiter was very attentive. The music was nice and did not intrude on our dining experience. Food is all homemade and nicely seasoned. The sticky rice with pumpkin custard was yummy!  We look forward to coming back here on our next trip to Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P0ibqNxkPQFKQ8WVV-J14w"
  },
  "Rx3C-xKaV0_QngqVScmJ-w": {
    "date": "9/3/2017",
    "text": "I chose the green curry with spicy. But it's not so spicy and the taste was not so amazing. Because I was expecting it to be something really nice, as some friends had told me about it, I was kinda unhappy when I had it. But the whole atmosphere there was pretty nice, and the waiters were quite energetic. The only was that I didn't like the bill with the tip . It tells you how much you'd better offer, starting from 18%. But I honestly didn't think their service was worthy of 18% of tip. This was really misguiding.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2b2BZIZyaMQ5x8YiiKMHuw",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Sent it to my boyfriend and he said it looked just fine",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2b2BZIZyaMQ5x8YiiKMHuw/o.jpg"
      }
    ],
    "user_id": "uu3FJ1XY38rGPKGjosa6sg"
  },
  "feLwksH-MR9IpPSXKEn5Bg": {
    "date": "11/28/2016",
    "text": "Don't go to Curry on Murray if you are in a hurry. I mean, don't go here at all if you don't have the whole day to spend. The appetizers were good, we had the Thai Beef Jerky, Dumplings, Shrimp spring rolls and fresh spring rolls. All of these were pretty well executed but took half a century to actually get them.   The waitor was obviously new,nervous and stressed which stresses out patrons; All to which I say, chin up dude, be confident, you're doing just fine. The menu had a variety of dishes that looked alright but two of the three things I wanted and ordered were served ten minutes after i ordered them as a dissapointing \"we don't have that/those today\". That's fine for a chef's special, or a bbq joint that has limited supplies, but as a restaurant, you can't really bank on customers not ordering a thai staple mid-day.  So my sister gets her thai iced tea, filled about 3/4s of the glass and then our food came(about an hr after arrival). The green curry was decent but nothing special and was under seasoned for sure. It certainly needed salt and a  lot of it. That being said it wasn't BAD, it just wasn't anything to write home about.   The somewhat dissapointing meal ended in frustration as we were  a group of 7 and couldnt split the bill based on what we ordered, we instead had to evenly divide the bill into 7 equal-ish payments. So someone who had a $5 soup had a $20 tab.   It was the combination of poor/slow service, inconveniences and presenation that made the experience below average. The atmosphere isn't bad, but the food is served in cheap cheap bowls and dishes that just don't match the pricing, location or style of the restaurant.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "H5U7NJWU7pA3-xLQg70OFw"
  },
  "LgZEEhJIoPEYOaFMBDD5zQ": {
    "date": "1/9/2018",
    "text": "Eh.... This place was okay.  My wife got a lemongrass soup that tasted like fish sauce.  The green curry was mediocre and nothing really blew me away with our food.  Given the chance I would look for other food options in the same area.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0pQonPPPQM2LW1FbrVtOoQ"
  },
  "a9nuLxSNJ301c85XOwFYNw": {
    "date": "12/15/2016",
    "text": "Love this place even more!!! The server were nice,even the food run slow It still tasty",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R5o8SRfI3W9JWFFxW8x3Rg"
  },
  "hdGTJ9_ObcaBKIg1LJ7U1g": {
    "date": "10/7/2016",
    "text": "A friend and I came here on a Friday night around 8pm. The main part of the dining room was busy but we were seated right away. It became very clear from the beginning that only 3 employees were working in a restaurant full of hungry patrons on a Friday night. It took a very long time for the server to bring us water, and then an even longer wait to ask if we'd like to put in any appetizers or order food.   While we waited for our third dinner companion, we put in an order for the Curry on Murray trio, which consisted of two crab rangoons, two shrimp rolls and two spring rolls. The crab rangoons were a different take on the normal frozen treat you get in a Chinese restaurant and were tasty, though my friend didn't enjoy it. The spring rolls were entirely forgettable and most likely frozen. The real star of the show was the delicious smokey shrimp roll. I would order that again 3 times over and be happy getting nothing else.   I also ordered the fried dumplings which were akin to Chinese shumei dumplings with a ground shrimp and pork mixture inside. Shumei is my favorite, so these dumplings were right up my alley.   There was a solid half an hour between our appetizers coming out and our main entrees being delivered. Our server was most likely in the back helping the one lonely chef do the cooking, because they were nowhere on the floor for what seemed like a very long time between water refills (which were also few and far between).   Once our main dishes came out, the my curry wasn't piping hot but it was still delicious. My friend finished his pineapple curry and loved it, and our other pal loved her pad thai. I will give this restaurant kudos for not being shy with the shrimp--I had LEAST 8 in my dish which is downright unheard of!  I'd visit this place for takeout, but I wouldn't bother eating in and suffering through the slow service again. My friends and I were there for an hour and 45 minutes! That is way too long for what would have only been in hour in standard restaurants.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mLDC0DjkT2IJkoppBze4eA"
  },
  "xGfc4CYkRwDq_T02WyXlWg": {
    "date": "12/13/2016",
    "text": "YASSS this place was great. Its in a great area thats by a bunch of other stores and restaurants and when its warm outside they open up their windows so that their restaurant can get a whiff of fresh air. I was served by a nice young asian lady who was very attentive. Also the papaya salad is SOOO refreshing! please get it if you go!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jnF3B_ZihFP-Nu6t3IGF1A",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Vegetable pad thai- delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jnF3B_ZihFP-Nu6t3IGF1A/o.jpg"
      },
      {
        "img_id": "vwUSj-QyXJxqtfx4NNp6_w",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Papaya Salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vwUSj-QyXJxqtfx4NNp6_w/o.jpg"
      }
    ],
    "user_id": "uMVxyEHF-LdQwgQsyGdcWQ"
  },
  "VUEfhP727EFIVzh9Zey-Uw": {
    "date": "7/14/2016",
    "text": "Stopped in today for an early lunch.  Waitress was very friendly and helpful. I had an iced Thai coffee and started with their taro curry puff. My food arrived quickly and I really liked the taro puff. It was sweet and reminded me of the warm buns filled with sweet beans in Chinatown.  I took 2 home to enjoy later. My main dish was the Tom Yum Noodles with ground pork, wontons, fish ball, bean sprouts, peanuts and garlic oil. Very good but too large to finish.   I've heard great things about this restaurant and was not disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "DijviavD8wDr0uwtMkAZeg",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Tom Yum Noodles with pork",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DijviavD8wDr0uwtMkAZeg/o.jpg"
      }
    ],
    "user_id": "9RJ6bPuuSzq6VmIMO-Awag"
  },
  "SKCxVruKrB9Z4-E8vIRIXQ": {
    "date": "5/14/2017",
    "text": "They are the nicest people here!! I've never eaten in the restaurant, but when you call to place a take out or, they are always so friendly! The food is delicious as always ready quick. It's one of our go to staples.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "LBl11ZLZLSW1HfV6d3x43A"
  },
  "VwGVRFjYtVs0nQV3Mcn6yw": {
    "date": "1/29/2017",
    "text": "This place presents yummy desserts , taro puff is my favorite, black sticky rice as well. BBQ pork on rice or noodle are also bomb . They do serve real sticky rice, which cooked correctly way. That why i said \"real\". You can do it with grilled pork, it's yum .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MbccnjVKPsCItRdTFPPCnA",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Tender Chicken Satay  Yum  !!!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MbccnjVKPsCItRdTFPPCnA/o.jpg"
      }
    ],
    "user_id": "e_nyLaViP22TErKMX3DMiw"
  },
  "BNG_hm0gX1Y1GASSmJqOZg": {
    "date": "4/21/2019",
    "text": "Food was delicious. The day we were there, service was extremely slow buy it was Good Friday and maybe they were short staffed. Otherwise, it was a nice experience and I would love to return there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XWf6BfVZp5XJX4iJC19gSw"
  },
  "hA1DY6_S4ocASV2kWsaAoA": {
    "date": "6/30/2019",
    "text": "Still on the quest to try all Thai establishments in the Burg we landed in Squirrel Hill this past Saturday to give Curry on Murray a shot.  Street parking is relatively easy to find, at least in the late afternoon early evening hours.  The restaurant is spacious and probably could fit 30-40 people.  When we arrived there were just two other patrons dining, who appeared to be done.  Our server brought two glasses of water stat and handed us menus.  Good start.  We ordered quickly, I went with my usual Pad Kee Mao, spice level 5 (the hottest, or extra spicy as they called it), and we split an order of Tofu fresh rolls.  I asked for Thai Chili paste with the rolls and chopsticks.  After taking our order we waited.  It was actually a rather long wait considering we were the only people in the place waiting on food.  I used the restrooms while waiting and my feet were sticking to the floor as I walked through the place and in the restrooms.  I think it could have used a deep scrub.    Finally our rolls were served and I thought they were a bit on the, well puny side.  There were two, cut in half but really one half was taken care of in one bit. I enjoyed them nevertheless, but when our server delivered them she rushed to drop them off then left.  No Thai chili paste or chopsticks.  I had to get up and hunt her down for my additional requests.  I think it may have been a language barrier but I thought at least the chopsticks would have been a given.  She brought us some chili paste that sat in a very, very sticky carousel with a bowl of sugar??  Guess this came direct from the kitchen that is used to create the dishes?  I have to say I never ever saw that before, and I hope I never do again.  The paste added the spice level needed for the rolls.  Our entrees were served shortly after the rolls, actually before we were even done with them.  Timing wasn't our friend this day.  I have to say, reading about traditional Thai cuisines and making them, to the best of my ability, at home, I notice a lot of places take great liberties with their ingredients.  For instance my husband's Pad See Ew had baby corn in it.  My Kee Mao had al dente green peppers and cherry tomatoes???  Ok I have seen the peppers before but the cherry tomatoes were a first, and I can't say it added anything to my dish and was unnecessary.  All this was somewhat minor in the overall saltiness of both our dishes.  We sucked down the water with three or four refills.  Also my dish was not spicy.  I had to add chili paste to bring up the heat.  This is fine but if I order the spiciest level you offer I kind of expect a kick.  Lastly the noodles were a tad overcooked and mangled, but the tofu was actually really good and there was a lot of it, so bonus on the protein.    Overall I'm glad we tried it so now we know what we aren't missing anymore.  Not a terrible experience, just not worth a repeat.",
    "rating": 3,
    "rated": {
      "funny": 11,
      "useful": 25,
      "cool": 19
    },
    "photos": [
      {
        "img_id": "iTZHjKaBiEly8J2SHIR59g",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. A1. Fresh Roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iTZHjKaBiEly8J2SHIR59g/o.jpg"
      },
      {
        "img_id": "V30pNyCsdunrhkzuya9fHA",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. N3. Pad Kee-Mao with Tofu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V30pNyCsdunrhkzuya9fHA/o.jpg"
      }
    ],
    "user_id": "_5fx5gexi9OeZIuukV2gHQ"
  },
  "W0z466GKUTFSkdXxEqopCA": {
    "date": "3/2/2019",
    "text": "The dumplings and pineapple curry are two of the things I find myself ordering on each visit. I always say I'll order something else and once in awhile I do. The problem is that I like their dumplings and pineapple curry so much that it's all I can think about when someone says, \"Curry on Murray\". My brain immediately goes to what it already loves.  This was one of my fave places to eat-in and takeaway when living in Regent Square.   If you love Thai as much as I do then you're going to like it here.   Thai it, you'll like it!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "kyi1g_ehAos2Tr4NjbUS9A": {
    "date": "1/8/2019",
    "text": "Wow what lovely place to dine in for lunch! My meal was super yummy and came out quickly.   Walking into this establishment, I felt welcomed with a nice smile and a sense of culture. I love when restaurants transform your experience and make it feel like you ventured out of the country.   For my appetizer, I had dumplings which were deep fried. I was hoping for pan fried dumplings but they still were delicious, nonetheless. For my main course, I had chicken  curry which was yellow. I loved that they actually put a lot of meat and veggies in the curry broth. I paid this with white rice and enjoyed my meal.   This was a great place to meet for a lunch or dinner date.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NiNX6RKigjvxnPMsgJAXjw"
  },
  "ojV5t7IQCqDG0OmOTQUPcQ": {
    "date": "9/30/2018",
    "text": "Solid thai restaurant! Portions were great and the food tasted great! We had vegetable spring rolls to start which were small in size but fresh. I got the tofu green curry. I thought it looked a little watery but it didnt impact the taste. There were a good amount of veggies. My boyfriend had the extra spicy pork pad thai which was super tasty and fresh, with plenty of meat. I'd come back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3mxTf8wx0R9Y0t-AI9D31w",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Pad thai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3mxTf8wx0R9Y0t-AI9D31w/o.jpg"
      },
      {
        "img_id": "9NW6bW70FhGNHkDaBEhsPQ",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Green curry",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9NW6bW70FhGNHkDaBEhsPQ/o.jpg"
      }
    ],
    "user_id": "4CqAjkbOyNChaRki9q8v9w"
  },
  "YKDOVVN5xEFeIZd7G1vibA": {
    "date": "3/24/2018",
    "text": "I came here for dinner on Saturday night. At 6:30pm it was suspiciously empty. Nevertheless the food was quite good! I had the pumpkin curry, my friends had the pad Thai and the panang curry. I think the pumpkin was the best. They music they played here was Top 40 from about 5 years ago, which was a little odd. To quote my roommate \"they have better song choice than Tequila Cowboy\"  This staff here is all very friendly, but they seem quite young. It took a really long time for our check to come (and the restaurant was pretty empty). It would have been 3 stars because of this, but when they brought the check, they also brought us a MOUNTAIN of pineapple candy, yum!  Overall, decent spot.  I wouldn't come out of my way to go here, but if you're in the area it's a good option",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6dshynaeRV-oZhRPgKazHw",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Pumpkin curry, delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6dshynaeRV-oZhRPgKazHw/o.jpg"
      },
      {
        "img_id": "adJ1R7kc_AxAVBoGGML-xQ",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Pad Thai, good not great",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/adJ1R7kc_AxAVBoGGML-xQ/o.jpg"
      },
      {
        "img_id": "PQoNdlRWBWwgsNJXPGv1cQ",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Pineapple candy after the meal!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PQoNdlRWBWwgsNJXPGv1cQ/o.jpg"
      }
    ],
    "user_id": "YhKdhoEhxD8A7ldxdhPPOw"
  },
  "OKB0hJ2WeMrvRTBors1PNA": {
    "date": "8/26/2018",
    "text": "I've gotta go with 4 stars for Curry on Murray.    Tonight, my girlfriend got the Panang Curry on Rice and I got the Pineapple Curry on rice (both with chicken) and we split the Crab Rangoon.  It was an excellent meal all around; we loved all the food and are super excited about our leftovers for lunch tomorrow.    I only go with 4 out of 5 stars because it seemed like they were a little understaffed tonight and the service was a smidge too slow.  That and it's honestly just really hard for me to go a full 5 out of 5.   Curry on Murray gets a strong recommendation from me (and the girlfriend) for sure.  We'll both be back to get more tasty food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6LK8019L37_snmMv0UkvBg"
  },
  "bGwfsEKaUARNvGucfGeSsA": {
    "date": "3/18/2018",
    "text": "The foods here are great. We had a Kra-Poa, Green Curry, and the  Lemongrass soup. The Lemongrass soup is good, not too sour, but not tasteless. The Green Curry is creamy and it came with a great amount of veggies!  The Kra-Poa has a lot of veggies too! But I like the green curry more than the Kar-Poa and feel like a bowl of ice rice wasn't enough!  The time we went was on Sunday 1pm-ish, the restaurant was fairly slow so we had our food ready pretty quick.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9BmCXog4oJ9wsTNgRgaRrg",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Lemongrass soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9BmCXog4oJ9wsTNgRgaRrg/o.jpg"
      },
      {
        "img_id": "fo-HxzyM2eQWmcU78bGriQ",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Green curry with chicken. Recommended!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fo-HxzyM2eQWmcU78bGriQ/o.jpg"
      },
      {
        "img_id": "DCkWBHd5E36pU6ffLdJgGQ",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Kra-poa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DCkWBHd5E36pU6ffLdJgGQ/o.jpg"
      }
    ],
    "user_id": "Bz9Hddcu2Hu0h3FArKfDGQ"
  },
  "ybGTY6rslMW6SIVZPKvGYg": {
    "date": "4/19/2018",
    "text": "On my expedition to find the best pad thai in SqHill my stop today was at Curry on Murray.   I have actually eaten here twice before. One of the best things about this place is the seating in the summer. They open up the large windows to the street so it's almost like sidewalk seating.   Back to the take out pad thai though. I would give this dish three stars. The overall dish was decent but the chicken was over cooked in my opinion. This left the noodles and Thai flavors doing all the heavy lifting. Despite that it was a decent pad thai. Not the best, but certainly not the worst either.   I can say that the other two times I've been here that the food was good as well. Nothing to write home about, but good.   The service has always been extremely friendly and courteous however. So for a summer spot with good service I would say it's worth it!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "CIKD9oMj-qTZ3zDdgFW5_Q"
  },
  "rFKOpwLoOuoSgOXOctQ3Iw": {
    "date": "8/3/2019",
    "text": "We usually get some decent food from Curry on Murray, but recently the quality has declined drastically. My latest purchase of Pad Thai is inedible. Just wasted my money",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E-hptVr_8VfHNUg2OmBRwQ"
  },
  "CZtx7n_Vbw6hH_JCcp3aJQ": {
    "date": "8/18/2018",
    "text": "Curry on Murray indeed makes one of the best curries on Murray, and within Pittsburgh. The menu is not expansive, having some standard Asian style appetizers, noodle dishes, and a few chef specials. It's a quaint little restaurant with a mom and pops feel, modestly decorated. All of the staff have been incredibly kind and appreciative of your presence.    My green curry had an ample amount of fresh and crispy vegetables. The chicken was cooked nicely, tender and not stringy. The spice mix is excellent. A 4 of 5 was hot enough to be enjoyed by a pepperhead and balanced enough that heat was not the only flavor in the dish.   I think the atmosphere being so humble and the food being so exceptional is what continues to bring me back to this place.  Without pretense they deliver amazing food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "MxtSFV6xXAh24Bljz7DmRw"
  },
  "76BzXtuiLlDsWU8fz9A8RQ": {
    "date": "3/10/2018",
    "text": "Just okay. Pretty run of the mill. For Thai food, I rather go to Thai noodle outlet in squirrel hill, or Nicky's Thai food downtown.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wRYZBUtTKRxYpw45vt3fRg",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. One take out order of chicken pad see ew and pumpkin curry with rice. $23.52",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wRYZBUtTKRxYpw45vt3fRg/o.jpg"
      }
    ],
    "user_id": "TqnFxFHEOvaGea9Lzn7wqA"
  },
  "RGbt6S5fvyOeipwTaEllKA": {
    "date": "7/13/2017",
    "text": "I've been here a couple times and the curry is pretty consistent and good! I've tried the green curry fried rice, pad see yew, and pumpkin curry. Their curry is definitely the best of their menu. The pumpkin curry is a definite go to on their menu! The first few times I came here I got the green curry fried rice but the most recent time I came, it tasted less curry-like. Most of their curries are pretty sweet but not too overpowering spice/sweetness-wise.  The service here is a hit or miss. For the first few times it was decent but the most recent time I came it wasn't so good. We were the only customers in the restaurant but the waiter (seems like he was new) was shaky on taking our order, messed up one of our orders, and it felt like he was kicking us out before we finished our meal.   tldr; food 3.5/5 service 3/5",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QTT8drc_pR_kEANUxU-UVw",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QTT8drc_pR_kEANUxU-UVw/o.jpg"
      }
    ],
    "user_id": "i2HY1rVGbwC5grXzzbPZdA"
  },
  "gjeT4SJ3cSrO8a0-L8L2UA": {
    "date": "8/18/2018",
    "text": "Pittsburghers, blessed with dozens of delicious Thai choices, might find it difficult to weed through the best eats. Curry on Murray--new to me but certainly a staple in both the Squirrel Hill neighborhood and the overall Thai food scene--does not disappoint. I've tried my two favorite dishes (pad see ew and pumpkin curry) during my visits. I judge Thai restaurants by these two dishes, to see how the restaurant handles spice levels, noodle preparation and overall quality of ingredients. Their spice scale is accurate and perfectly fiery (if that's what you're in the mood for). Produce is always fresh and crisp. Noodles have both bite and give. My only critique of the food is that they seem to be using a cheaper grade of rice, with lots of broken grains. Parking may be difficult for those not used to street parking.  But, these are minor issues, in no way reflective of my star rating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "CY6lp940-sDh9ADneg6YhA",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Pumpkin curry with tofu; Mr. B. Bending Rodriguez.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CY6lp940-sDh9ADneg6YhA/o.jpg"
      }
    ],
    "user_id": "JjL_6gsWE_czz4YE9UvTxQ"
  },
  "QERWK9OajF9EHoYShRIb3w": {
    "date": "6/23/2019",
    "text": "If you want good Thai food this is not the first place I'd choose to go. From the 40 minute wait for our burnt appetizer to the taste in the meal it was not worth the wait. This isn't my first time eating Thai food either, this just was not good. Leaving unsatisfied and looking for another place to eat.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YwKXRkOEphXg6Q7e2tl2Og"
  },
  "OqLMUk9PvNbrUC6aEmDDpw": {
    "date": "6/9/2018",
    "text": "Absolutely delicious!  I had the Pad Thai with chicken.   My daughter had Yellow Curry with Pork.  Both dishes were extremely flavorful.  One of the best Thai places so far.    The staff was also very pleasant and attentive.  A+",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "2nQknDUNwsPuVjxwJms4iw"
  },
  "fQ9s9wjTXuC6OGxnNNAqhg": {
    "date": "4/17/2018",
    "text": "Went around 6pm on a Sunday. The service was good and the food was exceptional. I got to try the yellow curry with no spice and panang curry with normal spice levels. Both were great but I think the normal spice really brought the panang to a higher level than the yellow.   I would definitely go back if I was ever in the mood for more curry.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IX7OVpyYNWpgcO170uvydw",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Yellow",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IX7OVpyYNWpgcO170uvydw/o.jpg"
      },
      {
        "img_id": "ZgReGUIZm1i0Wb95lM42ng",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Panang",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZgReGUIZm1i0Wb95lM42ng/o.jpg"
      }
    ],
    "user_id": "qZeh_8N7YHosWTmEHkrypA"
  },
  "3iGjdxqXOYwN4MUaJzrfqw": {
    "date": "11/14/2018",
    "text": "This is absolutely my favorite Thai place in the area, unfortunately the service has gone extremely down hill since they hired their latest employee. I don't know her name, but you know her because she can be defined as incompetent. The food is fantastic and until recently I have not had any issues here. I called to place a pickup order, and the lady was actively arguing with a customer, while on the phone with me. She asked me to repeat my order three times because she was too busy arguing with that other customer. I showed up 15 mins after the call, which is when I was told the food would be ready. I went to the register to try and pay and was told that I needed to be seated. I clarified that I was picking up, and was told again to be seated. I waited in the chair by the register for another 20 mins. Finally I go up again and ask to pay, she acts as if shes never seen me before, and says my food isnt ready before even asking my name or my order. I told her anyway and she turns around and looks at the shelf where my food is sitting (and has been for the past 8 minutes) and says \"oh here it is.\" It seemed another customer was having an issue the same time as me as well.   TLDR: Fantastic food. normally excellent service, something needs to be done about the abysmal service of the new staff lady as she is completely incompetent and extremely rude.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QB1b1MUtWAbQskV3UxcP0Q"
  },
  "XNxQ4f8pd4JejLoF7nop_w": {
    "date": "8/14/2017",
    "text": "Very friendly staff! Food was good, but not out of this world. A solid Thai restaurant.  Accidentally rolled in to Curry on Murray at 2:45 (they close at 3pm before dinner). The hostess was extremely friendly and said it would be no problem to order something to-go. Got the pad thai vegan style (no egg or fish sauce, with tofu) medium heat. Honestly was still very mild in flavor, but it helped to have the nuts (walnuts possibly?) in the dish to bring on a nutty, not overpoweringly sweet flavor. Generous portion of tofu as well, and solid portion size.  Wouldn't go out of my way for this place, but a solid choice along Murray. Thanks!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "trNxpMN7NtN5vAuk4HmUQA",
        "caption": "Photo of Curry on Murray - Pittsburgh, PA, United States. Pad Thai to go, around $11.50 at lunch",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/trNxpMN7NtN5vAuk4HmUQA/o.jpg"
      }
    ],
    "user_id": "l91OHfTqmmYPbelgEkTSgw"
  },
  "elUlwcWcxQkLXfvzUSxHYg": {
    "date": "3/24/2019",
    "text": "Curry on Murray has excellent food, quick service, and a hard working, attentive, and kind staff. They even package your leftovers for you and give a very gracious \"thank you.\" This was my first experience with Thai curry, but I can't wait to try it again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DqEw8buLookCOwUTs08HEw"
  },
  "4wB5OERJdW6gEpVn33p59g": {
    "date": "6/16/2015",
    "text": "I got delivery from curry on Murray for the first time tonight. While the green curry fried rice is delicious, the massaman curry confused me to no end. It was literally a container with sauce and an uncut potato in it. One potato. Clearly not cooked in the sauce but boiled and plunked in a container with sauce. No vegetables or peanuts, just a potato. While the sauce is nice, this presentation is really unappealing and makes me too aware that I was just charged 12 dollars for one potato. Will stick to rice or noodle dishes from now on.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xgR77fqKHpNsOo1xHT27Ow"
  },
  "56JrUbp_tvdAwCvLt4mggw": {
    "date": "9/11/2012",
    "text": "Thin coconut / tom kha soup. Chicken pad thai was good but i had to add more hot pepper flakes after i requested it be very spicy. Overall, mid-grade Thai food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ekUMPGWf4QB5uj6yAvGIw"
  },
  "HAda8Ra_jHFhAhYBWlbvIA": {
    "date": "6/10/2015",
    "text": "Neat and clean decor with a nice window view onto Murray Avenue at Curry on Murray.  The Pad Thai I ordered was quite good with plenty of fresh veges and just the right amount of heat as I had requested.  Not the absolute best I've ever had, but I would eat here again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dQOXNwFCuwqqNEIUFlg9UQ"
  },
  "qyXqhpIcBvFlrhWJeUWAow": {
    "date": "5/25/2015",
    "text": "I finally tried the curry and it was excellent, changing my former opinion of Thai curry.  I've eaten here a lot over the past 3 years and been consistently pleased with the food and service.  I will miss it after I move.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mrwK_QvWfhIJ5hZJni_UoQ"
  },
  "evN0Gozv_K-lQ4p-KDl3oA": {
    "date": "5/19/2015",
    "text": "I really wanted to like this place.  It looks really nice inside and the wait staff are warm and friendly.  I ordered a curry chicken dish here recently and it was not the best.  The sauce was really good, but there were no veggies in the meal, and the chicken was tough and dry.   I may try it again to see if I just went on an off night, but I was not impressed with my meal.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K19BaP1TS5_ojYV5raTLGQ"
  },
  "KVaD1EGZ2a9z0X-OEiPBag": {
    "date": "8/29/2012",
    "text": "The green curry here is my favorite dish here for which I always request steamed tofu.  The spiciest level is perfect for the dish and the curry has been consistent each time I have tried it.  The prices for lunch are cheap and almost double for dinner although it is still reasonable.  This restaurant is a staple of mine while I'm in squirrel hill, although thai places abound in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zAzCOnCSS1DiceIWXKQQWw"
  },
  "vXaV0Vu0WrsT-h49z8TFAA": {
    "date": "8/20/2014",
    "text": "Love the pumpkin curry, mango salad and the mussels on coconut sauce. How can you go wrong ? You can't. Great price, nice service and byob!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vn9ixvK7Fv0BQP7uA0N9MQ"
  },
  "zTiKYtJcmJJ2sNkUhQ-_eA": {
    "date": "6/12/2012",
    "text": "I really like this place...  A quick visit to the website will describe a lot about this place and the passion/vision of the restaurant and its owners. This is very fresh, very authentic, very delicious Thai food. The restaurant is clearly in its very early opening stages. What is refreshing about the experience is that they are open and transparent about the fact and they will take the time to address the obvious kinks and give you the exact date for their resolution. Their (currently) limited menu is sure to point out that it's a temporary menu being offered only until their Grand Opening which is yet TBD. The ambiance was relaxing yet lively and vivacious. I was there for lunch and groups of people seemed to be enjoying themselves immensely and highly complimentary. I was immediately impressed by the menu; it seems as if someone identified all the best Thai dishes around the city and put them on one menu. I had the shrimp Pad Thai (which i believe should be the starting point and litmus test for any new Thai food experience), the shrimp were perfectly cooked, fresh and incredibly seasoned. The garnishing of incredibly fresh and crunchy bean sprouts along with the light dust of Thai seasoning added excellent texture and depth to the dish. The incredibly fresh green onion slivers added beautiful color and a sharpness that complimented the sweetness and spiciness of the dish perfectly. In all i found both the experience and the food to be fantastic; this notion was only exacerbated by the cordial and personal interaction of the manger (which btw is the tried and True key to long-term success on Murray Ave.) and the resourceful and friendly wait staff.   For those looking for a great new place to try and fantastic, authentic Thai food, Curry on Murray is a must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zt5vuWqtu48d6OgAP4BYWQ"
  },
  "-CsgykZGWhnBz4OCU-QaDA": {
    "date": "1/10/2014",
    "text": "First I'll start off with the good.  The atmosphere is nice, \"Thai colors\" not overly crowded,  semi-formal but comfortable.  There was one waitress working and one gentleman who I think was working in the kitchen helped outside.  They were both very nice, pleasant, and provided excellent service. The fresh spring rolls with tofu were wonderful, fresh tasting, and came with one of the better dipping sauces that I've had at Thai restaurants. The \"Coconut Soup\" was very disappointing.  There was no hint of Kafir Lime leaves, or of Galangal.  It tasted like chicken stock with light coconut broth and chilies, nothing else.  This is one of my favorite starters and I was taken aback by it. The Pad Thai was pretty good, although didn't come served with a lime wedge.  I asked for one, but was told they don't carry limes. The prices are a few dollars less than many of the other Thai restaurants in the neighborhood.  From working in restaurants for about 10 years, I summarize that they have potential to cook great, tasty food, but perhaps need to increase the prices to buy the ingredients necessary to properly cook the dish. Cutting corners is never a way to be a successful restaurant.  Charge whatever you need to, make the menu items properly, or don't offer them.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VQ_-F9T_zf-vxz7pptgSng"
  },
  "xeIKhQR92G3pyQHW5GWhcA": {
    "date": "1/16/2015",
    "text": "Good service, friendly. Got massamum curry both times, good flavor but the chicken was fairly dry (it comes in large chunks so it is possible to tell even though it is in a curry) one if the times I had it. Will go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FTCamTIwPn053KP6MDyb8Q"
  },
  "-9mx6oh6FkMeG9tYrPZOCg": {
    "date": "8/18/2013",
    "text": "This is a terrific place. Mind you, we've only had lunch there once, and had shied away a bit because my significant other doesn't readily warm up to Thai food. It is very nicely appointed, clean, nice colors, photos on the wall, pleasant and comfortable ambience. The lunch was great, soups wonderful, appetizers to kill for. There is a mix of 3 appetizers that includes the best crab rangoons we've had yet in Pittsburgh, or anywhere else for the matter of that.  Lemon Grass soup with seafood was zingy, tasty, and filled with fish and mussels, shrimp, and scallop. Ditto the wonton soup, not your usual, tasty and packed with good stuff. We both warmed up to his place righrt away. Heading back for dinner in the near future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hEWqqxDfIdANbG00R9auAA"
  },
  "g1kFGCRVu5GT2CD1WYncEw": {
    "date": "4/12/2014",
    "text": "Solid place overall. Happy with my experience.  I really enjoy their pad thai - extra spicy.  Always very quick service.  Their take-outs quality is just as good as dine in. Great place to pick up food on my way home from work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnNAYd7tKwdxHt7UuwcErA"
  },
  "Zy3y3XePe1tXS9zgDJGW1g": {
    "date": "5/6/2014",
    "text": "Delcious! Great service! Get the curry trio.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kv_uoXtTgUDf4eewg-kmIw"
  },
  "9rxN31L3Lg0rw5Q22DmMmw": {
    "date": "8/27/2014",
    "text": "Most flavorless fried rice I've ever had.  Admittedly, I didn't choose an exciting thai dish but figured for my first time, I'd get something simple to go.  Bad choice.  No flavor.  Dry.  Was looking in my office for a packet of soy sauce or something to put on it.  Bad enough that I wouldn't risk going there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4y3C9Mml09FzFk6rq6_g2Q"
  },
  "AGtBofqpDTeq14knN_mX-w": {
    "date": "7/25/2012",
    "text": "1st of all...I had high hopes that this place would be good since I had been to another of their restaurant in Swissvale called \"Curry Away\".  However..this Squirrel Hill location was the WORST Thai I've had in Squirrel Hill. I was highly disappointed. The food was only Ok, I cook better than that(Sorry, I am from South East Asia)...and the service even worse.  No menus for 10 mins after been seated...the server said she did not even know where the menus located... They seated us next to the door, a  large table & was not comfortable to sit at all---table is too low!!!!! The postcard said free dessert & none was served.  We ordered Massaman curry which is just ok, Pad SEE-EW, & Crispy Chicken with nuts...the last two dishes which were probably two of the worst I've ever had, the portion was so small for $11.00 and white serving dishes is absolutely not very presentable. To me its Americanized Thai foods...not authentic at all. We all was very disappointed.     Overall a very disappointing experience.   :(",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aqs3626l7gnZXBxKo81ckA"
  },
  "0vA4Z4R1D7tXUNfmcL9RvA": {
    "date": "5/14/2013",
    "text": "I had the pumpkin curry, which was good.  As one of the reviews above mentioned there's no grade inflation in the spiciness scale--I asked for my food \"spicy\" and it was definitely an eight out of ten on my personal scale  The actual reason I'm leaving a review though is that I forgot my phone on the seat after the meal and the server ran three or four blocks to give it back to me, which was SO nice and really above and beyond the call of duty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xsMB6iTDLlZ-OJDVSVu-ng"
  },
  "Y0S50buMtIvhDqRh6C9JNg": {
    "date": "2/25/2013",
    "text": "This is an ok thai place. The ambiance, decoration, and layout of the restaurant leaves something to be desired, but I think that is because they opened relatively recently; hopefully with more patrons the place will get spruced up. The service was very friendly and attentive, which is always nice. Their food is far from the best in Pittsburgh, in my opinion, but it is certainly decent.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7DGhXqgZsbC18jCXOwXYWg"
  },
  "9qrYnL_5z6kJR3yFUJDlXQ": {
    "date": "11/5/2012",
    "text": "Definitely enjoyed the pumpkin curry.  The service was quick and friendly.  Thai in Pittsburgh (along with most non-American style food) generally is a little more expensive for whatever reason.  That being said this was definitely as good as most of the other Thai restaurants in the Pittsburgh area I've been to.  I'd say it's not as good as Nicky's but probably as good as any of the ones in Bloomfield or Sq Hill, but only basing it on one dish really.  The noodles didn't seem like anything out of the ordinary so try and stick with the curry.  Will go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yh5dY4ipOR81DoYSJcnoww"
  },
  "_xcdc1UR_BF2DhGMKitcgg": {
    "date": "2/24/2013",
    "text": "went there with 2 friends.  we got DELICIOUS spring rolls, the THIN pad thai (we asked for a 3-4 out of 10, came out very mild), and 2 curries (the base is \"medium\", which is very hot).  tasty food all around (except for the spice levels); the think pad thai was tasty but clumpy--i'd recommend the regular pad thai.  the staff is GREAT!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-flr1ocoNk_WXX2C0MfaHQ"
  },
  "XyyqQEOr5Gu5CI5B9-u78w": {
    "date": "11/30/2012",
    "text": "I was finally here earlier in November after wanting to try this little place for awhile.  Our waitress was very attentative and helpful, even bringing out a wine chiller for the bottle that was brought.  The appetizer (some trio of spring rolls, rangoons, something else) was nice, and my entree of pad kee mao was delicious.  Spicy food in restaurants is never spicy enough for my weird taste buds so it was nice when the waitress brought out a tiny bowl of additional spice for the meals.  The prices seem to be usual for similar places around here, and the portion sizes are similar as well, if not slightly smaller (very filling for a meal, just no lunch the next day).  All in all it was a great experience, and I'll be back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LjcjeshLcGHcfFplTRkwjg"
  },
  "29avxcmoNPW3gVZdErxbrA": {
    "date": "4/26/2016",
    "text": "Stopped by here for an early dinner and was very pleased. New to Thai food, so asked for recommendations and the waitress was happy to oblige. Very attentive service - our waters were refilled several times throughout the meal. The restaurant wasn't very busy as it was relatively early, but there were about 4 other tables being served at the time. Appetizers and entrees arrived in a timely manner. The sampler tray of rolls we ordered as an appetizer were delicious with delicate wraps. Entrees were equally delicious. Had choice of \"spiciness\" for each. It was a warm day and we chose to sit next to the open window and had a nice view of passersby and ongoings. Will definitely return on another visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ukF6eX70533NC9RPR0nwRQ"
  },
  "yPSrtKbd8HLCGsn8-dqdxg": {
    "date": "3/15/2013",
    "text": "Here I am on a generous day giving Curry on Murray three stars. I am one of those clueless people who thought for the longest time ever that the place has indian style curries. Surprise surprise: they're thai! It seems like the place is family run and that in itself is adorable. The service was great with extra care for making us feel comfortable. The food had a lot to be desired, with sauces that were on the sweet and sour rather than savory style. I'm hoping they progress towards simpler dishes with fewer ingredients that don't get jumbled up into one hot mess of nondescript curry.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "VwAhjZPN7zJuyG03P8mp_w"
  },
  "3tsKQfOK5UaptcwoIhrQeA": {
    "date": "12/9/2013",
    "text": "The place looks alright but the food is horrible. I ordered this pad Thai and my noodles were hard.. Like seriously. & the guy wondered why I barely ate it then take it home. Shit, it tasted horrible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MDMnWk5tEzZuZEFQfJFrKg"
  },
  "llnlSw9uboMgc4p569IV2w": {
    "date": "9/19/2014",
    "text": "The decor & open air dining atmosphere was perfect for a September evening. We were greeted & seated promptly. We started with the tofu fresh rolls which were delicious. We ordered the Chicken Pad Thai & the Pad Kee Mao for our entrees. They came out looking fresh & the temperature was just right. The flavors of the Pad Kee Mao were wonderful.  The Pad Thai was good but lacked the usual robust flavors I've had elsewhere.  It was our 1st time & think it may be our last.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "msBSUVBB1GCgb72uINjsCw"
  },
  "MmfF3QMMhvrOUEGaN5qDaA": {
    "date": "5/19/2014",
    "text": "Highly recommended! Great atmosphere, serving staff was very friendly, and the meal was prepared very promptly. Overall a great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WAGSvnVE40Jcvq7ewMGjmg"
  },
  "hmgMJ0q_JoXCbq5OsLmntA": {
    "date": "7/19/2015",
    "text": "The owner was kind enough to offer a certificate to fix the rice being left out after finding my review on Yelp. She was very kind about the everything, and I really appreciate her checking reviews.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UcwzDDDK4dElIwBLTH4UwQ"
  },
  "S_-s4lyY8DO2VO15MvKTyQ": {
    "date": "12/5/2012",
    "text": "I went with a friend for lunch. Cost us $15 each for a lunch special, soup and tip.   Seated and served promptly. We both felt the food was tasty -- I felt the food was very good, he was not as enthusiastic, so I averaged my 5 and what I felt was his 3. My food (coconut soup/tofu and green curry/chicken) were both very nicely seasoned and very flavorful.  Some have mentioned about value for price. In my case, it was about $6 for the soup, $7 for the green curry and $2 tip. I think you can make the case that the soup is way over priced (it was a simple cup, not one of  those gigantic sizzling rice soups you sometimes get in restaurants.)  The only other comment I'd offer is that the spiciness ratings may be set for low American expectations. I ordered spicy and he ordered medium. He commented that he could not detect any spiciness while I had a moderate amount. Certainly nothing that I'd rate as spicy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "-nhWu31FzTqS5fZ7c8-ZFg"
  },
  "dVszW3p7uF6U5ajGcluilw": {
    "date": "2/8/2016",
    "text": "Very delicious food and relaxing atmosphere. You can tell they are not a chain or mass produce their food, it tastes fresh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AhEC08e19X-QCX3-7nHs3Q"
  },
  "4IVCRuD8vJSOMHsRIM_AvA": {
    "date": "10/15/2012",
    "text": "I recently posted a review of Curry on Murray, affording it three stars and praising the food and the service.  I prominently noted in the review, however, that the restaurant is a poor value, and indicated the extraordinary value that is offered at a restaurant like India Garden, with its enormous and top-notch lunch buffet, for which one pays a mere $8.49 per person with website coupon.  My Curry on Murray review elicited the following response, obviously from the owner, who misinterprets my comments:  \"You must really hate us to have the exact review copied over to many websites.  I'm sorry.  There are reasons  we don't quite see Thai or French restaurants serving buffet.  Among them are perception of food and difficulties business-wise.  I hope you understand.\"  I posted the review at this site and another, as I want potential diners to have my thoughts available to them before dining here.  That is the purpose of such sites. How can a three-star review which praises the food and service mean that the reviewer hates the restaurant? Three stars, after all, means \"A-OK\", per Yelp. I did not indicate that Curry on Murray should offer a buffet.  I merely point out the stark difference between the value that is offered at a restaurant that has a buffet and the $40+ that a modest size meal for two commanded at Curry on Murray.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "j1jXmA4__4UWIplZk6MJMQ"
  },
  "6WbOxuC9yqcyDOBHhCkYcA": {
    "date": "11/5/2013",
    "text": "I love the food my favorite are the dumplings and the fresh rolls. I also love the crab fried rice. The service is excellent",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eT6WFUnqbYDHOwmspIbbhA"
  },
  "A4NwjnFK5-TZKknAW9OqMw": {
    "date": "6/11/2013",
    "text": "The only reason I am giving Curry on Murray four stars instead of five is because I got takeout, so I can't judge the service.  However, the food we did get was just excellent.  We tried the crab rangoons, the chicken satay, the chicken massaman curry and a pumpkin curry with shrimp.  All that was very good.  But the chicken larb...oh my god.  I would go back just for that.  And I plan to.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VhoIk9JvdhFWU__qneieOA"
  },
  "OyDwJa7nRyokoVe3HalCmA": {
    "date": "2/18/2013",
    "text": "This is a cute little Thai restaurant, which surprised me because for some reason I thought it was going to be an Indian restaurant! It's a good thing I like both Thai food and Indian food. The wait staff was friendly, and the restaurant seemed clean and modern. On Friday and Saturday nights they have live music while you eat which was a cello and guitar duo the night we were there. I tried my standard, chicken pad Thai, which was good although not my favorite in town. My dining companion got the green curry with tofu which was one of the better ones I've had in town. All in all, a good experience and which places it in the top three Thai restaurants I've tried in Pittsburgh. Although I've only tried this location once, I will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ZZNOoMQ7WFvFoxDUFw1wg"
  },
  "U8bLXQnhiwpBREDxLgobww": {
    "date": "9/20/2012",
    "text": "I was, at first, skeptical about Squirrel Hill getting yet another Thai restaurant, but Curry on Murray manages to differentiate itself from the other great nearby offerings.  The style of curries is a little different, and the appetizer selection adds an extra dimension.  Everything was well-executed and tasted good.  I found myself particularly impressed by the presentation of the dishes.  Artfully arranged and brightly colored, it was the visuals as much as anything that made me excited to dig in (and perhaps broke the tie between 3 and 4 stars).  A friendly staff, pleasant even when dealing with some very rude customers two tables over, rounded out the experience and made Curry on Murray worth revisiting.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "D-_yG-XuT_-gf3six6a7mg"
  },
  "Ij4ZA22fJjuPBe8R1t0IqA": {
    "date": "7/15/2012",
    "text": "Curry on Murray is a brand new restaurant that just had its grand opening on July 12, 2012.  They now take credit cards.  The food is quite good, but when there on July 14 we had to wait for an hour before our food arrived.  When I asked why it had taken so long I was told it was because the kitchen was backed up because they had never had a full house before.  The live music was quite nice and was a relief from the canned crap that most restaurants blast at you these days.  Even when the entertainers wrapped up and left, the canned music at Curry on Murray was pleasant.  I hope that once they have been open for a while the kitchen will be able to prepare food with a much shorter wait.  During our first visit there before the grand opening when there were only a few occupied tables the service was much faster and the food was excellent.  When full the restaurant is a bit noisy because the walls and floors are all hard surface.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ubHJkR5T33_C3izRvdxKTw"
  },
  "h6cSZdB8oKsSR9yPD93pnQ": {
    "date": "10/31/2013",
    "text": "The atmosphere in this restaurant was romantic and peaceful. We went on Thursday night, and there was only one server. She maintained a calm demeanor, though she had a lot of tables, and she was very attentive. The food was delicious, and the portion size was adequate.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gP0ssVYaIFX5miYWrMllZA"
  },
  "EHdY97XMNjPoA0iAjYfpRw": {
    "date": "1/14/2013",
    "text": "We tried curry on murray last week and were sadly disappointed.  The rennovation from sababa did little to improve the space - it is still very sterile with lots of hard smooth surfaces which do little to lower the noise level.  More importantly, the curry's were lacking in flavor.  We had both the green curry with tofu and the pumpkin curry with duck.  Both were disappointing.  We started with the papaya salad which we ordered spicy - and it was - but the only spice content was heat - no flavor.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lNQ_QIvQZZZmGnHkbitIwg"
  },
  "j50OK6fEh0xgU6NfkXYUAg": {
    "date": "8/1/2012",
    "text": "I'm making my way down the curry menu and I haven't found a bad one yet!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "g2ksH3FYdQwHQI82NATZgA"
  },
  "bGDtis9_MPGIBjtr8JXLpA": {
    "date": "8/22/2012",
    "text": "I find the food here is good.  The curries are all very tasty the pad thai is also good i had the pad sew ew it was not very good very spicy with little taste.  However i would eat the curries again and the service was great plus the have live music on the weekends to make it a very enjoyable fun place to eat.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gSUU4Kq_Xm09cnmBkqj8Ag"
  },
  "l1e-mnIdnRHCx6dm7jXYHg": {
    "date": "7/1/2012",
    "text": "The best Thai food in Squirrel Hill, in my opinion! We had fresh rolls with tofu (with delicious peanut sauce for dipping), and I got the Pad See Ew with chicken, which was delicious. I ate almost all of the very generous portion! My friends ordered various curries, which were also great. I tasted the pumpkin curry, which was awesome! I've seen that on a lot of Thai menus, but never tasted it before-- it was great! For dessert we had mango sticky rice, which was just perfect. I am a huge mango fan, and the combination of the perfectly ripe mango with the sweet rice was just.... yummmm. The service was also fantastic! Our waitress was friendly and efficient, and the owners are very friendly as well. You can tell it's a family business, in the best way possible. Currently they are in a pre- grand opening phase, so they are only accepting cash and have a somewhat limited menu. However, we were told that the grand opening will be July 12th, and by then they will have expanded the menu and will take credit cards. Also, with any luck they will have live music on grand opening day, so it should be a really nice event! I know I'll be back then. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JEszsIpnQ2prCwWx7WuYWQ"
  },
  "rmlWGXeLtQAV7X8hPMJefQ": {
    "date": "1/12/2013",
    "text": "Pad thai was very good. Portions are slightly smaller than those at most Asian restaurants but still a fair-sized meal. Service was very reasonable as well. I would definitely return here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DvX2Cb2yxVuOfpmLEXI_Uw"
  }
}