{
  "30cYUWod7X1NqpP1zAuA5Q": {
    "date": "9/23/2016",
    "text": "I've eaten here twice. The place is quite and nice inside. You can park in the lot next door so no issues. The food is always excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2S2HYVNwCIBRESeMkJjjA"
  },
  "4HLPkIjQyr3WFeQkZ2lWUQ": {
    "date": "7/5/2015",
    "text": "Cute place for a nice dinner. Reservations were not difficult to make for a holiday weekend. We reserved a table for a party of 7 around 7:30pm with no problems. It was Fourth of July weekend so the place wasn't really packed.  We started with Brussel sprouts, duck wings, and bobs basket (fried shrimp with fried green tomatoes). Of the appetizers I enjoyed the duck wings the most. It was cooked perfectly and had a nice sweet chili sauce to it. The Brussel sprouts were ok to me only because I don't enjoy a lot of ginger and wasabi flavor. The fried shrimp were standard. I did like the side of fried green tomatoes though.  For my entree I went with the sea scallops with paradelle noodles in crab bolognese sauce. My husband ordered the special of braised short ribs. The entrees came out relatively quick and the portions for all the entrees were very generous. My scallops were cooked perfectly and the noodles were very yummy! My husband enjoyed his short ribs as well. We were all really stuffed from our meals and I think you can probably get away with family style as the portions can feed a couple of people.  Of course there's always room for dessert and we shared the orange amaretto pecan cheesecake. This was just ok to me only because it was a little too rich and dense for my taste. I was also pretty stuffed at this point so it was a struggle to finish dessert even with 2 people.  All in all its a great date place! The ambiance, food and beverage selection and service were really great!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PfY0T7UbVtQ3WRaKElCy_g",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Amaretto orange pecan cheesecake - a little too rich and dense for my taste",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PfY0T7UbVtQ3WRaKElCy_g/o.jpg"
      },
      {
        "img_id": "PPsOeEkLNzIikj5flgjswQ",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Scallops with paperdelle pasta with a crab bolonese - delicious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PPsOeEkLNzIikj5flgjswQ/o.jpg"
      },
      {
        "img_id": "clMB4e36Bu6uFY_RVpDb5Q",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Appetizer special - duck wings with sweet chili sauce, wasabi aioli and kimchi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/clMB4e36Bu6uFY_RVpDb5Q/o.jpg"
      }
    ],
    "user_id": "gdTAebkameev_DQq_NCZzw"
  },
  "cMqgSOLnRaHlgXj3npxtZg": {
    "date": "11/16/2015",
    "text": "I'm very impressed that this place is nestled comfortably in Carnegie!  It's definitely a place that I would think you'd find in the city.  Modern interior and delicious food!  As an appetizer, we ordered the fried oysters.  My husband grew up in the Pacific Northwest so he's a big fan of seafood and particularly oysters.  He has a fairly high standard for seafood related items so I was a bit worried that ordering this was a mistake.  But I'm glad that I was proved wrong - they were fantastic.  I'm not much of an oyster person but they were made very well.  My husband really enjoyed them.     For a main dish, I ordered the Faroe Island Salmon.  While I didn't care too much for the tomato based-broth the salmon and accompanying vegetables were delicious as was the grit cake.  It was such a large portion and I couldn't finish it but it was delightful!  We weren't blown away by their dessert offerings but when asked what was popular, they mentioned the bread pudding.  Neither my husband or I are big fans of bread pudding but we ordered the berry bread pudding anyway.  Wow - you didn't have to be a bread pudding person to enjoy this treat!  It was so fresh and essentially tasted like a berry cake.  Not overly sweet or mushy (what I usually don't like about bread pudding).    I would highly recommend this place and I hope to go back again to try some of their other dishes.  We went on a Saturday night around 8 and was surprised it wasn't more crowded.  We did have a reservation but they looked as if they had empty tables.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ooCYptMA1eyWKnuZzRR5Jw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Berry bread pudding",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ooCYptMA1eyWKnuZzRR5Jw/o.jpg"
      },
      {
        "img_id": "d5e8HQavA2oV8YYF_ZBh9A",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Faroe salmon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/d5e8HQavA2oV8YYF_ZBh9A/o.jpg"
      }
    ],
    "user_id": "NnrCwpS1i5mZtkGGzmIk0g"
  },
  "BaqJtEaFb85vxePX_P0L6g": {
    "date": "12/30/2014",
    "text": "Yum!  A bit pricey, but yum.    We had the Brusselsprouts (great) and the bean soup (good but salty), as well as the scallops and short ribs.  Everything was delicious, if a touch salty.  As my husband said, the chef knows how to use salt.   Modern and beautiful decor, and if you need a place to eat on the way to the airport this is an excellent fancy choice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bkuCW5rO3_d65DNTrA21Kg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. In the process of devouring the brussel sprouts",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bkuCW5rO3_d65DNTrA21Kg/o.jpg"
      },
      {
        "img_id": "yDFzeGhNB_wKwUivk-vijw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Dark wood decor",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yDFzeGhNB_wKwUivk-vijw/o.jpg"
      }
    ],
    "user_id": "2QMqEFGOkst7BpadA35SSg"
  },
  "6LRo1WSSZQtw9qwFmF9E6g": {
    "date": "12/27/2014",
    "text": "My girlfriends and I came here for our Christmas dinner - there were five of us. We made reservations about three weeks in advance. We had great servers in both bartenders since our table was in that area. They were great at describing all of the dishes and really attentive despite a busy bar. The only reason they don't get five stars is because I felt it was quite expensive when you're also drinking.  All of the food was very rich, with generous portions. See my pictures for our dishes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "TefkM9eHZJFegrazHRG_bw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Berry cheesecake bread pudding. So good!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TefkM9eHZJFegrazHRG_bw/o.jpg"
      },
      {
        "img_id": "Sej9GqT_Z0SpkcE7BT1E0g",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Flourless chocolate cake.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Sej9GqT_Z0SpkcE7BT1E0g/o.jpg"
      },
      {
        "img_id": "3pJJNaxvyWXl3iiWgOwxDw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Short rib special with &amp;#39;Mac and cheese&amp;#39; orzo. Amazing.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3pJJNaxvyWXl3iiWgOwxDw/o.jpg"
      }
    ],
    "user_id": "HlY4Vku7lA1bis1zxsImlQ"
  },
  "gHPXK_bIujm72aCz-P8AmA": {
    "date": "5/6/2017",
    "text": "The food and portion size is perfect for Pittsburgh. The poutine is just enough without being too filling for two people. I had the day boat scallops and they were amazing! My boyfriend had the lamb noodle dish which he loved. We will definitely be back to try the entrees we passed on for tonight's decisions!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Q-eBhAM-buiVJPSBEQn0ZQ",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Day boat scallops over zucchini noodles in a crab bolognese sauce with shaved Brussels and lump crab on top! So good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q-eBhAM-buiVJPSBEQn0ZQ/o.jpg"
      }
    ],
    "user_id": "q3ycagiLqUaRkOgEPf_gbw"
  },
  "Zw60tF0drCwE8KPrPeQ8tg": {
    "date": "5/29/2014",
    "text": "Interesting menu.  Website: A World Fusion Freestyle Restaurant.  Really nice decor.  a long bar and 3 tables on the first floor.  Was told there are about 16 tables upstairs.  A little patio, too.  Stopped in for lunch.  Had the Crab Bolognese.  Very nicely done.  Perfectly cooked pappardelle pasta, crab, spinach, zucchini with a little tomato and cream.   Service was friendly and good.    Chef Bernie stopped by.  He has some good training at CIA and some interesting restaurants.  He said he likes to try new recipes and is making some  menu changes.   A nice addition to Carnegie.    Facebook:www.facebook.com/OneThirtyOneEast",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 11,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "KtBVMDcU4dQNZlPlaRayBg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KtBVMDcU4dQNZlPlaRayBg/o.jpg"
      }
    ],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "VEG8skSM3y8zXjS3hLm0Cw": {
    "date": "2/8/2017",
    "text": "I enjoy lunch here probably 2 to 3 times a week.  The food is fantastic and always a little different.  Steve the bartender is excellent in explaining each feature and always provides great recommendations.  By far my favorite lunch in Carnegie.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "5td8ZKoNOJ1PkNMdslqJPw"
  },
  "h-jJkFSISOFFyxEmZTWDKg": {
    "date": "3/27/2017",
    "text": "Carnegie the last place I would expect to find this kind of great food!   I had the mixed grill which came with Seabass, crabcake and salmon and it was very good.  My wife had the short ribs which were excellent!  The atmosphere was very nice and modern.  We called to make reservations for 4 on a Saturday night just a couple hours before we ate and they were willing to fit us in, very accommodating.  There is a parking lot right across the street from the restaurant.   A lot of new and exciting things going on in Carnegie I will be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dAhxrgQqrldiJ0sUndGJjQ"
  },
  "JHqbdBP_8H6K-CK73Ny5bg": {
    "date": "1/28/2017",
    "text": "Please do not waste your money. The best thing about the meal was the martini. DO NOT order the halibut. While there was nothing BAD about the meal, there was absolutely nothing good. My boyfriend ordered the steak, and while there was no fat on the cut, u might as well have gotten it from Eat'n Park. No flavor. We were going to go to Outback, and we shouldn't have changed our minds. For half the price we would have had far better meal.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SkV59K_uL9w22cwE_K1IyA"
  },
  "Hl7zAybjdSVWjR_Aya63fA": {
    "date": "1/15/2017",
    "text": "I loved the cute atmosphere, but the food was just ok. I had the halibut and it was extremely bland with no seasoning. I think the preparation was not to my liking. The only thing I enjoyed was the cheese and olive app and the wine. I think they need to step their food game up. The presentation was not great either.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f-VFuyiqWrd-hxi_zXBeNw"
  },
  "9UtT3bkrKCpPgiJsi73juQ": {
    "date": "12/19/2016",
    "text": "I debated my rating for quite sometime only because almost every one or every place can always get better. However, I've been going to this place weekly for a little over a month and I can't see a reason to stop. Really each meal was as good as it gets!!! My last two visits I had the filet special with a gorgonzola pierogi with sauteed onions and asparagus. I couldn't decide what was more tender, the beef, the pierogi or the onions. I told the chef, who steps out of the kitchen on occasion to see how things are going, that it was in the top 5 meals of the year. Well I may have to put it in the top 5 of all time. It was that good!!! Even the regular menu item dishes are terrific.  I usually eat at the bar and the bartenders are excellent and really enjoy the product they sell. I always go in with a dish in mind and almost every time they talk me out of it due to their enthusiasm about one of the specials. The best part is they're never wrong. Truly a testament that they are not just blowing smoke, they really like the food. Also when you're not sure what to have to drink they will ask you great questions to narrow it down to some concoction that's terrific. Or they will let you taste before ordering which is awesome customer service.   Love the place and can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "B4AgXwLkT2tKhOTj5gUKsQ"
  },
  "QUe8abUaAFPJ3rIwsER7XA": {
    "date": "6/9/2017",
    "text": "I used to love this place but the food tonight wasn't good at all. The hummus app was very good but my $33 entree had no flavor and my boyfriends entree was suppose to be gluten free and he is now sick. The service wasn't great either-- it was just an all around different experience than we're used to. I'm not sure we'll be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PuOybMagLdQLE2tAs_MpFw"
  },
  "lKXawxWPov_xrnn3mVyAMg": {
    "date": "10/17/2016",
    "text": "What a great place.  The food, the ambiance and the service was top notch.  The flat bread is to die for!  They had a fried truffle risotto appetizer special that the chef and the bartender highly recommended.....they were so right!  It was phenomenal.  Everyone in our group loved their choices.  We cannot wait to go back.  I thought about the fried risotto and flatbread all weekend!   Big congrats to everyone who brought that area of Carnegie back to life!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "BftlxAazYbvmf-OUbxbtYg"
  },
  "GUcRHgDgeerTG8CaQabfmw": {
    "date": "4/9/2016",
    "text": "Friendly service.  Good ambiance.  Great food.   We enjoyed the scallops tuna Brussel sprouts.  Also tostada and fish taco which may have been a special.  Thank you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IxJztSDcDu82d6HJItpTsQ"
  },
  "OJadlSe5p3gfzLy_bKB3RQ": {
    "date": "9/30/2016",
    "text": "Had a delicious meal at this little restaurant. The cheese platter was OK, but my fish was wonderful. Would recommend to those traveling in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MYF9ak-fs0QNd2PPT4ouLw"
  },
  "xww8vrqtIWVPLuRYg40gFw": {
    "date": "12/12/2016",
    "text": "One of the best dining experiences that my Girlfriend and I have had in Pittsburgh. The food was amazing, ambiance on point, drinks fantastic, and a knowledgeable staff that seemed to genuinely love the restaurant and want their customers to love it as well. The price is a little high, especially for the neighborhood, but definitely worth every penny. Will be back regularly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bleyhN--91eJmPyJpXr9Mw"
  },
  "xeICiueTPPBC9_IYK1DL7A": {
    "date": "1/18/2017",
    "text": "Had dinner here tonight and it was wonderful !    I had the scallops with all the extras and it tasty and was prepared excellent !  the folks there where friendly and also raved over the food and svc......met the chef and was very happy that we were here....the restaurant had a modern flair and very upbeat.....next time I am in town on business I will make sure I stop back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QMWP7DDG631i8gMQo3L1zQ"
  },
  "Ovp1gEb4_31RfQg1TNyZng": {
    "date": "2/3/2017",
    "text": "From start to finish, appetizers, salads, main courses, desserts were hands down incredible! Delicious flavors well presented and Danielle, our knowledgeable wait staff, was enthusiastic and upbeat. It took me 3 years to get here and now I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hZ_uNDBpsJ4HqG-59XENQ"
  },
  "yFsJs7SYWQNA81LoEWp1uA": {
    "date": "9/25/2015",
    "text": "First time here. Top to bottom everything was excellent. We beat the rush on Friday nights but still got a reservation. Tried a few of their delicious cocktails, good wine and small but good draft beers. My wife and I started with the poutine which was outstanding. For the entree I had the veal osso bucco which is code for awesome veal stew with gnocchi while my wife had the halibut which was very good as well.    All around good meal of food. Service was acceptable to good. Only complain would be it is a little pricy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PHM9YInFj-Z39ewwSAl5xQ"
  },
  "V1_ZDkHCfF_KODbpOV1TdA": {
    "date": "11/4/2018",
    "text": "This place is super cute. They have seating on the first and second floor. Cute decor, friendly staff and a nice menu. Lamb noodle dish for lunch was flavorful and hearty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "vOcDzUpdU0cgMe6ewEnS3w": {
    "date": "3/23/2015",
    "text": "Yummo!  The food is full of flavor and very appealing to the eye.    I have been here twice.  I recommend your first try to request dealer's choice from your bartender.   I say you cannot go wrong with any of their lamb or scallop dishes.  They do offer some awesome cocktails.   The mixers the include are prepared fresh and from scratch - example - I had a drink (whiskey-based) with freshly made pumpkin puree.    I am not sure where else you can go for drinks made to this level of quality / detail.  A high recommend.     Summary: Service - Excellent (I have always sat at the bar).   The bartenders are very friendly. Food - Awesome!   $20+ on average per entree Drinks - Awesome!  (Special / Quality Cocktails - $10+ - They are very tasty but not the place you want to go on binge) Parking - Lot next to the restaurant / on street parking in Carnegie",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "w0pQMqPOJPBo9Yt-1Ro87w",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Oysters!  Yummy",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/w0pQMqPOJPBo9Yt-1Ro87w/o.jpg"
      },
      {
        "img_id": "uarIwr0lRLsnIMk9GBqoOA",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Scallops cooked to perfection!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uarIwr0lRLsnIMk9GBqoOA/o.jpg"
      },
      {
        "img_id": "JSAhHjHtb-hpxG91nNRcxw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Pumpkin Old Fashion with Buffalo Trace Bourbon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JSAhHjHtb-hpxG91nNRcxw/o.jpg"
      }
    ],
    "user_id": "JgOcyMF1lTwSVCarSZrrrA"
  },
  "t1EbHkCsTAymfwDVOEuF3g": {
    "date": "8/24/2017",
    "text": "I stopped here today for a late lunch on my way out to the airport and I'm really glad that I did.  I sat at the bar and was immediately greeted by Steve.  He was very welcoming and knowledgeable of the lunch specials which he explained in great detail.  I decided on the duck burger (medium and medium) with the pasta salad on the side.  It was easily one of the best burgers I've ever had and the pasta salad was by far the best I've had.  This lunch was the best meal of this trip.  If I'm ever back in the area I'll make every effort to make it back here.  Fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AHEhbdnJ-loxLlqI6QbH3Q",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Duck burger with pasta salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AHEhbdnJ-loxLlqI6QbH3Q/o.jpg"
      }
    ],
    "user_id": "swbFdTtRdRXPKE4P6sqg7w"
  },
  "TAhU9oXtT5p9DTP9bqK15g": {
    "date": "11/12/2018",
    "text": "Boy oh boy! Just stumbled upon this place, no res, but got lucky. This is first class cuisine, from the extremely knowledgeable sommelier to a chef with high skills. Service impeccable. We had the manchego cheese appetizer, roasted beet salad, Manhattan clam chowder and lamb noodle. All excellent. House made ice cream and sorbet for dessert. Want to try other items next time, soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XeOwD5NpSu0R02RoPogVSQ"
  },
  "iPA19ZWayKjBtOrQEli91w": {
    "date": "9/4/2018",
    "text": "Ummm. WOW. Had the spicy salmon shrimp special served with grilled tomatoes, grilled peaches and just enough batatas bravas. Hard to describe but it was just about perfect. Glass of Pinot Noir and... Bob's yer uncle!  Chef came around to say hi to everyone and there was applause. Come here now. Eat. And indulge. You will not regret it. The yelp rating is well-deserved!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MsqySTyM934xJQDVoSmxcQ"
  },
  "GHoH10yeEHK0tqgkayyOCw": {
    "date": "9/29/2014",
    "text": "I hate to say you'd never expect a place like this in Carnegie, but I can't help myself!! I can't believe this is in Carnegie! It seems like a swanky downtown joint. But I'm lIking Carnegie more and more, and places like this is why!  So as I mentioned, it's super swank inside. Dark wood, hip music and classy looking people. It's two floors, plus a patio on the bottom and top floors. We sat on the top patio, which was fun to people watch below.   For an appetizer we split the Poutine. The fries were crispy, and didn't get soggy by the tasty gravy and the cheesecurds were good, I only wish there were a little more (I feel like there were three large ones).  My main dish, the Faroe island salmon, which was almond pesto, tomato sauce, grilled veggies and asiago grit cake, all blended together perfectly. The taste was pretty rich, but wasn't overpowering. I was impressed with how large the salmon was too! It was very filling and I didn't finish it all.  Honestly, the whole menu looked intriguing. Even when I glanced at the lunch menu the offerings looked tantalizing. It's definitely one of those places I need more of in my life!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "acUZHWeCHuI5j_55AaU6-A",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Faroe Island Salmon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/acUZHWeCHuI5j_55AaU6-A/o.jpg"
      },
      {
        "img_id": "n5grTyVSnGlF3Mh6dc9BcQ",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Poutine",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n5grTyVSnGlF3Mh6dc9BcQ/o.jpg"
      }
    ],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "DENsLmZWLDYZWMZn7xvcdQ": {
    "date": "4/12/2018",
    "text": "Great personalities behind the bar! Been there twice with reservations and other groups, but when we stop in without- we love date night at the bar. Well rounded restaurant with good food and good service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r65ryyWbABMH4U-58RqtQw"
  },
  "U4-BfsrwF1ycv5HmJHIHyw": {
    "date": "4/15/2017",
    "text": "Ate here with a friend last night after hearing good things.   We had tried it a few years back and were underwhelmed but I think that was due to growing pains and the strain of launching a new place.  Our dinners were excellent.   We both had the salmon special, which was served on a bed of kale, berry, beet, and baby potatoes in a light vinaigrette sauce.    I am not doing it justice - it was close to perfect and the salmon was a generous portion cooked to medium as I had requested.         We sat at the bar and the service was friendly and attentive.   We made reservations to come back next week with more friends, that's how pleased we were.   The couple next to us had dessert, some type of bread pudding with a side of sea salt caramel house made ice cream - it looked amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "g7Ai5GZsXFn0cbYLXtDhzQ"
  },
  "7vTo2d_MU2vsoYa_d8sidg": {
    "date": "10/27/2018",
    "text": "Decided to try a new place for dinner tonite and everything was outstanding. Husband enjoyed the pumpkin Manhattan. Our waitress Molly was excellent and service was very good. We tried appetizers and entrees from daily special menu and were not disappointed. Salmon and scallop dish was delicious. Look forward to dining here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wAEUBlFRXQ9XqqA1s2dktw"
  },
  "jjlf2BLMscI7hnAoQRC5Bw": {
    "date": "4/14/2016",
    "text": "After making the rounds at many new restaurants (lawrenceville, downtown, mt. lebanon, shadyside) I've come to appreciate the quality of this restaurant even more than I had before.  The price mimics the quality of dining. I can't express how much I love returning to this gem of an establishment. The meal you get it different from any other restaurant, the place isn't stuffy, and you *know* that whatever arrives on a plate or glass, is going to be totally awesome.  So pleased that it continues to impress me with an imaginative food and drink menus. A+",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oXthyXaQMPEezXNfUGBgaw"
  },
  "RzRbIhP2a_PZPasdkoUAhw": {
    "date": "2/25/2017",
    "text": "Good little find in Carnegie. Nice date night or meet the parents dinner spot. Small but well crafted menu. The vibe and decor upstairs is not the same as the cozy bar area... a little echoey and cold. We started with bristle sprouts YUM and had Lamb and pork chop for dinner. Great mixed drinks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pGrW10C3jVDxKe5gr_zaMg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pGrW10C3jVDxKe5gr_zaMg/o.jpg"
      }
    ],
    "user_id": "a1RFLrT5UhekcvU9_8y9-Q"
  },
  "SUXYCC4TOhK2hGdxltkv2w": {
    "date": "6/16/2018",
    "text": "The review by \"Dan F\" is dead wrong. The server was kind and more than patient. The manager was respectful and this place is following rules, nothing wrong with that. They have great food and good service and don't deserve a review from some immature kids who can't hear the words \"sorry, we can't do that\". Our waitress was awesome - always love it here!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "1WhnR8XpDSpy6gxNHWmMjA"
  },
  "IikFXBbMiGd_Rf8E04Ykjg": {
    "date": "8/29/2018",
    "text": "OMG! What a find! Menu is creative, original, and AWESOME!   Steve the bartender is awesome- wine list is just right. Chef is CIA trained and AMAZING!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SGO0CQl4GGXmUiXMbS2NGg"
  },
  "mKA3dRjGOUnMKkmQZ4ItJw": {
    "date": "4/4/2016",
    "text": "First time here. I went with on a business dinner. One person ordered brussel sprouts for an appetizer and I was so confused. I have never heard of brussel sprouts for appetizer. But, once they came I was just amazed at how good they where. I am sure they are not healthy! But mouth watering and just awesome!  I ordered the spring seafood bowl and was very happy with it. I enjoyed everything that we had, the service was excellent and the food amazing. If you are in the area give them a try. I am planing on going back just to take my wife.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BEOLwbrPQnGf4fWjuSR3Mw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Spring Seafood Bowl\r Chilean sea bass, shrimp, scallop, mussels, colossal crab, tomato basil shellfish broth, house gnocci",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BEOLwbrPQnGf4fWjuSR3Mw/o.jpg"
      },
      {
        "img_id": "vi3mXoD5LE45o0XuPnruaQ",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Crispy Brussels Sprouts\r Fresh ginger Indonesian sweet soy, wasabi aioli, fried wontons",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vi3mXoD5LE45o0XuPnruaQ/o.jpg"
      }
    ],
    "user_id": "IwAzZe3iN9ZBMxW7lKM3Yw"
  },
  "IdwP0LfRK8S7HAkARI5n3Q": {
    "date": "3/9/2018",
    "text": "My husband and I came in for happy hour last Friday hoping to get a casual drink after a long work week. When we asked the host if there was seating, he snidely remarked, \"there is no seating at the bar and you will be in the way if you stand.\"   We both really wanted to give this place a try and were rooting for it, but with pretentiousness like that, we'll take ourselves and hard-earned money elsewhere where we are not treated in that manner. #rileyspourhouse",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ryG-YCUt37L59UEn4TuK8w"
  },
  "6Vt991AF4azsWzPFCFXvEw": {
    "date": "1/23/2016",
    "text": "Decided to give this place a try because we wanted to stay close to home due to the bad snowstorm we were getting and the bad roads. What a delicious surprise - it was a little pricey but they give good sized portions and good solid food. Started with the poutine which was so good - the fries stayed crispy and the lamb gravy and cheese curds sooooo good! The Brussel sprouts were ok but I probably wouldn't get again - they tasted like Chinese food for some reason.  I was too full for full dinner so I opted for the apple, pear and blue cheese flatbread which was a little sweet but really tasty.  Our waitress was very friendly and nice and the owner/chef came out to check in with all the customers to see how they liked their food which was a nice touch. Seemed like a nice guy.  Will definitely go back.  Next time I've got my eye on the braised short rib special",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fi4M52ACXKba2Hylz_yYCg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Kurobuto pork rack chop-wowza!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fi4M52ACXKba2Hylz_yYCg/o.jpg"
      },
      {
        "img_id": "_L6unqr1CE1Kb6gfHocccw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Lamb noodle- we get this every time and always consistently great",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_L6unqr1CE1Kb6gfHocccw/o.jpg"
      },
      {
        "img_id": "aGwVvpi_NXooSJXSsPfBDQ",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Manchego appetizer platter - yummm",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aGwVvpi_NXooSJXSsPfBDQ/o.jpg"
      }
    ],
    "user_id": "hjk--8VuDX3479_atPJQ1g"
  },
  "E24xp-Fj7DNiaX5Gud5U0Q": {
    "date": "3/11/2018",
    "text": "I can't say enough good things about this restaurant. It's honestly one of my favorite places to eat - lunch or dinner. My go-to for lunch is their crab bolognese, which honestly I could eat every day for the rest of my life. Nice selection of wine and cocktails. The staff and atmosphere are great. Perfect for a date night or a casual lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tz3-JrV8YPotKYO-T-Q6NQ"
  },
  "iB1vuHo25T_cMsuvy21uOg": {
    "date": "1/9/2017",
    "text": "I used to work in Carnegie, and would order lunch or dinner from 131 regularly even though they're a bit pricy.  But they're pricy because the food is high quality, always fresh, and delicious.  The bartenders are all great, and even though I'm not a regular anymore, they remember me and ask how life is when I'm there.  I have never had anything bad or disappointing, and will always recommend it to friends and family looking for a great dinner and a phenomenal cocktail.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5nLrG5YTh0s1wbBM3H4NtQ"
  },
  "xRLMnBy3gAJxywrbNa8a-w": {
    "date": "1/10/2018",
    "text": "Amazing food and excellent service the food was some of the best tasting and so very appealing to the eyes as well. What a surprise to find this gem in Carnegie definitely worth a trip to try it out. Even got an opportunity to meet the chef who was very humble and appreciated us and made us feel very welcome",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gyN7tOUrAQpQI0Ivu4Vg4g",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gyN7tOUrAQpQI0Ivu4Vg4g/o.jpg"
      },
      {
        "img_id": "qnPOHbPdiOJeumKQ8V-COg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qnPOHbPdiOJeumKQ8V-COg/o.jpg"
      },
      {
        "img_id": "G7aj4KMvhAGveBJTyN7LAw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G7aj4KMvhAGveBJTyN7LAw/o.jpg"
      }
    ],
    "user_id": "Fb5ezxi9ehG5yidRiQ4uFA"
  },
  "cWUU2XnLpoxsAHcPCIf3cQ": {
    "date": "3/27/2015",
    "text": "I've had my eye on this place for quite some time.  The last time I wanted to try it was on a Saturday evening but they were totally booked so I wasn't getting my hopes up too high when I walked through the front door last night.  Maybe because it was on a Thursday and not a weekend but to my surprise there were only a handful of people dining at the One Thirty One East on this particular evening.  I took a gander at the taps behind the bar and noted that there were a few craft beers to choose from before taking a seat at the end of the bar.  The bartender greeted me with a friendly smile, placed a menu in front of me,  pour me a glass of water and said, \"Let me know if I can get you something to drink\". I told him that I'd like to start out with a Kentucky Bourbon Stout and flipped the page of the menu to see what the entrees were.   Everything on the menu sounded so good but I narrowed it down between the Day Boat Sea Scallops and the Veal Osso Bucco deciding on the osso bucco simply because I haven't had veal in a long time.  It only took about ten minutes for my plate to arrive. I don't know what I missed by not selecting the scallops but the osso bucco was amazing! Fall off the shank tender and each bite melted in my mouth like butter.  The veal was accompanied by house made gnocchi covered in a stock gravy.  I'll admit that my total bill wasn't cheap, but for the quality of the meal, it was worth every penny.   I highly recommend One Thirty One East but to be on the safe side it would be wise to call ahead for a reservation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "l44bRDCdizv3U1JrSp4KNg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Osso Bucco with Gnocchi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/l44bRDCdizv3U1JrSp4KNg/o.jpg"
      }
    ],
    "user_id": "cUqU7UfSaamDg0L5TIJPRg"
  },
  "s0aKq9oZCiiy2cqnitqv3w": {
    "date": "1/5/2016",
    "text": "Okay, I am going to rate this restaurant 5 stars but I will offer my fellow diners a word of caution. Please read to the end for my note of caution. Having said that, I thoroughly enjoyed every meal I've had at this restaurant. We'll usually start with the olive sampler for the table. I usually order a drink with dinner (please see below). You know how some restaurants do great with starters and salads and fall on the entree? Not this place. When they thought up the word umami, they had this place in mind. You really have to try the short ribs on a bed of risotto. I've had it 3 times and I enjoy it more every time I go. This last time I had the veal osso buco and, what can I say? It was beefy and luscious and melt in your mouth. Umami! The service was attentive but not overbearing. None of us got the dessert so I can't comment. Now, for my word of caution. We were having a good time and I wasn't paying attention.  I ordered a Blanton's Manhattan up. It was tasty. It was about an average pour in terms of size. In terms of quality I would put it at 8 on a scale of 0 to 10. What is amazing is its price tag of $16. I don't think I was charged $16 in Manhattan for a Manhattan. Unfortunately, I ordered  2 and $32 later, I had racked up a bit of a bar tab. I can just hear what you're saying: \"Caveat emptor.\"  And you're right. So, to be fair, the restaurant is slightly below average in interior design in terms of what you would expect for the quality of meal that they serve. This is not the interior of 11, for instance or Umi. To compare, you will pay about the same.  But the wait staff couldn't be better. The food couldn't be better. Just watch out for the price of the drinks! Perhaps consider stopping at one!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "t0rIMuPRfnfqMNe5-2n5FQ"
  },
  "VBg1LakVDlBgj0j1JFMWHA": {
    "date": "10/19/2014",
    "text": "Great staff, delicious food! Summer menu was a little heavy but done really well. We were surprised Carnegie has a place like this and very happy they do!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "T9_bBbNFyo85ufOfzZJumQ"
  },
  "teYdAHXwQ3pYX6pgq-tXUA": {
    "date": "7/2/2015",
    "text": "Was there last night for my birthday as of others heard great things so I wanted to try something new. The food was good, however the service was quite slow, the food took forever as with the service. I will think twice before I give it another chance. Yes pricey but I'm willing to pay for a good meal but left disappointed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MEDKlQy-KNi-lZA4Tra7wg"
  },
  "Pn33Z0HBndoJ29Nt6ieVOA": {
    "date": "6/13/2016",
    "text": "Nice atmosphere and wonderful food. Just slightly pricey. We always get the shrimp appetizer, which is lightly breaded and flavorful. I always get whatever fresh fish they have and haven't been disappointed yet.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SmLQyKPDwHkcqszu7pJl_g"
  },
  "reaRCwrGtDAz-WquDYanXQ": {
    "date": "7/15/2016",
    "text": "Amazing lunch! Got the brussel sprouts as an appetizer and I wasn't a fan, not sure if it was my own personal taste or if they just weren't good. But they weren't inedible. The entrees were incredible. We had the Oyster Po Boy and the Crab Bolognese. It was one of the best pasta dishes I've had in a long time. Will definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8QAi9JAK4vojUdyhvDzF1g"
  },
  "ad1C4XtYuWmvRjBeOVrsTw": {
    "date": "7/4/2016",
    "text": "One of the best around Pittsburgh! We eat out all the time- great food and prices better than others similar! Try Brussels sprout app- flatbread with pears and carmelized onions--most dinners great--L&L",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P13fy434fT5ctlu5fvLb0Q"
  },
  "Lo6CBAbcWHg4QJ6rxLIbBA": {
    "date": "3/27/2016",
    "text": "Had date night dinner here on Friday and had a fantastic meal and great. The bartender was super welcoming and explained all their menu items before we even went upstairs for dinner. The Brussel sprouts were delicious although they are called \"Crispy Brussel Sprouts\" and they were not actually crispy. That and the fact that the seating does not allow for any intimacy at all (tables are practically on top of each other), are the only reasons it was not a five star experience. We will definitely go back, but likely just eat downstairs in the bar area. Very nice decor and awesome menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IWWzYjczAL9lic16F8bO9g"
  },
  "hqPyNG1fna19ca1trTrowg": {
    "date": "1/6/2016",
    "text": "Visiting from out of town.  Place was comfortably busy.  Great variety of cocktails compliment a variety of entees.  131 salad was tasty.  Hanger steak was cooked correctly, however seasoned fries diminish ed the overall meal",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GyXag9EeqjcwWjLJBLvIaA"
  },
  "oeMkFFAXdeA_Hr74hnajtQ": {
    "date": "1/13/2015",
    "text": "limited menu but the food was well prepared, and tasted good.  the poutine was good as an appetizer shared between at least two.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9iWKo3AbBdkvVqKiTKwDLQ"
  },
  "WW9zCobwAGSAvzsZnH_NzA": {
    "date": "2/19/2015",
    "text": "Somewhat acceptable food with cheerful service. Prices probably in line with Carnegie area and food quality. Will not return.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4h_xfyrmOPvHm2ubXabGaA"
  },
  "HBDBWYEA5fcYyyYMiVv9tA": {
    "date": "2/1/2015",
    "text": "Great cocktails and super-knowledgeable bartenders. They do a great Old Fashioned, and have after dinner aperitifs, sazerac, and a good wine list. I come here for Happy Hour on a regular basis and have had lunch here a few times. The food is excellent. I've had all of their flatbreads, the chicken sandwich on the lunch menu, and a polenta special with sausage, chicken, mussels, and shrimp. The owner is really friendly and will introduce herself if she is downstairs at the bar.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ssBqXW-hWvtmM4q8uj0vDQ"
  },
  "JmU4h7rxe13Jaw-00NYwvg": {
    "date": "11/1/2014",
    "text": "the chef (Bernie) held down the fort at Cafe Georgio and now has his own joint - I had the gnocchi Bolognese special and was blown away - reminded me of dining at a good trattoria in Italy - food made/cooked to order - nice atmosphere (we chose to sit in the bar) - plenty of parking - we will return",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "75QZ3Xq9NU1Gw_lw-E_apw"
  },
  "E875UFkdYMJBiL-GivZDGg": {
    "date": "6/4/2015",
    "text": "The food is very good but we ordered a margarita which was the featured drink. It was served in a tiny old fashionedchampagne glass. The drink was so small we drank it in two sips and it was $10.00 !! What a rip off.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DY_mqzfDLIlQtsHLRy09oA"
  },
  "Rx6vgGxiSgSqXT2DaE0C5A": {
    "date": "7/23/2014",
    "text": "Visited for lunch, interesting menu, food was great and something different. The atmosphere is nice, place seems clean, cant wait to go back for dinner. Prices were very reasonable for quality of food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zCCoyKfJxdvU0XPq6GL3YA"
  },
  "c4JfOVVrCIpGoZelk12vww": {
    "date": "2/29/2016",
    "text": "A nice little place out in a cute section/street of Carnegie.  From what I gather, there are not many (if any) other places like this in Carnegie.  The atmosphere was a little bit on the modern side with a bar downstairs and only two tables that I saw on the lower floor.  The upper floor had several tables - I would have liked slightly better lighting though, especially given that there were windows (curtained) only in the front.  The food was very good.  I got the braised veal osso buco, which was in a deep, savory sauce.  Very tasty.  She got the halibut - which kind of looked like it was flash friend, with a light coating on the outside.  She enjoyed it - I thought it was a little on the bland side.  We also shared their mixed grill between us.  This was definitely the best of the bunch - lamb chop, crab cake, duck breast - all perfectly cooked.  The lamb was excellent, but amazingly the fingerling potatoes that accompanied them were probably my favorite thing on this plate.  They had a truffled aioli sort of dressing on it, which went perfectly with both it and the meal.  I have not had too much truffle in my life, but when I have it has often been a little too strong or overpowering for me.  This was just right, and I wish there were more of them.  I would have enjoyed slightly larger portions, as one entree would not be nearly enough to satisfy me.  For dessert she had a mixed berry sorbet - flavorful - almost too strong for me.  I had a bread pudding, which was excellent.  A very enjoyable meal, and I plan to go back someday.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ia2dQGFt3djNAw_QbCj9gg"
  },
  "no21FFmu-y03DmWyxmVtqA": {
    "date": "2/22/2015",
    "text": "I took my dining out club there last night. The food was fabulous and everyone loved their meal. The majority of the group (total 14) have never been there before and can't wait to go back.  The scallops andd the Chilean sea bass were to die for.  Service was great.  Thank you for making it such a pleasant evening on such a horrible night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xQTGP9bPHxxLIJNgWOMVRg"
  },
  "AYG50Fj0sjt_bwKRyOXkcA": {
    "date": "2/22/2015",
    "text": "This is one of the best meals I've had at a restaurant.  Service was friendly and decor was modern.   I had the salmon and asiago and husband had the hanger steak and both were outstanding.  The crab bisque had chucks of crab meat.  Do NOT pass up this little gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a349Bot6uzGOUduFyFs_pw"
  },
  "uB8t2vmOZF1tCivMDQB6qQ": {
    "date": "1/19/2015",
    "text": "My. Wife and I went there for a late lunch to check it out. Our lunch was terrific and our waiter Dave was very engaging regarding how the food was prepared to the type of liquor they used to make a black Martini. We liked it so much that we called our friends to see if they wanted to have dinner there Saturday night.They were all booked up until the eight thirty time we took. They were extremely busy at the bar and the restaurant but our waitress Dawn poured a lot of energy explaining the featured items. Each couple had osso bucco and the braised short ribs. The osso bucco was very good but the braised short ribs were superb. The food is cooked with a flair but very approachable. In fact the whole experience from the food to the service is unpretentious and approachable. This was in sharp contrast to our experience at a restaurant in Pittsburgh that sounds like a condiment. The chef at 131 named Bernie who was trained at the Culinary Institute in Hyde Park took time to see how we liked everything. Our friends and us all agreed we will be back soon. We would however, like them  to lower their corkage fee to $15 and then we would give them 51/2stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2vQtI_yLsVmdeQ20kIRSkA"
  },
  "Amj_uxq_fLRuriYKZzCdVA": {
    "date": "11/14/2018",
    "text": "Meh. Went here for lunch and it was just ok. Ordered a side salad only. It was good and the dressing was wonderful. Had to ask for bread. Bread was cold. Had to ask for butter. Had to ask for salt and pepper. I wouldn't make any effort to eat here again.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ds21YX-cp3zJ1f570y3XHQ"
  },
  "N-DcC3zdanU6OSNp-SygPg": {
    "date": "5/2/2019",
    "text": "Great place! Great food! We will absolutely return!! I had a salad. The hubs had the study of duck - he said it was the best he ever had!! Our friends had the walleye and scallops.. yum!! The Malbec margarita was a game changer and almost too pretty to drink... I said almost!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aPZspgYGsDYrKo7i2ds2Yg"
  },
  "jTKk2uRbspjFtguAdpL_GQ": {
    "date": "3/7/2018",
    "text": "If the staff is any indication of the quality of this establishment I will giving it a 10 out of 5.  The bartender literally walked upstairs to welcome me and tell me about the chef and what a wonderful mentor he and his wife are to him.  Further my server was attentive and kind as well - what a gem right outside Pittsburgh in Carnegie.  I will post a review of my lunch soon but first impressions I am impressed.   Just as I thought the food has matched the service, wonderful find, excellent food!  Bravo!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-TnEshEw31IH2BWjQaCIRA"
  },
  "AZc2Xy3ZxYNGDgaV_d118A": {
    "date": "6/24/2017",
    "text": "Let's start with the bad:  I tried the Crispy Brussel Sprouts, and they were not crispy. They were saturated in some syrupy sweet substance. I didn't like it at all but since a lot of the reviews rave about this dish, I think I may have just tried it on a bad day.  The good:  Great customer service.  Clean facility.  The Day Boat Sea Scallops is an amazing and brilliant dish. It's flavorful and light. I enjoyed it.   I would come back.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "c2I-wuSbWhtxmKj0lKTgxQ"
  },
  "nELgET5QbSSkuS87MDmZmQ": {
    "date": "1/31/2018",
    "text": "I went in with coworkers for a meal and everything seemed fine. Atmosphere was good and food seemed fine.   I'm allergic to pine nuts and specified that and got a seafood dish. When I ordered it and took a bite I started to get a reaction. Things happen and I asked the waitress if this had anything in it. \"No.\" Well could it have been cross contamination? \"No but if you want to order something else, I can put that in.\" Order something else? I could actually die from shock!   Not asking for sympathy or anything but asking if I just want to buy another dish is actually an incredibly unempathetic response. I won't return and have told people of this encounter. Actually dangerous location honestly.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WtM7lXvtV5pnvRwP8E1YBg"
  },
  "MufVQ0orNAIGafGnbN8iPg": {
    "date": "10/17/2018",
    "text": "I used Yelp and found this restaurant. WOW !! The food, service and atmosphere were amazing. I am still dreaming about the bolognese sauce and will absolutely put this restaurant on my rotation. Can't wait to return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MWYBFZBBOozh8lH46DQJRA"
  },
  "YrYmwf7QGJjZfdVc-E4jyg": {
    "date": "9/12/2018",
    "text": "My friend and I had such a good experience at happy hour. The bartender, Steve, was wonderful! He provided amazing customer service, made great suggestions and was so accommodating especially with my dietary restrictions. The drinks and food were delicious! I highly recommend the fried oysters (gf option available). We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hJFSuk7W0stwyGX0bpMhjw"
  },
  "MWb27zCOOCD2iTI4EbmAlA": {
    "date": "11/9/2018",
    "text": "Came here with my husband for date night to try it for the first time. I ordered a delicious special pear tequila cocktail and we got a flatbread as an appetizer. The cheese flatbread was perfectly cooked and hot. Service was great for the entire meal, not pushy and always refilled waters without asking. I had the scallop entree which was delicious and perfectly cooked. The flavors were incredible. My husband ordered the Spanish Paella which he loved and was full of seafood and spicy flavor. We will definitely be returning again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1xI7fYiWu96eZLMmzV85hQ"
  },
  "XrnpVnugLmTwgOapZuFacg": {
    "date": "4/8/2019",
    "text": "Excellent food and service! Atmosphere was nice. The fried oyster and foie gras apps were delicious and you can't go wrong with the beef short rib meal. Will definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "07x6-S71FGpus5XlnanzCA"
  },
  "Vkr9LtsSpw6yMn2w7xyCZA": {
    "date": "6/16/2018",
    "text": "Was talked to very rudely by the owner. I have all my valid id and paperwork for my pa drivers license and she said she didn't care what the law said the restaurant  wouldn't serve me. I left. We were going to spend like $200. Glad they aren't getting my money. Ridiculous.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iM7faQg7zVNve2XLXgo3Kw"
  },
  "6lKhpTf1zNQmPv5E5XzP9g": {
    "date": "8/3/2018",
    "text": "This place is awesome!!!! Dropped in for a happy hour tonight and received outstanding service, amazing appetizers, and drinks to kill for!!! Keep up the good work guys, I'll definitely be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zwOiJvD09N1dNf-ts7wscw"
  },
  "uxrnt5VtJx06NBHjvL-UEg": {
    "date": "12/5/2016",
    "text": "Oh I have so many good things to say about One Thirty One East. The decor and ambiance is great. You can tell that they just redid everything. The bartender was super helpful and also told us all about the chef and menu. He told us that the chef was the best person he has ever worked for and all about how everything on the menu was great... It seemed a little over the top until we actually tried some of the food.  To start, the drinks were really good. First I had the rhubarb margarita, which sounds REALLY weird, but I love rhubarb pie, so I decided to try it. It was not as rhubarby as I would have liked, but it was still amazing. Then I had a Lagunitas beer, which is widely available and always makes my tummy happy.  For food we tried the fried oysters- I was a little scared here, as I had only had oysters once before... They were just a little bit slimy and not bad at all! Then we had the brussel sprouts, they are OMG amazing... Like, they don't even taste like a vegetable good. We also tried the beet salad which was good but not amazing or anything and the onion flatbread, which was delightful. All in all a great meal, we split this amount of food between 2 people and couldn't finish everything.  I will be going back soon!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "3DltS5Wr9MOntnc8StBFBA"
  },
  "GVjhu8J7lXHx-n-zHBBUFQ": {
    "date": "6/22/2018",
    "text": "This is a common occurrence in Pittsburgh these incredibly mediocre \"American upscalish\" restaurants have these amazing reviews. The ambiance was nice. The food was fine here but nothing special and nothing that deserves 5 stars. I got a flat bread and everyone agreed that it tasted like frozen pizza, I've honestly made better flat bread at home with a Costco naan and fresh mozzarella. My husband got the lamb noodle which was okay but nothing amazing. Our friend got the duck which actually pretty good. The brussel sprouts we're good (for some reason every Pittsburgh restaurant has this) and the poutine was just okay. Overall would never go again, didn't hate, but it was just eh and overpriced (also Pittsburgh standard for these types of places).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QXewtqqntPNLVnEG4IqePg"
  },
  "gXfeKma6l9OsfLycmQdFsA": {
    "date": "9/20/2018",
    "text": "This is one of my favorite restaurants to go to. My boyfriend and I have only been here twice, but the food is absolutely amazing. The two times I have gone, I have ordered the steak which is great! The flat bread is also amazing. We ordered it both times of coming here. It's a nicer restaurant for the Carnegie area and I would recommend it to anyone who is looking for something a little different!! We will be coming here again within the near future !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ak0iy2j7RQ_LQMmDM8HNEA"
  },
  "lkN3_kXMd_5ZCf-wSq_-ew": {
    "date": "4/10/2018",
    "text": "Food and service could not have been better. Had a gourmet dinner with a local feel. Loved the brussel sprout appetizer and short rib dinner. Amazing food for a reasonable amount of money. Highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "9OFjtn0-a4D7t_E4nccaNA"
  },
  "gLxYrVKlqObHr1omynhoHg": {
    "date": "2/9/2019",
    "text": "Great lunches. Unique different and worth it. I ordered to go my husband and I agreed that it was fresh. A great option for our lunch break. I have only eaten here once but my husband eats here more often",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1J6NZD-FU09VFMZLHT-acg"
  },
  "PZx8Pfy_tgwOCgCKQNpJFQ": {
    "date": "1/5/2019",
    "text": "This restaurant never disappoints. Really good wine and beer choices. There are not many places in Pgh that have a Petite Syrah on menu which I always enjoy.  Menu is always unique with many options. We enjoyed Salmon and a fish/ shrimp dinner - both were awesome and complimented the wine / beer.  Enjoy the meal, atmosphere and great wait and bar staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_LjSleUYurbYYHKd8NN6Nw"
  },
  "dmon2QsAfp8fymNIStpP_A": {
    "date": "7/15/2018",
    "text": "We were able to get a last minute reservation on a busy Friday night. Our waitress was exceptional. She was so excited about the food and helped us with our choices. We ordered a Brussels sprout appetizer that was delicious. For an entree I ordered short ribs  My dinner companions ordered Crunchy Kale Salmon, Catch of the Day, Halibut and Spicy Salmon. My short ribs were some of the best I ever had. Very tender and flavorful. The others agreed their entrees were outstanding. The portions are perfect  We split an order of mint chocolate chip ice cream (super fresh and mint forward) and sorbet. Great dining experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ofGIqG1NvYV5w2Z1p4VB3A"
  },
  "6d1iRHv-Pzr9UTezKMEUXg": {
    "date": "8/23/2017",
    "text": "I don't even think I can rave about this place enough.  My husband and I try to go about once per week and have been doing so since shortly after their opening. Sometimes more, if we're stopping in for a drink or dessert. Between the two of us, we've probably had everything on the menu and haven't had a bad meal yet.  The food is phenomenal. I've tried so many new things at this place that I wouldn't have otherwise tried because everything they make is just that good. Seriously, if there's duck on the menu, get it.  I think my favorite part is the staff, though. Everyone is super friendly and knowledgeable, without being pretentious about it. They're just great folks with great food (and drinks!).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PnujbHo5J8CukjOWvC79Tw"
  },
  "B-Vtewei0dlDWzgVbr7Wnw": {
    "date": "7/22/2017",
    "text": "Just OK. I have been here a few times, and each time it was \"just OK.\"  On my most recent visit, I started with the beet salad, which was very mediocre. The beets were mushy and needed salt - just needed more texture. I ordered the scallops for diner and they were also just OK - nothing earth shattering. I also had a glass of Rose with my dinner and a cappuccino afterward. My bill, including tip, was close to $80, which is just too much for this place. . .",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AYj_UatVr0VZYi3TDtqZKg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AYj_UatVr0VZYi3TDtqZKg/o.jpg"
      },
      {
        "img_id": "D7mxvU_MJ4k30VYg0GonWQ",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. The underwhelming beet salad.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D7mxvU_MJ4k30VYg0GonWQ/o.jpg"
      }
    ],
    "user_id": "ARsqDLmxeIIo17ufeAnNkQ"
  },
  "UHfcOZ4QmNneVR2HITB1Bg": {
    "date": "6/14/2019",
    "text": "My husband and I got food poisoning from the salmon.  We called to report it, but the hostess was too busy to hear our story.  The food was great, but it was not worth the side effects.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AOcQr6D0u7MqothAHEL-5w"
  },
  "UWk0gX972PET2JXr3WMZxw": {
    "date": "8/8/2019",
    "text": "Beautiful place to eat. My boyfriends mom has a lot of allergies and the waitress was very kind and patient, taking the time to ask the chef if there was anything he could personally make to meet all of her needs. Dinner was delicious and dessert was even better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ehNHgr6zJUs434y83eEL6w"
  },
  "QWMEknLBDRGa5lafarQPUw": {
    "date": "9/21/2018",
    "text": "A friend recommended that we come here for lunch.  I got the lamb noodles...suffice to say that I had to resist the urge to bury my face in them and smother myself to death so that I could die happy.  I can't begin to properly describe this dish, words fail me. Some might say \"it hit the spot\", but that isn't True. More like \"it dragged the spot into a back alley and proceeded to beat it into a whimpering pulp\". It...it was just so right, so perfect, so complete, it soothed my cravings in a way I never thought could happen.  My coworkers were also very very complementary and enjoyed their meals.  I can't wait to take my wife here, or just go here again myself, whatever gets more of their food in my mouth the quickest.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "OuLNOhghERYxlusr8032Og"
  },
  "jEjK8iyoqC8LQ_8IpbHgsA": {
    "date": "4/15/2018",
    "text": "My husband and I went with another couple to try One Thirty One East and left knowing that all 4 of us would indeed be back again. I called that morning  (Friday) at 11am when they opened to make a reservation for 4 people that evening at 630pm and got it no problem. We arrived and were promptly seated upstairs. Oir waitress Danielle was such a treat! She was really nice, helped us with the menu, told us about the chef and how he prepares the dishes and checked on us throughout the meal at the appropriate times as to not be annoying but there when you needed her.  We started the brussel sprout appetizer! Loved it, I am already a huge fan of this veggie, but the Asian style preparation was such a nice surprise. O would recommend anyone try these even if you aren't a brusse l sprout fan, fantastic. I ordered one of the special from the menu, The Study of Duck.  I don't know what else to say beside the fact that the duck was cooked to a perfect medium, the confit of duck was moist and flavorful, cracklins fried to perfection, tender potatoes, asparagus and a delicious suck broth and butter sauce. My husband ordered the 14oz strip steak. Visually it looked larger than 14 oz and was so tender, juicy and delicious. Everyone at the table was surprised at how elegant it looked. One of our friends had the Mixed Grill special and the other had the Salmon Kale Crunch. Everyone cleaned their plates a d raved about the quality of the food and the impression playing of the dishes. Overall it was a fabulous experience and we will most definitely be back. Also, the Rhubarb Margarita is a fantastic drink!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RKGbaVZ-AHMQsh23KJfndw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Mixed Grill",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RKGbaVZ-AHMQsh23KJfndw/o.jpg"
      },
      {
        "img_id": "ecmUGYM3A3hwYyFJpUg0Bg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Salmon Kale Crunch",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ecmUGYM3A3hwYyFJpUg0Bg/o.jpg"
      },
      {
        "img_id": "moE7-Yv3rSByFtRW3ESlBg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. 14 oz New York Strip",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/moE7-Yv3rSByFtRW3ESlBg/o.jpg"
      }
    ],
    "user_id": "NUjPmuf284g5J6EGT-Uhjw"
  },
  "grovaEzbGypxZrW13hr3vA": {
    "date": "4/27/2019",
    "text": "I have eaten here twice now. Menu is way over priced for the quality of food. My husbands bolognese taste like chef Boyardee. Entrees are thrown together and so sloppy. I have no interest in returning. I have no idea how this place gets 4.5 stars.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7VTKTDeBfOXruwKajOlXtg"
  },
  "rAnsY2Jn4CT3cOME2vzeQg": {
    "date": "4/27/2019",
    "text": "EVERYTHING was incredible! The service, the stout & cocktails, the poutine appetizer... all wonderful! For the entree, I had the Lamb Noodle, my pal got the Salmon Kale Crunch, and both were perfection. They were flavorful (not just salty), and the quantity was enough that we were sated and had a bit to take home. We were seated downstairs on a Friday evening, which means we were adjacent to the bar that became a bit crowded as it got later. That's not a complaint, merely a warning that if you're looking for a quiet, intimate experience make sure you sit upstairs. I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DfFHG1cJ05MAPu6tFHWKIQ"
  },
  "y0S7m1pCK7veWBaN6N31sA": {
    "date": "12/18/2018",
    "text": "Great place for dinner and cocktails!  The chef owner is fantastic, and his wife is also part of the team!  The bartenders are friendly and the staff efficient and professional.    We've been back several times and always both pleased and impressed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SLXTVwB5NzRqEe5HcsQOFA"
  },
  "LKejogu207dknlnPMAe_Fw": {
    "date": "7/11/2019",
    "text": "Happy hour with Lee Kane starring as the bartender. What a great evening!! Lee Kane was fun, happy, and energetic. We will be back soon for dessert (tequila?). Go if you have the chance, you won't regret it. John & Cindy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kLMQFzfz4e5enaVpsqRAsQ"
  },
  "Kmn-1V80awvxDDeYv-PHKQ": {
    "date": "1/13/2018",
    "text": "I loved the atmosphere. However, I wish the music would have been a little louder, or the lights a little lower! Our server was great, and very encouraging for us to try specials. Would cone back!!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lyufAdjZYsNyjIYCm0m4bw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lyufAdjZYsNyjIYCm0m4bw/o.jpg"
      },
      {
        "img_id": "G4J4suYbA5Lr1KvJ6NOy9A",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G4J4suYbA5Lr1KvJ6NOy9A/o.jpg"
      }
    ],
    "user_id": "q7kb0GVCWOdORhOrRfkxbw"
  },
  "xIgbV44aUFihJfDCH-YSoA": {
    "date": "3/9/2017",
    "text": "We went at about 5:45pm- worried because I've heard that happy hour is slammin'. We were lucky to find a couple of bar seats and get started!  We started with a couple of cocktails recommended by the bartender- which I would guess could be considered a mixologist- because the drinks are to die for. FINALLY something close by that offers a good mixed drink. I'm a beer snob, and was impressed by their selection as well.  We had the poutine, hummus, and shared the fishermans platter. Good choice. Fries with the poutine were super tasty, hummus I would call \"just okay\" but the pita chips that came with were a hit.   The fishermans platter was very tasty. My only complaint is that I wish there were more than one shrimp because we were splitting- but that's just being picky.   Service was excellent, food and drinks were great. Would definitely return.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "v5Jcw0Yq9GWT3h3GngB8mw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v5Jcw0Yq9GWT3h3GngB8mw/o.jpg"
      }
    ],
    "user_id": "y_XgW02VKRwDKGhHq17yuA"
  },
  "_nmmK5XQspK-OLzEjxH9gQ": {
    "date": "3/4/2018",
    "text": "What a great find in Carnegie! The food was absolutely delicious! The prices were reasonable as well. We will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OPBHF2PwKifGuuX_Wv_lgA",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Appetizer. Fried feta, hummus, baba ghanouj.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OPBHF2PwKifGuuX_Wv_lgA/o.jpg"
      },
      {
        "img_id": "MryqrMZpBJT3Ihw4vawopA",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. The grilled seafood combo.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MryqrMZpBJT3Ihw4vawopA/o.jpg"
      },
      {
        "img_id": "jOBCHlZ52AZU9BbPibm1ww",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. I love a salad that comes with olives!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jOBCHlZ52AZU9BbPibm1ww/o.jpg"
      }
    ],
    "user_id": "T_mcCDS5mfVfGkYX799aBw"
  },
  "VxFdhHeWm8VVvzILt8VD4g": {
    "date": "4/9/2019",
    "text": "One of the most consistent, best tasting kitchens in Pittsburgh and Carnegie. I've been going here since they opened, and can honestly say I'm always impressed by their menu and specials. The bartenders and wait staff are extremely professional and personal. I've never been disappointed and will continue enjoying everything they have to offer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ksckszWpHkwSQp4Md-3rkQ"
  },
  "VXZKuw6LF0xbTv9ZpL2fHA": {
    "date": "4/9/2019",
    "text": "We wandered in on a random late night and I was so pleasantly surprised! Everything was above average. The veg lentil chili was the best I've ever had. The prices were mid range. I can't wait to go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6noX2ntJipgZPZAvDFSqVg"
  },
  "74_RRPytE5cqbgzvdU_VwQ": {
    "date": "6/14/2018",
    "text": "I stopped here with a friend for a quick drink on a Friday evening. The vibe is chill, and the bartenders are really knowledgeable on the drinks they have. My friend actually picked something that wasn't on the menu that was recommended by the bartender. She loved it! The restaurant is on the top floor and the bar is on the main floor, which is kind of weird but also nice to have the separate spaces. I will def be back to try the food, it looked great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iCXJ3gO2GhopYHmfmnktfw"
  },
  "4SkSHRT02jgxkgJN3zpxlg": {
    "date": "12/29/2018",
    "text": "We had dinner last night and were blown away. Everything about the food was top notch. I had crab bisque and paella, and both were truly great.  We eat out quite a bit and the food quality was really nuanced and excellent. Then the dessert...  They have an ice cream with a bourbon sauce and bread pudding to die for.  Bonus: Chef came out and talked with us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y727pup4TwYMvHlkJvd8QQ"
  },
  "nmXuJmm85WVwv7_EnUb3oQ": {
    "date": "11/3/2016",
    "text": "If there is only one thing you order from this restaurant make sure it is the brussel sprouts appetizer. it comes fried, mixed with fresh ginger, wasabi aioli, and topped with wontons for $8.00. Stopped here for lunch since it was a gloomy day and found it next to the pay parking lot of Carnegie. Please note that lot is free after 6:00 pm.  I arrived at lunchtime and given a choice to sit upstairs or downstairs. I choose upstairs. The bar is located downstairs and has less seating. There seemed to be only one waitress attending to all the customers who came in after me so it was a little bit of a wait to get served but I told her my car was on a meter and she accommodated my wishes.  I was debating between one of their lunch specials that day which happened to be fish tacos or the lamb gyro. She told me the gyro is sliced very thin and is filled with feta cheese, tomato, tzatziki, on grilled pita bread. I did ask about the flatbreads and was told there are 5-8 slices in them but I could always take whatever I wanted home with me.  I opted for the lamb gyro with a side salad. Any one of their sandwiches gives you a choice of a side salad, French fries, or pasta salad.   I got the brussel sprouts first and believe me they were so good and a bit spicy to boot. By far these alone were the best I ever had! I got my gyro shortly thereafter. The gyro was HUGE but the side salad was small and disappointing. It only consisted of mixed greens-nothing else except dressing. She did give me extra dressing and tzatziki sauce. I was glad in a way the salad was small because there would have been no way I could finish that delicious gyro. It was very tasty and I haven't had lamb in quite some time.  In spite of the crowd this waitress was very attentive to my needs and although I spent a little more because of the appetizer, I would most definitely order that on a return visit. The place is casual and laid back and believe me even though she offered me a dessert I politely declined.  Lunch is a great time to go during the week since you don't need reservations and the place doesn't get overly filled. Next time I will try out one of their flatbreads with the brussel sprouts.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 12,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "olSdlR9bAyY1LtkQJHqgLg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Lamb gyro and salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/olSdlR9bAyY1LtkQJHqgLg/o.jpg"
      },
      {
        "img_id": "o5uuikoBibJxuQZ-4VOnXw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Their signature Brussels sprouts",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o5uuikoBibJxuQZ-4VOnXw/o.jpg"
      }
    ],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "QwdkhFFcq0CwMRfdjkp0Yw": {
    "date": "5/1/2018",
    "text": "Oh my goodness what a wonderful way to spend an evening. Molly, our server, was so friendly and knowledgeable. Her recommendations on both food and wine were on point. The asparagus and smoked chicken soup was creamy and loaded with smoked chicken. The scallops were divine, perfectly cooked and so good. They had a duck special the evening we visited that was just the fanciest comfort food you could ever want. It was served with croquettes that we could have eaten 100 of and the duck was again cooked wonderfully. I would absolutely return and recommend to friends.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tmvYYqXiz3I235x-SSOeTw"
  },
  "nv2Fz9DdZlfaeI6IbOQGAA": {
    "date": "6/18/2018",
    "text": "This is one fine dining establishment in Carnegie! The bartenders are always nice and welcoming, the food is delicious and consistent and the wait staff is always attentive and great. The food is different and always very good with enough to bring leftovers home!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BxyzMzUjuJGLBjO_Hjqp5A"
  },
  "Ddw4AzzP-eAhSMik5GVRkQ": {
    "date": "2/19/2019",
    "text": "This place is one of my absolute favorites!    The meals, drinks, and desserts are all equally amazing.  To add to the enjoyment, the staff is always a delight!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rOn4vVyAVEwJxqxDRoCTwg"
  },
  "072UEfFtuFCP5p1MvcHE2g": {
    "date": "5/9/2019",
    "text": "Seasonal FRESH food with a Mediterranean flare.  Never thought i would like strawberries with salmon but...  WOW!  Crowded on a Tuesday- this place is no joke.  Great cocktail specials menu too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4rYg5UywNqmKywRWJXOp4g"
  },
  "1g3MXyp-8L070_kHAgyqSw": {
    "date": "9/6/2019",
    "text": "Had a specialty cocktail, two salads, the lamb noodle and a pork tenderloin special dish. Salad was perfect. The lamb noodle dish was EXCEPTIONAL!  I didn't know I liked lamb until I tried this dish. It is savory, tender and makes you feel like a cozy featherbed and fireplace kinda night. Total bill was $87 which was a bit pricey but worth the exceptional lamb dish! Oh and Jase, our waiter, was very attentive and gave great recommendations",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TdhxVORV718RD0Py67wSLw"
  },
  "5O46SzwXqtXazV_niEqOWA": {
    "date": "7/10/2019",
    "text": "So the first round scallops with a Mediterranean flair perfectly cooked great pairing with the fresh tomato sauce and greens.  Crispy Brussels sprouts with a balsamic reduction wonderful flavor excellently prepared.  Second round poutine and flatbread. Who cooks down their own lamb stock?  For gravy on frys with Fresh cheese curds  they do!  Flatbread with tomato jam and 3 cheeses. Now on to desert ghost peppers chocolate f#@& kill me and berry mojito wow glad we came here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "b_YQ9kBssNT82LVxeeFN9w",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Cinnamon chocolate and GHOST Pepper  OMG Kill me now",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b_YQ9kBssNT82LVxeeFN9w/o.jpg"
      },
      {
        "img_id": "Ig4dfhtIqZnXUAVm5RF5dw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ig4dfhtIqZnXUAVm5RF5dw/o.jpg"
      },
      {
        "img_id": "Q6vVSn7HB4xCkJoIlJcMfQ",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. scallops and Crispy Brussels sprouts gone gonegone",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q6vVSn7HB4xCkJoIlJcMfQ/o.jpg"
      }
    ],
    "user_id": "g94Ml1oo2qQe_iGBJL8nAA"
  },
  "JdeaHJzb8ai5iV8oxTyhXw": {
    "date": "7/8/2019",
    "text": "A few weeks ago, my boyfriend and I had a babysitter and got a couple hours to ourselves and we decided to visit One Thirty One East for happy hour. Happy hour is from 5-7, and we arrived around 6ish. Since it's located on the main drag of Carnegie there is only street parking available but it's usually pretty easy to find a spot. We were seated right away and decided to sit outside to enjoy the sun, you know, since we don't see it often here in Pittsburgh.  We each looked over the happy hour menu quickly and decided on the rhubarb margarita. Margs are my absolute favorite drinks, so this was a no brainer for me! I loved the tart taste of the rhubarb, and you could definitely taste the tequila. For our second drinks, I got the Comrade Basil Collins and my boyfriend got the Ginger Pimm's Punch. Both drinks were good, but I definitely liked my Collins a bit more than the punch. Ginger beer has the tendency to be overpowering, though the punch did taste good.  The real star of our visit was the delicious poutine. It was seriously one of the best things I've tasted! It was my first time ever trying poutine and I don't know why I waited so long to try it. I've always loved fries with gravy, but the cheese curds take it to the next level. Since it was during happy hour, the fries were only $6 and it was the perfect sharing size. Our entire check was hardly over $30 for a few drinks and a bite to eat, and you can't beat that. I'd love to come back to One Thirty One East in the future for dinner or even another happy hour!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "R8jDyRFAnKH0rreepiKlMA",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Rhubarb margs during happy hour - $6",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/R8jDyRFAnKH0rreepiKlMA/o.jpg"
      }
    ],
    "user_id": "1VVHf1BvtGC0aSCCIjQyiA"
  },
  "YCzSDn9iRkNTnGAQKIEUFA": {
    "date": "6/22/2019",
    "text": "Fabulous meal here tonight with Kate waiting on us. Began the meal with foie gras with crispy pork belly, fried green tomato and crispy onions and an order of the amazing charred Brussels sprouts. Our cocktails were perfection- the ginger Pimms punch was very good and thankfully, not too sweet. Loved the sip I had of my husband's Mott and Mulberry!  Between the three of us dining this eve, the steak, scallops and halibut were all cooked perfectly and out of those the scallops were probably my favorite. The roasted veggies were just ok, they could have used some seasoning.  Steak was cooked perfectly to medium and he halibut was excellent too. Can't go wrong with anything on their menu.  Great Job one thirty one! Love the fresh flavors on the menu.  Oh and my Barrel aged Aviation was light and refreshing- perfect pairing to my dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RgVqEq9GRcLBM2qPdRobjw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Little foie gras and charred Brussels sprouts on my appetizer plate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RgVqEq9GRcLBM2qPdRobjw/o.jpg"
      }
    ],
    "user_id": "5Kccf2-UZdtCSHNRvl9Srw"
  },
  "Lrz1Q321S9oUr7suVx5trQ": {
    "date": "4/8/2019",
    "text": "Previously enjoyed dinner at this establishment. First time for happy hour and really loved the balanced choices of quality food items and drinks, all for $6 each. Also happy hours times are 5-7pm, the way it should be. :)  We enjoyed the baba ganoush, sausage flatbread and poutine and all were excellent!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "sv8H7J8v6xrP1dzlnJtlRg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Happy hour menu. Tue-Fri 5-7pm",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sv8H7J8v6xrP1dzlnJtlRg/o.jpg"
      }
    ],
    "user_id": "tR12WeWha2DGhUrKcvTttQ"
  },
  "CSIGM60X_pCaDn93-71VJQ": {
    "date": "2/10/2019",
    "text": "Just Wow! We did a date night here and might be skipping downtown now and make this a regular. We started with chef tacos and a soup, white bean, roasted garlic and gorgonzola. That soup was the best soup I have ever had at a restaurant. The tacos were tastey perfectly cooked and that hot sauce is perfect. Then for dinner we both got dishes with scallops. Seriously the best scallops in pittsburgh. The crab bolgnese was seriously so good. Been dreaming of it.  Lastly was a blueberry cobbler cheesecake. Drooling just thinking of it.  Skip downtown and come here. Great drinks, food and dessert. Also best scallops.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xnlNJU4Kr11xylwDdi7AYg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Blueberry cobbler cheesecake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xnlNJU4Kr11xylwDdi7AYg/o.jpg"
      },
      {
        "img_id": "omSjRUawLn_nzqi3iGtavA",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Spanish style scallops and salmon - best scallops in Pittsburgh",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/omSjRUawLn_nzqi3iGtavA/o.jpg"
      },
      {
        "img_id": "T7jUaD4fUVAtwOwEBWqkJA",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Spanish style salmon and scallops",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T7jUaD4fUVAtwOwEBWqkJA/o.jpg"
      }
    ],
    "user_id": "IdbaRCFtRUzmu3AZjNc_rg"
  },
  "mL9ecMCWuobnSDk-h5cW8g": {
    "date": "11/28/2018",
    "text": "I stopped in here for dinner on a weeknight before an event with a girlfriend. We were seated right away by a friendly hostess and greeted by a very kind server.   She noted that they have specials that are typically very popular but that they change so frequently so get them while the last!   I started with a seasonal beer on tap and we decided to share three small plates / appetizers. Our waitress told us that the Brussels sprouts are by far their most popular item and she wasn't wrong - wow were they good! Very caramelized and melted in your mouth.   We also tried the caramelized onion and fig flatbread which didn't overwhelm me and the duck fingers which were very good.   We didn't stay long because we had to get to the event but I enjoyed the atmosphere and the service and would love to go back and try some main courses!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "mXtndFyoGddtRjWtQxCvkw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mXtndFyoGddtRjWtQxCvkw/o.jpg"
      }
    ],
    "user_id": "LaiylSIbrA3aPvOYtl-J4A"
  },
  "mS105zoa2YKa9KQGcb8AxQ": {
    "date": "9/1/2018",
    "text": "Hubby and I went here for dinner tonight after drinks at Quantum (seriously people, you have to go to Quantum).  We had the Poutin as the app which was so yummy.   I had the Melbec Margarita which was so different. If your a fan of only Melbec or Margarita you may want to think twice about ordering this one. You really need to love both, and together. It wasn't bad though, just very different.   Dinner was very good. Hubby had the port rack chop which was the tallest pork chop I had ever seen. The sauce was very good.   I had the short ribs which had the same sauce as the poutin along with asparagus and squash. All was cooked well and very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IjHG6ydgiPoJVK4FG9wkKw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IjHG6ydgiPoJVK4FG9wkKw/o.jpg"
      },
      {
        "img_id": "pIzPmc8QWbDeYmpy_jzCRg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pIzPmc8QWbDeYmpy_jzCRg/o.jpg"
      }
    ],
    "user_id": "-0Xu57zrI3Rxi8wGZsnWKQ"
  },
  "Z2Psu_vyB1Hn4VQQUnMUTg": {
    "date": "7/21/2018",
    "text": "Came here for happy hour this week and had a great experience.   My friend and I ordered the rhubarb margarita and Collins cocktail for drinks, and the fried feta and sausage flatbread for apps.   The cocktails were perfect-unique combinations and generous alcohol content. The fried feta was one of my favorite appetizers of all time. Feta wrapped in phyllo dough, yum! The sausage flatbread had a great kick to it.   I'll definitely be back to try new cocktails and apps for happy hour!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3D1bJFMVaB1Pg6odRRcfPA",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Fried feta",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3D1bJFMVaB1Pg6odRRcfPA/o.jpg"
      },
      {
        "img_id": "5KdFHu7B3a7vAqnt4pHfDw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Sausage flatbread",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5KdFHu7B3a7vAqnt4pHfDw/o.jpg"
      },
      {
        "img_id": "L5kmHyB82MeClFcr6wh60g",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Rhubarb margarita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L5kmHyB82MeClFcr6wh60g/o.jpg"
      }
    ],
    "user_id": "bcf5X_2LTrCw-s4YPsCmKg"
  },
  "cg-N2m8REu5-07SskGVuQA": {
    "date": "6/15/2019",
    "text": "This review is based only on drinks at the bar during the Carnegie Crawl June 2019. After looking at the menu & reading the reviews I would definitely like to return & bring some guests for dinner. They have a small downstairs patio along Main St & also outdoor patio tables upstairs. The bar seating is fairly large with maybe 15+ stools. They have an upscale menu & many items looked worth trying. They also have a full bar with craft cocktails. The place is a bit pricey, so definitely a spot for cocktails or special occasions or date night. I had a Tito's dirty martini with extra olives which was mixed perfectly. It also cost about $10, but I'd guess going rate for craft cocktails in Pittsburgh is now close to matching other major cities at $9-$14. And a dirty martini isn't exactly craft. There is a parking lot & street parking. However don't park in other lots for other businesses they will ticket ($20) & even tow. Hope to be back & try the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FiRdPLxCBdauoNKkm0z5yQ",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Tito&amp;#39;s dirty martini extra olives",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FiRdPLxCBdauoNKkm0z5yQ/o.jpg"
      }
    ],
    "user_id": "dNREuxkWYW3Op83kQiQdWA"
  },
  "qHzuREWwwsPnawY_6iAh_w": {
    "date": "6/8/2018",
    "text": "After 3+ years living in Carnegie, my boyfriend and I finally made a trip to 131 East! We'd been saving it for a special occasion, and were super excited to try.  We stopped by around 6pm on a Friday evening. The downstairs bar & tables were full, so we were taken upstairs to a larger seating area. We ordered drinks and a poutine app to share to start. The poutine was rich and delicious! It was also the perfect size for two to share. A generous and filling portion.   For the main course, I got the duck pasta and my boyfriend ordered the chicken and grits. This was my own lack of attentiveness when ordering, but the duck pasta ended up tasting very similar to the poutine (thinking back on it, they had a lot of the same ingredients, just one had pasta and the other fries). However, I thought both dishes were delicious! I ended up packing some to go since the heaviness of the gravy and cheese got to be a bit much for me. The chicken and grits were very good as well as a generous serving. We opted out of dessert since we were too full, but are looking forward to another trip back soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "l6KkiVORtOgaqr3sKfAWtg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/l6KkiVORtOgaqr3sKfAWtg/o.jpg"
      },
      {
        "img_id": "_FgjftsRIizxr_GLqVMw5w",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_FgjftsRIizxr_GLqVMw5w/o.jpg"
      },
      {
        "img_id": "S88WG6D9-T9sJoL-wip3cQ",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S88WG6D9-T9sJoL-wip3cQ/o.jpg"
      }
    ],
    "user_id": "MoFYvOoufOMyVTmUFAhRxQ"
  },
  "1IDAmrgDeRqIocrYayDP_A": {
    "date": "4/19/2018",
    "text": "On my radar for quite some time... so excited to finally check out 131 East!!   I must admit my expectations were met.   First off ...I love the fact that reservations are taken.. AND you can even request seats at the bar - near a television yet!   There are only a few tables on the first floor - mainly the bar.. the dining room is upstairs.  Walking in.. cool lighting. .. trendy feel .. and the staff were extremely friendly.  I received just a good vibe from everyone.  I felt very comfortable at the bar.  Since I am not a fan of seafood..  trust me if you are like me theres plenty other items on the menu to chose from other than seafood.  It was actually a refreshing menu... nice variation of items.   Happy hour pricing for cocktails and select appetizers was on point!  Hot Sausage Flatbread:  Ideal size to share and cut in portions that were easy to eat.  Very delicious.  My friend highly recommended the Poutine since I was starving.  Poultine: fries with gravy - \"Lamb\" gravy with fresh cheese curds.  The appetizer portion was pretty big and ideal for 2-3 individuals to sample.  Who doesn't like fries with gravy and instead of beef gravy.. lamb!?  Well it was just wonderful and unforgettable!  The cocktail menu ..  so many great drink recipes to chose from.  I decided to order the \"Rhubarb Margarita\" ..  it was so good and made me smile instantly!    I'm a tequila lover and it was right up my alley.  I recommend.. it wasn't over the top sweet.. it was just right. I was so full after sampling two appetizers.. and the cocktails..was disappointed.. because theres so much more I wanted to try!!    Parking lot just across the street - or off street parking. Prices are average.  Thank you One Thirty One East... for a wonderful first visit.   I will be returning very soon.  Cheers!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 9,
      "cool": 5
    },
    "photos": [],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "rfwt2xQ9ASPKf-XZppXuiQ": {
    "date": "4/29/2018",
    "text": "Came here for a solo dinner after I carefully researched on Yelp. ;) It is at a corner with kind of a wrap-around terrace and a narrow and long to the back dining room inside. There was a choice of upstairs or downstairs and I chose downstairs. I had some house mix olives and fried pita chips with babaganoosh with a glass of Austerity Cab 2015. For entree, I chose the bolognese pasta topped with grilled seafood, which is very unique because Italians don't mix seafood with meat, and parmesan cheese on seafood. I liked everting except for the parmesan cheese on my grilled seafood. I just don't think they go well together.  But other than that, it was a very pleasant experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "wCcip7qmCeaMBQGmRQcjDg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wCcip7qmCeaMBQGmRQcjDg/o.jpg"
      },
      {
        "img_id": "8SbaoeH9B28HGz4XqilnkA",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8SbaoeH9B28HGz4XqilnkA/o.jpg"
      },
      {
        "img_id": "nafKQMb1v-avMvnNoB-2Dw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. &amp;#34;Mixed Grill&amp;#34; = Grilled Sea Scallops, Halibut and Shrimp on traditional bolognese bucatini.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nafKQMb1v-avMvnNoB-2Dw/o.jpg"
      }
    ],
    "user_id": "QhCfs4lkeWdJx7_lZdfCSA"
  },
  "Re3dEraZpVHa7HxDOyxLMA": {
    "date": "7/11/2019",
    "text": "I feel like I waited forever for this Carnegie gem to open! I have dined there a half dozen times and have never left unhappy. Although the braised short ribs are my favorite entree, I have also enjoyed the many appetizers and flatbreads. I would be remiss without extending a high five to the bartender and awesome servers. Convenient parking next door. Eat indoors or ask for a table on the balcony. If it was not already perfect, bring your favorite bottle of wine and give the bartender a break!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WFrDcWoDNAjcwP_1j6WKmg"
  },
  "koU-tDpgxGFdFomDqyLtJQ": {
    "date": "3/8/2018",
    "text": "I can't say enough good things about One Thirty One East. Every time we dine here, whether it be for simple drinks and apps or a special dinner, it's fantastic every time. Chef Bernie is passionate about the food he puts out, and the satisfaction of his customers. Obviously a perfectionist and an artist, the owner takes True care of what comes out of his kitchen! So happy to have a place so close to home that is absolutely excellent. Thanks chef!   Favorite things: Brussels sprouts, deviled eggs, scallops entree & veal shank. Can't go wrong at 131!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v39-wtj4n3fOHFPfgW7KJA",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v39-wtj4n3fOHFPfgW7KJA/o.jpg"
      },
      {
        "img_id": "dmu-JvTwB8wO1la58g36Xw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dmu-JvTwB8wO1la58g36Xw/o.jpg"
      },
      {
        "img_id": "9DlTozyOgBiChDA0hTte4g",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9DlTozyOgBiChDA0hTte4g/o.jpg"
      }
    ],
    "user_id": "RDwjMJ-SB3ysZ1p0PRpQkg"
  },
  "8rmIX_mRvmT1juwhDBv_-A": {
    "date": "7/15/2019",
    "text": "What a great meal! I made a reservation for my husband and I for 6pm.  We arrived and were promptly seated.  The waitress did an excellent job explaining the specials.  We ended up choosing the Mediterranean Sea scallops as an appetizer.  Two jumbo scallops served with spinach feta and roasted tomato and a homemade ranch.  It was delicious.  For our entrees I chose the Sesame crusted Seared Tuna and my husband got the New York Strip Steak with fingerling potatoes.  Both meals were excellent.  I highly recommend One Thirty One East.  It was one of the best meals I've had in a long time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wOqQi4t372Ndv1gzLjtIJw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Sea scallop appetizer and my blood orange cosmo.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wOqQi4t372Ndv1gzLjtIJw/o.jpg"
      }
    ],
    "user_id": "ITQgQtzaB-ZTRXxkBbYNTw"
  },
  "C8fvD-XSpChhUQsMj4ckcw": {
    "date": "6/20/2019",
    "text": "We had excellent service and all of our food was delicious. Maddy was a terrific server and her guidance on choices was top notch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cmPMAzqzrekL0_pYN2gtKA"
  },
  "sNk2FvqOAi761tzHsq5njw": {
    "date": "3/23/2019",
    "text": "I have been to this restaurant twice- both times the food was outstanding. The food is original, beautifully plated with marvelous sauces. Highly recommend. Martha Raak",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BtEQDbwjBbGcP3caKdbcww"
  },
  "ZYkFEMMlYSGrapCNKEW3TA": {
    "date": "5/17/2019",
    "text": "Horrible service. There were only three people in the restaurant and for some reason the waitress would only wait on the other two parties. I was meeting a friend for lunch during work and and we were there for over two hours. Food wasn't even good. Would not recommend",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Txk13aVaHfnnygiYMLV6lg"
  },
  "mh5_AY3XA9zNKdJpsrjpNA": {
    "date": "8/12/2019",
    "text": "I would not have thought Carnegie was harboring a gem like this. Was there for dinner on a Saturday night, and got great friendly service. And the food was excellent. Wasn't cheap, but definitely worth it. Nice selection of cocktails and wine, too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nikEpWfS7oQwza8EYe68ug"
  },
  "wjq1Rb2H6Td6YKLgTPhHuA": {
    "date": "6/7/2017",
    "text": "This was a pleasant surprise to find in Carnegie. We had dinner & drinks on a Tuesday night. The food was excellent and the staff was friendly. There was no wait to be seated, but it was a reasonable crowd for a Tuesday. It's also fairly convenient to I-79 in case you're passing through the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pwcN_-0gWhnIad8Er5phSA"
  },
  "k-MlQjWreUBETxXX_MGw1g": {
    "date": "6/4/2016",
    "text": "Delicious. Not cheap but well worth the dollar if you value innovative takes on traditional dishes. We returned nothing but clean plates to the kitchen after having the pig wings, soft shell crabs, mixed grill and soup du jour.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EvvQDzaY3birj8ifn50AzQ"
  },
  "zmicmDZMIcQ6MYI0syOgnw": {
    "date": "4/16/2016",
    "text": "Both the food and cocktails were outstanding.  It's not often that both are so wonderful.  Also, the service was great and the atmosphere was very nice.  You have to try the brussel sprouts!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dlYWvO6H80qteMucEVPeKg"
  },
  "AbcyUdDU8u2c1WZEQf0amw": {
    "date": "3/24/2016",
    "text": "Second time here for lunch. Such a beautiful place. Best lamb gyro I've ever had! Cous cous salad is out of this world. Great Brussel sprouts. Expensive wine...but the balcony in the spring for lunch is too wonderful to make that an issue. Love this spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r4AlZDY-LXlL2v-Yr80nnQ"
  },
  "a1nSTsbJ44dNbeWj1G5rWA": {
    "date": "5/5/2017",
    "text": "All the positive reviews are all True. I looked for a new place to try and read the reviews. My wife and I loved everything about our dinner experience. The food was amazing and the service was a 10 out of 10.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cCY93Q1luAVu1cibtH-I0w"
  },
  "YpVYS27Qf2dGG_E1prI8-w": {
    "date": "4/19/2016",
    "text": "Stopped in for lunch on a Friday.  No problem getting a table and the staff was very accommodating and informative.  The chef even stepped out to support hello, which was very welcoming.  I had the tuna melt, which was delicious and my friend had the fish tacos.  The French fries were also a treat as the are a bit different from most other places.  Will definitely be stopping back in for a dinner soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hgm361DB0GcBe51lh6XrXg"
  },
  "ozdvvUTTv1RCh6SPJdjFgw": {
    "date": "11/6/2015",
    "text": "Scallops were amazing! Good service and nice atmosphere. Will definitely be going back for the scallops alone, though the cocktails were enjoyable as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "joN2h3YIn99bsBsTJ0UffQ"
  },
  "As0WwyRgnezKMFUIwsfB3w": {
    "date": "1/8/2017",
    "text": "Loved this place, great service and food. Started with fried oysters and had roasted chicken with grilled veggies and grit cake.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kwjEKgiBo6cTVyD6A97Qag"
  },
  "XRD5-cI5otlifhKSOB4q6w": {
    "date": "8/30/2015",
    "text": "Went there las night with my husband and daughter. We didn't have reservations but they sat us right away. My daughter is 10 months old so it's always a gamble when we take her out to eat.   I got the impression that they didn't have a lot of younger children often I'm the restaurant. The hostess was very accommodating. Wiped off the high chair for us - which is actually the first time that has ever happened in any restaurant we've brought our daughter to.   We were seated at a super small table which was kind if annoying but the waitress checked the reservations and helped us combine two if the smaller tables to give us more room.   The food was excellent. We had the stuffed hot peppers and the tuna poke for apps. Both were delicious. My husband ordered the sausage flatbread for his dinner and he lived it. I had he hangar steak. Perfect.   There were only two annoying things about the evening. Our food took forever to come out. I think we waited an hour after ordering.  And anyone who has gone out to eat with a baby knows the trick is to give them stuff to eat. We'll of course my daughter made a bit I a mess on the floor (which I cleaned up) but the rest of the employees kept walking by and giving us and my daughter dirty looks which was kind of uncomfortable.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-FJeaAvhrhZcSkE5WBP8Q"
  },
  "6BPByhHLxmLOKoCHBYS4gw": {
    "date": "8/13/2015",
    "text": "I had the pork chops and my friend has the pork chop noodles. Both were top notch, fantastic. Pork chop was 1.5\" thick and pork was cooked to perfection! I'll eat here next time I'm back I the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xZfrocKYG_vYlKxPww5q7Q",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xZfrocKYG_vYlKxPww5q7Q/o.jpg"
      }
    ],
    "user_id": "SwkmuQLjosvKSBBnEyiM0Q"
  },
  "Ty6QIi6KkdnW93frpOjEzg": {
    "date": "9/25/2015",
    "text": "Great service and interesting drink menu.  Great to have another quality alternative to the chains that exist along the 376 Airport West Corridor.  We found the menu to be intriguing and with decent vegetarian options for my wife.  Both of our dishes were well prepared and had excellent flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XZBraT1FxXcxC7M9hTp8wA"
  },
  "wMBEHH1-GU97kje7dPq7fQ": {
    "date": "11/14/2015",
    "text": "Food is always excellent. Would put this place  up against the best restaurants in Pittsburgh. Staff is super friendly and seem to enjoy the food as much as I do.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8nWKj63wDEXceXqif-JPA"
  },
  "fMDMHxDKzXF6ht5NuSYn3A": {
    "date": "7/25/2014",
    "text": "Great neighborhood spot in Carnegie. Definitely what Main St needs! The crispy swordfish was delicious as was the hanger steak. Service was attentive and we had a great dinner! Will definitely be back to try more items.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "P6rcIYjajPYbpNk1XhyEIQ"
  },
  "PaZsd_nCc1LYodoq9dvPfg": {
    "date": "5/11/2016",
    "text": "What a great Yelp find from the hotel.  Closer than downtown PittsB and I challenge a better atmosphere to be found.  Try the daily specials and the Brussels Ap, you'll be happy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8IQR7o28Sd0qZPrFsCcyuw"
  },
  "ZJjR6UKPBf0SPJ6GFMeOjQ": {
    "date": "3/28/2015",
    "text": "This place was terrible. My girlfriend and I went there to have a nice meal and we were asking the employees questions about the business and all our questions went unanswered and the service wasn't good at all.  and the food was not good as well. I don't recommend it",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2PT72r95F_MfpxASS2pa0w"
  },
  "xgdkOwrGdCEWNKd0Hycmpw": {
    "date": "5/21/2014",
    "text": "Very happy that something decent moved into Carnegie!   The prices seem a bit high, but then I saw the portions (which are large and delightful)   Decent wine listings and cocktails as well.  I plan to make it a happy hour staple!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "LMXbXEnRYCDz21_7OUuRFg"
  },
  "VW4rU4_HeOknOTmtuI1Jug": {
    "date": "6/27/2015",
    "text": "Searched for a place that was close to our hotel for dinner on a Friday night, found one thirty one and I'm so glad we did.  We didn't have reservations but we're able to get outdoor seating. We decided to share the hot sausage flatbread and the short ribs. The flatbread was topped with ground sausage with a spicy kick, it's balanced out by the cheese,great with a glass of wine. The short ribs were very tender and served with orzo, asparagus and a very flavorful sauce.  Our server (Steve) was pleasant and engaging, he thoroughly explained the menu and was able to answer all questions about the preparation of various dishes.  We had a great dining experience and will,dine here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6xkBgMf-55xnMj6dumQp5g"
  },
  "5vrC7bMJsFGzsAS4VOCwEw": {
    "date": "8/7/2014",
    "text": "We eat out a lot and I rarely find a place that I can't wait to share with my friends and family.  We loved it here. Excellent food, service and atmosphere. I would highly recommend the pork chop!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4v3NypRa4KdzW7RHWyk2DQ"
  },
  "r5gUOCKusZWPMT2_daK-LA": {
    "date": "3/17/2015",
    "text": "Met some friends for dinner and was really surprised with the restaurant, service and food! The restaurant is pretty roomy.  There are two floors and the upstairs booths are spread out which I liked.  (Cant stand when you are sitting on the table next to you and hear their whole convo)  The decro is modern and very upscale.   My hubs and I ordered a caramelized onion, Gorgonzola flat bread.  It was thin, and crisp and really tasty.  I high recommend.  I ordered the Salmon and my husband ordered the short ribs.  He had nothing left on his plate but bones.....I guess he liked it?!?  My salmon was really good.  The plate definitely had a lot of food.  The broth that the veggies were sitting in was quite salty, which other yelpers had commented on also.  I liked it because I like my food on the salty side.     If you dont like a lot of salt, you may want to mention that to your server.  (My husband commented on the salt level of his food too)   My husband couldnt resist and ordered the peanut butter and chocolate cheese cake.  Im a  huge cheese cake snob and this was GOOD!  The cheese cake was thick and not too sweet.  It is a big piece, so you may want to share.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qQRmnbKI84Up4a2MBFfaFg"
  },
  "CIa-zNzMfAHi1kwEWD9KDw": {
    "date": "10/15/2014",
    "text": "Dropped in for dinner with a friend. although we were not that hungry we did order a flatbread with onions and fruit which was incredible. we also had the brussels sprouts which were such a treat on the fall evening and were some of the tastiest I have ever had. We also had the 131 salad which had a flavorful dressing on it. This place is going to be very busy very soon. With that said on a Tuesday evening it was pretty busy and the service was impeccable. Will we be back..definitely.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i-yUVCsYs0ZTyYXv6NmrYQ"
  },
  "26buPQEm1s8Zc8IvUMawVQ": {
    "date": "12/15/2015",
    "text": "Had lunch there recently and everything was excellent.  Very cool atmosphere for a place in Carnegie.  The bartender who waited on us was friendly, attentive, and helpful.  He knew every detail about the menu and gave us good recommendations.    We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TEDE60CGlE14d8294Zd04A"
  },
  "NInydqe9f3P8LY58aH9ogw": {
    "date": "4/25/2016",
    "text": "I always love a trip to Carnegie. This past Friday was no different. Beautiful weather, a bustling little town - what's not to like? I met a group of 9 for dinner at 131 where we wined and dined the night away on several appetizer bowls of their Crispy Brussel Sprouts, a variety of entrees including Salmon, Paella and Flank Steak and a few salad/flatbread combinations. I selected the 131 Salad and the Tomato Jam flatbread. Neither disappointed. A good side salad can be hard to find, but this one was delicious and full of fresh ingredients including peppers and pears. I wasn't starving, so I only ate half of my flatbread, but it was a wonderful half. Two other guests tried the two other flatbreads and they looked equally exquisite. I didn't hear any complaints aside from a maybe less-than-perfect paella, but all told everyone enjoyed their food. The service is a touch on the slower side, so something to remember when planning your evening - especially if you're dining in a larger group or heading across the street to the theater. Next time, I'm staying for dessert!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "-ARdx8hOcEWlMDjzwLYZ_g"
  },
  "3xzioixGz35-LLjqImmsnA": {
    "date": "10/11/2017",
    "text": "just a quick note-we were back to 131 this past sat. apparently, someone read my review because our waiter said the the group sitting at the window, asked for the tables specifically when they made their reservations! your welcome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xZknZsB-yxEQbI8JLollXw"
  },
  "CKg3KNrXvsYva94ozOqICQ": {
    "date": "5/1/2015",
    "text": "I stopped by here this past Friday evening with my wife and another couple for dinner.  The inside of this restaurant consists of two floors and is pretty nice looking.  We had reservations and so checked in at the hostess station whenever we walked in.  Due to that all that I could see of the first floor before we walked up to our seats on the second floor was a pretty crowded bar.  The second floor ended up being pretty nice as there was ample seating and the room area was a fairly open floor plan so there was a lot of natural light.  My wife and I decided to start the evening by ordering the Bob's Basket.  This consisted of flash fried shrimp, fried green tomatoes, caper remoulade, 131 hot sauce and lemon brown butter.  It wasn't what I was expecting whenever it came out as the shrimp were in what looked like a tiny fryer basket and the two tomatoes were layered next to it with the caper sauce on them.  However it ended up being delicious!  The shrimp were fried nicely and had a little crisp to the outside of them while the fried green tomatoes tasted nicely too even if they didn't have the full acidity that I was expecting form them.  What really elevated the dish though was the sauces, each of which was fantastic.  For my dinner entree I decided to go with the Hanger Steak, ordered medium, which came with rosemary fries.  The steak ended up being cooked perfectly and although it was a bit smaller than expected, tasted really good.  My fries were also delicious as they were crispy and I really enjoyed the flavor of rosemary on them.  The bottom line for me is that I would head back here again in the future.  My wife and I both loved all of the food that we had here and we look forward to trying more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "CShCmzOlnydQNyF62NhI9Q": {
    "date": "9/30/2014",
    "text": "I hope Carnegie continues to grow with places like this.   The decor and ambiance inside are fantastic; the cocktail menu is as well. I had the malbec margarita--loved it!  Beet salad is amazing, probably my favorite dish of the night! Worry that the prices might be a bit too high for the area but hope this place thrives as it is a nice addition to an up and coming neighborhood.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "U6bsoxWYMeeXFPqBWtae3g"
  },
  "1ORwdrxwm0XSkLzlme4JDA": {
    "date": "8/15/2014",
    "text": "A welcome addition to Carnegie's Main Street. It has great, modern decor and outdoor seating, always a plus!   They have a very extensive cocktail list, and my favorite was the gin or vodka with your choice of preserves. I chose gin with a peach/ginger preserve (which comes on a tiny spoon to allow you to taste and then mix yourself), and it was light and refreshing.   I came with my family and we had the bleu cheese flatbread and a side of brussels to start, at the recommendation of the bartender. They were excellent.   As for my entree, I had the hanger steak. I asked for medium rare, but it was more on the medium side. Regardless, it was still seasoned well and I didn't feel the need to send it back.   We split the Snickers cheesecake between the four of us, and it was really decadent, but a couple bites was more than enough.   Great service, and really friendly staff!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "ipylL-dd4Pva7KwblCmUXw"
  },
  "T43XTtmcmplKRDX-C5G44w": {
    "date": "9/26/2016",
    "text": "Such a cute restaurant! Something that could fit in well in downtown, so happy that we have something like this in the suburbs! Great menu, not overly expensive. Great happy hour pricing as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tjCKsPywTjislyTV0yKB_w"
  },
  "AE8B-43Ggz0EcY9odIXtrA": {
    "date": "7/29/2015",
    "text": "Had a great meal today at lunch. Went with a group of 6, and had a reservation (so not sure on wait times).   Server was generally helpful and made great appetizer recommendations. The Brussels sprouts were amazing. It was enough for the 6 of us to share, along with the hummus plate, to start the meal.  Most folks at the table got the tuna and shrimp melt (which was a special). Looked good, and they seemed to enjoy it. I personally had the lamb noodle entree - the noodles seemed to be fresh, and the lamb was great I couldn't have asked for a better meal.   My only minor complaint was that our server was a little slow to refill our beverages. Not a huge deal, but likely exacerbated by the small water glasses you get. I'd recommend that they give the large glass bottle of water right to the table instead of relying on the server to refill.   Over all, I highly recommend!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gFa8dYEIMw5hbFvYlcY7VA"
  },
  "sPFt3640OTyiH3PGYD3jUw": {
    "date": "5/25/2016",
    "text": "I normally don't write reviews on my first visit, but this place was impressive. We spent the last year and a half testing restaurants around DC and decided to hit this one up based on Yelp reviews during our move across America. Best decision I've made in a while! Everything tastes amazing. We had the Asian duck wings, a rhubarb margarita, fish tacos, and the sausage flatbread. It was better than or equal to 99% of the food found in the city. Also, the waiter and chef accommodated my son's amateur pallet with some amazing cheese soaked, homemade pasta that wasn't on the menu. Oh and the cheesecake and homemade ice cream was great too! I don't normally like cheesecake. The server, Stephen, was on point with helpful recommendations and quick service.  This is a must stop if you're passing through or live in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SngeDs1DQjMKj7TVlABOzQ"
  },
  "vQMoSWwJ2AXPoilqJedveg": {
    "date": "8/11/2014",
    "text": "This rating is based on 2 drinks and an appetizer.  I plan on going again for dinner and will update my review.   My first impression when walkling into this place was that it's still new and shiny.  They've only been open a few months and they do a good job of looking modern without trying to be, too, hip so I'm hoping this will become a permanent fixture in the area.   The fried oyster app was very good 4/5. I only gave 4 because my husband makes amazing fried oysters at home and has the 5/5 spot. The breading is seasoned and crunchy, and the oysters were fresh. Even though it's deep fried, the dish isn't heavy.  They also include this semi spicy, sweet BBQ ish sauce that we really enjoyed.   For drinks we had wine.  Solid selection although not overly extensive.  I had a pinot noir and the husband had a sav blanc.  The wine was as expected.  It hadn't sat in an open bottle for days and the bartender was helpful in recommendations.   We came 30 min before closing (because we're jerks and we were hungry for a snack other than pizza) and the place wasn't too busy.  That said, or service was excellent and at no point did we feel pressured to hurry and leave.  Think \"fine American bistro with good service and no pretense\".",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zCNkLqHEImSxUlhljSXKEg"
  },
  "b3VgyyX5svHjbFfOBOSauQ": {
    "date": "9/17/2016",
    "text": "Steak Saltimbucca was amazing!  Perfectly done, and the pasta fagoli was very hearty.  Service was wonderful.  Make the trip, it won't disappoint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O5yWp-s_GDqpIER9efmjxw"
  },
  "Yqq13mD0KSZMERZrD_G-gQ": {
    "date": "10/23/2015",
    "text": "A wonderful addition to Carnegie's business district. Chef has put a lot of thought into the menu. We had the Brussels sprouts and fried oysters to start. The Brussels sprouts were a bit over sauced but still tasty. The oyster appetizer was prepared and presented beautifully; it layered many flavors with expert depth. My husband had the halibut with pesto gnocchi and I had the lamb noodles. Both meals were delicious. I would have left the cheese curds out of the lamb noodles though because I feel they didn't add anything and got waxy thus taking away from some of the delicious earthiness of the almost stew-like dish. The halibut however was perfection. The fish was well paired with the pesto gnocchi. For dessert the pear ginger bread pudding added the final touch of fall comfort to a delicious meal. This place is worth a trip.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9GmUWalGfqrtbuDUImV-pg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Lamb noodles",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9GmUWalGfqrtbuDUImV-pg/o.jpg"
      },
      {
        "img_id": "BQkfteH-JK_Gu_MASWV6Dg",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Brussels sprouts",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BQkfteH-JK_Gu_MASWV6Dg/o.jpg"
      },
      {
        "img_id": "HwcsDelbbaF0q5xtBc4moQ",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States. Fried oyster appetizer",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HwcsDelbbaF0q5xtBc4moQ/o.jpg"
      }
    ],
    "user_id": "pHIclKqR8ZZ0qL8tMnJL7g"
  },
  "hgJ9YJeqB6TnI269-ywnSA": {
    "date": "7/23/2016",
    "text": "Great Restaurant! Quaint little end cap downtown. Had the pork chop and wife the scallops. Both excellent!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dIhzjz8x_1VKutZK0JGJkw",
        "caption": "Photo of One Thirty One East - Carnegie, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dIhzjz8x_1VKutZK0JGJkw/o.jpg"
      }
    ],
    "user_id": "kE6daLzSN31HFhcXj7pj3A"
  },
  "zkyHnUcEXnLt5RUJ2tu6Ww": {
    "date": "6/26/2016",
    "text": "Been here twice and it's now at the top of our list as a go to place to eat. Excellent service both times. The food is delicious and fresh. The Brussel sprouts are a must try. The restaurant is tastefully decorated and incredibly clean. The restrooms are also spotless.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "994PZt-iao0QQG5351c8NA"
  },
  "Hc82a-igEBulV0WuWBftHQ": {
    "date": "4/3/2016",
    "text": "So good.  Started with the crispy Brussel spouts which were excellent.  Ordered the Asian bowl special.  The tuna was cooked perfectly and the surrounding veggies blended well. Topped with great sauce, this was outstanding.  Tried the black Manhattan cocktail which was inventive and Delish!!  Great spot!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KYg1CqQi1u2hCI4ehtVQVg"
  },
  "V9bu2R1C_nGeJBf88tmPxA": {
    "date": "6/10/2016",
    "text": "It was fantastic!!! The hot sauce that goes with the fried oysters is to die for! Also, the bartender that was working the Thursday lunch shift was amazing! Had a really good time and the food was excellent!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NY7N2ZBVeaC1qxKLr4-CBA"
  },
  "IB0QJtunbsjDhdMOvwXNZw": {
    "date": "5/11/2016",
    "text": "Great burgers (if duck burger is on special get it).  Love those brussel sprouts.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u3N9QIK4auz7CHnnOS3j7A"
  },
  "HPT4Q3hHoVhJ-hkTaPOeiQ": {
    "date": "3/5/2016",
    "text": "Went for lunch and will definitely be back for dinner. Creative menu, great combos of flavor. Excellent service and vibe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TGb6OXx6KQMRNo6bcl2-0A"
  },
  "ZnVLnCiS5FieGJBvcATQFA": {
    "date": "8/21/2016",
    "text": "So disappointed, the appetizers were swimming in sauce, very salty and nothing \"fresh\" about them. Brussel sprouts in August do not need to be blackened beyond recognition before serving. The $33 paella had 1 scallop, 2 shrimp 4 small mussels, and a small piece of sausage.  All seafood was over cooked and the rice had very little taste and saffron, none. The lamb noodles should have been amazing, if it had not been microwaved prior to coming to the table.  The \"lamb reduction \" was very salty and reminiscent of gravy master.   review helps others learn about great local businesses.  Please don't review this business if you received a freebie for writing this review, or if you're connected in any way to the owner or employees.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Kh_HswtauZolKYLjbWbgA"
  },
  "6qIIznjfYb1PYta95ClesQ": {
    "date": "2/12/2016",
    "text": "This was the best meal we've had in Pittsburgh. The smoked salmon appetizer was incredible. I had the scallop pasta for my meal and my boyfriend had the Osso Bucco. Both were delicious! Our waitress Danielle was fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kk-gKOJxKV2z93KiWKZx-A"
  }
}