{
  "mQ0fJ0TvZHWy0ji36igklw": {
    "date": "6/3/2019",
    "text": "Personal opinion this is the best BBQ in Pittsburgh. Every meat is delicious, highly recommend the jalapeno cheddar sausage. When considering the brisket go moist instead of lean. Fresh fries, cheesy mac and cheese and more accompany as sides. The companies values of recognizing military personnel and commitment to service are demonstrated around the restaurant and in their quality of service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lqy21XyyxcDoISvaJHuzZg"
  },
  "cKhjInMYMNl5ROw3pQUf2Q": {
    "date": "6/20/2019",
    "text": "Stopped in for dinner. Got baby back ribs, with greens, baked beans, potato salad, green beans. This place is amazing!! Food was so good..ribs melted in your mouth and the staff are so friendly!! Brian made us feel right at home. There was also another young girl who helped us Brian said she is going to be a doctor). You both provided us excellent customer service. Thank you!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y47uwB01k8O4dP5zwFz3eg"
  },
  "XfVQhC7GYKuhIHNdoN4ySg": {
    "date": "7/27/2018",
    "text": "Great new restaurant. Love the military decor.  Talk about getting your food quick!  Wow !  Fastest service ever.  We tried pulled pork, brisket, potato salad & bakes beans. After eating this my husband decided to try some ribs.  Only thing we really didn't care for were the ribs. The brisket was the best; nice and tender.  Beans good, a little spicy.  Will def be back to try more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_EqIy2JqX9fny7WVew7mrA",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Brisket, baked beans &amp;amp; potato salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_EqIy2JqX9fny7WVew7mrA/o.jpg"
      },
      {
        "img_id": "zPdledGh5mWd6L3sY0bpEQ",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Pulled pork &amp;amp; corn bread",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zPdledGh5mWd6L3sY0bpEQ/o.jpg"
      }
    ],
    "user_id": "m2uTGkOKcXqQJSmvsYvtMg"
  },
  "LjHmSwZczI02IdLGjcljvQ": {
    "date": "5/28/2019",
    "text": "Each visit resulted in disappointment...for a bbq specialty joint to consistently leave a half inch of fat cap in served portions is unforgivable (pastrami and brisket).  Sides were very good and bbq sauces were great.  Love the support of veterans/first responders, but bbq was way below the line all three visits.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6aASDuw9SOejVBarYYe2eg"
  },
  "ETbJAwlQBzEi2ElX_NqaUw": {
    "date": "4/10/2019",
    "text": "Mission BBQ exceeded my expectations. I have been to many great bbq places down south, so I have really high standards when choosing where to get bbq. I got a half chicken with a side of their southern green beans (slow cooked and a little spicy and Smokey with onions and bacon), and my friend got the pulled chicken sandwich with French fries and Mac and cheese. My half chicken was super flavorful and moist, you can really tell the people working here care about the food they're making. The prices are very reasonable for the quality and quantity of food they are serving. I ended up taking half of my chicken home for lunch tomorrow. And most importantly, this restaurant chain supports a fantastic cause. The entire restaurant is decorated in serviceman memorabilia, and they even play the national anthem and ask everyone to stand up to show their respect everyday at noon. The staff members are super friendly and helpful. From my first interaction with the cashier (where she greeted me with a smile and a \"how are you today\" instead of \"what can I get for you\") to the nice busboy who came to our table to ask if he could clear our trays for us, to the overall attention to cleanliness of the whole staff, this really is a great place to eat. I would highly recommend this restaurant to a friend.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NgO4QGfz9Cqn_QFErHrguQ",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Pulled Chicken Sandwich, Fries &amp;amp; Mac and Cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NgO4QGfz9Cqn_QFErHrguQ/o.jpg"
      },
      {
        "img_id": "6PGcyGqSDgdJchArM9_J9g",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Half Chicken &amp;amp; Green Beans",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6PGcyGqSDgdJchArM9_J9g/o.jpg"
      }
    ],
    "user_id": "p7hK4IQlZx5BrJK9i-zALw"
  },
  "3F1t9huCqcLxrPFOi7z2kQ": {
    "date": "2/25/2019",
    "text": "The food here is amazing and the service even moreso! Totally worth the drive from Shadyside/Squirrel Hill. They're always so nice, never short you on sauces if you do take out. I pretty much will find any reason I can to come out here to eat because it's always such a pleasant experience. 10/10 will happily get fat on their food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kn24voDYweHbhp6NEuYx1Q"
  },
  "bIjFCCNoXeTNakcq1D6bUA": {
    "date": "10/12/2018",
    "text": "Meat was very tender and well prepared, the place is adorned with military memorabilia, and the staff was very friendly. The portion sizes were a bit small for my liking but i eat alot. At noon they honor the flag by playing the national anthem and everyone stops eating and stands. BRAVO     now i must say it not as good as Texas bbq but its solid and i was happy with my meal for sure!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6V2QVNLboiRQ5QRHyUDqjg"
  },
  "VyyqmU0CiiGBNPs-1tAVxQ": {
    "date": "5/10/2019",
    "text": "Love mission. For a chain, the bbq quality is awesome. Their Mac n cheese is really really good. The moist brisket is really good. Love the Alabama white sauce,",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JSM45CQz-sWCeyyKfwUcbQ"
  },
  "yMNabdkQwaFqD-8rTlUSUg": {
    "date": "2/19/2019",
    "text": "I would give 6 stars if I could. Had the turkey sandwich and side of Mac n cheese with the tangy bbq sauce. Was incredible. Also,the portions are great and really not too horrible for you on the calorie end.  On the other side of things, it's so refreshing walking into a place and getting genuinely greeted. Upon ordering, the cashier recognized it was my first time and recommended the turkey. Was a great choice! Then made sure I tried a special sauce on it.  After finishing my sandwich I went to throw away container and one of the workers took it right out of my hands. It was a really nice experience and you can tell these employees enjoy the atmosphere mission bbq creates. Can't wait to go back and recommend to friends. I appreciated the detail each employee added to my singular transaction and want to make sure it didn't go unnoticed. It's pretty rare and incredible to make such a great impression in about my 15 minute visit! Kudos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KqMQswPptH-j0h0OH5I8sA"
  },
  "-jIrfE-P3mykNQO3cgoB_Q": {
    "date": "12/27/2018",
    "text": "Absolutely the best pulled pork I've ever had   All of the staff members are sincerely friendly and helpful, the atmosphere here is really great. The manager at this location does a great job making sure all of the customers are happy with their dining experience. They highly support veterans and give back to the heroes of our nation (check out their site for more info).  I definitely recommend this place!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cXoZIiVc9DXYkMNzq-UbAQ"
  },
  "POCavFoTwFqSFk6JfjV9BA": {
    "date": "2/3/2019",
    "text": "Great local place to get bbq.  Was pleasantly surprised the 1st time we went here.  My wife and kids all love it!  Get the NC style pork platter!  The bbq sauce selection is great and most of all the staff is helpful and nice.  I would like to recognize Lance who a great staff member.  He goes out of his way to help us",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1MiQQqVCLV1vc-qF2X5o0Q"
  },
  "GLvP6ZfMObX7nmz7zaLiHg": {
    "date": "7/30/2018",
    "text": "Me and my husband were excited when we learned Mission BBQ was opening nearby. We were not disappointed. The food was amazing. We tried the pulled pork, pulled chicken, brisket, & Turkey with baked beans & mac n cheese as our sides. The pulled pork melted in your mouth. The Mac n cheese tasted homemade. My husband raved about the turkey as well. We liked it so much that we picked up takeout the next night. I would give 6 stars if possible.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2T10SzeFez71WbBzx-gMIQ",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2T10SzeFez71WbBzx-gMIQ/o.jpg"
      }
    ],
    "user_id": "XJs3qxmE0rByAWQdmRgTnw"
  },
  "_nQ7x2BCosgmL61O5w0W3A": {
    "date": "7/28/2018",
    "text": "A new favorite for my wife and I. This place was packed, line out the door but we were still in our seats with food within 15 minutes. Talk about great service. Food quality is great and the prices are very reasonable. If you have been to Old Carolina BBQ it is a similar format, but, much better quality and may even be cheaper. I had the meat sampler with brisket and pork, meat was great. Also, love the setting showing appreciation to service members. We will be frequent visitors to this location.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "21zxgLx2ydObIR5z1JUZ3w",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/21zxgLx2ydObIR5z1JUZ3w/o.jpg"
      }
    ],
    "user_id": "fHUv72-u7xSeO0DawR-MUA"
  },
  "WzYgYyeMHm-qVQDan_oXIQ": {
    "date": "1/16/2019",
    "text": "Probably one of the best places for BBQ in the Burgh. The macaroni and cheese is creamy and very cheesy. The collard greens are a nice choice to counteract the fatty ness of the meat. The moist brisket is my go-to whenever I go here and it never disappoints.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6OAB9dY6TlN43tXYbX3Hew"
  },
  "IoxYRg64WLk7Clrrg06ylg": {
    "date": "1/15/2019",
    "text": "Nice recommendation from the hotel I'm at this week. I'm always weary of BBQ joints, especially on the east coast (you guys just don't know how to do it right). But this place was a nice surprise. Excellent BBQ (brisket and turkey was my choice), sides were great, and staff was helpful and very friendly. Dare I say a touch of southern hospitality?  Didn't try the sweet tea, just can do it if it's not from Texas lol. Would def recommend you try this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m_DDkRzmAiFi6z7RcDE5nA"
  },
  "ZSeRvs0IV8xtp1Mn3miVFw": {
    "date": "9/17/2018",
    "text": "Amazing service! Got there right when they opened and ordered, they had a ton of catering orders that day and they were loading it all up, we thought our food would talk a while but we waited probably 5 minutes! The food was INCREDIBLE! And only $27 for 2 people including sides and drink. Love it! Def going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WHFGIoSeWKMIFUI_ejdRQg"
  },
  "zeKDdr-q9MSKjXv2ZgGwHA": {
    "date": "1/12/2019",
    "text": "Amazing food and super cool atmosphere.  Local management is awesome and the regional manager was visiting when we went, great folks!  The only downside is all the Navy memorabilia...but I'm biased .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q4_Ng2exl_PZXiEJwECKPA"
  },
  "M-18lFNoDWpPEFYJ1j33_g": {
    "date": "12/31/2018",
    "text": "Great bbq, great service and the sweet tea!  Its not full service and for bbq that is ok.  The pork, prime rib, brisket, and chicken are killer bbq, smoked with huge flavor. Each of the six sauces are unique and do the meat justice.  Just a great place with folks giving of the vibe of we care about making great bbq and it shows.  The bread pudding with caramel, so good.  Try it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mdC03c8sk6PDSvCaVIoIbw"
  },
  "-7nebu5Ly0B7sHgxlb91qQ": {
    "date": "12/30/2018",
    "text": "So good! Great atmosphere & work environment. I highly recommend going and eating at the restaurant",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7MZGZyoNiKsMrzBOWqscSQ"
  },
  "FHLsVpjeR7glZYWzHl5fzA": {
    "date": "6/29/2018",
    "text": "This place is by far the best brisket i have had... and i spent several years in Texas. The meat is so tender and prepared to perfection. I ate at Mission for the first time at the beginning of June in Lakeland, FL and couldn't get enough while we were there on vacation. Then found out when we got back that the Robinson location was about to open. Ate there last night and it is just as good as it was in Florida!  I also tried the smoked sausage last night, also recommend that as a second choice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "McGDwEyJB9RQn-Dkjdztmg"
  },
  "FKi5YHFH45S-8Ce-3GT57w": {
    "date": "2/18/2019",
    "text": "The food here is off the hook.  Everything is excellent.  My favorite is the brisket with spicy collars greens....wow!!  Staff is very friendly and attentive.  I love the respect and dedication toward our military and first responders.  We need more of that in our world today!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "N5_Dyq6VKqoPnBs0FbUDqA"
  },
  "fTJDZi4m83paYjSUQ1urVQ": {
    "date": "9/18/2018",
    "text": "The best pulled pork sandwich, the place is clean and you can ask for macaroon. The music is always great, but you need to be respectful because at certain hour they sing the national hymn.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "f9bTCqnyYgfg8zn_YZFMfg"
  },
  "2O-nRyij9Cp5vO6bG92CwA": {
    "date": "4/2/2019",
    "text": "I really enjoy eating here for lunch during the work day.  The inside is decorated with patriotic/military items so you know they support our troops which is awesome.  The barbecue is delicious.  I recommend the brisket or pulled chicken.  The best sides I've had so far are the fries and the Mac and cheese.  The only minor inconvenience I've noticed about Mission is that it seems like a lot of times there isn't enough seating.  It is a fairly big place but at lunch time when it's busy, it's almost filled to capacity making it a little uncomfortable.  Aside from that, it is a good place for barbecue and I recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pFeTIHMvbgZ55Cq7hgaz8A"
  },
  "pbd18BD4ivPyJlA-LEfllw": {
    "date": "7/31/2018",
    "text": "Mission BBQ is decorated in a very American/Military style (just an observation). I've been looking for some quality BBQ since moving to Pittsburgh and Mission has a good selection. The place was packed at 3:30pm on a Saturday so I can only imagine how it is during dinner or lunch. The portions weren't outrageous but I still left full. They had a nice selection of 6 different BBQ sauces at every table to try with your meal although personally I only favored 2 of the sauces. If I'm in the area I would return, though wouldn't make the trip out on a normal day since it's about 30 mins from where I live.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "71MIBgX-Z5tkasR8rRYZtw"
  },
  "tOBChsJlQITEQkc0BP7q-Q": {
    "date": "9/26/2018",
    "text": "Walked in on a full house but I was still greeted by a happy and friendly host. The host was patient while I decided what to order. Food came really fast for a full house. Mission BBQ does NOT have a freezer, their food is fresh to order and once it's finished, that's it. The host was nice enough to give me six of their sauces to try and even explained to me what each sauce was. I ordered their ribs, mac n cheese and baked beans, it came with a side of corn bread and a drink, all for only $16. Great service, great prices and great food, I would highly recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1ZPM1rGEaeF4cQQLW2JAjg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Six of their sauces, baked beans, cornbread, Mac n cheese and ribs.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1ZPM1rGEaeF4cQQLW2JAjg/o.jpg"
      }
    ],
    "user_id": "Af79txbVsQosO1PctL_uhQ"
  },
  "0phvVHo36hOqsh5ivacodw": {
    "date": "6/28/2019",
    "text": "Fantastic BBQ! Very good sides as well. This will be a regular place for us. So glad to finally have a great bbq place close to us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rLkeNng0Mwivs6lTHX8hQA"
  },
  "XytGT25EqC_lFUcAxXhJkA": {
    "date": "4/3/2019",
    "text": "I LOVE MISSION BBQ!!! While I've tried everything on the menu, my hands down favorite is the pulled chicken! Sooooo good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "18Om5oXo1R51VtgQBeUwFg"
  },
  "9WM6zTmctgbxMfxSwh6-lQ": {
    "date": "6/26/2018",
    "text": "Just opened recently and man this place is awesome. Walked in for pick up, it was packed. I ordered a brisket sandwich that came with its bbq sauce, one on the greatest briskets I've tasted and their prices are reasonably good for the quality of the food you are getting. Definitely stop by and enjoy a great BBQ.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "0px1HP1Gz27tLzGBGHXdKg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0px1HP1Gz27tLzGBGHXdKg/o.jpg"
      }
    ],
    "user_id": "js0n4T5zEih004UPDj1umw"
  },
  "_DQhzhaLpRNoPyychvDI-A": {
    "date": "1/1/2019",
    "text": "My husband loves BBQ. Me, not so much. I scanned the menu before we first visited and saw the smoked turkey sandwich so decided we'd give it a go. The smoked turkey, fresh cut fries, and a side of Mac n cheese is my go to! On my first visit I was disappointed to find out that they do not have cheese! So now when I go I pack my own American cheese and put it on my turkey sandwich. High maintenance? Yes? But Delicious! My husband loves the pulled pork. Very filling meal for a good price and the food is ready VERY fast!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "NTjaqqc2dmdG97G76o651A"
  },
  "GWi71bCwpG_4jH100yBeIA": {
    "date": "7/17/2018",
    "text": "This place is EXACTLY what West Pittsburgh has been missing!  Ever since moving back to Pittsburgh from Western Ohio, where I became a fan of City BBQ, I've been on a quest to find good Barbque.  Mission Barbque, you have filled this void.  I've tried the brisket, pulled port, pulled chicken.... oh my, it is all so good.  The Mac n'Cheese is killer!  The green beans and baked beans are both awesome.  The only thing that I still need to try is the ribs.  Also, if you could add corn bread hushpuppies my bbq life would be complete.  I forgot to mention the really good array of sauces.  This place is priced right, the flavor is out of this world, the staff are awesome, what more can I say?  Get there, fast.  Go often... I will be.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZdQxhh3hCW33imdMHMIR_g"
  },
  "IB58A7x9JYh31PUcYCPBog": {
    "date": "4/13/2019",
    "text": "Great a la carte meat shop. Nothing extraordinary, but reminds me of a place I loved back in NYC, so it's a taste of home in that regard.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cFCp6wvMok2BQlOkJwx3Ag"
  },
  "AonxY-klsO3_DElWySV7Pg": {
    "date": "7/11/2018",
    "text": "Had the 3 meat sampler. I chose brisket, pulled pork, and sausage. All very good!  I got spicy bbq sauce. Awesome sweet flavor topped of with a nice, not overwhelming burn! I was overwhelmed by the many choices on the menu board, and got cole slaw for my side.  Next time I will try more sides.   The place is real classy inside and honors military and other services. Lots of neat things on the walls.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qfHQTghq5GmaVfvCMSYPeg"
  },
  "2lOCN3pFZaPI88ryRrYX_g": {
    "date": "7/4/2019",
    "text": "the food is amazing and the staff is very friendly.  personally I really liked the turkey and mac and cheese.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2iSwfK1g3RnqIGR1xpBy9A"
  },
  "LWxAGWKJeinvLDjGDHevjA": {
    "date": "9/21/2018",
    "text": "First time here and we were not disappointed! Real BBQ with delicious sides at a very affordable price.  I ordered the brisket with baked beans and Mac & Cheese and my wife had the pulled chicken with fries and Mac & Cheese and it was less than $30 with drinks. Staff was very friendly and helpful as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u_zhjxCz3TXuq8Glt2o9og"
  },
  "kCAtCXxQ1Uz5mi2sstBqpg": {
    "date": "10/12/2018",
    "text": "If you are in the mood for some classic barbecue, this is the location for you! Right in the heart of Robinson, this place is nearly impossible to miss. I requested a pulled pork sandwich with my side being Maggie's Mac-N-Cheese. The array of different barbecue sauces was quite impressive. Their fresh and irresistible lemonade kept me chugging along like Joey Chestnut. Thoroughly satisfied with my order, I made a pact with myself that I will return to this lovely joint very soon. I salute you, Mission BBQ.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q_Hi4Wkc0BOgG7Z43Er7-A",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. I would have preferred white forks.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q_Hi4Wkc0BOgG7Z43Er7-A/o.jpg"
      }
    ],
    "user_id": "D-V73SwW7hvxYvtEbK5pbg"
  },
  "8sKUBUCFUnIVPz1OD3TFPw": {
    "date": "3/2/2019",
    "text": "Top notch Barbeque! I love the smoked sausage. Great sauce choices. Awesome casual atmosphere. Sides are fantastic. Great place for families that also has beer. Always an inexpensive beer choice. Good place to get take out from. Delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RzsYtxlOp0YLS-kYiU1H9g"
  },
  "302o1P6ueeUkh2ionB37dA": {
    "date": "3/29/2019",
    "text": "This place has THE BEST barbecue. Mission Barbecue DOESN'T FREEZE FOOD either. The service is fast and the employees are super friendly. One of my favorite orders of ribs with a side of Mac 'n cheese. Each meal comes with cornbread that is delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rBEb3nMXE4Sl2CVEvExdFA"
  },
  "vs1z3FpNQS7kcQRpSzONLQ": {
    "date": "3/27/2019",
    "text": "Some people might think a chain like this won't serve quality food. In this case, that is incredibly inaccurate.   I've tried just about everything on the menu at Mission and I have yet to be disappointed. In my opinion the brisket sandwich is the best thing on the menu, but really everything they serve is excellent.   The service at Mission is fantastic as well. Food is served quite quickly, and the employees are always incredibly friendly.   I recommend this restaurant to anyone looking for good barbecue in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sFvLW68M8Z5MCaWvLj1PPg"
  },
  "XjTVgHzkJxn065WU1ZyNtA": {
    "date": "8/19/2018",
    "text": "Holy Smokes..... blown away...... soooo good!!!  I've lived down south and this is my favorite BBQ ever.... the meat was lean and so many side and sauce options.... and the Mac n cheese the best I ever had",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "15BYfRl0Ga2xuE0PgAtbUw",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/15BYfRl0Ga2xuE0PgAtbUw/o.jpg"
      }
    ],
    "user_id": "Z-dCUf9Jt9uVnAsuR1_SkA"
  },
  "FIhv3TLqEkdWZyt7cQsSpw": {
    "date": "12/12/2018",
    "text": "Love the atmosphere of this place and the food is incredible! I had the pulled pork and I think I tried every single sauce they had on the table and liked all of them. Be sure to check this place out !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "Penk216CGDDykwdV_kn3dg"
  },
  "EDPfGG-OnoBfiv9BbQUcQw": {
    "date": "8/26/2018",
    "text": "It was ok!  I've had better. But they were busy. And I appreciate they recognize veterans!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tp5IQPZ2cu2cFdIU7esZXQ"
  },
  "_EscH-k6idbX5ZzbtRpugA": {
    "date": "10/6/2018",
    "text": "I had the sampler.   I smoke myself and get many compliments. The ribs are better than mine.  The brisket was a 8 out of 10 and the pulled pork a 7.  Some outstanding. Some very good. My wife has the pulled chicken and Didn't care for it.  It was a little dry and the smoke flavor was less than she likes.  Mine was spot on and I like a good smoke flavors. She enjoyed the KC sauce and it saved it.  Personally I think good smoked food should stand in its own.  My plate did as described.  Place overall rates 4 stars.  It was a little busy and got dirty floors but the staff took care of it.  It's fast food bbq but so much better than that.  I've had better in Memphis but Ive also had had a whole lot worse. I'd come again and that's all that matters right?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HDjkgYdhC9n9woDgcVZu7g"
  },
  "n89TFPECiml4RHlJN2osuw": {
    "date": "10/2/2018",
    "text": "Great BBQ and atmosphere.  The best I have had in Pittsburgh for sure. I would go here weekly if I could.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g6g4vQe823ZvW4KlJaYqbw"
  },
  "KjYGrbbf5zvbuOpeRE_Qig": {
    "date": "8/23/2018",
    "text": "Fantastic food. Great service. I've been here 4x in the past 2 weeks, and there are LOTS of places to eat around here. This is one of the best. Service is outstanding from every one I've dealt with here. We are lucky to have this place, come out and support it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6MlC4cJVfTEmGjfGsuG5FA"
  },
  "kZYuosSPFoe9WpNMAzZ0WQ": {
    "date": "8/9/2018",
    "text": "We placed a take out order. The waitress was very helpful with suggestions for our order. The Mac and cheese and ribs are fantastic! The green beans weren't bad but a little to salty for us. We will definitely go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vA0ijVNheF5e2y_JMwy9LA"
  },
  "b4RPBF041NwQecNobsu0oQ": {
    "date": "9/1/2018",
    "text": "This has quick become a regular spot for me! Great BBQ! Amazing and knowledgable staff on all of the different food, meat and options! The prices are awesome for the amount of food that you get! The restaurant has been kept pristinely clean since it's been open so far! Will be back regularly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h9WDlvKTnzMSwBnZrmH1Ug"
  },
  "XHeMwTUmHjYjElX7JuHYYw": {
    "date": "8/12/2018",
    "text": "This place is great.  The staff is nice and the food is excellent.  This is on my top 5 list for good bbq for the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mvC-x4kQcwtYM0H3NwHU4g"
  },
  "8jIpi9Koz5Ry7dQ-URxLxg": {
    "date": "8/11/2018",
    "text": "Had my first visit this afternoon.  Expecting grade A BBQ.... sadly disappointed. The meat sampler with sausage, ribs, and brisket was dry and the sausage tasted like grocery store sausage. The chicken platter was dry and tasted like a refrigerator. The only thing that made it edible was the option to add you own sauce. Smokey mountain was good, tastes like sweet baby Ray's that you can buy in the store. Mac -n-cheese had undercooked noodles and runny cheese sauce and tasted like something you would get in a box. The fires are the best part of the meal. I would qualify this meal as fast food BBQ at best. Sorry. I do support your mission, but you need to up your food game.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hv67ykc_2xaf1lWzCfhl0Q"
  },
  "_6AXuDw7G_9C-DyWxbXs8w": {
    "date": "8/9/2018",
    "text": "Ordered 5 spare ribs.  When picking them up to eat, all the meat fell off the bone immediately.  Over cooked.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S8E736aQNrJlZjqQhDDdMA"
  },
  "7e6VkWXNFht9tBy1X9jJsw": {
    "date": "7/14/2018",
    "text": "Absolutely the most delicious brisket I have ever had. So tender and juicy. I loved that the sauces were all separate. My family of seven each got just what they wanted. Everything was so good!!! The Mac and Cheese, the brownies made for a happy big family. Was so impressed with the staff and beautiful bathrooms!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N17p5P-EBxz23tikBcZIag"
  },
  "u3CSj7HgQ9bkRqFUVIlwhA": {
    "date": "6/28/2018",
    "text": "If I could give this place 100 stars I would!  Everything about this place is amazing!  Food is always spectacular and service is absolutely unreal!  The employees are happy to take your order, thank you for the business, smile when they hand you your food at the counter, are very accommodating and someone always comes over to check on you while you're eating.  What's most amazing about this place on top of the great food and service is the atmosphere and the \"mission\" of truly giving back to our military and local police, fire and EMS.  I've been to many Mission BBQ's so I'm excited to finally have one in Pittsburgh.  I was there on opening day and was amazed as I witnessed the owner and two other employees walk a bunch of senior citizen home residents out to their shuttle bus after lunch.  They even helped them get on the bus too.  This place is top notch and every business should strive to be like this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qSZprb-MVIsRxVt-KRw1Iw"
  },
  "Tph8uLEmua6DyHXsD-JgWg": {
    "date": "10/10/2018",
    "text": "This place has awesome bbq! I usually get the pulled chicken sandwich and my boyfriend gets the pulled pork, both are wonderful! We also always split an order of fries, which are a great way to try all of the bbq sauces without them getting mixed on your sandwich! If you have ever been to Famous Daves, it is very similar in the sense that the sandwiches do not have any sauce on them and you get 7 choices at your table to put on top (the Memphis is my favorite, my boyfriend switches between Smokey Tennessee and Tupelo Honey). They also have that North Carolina vinegar stuff if your into that. The only reason I gave this location 4 stars and not 5 is because the kids who work here can be a little cliquey and are more interested in talking to their coworkers than the customers. I didn't get the fries I ordered once and stood there for a very long time trying to get someone's attention but they were all talking and didn't notice me across the counter. Other than that, the food is delicious!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QZ4pCaRgKNZmzdOpHaJqwA"
  },
  "nQfvPUUTd1Scqy7OMvnu9A": {
    "date": "3/3/2019",
    "text": "I ate there last night and tried the Collard Greens  . Compared to the Richmond VA location they were a 2 vrs a 10 My mother was from Louisiana so I have been spoiled  Bottom line if you know southern food skip the collards unless you are down south",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnR4i0dAJRWkemzVu3jdEQ"
  },
  "9W-DTiy3hgne8W565tQGlg": {
    "date": "8/9/2018",
    "text": "Where ever i stop to eat at a mission BBQ  They are Always fresh Hot great food  You owe yourself a lunch here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jF-FiGsX00wzGMNZsR_gCQ",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Always fresh always hot always good where ever i visit one",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jF-FiGsX00wzGMNZsR_gCQ/o.jpg"
      }
    ],
    "user_id": "Zfc6PZl4krokVif-08-IqQ"
  },
  "v83ZaxpYZbYEx8rhIwIPGw": {
    "date": "8/30/2018",
    "text": "Things I love:  BBQ, America and our Troops. That is what you have here at Mission BBQ. I absolutely love what this place stands for. My mom and I came in for dinner one Saturday night. You walk up to the counter place your order and then your name gets called when it's ready. It was pretty busy, but they keep things moving quickly. Not to mention when we were finishing up, a man who looked to be the owner and/or manager stopped to see how everything was. Those gestures make me want to come back to restaurants. He also stopped over at the table next to us to thank the man for his service (it was National Korean War Veterans Day) and I am pretty sure those veterans ate free that day!   I ordered the brisket sandwich with a side of mac. My mom ordered a half rack of ribs with mac and green beans. Not only does this restaurant give back to the community, but their BBQ is top notch. The sandwich is by no means skimpy the bun to brisket ratio is perfect. Also, the bun is super soft and the brisket is nice and juicy. They have 6 different sauces and I made sure to load my sandwich up with all the sauce. I liked the Memphis Belle the best! The mac and cheese was pretty amazing too; it wasn't too soupy and a little more on the drier side which is how my mom and I like it (it was still cheesy nonetheless).   Thanks for coming to the 'burg Mission BBQ! I can see myself making many trips here. Don't forget to sign up for their Birthday Brigade. It will get you a free sandwich on your birthday.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "78k_RG2_nfPo1fwo7LwZCg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Brisket sandwich and 1 side",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/78k_RG2_nfPo1fwo7LwZCg/o.jpg"
      }
    ],
    "user_id": "mYJW4-M4tcRygSwdT3A6Ww"
  },
  "k5QtVeIwpd3VDa7HAouC4Q": {
    "date": "8/12/2018",
    "text": "Banana pudding is amazing! I ate it so quickly that I forgot to take a picture. Love their respect for veterans. There is even a reserved parking space for vets. We also tried the coleslaw and green beans that were also delicious. There meat and sauces were on point too. Price was comparable to to bbq place that attends the farmers market. We will be back!! A must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QUFIFBZUmTy9Semq8IDvGQ",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Pulled pork and chicken. Mac and cheese. Banana pudding. Cornbread.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QUFIFBZUmTy9Semq8IDvGQ/o.jpg"
      }
    ],
    "user_id": "T_mcCDS5mfVfGkYX799aBw"
  },
  "xGlVW52hAoCcfNHxUcYMYg": {
    "date": "5/5/2019",
    "text": "I am from DC by way of Cali and saw these guys on Yelp while I was in the Pittsburgh area, so I decided to check them out. They did not disappoint. I had the pulled brisket sandwich, fries and spicy collards. It was sooooo good. The brisket was not only tender but seasoned very well. Their sauce is delicious. I was mad when I didn't have anymore on my plate. I recommend this place. It's one of the top five in the country (my opinion).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mJDzNreOn0ceNjdkpzkBGw"
  },
  "fEnDbTwXExLQpv-40UpYcA": {
    "date": "5/18/2019",
    "text": "Got there around 8pm on Saturday. All of the meat was very dry(brisket, pork & sausage).. I wasn't expecting much when I saw there were hardly anyone in there. We got 5 sides and I ended up throwing away 4. Sorry, but it wasn't on par with any bbq I've had in other states, Kansas, Texas, NC, etc... I get that it honors service men/women...but, let's honor them by never serving meat that's been sitting out too long..",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "c-geEqyt3Ko6yTEydoCYTg"
  },
  "7avhCa5b0dxziozLMgw2zg": {
    "date": "7/23/2018",
    "text": "3 meat sampler. Spare ribs excellent. Brisket, very good a little too salty. Turkey, very good also a little too salty. Pepsi products, I prefer Coke .  Love the pro military, fire, and police theme. Glad to see a M.BBQ here in Pittsburgh. Last one I visited was in Tampa.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0LBzIPKT8KE7GV9VWVmnlQ"
  },
  "seyG15CFd5TuMY6wTszCfg": {
    "date": "7/1/2018",
    "text": "We are so excited to have a location in Pittsburgh after visiting family in Maryland where we often stop at Mission BBQ. The portions are generous- the kids' ribs meals had a lot of meat on them, too. All of the meats are great- it is hard to pick a favorite. Was very well staffed on an Sunday- friendly and fast. Stuffed a family of four for about $40.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JH4wXehBqY8PJ4nRXcwE9w",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JH4wXehBqY8PJ4nRXcwE9w/o.jpg"
      }
    ],
    "user_id": "Zh-Nkaz5pFlOln-7GORWaw"
  },
  "muLSmaXDxDzruzs-AiZcsA": {
    "date": "6/28/2018",
    "text": "The line was out the door for a week day lunch. It moved super fast though! We were also offered free samples while waiting, so that helped. My friend and I ordered the pulled chicken with the macaroni and cheese. We loved it.  Such a great new addition to Robinson Township with a great hometown feel.  Everyone that worked there were all so nice and friendly. It really makes you feel like you are down South.  They have a nice patio set up with picnic benches and lights. We will return! Lastly, the six different bbq sauces on every table is great !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e2NmoyFhZtWFGTMRCngDww",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Pulled chicken with macaroni and cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/e2NmoyFhZtWFGTMRCngDww/o.jpg"
      }
    ],
    "user_id": "UAu2YHF-nByxbJoGhrYUFA"
  },
  "9tskNcYgNdE5p90PS-G9UQ": {
    "date": "5/3/2019",
    "text": "My first time at Mission BBQ. I just sunk my teeth into what might be the best brisket sandwich I have had thus far....and I didn't even get one of their signature sauces on it. Not only are these smoked meats packed with an atom bomb of flavors, it comes with a side of fresh cut fries picked from the potato patch out back. Excellent staff, Chick Fil A level, including the manager. This one really brought me back to my roots. When you get a second, check out their mission statement.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NFGs9GVIjBeZytdl-TEfhg"
  },
  "_lMQziVlKoOhsEdYiY0C2Q": {
    "date": "7/13/2019",
    "text": "Glad they found a home here, everything they cook is great, staff is friendly and helpful if there are questions. Good  food for the price",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rE3i8gdtz2c3BhZytC1APQ"
  },
  "2uoJrNa1jq5kV0RyML-i-g": {
    "date": "8/11/2019",
    "text": "We were there on saturday.  The brisket was terrific.   I love good brisket and they did not disappoint me.  We tried the pulled pork and the jalapeno sausage.  Everything was great.  Super staff (especially the catering gal at the book signing)  I'll be back for sure.  Looking forward to a North Hills location.....  God bless our Vets...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xqmuu0J_07ixJOleZH_aKQ"
  },
  "fZGjqPtsLNn99ymAQMFPew": {
    "date": "7/17/2018",
    "text": "Good food good BBQ and happy baby = 5 stars! Brisket was great the Mac and cheese was awesome the ribs was on point and what's not to love about the lemonade!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5FRS6v_Cjy_vz0tQ4jMsJg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5FRS6v_Cjy_vz0tQ4jMsJg/o.jpg"
      }
    ],
    "user_id": "IeS_LaHlZkklrMKnaAMQGw"
  },
  "0T2mUHxHrSl1qBpKFhAm9A": {
    "date": "11/6/2018",
    "text": "My husband and I are obsessed. The service is great, the food is amazing, and the restaurant is clean. I love all the sauces they offer and I especially love that they will let you try anything before you order it. I high recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y5SHjnFi5P2BytM5lPBnBQ"
  },
  "LDhxOMmB-kfDe7pCjkemSQ": {
    "date": "11/25/2018",
    "text": "Came here for the first time with the family for lunch. I've heard about this company and know what they stand for and I love it love the concept but was skeptical on the food. OMG I don't know why I was so skeptical but it was great we all loved our food. We got brisket and chicken it was so juicy and flavorful. We also got baked beans, cheesy potatoes, and mac. It was all so good but I will say the beans where pretty hot had to let them cool a bit before indulging but luckily I bad some beef to stuff my face with. Thank you and keep up the great work. I will always spend my money at a place like this over a big chain any day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kNJ9u5t2TGC3yimsfbEGYA",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Kids chicken slider with mac",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kNJ9u5t2TGC3yimsfbEGYA/o.jpg"
      },
      {
        "img_id": "O9r6YHgrS9wUYMjbQyiM3Q",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Brisket sammie with baked beans",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/O9r6YHgrS9wUYMjbQyiM3Q/o.jpg"
      }
    ],
    "user_id": "4Arn_eExr-Sqs_yvYYLkPA"
  },
  "OYxX6J26jKiLOzmNfkLY_w": {
    "date": "5/28/2019",
    "text": "This place is the best BBQ place you'll ever visit in your entire lifetime. I suggest baby back or spare ribs, but everything is incredible.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cpUJjCpb7HfeUt3Hrr0GpA",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Spare ribs!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cpUJjCpb7HfeUt3Hrr0GpA/o.jpg"
      }
    ],
    "user_id": "drduHyIBvAvLcy7jlZeGQg"
  },
  "K2hxEP03-97Ce7blcNZQaw": {
    "date": "5/25/2019",
    "text": "Always impressed by the service at Mission. The staff is great and I enjoy their help when deciding on what sauce to pick with my order. The food is great.  Big fan on the jalapeno sausage.  Officially my go to bbq place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WGnlgUvSU51Z1NlE0sBGiA"
  },
  "vWUJC-YPlZo1fCG0B5oQdg": {
    "date": "8/22/2018",
    "text": "Stopped in for lunch and it is run like a well oiled machine.  You can tell that this chain has worked hard to get it right and train the staff.   First off, get there before noon so you can be there for the daily salute to the good Ole USA with the playing of the National Athem. There was a short line but it moves fast and you can look at the menu that are at the door will in line.   Staff was freindly and helpful and there were staff on the floor cleaning tables and helping out.   There are 6 BBQ sauces in bottles on the table (that you can buy too) and a larger or seventh NC Vinegar bottle.  So many to try with a description to help you choose.  A couple were very smoky tasting.   One was a Tulepo Honey with some bite that was way different and one I really enjoyed.  Also a Bay BBQ sauce that has a Maryland style flavor.   I decided to try the Sampler plate that gave me three choices of meat, some corn bread and a side of Mac & Cheese.  The three meats I choose were the Brisket, Pulled Pork anand Sausage (had the Jalapeno flavored).  The Brisket and Sausage were very tasty but the Pulled Pork lacked any real flavor and really needed some BBQ sauce.  A really nice place and addition to the neighborhood.",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 23,
      "cool": 25
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "XqJz2j93wOM0H4hYQf5x9g": {
    "date": "5/18/2019",
    "text": "This is some good bbq, definitely stick with the Memphis or smoky sauce.  People were great here, awesome support for the military!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JDDnpmtjXqeso-4xZ8O8HA",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JDDnpmtjXqeso-4xZ8O8HA/o.jpg"
      }
    ],
    "user_id": "ZQuCROUEMto3N0a6YspU7A"
  },
  "H8ReEs9B7rw71OggprlIOA": {
    "date": "4/20/2019",
    "text": "The food was good for a fast-food atmosphere. I enjoyed the selection of bbq sauces. The atmosphere was a bit too military for me but overall good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D6VrCVIsV4lWD9R8ht1wuQ"
  },
  "pnAuHMzRqovkL-zuE5kpdw": {
    "date": "1/4/2019",
    "text": "Great BBQ.  You know a place is good when you are stuffed from just finishing a meal, and yet you are already thinking about the next brisket sandwich. Bread and brisket. Not much else is needed when the brisket is so tender, juicy, and flavorful. The ribs were pretty good too, and tender enough to quite literally fall right off the bone. The baked beans and creamed corn were enjoyable sides. The corn bread was a bit on the dry side.   Recommended!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "NJOspTE_Ms-b8ACPKY73Ww"
  },
  "fTgoraipBgyd9qoCyKLjrA": {
    "date": "9/5/2018",
    "text": "Stopped in here for lunch on the way from the airport to Cranberry. This wooden shack style BBQ joint is covered wall to wall with military paraphernalia. So much so do they endorse their military affiliation that work stops for the national anthem at noon everyday.   I got a sampling of their fare including ribs, sausage, turkey, pulled pork, and brisket, sides were baked beans and collard greens. What was really impressive was their six different sauces (varying in styles from Kansas to Carolina). Their turkey was smokey and moist, sausage had chunks of cheddar throughout, pork butt was well shredded and went best with the table vinegar.   Aside from the food, the service was impeccable, even with it being the lunch rush. highly recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VgoODBwdngXE9TNsEDR8Iw",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VgoODBwdngXE9TNsEDR8Iw/o.jpg"
      }
    ],
    "user_id": "WOOhS3yC2dEjOkBCTXaLdg"
  },
  "x0ZcjzAvl85ESpYkm_4LZg": {
    "date": "1/6/2019",
    "text": "What's not to like about a place that supports our service members as well as first responders. That alone makes this a 5 star restaurant, but add in the friendly service AND delicious menu, and this place should be ranked 5 star PLUS! I had the brisket which was tasty and moist. Some of the best bbq I've had. The menu is a la cart and portions are generous. They have brisket, pulled pork, prime rib, etc etc etc and tons of fixins. If you go hungry here you aren't human. They have several sauces to choose from to sauce up your meat. They have a selection of bottled soda beverages as well as fountain soda, in addition to a few draft beers available. A real all American experience with amazing bbq as you sit and enjoy the articles first responders and photos on the walls of our armed services and first responders. Love this place just wish I hadn't waited so long to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VmFREv6IchoTEjIQpSV_sg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VmFREv6IchoTEjIQpSV_sg/o.jpg"
      },
      {
        "img_id": "mB3WMcZnzN7Ju94hOQiGSw",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mB3WMcZnzN7Ju94hOQiGSw/o.jpg"
      }
    ],
    "user_id": "r5iu6xjD9UEwSlAIiTmaNQ"
  },
  "nZKT4G2FvDtDNArt2C_KOQ": {
    "date": "7/29/2018",
    "text": "It's about time Pittsburgh got more barbecue options! I've been driving by the old Bob Evans for a few months now anticipating what was going to take its place. Much to my surprise it was a new barbecue spot in my neck of the woods.  I've gone 2 times now because once just isn't enough. Both times I tried something a little different. My first visit I got the pulled pork sandwich. The sandwich comes piled high with meat. So much meat it's difficult to get your mouth around the whole sandwich at times. My second visit I got the lean brisket sandwich. It was equally as delicious and I honestly don't know which one I liked more. The sandwich come without sauce on them because they have 6 different types of bbq sauces at each table. Each one having a slightly different taste than the other so everyone is bound to find one they enjoy.  As far as sides go I've tried 3 of them now. My personal favorite is the mac n cheese and I would definitely recommend it. The baked beans were a little too smokey tasting for my liking but if you like the smokey taste you would enjoy it. The cole slaw is just ok in my opinion. There's nothing necessarily wrong with it. It's just not my favorite cole slaw.  While the bbq is definitely the selling point at this place, I would just like to comment on the service at Mission BBQ. Everyone is extremely nice. Each visit there was someone walking around asking how everything was and asking if we needed anything. The pop machines were having issues running out of Pepsi both times I visited and as soon as the staff was notified they quickly fixed the issue. I will be recommending Mission BBQ to my friends and family!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3B5IN_Hlyql83PZyIQ7VDA",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3B5IN_Hlyql83PZyIQ7VDA/o.jpg"
      },
      {
        "img_id": "OXaK8gF-BFbPLi5YjtuvkA",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OXaK8gF-BFbPLi5YjtuvkA/o.jpg"
      }
    ],
    "user_id": "-Y6tXYPYqeVy37-L5p0rMw"
  },
  "R8Um4Z_FEkR8fqMxzOmzag": {
    "date": "6/13/2019",
    "text": "I am pretty picky about bbq growing up in Texas, but I have to admit mission bbq was a really good  bbq outside of Texas! Loved the brisket it was so moist. It's a casual atmosphere with lots of recognition and honor for our service members! I will be eating here again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gFxf4Iqeu08sAZr5WqM2WA",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gFxf4Iqeu08sAZr5WqM2WA/o.jpg"
      },
      {
        "img_id": "KDzZhoS4U9SlaQeljG5Akg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KDzZhoS4U9SlaQeljG5Akg/o.jpg"
      },
      {
        "img_id": "KLaY-tk25bqFwo9WVvwnUQ",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KLaY-tk25bqFwo9WVvwnUQ/o.jpg"
      }
    ],
    "user_id": "tVsYw1e24nuTF6A97kh1RQ"
  },
  "0vwSNvZUk7Y3XL_wyA58Cg": {
    "date": "8/13/2019",
    "text": "By far the best cornbread I've ever had. The bbq was good too, but the cornbread was amazing. First time there, so I don't know if they're always like this, but it was crisp on top, soft on the bottom and gooey in the center...like a brownie. So good. Next time I'm in the Pittsburgh area, definitely going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZBUey2PEjKM7jZib2-zSHQ"
  },
  "XFuljfKZDHRgLVgiC2NQ5A": {
    "date": "12/4/2018",
    "text": "Mission BBQ catered our Holiday Luncheon at work and did an amazing job!! Shout out to Erica who was a dream to work with!!!   The portions were just right and everyone loved the food.  The price was on point too!!  Mission BBQ is whats up! ! !  Thank you so much",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "_KKki81Pwdt8qzvR5k8WLQ",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_KKki81Pwdt8qzvR5k8WLQ/o.jpg"
      },
      {
        "img_id": "O762suK3DR8Ll27jjmsy1A",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O762suK3DR8Ll27jjmsy1A/o.jpg"
      }
    ],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "sbUaDqhDdosDeK4cwX5Cog": {
    "date": "12/10/2018",
    "text": "I enjoyed my first time at Mission BBQ! It was definitely a nice and unique experience that we don't have most places in Pittsburgh. When you walk it in is a cozy and family friendly environment. There are many menu options as well as combo options. I ordered the jalapeno and cheddar sausage with Mac and cheese and cornbread. I thought it tasted great! The cornbread was a little dry and I was a little disappointed by it, but everything else was delicious. There are 6 different sauces to choose from at each table which was also really cool! We will definitely be back :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Se4Ie73tyuTQ0OjDC0_Vhw",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Se4Ie73tyuTQ0OjDC0_Vhw/o.jpg"
      }
    ],
    "user_id": "XVTqV_zHUWC6BOfOsq3nRg"
  },
  "GIKjQ-NB_bn4dFWv6W2qEg": {
    "date": "12/8/2018",
    "text": "Mission BBQ is basically the \"Boston Market\" of BBQ joints. It has been my go to place for quick and good BBQ since it opened, and it does quick and good BBQ well.  When you enter Mission, you'll approach the register to choose your meat and side selections. The Meats range from standards such as Pulled Pork, Ribs, Brisket, and Smoked Turkey with a few outliers like Smoked Meatloaf, Sausage, or even Prime Rib at times.  They have a variety of side like fries, mac and cheese, beans, coleslaw, cornbread, and sometimes stuff like collard greens and corn pudding.  They serve a small beer menu of locals/domestics and a couple of fancier beers but don't expect anything crazy.  There's a choice of multiple BBQ sauces on the tables and you can ask them (and you should) for the Alabama white BBQ sauce.  Let me stress that this is not table service. You're not tipping anyone. You order, receive your food, get your drinks, sit down and enjoy.  Service is on point and friendly and everything in the restaurant is very patriotic, right down to them stopping service at noon everyday to sing the National Anthem.  Don't expect the best BBQ you've ever had, but expect something that, for fast, is probably the absolute best you can get.  Definitely worth a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iEFdIthk-88qvvfPOiKN1g",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Fantastic, quick, BBQ.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iEFdIthk-88qvvfPOiKN1g/o.jpg"
      }
    ],
    "user_id": "yQXQgp1OoagOidbdmML3Ig"
  },
  "UYJCVKBH8h8buchx_LpdYg": {
    "date": "11/5/2018",
    "text": "I've now been to 2 Mission BBQs; Pittsburgh and Chicago. Both terrific. I love their concept and their mission. The food is terrific. They have several sauces to choose from; which is really nice. Their baked beans are amazing. I have gotten the chicken and lean brisket; my go-to as I can never decide between the two. Everything is easy to eat there or take out. Everyone I've encounter has been really nice. The restaurants are also very clean. They never seem to run out of condiments (considering they are all kept in a tool table there are plenty). Good food. Good atmosphere. Good people. Good cause. Good choice!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zijSJyDCaJBPIYi9UOiOIg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Yummy baked beans and brisket",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zijSJyDCaJBPIYi9UOiOIg/o.jpg"
      }
    ],
    "user_id": "BJUY0UadA-STNQfNGnpTjg"
  },
  "lKvt-Zkrwe3z-__gV-9zpQ": {
    "date": "8/20/2019",
    "text": "Good bbq place. Not always the freshest brisket, but you can't go wrong with the turkey or any of the sides.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4xAVjq9qFG3DOIEup54LeQ"
  },
  "XQKbGlVmRTcUGBpTn95hKg": {
    "date": "11/24/2018",
    "text": "I cant say enough amazing things about this restaurant. I just heard about it a few months ago and I thought I would try it. I mean who doesn't love BBQ.. I always have the best experience here now that I have come a few times. When you walk up, you can pick between different meats and sides. They let you try the food if you aren't which is so unheard of and my fav part.  Once you get your food, you sit down and the sauce is on the table so you can try one of their six sauces and they are all yummy. The staff working are always super nice and helpful. They ask if you need anything and they are happy to grab it for you. I just have a great experience every time I come here. They portions are enormous. I usually just get a meat and 1 side. I bought a cup from them so I just fill it each time I go. This place is worth like 5 tries !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AKMRMIIPSHzp4KD76Z9Tgw"
  },
  "UTsWHVUtNNDiZpWpqjWNNQ": {
    "date": "10/21/2018",
    "text": "Like other BBQ places, you order at a counter and pick it up once ready. Was fairly busy on a Sunday for lunch though the line moved fast. Only took a few minutes for the order to be ready. I had the pulled pork (NC style, I think that just meant coleslaw on top) and made it a combo. They had 6 sauces at the table and some sort of vinegar. I tried all, most were great, my favorite was the Bay-B-Que (the Maryland-style one). As far as the food, the bun was kind of blah but everything else was very good. The staff here was super friendly. A neat tradition is that they play the national anthem every day at noon, there were a lot of folks here in uniform so it was really nice to see.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n4SuDOXWTlrYXSipc_pVUg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Pulled pork (NC style)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n4SuDOXWTlrYXSipc_pVUg/o.jpg"
      }
    ],
    "user_id": "0KhRPd66BZGHCtsb9mGh_g"
  },
  "Y0UgWCaOP5BtoFbPYS-T6A": {
    "date": "11/9/2018",
    "text": "My co-workers and I went here on our first night in the area. At first, I was just thrilled to find something in this area that wasn't a national chain!!  The staff was friendly when we ordered and helped explain to us how the menu worked and answer questions about specific menu items.  I was thrilled to see that they had the calories for each item on the menu board over the registers: you didn't have to look for a separate list, look at the printed menu, or ask...they were clearly visible as you ordered.  We were a little confused about the order/sit/wait for name process (especially since it was difficult to hear our names called), but we figured it out by watching others.  I ordered the sliced turkey with collards and green beans, while my co-workers all ordered some combination of brisket and pulled pork. All of us agreed that the sides were great: when the menu said \"spicy\" for the collards, I was a little nervous...but there was a little kick without being overwhelming.  As for the meats: - My turkey was incredibly tasty, even if it was a little drier than I expected. I could clearly taste the smoke around the edges and almost wished I was able to just get an order of the edges. I was glad I saved the small end piece for last! - My co-workers unanimously raved about the wet brisket.  Regardless of what other meats they each got, they all said the brisket was their favorite. From what I could see, the meat was moist but lean (one of my frequent disappointments with brisket is when half of your order is fat instead of meat). - My co-workers were either indifferent or disappointed in the pulled pork. One said hers was too dry and one said it just didn't have much flavor.  I can't speak personally, but none of them were impressed with the pulled pork.  We all liked the variety of sauces. I'm from North Carolina, so I was impressed to see a bottle of sauce similar to what I get at home. I chuckled when I saw that the label reminded customers to swirl the bottle to mix it up!  To be honest, it was not exactly like what I would get at home, but it was way closer than anywhere else I've been outside the south.  Overall, I would likely go back again; if nothing else, it was a good meal with friendly staff where I can make sure I stay on my calorie plan.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xjP2py_9H43H-LUjXnDAug",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Sliced turkey, collards, and green beans",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xjP2py_9H43H-LUjXnDAug/o.jpg"
      }
    ],
    "user_id": "9_iU_PdHbKAYjuGHGEdHgg"
  },
  "rrefriNynibWwCBvqy38UA": {
    "date": "5/24/2019",
    "text": "First time here. This place is great. I had the brisket (lean) and my wife had the pork. The sides are big enough to share. We had the fresh cut fries and the baked beans. Both sides were great and the beans are the best I've had in some time. Only thing different I'll do next time I'm in town is have the moist brisket. The young lady did inform me of the difference. Place has a cozy hometown feeling that reminds those that come here the cost and dedication that our military service men and women paid so that we could all be free. We will DEFINITELY be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nnzdL_MhIBUGNgxh3VKOjg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Brisket dinner with fresh cut fries and baked beans and pork dinner",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nnzdL_MhIBUGNgxh3VKOjg/o.jpg"
      }
    ],
    "user_id": "IZWF8r8bVrSUNLblMgZaJA"
  },
  "ke1BtKPQ84NW5iqf5mrOgQ": {
    "date": "7/27/2019",
    "text": "As good as brisket can get in Pennsylvania. Quick service. The corn isn't any good. If you're going with sides i would get the collard greens or just pass on sides.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cdniGDpl-yutBOU1tbbPiw"
  },
  "x7d7Q-MCl75oyZa6YaAoZg": {
    "date": "8/13/2018",
    "text": "Not bad at all... actually, pretty darned good! My son and I took a ride out to Robinson to visit this place because a pal I used to work with recommended it. He was right - it was worth the trip. The place is casual- think fast food BBQ. The decor is military and first responder in nature, hence the name. The young lady taking the order was efficient and friendly. The food was ready quickly. Seating area was clean and kept up. The food? Yeah, it's good! I had a brisket sandwich and my son a rack of ribs. Then he had a second rack of ribs. The boy (11 yrs old and skinny as as rail)...well, where he puts it I dont know, but he was smiling all the way. He loved the food, including the side of collard greens (I had the greens too...yep, they're tasty!). So was the cornbread, and my brisket was terrific.  They have a nice selection of sauces available at the table...I liked the smokey mountain. Good service, selection and food prices right. Yep...this place'll do just fine. Try it!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_HGe5OdMAVdm9E7cTSw5wA",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_HGe5OdMAVdm9E7cTSw5wA/o.jpg"
      }
    ],
    "user_id": "rs3pq6wRmaSIADCInQXp9g"
  },
  "nxPp-g-P0eKpzH3Oi504tA": {
    "date": "8/2/2018",
    "text": "Great food, reasonable prices, and very friendly staff.   All of our food was great (though the turkey Bryan got wasn't worth getting again) and I look forward to going back again soon.   There were three of us and the brisket (both kinds), pulled pork, mac & cheese, and baked beans were all delicious. The service is amazingly fast and friendly, too. I couldn't believe how quickly a long line moved through the checkout while we were sitting there eating the food was done very quickly, too.  I look forward to trying different meats when we go back. I tried all the sauces and still couldn't really pick a favorite. I'm sure I'll keep working on that on future visits.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZnIaEvJwrxlBUjimIpx2Qw"
  },
  "m5ajYp-XS1GSoS9XKqp0FQ": {
    "date": "7/14/2019",
    "text": "Amazing place to eat. We where greeted by nice staff who took our order. We received our food in a very short time and the food was amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uTBFualhe7JOl8Aqxgy49g"
  },
  "sPEN6prDw2Nf5ugx5MRPqg": {
    "date": "7/14/2019",
    "text": "Stopped in and our order was promptly taken by Murph. We had the pulled pork sandwiches and  sides of beans, potato salad and the green beans. The 7 kinds of bbq sauce found on every table was a nice addition to the really good down home taste of the BBQ. We will be going back for some more of the delicious grub.....I guess you could say......\"Mission Accomplished!!\".",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KIsuKY0QS_aBJImNKRezAQ"
  },
  "v7onFgyl9c2V6D-CLdihbQ": {
    "date": "9/14/2019",
    "text": "I have eaten bbq all over the country and several bbq places around the general Pittsburgh area and let me tell you this place is amazing.  I had the 3 meat sampler  Classic sausage Brisket(moist) Pulled pork  With sides of Mac n cheese and collard greens  Everything is amazing nothing was dry and can't wait to be back again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LUc5clkY-bbW08SQNIwiEg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LUc5clkY-bbW08SQNIwiEg/o.jpg"
      }
    ],
    "user_id": "XUeChpGf3KtGRrPN7U2NzA"
  },
  "UNGkjnMnlbOtCb1dpi6dbg": {
    "date": "9/12/2019",
    "text": "I went there again and was small little portions and not worth 12.50... 1 turkey slice dry, 2nd meat brisket all smallslivers and tiny portion. Felt ripped off and manager should do better control . Last times I was there I wrote this and gave 5 stars... I lowered to 2 stars now after I got ripped off. I was out of state.... stopped in for lunch while visiting. Excellent barbecue... some of best I have had throughout US... Texas, Memphis, Carolinas, Alabama, Georgia to name a few.  Brisket was right on point and tender, moist, smoke flavor all money barbecue. Sides and sauces all excellent. Prices reasonable for portions... now a regular planned visitor. Smoked  turkey is next visit. Excellent selection of beers for dinner with a $2 beer option... place was jammed pack for lunch, quick service, no waiting for waiters or waitresses. Problem is close too early and losing sales . No delivery?  I stay at hotel every week by them... I'd order 2-3 times delivery a week... need to expand hours, delivery and stack the other 20-30 % revenue not capitalizing on. They close too ear",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ZBH0vw3N67ortzcl7J7Sw"
  },
  "R4snliXzQRvC9teCyQmeKQ": {
    "date": "9/7/2019",
    "text": "Best BBQ in the entire Pittsburg area.  Got to try it to believe it.  6 sauces to choose from, from sweet and Smokey to hot and spicy.   All meals Comes with corn bread.  Memphis belle is my fav! Very friendly staff, family friendly and clean. Perks for people who served in the armed forces! Will be back again very soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PgdSoxwDE8H44qxK466UQg"
  },
  "0cpAWSv0fJK8RCirs87wTA": {
    "date": "8/21/2019",
    "text": "Some of the most friendliest people (staff) in the fast food business. We started off with a taste of all the different Meats and the sides were mac and cheese and potato salad.   Hands down some of the best barbecue I've had in Pittsburgh.  I highly recommend the brisket!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o2wMZl66q7qgkOn_J-uezw",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Sauces pt 2",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o2wMZl66q7qgkOn_J-uezw/o.jpg"
      },
      {
        "img_id": "doDYTFMBHqH41eamyq_Q5Q",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Sauces",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/doDYTFMBHqH41eamyq_Q5Q/o.jpg"
      }
    ],
    "user_id": "mtrwciirsnKJGleYFfXYCQ"
  },
  "Ymttkl2il5alV7RVzbYkmw": {
    "date": "7/26/2019",
    "text": "This place will suffice when we just can't work through our bbq cravings anymore. (Note: we're from KC so bbq is religion for us) The moist brisket is pretty tasty but the regional sauce options are just meh so we tend to eat it plain. The cornbread is pretty good and you can never go wrong with fresh cut fries.  Service is always good. Very nice staff. Prices are higher than you would find in most bbq places but there is little to no competition nearby.  Stay away from the pre-soaked/sauced/marinated-whatever-call-it-beef. It tastes worse than it looks. Waaaaaayyyyyyy worse.  I think I got 2 bites down. Hence my 3 stars and chain bbq will never get higher than a 4.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jxnaszou5jjbIS7bn0HE8A",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jxnaszou5jjbIS7bn0HE8A/o.jpg"
      }
    ],
    "user_id": "z4wsBEoxLVQSuJqLTLk77A"
  },
  "VspBCyYNV0I2Khxtt4_Org": {
    "date": "7/5/2019",
    "text": "I was pretty bummed out after reading all the stellar  reviews. I always chalk it up to a bad night? But nothing really knocked my BBQ socks off either. The brisket I tried was dry. Greens are my favorite part and they were too salty and drowning in olive oil and whatever other liquids so that the actual portion of greens itself was very tiny.  The only thing that would have been promising were the fries, but they were cold. They tasted fresh cut, so I bet if they were warmer I might have liked them. They had a to  of sauces but the only one I really liked was a smokey one.  I probably wouldn't hit this up again unless I was desperate for BBQ while in the Robinson area.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 10,
      "cool": 4
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "bwYxzGhGGn70fFj_Bcb97w": {
    "date": "7/10/2019",
    "text": "Yummy. This place has some of the best BBQ and supports veterans. Sign me up. I had the pulled pork and my partner had the brisket sandwich. I had a side of greens and mac n cheese and fries. Lets say we devoured our food. The mac n cheese was probably one of the best I had and the greens were also really amazing. The pulled pork was smokey and flavorful. The brisket was tender and smokey.  Coming back again for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c7SC2mjhrNsvxYvOH_csuw",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Pulled pork with coleslaw on top",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/c7SC2mjhrNsvxYvOH_csuw/o.jpg"
      },
      {
        "img_id": "SJu1tqVuJhvDwZVnkh02cQ",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Brisket sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SJu1tqVuJhvDwZVnkh02cQ/o.jpg"
      }
    ],
    "user_id": "IdbaRCFtRUzmu3AZjNc_rg"
  },
  "WRYnyIc6cVI1XuPmZqklpQ": {
    "date": "6/18/2019",
    "text": "The food was really Fucking good. I should have gotten a photo of the huge smoker. I was too excited. Damn it. I asked the waiter,\"Now be honest, what's better the pulled chicken for the sausage?\" He said,\"COMMON NOW! CARL! CARL! Get me some samples!\" And came back with two different Sausage samples and a sample of the pulled chicken. I got the Ribs, pulled pork, pulled chicken, mac & cheese, and collard greens with cornbread.  Greg got the brisket, Mac& cheese, baked beans, and cornbread. I love this place. I love what it stands for, but mostly THE FOOD!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "a-JC67rtGRW2pM4gsZIrJg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/a-JC67rtGRW2pM4gsZIrJg/o.jpg"
      },
      {
        "img_id": "bkzZUWx73GkR_w5StIF-fg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bkzZUWx73GkR_w5StIF-fg/o.jpg"
      },
      {
        "img_id": "3LaM_IDK2KVLNbXTbwL_HA",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3LaM_IDK2KVLNbXTbwL_HA/o.jpg"
      }
    ],
    "user_id": "nd69T_TkY8loznnMYAtbzw"
  },
  "H7nn720MX0ZrxXerz3HXKg": {
    "date": "1/1/2019",
    "text": "The first time I had mission was in Austin, TX and it was so good so I was surprised and excited to see they opened up here in Pittsburgh.  I guess they don't advertise so I didn't realize it has been open since this summer.  I ordered take out and had the brisket sandwich and got the 2 meat platter (smoked turkey and pulled chicken) for hubby.  His platter came with sides so got him greens and the Mac n cheese.  Their Mac n cheese is soooo good I should've doubled up on it but the greens were actually tasty too.  Cornbread was blah - kinda dry.     The staff was super friendly and the line moves so fast.  I loved the smoky mountain sauce but they have quite a few options so I'm sure you'll find one you'll like.   I love they really support our troops in so many ways.  Their food is delicious!",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 19,
      "cool": 15
    },
    "photos": [
      {
        "img_id": "kt_Et3wWiASWYnIhZdkv_Q",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. 2 meat platter: Smoked turkey and pulled chicken with 2 sides and cornbread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kt_Et3wWiASWYnIhZdkv_Q/o.jpg"
      },
      {
        "img_id": "TWC8s4tur4k0fmjwQQaskg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Brisket sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TWC8s4tur4k0fmjwQQaskg/o.jpg"
      },
      {
        "img_id": "_hpxRPvddfi4Z4rA9aQZ1g",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_hpxRPvddfi4Z4rA9aQZ1g/o.jpg"
      }
    ],
    "user_id": "hjk--8VuDX3479_atPJQ1g"
  },
  "VG3AaR7BCkRf0fLPCYoPBQ": {
    "date": "5/10/2019",
    "text": "Oh my! Such a great BBQ place! I was craving for pulled pork and wanted to find a BBQ place and saw that this place had opened not long ago. It had great reviews so like any yelped, I decided to go and try it. I absolutely loved it! The environment is nice and clean. I ordered the pulled pork sandwich with two sides and a drink. The mac and cheese is AMAZING!! Definitely try it! Although I did takeout, they gave me a sample for each sauce (6 total). My favorite was the smoky mountain. The pulled pork was tender and delicious! You must try this place as it's good and reasonably priced.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "o-VwFgrxVNttjzds2RSCgQ",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Pulled pork",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o-VwFgrxVNttjzds2RSCgQ/o.jpg"
      },
      {
        "img_id": "h0VUXV56Le2RHOJkSpbXrw",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Pulled pork sandwich with two sides - mash potatoes and mac and cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h0VUXV56Le2RHOJkSpbXrw/o.jpg"
      }
    ],
    "user_id": "gmCK2ARSx22S_4_RQF9Jwg"
  },
  "x5ffecTlY6HBpwNKq0MfPg": {
    "date": "12/31/2018",
    "text": "When people suggest dining at chain restaurants I usually decline. My brother has been promising me that Mission BBQ is more than the average chain. I finally gave in and O-M-G was he ever right. Mission BBQ is down right delicious.  To be honest, it reminded me a lot of Hattie B's in Nashville (minus the hot chicken). You order at the register and have a brief wait to either sit-down or take-out your meal. Plus, like Hattie B's it's GOOOOD. I had the Brisket (fatty, because they have options) and it was melt in your mouth tender. The sides of Mac'n'Cheese, Cornbread, and Coleslaw were also on point. I was impressed and will be back.  I don't think you can go wrong with eating here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "s9cI2U6kyJj8yTFNvmfveg"
  },
  "Cd2Ha_IsUlVBPag-MRzG6w": {
    "date": "5/13/2019",
    "text": "I've driven past this past everyday for the last 6 months & never noticed it tucked away in the little plaza that it's in. Long story short, i was blown away by the hospitality. Normally in Robinson alot of food joints are stuffy and you really dont feel welcome (from my experience) but here as soon as we walked in, we were greeted by i think his name was Luke or something along those lines. This was our 1st time in this establisment and he personally made sure that we were comfortable, food was to our liking, he even gave us coupons for our next visit.   oh i didnt talk about the food....GREAT! Jalepeno & cheese stuffed kielbasa are amazing. I think i will go back today.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hEGyeLjHaeES4HYiJ3L2eg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. I meant to take a picture before devouring my meal lol.  Here&amp;#39;s the remains",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hEGyeLjHaeES4HYiJ3L2eg/o.jpg"
      },
      {
        "img_id": "z71W1S35y5ediNOd7yM8Ww",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/z71W1S35y5ediNOd7yM8Ww/o.jpg"
      }
    ],
    "user_id": "EwybhmvWXVkuowbOfV2rJw"
  },
  "KxDAnEjF8xs0uTywyKizww": {
    "date": "7/21/2019",
    "text": "Great pulled pork NC sandwich!!! Amazing baked beans!! Love Bay-B-Que sauce. The best one!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rvmmlqtgOcAy4CcoSd4Cwg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Pulled pork NC sandwich, Mac n Cheese &amp;amp; baked beans.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rvmmlqtgOcAy4CcoSd4Cwg/o.jpg"
      },
      {
        "img_id": "EJF-6uTDZj9oHau2Y1X4Rg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Side view of Mission BBQ",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EJF-6uTDZj9oHau2Y1X4Rg/o.jpg"
      },
      {
        "img_id": "J5APmOJptV71GIPbkWeKxg",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Special parking for Veterans at Mission BBQ",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/J5APmOJptV71GIPbkWeKxg/o.jpg"
      }
    ],
    "user_id": "W4su_z7eAvBDEJRiyPGDUA"
  },
  "lKScMSpQ1NIS_QoLKCZ51Q": {
    "date": "7/9/2019",
    "text": "Not to bad. Nice customer service. Only thing is the greens are out of a Can and almost EVERYTHING is salty as hell.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BQJp0zg-3vW69opTYMBRZA"
  },
  "oQfC56HyuH1WC8uKhLUOHQ": {
    "date": "7/12/2019",
    "text": "Consistently good bbq.  Highly recommend the brisket, which can be ordered moist or lean.  Also, the turkey, pulled pork, and chicken are good.  Fave sauces are the hot honey Tupelo and Memphis bbq.  Lots of options for sides: Mac & cheese, fries, green beans, macaroni salad, cole slaw, etc.  The cornbread is a bit dry.  Wait staff is always friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_EPzTjxyIths4TOsMogalg"
  },
  "ZqLPKZ3osFMGu_QI0vdIXw": {
    "date": "3/24/2019",
    "text": "Came here for dinner on a Saturday night.  Hubby and I each ordered the 3 meat platter combo.  I ordered the pulled chicken, Jalapeno sausage, and brisket with a side of collard greens.  Hubby ordered the jalapeno sausage, ribs, and pulled chicken.    What's Hot - Quality of food.  For a chain, they're not so bad.  The jalapeno sausage is spicy and cheesy.  Their meats, for the most part, are tender and flavorful.  They have flavorful sauces, as well, which are available at each table.  I really liked their mustard bbq sauce, which you can't find at the table.  They have additional sauces on the side, which you have to go through. - Menu variety.  Straight forward and simple.  It looks like their sides rotate depending on what they have. - It's a chain.  Good BBQ chains are not easy to come by, especially because the quality of the food varies.  This place isn't so bad.  We've been to the Mission BBQ in North Carolina and they're pretty damn similar.   - Layout.  There's indoor and outdoor seating, which is nice when the weather is decent.  What's Not - Service.  I ordered the jalapeno sausage and received the regular sausage in my order.  The guy who took our order at the counter repeated our order like 3-4 times and still made a mistake.  Ugh...  Additionally, when we went to find a table, the one we found still had someone's junk/leftover trays on it.  None of the staff had cleared it off.  I ended up having to throw the stuff away because we couldn't find staff to clear the table.  To be fair, their staff are minimal and mostly behind the counter.  They don't seem like they're adequately staffed to deal with the crowds.  - Avoid the lean brisket.  When you order brisket, they ask you if you want lean or moist brisket.  Definitely order their moist brisket.  Their lean brisket is dry.  The day we came here, the guy who took our order at the counter said they were out of moist brisket, so i was stuck with the lean brisket. - Layout.  There are a decent number of tables inside and outside.  However, they don't look like they're adequately staffed to handle large crowds.  It probably depends on the day and time, but just be aware.  Final Answer Willing to come back, but be aware of the day and time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "zDfAIEqsojn6__0k_nG5eQ",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Jalapeño sausage, pulled chicken, ribs n Mac n cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zDfAIEqsojn6__0k_nG5eQ/o.jpg"
      },
      {
        "img_id": "9266CRSnQgtbtO3zlxk_RQ",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Sausage, pulled chicken, brisket n collard greens",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9266CRSnQgtbtO3zlxk_RQ/o.jpg"
      }
    ],
    "user_id": "eYUt3Va-5w-NrCBxD_PrFA"
  },
  "V9cqtCM43jEzYfbdeo2BbQ": {
    "date": "3/13/2019",
    "text": "This place really hits the spot for lunch. We both got the brisket sandwich and it was so good! From getting in line to getting the order, it took no more than 5 min. At noon everyone stood up and sang the national anthem together. Definitely a unique experience. Can't wait to come back to try something else! Very affordable and practical for a quick lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U4noUZwB4Ym_24UT6vY6RA",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States. Brisket sandwich with a side of baked beans",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/U4noUZwB4Ym_24UT6vY6RA/o.jpg"
      }
    ],
    "user_id": "Jrr9reObcbJ6U7ywKRmp6w"
  },
  "S_yxvvPBYef6Ge2yPLaXFA": {
    "date": "9/26/2018",
    "text": "I rarely use the phrase, \"OMG\"....but, y'all. O-M to the G. I could live in this place. They get everything right!  First, they back the blue and even more so, the military. I like it. They give back to the community and they hire veterans whenever possible. Take my money; all of it.  They are some of the warmest, most welcoming people on Earth. It's nothing to have a conversation with one of the staff members while you are having lunch.  The food. Oh my lord, the food. Best BBQ I've had in the Burgh, hands DOWN. Look out, rib fest, they have what you don't- seating and air conditioning. No need to rub elbows with a bunch of sweaty drunk people when you can come here all year round!  Everything I've had has been phenomenal. I'm in trouble if they ever have a punchcard system. Goodbye, waistline.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MeRDG95QJ8Dd_ZpZcOxNmA",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MeRDG95QJ8Dd_ZpZcOxNmA/o.jpg"
      },
      {
        "img_id": "EKoKRDKXw8bi75bGP0_cJw",
        "caption": "Photo of Mission BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EKoKRDKXw8bi75bGP0_cJw/o.jpg"
      }
    ],
    "user_id": "y_XgW02VKRwDKGhHq17yuA"
  },
  "jGaU09gxoaxyLCegCfTM2w": {
    "date": "9/9/2018",
    "text": "This is probably my favorite BBQ restaurant EVER.    First, the food is fabulous.  Let's start with the meat.  Since it was our first time here, we HAD to order at least a half a pound of everything except the brisket.  We doubled down on that at picked up a full pound.  The brisket is the best that I've ever had.  Hands down.  Super tender, moist, touch of smoke and great flavor.  The pulled pork was my next favorite then the ribs.   I honestly loved it all.    Now the sides, we loved the corn casserole more than the cornbread. If it's available, order the corn casserole.  It's like having cornbread, creamed corn and cake all in one!  My next favorite was the baked beans.  If you can't order it all, make sure you get these two sides.  You won't regret it.   The service was amazing.  EVERYONE was super kind and helpful and knowledgeable.  They seemed to love what they do and take great pride in serving us.  They took our orders quickly and shared their favorites which became our favorites.  I loved their energy and smiles.   Finally and most importantly, I love their mission.  Their purpose why.  The decor was inspiring.  The pictures, the quotes, all of it.    Combine it all, food, service and mission and it's a great place to go.  When we return to visit, we are certain that we will be back - over and over again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0bXpaDuuK0Hwimjorj8_EQ"
  },
  "xR97ue6_TYnrzAEc4ROfXA": {
    "date": "7/20/2018",
    "text": "Stopped here today for take out or take away depending on where you grew up.   Quick review: Ribs amazing Chicken amazing Potato salad super amazing  Line moves quick.  Concept is cool.  If you're from another country and you want to know what America tastes like, stop here.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 11,
      "cool": 11
    },
    "photos": [],
    "user_id": "z2S2HYVNwCIBRESeMkJjjA"
  },
  "mV2uoLC-RMV5oLcH2znHHQ": {
    "date": "9/14/2018",
    "text": "Great food, super fast service, nice casual atmosphere. Huge portions. My husband loves the pulled pork. Good value for the money. We have been here several times already.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xNngD1ckFnLKNPGbDlTTfw"
  },
  "lOt6IYps8q2bcJeTUdGZEA": {
    "date": "8/1/2018",
    "text": "Love this place! And that's not  just because 10% of their profits go towards the military, first responders, firemen, policemen, and any other heroes that I did not include. I had the pulled chicken sandwich with the spicy smoked barbecue sauce. Great! I could not pass up the mac & cheese. It was very good along with the baked beans. I would encourage everybody to frequent this place because their food is very good, fresh, and reasonably priced.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X3j9wmO0_gUrPkkOakZIsQ"
  },
  "OZxHzQjOwkxYWCaxCof6wA": {
    "date": "7/1/2018",
    "text": "Good solid ribs and six different BBQ sauces to choose from, conveniently located at your table! The fries were on the thin side and crispy- which I love. The best part was the service - every, single person we encountered was so friendly and so helpful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HlY4Vku7lA1bis1zxsImlQ"
  },
  "sPPNUyfbaqHF1byRiLw7dQ": {
    "date": "7/28/2018",
    "text": "Everything is fresh and made right when you order it. The staff was so friendly and helpful. The meat was cooked perfectly super moist!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hcq5aKpRycyM3eShOEH0Fw"
  },
  "Z41w2YqW3FEBiaTV-7ixtw": {
    "date": "9/2/2018",
    "text": "The beef brisket was rubbery and had a strange texture. The pulled pork was good--moist and flavorful. The decor is extremely patriotic, but also artificial and corny, like buying and hanging up all the cheap, patriotic things from a big box store. 'Merica and average barbecue! Yeah!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7e1rMJVUwMHpKA4dMlpMiA"
  },
  "P8cutMX1TMlQfTw6Ol8hjQ": {
    "date": "7/21/2018",
    "text": "Very good food. I don't even like BBQ very much, but I would definitely come back here. I got the half yard chicken and Mac n cheese, my husband got 2 meat sampler with pulled pork and brisket with beans and all orders come with cornbread. I have to take half the chicken home. The portions are good sized. Make sure your hungry, neither of us could finish. Our meal for 2 was around $25.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z8NtNeWmeAZsQcglcUKCIw"
  },
  "bh8h4PpL6yf4-7DGUkio1A": {
    "date": "7/17/2018",
    "text": "I was pleasantly surprised with the quality of food from a chain BBQ restaurant . Cool atmosphere and very affordable . The service was quick and staff extremely friendly . The beef brisket & Mac & cheese were excellent . They where sold out of the baby back ribs for the day when I went for dinner at 7:30 on a Tuesday , to me that is a good sign saying all there food is nice & fresh and nothing is sitting around . There was like 8 different bbq sauces at my table , I tried 2 and both where damm good . I just wish they served beer cause a ice cold beer would of went great with that good BBQ . Give this place a try your going to enjoy it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yh66kOD3Oac1TNBf8UOGIQ"
  },
  "1cStXOGhpc4E_F0dxIsSaw": {
    "date": "3/23/2019",
    "text": "Although a chain BBQ establishment this particular Mission seems to want to make a promanent splash onto the Robinson market of good food.  They appear to be very industrious in their presentment and seem to honestly care about your satisfaction.  As they clearly promote the greatness of our military and first responders, it is hard to be too critical of their efforts.  Unfortunately I dined with little attention by fellow diners to my clearly virgin engagement at this particular location.  Maybe future visits will prove to be more promising than the last.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aaW0lNC4KpIQGR7yetAa2A"
  },
  "zT0k-0b8VggjcYk2cf_uXg": {
    "date": "8/10/2018",
    "text": "This bbq restaurant is quite delicious! The brisket was really juicy and delicious and the pulled pork was good, but a tad salty. The sides we tried were all fantastic!!! Mac and cheese is a must. The baked beans were awesome! Definitely going here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R2h9P0n3GZqNyNox_xalXQ"
  },
  "lfuR4D-FcFSOBX11p_5VsQ": {
    "date": "8/1/2018",
    "text": "Everything is outstanding. Brisket absolutely falls apart in your mouth. All of the sides are top notch as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HGHFWuQQYalOybdyxNqnfA"
  },
  "-gDqGJKO3tf8gUG4d6qjlA": {
    "date": "7/31/2018",
    "text": "This place is fantastic. We orderws brisket and baby ribs. The foods are awesome. And the service is great. The Kansas sauces is tasty. I am very satisfied with this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvA-3IRXuvZtJ_2tHoUgjg"
  },
  "CuuAkzKXCDEVPlLA92S6zg": {
    "date": "11/4/2018",
    "text": "Busy and quick. Everything was good and they list the calories on the menu. Brisket was not fatty, pulled pork and chicken were good. Jalapeno sausage was yummy and the Mac and cheese was good. 6 types of bbq sauce and you can buy bottles to take home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "chC34hwqlSGCIIi1TOucHw": {
    "date": "7/13/2018",
    "text": "We ordered catering from here for our Employee Appreciation Day ay work. It was delicious and the whole process went really smoothly from taking the order over the phone & recommending choices and quantities to the delivery and set up. Our employees like to go there to get lunch on their own and highly recommended we use them for our day, they were right and were enjoying leftovers today!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yPFo2_ZpJ2haEN5_sLkCRg"
  },
  "o8aTBonUdaKRyxUs36oW3A": {
    "date": "7/11/2018",
    "text": "This place is absolutely worth the 5 stars that I viewed while debating where to eat in the area. The staff was super friendly and informative and the place was packed but the line moved super fast. Lastly the food was amazing! Great prices! I also love that all the sauces are available to caddy to your table so you can pick which ones you prefer. I'm already looking forward to my next tastey visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eh1iG05u5lR03oM4z-Y3Zg"
  },
  "6f3xLb3V3SbHYJXJ86ISvQ": {
    "date": "7/8/2018",
    "text": "Yelp*!    Why is this new location's reviews that were posted removed?!   There were way more than two reviews .    I'm disheartened that that would occur.... Anyway, please go try Mission BBQ is Robinson.    Their food is great !!   The service spectacular, all around great place and they give back as well !!!    You won't be disappointed !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7EGkUGRiqudnPzZJ-44Q_w"
  },
  "BaZWhpfNdPb1wu5oGG_-Nw": {
    "date": "10/24/2018",
    "text": "Great place. Staff and meals have all been sellar. I recommend them to anybody that is every in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XXHZfeclTsGYsgkpSkHnXg"
  },
  "9XQfM-k60TYrrmXLPbbK9w": {
    "date": "10/26/2018",
    "text": "I came here for the BBQ many times and all items are very good.  After trying the grilled salmon and sweet potatoes , I find this is now my favorite. Fast, nice employees, great food, very nice theme, and just a pleasant place to eat",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c14PAVzMMRjK36FG_NvU1Q"
  },
  "26Ji0813--JrbLwQUZKzsQ": {
    "date": "11/11/2018",
    "text": "I welcome this chain BBQ joint with open arms, and I'm a Texan. Is it the best BBQ iv ever had? Not even close. But it still beats every other BBQ place in the region and is very affordable",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BIBmidn3fhRzLvYMZLshEA"
  },
  "W3apOjlTEXwL1jF-dkfkTQ": {
    "date": "10/1/2018",
    "text": "The worst meal I have had in a very long time. Even the rolls were stale. The baked beans were just a dismal glump of brown- like they did one to many refreshes. The coleslaw was tasteless, the pulled pork was dried out as was the chicken. And nothing was hot. Blew $30 bucks",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bb_a7k3Bmkxb5OFKoWwMBg"
  },
  "dLXhVtr7OffbDVtofO8VeQ": {
    "date": "11/4/2018",
    "text": "Great family feel and good food! Good value and love that there's lots of different BBQ options to try. Only downside to the restaurant is that its SO busy during normal dining hours it is hard to get a table. Also important to note how amazing it was too see them treating our military, EMS, fire, and police with free dessert.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Lv-359FrPyqPDXLoB7JbA"
  },
  "Ct3dKwZRHtwxu1n6YO_Ogw": {
    "date": "12/28/2018",
    "text": "My husband and I went for dinner tonight and were SO impressed. The staff was fantastic, food was excellent and the company has great values. As soon as we walked in we were greeted by the employees. The cashier taking our order was friendly and courteous. One worker asked if it was our first time and directed us to the drinks and condiments and let us know he would bring us our food. We had our baby with us and another man went and got a sling to put the baby carrier and later came back to chat with us. Another worker cleaned our tray from the table when he saw we were done eating. Everyone was so friendly and made you feel like they truly appreciated your business and wanted to take care of you.  The food was great. I got the pulled pork and husband got the pulled chicken. There is a nice assortment of sauces on the table. Tupelo honey heat was my favorite. The pork was moist and tender and smoked to perfection. We had fries and coleslaw as sides and both were just right. And what bbq would be complete without cornbread (with the butter at room temp so it's not a rock when you try to spread it).  The one employee who came by to chat also filled us in on how the company gives back to the military and first responders. Also how they stop at noon to play the national anthem. Their appreciation for those who serve and for our country made me love the place even more.  Can't wait to go back.  Ps- our dinner was just under $20.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ndaCgE-iBHK4qVKXDIsejw"
  },
  "RtFI_-kVuwM1QsiyOcypGA": {
    "date": "12/23/2018",
    "text": "Mission bbq is OUT OF SIGHT! I had the pulled chicken, brisket,  creamy corn, bread pudding, & baked beans & it knocked my socks off! I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v88kPSvg5YJUZRE8_s7bXg"
  },
  "dVDW6tmbFt_HbABCH-4Vcw": {
    "date": "5/4/2019",
    "text": "The best service around! Been going here since it opened opened in Robinson. Never had a bad experience and never disappoints. Refreshing to experience a patriotic restaurant that provides several opportunities to support the troops.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkU83UosuegJSkmjshZshA"
  },
  "k0n1iA9L2_j7L7uASPwq2w": {
    "date": "9/5/2018",
    "text": "F*****g delicious! The Brisket is amazing! The prices are reasonable and the staff is extremely friendly and helpful!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ROrJkOT9Un2CN82R5GGpyg"
  },
  "lcw0zNe57BzIBinsIcm4lQ": {
    "date": "11/28/2018",
    "text": "This is my husbands new favorite BBQ place!  The brisket is amazing - get the moist!  Also the Mac & cheese is the best I've had and closet to homemade!!  Lots of variety to choose from and we haven't had a side we don't like yet!  Pay extra for a plastic cup and a portion goes to charity and when you return with the cup only pay .99 for a refill!  We just keep buying new plastic cups?!?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "45bkv2zNy6ctncCttycLfA"
  },
  "1JS5uf8EaOTwCGlp5y8Qkg": {
    "date": "9/8/2018",
    "text": "Decent barbeque. Small portions, expensive canned sides, generally overpriced. Could do without the military industrial complex decor by Raytheon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mM_YbcCqqJ7nTJYU-Pt1uQ"
  },
  "Y50-D0-Gwf84BCn2qEoY8A": {
    "date": "7/26/2018",
    "text": "Great BBQ place. We had the ribs, pulled pork sandwich, collard greens, and macaroni & cheese. I didn't realize this was a chain. You place your order at the register and they call your name for pickup. Lots of seating although it was especially crowded when we visited. We found a nice spot to sit outside - they have a few picnic tables and umbrellas on their patio. The employees showed us good service - food came out fast, they suggested a combo, and brought us sauce outside to our table. Will definitely visit again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "-m9VlH-YZ3DDTlelvaj9LQ"
  },
  "zDqpQEZ73cormBO8_CbxLg": {
    "date": "6/30/2018",
    "text": "This location just opened but things appear to be running as smooth as they do at all of the other Mission BBQ locations I've frequented.  The staff was welcoming, attentive and engaging with all of the customers.  Members of the management team were interacting with customers to ensure everything was perfect.  I hope this becomes a routine practice versus a \"just opened\" activity.  The food was great! I have never had a bad meal at a Mission BBQ location.  The only negative comment on the entire experience is the food being served at the lower need of the warm scale.  Otherwise, I am happy Mission BBQ finally opened a location within commuting distance. I will keep coming back is long as the food is service continues to be outstanding.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fzpOlfHZi8D38c7yGQL08w"
  },
  "Ce44cBkLqWUeZNxkPv6oug": {
    "date": "9/1/2018",
    "text": "Not sure if Pittsburgh BBQ normally tastes like this, but it was EXTREMELY salty. We ordered the ribs, links and shredded pork. We had to throw away the ribs after spending $20 dollars on it. Didn't feel like complaining and asking for our money back. Was hoping for better based on the reviews. Just be warned.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gl2huWCKiDfL7OD9cdCxyA"
  },
  "A0kgRhx3KTzdjhEMFuv9HA": {
    "date": "7/29/2018",
    "text": "I like the atmosphere more than the food, although the BBQ itself is pretty awesome. (My favorite was the Smokey Mountain one.) I had it on the chicken, which was very tender but lukewarm. Had that been a little warmer, I would have happily given Mission BBQ four stars!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "pKifJg2M1APWDEmqDSStzg"
  },
  "ylBmYexEx1TxLrrgRg9ZbA": {
    "date": "7/27/2018",
    "text": "We went to Mission BBQ in Nashville a few years back and loved it. We were so happy to hear that one was being opened in Pittsburgh, and it did not disappoint. The line moves very quickly even at prime eating time on a Friday night. Our food was delicious and the different BBQs at the table always make for fun conversation. All in all it was a great experience. We will be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qxWnJmASGRht_08h-4bO4Q"
  },
  "x7D7nLODG0n_aqbQSDL1rQ": {
    "date": "8/12/2018",
    "text": "Yesssss! Finally a great BBQ joint near my house!  They are a little on the expensive side, but they are worth it. I love that the sauces are all on the table to try. The decor is neat. They support veterans and first responders. I can't wait to go back and try more off the menu!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_O5ajREINPG9zeyhW5Dmqg"
  },
  "2BEETrJJvPTDMCZ6mBZaPA": {
    "date": "8/12/2018",
    "text": "This place is great! Definitely the best BBQ around Pittsburgh. My wife and I have been a few times now and share the sampler. I love their honey heat sauce! They will let you choose between lean or moist brisket, the fatty brisket is the way to go!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZmG6Zt9V_QBRkhGyAosYBQ"
  },
  "aW-pP0C3sq0hXLMam6yrNA": {
    "date": "10/17/2018",
    "text": "I've often thought a good way to see what a restaurant is really like is to drop in during off hours, between lunch and dinner. Stopped at 2 pm on a weekday. Ordered a sampler with two sides. $14 to go. Impressions...  Got the brisket and turkey. Both nicely smoked and tender. Generous portions. Tried the Memphis Belle sauce and liked it. Good balance of sweet and spice. There are five other sauces to choose from.  Sides: Cole slaw - Wasn't over soaked in mayo. Mild, subtle flavors. Long shredded veggies, not finely chopped. Cheesy potatoes - Delicious but very salty. Tender chunks of potato with lots of real melted cheese. Not that Mission is going to take my advice but... with all the salt in cheese, why add more if that's what's going on? Portions were good.  Came with cornbread which was moist and not too sweet. Good compliment for the smoky/spicy meats as was the cole slaw. Only the potatoes, which I enjoyed, stood out as less than ideal with the BBQ.  This place is NOISY, even between busy times. Could barely hear my name called when the order was ready. Loud music, people talking in raised voices to be heard over it.   No complaints about the service or price. Overall, if you like BBQ (especially brisket as it is served in Texas) think you will enjoy Mission.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lx4qae4sfIovjT-MT57Axg"
  },
  "ZSmJFw0bR8ivEa8i63tXUg": {
    "date": "8/16/2018",
    "text": "Some of the best service I've ever had came from the staff at Mission BBQ. Even if the food was mediocre at best I'd give it another shot just based off of the experience and service alone. The food was served in big portion sizes, and was excellent. I got a pulled pork sandwich with fries and Mac and cheese. The pulled pork was delicious and moist, the fries were delicious and well seasoned, and the Mac n cheese was some of the best I've had in awhile, it's very rich. I will definitely be back to try some more items on the menu like the brisket and chicken.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RT0Qo4-47eGJwa0lijV1Bw"
  },
  "D1MdwdOWGDMnPRkqTIrwxg": {
    "date": "7/1/2018",
    "text": "Their food is fresh and amazing. They have a selection of different BBQ sauces to try. Their french fries are fresh cut and seasoned perfectly. They have a ton of gluten free options. Staff is friendly and helpful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V-sISrr5NHod0IJvOqxr-w"
  },
  "E0qDJ1V54OxVYpcd9vTkag": {
    "date": "6/30/2018",
    "text": "Awesome !!!! Amazing pulled pork & brisket sandwiches. Mac & Cheese is the bomb. Great service , great food , great staff and design. Can't wait to get back to lunch soon.  Choice of bbq sauces too.Yeah , buddy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EhwqV1NhLNWdX50mNJvi2A"
  },
  "6HZ8BIQKW_bzsAV3Rqmopg": {
    "date": "6/29/2018",
    "text": "This place is fantastic. Line out the door when I showed up, still had my food within 15 mins. These guys are on top of their game. The food was some of the best BBQ I've had. Brisket was amazing, baby-backs were tender fall off the bone delicious. Everyone coming out of the restaurant kept telling everyone in line how great it was.  All round a great dining experience! You know it's good when you have it for lunch and already start thinking about going back for dinner same day!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "wMrb4by6xiZ4vhr5m36D6Q"
  },
  "f4kLDLXxrOhzNrKcR1TtKQ": {
    "date": "8/8/2018",
    "text": "This place is BOMB. I'm a huge fan. Their Mac n cheese is out of this world, and so is all the variety of meat. I can't even tell you what I got last time, but there was so much food to feed me for the entire week. The restaurant is homey feeling and everyone there was SO nice. We're so glad to have this little place in our little town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Du3PE6QHVKnRXeCPl65ZPw"
  },
  "3WI5nLSAaRDjPoYa2w3dkA": {
    "date": "7/17/2018",
    "text": "Very cool place.    Food is good and fast.   Very cool atmosphere.   Lots of military, police, and firefighter memorabilia on the walls.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_c_qAv00T9RIkYudBCy3NQ"
  }
}