{
  "RDIle_aXhknN4iElR-SYMQ": {
    "date": "9/30/2017",
    "text": "I am from Sichuan (Szechuan), and I endorse for the food here. The decoration of the restaurant may not be very fancy, but the price and flavor for the food are top notch. We ordered spicy fish filet and Chengdu style pork belly. Both are very good. Will definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DcgsdcZzUlQwbGi4aUZ49Q",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DcgsdcZzUlQwbGi4aUZ49Q/o.jpg"
      },
      {
        "img_id": "mu9_NgQ226Mu8vNj_Kinrw",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mu9_NgQ226Mu8vNj_Kinrw/o.jpg"
      }
    ],
    "user_id": "3iFV_XoufX2i1iPpNNvKNQ"
  },
  "zFqzXylp1o80YlmpTmWcRw": {
    "date": "11/10/2017",
    "text": "I have been craving Asian food all week and I will be honest... their home-style beef noodle soup hit the spot. I took the drove over, the service was nice. They were super sweet and welcoming despite getting takeout! I will definitely be here more often and I cannot wait to try more of their dishes on their menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m4VSU-8JPGZc5hGRbyNWqg"
  },
  "lvO1X1iqnpYzeb99GByTvw": {
    "date": "10/19/2017",
    "text": "So far, I think this is probably one of the better Chinese restaurant that delivers to us. They offer both American Chinese, authentic Chinese and sushi. We got geo chicken and shredded pork in garlic sauce. The geo chicken tasted really good but it could be more crispier, part of it I think is because it was delivery. The shredded pork was 6.5/10 authentic. It was not like some other place claim they have the authentic Szechuan dish but it was really not. This one it has most of the ingredients that the dish would have if it is in China. It tasted a little bit too salty. There are defiantly some improvements can be done but I'm pretty happy with the order. Look order again to try some other dishes they have. One more tip for ordering, make sure mention that you want the meal cooked in authentic Chinese style or American style. I think there are some dishes that can be cooked in both ways.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pW_XkS9BfbnAQ_JMxNA-8w"
  },
  "3EhyIHEo6B_9lks7RnHoSQ": {
    "date": "3/16/2018",
    "text": "Awful. Two stars for being a clean asian restaurant in the city which is seemingly impossible to find these days. Filled with msg, tasted like old fryer oil, and chewy crappy chicken.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "a0-Lv095eNh5r5ghtl7d4g"
  },
  "Z5EsPHbdyzl2QxqUo8n5iQ": {
    "date": "8/20/2017",
    "text": "Impressively fantastic food. I think the waiter was a bit new and almost seemed apologetic and worried we didn't know what we were getting ourselves into. There's not much \"American Chinese\" food here and that's why I love it. Everything we ordered was fantastic and very unlike anything I've had. Will definitely come back next time I'm in the city.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "g-Kzbuh60BfQILNs_Z4Jdw"
  },
  "iHy0YVTU9ndv9UCbmCkMdQ": {
    "date": "9/20/2017",
    "text": "I ordered take out from this place and it was terrible. I got the general chicken all white meat with a salad. The chicken was dry and stale. It tasted like it has been sitting around all day. It was not fresh. The salad was just iceberg lettuce and 2 cherry tomatoes. The lettuce had a disgusting taste. Not a good experience.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B2n7XIQl3C0iTbQkDIFtzg"
  },
  "yPmIE0dryKUwPjWI6Pk4kQ": {
    "date": "6/17/2018",
    "text": "Great food packed full of flavors, especially when you can eat spicy food. I highly recommend the black pepper chicken and dried chicken chongqing style. Surprisingly quite fresh and tasty sushi, too. The only reason for docking 1 star is the slightly higher price point.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zCKTJ0gEG3o9LyICaApR7Q"
  },
  "6V0nulRV3_l3Zf7dMim68g": {
    "date": "10/2/2017",
    "text": "We came as a couple on a Monday night, it was quiet. Service was courteous and prompt - all of them greeted us with a smile. Our waiter also went the extra mile whenever he served us, for example, by bringing out extra plates for sharing when we only asked for bowls.  The restaurant is spacious and layout is well thought out. Because there is so much space, the tables are placed quite far apart from each other which allowed us a quiet and comfortable meal in our own spot. This in itself was a big part of our enjoyable experience here tonight.  We ordered a pot of chinese tea and 2 szechuan dishes. The pot of chinese tea definitely added to the authenticity of dining here.  1) Flaming chicken wings on hot dish Served on a small flame that kept it warm throughout, portions were generous with mushrooms, cauliflower and celery.  2) Braised pork intestine noodle soup We really enjoyed everything about this dish - noodles, soup and intestines. The intestines were the big ones. The soup had just the right amount of spice and flavouring without drowning each other out. The noodles were similar like udon / lo mien style noodles.  Dinner for 2 people came came out to $27.00, fairly cheap for such a decent meal. We will definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sR3dV8yPdtgTkr49eEX1FA"
  },
  "w_aenJ3TnirP8mv5qKBi6w": {
    "date": "8/21/2017",
    "text": "Loved the food here. Feels like home . It's not the fusion Chinese type . I can say it quite authentic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OdByPxn5oLB-u81072Vp4w",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OdByPxn5oLB-u81072Vp4w/o.jpg"
      }
    ],
    "user_id": "TBpNugApb96pJhYRvCUwCQ"
  },
  "CvmfYCfo0-jqb2nBGf09EA": {
    "date": "6/4/2018",
    "text": "My wife and I love Sichuan food so we definitely had to try this place out when we moved it. The staff was friendly and attentive. We ordered the beef tendon appetizer, double cooked sliced pork belly and the fish fillet in spicy broth. The food arrived timely and portions were generous and tasted as you would expect from a Sichuan restaurant. The fish however stole the show since I could tell the fish were freshly filleted as opposed to the commercial fillets a lot of other places use. If I had to make one critique, it's not as spicy as many Sichuan places which didn't bother me since I like food spicy or mild. If you're looking for a kick though you might need to ask them to make it spicier.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqow-0HOv5A40Oh0m3YSQw"
  },
  "F271VVUmEyf_xYkYOQxZ3w": {
    "date": "12/25/2017",
    "text": "I was looking forward to this place because the previous restaurant at this location was good.  I was sorely disappointed.  All 3 dishes I ordered -- Dan Dan noodles, mapo tofu with fish filet, and twice cooked pork in black bean sauce -- were so heavily salted that they were inedible.  I won't be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ppvrV8ljyRymOhQsMDNNw"
  },
  "OiHpf__R9Qt2bXdXLtaqRA": {
    "date": "12/3/2017",
    "text": "Ordered delivery from here last night, it was the first time I ever had food from Szechuan Spice. I got pork dumplings, vegetable spring rolls and rice. It was all delicious and cooked perfectly. The prices were a little high but it is definitely worth it, I would eat here again for sure. The delivery came quickly as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fBZmEe_OkLwK3RCnYwFVzw"
  },
  "cnI393aQfr8OooHHLYrqrw": {
    "date": "9/30/2017",
    "text": "yes. yes. yes. Have you had Mao Pow Tofu? if not... your missing out. Place is large and bright... with what seems to be allot of options. I had take-out. I brought my own containers (trying to not use plastic/ zero-waste) They were open and friendly about it. I order Mao Pow Tofu and Chinese Broccoli. Wow. I grew up in San Fransisco and this is THE REAL DEAL. I requested vegan/ no fish oil/meat and they were also wonderful about that. Im going to plan a vegan dinner here. Such a great spot. Looking forward to going in for lunch specials soon. Yay real Szechuan Vegan food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NUsNwmTpfHbzjU_2KvaNZQ"
  },
  "FOwOgjnFipxLMSKaRNC8Kw": {
    "date": "9/6/2017",
    "text": "I tried this with a friend, eager to compare it to the other Szechuan restaurants in the East End.  Aside from the fact that our server was new and hardly knew the menu, our overall experience was average.  We couldn't figure out how to order what the other tables had (hopelessly American we are) and our server was not of help.  We had an amazing appetizer of cold noodles with a spicy sauce, but our main dishes were only meh.  The taste was nothing special.  I might give this place another shot, and hopefully get a more knowledgable server.  As of now, I *much* prefer Chengdu or Sichuan House.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P8BgdR-78Jan-Kd8xTXBcw"
  },
  "pIPBRtOp5R4pc9DwY2OOKg": {
    "date": "9/29/2017",
    "text": "RUDE PEOPLE. BAD SERVICE! Do not order unless you want to wait for your unsavory cold food for over an hour an a half!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HlzSGQsHPokhfd0F3V0lPw"
  },
  "xy-wyG5fTymclFFZTRMvRA": {
    "date": "1/26/2018",
    "text": "We found out about this place on accident and have been ordering from there on a weekly basis ever since. Huge quantity for the great price and the food is always fresh and delicious. We have only ordered takeout and have not eaten in the restaurant yet but the place is really nice inside. The staff is always very friendly as well, and the orders are ready in no time at all. So happy to have this gem in Shadyside!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vN6qboKOR_bNELe6wws7Dw"
  },
  "otDGsia58BknPbJxj8X_bA": {
    "date": "7/27/2017",
    "text": "Literally best Chinese food I've ever had. Excellent service. Fantastic people. They have such a huge variety of food it was hard to choose but everything was just so delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "97KepUo6IGNEhVGxlOb5ZA"
  },
  "MMeDkMkeF5Ku8jPhXssIWg": {
    "date": "2/4/2018",
    "text": "great new restaurant!  ordered out through yelp delivery and it was much faster than anticipated.  Hard to find good authentic chinese food in the burgh, and pleasantly surprised.  Haven't eaten there yet but expect the same authenticity!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nikfxCHBC1jns30eOnpq_w"
  },
  "6exmatL97VwBXtkX8rbfjg": {
    "date": "9/13/2017",
    "text": "The lunch specials (which are available on Saturdays!) are a steal. Huge portions of Chongqing dry-fried chicken, green beans with minced pork, mapo tofu. The only dish that missed the mark were the dandan noodles - we felt that it needed just a touch of sourness or vinegar to cut through the sesame paste.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zc3xtHHgt8P-mqHXW0T-OA"
  },
  "UcsAtUo96D09P1uQPChODA": {
    "date": "8/10/2017",
    "text": "Great Chinese food. Great place to take friends to. Not bad service. Mapo Toufu and dishes with fish recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YCmeuUvLOqc6PfzBE5iZqQ"
  },
  "p3HqqMS0O6QN93mjtdq8AA": {
    "date": "1/9/2018",
    "text": "There was a place in the late 70s - mid 80s in Indianapolis on Michigan Road near the old Target that made the most amazing chicken fried rice. I grew up eating their food and I was so sad when that part of town dried up and blew away.   And now? I feel like I'm eating their food again. Best. Chicken. Fried. Rice. Ever. I almost wept as I shoveled it into my mouth. I also like their scallion pancakes. That's all I've ordered via Postmates but I really should visit their restaurant.   For management - Please take a look at the notes customers add to their Postmates, etc. orders. I would kill to add cashews to the fried rice for my next order.   And thank you! Good Chinese food is so hard to find.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "m93-8yqCaXHWJdnVHO4O_w"
  },
  "D91i1psQ8vWJeJVEG6CZvQ": {
    "date": "8/1/2018",
    "text": "This place is now the reigning champion of Szechuan (Sichuan) cuisine in Pittsburgh! Every dish I've eaten there or have had delivered has been excellent. Today I had the shrimp with leek dumplings, eggplant in garlic sauce and double cooked sliced pork belly. All were just the right texture, the pork belly crispy, the eggplant cooked just right so as not to be too fibrous or too soft; it gave to each bite without being limp. The eggplant had a balance of sweet and spicy and the pork belly dish had abundant slices of pork belly and leeks. I'm going to keep going back to the #1 Szechuan restaurant in Pittsburgh but occasionally dropping into the others for comparison. I'll keep you posted in my reviews on Yelp.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0gZ2N8I0N7sE-sknApa4EQ"
  },
  "-RrMbr2rZUMkB1xDqUMn6w": {
    "date": "8/28/2018",
    "text": "This is my favorite Chinese food in Pittsburgh east. They give you the option of white or dark meat which is a bonus because sometimes I've gotten food from other places and I don't honestly know what I'm eating. They also have really good sushi. Food is usually done within 15 min of ordering! I highly recommend for some good food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JPJkWPyECSbvPCogUPvemA"
  },
  "NihqWELR-B2IY7_CZcNK5w": {
    "date": "2/21/2019",
    "text": "Very impressed by the quality of food and service provided by Szechuan. I tried a few Chinese restaurants in Shadyside and this one is the best .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JKZYtNkWLuoH_sNPe1xCHQ"
  },
  "a9ts5KSOAmDppfeHpQYSuw": {
    "date": "8/18/2018",
    "text": "This is decent restaurant overall. The sushi is pretty good. (They have Wednesday sushi discount!). However the authentic Chinese food is mediocre. Service is good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvA-3IRXuvZtJ_2tHoUgjg"
  },
  "ekMuKwZi_-sQMqhs20xVHg": {
    "date": "8/12/2018",
    "text": "I came in 1 hour ahead the closing time but the waitresses were very nice. Last time we ordered mapo tofu, black pepper squid and cashew chicken and all were good. But the mango smoothie was too watery and sweet and boba is not chewy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qGzcK-RojZgc_l7CJlQp3Q"
  },
  "kc9AKYGi3Bsa1rG2WJ0rPQ": {
    "date": "7/26/2017",
    "text": "I visited Szechuan Spice in Shadyside with friends today. They have a very nice open dining area, with round tables for larger groups. It was fairly empty around 5:45pm but around 8 pm it got busy.   We ordered the ribs with black bean sauce Dim sum first (this takes a little longer). The ribs were very good.  Our group also ordered the mapo tofu, fish fillet picked soup, seafood sizzling rice crust, baby bok choy black mushroom, and Chinese eggplant in garlic sauce with chicken (non-spicy option), which was more than enough for 5 people. All of the dishes were shareable and savory. I don't normally eat tofu, and the mapo tofu was delicious.  I can't wait til they add more to the Dim Sum selection, and plan to return again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s09ToobhGpDCaEytgDofBA",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Baby bok choy with black mushroom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/s09ToobhGpDCaEytgDofBA/o.jpg"
      },
      {
        "img_id": "ZwxYuZxMZMBv_p3Bt76a4A",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Chinese eggplant in garlic sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZwxYuZxMZMBv_p3Bt76a4A/o.jpg"
      },
      {
        "img_id": "MnO6RsyKEJ8ev71xG2DASg",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Daily specialties!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MnO6RsyKEJ8ev71xG2DASg/o.jpg"
      }
    ],
    "user_id": "Q7U4XYo9-jvDkdrWW2odQw"
  },
  "LMWbHKMTqSftieu2Eg2Uog": {
    "date": "12/10/2017",
    "text": "I ordered through the Eat24 food delivery service on Saturday evening around 6:45pm and unfortunately my food took almost two hours to come! Eat24's staff was very helpful (their online messaging system), however I really wish that delivery could be reliable!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9MU6L4v83qo9jmutekcWMQ"
  },
  "AX8pDi_2drrRQzU-lNQlYw": {
    "date": "11/5/2017",
    "text": "The delivery was fast but the food didnt have the quality that we expected and it was very oily. The portions were really big though.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iTmBXHOYO5h_WRtFJVSl5g",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iTmBXHOYO5h_WRtFJVSl5g/o.jpg"
      }
    ],
    "user_id": "ZNtTwd6J74_zar1Ac6GqBQ"
  },
  "1HxnKdrbjR2eAlyXFAempQ": {
    "date": "11/20/2017",
    "text": "Authentic Sichuan food - big portions, great price!   We ordered dry fish item (E9), pork belly with taro, fried peppers, fried rice - everything was super Was expecting a big bill - ended up being a third less than what we had in mind. Staff is friendly and efficient. Will visit again if in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OwBYw-INCCDpp_OvDANjEw",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Dry fish (E9) - awesome!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OwBYw-INCCDpp_OvDANjEw/o.jpg"
      }
    ],
    "user_id": "KA9o5_8GoaD6zXf8UyWaDQ"
  },
  "ahLSmapgrivY0sD7IcVgTQ": {
    "date": "6/20/2018",
    "text": "The sushi is delicious. Great atmosphere and quick service. Attentive to detail. Really fresh and never disappointing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e-GLPxjAgN4GYOfd61PiLw",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/e-GLPxjAgN4GYOfd61PiLw/o.jpg"
      },
      {
        "img_id": "pryvCUmZQ6JB_pvvTqsCLQ",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pryvCUmZQ6JB_pvvTqsCLQ/o.jpg"
      }
    ],
    "user_id": "eEl637nsUY3nSvKHl45eiw"
  },
  "9FxdFPsyZVah_xv1g_lbDQ": {
    "date": "6/11/2018",
    "text": "Although this is only my second time eating here, I'm willing to give this five stars for it's authentic cuisine and extremely tasty command of even basic Chinese dishes such as Lo Mein. The noodles are just perfectly thick and cooked, and flavors subtle but rich. Their General Tso's is amazing - spicy sweet thick sauce! The shrimp is my favorite. Also very fast service and delivery, and great value - lots of food for the money! Their menu is very extensive and I look forward to sampling both the traditional and authentic Sichuan dishes when I'm feeling more adventurous!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7W_qvuVauqDAU5gD0E3xbQ"
  },
  "kOa1cQH3Zv2byUBlv3c78Q": {
    "date": "2/19/2018",
    "text": "My go to place for when I'm craving Szechuan. I was incredibly impressed by how quickly I had my food delivered, and how delicious the food tasted. I absolutely love their diced chicken with dried pepper, chongqing style. If you've never had Szechuan peppercorns, this is a great way to experience their unique flavor and heat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8BTwIfYNAYSl1bLXs6XnHA"
  },
  "7NbAA0BXeIa6vIg0tSCm2g": {
    "date": "8/4/2017",
    "text": "VERY tasty food! The service was fast and extremely friendly. We ordered a variety of appetizers from the Chinese & Dim Sum menus, rather than single entees, and were pleased across the board. The atmosphere is light and appealing, and just a little campy.   Welcome to the neighborhood, Szechuan Spice!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m70b-2orhnUlStKW8YFEHg"
  },
  "AknmR5WkwSfsaaJl3waqPQ": {
    "date": "8/25/2017",
    "text": "First visit.  Table is dirty (see picture) and they seated me, but didn't assign a server.  Hoping food makes my visit worth it.  Prices seem reasonable on the lunch menu. Update: Never given water. Order finally taken, but wrong drink brought out.  I assume this isn't normal and hope your visit is better.  As for me, I left so can't speak to the food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0THMZngAffVHt7oxgT6nLQ",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Table",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0THMZngAffVHt7oxgT6nLQ/o.jpg"
      }
    ],
    "user_id": "2G0PfJgnhjr8jcb5nKLA5g"
  },
  "6_goliYYn-IwOU869wNgYQ": {
    "date": "2/12/2018",
    "text": "Some of the worst Chinese in the city! Completely bland, tasted funny, and the potstickers weren't fully cooked - still pink inside. The hot and sour soup was pretty good, but I guess even a blind squirrel finds a nut sometimes. I ordered delivery (UE), so it didn't help that it was cold, and came without utensils or condiments (Makes it hard to eat!).",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X09mKkx416NmNfQIxlCgjg"
  },
  "Nimvo12A5ynw2HSm2P2C0Q": {
    "date": "9/19/2018",
    "text": "We had a wonderful dinner here.  I would recommend Szechuan spice to anyone looking for a great BYOB restaurant.  We had appetizers and sushi with our two toddlers and baby.  Service was quick enough that my kids never got bored.  My husband and I thought the sushi was delicious and our boys ate everything we ordered.  On the drive home they even asked when we are going back again.  Soon for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6257n2HURE6zh8saWTqINA"
  },
  "xj-QSVfmkhX-Zr6OYbmcnA": {
    "date": "11/24/2017",
    "text": "Hands-down the best Asian food that I have had in a long time I will continue to go back the atmosphere is awesome and the food is just damn delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "500NLfwUg0Lf17EH8Qy06w"
  },
  "aBj9-eJQWUD78EyKnUII4g": {
    "date": "1/16/2018",
    "text": "Dinner here on a cold snowy night warmed my soul. Our waiter was young, 3 days on the job, but also very good. We started with really good hot and sour soup. Followed with a whole crispy fish that was off the charts great. We then had string beans. Followed by an extremely spicy dry chicken and pepper . So flavorful and yummy. Ended with Mooshoo Pork. A feast and the price was right all for under $80. Only complaint was tea was made with Lipton Green tea bags- they should serve authentic tea. Great food, great caring service and we dined on a large round table with a lazy Susan to spin the feast. The is in the former Jimmy Tsang on Center. One more quality Chinese restaurant - too many to choose.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UetOIhAdPBkGjm_o-mSC3Q"
  },
  "vorlxaKwF2-eo4T4anTLyA": {
    "date": "10/4/2017",
    "text": "What a great Chinese place! There is a Chinese and American menu. I ordered from the Chinese menu, of course. The shredded pork in garlic sauce is supposedly one of their signature dishes. It was delicious! The portion sizes here are huge and I had enough for 1-2 meals worth of leftovers. The service was really quick too. This place is definitely worth to try for the large portion size, great price, and yummy food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "1bevDJ7iVXnw4FYUV2r26A"
  },
  "EKGnbh0bxjh5ccNtMr5yMw": {
    "date": "9/23/2018",
    "text": "Very friendly staff..they have variety in their menu.. Prices are very low for their quality. They have lunch special deal on sushi.  Overall...this place is awesome!  BTW...parking is available and cheap!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iA_u-8A2znGOXVW-b4mhPA"
  },
  "RhQoxZhOTG9p0JQTylxUQQ": {
    "date": "3/29/2019",
    "text": "This place has the best  in the entire city of Pittsburgh. It is soooooooooo good. Crunchy, spicy, full of flavor. I don't crave a lot of Chinese food in Pittsburgh but I definitely crave this restaurant's yummilicious dishes. Forget the fake stuff. Get something authentic here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BpnEs8ZGrNLh1WNgXbTZLw"
  },
  "cRzna6MynP3I08EwPfzsYw": {
    "date": "4/17/2019",
    "text": "I am a little embarrassed about how many times I've ordered their house salad and had it delivered to my home (it's literally just a huge bed of iceberg lettuce and the best ginger dressing) but alas, it is maybe the best in the city, the lettuce being a vehicle for that delicious dressing. Also love their scallion pancakes, wonton soup, fried rice, other dim sum. A definite Chinese take-out staple - priced right, too. Service is kind of slow for eat in but perfect delivery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KL8prV9ndYvbJzltDFQ6DA"
  },
  "FpVLNdW20HVGeUoG-T6TZA": {
    "date": "6/25/2019",
    "text": "First time there. We had a large group. Staff was friendly,service was fast and good. They handled our group wonderfully.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XxyJBMGccNnI0r-tiFpLqw"
  },
  "bNWYDkETMTRkACWPGO9NRg": {
    "date": "11/4/2018",
    "text": "This place has absolutely delicious food! You can taste the authenticity at Szechuan Spice. We ordered the spicy crab, Chengdu beef, and Peking duck dishes. Everything was full of flavor, fresh and so good! Our 3 & 8 year old kids loved it all, too! Our server was very knowledgable and friendly. This is our first trip to Pittsburgh, and if you're looking for some amazingly tasty Chinese & Japanese cuisine this is is a must!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "le8Mud2sbs_lPc8VipD81g",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/le8Mud2sbs_lPc8VipD81g/o.jpg"
      },
      {
        "img_id": "SKC_eUmtr81xiEkej1jqSg",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SKC_eUmtr81xiEkej1jqSg/o.jpg"
      }
    ],
    "user_id": "7MOkBLy3ObZL7qsO1UP4ww"
  },
  "SJ1pc01KK3riyO2VmIcRhA": {
    "date": "1/7/2018",
    "text": "Really fast delivery and great food! I ordered the Dan dan noodles, wonton in spicy oil, and hot and sour fish soup. The fish soup was so delicious and exactly what I needed on a cold night! The dan dan noodles was also great, but was a little oily. Definitely need to try this place again because of fast delivery and great authentic food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "XImR8FdsuTMorIXcmBN4Qg"
  },
  "s0hByNx3_W-t8rPf3-GbsA": {
    "date": "11/5/2017",
    "text": "It was my first Chinese food delivery experience. Portions were big and i couldn't finish even half of them.  Food quality was good (not great) but satisfactory enough for this price range.  Delivery came very soon (much sooner that expect) and food was warm and in good shape expect sushis.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Q3gsPyYzj_MsB0YVAONBmw",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q3gsPyYzj_MsB0YVAONBmw/o.jpg"
      },
      {
        "img_id": "2EVUOG8jdZOTi-7OyFOwWQ",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2EVUOG8jdZOTi-7OyFOwWQ/o.jpg"
      },
      {
        "img_id": "M64vRxoBX8oCMgj7C0418A",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/M64vRxoBX8oCMgj7C0418A/o.jpg"
      }
    ],
    "user_id": "_TCTRrCucniUT0z_mzxqnQ"
  },
  "uPW8gU6g6XziivJ65F0B9Q": {
    "date": "9/11/2017",
    "text": "Water spinach 5/5 Fish fillet in silk tofu 4/5 tofu so soft Steamed pork with taro 5/5 The interior is not the best and the price is not cheap, but the food tastes really good. The portion is big too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sAp-xaUY-D0IxKUbZlWr3Q",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sAp-xaUY-D0IxKUbZlWr3Q/o.jpg"
      },
      {
        "img_id": "2vd09RT_7KHpYWfLmr3mdw",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2vd09RT_7KHpYWfLmr3mdw/o.jpg"
      }
    ],
    "user_id": "cduGjH1COSY5vvN_QsqtsA"
  },
  "huFED_7ox8KDmgNwDFy6FA": {
    "date": "10/2/2017",
    "text": "Might be my new favorite Szechuan restaurant in town! I've been here several times, both for dine in and take out. I've had better experiences with the food for dine in, but it's still always been delicious! My favorite dishes so far have been the mapo tofu with fish filet (huge portions and spicier than most mapo tofu I've had in Pittsburgh) and the bok choy with black mushrooms (this was was surprisingly delicious). I also sampled my friends spicy beef noodle soup and it was amazing. Their lunch specials are a great value as well.   The prices are a little bit higher than other Sichuan restaurants in Pittsburgh, but I think the portions are much larger as well. Definitely give it a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IaHhu8RLr7qHlZiBYxUFOw",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Lunch portions of mapo tofu and Chengdu style chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IaHhu8RLr7qHlZiBYxUFOw/o.jpg"
      },
      {
        "img_id": "IZ2Xz7UEX2vX8dEu7MXmkA",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Beef noodle soup, mapo tofu with fish filet, baby bok Choy with black mushroom, and pork with bamboo shoots.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IZ2Xz7UEX2vX8dEu7MXmkA/o.jpg"
      }
    ],
    "user_id": "wgTvhNy5-Q1razSWHhWs9w"
  },
  "UYI2s5Ef2wZRDAPXVFw6vA": {
    "date": "8/2/2017",
    "text": "The food is really good ! It is hard to find the fresh authentic Chinese food in Shadyside, now we finally have one there, especially  if you like the spicy food. We ordered fish fillet in hot broth and Diced Chicken with Dried Peppers Chongqing-Style. They both are very tasty. And the place is huge, very comfortable. My new favor spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aruMiOaGxViT02-zsikL9A",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. orange chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aruMiOaGxViT02-zsikL9A/o.jpg"
      },
      {
        "img_id": "d18Ii7OV0w1VXJXQHG1Xbw",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. 川香炸鱼片",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d18Ii7OV0w1VXJXQHG1Xbw/o.jpg"
      },
      {
        "img_id": "1u3sz0chzt2gYcU7wtM64Q",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1u3sz0chzt2gYcU7wtM64Q/o.jpg"
      }
    ],
    "user_id": "31C-EQGUFp2BXltwEYmEig"
  },
  "P19DFgvGdHzkRqnNuil-vQ": {
    "date": "3/4/2018",
    "text": "I remember when this restaurant was Jim Tsangs's many years ago.  For those who also remember how good that food was, you will not be disappointed in Szechuan Spice.  The food is fresh and the flavor is excellent.  I ordered two avocado rolls, which were huge, with perfect avocado texture, and tasty Nori.     The pad Thai had delicious, fresh vegetables.  My husband got Szechuan beef, which he described as both salty and spicy with tender beef, fresh vegetables.  He also described the egg rolls as perfectly cooked , not oily, with a variety of vegetables.  I would recommend this his to anyone in the Shadyside area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "I-usTnZk1Xlbvf2vm38qZA"
  },
  "8hLXlDQSB5HO3gjd-5PGPA": {
    "date": "4/16/2018",
    "text": "My friends and I (4 total) met up to celebrate our accomplishments from the semester. My friend made reservations for us which was not a problem. The place was well lit and the cooking from the kitchen left a delightful aroma which welcomed us in. We started with appetizers fried hot peppers and scallion pancakes. I was a fan of the pancakes bu the fried hot peppers were waaaaaay to hot for my American tongue. Only one of us were able to handle its spice but it was a cool experience. For my entree, I ordered the Chef's Special Szechuan Double Delight. The dish came out quickly and came with white rice. The flavor was delicious and it was a big portion. I probably could have shared it with someone else if I had eaten more rice. Additionally, I was able to take the rest home. The service overall was impeccable. We were given extra plates for sharing and water was refilled as needed. The mochi was also order for dessert and we were given a free scoop of ice cream since we had a hefty bill. They were also able to accommodate splitting the bill between us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3SxT2tlqQgV73C9R4Q6cCw",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Szechuan Double Delight Chef s Specials",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3SxT2tlqQgV73C9R4Q6cCw/o.jpg"
      },
      {
        "img_id": "bp2zqXSOxv3S9YJ-5tM3PA",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Szechuan Double Delight Chef s Specials",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bp2zqXSOxv3S9YJ-5tM3PA/o.jpg"
      }
    ],
    "user_id": "oogG6am_fY37MZZFxsYAcw"
  },
  "l50LUiCGcc2403-keQ1NNA": {
    "date": "7/22/2018",
    "text": "Delicious delivery. Yummy tofu and sushi and cooked veggies. The only complaint is the mochi didn't have paste in it. I'm dairy I tolerant so I feel duped by getting mochi not the mochi ice cream but the mochi.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "YoJb8ZoR_jmif_XpWp_5Kw"
  },
  "maBPJudctMoV26s7VxrlNA": {
    "date": "4/6/2018",
    "text": "Solid!! Only had Gen So and an egg roll but it really good, and fairly priced.  This is my new 'goto' for Chinese take out.   It's the old Jimmy Wans location. Looks a lot nicer inside too, even though I did stay.   Big menu.  All the bells and whistles.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ojeUId0geFF9uo7rTSFSA"
  },
  "cCqSDUG7Xm4M0aMEHpD4NQ": {
    "date": "12/3/2017",
    "text": "Is it just me or did it take forever for this place to finally get off the ground.  How many years was it that this place sat in a state of suspended readiness?  Finally, it opened it's doors and ran with it.  The good thing about working in Oakland means that you have a multitude of places to order your lunch from.  Working with people that seem to live off of Chinese food, you always have the best restaurants' menus available.    I was in the mood for some good vegetable chow down.  Looking over the 'Vegetables' section I honed in on a potato based plate.  I went with Sauteed Shredded Potatoes.  When you select this you have three choices of sauce: hot pepper, spicy sauce, or vinegar (not spicy).  Looking at that list, if you are like me, you would think that meant the the spice level was in descending order.  That would be why I went with spicy sauce.  My god, was I ever wrong, I should have went with vinegar.  I don't mind some good spicy food, but that's when I could enjoy it.  This had a spice to it that made me cry, and not with joy.  That's not to take away from the overall plate, it was a good taste and cooked amazingly.  It's just I was paying for this meal well into the morning, if you know what I mean.  I think at one point I even opened the fridge and pulled out some pesto to cool this down a bit.  Even though the spice level was burning my eyebrows off, I still went at this.  Sweat coming out of every pore, nose like a faucet and an uncomfortable feeling of what lay ahead.  Would I get this dish again, yes, but the vinegar sauce would be my answer to this.  Why not five stars?  The price.  Some of the prices were down right outrageous.  For the price here you could possibly get two meals elsewhere.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 7,
      "cool": 10
    },
    "photos": [],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "oN8U--zI_qq4CA5WXFy9ZQ": {
    "date": "12/30/2017",
    "text": "Diced Chicken with Dried Pepper Chongqing Style.  These are the words that changed my life forever.  I can't stop thinking about it. The flavors and the burning mouth and the herbal flavor of Szechuan peppercorns.   This is the ultimate dish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "Zv1DkDIgAAFt0S88a2qROg"
  },
  "DUc9Zo5gDtU3EY0BB-ZB_w": {
    "date": "7/30/2018",
    "text": "Was excited to try after the reviews I read. Based on those reviews I got the Diced Chicken with Dried Pepper Chongqing-Style and the Spicy girl roll. The roll was delicious, so when the big plate of crispy chicken covered in peppers came, I was excited. Unfortunately, it was like chewing on a salt block. The crisp was perfect, the heat was great, but I could not get past the overwhelming salt. I asked the waitress if it was supposed to be really salty and she said she never noticed. I had her take it because I truly couldn't eat it. She said she would tell the chef, but no one asked/apologized to me or offered me anything. (At the very least, since I barely ate, the meal should have come off my bill). Too bad, this place is up the street from the hotel I stay at every month, but I won't be back.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kk-_C8ao7MbuDq1yUSPEYQ"
  },
  "fwib96zQokGoCWekdnietA": {
    "date": "8/23/2017",
    "text": "It gets the job done as far as a Chinese food joint goes. Pros: it's not bad. Cons: it's not mind blowing. For the appetizers we got the scallion pancakes and the hot and sour soup: both very lack luster. For entrees we got the general tso's chicken and the mapo tofu: both pretty decent. We also ordered a mango and a strawberry bubble drink: nothing special here, kinda tasted like it was straight from the powder packets. Would I return? Sure, if I was in the mood for mediocre Chinese food and if I was too lazy to drive to the better Chinese restaurants in squirrel hill.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wJ40UAZLk0Vo-9XbpyFMGg",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Scallion pancake and hot&amp;amp;spicy soup: disappointing.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wJ40UAZLk0Vo-9XbpyFMGg/o.jpg"
      },
      {
        "img_id": "_PxCpWc5tW2_7aLOzwLFyA",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Mango and strawberry bubble drink: meh nothing special here.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_PxCpWc5tW2_7aLOzwLFyA/o.jpg"
      },
      {
        "img_id": "XpbYBEqLuI6PWDnOapgZZA",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. General tso&amp;#39;s chicken and mapo tofu: pretty edible.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XpbYBEqLuI6PWDnOapgZZA/o.jpg"
      }
    ],
    "user_id": "fOF_QcG6_k4asO975vDnhQ"
  },
  "kFnUECYZZVVw22W6S9GsxQ": {
    "date": "2/2/2018",
    "text": "Mistakes happen; it's what you do about them that really makes an impression. I've ordered from this place at least 3 times, alternating takeout and delivery. Tonight, my taro bubble tea was missing from my delivered order. I called the driver, thinking it might be in his car, but it was not, and he told me he'd clear it up with the restaurant himself (wow!). No more than 10 minutes later, my phone rings, and it's the driver outside with my bubble tea, made exactly to my specifications. I didn't know it was possible to be impressed with delivery service, but these guys are wicked fast (tonight's dinner was delivered a mere 25 minutes after we ordered) and very courteous.  The food--a perfect compromise for my szechuan cravings and my husband's \"mall Chinese food\" cravings. I get their version of mabo dofu, he gets something fried in a sticky sauce, and we share a Chinese takeout staple: green beans with a generous topping of ground pork. Other favorites include their steamed dumplings and the chopped chicken. The only thing we haven't loved was the dan dan--a little too sesame-y for our tastes (almost tasted peanut-y). And I'll throw down some fighting words--I think their mabo dofu is better than Chengdu and Sichuan Gourmet's.  Super fast tasty food, and they actually read your comments about customizations...what more could you want in a delivery place?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ri4xmSrehzGEqbR1EWAhAw"
  },
  "1BQIFsJ9TQkHun6EtQoE_g": {
    "date": "8/17/2018",
    "text": "We ordered general tso's chicken couple days ago, once we received it, which showed it's white meat and charged for white meat price as well, but actually it's dark meat. I wonder how they can treat the customer this way!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GbR5a5au7L_FGnDmcC_3ew"
  },
  "EwY9QFTmukv7247N8NcBkw": {
    "date": "4/4/2019",
    "text": "One of the best Chinese dinners I have ever had in Pittsburgh. Everything about this place is spectacular- the decor inside, the food, and the ambience!   First, the food and drinks are just simply wonderful. I started my meal off on the sweet side with a mango bubble tea, and I must say, that was one of the best bubble teas ever. The bubble tea did not have a sickening sweet taste, it had rather a naturally sweet taste from the mango and coconut jelly in it. The liquid was not grainy and there were plenty of tapioca balls and coconut jelly pieces in the drink. Onto the food- delicious, marvelous, and authentic is how to sum things up. My family and I ordered a few appetizers such as scallion pancakes, sushi, and assorted dumplings. The scallion pancakes and sushi were great, but the dumplings hit the spot. They were so flavorful and fresh. For my main course, I had the pork blood tofu soup which came with fish fillet, pork intestine, and beef tripe. Don't knock it until you try it, you have to be adventurous! I loved this soup because the textures of the meats inside are fine with me and there were lots of hot peppers in the soup. Additionally, the portions here are huge. I had so much soup left over that it filled not just one, but two large containers!! To end on a sweet note as well, I had the red bean ice cream for dessert. It was super creamy and it tasted homemade.   If you are looking for authentic Chinese food in the Pittsburgh area, swing by Szechuan Spice because your tastebuds will be very happy!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "QOwVWezp_-moSAo1VynHww",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Red bean ice cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QOwVWezp_-moSAo1VynHww/o.jpg"
      },
      {
        "img_id": "fBgkpzMdW1wRkuMYoVo6jQ",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fBgkpzMdW1wRkuMYoVo6jQ/o.jpg"
      },
      {
        "img_id": "VzZi1O90aNAHOOKnQgUVAQ",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Pork blood tofu soup with fish fillet, pork intestine, and beef tripe",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VzZi1O90aNAHOOKnQgUVAQ/o.jpg"
      }
    ],
    "user_id": "CbSC3bV_Azl6S9HpsduQzw"
  },
  "lwhEfgC0Az63_vgsldm8Ow": {
    "date": "9/19/2019",
    "text": "I highly recommend this place. Very authentic Chinese food. Good pricing too. We had 6 peoples and ordered 8 dishes. All the dishes are very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hl9bHy5eCrevaEdNFGMmFw",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hl9bHy5eCrevaEdNFGMmFw/o.jpg"
      },
      {
        "img_id": "fFt0uOh18g--jyDtmo8KjQ",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Whole fish",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fFt0uOh18g--jyDtmo8KjQ/o.jpg"
      },
      {
        "img_id": "NqIZqkGP6Hng12IPIFqxXg",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NqIZqkGP6Hng12IPIFqxXg/o.jpg"
      }
    ],
    "user_id": "IrBcYxTi6kGiL_2OLnPzuA"
  },
  "whCBoLlBpjfXTEwz5jvPSw": {
    "date": "9/17/2019",
    "text": "Ugh. Very poor quality. My \"avocado\" salad was mostly browning iceberg lettuce with 4 small slices of avocado. I also ordered black pepper chicken and it was described as cooked in a butter sauce, nowhere was it described as \"fried\" or \"breaded\". I had to throw it in trash. It was worse then the Chinese Food at the mall food court. My daughters sushi was mediocre. I won't be ordering from here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XfL2d_ctylsgbtPvlcGsdA"
  },
  "hdLH4EA7tWRgK9IQ-0LCvA": {
    "date": "8/4/2019",
    "text": "Long story short: fast, large portions, don't skimp on protein (tofu in my case), and very professional and considerate. Worth every penny   Ordered here for the first time, and by far the best Chinese establishment I have had the pleasure of experiencing. I ordered take out 30 min before closed, and they were able to make my food within 15 min. In addition, when I my order I was surprised on how much I was given, and the fact that my pad Thai wasn't just a pile of cheap noodles but had a fair portion of vegetables, egg, and tofu. What impressed me the most was the fact that they included a lime and a side of peanuts. It was very considerate of them to provide me a side of peanuts since I didn't specify if I'm allergic to peanuts. Just goes to show the amount of detail and care they have for their cust",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4G0vI-ZcT-oKMHL2dl5Pmw",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Very large portion of Pad Thai , with a side of complementary peanuts and a lime.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4G0vI-ZcT-oKMHL2dl5Pmw/o.jpg"
      }
    ],
    "user_id": "zHS_hssiEEWrFT9_zmdb2w"
  },
  "OhsKaVChRksi2L-4DIQ_Qw": {
    "date": "8/10/2018",
    "text": "One of my Chinese go-tos. For me as a student, it is easily accessible by 71C/71A/82 and near Aldi, Giant Eagle, and Whole Foods farther down the street too.  LUNCH SPECIAL ($7-$8): I have had the Shredded beef with hot pepper here, and thought it was kind of salty then I proceeded to pass out for 3 hours possibly from MSG?? Diced chicken Chengdu style is very good and has good spice, but the chicken pieces are a bit small. SUSHI LUNCH SPECIAL ($9-$12): 2 rolls for $9 with your choice of house salad or miso soup. Or a sashimi special! We always like to at least get the unagi maki :). BROILED FISH (~$19): Every Szechuan place I go to, I have to try this. Me and the boyfriend have tried their spicy broiled fish here several times, and they have made it with different veggies sometimes. I think it's best when served in the flat glass dish. PEA SHOOTS (~$10): Sometimes too oily, but always given a lot for your dollar.  A lot of people seem to get delivery or take out, but I would try giving them a visit for dine-in! It is very spacious in here and they recently got some cozy black booths instead of regular tables. I highly recommend Szechuan Spice if you're trying to find a Chinese restaurant for a big party too!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "2Oal5S_duLbObaKPAFKfMg",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. House Salad with Sushi Lunch",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2Oal5S_duLbObaKPAFKfMg/o.jpg"
      },
      {
        "img_id": "4Ah5YsHvDM1YmTTpPscMQA",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. 8. Unagi Maki (8) and 9. Shrimp Tempura Roll (8)  Diced chicken on the right",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4Ah5YsHvDM1YmTTpPscMQA/o.jpg"
      },
      {
        "img_id": "vsmDSKoozKzUrfdjrjPRDw",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vsmDSKoozKzUrfdjrjPRDw/o.jpg"
      }
    ],
    "user_id": "E1FJIPr-VRPotG8v6c2kaA"
  },
  "K_lSEkiafSmE2eAdlXPvTQ": {
    "date": "9/2/2018",
    "text": "Okay came here in person and updated my review from 3 to 5 stars. Sushi (3 spicy maki rolls for $15!) was DELICIOUS. The food was also bomb and it came out in minutes. Finally might've found my go to sushi place in Pittsburgh! Portions are also huge   I'll update this after I try more authentic dishes in case the review improves, but we ordered from here because the apartment we moved into is a few blocks away and we needed to find a go-to take out place. We ordered general tsos chicken (I'm dating a basic human) and a few pork eggrolls. General tsos was typical, nothing special, especially for the price. As soon as I tried the eggroll I gagged. My boyfriend tried one and had the same reac. I needed to investigate... it wasn't the wonton skin on the outside... it wasn't the cabbage.. it wasn't the celery... it was the pork! The pork tasted heinous, maybe it went bad? Either way we tossed them immediately (cries in the inside).",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6GO6Fa2zbjvob4YDem070g",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6GO6Fa2zbjvob4YDem070g/o.jpg"
      },
      {
        "img_id": "Jgv6fGFrdKSZ2PN4UEhpUQ",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Jgv6fGFrdKSZ2PN4UEhpUQ/o.jpg"
      }
    ],
    "user_id": "-Ds0hzlQwZUukmOwnapaFg"
  },
  "BioFL-xG5W7J_Eue3VhpQA": {
    "date": "9/26/2018",
    "text": "Stopped by here this afternoon for some lunch! I ordered take out, but in Wednesdays they have 1/2 off sushi specials but for DINE IN only! I didn't really feel like sticking around so I just ordered the chicken and string beans lunch special and their $10 2 roll lunch special. I ended up getting two shrimp tempura rolls (shrimp tempura and avocado).  The chicken and string beans were ok; I've been here before for their Szechuan cuisine and I would say that their Szechuan food tastes better than their American-Chinese options. I've had their mapo tofu and diced chicken with fried peppers chongqing style and they were both 10/10.  The sushi was fresh and it tasted good. Good amount of food for the price. They have a lot of lunch specials and deals so it's nicer on the wallet. I feel like the portions are bigger when you eat in and the service is typically pretty good, so if you have the time to sit, I'd recommend it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hMJIKJpwbs5uN2yjTwtiEA",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Chicken with green beans lunch special, shrimp tempura roll, and green salad.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hMJIKJpwbs5uN2yjTwtiEA/o.jpg"
      }
    ],
    "user_id": "pspJkQgUOap1OjTZVMbdsQ"
  },
  "PNkKNza78QTI-6TO8_zzLg": {
    "date": "4/29/2018",
    "text": "** Authentic Chinese food with sushi deals on Wednesdays. Very spacious and not very crowded so it's a good place to hangout with larger groups and have conversations.  I discovered this place from my girlfriend, who saw several ads and also frequently shops at Geagle and Aldi nearby. Needless to say we've been here several times and it's been solid every time. They have half off sushi on Wednesday, which I think tastes decently fresh (the unagi)  Typically we ordered the broiled fish as well as the pea shoots. Both are tasty and authentic - however the broiled fish sometimes has a bit too much mala numbing spice, making our lips very tingly and sometimes just a bit overwhelming, so we ask for less spice. The veggies are also a bit on the oilier side.   It's never been crowded and the place is very spacious, which I like since I never feel packed or disturbed by a lot of noise. Definitely give this place a shot if you are in the area!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E47CN1N6ghehDEtRbrvQOg",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Broiled fish and pea shoots",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/E47CN1N6ghehDEtRbrvQOg/o.jpg"
      },
      {
        "img_id": "Co2seqd5HSUmKz4MR03A4A",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Avacado eel sushi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Co2seqd5HSUmKz4MR03A4A/o.jpg"
      },
      {
        "img_id": "kTScxMO_98p7iJWj7jyHLA",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Broiled fish and pea shoots",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kTScxMO_98p7iJWj7jyHLA/o.jpg"
      }
    ],
    "user_id": "mxufNEcZIYndtjPHVtCh5w"
  },
  "dFzKZzzAXtW02GSyUPQy5A": {
    "date": "11/13/2018",
    "text": "4/5 for food, if I were including delivery it would be 3/5.  Ordered delivery and when the guy got here, he called, I told him to come around to the side of the house because that's where my entrance is. He just said \"I'm here\" hung up and delivered the food to my neighbors instead. Luckily I have honest neighbors.  Got the 2 sushi roll lunch special.  Shrimp tempura roll was 5/5. Insanely good. The cucumber and tobiko gave it a nice extra crunch and the avocado and crab were good additions. Sweet potato roll 2/5: I love sweet potato tempura rolls. But the tempura was completely soggy, the sweet potato was hard/not cooked or ripe, and the rice was dried out. Mapo tofu 3.5/5: This is kind of my fault because I didn't realize it came with soft tofu, but I thought the tofu made it really difficult to eat and was too slimy. The sauce was yummy but I would not order this again.  Honestly it only got 4/5 because the shrimp tempura roll was so good and it was a really good amount of food for the price. I would definitely try the sushi lunch special again but get another roll instead of sweet potato.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1L5onC5-5s3Tv_uGYpBISw",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Mapo tofu takeout. Tofu was way too slimy but the sauce was really good.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1L5onC5-5s3Tv_uGYpBISw/o.jpg"
      },
      {
        "img_id": "KtQ1uzYIVK343pcpnBHuLQ",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Front: Shrimp tempura roll Back: sweet potato roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KtQ1uzYIVK343pcpnBHuLQ/o.jpg"
      }
    ],
    "user_id": "f3fTRZolbPsbEDb9A59UiA"
  },
  "H56qzYbv1k6QKAgkzc3Zzw": {
    "date": "4/15/2018",
    "text": "We came to enjoy a mix of Chinese food and half-off sushi specials!   Everything was good. Nothing was amazing but it was all very solid and I'll be back. Note that sushi is not half off the entire menu, but there's a select Wednesday menu (shown in photos).  Overall, a great addition to Shadyside!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gW6DwVUReTvDmJudYXTwdA",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Lunch sushi specials",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gW6DwVUReTvDmJudYXTwdA/o.jpg"
      },
      {
        "img_id": "dVpzDcUUQJU9Gf-KQPN30A",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Lunch specials",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dVpzDcUUQJU9Gf-KQPN30A/o.jpg"
      },
      {
        "img_id": "W5vkb1s9CVW9xcqtBxXstQ",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Wednesday special: half off sushi menu!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/W5vkb1s9CVW9xcqtBxXstQ/o.jpg"
      }
    ],
    "user_id": "vekZnPvP0s9LT8lEvGXnKw"
  },
  "ITpMQjEtDr08yIFtd2nGGg": {
    "date": "2/1/2018",
    "text": "I finally was able to stop by and try Szechuan Spice, and after multiple years of living directly over it in the past, this was a long time coming.  If I can give you only one tip with this restaurant, it is this -- Go. On. Wednesday. There is a half price sushi menu and it is excellent. After a meal of 2 specialty sushi rolls, one spicy tuna roll, two pieces of salmon sushi, a pork egg roll, and dessert, the bill was $28. Not too shabby.  I ordered the spicy girl roll which was absolutely perfect. It was spicy, but just a bit, and that was cooled off by the avocado. I really enjoyed how the whole roll was wrapped with imitation crab on the outside; it had a surprising texture and added a sweet note. (yes, most sushi uses imitation crab, don't gasp, deep down you knew that and it is delicious so don't judge).   The salmon sushi was of very good quality; the two rolls ordered by my companion (the rainbow roll and spicy tuna) were also yummy. Very fresh overall! But the most interesting and one of the most surprising parts of the meal was the red bean ice cream. I've never had red bean ice cream before, and it was actually quite good. For some reason it reminded me of stracciatella due to the texture and flavor.  The service was friendly and quick for fresh sushi. I'll have to stop by another time to try all if the different items offered on the menu, but it'll be hard to tear me away from the Wednesday special.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pQhPht9gbxCwy9iyex0i5A",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Spicy girl roll and salmon sushi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pQhPht9gbxCwy9iyex0i5A/o.jpg"
      },
      {
        "img_id": "fT26LgJNxUFR5QOs2R6JNg",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Rainbow Roll and Spicy Tuna",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fT26LgJNxUFR5QOs2R6JNg/o.jpg"
      },
      {
        "img_id": "VhMN8lEtwVbVpmpjFFtOsw",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Red Bean Icr Cream",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VhMN8lEtwVbVpmpjFFtOsw/o.jpg"
      }
    ],
    "user_id": "3HR86J_kKOMpS4ad4Lu5yg"
  },
  "aE7G86kVCr8a8Cg4oO5kBg": {
    "date": "7/3/2019",
    "text": "Ordered delivery from here twice, both time were great. I got the vegetable lo mein and the Chinese eggplant with garlic sauce. Both time they were very good! Not too salty, very tasty, and definitely portions were big enough for two servings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yt2_KMjyiBwa_0TnmtTJWA"
  },
  "PGcoHi_wwoYgnxUhyGBQTw": {
    "date": "12/14/2018",
    "text": "This place has exceptionally poor service. The employees are really young and don't seem to care or have very much experience.  We walked in and had to wait 5 minutes just to get menus after being seated at the sushi bar.  We came in specifically for half-price Sushi Wednesday and they did not give us the menus with the Wednesday Sushi specials for another five minutes, and we had to ask a different staff member for that specific menu.  Then we ordered from the sushi chef directly and after being served sushi had to wait another 4 minutes for chopsticks. This is totally ridiculous as far as the order of service is concerned.  Their English is so poor that a simple request like, \"Please put the vegetable sushi on a separate plate from the fish sushi,\" is too hard for them to understand. To top it all off I was charged for the wrong sushi and asked to have the bill adjusted. She said it was too late because she had already charged my card, and she would give me the difference back in cash but without sales tax. She acted so annoyed that I would actually expect to get the sales tax back from the overcharge that I was given on my bill. So I was like, seriously? I just laid the sales tax on the desk and walked out.  On the up side, the sushi was good quality even though the pickled ginger was the cheap kind with artificial coloring and saccharin in it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "aw1QgQOwX73TOdgmdRaKSA"
  },
  "tB-AhgYgr_qXBIUykAwmag": {
    "date": "1/5/2018",
    "text": "Ordered Uber Eats tonight from here and it was surprisingly very good. I got the Spicy Tuna roll, Alaska roll, and Beef noodle soup. The soup arrived extra hot even though the restaurant is like 20 mins from me! That was a huge plus. The sushi was very fresh but could have had a bit more rice. I don't like a ton of rice but a little more would have been good. The beef soup was really good.   Also they packaged the noodles separate which was much appreciated so that they didn't get too soggy.   Would def order again or make a trip to the restaurant!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DokU2rjP__C0GZ3qBr5bHg",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Beef noodle soup Spicy Tuna Roll 8 Pcs and Alaska Roll 8 Pcs",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DokU2rjP__C0GZ3qBr5bHg/o.jpg"
      }
    ],
    "user_id": "tJiWkQtxSmr4UdfEp-EYHA"
  },
  "1ErxZwiWumYGN8FUYDcsaA": {
    "date": "10/3/2017",
    "text": "Walk by here almost daily for the last few years and glad to see they're open again. Don't know anything about prior or current ownership. But I do know the food is delicious and the portions are huuuuuuge!!! Prices on par with other restaurants of its caliber. Comfortable decor with a sushi bar. Love the ambience. Have enough leftovers for two days and I'm not complaining!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 15,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "d3yEzMPfj2VI2Pdf9IN77Q",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Beef lo mein.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d3yEzMPfj2VI2Pdf9IN77Q/o.jpg"
      },
      {
        "img_id": "wSBXbxSpg9Ec0kG3uSECwg",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Basil noodles with chicken.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wSBXbxSpg9Ec0kG3uSECwg/o.jpg"
      },
      {
        "img_id": "6XHIZj0K5sgI0xVhWoUlmQ",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6XHIZj0K5sgI0xVhWoUlmQ/o.jpg"
      }
    ],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "8b_BbueZxrb7g-QAo91ukw": {
    "date": "12/31/2018",
    "text": "This is my first time eating at this location in probably 20 years. It's been multiple iterations all of an Asian cuisine. Absolutely delicious, we went with 18 people for New Year's eve dinner and I frankly was happy to say that it was the best Chinese dinner I've had in Pittsburgh along time!   Everything was fresh, timely, and the staff was super friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ub62tDwXuUiS6cDiWPHCNw"
  },
  "9sir2Y1TpOl9GNul5cniqQ": {
    "date": "4/28/2018",
    "text": "OVERALL: decent Chinese food with slightly expensive prices. I would be okay with coming here again - however, there are better options elsewhere in Pittsburgh for Sichuan food.   I lived in Sichuan for the first few years of my life, and love spicy food. I was delighted to find another Sichuan restaurant in Pittsburgh, so I went here with a group of friends to check it out. We ordered a bunch of traditional Chinese dishes, such as Chongqing spicy chicken, Mao's pork belly, dandan noodles, shredded pork with beancurd, watercress, and shui zhu niu ().   The taste of the food was a solid 3.5/5. It's  authentic for the most part, albeit a tad too sweet for me. I would give it a 4 because I liked the experience, but unfortunately I had to dock a point, because for every single dish I ordered, I could name a different restaurant in Pittsburgh that cooks it better. Not to say that the food was bad - I definitely enjoyed it - but there are better options out there. The dishes I enjoyed the most were the shui zhu niu and chongqing spicy chicken. However, the dandan noodles were cooked in a very strange way, and the watercress was not fresh. I would stay away from those dishes in the future.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PrPAKuxN2Aw_QL60DhALKQ"
  },
  "0VfG3rSjciIu0QQZUnIJeQ": {
    "date": "1/28/2019",
    "text": "Since this location opened, I regularly order take-out delivery from Szechuan Spice. My favorites are: mapo tofu, shredded pork with bamboo shoots, hot pot with fish fillet, chinese broccoli, baby bok choy, soup with pickled vegetables and fish fillet, cucumber in scallion sauce... the list goes on. The food is delicious, but it can be a bit salty for me, so I always request reduced sodium.   The delivery service is on time and reliable even in this weather.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZpdgM5VqUmW8nyy5hFMNYw"
  },
  "MwZvIMiRjaj1Qe6cvxPpsA": {
    "date": "7/15/2019",
    "text": "This place sure has changed since I used to go here eons ago when it was called Jimmy Tsang's, anyone remember that?!?  They changed the interior and it looks bigger with more rooms for some reason.  They did a good job with the interiors.  Our waitress was nice and had a big smile on her face, which is always nice.  I like the food, but they serve some kind of strange rice that I never had before.  It is a bit stiff and tougher, which makes me not a big fan of the rice.  I did however enjoy the rest of our food, minus the fact that I kind of wish the chicken was cooked a bit more.  It was kind of a mixed bag for me on this one.  I got Kung Pao chicken and there was pluses, including that there was big chunks of ginger in there and garlic.  That was a plus, but there was sooo much chicken.  I think a lot of people would like that, but it dominated the entire plate.  I think that Kung Pao should be a mixture of the celery, peanuts, onions, garlic, chicken and whatever other vegetables are in the dish.  They give you generous portions which is also a bonus.  When it comes to Chinese food I am just very picky because there are so many crappy, below average and mediocre Chinese restaraunts, but not one that stands out as extremely good.  Oh well, maybe one day I will find one.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v1L-ehinZ9ZXhwmdm4S_Lw"
  },
  "TtD4k9CthDKm_lMaa747VA": {
    "date": "8/24/2017",
    "text": "This new joint in Shadyside is definitely one to check out! They have a full authentic Chinese menu as well as an American Chinese menu and sushi! It was so fresh and flavorful and the service was very quick and extremely friendly.  I'm updating my review because now that I love this place so much I can't stay away, I've tried many more things.   I'm a HUGE fan of the 1/2 off sushi on Wednesday night deal! My typical order is edamame and a roll of choice (I love their rainbow roll and anything with the word tempura - obviously.)  The sesame chicken is as consistent as ever and is always ordered by my companion.   Service is immensely friendly and quick. Please give this place some love, they deserve it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zSiTayUYdPPO_euqfSF-sQ",
        "caption": "Photo of Szechuan Spice - Pittsburgh, PA, United States. Rainbow Roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zSiTayUYdPPO_euqfSF-sQ/o.jpg"
      }
    ],
    "user_id": "LaiylSIbrA3aPvOYtl-J4A"
  }
}