{
  "af7012lQ8RZanHfByvWxmA": {
    "date": "7/12/2010",
    "text": "A great Indian option downtown. Their lunch buffet it good and cheap I think it only came to $10.00. I've been there on a weekend after going to Heinz Hall for a concert, and the service was very good.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "eiiS0rrIN6orvf4PmsKe-Q"
  },
  "ExgmpAQgFBFsnh9VSrVzFA": {
    "date": "5/12/2013",
    "text": "We came here for lunch while attending a week-long conference nearby. The service prices and food were all very good. We had the buffet, which I normally avoid, but we were in a rush.Everything seemed fresh, but nothing to rave about. Your standard, Indian buffet, and it was fine for a quick lunch time visit. I'd go back if in the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K0dIYy0b-QU9BQUnSbzyZw"
  },
  "aVYvBaoASScx9nsBuCOBnw": {
    "date": "2/15/2013",
    "text": "Went here during a business trip at around 9:30PM. It wasn't my first choice, but most other spots were closed or incredibly over priced (What the heck Pittsburgh?). Not many people were inside and somebody was doing homework. Figured it was a family run restaurant. Decor was average for your run of the mill Indian restaurant. I was given a glass of cold water and nothing else. I expected to receive some chutney, but was never ordered with any. I thought that was a standard, but I guess I was wrong? I ordered the Garlic Naan and the Chicken Saag after looking through their menu, which was pretty standard. They had the usual chicken, fish, shrimp, and vegetarian options with the standard Indian cuisine styles. Sadly, nothing really jumped out at me. My food came out rather slowly considering the emptiness of the place. The Saag had a darker tint to it than I was normally served; it was overcooked a bit. It did have a good spicy kick to it which I did enjoy. The naan wasn't too salty and I could really taste the garlic which I enjoyed as well. Overall, I wasn't crazy about the place and also not raving about it either. It gets an average rating for standard Indian food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U-b2kyEdgdD2OfPP0DYAMA"
  },
  "AFIAoLSfwA6LZ7THN_wEYQ": {
    "date": "7/21/2010",
    "text": "Very little selection on the lunch buffet, and $10 is twice the price of Sree's on Smithfield, which has about the same amount of variety.  Just was disappointed, as friends claimed this was the place to go.  Taste of India in Bloomfield or India Garden in Oakland still win the buffet war.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BWFF5dX7oE5F-IB8hc36Kg"
  },
  "JopT021ItliWhWMfOLLL_w": {
    "date": "6/18/2010",
    "text": "Rating upgrade. I eat here often and the quality of the food has seemed to improved over the last few months. Also, there is usually good variety but there is either Tikka Masala or Makhani every time I have been there.  To top things off, now that Indian Palace (thumbs down) has opened up two doors down and undercut their prices, Indian Spices has responded by lowering their prices and is now cheaper! Yay!  Before I was still pondering whether the 40 cents difference was worth it, and might have still eaten there occasionally to check for improvements in food quality. But the decision is easy now!  Free markets, baby!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5UDVAuh_gJcjWw5M4-xsbw"
  },
  "6R62ih5zRz42KGPdfap4jw": {
    "date": "11/9/2013",
    "text": "Nice find in downtown Pittsburgh while visiting from California to see the fam. Good and polite service---enjoying the buffet on a slow Saturday afternoon...the service earns the 5 stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h5FbiGxMYF4mTZupNpvmUw"
  },
  "RHhx6sailxS_nXeH02RauQ": {
    "date": "5/15/2011",
    "text": "Came here for dinner and overall, the food was good and service was excellent.  Ordered the Lamb Vindaloo at a spice level of 10 and not that spicy.  Spice levels apparently go up to 15.  The samosas were good but a little too dense.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wAqq5aYnHmtuDMKw8UK5Eg"
  },
  "vhx69PZbT3emf5LhxA34ag": {
    "date": "8/20/2011",
    "text": "My favorite lunch spot downtown.  My husand and I meet here frequently for the lunch buffet and, including tax and tip, get out of there for $20 even.  Their chicken tikka massala is wonderful.  Other favorites from the buffet:  chicken tari, chicken saag, aloo gobhi, channa masala, and gulab jamun.  I probably need intervetion at this point for as much as I go there.  Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y81808aeGu5YuZSaDiFC8A"
  },
  "ehbe0uvci6EmgX4aX-09hw": {
    "date": "1/11/2011",
    "text": "Great place for lunch, although the buffet selection is quite small, every item is very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jbLRWTg2MvMuwWdiS4NgDw"
  },
  "gb0KxR3r-t0x6NCQSXY8jg": {
    "date": "1/15/2011",
    "text": "Excellent nan and curry pekora. Polite, attentive staff -- and we were able to make it out with plenty of time for the 8:00 show.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_U02-cTyIlejKYVAejlQlQ"
  },
  "fAfA6RIF_q9qM5_sH6-3Xg": {
    "date": "1/4/2010",
    "text": "Price went up recently to $10 + tip.  Suddenly expensive for downtown.  The food is still good, but it's now a special stop and off the weekly rotation.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-dV2GaHNJHhDYbrmu48ZDQ"
  },
  "y6DNXuys1HCWjNKPSA-mJA": {
    "date": "1/26/2009",
    "text": "Indian Spices is a fairly new addition to the Cultural District dining scene.  It's nice to have a good-tasting Indian option Downtown, and it's also nice to see a relatively inexpensive restaurant open here (expect to pay $7.50 - $14 for a dinner entree, or $7.50 for the lunch buffet.)  Unfortunately, the atmosphere in the restaurant isn't as nice as I had hoped.  Good points first:  We really enjoyed most of the dishes we had here.  Pappadums were warm and crispy, with some sort of spicy seed baked into them (unlike the plain pappadums you get at a lot of restaurants here).  Both the mint sauce and the onion relish were very nice.  For our entrees, we both ordered dishes marked as \"chef's specialties.\"  I ordered a vegetarian entree with paneer and okra, which was perfectly-cooked:  the paneer and okra had been sauteed with onions until both paneer and okra were slightly browned, but not overdone.  This let the okra keep its flavor without getting the sliminess that okra can have.  My husband ordered lamb pasanda, which turns out to be lamb in a sweet and spicy creamy sauce, with cashews and raisins in it.  This was one of the most delicious lamb dishes either of us has had in a very long time.  The garlic naan was good too; the garlic was cut in rough slivers and baked with the naan so that it had a roasted taste.  The bad parts of our meal:  Samosas were not good: the outermost part looked and felt promisingly crispy/flaky, but the crust turned out to be a little bit gummy/chewy on the inside, which I do not like.  Additionally, the potato and pea filling was distressingly homogenous and not very well spiced.  But the accompanying tamarind sauce was excellent.    (Maybe samosa chat would be better?)  The restaurant itself is kind of cold in temperature and austere in appearance:  the walls are all painted varying shades of grayish-purple, which I find oppressive, and the occasional small, kitschy wall hanging does nothing to relieve the overall foreboding aspect of the dining room.    Worst of all, the service was not good.  Our waitress acted as if the presence of diners in her dining room was the only obstacle preventing her from attaining enlightenment.  She was not very good at answering questions.  When we asked what onion bhajiya (another specialty) was, she replied \"onion rings.\"  Upon looking it up later, I discovered that they are not onion rings.  They are actually basically onion pakoras.  Furthermore, she wasn't particularly attentive, and when we asked about dessert options, she gave us a disapproving look (me in particular) and said \"Dessert?!\" as if we should be ashamed to even consider eating more food in a restaurant.  All in all, we will probably come back here, since so much of the food was good, and that lamb pasanda was REALLY good.  We will also probably stick mainly to the chef's specialty items, and we might order take-out next time!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9wrRmTxl2g4RcPtUwcgb-w"
  },
  "1dsXe4bFs3cKhs3DshqnIg": {
    "date": "6/19/2012",
    "text": "Mediocre at best. I had my favorite Indian dish Aloo Gobi and it was nothing to what I usually experience at other Indian Restaurants all over the Country. I was bummed. Only good thing was that it was right next to the hotel I stayed at.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cphUBnI-bUk36NwbgiiWUg"
  },
  "tyugwQmfYz90zhUEelgc2g": {
    "date": "7/1/2009",
    "text": "I loved the food here. The ambiance is pretty bleh- I was there on a Monday evening and it was pretty much deserted. The only other people next to us were a few cops who were far from experienced. They asked for garlic bread instead of naan, and were kind of rude and insistent that certain dishes they wanted from some Indian restaurant were not on the menu even though they ended up being on the menu and they were just being a little dense. Anyways I got the whole shebang... A mango lassi, appetizer of vegetable samosa, paneer naan (one of their specialties) and vegetable briyani (spiced at a 10 out of 20...I thought it was cute that they asked to say how spicy out of 20..) The amazing thing was that for all of that it came to less than 20 dollars...that doesn't happen in Boston- the briyani alone woulda been 15. And by the way it was wonderful- the golden raisins, nuts, spices and basmati rice were all in perfect harmony :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "e3Y0XbIl_y4zZeR8xrjGZA"
  },
  "Dkjsos00Xi9H9yrriNpX8g": {
    "date": "7/16/2017",
    "text": "I stop in here for lunch every couple of weeks at least.  As far as Indian food downtown this place is the best in my opinion.  The Tikka Masala for me has a perfect balance of tomato and cream with spice.  The staff is friendly and it is a great way to eat too much at lunch; even on the days when you promise yourself you will not they provide too many delicious options.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fDbgMKYRfYf30WxpvevITQ"
  },
  "kaVqV_tlwiuHCOtbNQXAlg": {
    "date": "9/17/2014",
    "text": "I went for the lunch buffet during the week and went a bit early (around 11:30) to find the buffet freshly stocked.  I'm not a huge fan of buffets since they can get kinda gross after people have ransacked it a few times so if I can get to a buffet before the crowd, I prefer to do so.    The buffet and food was on par with the other India restaurant buffets I've tried. I wasn't overly impressed or overly disappointed.  The chicken tikka was very creamy as per the standard at these places.  A little goes a long way.  They had a vegetable korma dish wish I really enjoyed.  The rice was a bit burned and I wish they had more vegetable dishes but it was either that vegetable korma, spinach/lentils (which were bland) or potatoes - which I didn't feel like loading up on.    I was somewhat disappointed that they didn't offer pakoras or samosas since they had all the fixins for them (brown/green chutneys).  They did offer sweet rice pudding and carrot type hulva (sweet).    Price was $9 inclusive of tax which I found reasonable.  The place started to get crowded around noon so I would recommend coming earlier if you can.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NnrCwpS1i5mZtkGGzmIk0g"
  },
  "xmg_prFazVhbunHG055c5w": {
    "date": "6/20/2009",
    "text": "Had dinner here one evening. I was the only person in the place when I walked in - which worried me a bit - but I had checked Yelp - and then a large party of six people arrived.  I ordered the Lamb Curry - at the hottest level, along with Garlic Naan and Riata. plus a glass of water.  Food came out in about 12 minutes or so. I must say the lamb was totally succulent. Almost melted in your mouth - very lean, no fat or gristle which is always a plus.  The execution of the dish was another matter. It was pretty damn hot - but the curry flavors were overwhelmed by the heat. Some of my fave go-to Indian places back here in Virginia are really good at balancing extreme heat with flavor. Made me wonder if they took some left overs from the lunch buffet - re-heated them up - and then addedf some additional fire to the dish? Might account for the imbalance between heat and flavor. I'll never know for sure.  The garlic Naan was tasty - bread was a nice crispy, flaky consistency - and very garlic-y - you could smell it. Also liked the Riata - it had a nice thick consistency to it. I am not a fan of thin, runny Riata.  Service was good and attentive.  I'd give this place another shot the next time I am in the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "0XPk0Nvq6jfa0SIBuVQWHw",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0XPk0Nvq6jfa0SIBuVQWHw/o.jpg"
      },
      {
        "img_id": "XFgXVvBKkSi0x_DNtfG-4A",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XFgXVvBKkSi0x_DNtfG-4A/o.jpg"
      },
      {
        "img_id": "oE3vEa8Utfv9ummQWK8x0w",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oE3vEa8Utfv9ummQWK8x0w/o.jpg"
      }
    ],
    "user_id": "XYSDrIef7g4Gmp3lNFVO6A"
  },
  "SRs5accVCy2QrFXJt68Zmw": {
    "date": "4/12/2014",
    "text": "The lunch buffet is super delicious and only $9 (including tax). There is another indian restaurant a few doors down but that place is nothing compared to Indian Spices. They have the best chicken Tikka Masala and kir.  I love coming here and I am sad that they dont deliver.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7qhwRcvDPWD1jplSHLwCTA",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7qhwRcvDPWD1jplSHLwCTA/o.jpg"
      }
    ],
    "user_id": "l-CyNDYEix3G7YyUVkALwQ"
  },
  "9vWZ77w3IKiHpkqU8DYkZw": {
    "date": "3/21/2016",
    "text": "If you are looking for ambience and a romantic upscale dining experience, you might want to look elsewhere.  Very basic decor, function and purpose.  If you are looking for a solid lunch with a good Indian flavor, give it a try.  I think you will not be disappointed.  I ordered the Paneer Makni with Rice and regular Naan.  Big chunks of paneer in the butter masala with the addition of peas.  I could not finish what was brought to me.  Good food. Motto much to finish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s29gtrAMV1E2_etUGOjieA"
  },
  "1EH3cI7r5Et8Ibo0Z0xR_w": {
    "date": "6/4/2013",
    "text": "I went here with a few friends right after watching a Pirates game at PNC Park. The first restaurant we walked into was a really basic Italian place, and there wasn't a place to sit (it was packed), so we decided to walk a little farther down and try another place.   We walked into Indian Spices and there was absolutely no one there, which was very surprising because so many people were going straight from the game to get something to eat.  We were kind of happy to have the place to ourselves though, so we figured we would give it a shot.  There were people cleaning the windows outside, which may have been a deterrent, plus they didn't serve beer, which would account for a lot of people going elsewhere.  Our server was Indian (which was a good sign).  He was friendly and the food was served promptly (which we expected as we were the only ones there).  The prices were very fair, and the food was great.  I got Chicken Vegetable, with a spiciness level of 12 (out of 15), and I loved it.  My friends got mango ice cream and a shrimp dish, and they were also very satisfied.    The environment was a little plain/generic, and the bathroom was tiny and not the cleanest.  If it weren't for those factors, I probably would have given the place 5 stars.  Regardless, it was a great value for the money.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZgVbX_KbE9EltOvPtjNlxQ"
  },
  "xjYKJFkVhrHXqGoc11MUBQ": {
    "date": "3/9/2016",
    "text": "Worst food experienced, tomato soup is thick cream and sour in taste coming to biryani it was tastelessness, bad taste but mango lassi was awesome.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ruAroHo1EL7yrPRtb5jaCQ"
  },
  "IZyEtjOFseDBLOuRB6UPIw": {
    "date": "9/22/2011",
    "text": "Lunch buffet with a small selection of usual suspects for $9 (not including drink).  Overall the flavors here are decent, but they are a bit toned down for american pallets.  On my visit they had a selection of  veggie curies pakora, rice and naan. The curries were fine nothing great the Gobi one was the best. The pakora seemed a bit soggy and the naan was scarce.   If you are hungry or in a rush is a great choice as you pay at the end and it is self service and all you can eat, if you want great inidan flavor I am sure you can find better. At $9 it is a decent price for a lunch buffet in a Urban area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gScmsSCqBeFPp6q9yG5nmw"
  },
  "lC7mZ1RtOqDDUmbQRo0wnQ": {
    "date": "10/28/2014",
    "text": "Indian Spices is a great place to try unique, ethnic food at an affordable, low price. I ordered the fresh bread: Kaabli naan, which was a delicious sweet pastry like bread filled with sugar, coconut, nuts and raisins & Panner naan, which was a bread filled with cottage cheese and herbs. I thought the cottage cheese would be a dominant taste, but it wasn't at all. It was very subtle and I could barely taste it, though it was wonderful. The bread is flaky and flat and has a very unique taste worth trying! The prices are absolutely wonderful! You get 4 large triangles of bread for $3.99. I also ordered the coconut soup ($3), which was very good. It had pieces of coconut, raisins, and nuts in a milky coconut broth. It was probably the first sweet soup I have ever tasted. We also ordered the Chicken korma ($9.5), which was served with a big plate of basmati rice. The rice is wonderful all by itself, without sauces or meat. The chicken korma was said to be a coconut based dish, but the dish had a richer taste of curry and less of a coconut taste. It was good, though I probably wouldn't order it again. The server asked if I wanted it mild or medium. I ordered it medium and it was pretty hot. I enjoyed it, just drank a lot of water, which the waitress was wonderful at refilling. The waitress wasn't the friendliest and didn't help us newcomers with the menu much, but she refilled my waters and checked on our table frequently. The diet coke was served in a can and you poured it into your glass of ice, which I'm never a big fan of, but it was also only $2. I'm not sure if the drinks were refillable or not.The ambiance wasn't really there and as soon as you walked in there was an odd odor. Perhaps table cleaner/rags? It is hard to explain but it has happened at other restaurants and always turns me off a bit. The bathroom was not the greatest and is squished by entryway to the kitchen.  I would definitely try this place again because of the food and their prices, but hope that they can dress up the place a bit in the future and make the interior match the quality of the food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "_or2G_gJtPjh3sqlANstuw",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Part of the menu!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_or2G_gJtPjh3sqlANstuw/o.jpg"
      },
      {
        "img_id": "a0M1ygzXXSnD_lSGQxs5Sg",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Inside the restaurant!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a0M1ygzXXSnD_lSGQxs5Sg/o.jpg"
      }
    ],
    "user_id": "13URNpJQPWwXehKYaEvLkA"
  },
  "0-Y3bIPmu7m6eor6roBwHw": {
    "date": "7/31/2013",
    "text": "Stopped here for dinner on the 4th of July. The place was pretty empty and there were more tables waiting to be bussed than had people in them. Not a good sign, but the one woman working the front was pleasant enough even though she seemed to be responsible for everything.  We ordered the samosa appetizer to start and plain naan, saag paneer, and a curry dish with pakora for dinner. There were two samosas in the $3.50 order and they were big. They weren't very flavorful though. Just big blobs of potato and peas (mostly potato) in a not-so-crispy crust. The tamarind chutney that they were served with was tasty & rescued the boringness of the samosas somewhat.  The naan was naan, nothing exciting to report there. Neither of us were terribly pleased with our main dishes though. I ordered mine medium and the saag was ordered hot. Neither dish was much more than mildly spiced. Both were boring. The bright spot was the paneer in the saag, which had been fried. That was an interesting treat & something we'd never seen before in the dish. Too bad the rest of the dish was so dull.  The server was friendly and prompt and by the time we left there were more tables with diners than tables waiting to be bussed, but only because more people arrived. The tables covered in dirty dishes never did get cleaned up. I won't go back.  Also, the place is BYOB. A nice touch, but no fun if you don't know in advance.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kXTtha5cufwobFQDnEIqsg"
  },
  "41wlGn1PLgxhET_U63KjDQ": {
    "date": "2/7/2016",
    "text": "Indian Spices is my go-to place for Indian Food in Pittsburgh. Each of the 5 or 6 times I have gone there in the last three years, the food was delicious. You can set the spice level for what you order on a scale of 15, and it is not an Americanized scale. Higher numbers are quite spicy.  The prices are reasonable and the atmosphere is casual. The servers are fairly attentive and polite.  Excellent and authentic overall.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SO-D1ztna_3cbWhvg6U7kw"
  },
  "J18hdawciCSxCnI02TB_sQ": {
    "date": "3/6/2015",
    "text": "By far the worst plate of food I've ever eaten....and I have eaten at a thousand Army chow halls!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gt7sSDjg_dCjem-D8cYnQw"
  },
  "0cYB3334Va0HW2dP9IQNdA": {
    "date": "1/6/2016",
    "text": "Great food and prices!!!!!!!!!!!!!! LOVE the Chicken Korma! Tried it other places and theirs is the best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G5-dXg4PEZBSRVURwLQVuQ"
  },
  "Ihz06IGTsrcQGI7knoII_g": {
    "date": "4/3/2015",
    "text": "Great Indian food.  Nothing gourmet, service is spotty, however the prices are great.  The menu is huge.  This is a BYOB place.  I was there for dinner.  All meals come with delicious, flavorful rice that I could eat by itself.  Yellow curry was good.  Chicken vindaloo was very saucy, but tasty.  Not crowded for dinner and such a good value for sixth avenue.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SYxZMSwr9m-_xAqIFdihTg"
  },
  "Gq0SSUpKiRFKsQoT-ko7Vg": {
    "date": "3/9/2015",
    "text": "I came here for dinner with my boyfriend last weekend before going to the Warhol for a concert. It was pretty empty for dinnertime--only one other party was seated.  Service was a little slow; after we asked for a couple more minutes with the menu, we were left waiting for a while before the waiter returned to take our order. He was just sitting behind the counter on his phone. After our food was brought to us, he told us to \"just ask\" if we wanted more rice, but he was behind the counter until he came to refill our water as we were finishing up the meal. The food was good but not really outstanding. It was less expensive than some places in Oakland, but the portions were smaller as well (though more manageable).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Figs8mO8s_aPRq2W7W0cYQ"
  },
  "y6ti1Y0g1APaEf6gjBPo0w": {
    "date": "6/17/2015",
    "text": "Staff is very friendly. I recommend the lunch buffet it's a solid value and the dishes rotate so you can try something new each time. You can even get the lunch buffet to go with fresh naan if you are in a hurry. If you are sensitive to spice, it can sneak up on you here, but I've always enjoyed it. This place does the little things right from the subtle seasoning in the rice to the standard dishes like chicken tikka masala.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HeQiWSGQtgxMbyhWMKaLSA"
  },
  "tWd_gIbtId_5PiKSIURF-A": {
    "date": "5/25/2015",
    "text": "Best food ever . Had a family dinner and so satisfied with service and taste of food. Best thing is they can make mild hot or extra hot exact proportions . No words !! Just give a try and you will be writing review like me",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xs7AC8THrkf21mrQDo98lw"
  },
  "HZVTU9sNNQFGP55PDhuDVg": {
    "date": "1/9/2014",
    "text": "Indian Spices has the best chicken Tikka Masala and Chana saag that I've tasted anywhere, hands down.  I drive from the North Hills for take out at least a few times a month and often before performances in the cultural district.  They're also very good at understanding time constraints you may have and will tell you up front if they can serve you before a show.  If you're a tikka masala fan, give them a try, you might get spoiled.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kNL8dAgZWottbvoSPMwcew"
  },
  "lDqydgLexOrpD4Ec5r94sQ": {
    "date": "4/1/2014",
    "text": "Have eaten here two times. Once we ate in and the other time carry out. Both times the food was fantastic. Perfectly spicy and saucy. Only minor complaint is I wish there was more chicken in the main dishes. The chicken biryani was delicious. Naan was toasty, crisp and perfect. Can't wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qv6cJ0LG386iuwlplBHiyA"
  },
  "HpcAivja8skHzA4u2LlpEw": {
    "date": "5/1/2014",
    "text": "Vegetable jalfrezi was very good.  The vegetables seemed fresh.  I asked for medium spice, and it was just right.  Not too much to become overwhelming.   The only reason they're not getting 5 stars is because the garlic on the garlic naan tasted like it came out of a jar.  Otherwise, a tasty and affordable dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QdCfc7oNG2R2nphp3_S_1Q"
  },
  "XjbpEKfHWm2MDCwJ8RRCRQ": {
    "date": "4/28/2015",
    "text": "Lunch at Indian Spices on Sixth Ave was a delight today. I walked in, got seated immediately, was given a large glass of water and was asked if I'd like to order off of the menu or partake in the buffet. The buffet sounded good to me so without any wait I took a plate off of the table and helped myself to a little of everything.   If you like flavor in you food you're going to like Indian Spices. Everything had some zest to it without being overly so. My favorite item on the buffet was the Chicken Tari. It contained large, very moist chunks of chicken in a curry like sauce that held a piquancy without being too bold.   I'm no connoisseur when it comes to Middle Eastern food but my only disappointment from the buffet was the Tandoori Chicken. It was a bit dry and not offering as much flavor as the other dishes and that's a shame since it's usually the main attraction for most westerners who come through the door of an Indian restaurant.   One thing that I notice that I was impressed with is that there was only one person working the dining area. She was the sole person greeting customers, ensuring everyone's drink was okay, busing tables, and working the cash register and she made it look easy.  A lesser experienced person may have gotten overwhelmed but she seemed to have a system, remained very pleasant and nothing seemed to faze her.   My check came to exactly $9.00 plus tip... quite a bargain for an \"all you can eat\" buffet of quality food in a nice atmosphere. The slight dryness of the Tandoori keeps me from rating this with five stars but I wouldn't let that deter you from stopping in and enjoying a good Middle Eastern buffet at Indian Spices.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "jFIt6hy-dWpjIz9fqVhwgg",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Interior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jFIt6hy-dWpjIz9fqVhwgg/o.jpg"
      },
      {
        "img_id": "yLsx8qwbOtm5xru3gJymlg",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. A little of everything from the buffet",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yLsx8qwbOtm5xru3gJymlg/o.jpg"
      },
      {
        "img_id": "oLJ97D44UKxSCSoLupDmcg",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Buffet",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oLJ97D44UKxSCSoLupDmcg/o.jpg"
      }
    ],
    "user_id": "cUqU7UfSaamDg0L5TIJPRg"
  },
  "RtWcXW8cOxkGiTa7BxYo-g": {
    "date": "3/15/2015",
    "text": "I discovered Indian Spices a few years ago when I was downtown for Light Up Night. All of the restaurants in the area were incredibly crowded, but we stumbled upon this one that somehow wasn't busy. Usually not being busy isn't a good sign, but in this case popularity doesn't seem to correlate with quality. I have no idea why this place isn't busier, but I won't complain -- I think there could be a Pirates game, Steelers game, sold out shows at every theater, a parade, and the arts festival all going on downtown simultaneously and I'm pretty sure I'd still be able to walk right in and get a table here. So now this is my go-to place when I'm in the area for a show or a game.  The ambiance isn't particularly inviting -- it's very sterile and hole-in-the-wall. They have a large selection of typical dishes that you'd expect to find at an Indian restaurant. I've sampled quite of few of their popular meat dishes (tikka masala, vindaloo, etc.), all of which are good, although not the best I've had in town. Where I think Indian Spices really knocks it out of the park is with their vegetarian offerings. In particular, their Aloo Ghobi and Malai Kafta are crazy delicious. The Aloo Ghobi has fresh chunks of cauliflower, potatoes, and onions tossed with cilantro and curry spices. It's super flavorful and has quite a kick -- love it when food makes me sweat!  :) They definitely live up to the name \"Indian Spices,\" so be sure to order low on the spicy scale if you don't like heat. The Malai Kafta consists of fried veggie balls (peas, carrots, onions, potatoes, paneer cheese, and probably more) swimming in a warmly-spiced tomato sauce. The veggie balls are just bursting with flavor and have a texture that is slightly crispy on the outside but soft on the inside. The Malai Kafta sauce is wonderfully complex -- spicy, sweet, coconutty, creamy -- with raisins and sliced almonds mixed in to add a nice textural variety. Absolutely delicious. If I had to pick just one Indian meal to eat for the rest of my life, the Malai Kafta from Indian Spices would definitely be a strong contender.  Portion sizes here are generous (if you run out of rice they will happily bring you more), and the prices are more than reasonable, especially considering the location. My hubby and I can each get a meal and share some naan and barely crack 20 bucks. Such an excellent value. Service is usually attentive and the food comes out in a reasonable amount of time. Overall, I'd recommend giving this unassuming little restaurant a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Egrp21cvYMcZ0ES1Q87IrA",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Garlic naan",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Egrp21cvYMcZ0ES1Q87IrA/o.jpg"
      },
      {
        "img_id": "sCzuDniV7PJGJLxpvRZfug",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Malai Kafta. Fried veggie balls in a delicious sauce that I could drink by the gallon!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sCzuDniV7PJGJLxpvRZfug/o.jpg"
      },
      {
        "img_id": "Vqufjl62aUrm7XKppNzR2A",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Aloo Ghobi. Delicious chunks of cauliflower, potato, and onion tossed with cilantro and other spices.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Vqufjl62aUrm7XKppNzR2A/o.jpg"
      }
    ],
    "user_id": "0EhPIlDozxGKpbbHRr6vZg"
  },
  "HHI-XRdk5XGTAFzwfoJ8QQ": {
    "date": "12/14/2014",
    "text": "I stopped by with my friend on Fri. night for dinner before seeing The Nutcracker at the Benedum.  Between the convenient location in the Cultural District, the good reviews from other Yelpers, and the reasonable prices, this place seemed like a potential winner.  Unfortunately, however, the food and atmosphere left something to be desired.  The a la carte dinner menu is pretty extensive, and includes most of the usual dishes offered at Indian restaurants.  Because I'd tried samples of chicken makhni (butter chicken) from friends at another Indian restaurant in Oakland and really liked it, but had never ordered it myself before, I decided to order it.  Bad move!  The sauce was less creamy than that served with the dish at the other restaurant (see photo), and the chicken was of poor quality--all dark meat, with several pieces of gristle that I had to pull out of my mouth while eating (as discreetly as possible, of course, to avoid grossing out my friend).  This version of the dish was disappointing, to the point that I only ate a bit more than half of it before abandoning the rest.  In addition to my entree, I ordered a mango lassi, as I usually do at Indian restaurants.  Even this was a disappointment, given its thinness in comparison to versions I've had at other Indian restaurants around town.  My friend ordered the malai kofta, a vegetarian dish consisting of potato balls stuffed with paneer and vegetables in a light cream sauce with nuts and raisins.  She let me try a bite or two, and it tasted much better than my chicken makhni.  If I'd ordered this dish, I probably would have finished it and left with a much better assessment of the food than I did.  Indeed, my friend did so, and expressed satisfaction with its quality.  Aside from the quality of the food, I was rather unimpressed with the ambiance, which I'd describe as a notch below no frills.  There was no music, the wall decorations were pretty sparse, and the tables were unadorned except for menus under the glass tops.  Moreover, the place had a slight aura of griminess that was apparent from the odd odor that I encountered upon entering.  Service was okay, and the food came was served in a reasonable timeframe, so I have no major complaints there.  Overall, I've had better Indian food in superior settings at other places around town, so I probably won't return.  It seems as though most people come here for the lunch buffet, so it's possible that the quality is better than their a la carte cooking.  If you do order a la carte, I'd recommend sticking to the chef's specialties (the malai kofta was one of them), and avoiding the chicken makhni, for sure.  If I went solely by my own experience, my rating would be a 2, but my friend seemed pretty pleased, so I'm averaging to a 3 to better reflect our combined judgment.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 13,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "1-UqBnZztSS_3OM26d8ekQ",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Entrees and rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1-UqBnZztSS_3OM26d8ekQ/o.jpg"
      },
      {
        "img_id": "YfvCHJKCMcu8ez4mTrleDQ",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Malai kofta--not bad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YfvCHJKCMcu8ez4mTrleDQ/o.jpg"
      },
      {
        "img_id": "30cUUCGVbzwlzS9kHzOMcA",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Chicken makhni (butter chicken)--disappointing",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/30cUUCGVbzwlzS9kHzOMcA/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "3yUrm2VHqRiEMLpRGW2TsA": {
    "date": "8/1/2017",
    "text": "My SO and I go to a lot of events and the Benedum and Heinz hall, usually on Sunday evenings. Finding a restaurant open Sunday evening, especially one with vegetarian options, really limits our options. Indian Spices is our go-to restaurant before we head to an event. Sunday evenings, the restaurant is never crowded. We're able to enjoy our meal in a nice atmosphere, then head out to whatever show we are going to see.  Anytime we've been there, its always been the same gentlemen who has served us and he's always been very polite. I've gotten a wide variety of dishes and have always been happy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "myKVt2Hf-FhuEBuLMDztbA"
  },
  "acE7H_UXqyF72u_Wx8uRUw": {
    "date": "10/24/2017",
    "text": "This place used to be my go-to because it was conveniently located, tasty, and reasonably priced. I haven't been there in over a year but I stopped recently for takeout. While it want bad it definitely wasn't as good as I'd expected or remembered. It seemed like the food was old and just scraped up from the buffet display. Pretty disappointed and likely won't come back since there are other Indian places I enjoy more now.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wWPhIUD6Xdd2WD6JCUPntA"
  },
  "wg0a0HDGnfPcIVDexdElew": {
    "date": "5/14/2018",
    "text": "Please name your biriyani as bine biriyani. 2 times in a row, all I got are bones and no meat. Terribly disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vT4OdaX6z4tABM9sNZg35g"
  },
  "_7viz1NS8rYgtEXqMiHQoQ": {
    "date": "10/9/2014",
    "text": "The food here is amazing, and the prices are very reasonable, especially for Downtown.  If you haven't tried their coconut soup, it's rather unique and delicious.  This is one of my go-to spots for dining Downtown.  Their service is fast and you can't beat their location.  It's a family business and the wait staff are very friendly, funny, and incredibly nice.  Their naan is excellent and authentic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "x1yMUbgesai-9m9_2fRITA": {
    "date": "3/19/2017",
    "text": "Visited Pittsburg and found it to be a very nice place ! this restaurant has decent interiors. The food however, had no taste or life in it. We ordered paneer jalfrazi and navratan and bread, the items came with zeera rice. None of the items impressed us. By far, I have to place this restaurant at the bottom of all the Indian restaurants I have visited (visited only this in pittsburg). I have had a good service experience though, but it's simply time to hire a new chef. Also forgot to mention the discomfort next morning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OzPDqQeO0wsJ6Q3BzenSYA"
  },
  "31ugyHeSeSnSdIzwPfWgDA": {
    "date": "4/14/2016",
    "text": "Came here for lunch on a Tuesday.  It was decently packed at noon, but we were still immediately greeted and seated.  However, then the guy never came back.  Since this was our first time here, we didn't realize that you could only get the buffet - there are menus under glass on the table.  After watching a few others come in and go up to the buffet, we followed their lead.   It's a nice combination of meat and vegetable dishes.  The salad left a bit to be desired.  I would have liked a drink, but I guess they don't have any drinks besides water.  There was a nice level of spice on everything - not too spicy, not too bland.  Everything had a distinct flavor.  I would definitely go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2JjI8DCyrpabtg36iL5lrw"
  },
  "2yMKJgzaRgVRY8FeSaE34w": {
    "date": "8/12/2014",
    "text": "Great (and cheap) lunch buffet! Really good chicken tikka masala and kir! Friendly service too. Don't get scared if the place is empty, the food is delicious!! Can't wait to go back here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "I5wuY3mOIVJXFYXUDVaPWA",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I5wuY3mOIVJXFYXUDVaPWA/o.jpg"
      },
      {
        "img_id": "VFFNYadTL2Qz3u3_wdM1Ew",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VFFNYadTL2Qz3u3_wdM1Ew/o.jpg"
      },
      {
        "img_id": "-2-O8ZGoezJgzSnIweeHKw",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-2-O8ZGoezJgzSnIweeHKw/o.jpg"
      }
    ],
    "user_id": "5CUYH4Su0F1kyJq_bd7akQ"
  },
  "A2jamvNUvW6Ky3ycb2dm7g": {
    "date": "8/28/2014",
    "text": "I chose Indian Spices over the other Indian restaurant a few doors down at the advice of an Indian coworker.  His advice was spot on.  I visited for the lunch buffet.  It was affordably priced and everything was very tasty.  I enjoyed that everything was clearly labeled so you know what you are eating.  There are three sections to the buffet.  The hot section that has all your entree choices, rice and naan.  The cold secion that had salads and sauces and the dessert section that featured a few choices, most notably rice pudding.  Even though it was a buffet, everything tasted fresh.    Service and atmosphere are the reasons I didn't give this five stars.  They were busy, but the server had a bit of an attitude.  She seemed a bit put off by the fact that I wanted a refill on my water.  The layout is also strange.  There is a large front room, a hallway, another dining room and the back room with the buffet.  I was seated in the hallway area and it was kind of awkward with so many people walking past.  I'll be back to try the regular menu and will also do the buffet again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VTEyUzzH92X3w-IpGaXVA"
  },
  "c5tbwt8O-ygOsnPDJmlwNg": {
    "date": "8/26/2013",
    "text": "Awesome! From the naan to the chicken tikka masala from the buffet, it was great! First time eating at an Indian restaurant, so I cannot compare.   Will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v7dr34OUk6o8urbVaC6FCg",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Buffet!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v7dr34OUk6o8urbVaC6FCg/o.jpg"
      }
    ],
    "user_id": "ueY3vHSY0qqKtIHjmjnvmA"
  },
  "U0mnChmvUstQBxyPGM1PrQ": {
    "date": "1/10/2018",
    "text": "This is the BEST Indian food in Pittsburgh. My girlfriend and I order from here almost every week. Wonderful service & even better food. We've had a lot of dishes, veggie and meat, and none of them disappoint. I have tried many other places in the city (Indian is our fav) but nothing compares to Indian Spices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HAp_8GJaZUMhG8SqkZadlQ"
  },
  "jKQuLurFASvTqgroJf-PMw": {
    "date": "9/27/2015",
    "text": "Owners daughter is the hostess and compared to the next door competitor (other hostess is old lady), their food is more tasty!  Reasonably priced.  Liked all non-veg dishes and Chicken Makhni is specially smooth & nice. Veg dishes like Saag-chole (spinach-chick-pea), kari-pakoda is worth mentioning.   Sometimes they have Biriyani which is nice.  But in desert they loose a star  ' * ' as  they do not feature 'Gulab Jamun' as often as they should. Instead it's always kheer, every time I went.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CiaXnTNIlhlZ_qjpqnka9g"
  },
  "PYTxRm0p98TNUGG4PxNi0g": {
    "date": "11/21/2014",
    "text": "Supremely delicious!   Went here for dinner with a friend before a show at the cabaret. It is a very unassuming looking restaurant and was not very busy. It took our waitress a little time to get over to us, but we mentioned that we had a show and she made sure to bring our food out as quickly as possible.   We got the samosas, which were huge and delicious. We also shared the chicken tikka masala and the chana masala at spice level medium. I love spicy food, but if you don't I suggest going lower on the scale because even at a medium, these dishes had some serious kick!  I loved the chicken tikka masala. So much so that I took the leftover sauce over rice home just so my hubby could try it! We also got the garlic naan and poori. Both were delicious and helped to scoop up the delicious food.   The portion sizes were also very generous for the price and my friend and I were each able to have a to go container from what was left over.   I can't wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "kXt6tPSGLWhWTiXO7XPjuA"
  },
  "Sl8ncOYaEwsbUAVVJp7NFw": {
    "date": "2/25/2015",
    "text": "Walked in for a quick early dinner and I was pleasantly surprised.  Ordered chicken tikka masala, garlic naan, and lamb vindaloo.  Even medium heat was fairly spicy, so order accordingly.  It came with a big heaping pile of jasmine rice with cumin & cardamom.  The server even asked if we wanted more rice.  But it was plenty, we couldn't stuff ourselves anymore.  The flavor was fantastic, served hot, and we inhaled it.  The garlic naan was incredible.  Crispy edges and warm fresh bread center.  It was just perfect, best naan I've had.  Very courteous, fast, attentive service.  Definitely would go again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GZ7XUpwf-kCs9zvCPAwTGQ",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Amazing jasmine rice w/ cumin seeds &amp;amp; cardamom, soooo good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GZ7XUpwf-kCs9zvCPAwTGQ/o.jpg"
      },
      {
        "img_id": "0bN4LoHdib13hiTFh5RzKQ",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Chix tikka masala, lamb vindaloo, garlic naan. YUM!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0bN4LoHdib13hiTFh5RzKQ/o.jpg"
      }
    ],
    "user_id": "k_VIPC9Wuk51MEFbG1fYLA"
  },
  "pZJexkRG7b6NPzSMcRqpvw": {
    "date": "9/4/2014",
    "text": "One of the worst Indian places I have been in the USA.. Its a joke to call this place 'Indian Spices' because of thier bland, flavourless food which doesnt do any justice to making good Indian food with good spices and flavor.. (By spices I dont necessrally mean spicy and hot, I just mean flavours). It should instead be called 'Indian Spiceless' From our experience, I can tell these guys dont know whats Indian food and how to cook it..   We ordered navaratan kurma and veg jalfrizi.. Though technically these are entirely different dishes with kurma being somewhat on the sweeter side and jalfrizi being on the tangy and spicy side..  What we got was nowhere near what we expected. Both the curries looked uninspiring and not that different at all.  Both clearly had the more or less the same well cut frozen veggies you get in super markets and more or less tasted the same..  Jalfrizi which typically has more sauce (gravy) was very dry (never seen it in any other Indian restaurant like that) and had virtually no flavour.. it seemed like some spices were tossed in here and there..  And to add to the insult, they prepared these wonderful exotic delicacies taking more than one hour to prepare when hardly there were any customers around!!   Not only do the staff seem to not know how to cook Indian food, they also dont seem to know much about whats Indian food!   My wife had ordered 'Onion Kulcha' without seeing the menu.. (For beginners Kulcha is slightly different type of Indian bread like Nan..) Actually that item was not in the menu.. thats fine.. but instead of telling us that, the staff took the order and brought us 'Onion Nan'.. when my wife complained that this is NOT kulcha but nan, then the staff tells us 'Onion kulcha is Onion Nan right??!!'..  LOL!   Actually this was not a big thing, but clearly shows that the staff (eventhough they looked like Indians) didnt know much abt Indian cuisine.. I then explained to the staff whats the difference between nan and kulcha.. then to make things more comic, we could hear them arguing inside the kitchen abt this issue.:P    Also the mango lassie was sour..  We came here seeing four star reviews, thier buffet might be good as most reviewers have opined here or most of thier guests are newbies who havent experienced real Indian food.. When we left the place, we were joking about the name 'Indian Spices' for all the flavorless food with no 'real spices' and exlaimed we could have done this food ourselves very easilyat home..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bFA92cVptkQNwRAcOA67xA"
  },
  "YQbQ8aFhlaUZFTLtM5B0PA": {
    "date": "3/9/2015",
    "text": "I seriously don't know how some Indian restaurants in the US get Butter Chicken wrong. Everyone like Butter Chicken--Indian Food lovers and non-Indian Food lovers alike.  This is one of those places who just didn't get it right.  While visiting Pittsburgh, we decided to eat here on our first night.  We ordered the butter chicken, lamb vindaloo, and lamb keema. As I said, the butter chicken did not taste like any butter chicken I had ever had before.  The sauce was very watered down, lightly bland, and bright yellow (vs the typical more orange color).  My bf was excited that they offered Keema, which apparently isn't offered at a lot of Indian spots.  But sadly, it wasn't all that great.  My lamb vindaloo however, was delicious.  Super spicy and plenty of tender lamb.  Good sized portions as well, as wel had leftovers at the end.  The mango lassi was also yummy and very thick.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cVI1vPJM2iNbJbrCU4B9XA"
  },
  "LpwY0sMiXddR5IHeWySPXQ": {
    "date": "7/13/2014",
    "text": "Similarly to Andy E., I ordered my favorite Indian dish (aloo gobhi), and my grandmother ordered two samosas with mint and tamarind chutney.  The aloo gobhi was fine. It came with a ton of rice. Thanks! I like how they prepared the aloo gobhi.  The samosas were meh. They were soft and a little soggy. That's kind of gross man. The mint chutney saved the day though.  We were the only ones here! It was very fun eating aloo gobhi and samosas with my grandma.  Argentina just missed an easy goal by the way vs. Germany.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RzfYW15KepJZqPjlnazlNg"
  },
  "cpaGJHcyxggZ7EsI4Kd22w": {
    "date": "3/23/2017",
    "text": "The food's very tasty and the prices are reasonable. Giving four stars instead of five because you'd think all of the meat would be halal or kosher in order to reduce animal cruelty as much as possible, but only the lamb and goat are.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1hKruCkaXltCcwNAYtn6AQ"
  },
  "MmCvWM2Evzgw6zzWtdyodQ": {
    "date": "9/12/2019",
    "text": "My lunch crew tends to bounce between this place and an Indian place a few doors down,  Both do a buffet at lunch.  Hands Down, the food tastes better at this establishment.  They tend to have Chicken Tikka Masala and Tandoori Chicken.  I love them both.  They always have rice and Naan.  From there, they switch it up and I tend to be adventurous here because the food is always great.   Aside from food, the place is clean and the prices are fair.  My entire lunch crew does have one major complaint that almost makes this place a 3 star.  They have a problem with keeping the food prepared at lunch.  Often we spend time fishing for meat or waiting on a side to be replenished.  The buffet is your only option at lunch so I feel as though they should put extra effort into making sure that there there is plenty of food prepared.  Considering the wait for food, this may not be a great place if you are in a rush.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ZdQxhh3hCW33imdMHMIR_g"
  },
  "VLLDVQA-LMwLjjHe7u3xkA": {
    "date": "7/29/2019",
    "text": "The place is very small, but the staff is incredibly polite and the food is great. Also, compared to other places I've been, they frequently top off your water. This, for some reason, has been a consistent issue at other similar places lol.  Give them a good tip. They're nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2HNiprGbAiQs5rrkd3QJyw"
  },
  "Qciuc11LzCdD-d2Ags2YrA": {
    "date": "5/14/2019",
    "text": "Came here for the first time and had their weekday lunch buffet.  Under $10 per person.  What's Hot - Quality.  Yummers!  All their meat was tender and flavorful.  Their sauces are fragrant and flavorful.  One of their veggie curries (I think it was their green lentil curry) had a spicy kick to it, which was yummy, as well.  All their other dishes were non spicy, but to have one that was spicy was a nice touch.  Not over the top spicy, but enough to give it a kick.     - Variety.  Their lunch buffet was small: basmati rice, naan, veggie curries, chicken tandoori, a couple of chicken curries, and kheer (sweet rice pudding dessert).  From the other food pictures on this Yelp page, it looks like their menu has a decent variety.  What's great is that there are veggie options, as well.       - Price.  I didn't look at their regular menu.  However, their lunch buffet is very reasonably priced.  Just under $10 per person.  Affordable and good value for money.  I'm guessing the rest of their menu is reasonably priced, as well. - Service.  Pretty good service.  Our waiter was nice and attentative. - Layout.  Interior layout is nice and spacious.  Not too cramped.  From what I could see of their table layout, it looks like anything larger than a party of 6-8, you probably have to call ahead of time.    What's Not - Parking.  It's in downtown Pitt, so it's not convenient to find parking.  There is street parking and garage parking nearby, but that means money, as well. - Location.  Downtown Pitt.  'Nuff said.  :P  Final Answer Would definitely come back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QyJSGoyoyFggntjxLFoW4w",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Lunch buffet",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QyJSGoyoyFggntjxLFoW4w/o.jpg"
      }
    ],
    "user_id": "eYUt3Va-5w-NrCBxD_PrFA"
  },
  "R6yF7eSxRKVTC8Zrsf0QBw": {
    "date": "4/11/2019",
    "text": "Stopped by from work to pack dinner on the way home, am glad I decided to try it. Visited exactly at 5 pm, which is when they reopen for the evening and ordered panneer pakoda, garlic naan, veg jalfazi, tandoori roti and mango lassi . I ordered my food with medium spice.  Loved it. The panner pakoda was exactly what I was looking for, just the right amount of spice, cooked to perfection with fresh oil so there was no trace of oil even in the box. So was the naan, roti and sabzi, which, came with a box of rice and so was a complete meal. Everything was freshly made and packed hot , which stayed hot till I got home.  The prices was very reasonable especially for the quantity, I mean the lassi came in the real 'lassi size glass' - if you know what I mean ...so rarely seen in the US   It is almost diagonally opposite to the PNC Park arena. I will definitely return to the place.  Awesome Indian Spices. Keep up the good job!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kFdXnKio0Lmwkrc3iBD_4A",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kFdXnKio0Lmwkrc3iBD_4A/o.jpg"
      },
      {
        "img_id": "x18octYR1olSxhAOv2lEPA",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/x18octYR1olSxhAOv2lEPA/o.jpg"
      },
      {
        "img_id": "PYv9e7ELcUe9IVkd3HChIg",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PYv9e7ELcUe9IVkd3HChIg/o.jpg"
      }
    ],
    "user_id": "RgLTpGiZVo4s5gLEV9t_4g"
  },
  "5QyPxw2FhRMJWTn81jvIVg": {
    "date": "2/3/2019",
    "text": "Indian Spices is an amazing place for vegans. I have been eating a plant based diet for 3 years which excludes all dairy and meat and it's wonderful to have a Indian buffet Downtown that serves vegans. The staff at this restaurant or cordial, soft spoken and generally very lovely. The cook who I assume is also the owner does a wonderful job. I would told once on my visit that she had even prepared an additional vegan buffet option for me because I had been dinging there so often. I have eaten at the lunch buffet more then a dozen times and no one every gets frustrated when I ask to be shown what the vegan options are. There are typically 2-3 vegan options on the buffet with delicious basmati rice and salad.   I love the chana masala and pakora. Everything that I have tasted is absolutely delicious.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "AMt8MDYWSiAvi1aruCbdXA",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Hot pickle mix! Sour and delicious.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AMt8MDYWSiAvi1aruCbdXA/o.jpg"
      },
      {
        "img_id": "Gd4eJCezbzQLyY_S38EDWA",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. hot fresh pakora with mint sauce and sweet and sour sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Gd4eJCezbzQLyY_S38EDWA/o.jpg"
      }
    ],
    "user_id": "V7uS5US4oTf-S9u36HJQCQ"
  },
  "PayVpWzrPO4N35yiUjlYzA": {
    "date": "8/22/2019",
    "text": "Currently, my favorite Indian Restaurant in Pittsburgh. Honestly, I've only even been for their Lunch Buffet.  It is fabulous! When I am lucky, they have their Navratan Korma! It's my absolute favorite!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ovPBFroF3S6QM8wrN3R3QA"
  },
  "5j9CgYMR3L3uMWK5Kx3MUw": {
    "date": "3/4/2019",
    "text": "Welcoming staff and delicious authentic Indian food. They have all kinds of options and even an AMAZING COCONUT SOUP. You need to try it!! So delicious! The food smelled so good I had to dig in immediately and take the pictures after.....I had the yellow lamb curry and the meat was amazing. Cooked just liked my mom used to make (She's really Indian). Definitely my new home away from home",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hH0exnd9TMCZM07YFOfd9A",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Yellow Lamb Curry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hH0exnd9TMCZM07YFOfd9A/o.jpg"
      },
      {
        "img_id": "mGUBMNQ9eUmh1E62eDuhSA",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States. Yellow Curry, Naan Bread, Rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mGUBMNQ9eUmh1E62eDuhSA/o.jpg"
      }
    ],
    "user_id": "OZk6ZBqWLpXAqyHotXb3aQ"
  },
  "g9U7saM2iUJMw_dFLLC-nA": {
    "date": "4/6/2018",
    "text": "Reviewing this for what it is (cheap lunch buffet) and not comparing it to something fancier.   I'm not well versed in Indian food, so I liked this buffet as I could try a bit of everything. It was all good. I couldn't quit eating the nan. My favorites were the chicken tandoori and the goat tart. The rest was good, but I thought they all had similar flavors. This place was not fancy, but for a cheap lunch buffet, I didn't expect anything more. I would like to see at least one additional dessert, but not a big deal as I filled up on main dishes.  I would recommend this place if you want to try several dishes instead of having to decide on one. I will definitely be going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QZpMvAmP5YLZFkT7rBTCRQ",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QZpMvAmP5YLZFkT7rBTCRQ/o.jpg"
      },
      {
        "img_id": "cTjXMuF7DWOpi4yyXJMLrw",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cTjXMuF7DWOpi4yyXJMLrw/o.jpg"
      },
      {
        "img_id": "9jXaKoLkhhrW3qKpQOhIJw",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9jXaKoLkhhrW3qKpQOhIJw/o.jpg"
      }
    ],
    "user_id": "rVLTC95ZV7yCmbQbSVdX1w"
  },
  "G7jaOiz9uNIB7AIuoZWpEQ": {
    "date": "5/7/2019",
    "text": "Not gonna lie, Indian cuisine is a guilty pleasure of mine-although I suspect I commit a horrendous fopaux with how I consume said cuisine, but I digress...  Some of my usual haunts around the city of Pittsburgh have buffets that don't really impress...in fact, some have dishes that seem watered down or specifically catered to being buffet... not Indian Spices!   Everything tastes homemade, chock full of flavor and utilizes the best of ingredients.  Also, they don't have an overwhelming amount of options, but what they offer is always a 10 out of 10!  I'm a sucker for Tikka Masala and theirs is creamy, rich and oooo so good!  The service is great, the food rotates as fast as it hits the buffet and for $10 you'll be hard pressed to find a better Indian lunch spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gm-kEiEsSk_92_kr_6ln1A"
  },
  "G7qpjjgB85OZmpQo0IgOhQ": {
    "date": "3/2/2019",
    "text": "This is one of the best Indian Restaurants in the City of Pittsburgh. If you come to the benedum center for a play or something, this place is right down the road. It is a really good place, and, the perfect amount of spice.   The staff was very kind and when we needed something they were nice and told us about the food or where the bathrooms are. We did not have the lunch buffet but we had the food from the menu since it was dinner. If you would want the buffet from here you should go at lunch. The food itself was absolutely delicious. If you asked me I would recommend the chicken tikka masala and the naan bread. I would recommend this to friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pyb8SdxpyoHWUez_gXSW4Q"
  },
  "m0Ot4DuSpbLm8Y7h7uReSg": {
    "date": "9/25/2018",
    "text": "I showed up at 6:30 on a Tuesday and was one of only two people in the dining room. Don't let that deter you though, this place is awesome. I got the chicken curry and plain naan and it was perfect. The food came out very quickly. Just enough sauce for dipping naan, very tender chicken and the exact level of spice I expected. The waitress was excellent as well, attentive but not bothering you too much. If I lived here, I'd get this all the time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nR9GdLPpdHbGzDedfuLT4g",
        "caption": "Photo of Indian Spices - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nR9GdLPpdHbGzDedfuLT4g/o.jpg"
      }
    ],
    "user_id": "p3Yb8RJnhncsVokTeYg1LQ"
  },
  "RpRqSWvBchR1ZRh0z3v4GA": {
    "date": "11/24/2018",
    "text": "I was visiting Pittsburgh for a couple of days and thought I would try out an Indian restaurant.  I picked this one because it was close to my hotel.  I came for the lunch buffet and it was excellent!  I'm not a fan of buffet styles food because it's never spiced right, but this one was on point.  The price was great too.  The food tasted just like my mom would make.  I will definitely come here next time I'm in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lqBwYBEd0gSCVQoUASHR0A"
  },
  "jl9ugPvVU_wrjobry-Ov2g": {
    "date": "3/5/2019",
    "text": "Don't let the small size of the buffet fool you. All dishes were large on flavor and spice!! Everyone in our group totally enjoyed their lunch. This spot is a definite go!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Ns1Ka-LEebktyltPPaz7w"
  },
  "8Uuz9oZaeyp3seCVOrOveA": {
    "date": "5/3/2018",
    "text": "I had the lunch buffet it was tasty and not too expensive in fact cheap. The restaurant is clean and the wait staff was pleasant. It was busy every table was full. I was the only women customer. I would go again. Give it a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "28nEvOAGInazgIhbnd6jfQ"
  },
  "l9-mIoZ55mjOc-WmJ-PEgg": {
    "date": "7/23/2018",
    "text": "Considering the number of people from the sub-continent that I saw entering I'm wondering why my experience was so meh. Chicken Tika Masala was spicier than I expected for my medium order and I wonder if that was to cover for the not terribly great chicken. The naan was definitely very dry and tasteless.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0AOJg0-mh2b27vH0R9v8IA"
  },
  "8WMw0k2me4RLdQeXS6aqxw": {
    "date": "5/4/2018",
    "text": "This place forgettable. While the Samosa was decent, the chicken Teaka masala lacked any flavor, the naan was rock solid, and the biryani rice lacked any subtlety of flavor one would expect in traditional Indian cuisine.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CJOsPRJCiw1kEFWhhrgRlw"
  },
  "QLvtXy22j7tk1mOEygVNPQ": {
    "date": "7/28/2016",
    "text": "One of a half-dozen food places convenient to the Benedum Center.  Reasonable rates.  Casual atmospere.  I love spicy and they know how to do that but most want to dial things down to a level 1.  We are trying a new place each time we use our season CLO tickets.  I just noticed that their hours of operation seem incorrect.  Call first and they do ask what show one needs to get there.  Very helpful indeed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "GsFr15zUG8wO9fsSHwvZUw"
  },
  "1b1HrmRUMgcRn2RlvM_gRA": {
    "date": "3/24/2017",
    "text": "Reasonably priced and quality Indian buffet downtown. I have to admit that I was a little nervous when I went for lunch with some coworkers. I am a HUGE baby when it comes to spicy food and I've had some Indian food that has been far too hot for me in the past. None of the dishes here were too hot to handle for me! They had the standards, Tikka Masala, Tandoori, etc. and then some other dishes I had never had before. After two plates, I was full and ready for a nap!  It gets a little crowded during the lunch rush, but there are usually a few tables available. If you have a large group, I suggest getting there by 11:30 since there are only a few spots to accommodate a large group.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5IaHGddT0RLq1-S5LbP1iw"
  },
  "BUuee4_f7r-wyCndoBvL1A": {
    "date": "7/9/2018",
    "text": "As someone born in India and raised eating authentic Indian food, I usually dislike the food served at most Indian restaurants, which tends to be bland and too Americanized. However, all of the food I ate here tasted incredible, and was authentic for sure! The old Hindi music playing was the perfect touch- it really felt like I was eating at a family member's home. Definitely will be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q8yvh8qXfhZc2ZcyIyVpOw"
  },
  "pKTGH2aR2Mu8W-MGWjgnPA": {
    "date": "2/15/2018",
    "text": "My wife and I live in downtown Pittsburgh and visit Indian Spices regularly.  We've tried many Indian restaurants in and around the downtown area, and -- in our opinion -- this place is best.  Consistently good quality w/ great taste and spice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y7VvG3uiUUMrBrhjSuRbNg"
  }
}