{
  "l2ilwtMwBATBQ0-wpJBe9g": {
    "date": "10/21/2017",
    "text": "So. Good. Fresh ingredients and fast service. Butternut Squash soup has a touch of nutmeg and very smooth. Very cute decor. Would absolutely eat here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rmtu-2s9Y6Y7PNMosIA1mA"
  },
  "GjIfso0YBaBzZUK01veYuQ": {
    "date": "10/16/2017",
    "text": "Heard so much about this place and finally went this past Saturday morning.  Is is very nice inside and the menu was good.  Ordered coffee to start.  When my wife opened her pack of silverware, she notice that her spoon had dried food on it (guacamole I assume since it was green).  The waitress apologized and brought a new set.  Then I looked at my spoon which I had already stirred my coffee with.  Same thing!  Then our food came, looked great!  Mine came with another spoon.  Dried food on back of spoon.  3 for 3 on the dirty spoons.  My wife went to use her knife - take a guess.  After complaining to the waitress, the manager knelt by our table and apologized (dissing the cleaning staff) and comped our meals.  But as I ate, I started to think about how clean the utensils were that prepared my food and couldn't continue eating.  Left the waitress a $10 tip but even she should have seen the dirty spoon that was put on my plate with my meal.  Won't be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9bk8-ie4hrkeo4IUz-d3A"
  },
  "Tbx8U9_aBbA3fSXBtElz_A": {
    "date": "8/16/2017",
    "text": "What a great place!  I had driven by this place several times and always said I wanted to try it.   My boyfriend and I finally went and loved it!!  When we walked in there was a short line. The place had a nice clean decor and the waitress was extremely friendly going over the menu and giving her recommendations.   The service was extremely friendly, the food was delicious and had nice presentation and is geared to a more healthier style of breakfast and lunches.    A little pricier than other places, but well with it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6pBOPc6PPbx7UaRHeUwRhQ"
  },
  "LjnwUbPmKFJNQVKdMiYV3w": {
    "date": "1/23/2017",
    "text": "Had a quick lunch the other day.  The parking is tight.  I walked into a very neat interior that gave off good vibes.  Service was fast and I ordered chicken rice soup and the Monterey club combo.  The soup was very much a chowder with no rice.  I asked the waitress if it was something else.  She checked with the kitchen and the manager brought me a new bowl, this time with rice in it.  I appreciated the offer.  It was good soup with or without the rice.  The sandwich was delicious and fresh tasting.  This is a great place to gather for breakfast, brunch or lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "SYxZMSwr9m-_xAqIFdihTg"
  },
  "5_f2h6EsMyp2mG9meODEHQ": {
    "date": "9/27/2017",
    "text": "Was really surprised how good the food was, I had heard it was a little expensive, but not by much and it was worth it. Would definitely go again. I got a veggie sandwich and the bread and ingredients were sooo good. Loved the fact that everything is natural plus no microwaves and deep fryers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "stYXdDlDPBQ_Myn0X5wjRg"
  },
  "Pe2z8IlNBdMcmbwShkkbOQ": {
    "date": "6/26/2017",
    "text": "I really enjoyed the avocado toast.  I've been here a few times and it's hit or miss with the menu.  Some things are really good and others are just ok.  At these prices just ok shouldn't happen.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FacesK7Cwogzb0dYIWyDDQ"
  },
  "rX1yvVhS_tYsNcVvv67c-w": {
    "date": "12/31/2016",
    "text": "The lady next to us had a \"I'd like to speak to your manger\" type hair cut.  The iced coffee was disappointing. It was coffee with ice cubes in it. I was expecting some sort of coffee popsicle. Still good?   The dress code was not posted on the website. I think it would be helpful if they did that. I wore a tuxedo just to be safe. Luckily no one had a problem with it.   Edit: I went back today and got clarification on the iced coffee. The waitress said that a coffee popsicle \"doesn't exist\" and I should \"go invent that because it sounds neat.\"",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JbJ78dQh23uGCAAvM-wmSw"
  },
  "xg8b-aac1rszrGSu4E1siA": {
    "date": "5/12/2017",
    "text": "Lemon ricotta pancakes are wonderful. Just a hint of lemon. Waffles are light and airy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aa6FT4IduLVx0Al08uvyKw"
  },
  "NRXfMXiQhw-vflEq0LqAeQ": {
    "date": "12/24/2016",
    "text": "This is my favorite place for breakfast/brunch. Lots of variety and the food is fresh and delicious!  The restaurant is pretty large and they've done a great job in the renovation. I like the little things like how they leave you with a pot of coffee or a carafe of water and they have real maple syrup. Good service too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9cpWdgpc-i7FJ3ziip5Czg"
  },
  "1tfVoOMOJrwjkZNoy2HrNw": {
    "date": "12/23/2016",
    "text": "After hearing rave reviews about this place we had to try it out. We went in for a late breakfast at 1:30 hoping they wouldn't be busy and luckily they weren't. Less than half the restaurant was occupied however, it took someone 5 minutes to seat us. Our waitress looked disheveled with stains all over her shirt and wasn't very pleasant. After being seated it took her about 15 minutes to take our food order. She apologized for it taking so long. Our food took about a half hour to come out and at this point the restaurant was closing soon. The portion sizes were very small. They claim their pancakes are huge but they weren't anything impressive. Our waitress dropped the check and said they were closing soon. We felt very rushed. Overall there are MUCH better places to eat breakfast in Pittsburgh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fzEKI0JPTezamK0WNhiSDQ"
  },
  "4iYSeC4im4oseR0PRF2eJA": {
    "date": "3/29/2017",
    "text": "This place is just what Pleasant Hills needed.  It is charming, welcoming and the food is wonderful. I arrived at 9:00 on a Wednesday and there were plenty of open tables, but by 9:15 it filled up and was hopping with a great energy. I had the avocado toast and it was hearty and healthy at the same time. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jyRyy_-gFKOL4O-3-ZXYuA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jyRyy_-gFKOL4O-3-ZXYuA/o.jpg"
      },
      {
        "img_id": "EfVWatCV_NlwYtU-BvEIfg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EfVWatCV_NlwYtU-BvEIfg/o.jpg"
      }
    ],
    "user_id": "EoUYBTQWpUJr7Sp6Kpw1aQ"
  },
  "TB6b8KopTAoplYXKgR4EdQ": {
    "date": "1/17/2017",
    "text": "J and I came here for breakfast yesterday. A few things to note: when you are en route to this place, use the No Wait app to get in line, as this place typically gets packed; parking absolutely sucks so get there early if you want a spot in the lot, or be prepared to park farther away and walk as we had to. Now, this place was great. The decor was rustic and fun with bright windows and a nice warm feel to it. Everyone there was so nice and friendly, which was great. J ordered coffee and I had tea. Our waitress left the coffee and hot water carafes on our table, which was so nice and a check mark in our book. They're menu had a lot of really nice, fresh items and interesting combinations which was great. J ordered the traditional breakfast with scrambled eggs, ham, potatoes and toast with homemade strawberry jam. I ordered the smoked salmon and veggie frittata and added mushrooms and broccoli. My frittata came with ciabatta toast and a salad of greens. Everything was delicious and prepared really well. We would definitely recommend this place for breakfast as our experience overall was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MBWkeW5cPJEbdTU__XUNHA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Cute decor! Loved that we could watch the cooks and wait staff, and all the cast iron skillets!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MBWkeW5cPJEbdTU__XUNHA/o.jpg"
      },
      {
        "img_id": "mU7WAgXNavHoxWjhzzIcDg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. These were used as rings, wrapped around our napkins. So cute!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mU7WAgXNavHoxWjhzzIcDg/o.jpg"
      },
      {
        "img_id": "SXzlSuUTSV-_GfWWhNpqng",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. J&amp;#39;s traditional breakfast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SXzlSuUTSV-_GfWWhNpqng/o.jpg"
      }
    ],
    "user_id": "BfX5cChtKJZMhWHLB1K1eg"
  },
  "y3ExpAolMG7gsh06_5IsOw": {
    "date": "1/6/2017",
    "text": "This place was excellent! Kind of out of the way from the city but definitely a must if you live in or are visiting Pittsburgh! Lots of healthy options but full of flavor! I got the carrot cake pancakes and the power bowl. Both were excellent! If I come back here I'll definitely make another stop in!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-9lkOzADAWHfOuB6kRiOcA"
  },
  "hJz33LB03YENgmlQMaxCyw": {
    "date": "1/29/2017",
    "text": "So glad this place has come to my neighborhood! Although there can be a wait, the line moves fast. And once at your table, the service is quick. For a restaurant, their coffee is the bomb, I've had nearly all of their entrees that contain avocado and none disappoint, my favorite is the avocado toast, YUM! My adult kids and other have love as well, definitely a place to stop if you live or are visiting the South Hills!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mG9B77eLtur8sv4dfFvSAw"
  },
  "T_NKz00qKhjMfjY4JZ2yHg": {
    "date": "4/2/2017",
    "text": "I love the atmosphere of this restaurant. It's relaxing yet fun. The staff is friendly, the food is amazing, and the iced coffee is some of the best I've ever had. I had the turkey sausage and gravy over biscuits and cleaned my plate. It was delicious! The prices are reasonable too. I'll definitly be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "81UGJ4MFKhMxd9ydNca66w"
  },
  "BCPx1je65o60In9t3_QU5A": {
    "date": "2/2/2017",
    "text": "We've been here 4 or 5 times since it opened and never had a bad experience. The menu has a lot of healthy options to chose from and I love the fresh juices! The food is always prepared well and the service is always good. They get busy but we never have to wait long to be seated or to get our meals.  The only downfall is parking because the lot is small but this is definitely a spot we will continue to frequent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eqqUGvEbSVgR71Crc5vMlg"
  },
  "qKhdzVozYM5acrQEWu4m4w": {
    "date": "6/8/2017",
    "text": "I went to this place a few weeks ago and loved it. The place is adorable and the service was outstanding. I had the eggs Benedict BLT and my friend had a veggie omelette both were great. They have everything from huge breakfast to healthy options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yR2Ck_FztBOWA66oV16OEw"
  },
  "AdUNuqotDMCmZKdGK1OfcA": {
    "date": "8/30/2017",
    "text": "First visit today. Waitress was awesome. Very friendly. Food I swear was delivered right after I ordered. Hot & fresh & delicious! Will definitely be back! I had breakfast tacos. Delicious  Very clean as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_4CCwcTOyX1z48YwT0v7sQ"
  },
  "CzwMb3zPO_wl1zuV9sL9MQ": {
    "date": "1/17/2017",
    "text": "My husband and I stopped here for lunch one Sat around the holidays. It was so busy. We were slightly irritated at first because it took around 20 mins before someone came to take our drink order. The table next to us was sat mins before us and we're waiting as well.  3 waitress were in our area and none of them made eye contact with us or got our drink order. Finally someone came and got the drink order at the table next to us and then immediately left to get thier drinks (instead of saving a trip and taking our order as well) when we finally got service it was good. The food was delicious. We got the lunch 1/2 deal. I got half a sandwich and 1/2 a salad. Lots of flavor and a nice presentation. I think the place needs to be open for a while to get the service down. It's a cute rustic farmhouse restaurant. We plan on going back once the new crowd dies down. We definitely want to try out the breakfast menu. It looks amazing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wWJhQic8_BJQqbzsK2DAEg"
  },
  "Nk12nzvKFMOhExwcwPSHXg": {
    "date": "3/16/2017",
    "text": "Tried here for the first time and I was quite impressed! We ordered. Kids French toast meal, BLTE, and Monterey club. The kids meal came with 2 huge pieces of bacon and a cup of fresh fruit. Our sandwiches came wth either soup or salad and both were delicious. The vegetable soup was homemade and was perfect for a cold day!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WE8YHv7URejCXpyeQVnngA"
  },
  "mwwq8XbvJgwLsGu3TFafaw": {
    "date": "9/15/2018",
    "text": "Since there aren't exactly a ton of good brunch options in the suburbs outside of my own kitchen, this place is great. The food is a bit on the pricey side for the location, but there are tons of delicious options. Great for vegetarians too! Come early if you don't want to wait a long time; this place gets crowded. I only wish they were opener a little later and had mimosas. I'm tryna have a boozy brunch ya know what I'm sayin?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EY2NrAyXKKpJ7XcxA2Eeqw"
  },
  "yudPC6qB33ODMJ_4fjr5jw": {
    "date": "12/7/2016",
    "text": "What a great addition to the neighborhood this is. I was impressed by the attention to locally sourced and healthy ingredients. They have fresh juice-bar juices, left the carafe of coffee on the table and everyone was super friendly and helpful. Lots of smiles going on among the staff; they seem to be enjoying working here, so management must be doing something right! My coffee, food and check all came very efficiently. I had the lemon ricotta pancakes which were ridiculously filling and delicious. Looking forward to coming back often to try more! I'm a vegetarian and there were a good number of options for me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "85JG8XUDYGjTV2EP_nYRvA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/85JG8XUDYGjTV2EP_nYRvA/o.jpg"
      }
    ],
    "user_id": "qDwUjPkXJX8_dvW06UhecA"
  },
  "2b-hYy9jx8Dm79UDL5vcfQ": {
    "date": "3/13/2018",
    "text": "I tried first watch a few weeks ago. It was very busy on a Saturday morning but only took about 10 minutes to get a table. I wasn't feeling that well so I just ordered soup and a slice of toast. The broccoli cheddar soup was amazing, I got a side of bread too and it was very fresh and delicious! I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3NYfJw26mRHNcX8CUnA-nw"
  },
  "0ncR_SoEhBhOXZ_hVyWZwQ": {
    "date": "3/24/2017",
    "text": "Best French toast I have ever had. Great selection of food and juices. Their biscuits and gravy was amazing. Service is on par. Their prices are a little high but you get what you pay for and the portions are huge. Very friendly and clean. Definitely a place to try. Also, the hours are only until 2:30. Unfortunately.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jet0QZQqYFQkvyzLZbFBQQ"
  },
  "b5PHlUraDl9fUT2yQ5MriA": {
    "date": "3/7/2018",
    "text": "Awesome food!  So fresh and filling!  Many choices for everyone.  My favorite is the healthy turkey egg white omelette with Monterey Jack cheese with fried potatoes on the side.  Their grain bread with strawberry preserves is delicious! I really love their iced coffee too!  Definitely worth going even if you have to wait to be seated for an hour!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HJejNTbC0Y3_9VaWoSNdFw"
  },
  "aedf20paIMT7-PfzoZvVug": {
    "date": "5/4/2017",
    "text": "This is such a cute breakfast spot!! I'll definitely go again. The staff are very friendly and helpful with explaining the menu. My breakfast was pretty tasty, I really enjoyed it. I got the AB&J waffle with a side of eggs and bacon. I got the maple almond butter, strawberry preserves, and granola on the side because I wanted to make I sure I would like the taste of everything together first. It was a really good combo. I didn't use much of the granola though. Bacon was really good and the eggs were eggs. Im not even a big huge coffee person but the coffee was GREAT!! The only downside is it's a bit pricey for breakfast, in my opinion. The breakfast was good but I've had better for less.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7ekvq5f8ZXd5Xt0oCm1hiw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Side of eggs and bacon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7ekvq5f8ZXd5Xt0oCm1hiw/o.jpg"
      },
      {
        "img_id": "bHy9C3guuG7iX4w5s6kLNQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. AB&amp;amp;J Waffle - deconstructed at my request",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bHy9C3guuG7iX4w5s6kLNQ/o.jpg"
      }
    ],
    "user_id": "OpUPGN_aDRaBgp9H3Iv9Zg"
  },
  "tt1M3lQNP4NY7zsAaC4L2g": {
    "date": "1/9/2017",
    "text": "My daughter and I stopped in this weekend to try out First Watch and found the beautiful place to be friendly and a very interesting menu. I had to try the fresh juices and just loved them! I also experimented with the smoked salmon frittata and was amazed at how good this was. I am looking forward to returning.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B5e_FkhHpwe3_BjSRxZixQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Another pic of the Smoke salmon &amp;amp; roasted vegetable frittata.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/B5e_FkhHpwe3_BjSRxZixQ/o.jpg"
      },
      {
        "img_id": "YB600HZJpt-WjZh6xqvyMQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Kale Tonic",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YB600HZJpt-WjZh6xqvyMQ/o.jpg"
      },
      {
        "img_id": "xGVpl8GJiXNHDyT2cC_i9g",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Kale Tonic.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xGVpl8GJiXNHDyT2cC_i9g/o.jpg"
      }
    ],
    "user_id": "IwAzZe3iN9ZBMxW7lKM3Yw"
  },
  "_vVFMebUcc8TojkFErgTEg": {
    "date": "7/13/2017",
    "text": "This was my first visit to First Watch and I will definitely return! This trendy cafe serves breakfast and lunch. Since breakfast is my favorite meal, I couldn't wait to check this place out.  I ordered the Trifecta. The eggs and bacon were perfectly cooked. The pancake was big, fluffy and flavorful. I also ordered coffee. They bring a carafe to the table which is the best way for coffee refills....no waiting! Plus there was a nice sized bowl loaded with creamers on the table.  They offer traditional breakfast items as well as unique offerings. There is something for everyone.  Plenty of seating, an open and well lit floor plan as well as outdoor seating.  We were seated as soon as we arrived and our server was friendly and efficient. I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gz8Ap2lf_knneqB3LThE4Q"
  },
  "DXJxWIwsmxUK1C7qULUZ_w": {
    "date": "7/2/2017",
    "text": "EDIT:  I went back to try again, with my three year old son.  They greeted us and let us know it was a 10 minute wait. Which is fine so we wait and then get seated and served.  The food was great, but it did take awhile to give my order and then receive it.  Overall, it was a nice lunch and I would consider coming back again, but I do think the service still has a few kinks to work out.  I went in by myself on Sunday for a lunch.  It was my first time and I see they are busy so I know it might take some time.  They say me down and said my server will be with me shortly.  The table was dirty, like they didn't bother wiping it down before seating me.  Which is kinda gross, but nothing I can't ask the server to fix one they show up.  Except they never showed up.  I sat for 10 minutes and no one came to get my drink or order or anything.  Which I understand they are busy, but it wasn't overly crowded and tables were open, servers just weren't serving.  I saw several just kind of walking around and stopping to talk to each other.  Which once again, I don't begrudge employee banter and fun, but I sat for way too long before I finally just walked out.  So I have no idea how the food is and I was excited to try a new place.  Maybe I'll try again.  But this has left a sour note in my mouth.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YrLR4iKol0_RfNuFtcGyrw"
  },
  "MH2S8QlqmJAEHjGzKlHmQQ": {
    "date": "1/12/2017",
    "text": "I love this place. Their food is a healthier versions of traditional items. Everything is so flavorful. Their pancakes never leave a pool of grease, their fresh fruit is actually fresh and the eggs are never weird. The service is fantastic too. It's one of my favorite places to eat at and I never feel guilty when I leave. I am so happy they opened up a closer location.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEaYdTrF2JVebGbPVe5K6Q"
  },
  "_hpB2D_w5ICmBfxZGIIlew": {
    "date": "1/3/2018",
    "text": "First and last time will go in for food. First server was by any means pleasant or friendly. Hate going to a place that puts coffee pot on table and water pitcher it's like they don't want to be bothered with you. Food came out cold like was in window for awhile so much so could not even consider a reorder or something else. I see others have had better experiences but I for one will stick with my usual breakfast place and not try them again. This was first ever when had an issue manager did not come to table hate to think it was because we were gay.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kJr0_xjTmGjGipmytp_Kig"
  },
  "un9sVboKiFjSxbQ19gK82Q": {
    "date": "11/5/2017",
    "text": "My first time there today & will definitely go back! My pancake with bananas & granola was delicious. Everyone at my table was happy with their food",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clzBBdrhjQaRz2l2aWCdsA"
  },
  "3zJv2kACUWsVceeGBKKioQ": {
    "date": "6/9/2018",
    "text": "Every time I visit I try to pick something different and am never disappointed. I took my 8 year old son today who is rather picky and he really enjoyed it! I typically have great service here, plan on returning again and again, especially now that my son is a fan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MXhdvKi_2C0YjMbN698U2Q"
  },
  "qTwKZ2cDuxpVH4egUjBXRw": {
    "date": "12/7/2017",
    "text": "Amazingly fresh food. Loved it. Except, a major problem for me: dirty glasses and silverware. The water glasses placed on the table for myself and friend to drink from were visibly dirty and literally had little food pieces on the outside. I work at a restaurant, so I know that nothing should be leaving the kitchen like that. We asked for new glasses and the same situation occurred again but i just disregarded it. When the food came, I opened my silverware and there were dried up food pieces stuck to the bottoms of my fork and knife. Additionally, our waitress visited us rather infrequently. I think we waited 20 minutes to order.   But, GREAT food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0u3THzHKxbPTqM1VC_oIOg"
  },
  "mO7s0840V4X6Q7iFBFk1sA": {
    "date": "10/21/2017",
    "text": "Amazing hidden gem! Great decor and huge menu of fresh selections, all in a cool California vibe. Staff was all friendly and gracious, letting in my group of 7 people though they were closing in 20 minutes. I ordered the 2 For You lunch with butternut squash bisque and chicken avocado chop salad. Excellent all around. My entire group ordered variations of the 2 For You and everyone enjoyed their selections. Will definitely be looking for other locations of this great chain in my hometown. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zNFOIECCNZKOfSMD_Hnmyw"
  },
  "yBkHunUgtGn6hHTXbi0OPA": {
    "date": "8/19/2017",
    "text": "This place was really great they accommodated our party of eight people at the last minute and the service was wonderful. Would definitely recommend if you were passing through.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xvb7Ac8VJWDW-IVw8bRzTw"
  },
  "X43DT-z7vhi-Qg9bI_5pOQ": {
    "date": "11/16/2017",
    "text": "The BEST brunch and so close to home in the South Hills! The rustic farm decor is adorable, and free coffee and copies of the daily newspaper are located right inside the door-perfect to pass the time if you're waiting for a table. I started with the Morning Meditation juice-a refreshing concoction of orange, beet, lemon, organic ginger, agave nectar, and turmeric. My friend enjoyed her freshly brewed iced coffee as well. We both got the Cinnamon Chip Pancake breakfast-it is a treat to DIE for! Bacon was perfectly crisp, and the service was fantastic. We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CvaAQN40esVxY2qRZAdYtA"
  },
  "7ituVZ4YIh5lEEIUpwTWJQ": {
    "date": "9/8/2017",
    "text": "Had the new fall Pumpkin Pancakes with chicken sausage and eggs.  It was delicious.  My only complaint would be is you only get one Pancake for just under $10 as I think there should be atleast 2 but other than that nothing else to complain about. The food is delicious!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kmjsIXWv3JJQpnB9USgHBQ"
  },
  "wIb52FosAqz9P5ZwYMIZBw": {
    "date": "10/30/2017",
    "text": "This is our second time here.. really cool different concept. Amazing food and service. Courtney was awesome! Thx",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_znYeGuhldeSs6MQZilIZQ"
  },
  "-lXIINnlkbB1RVKmazQUSw": {
    "date": "5/25/2017",
    "text": "Tremendous. Fresh. Friendly. Creative. Went 2 days in a row. Croque Madame best thing I've had for breakfast in a long long time. My 5 year old raved about the quick service. Seriously. And my wife couldn't get enough of the chicken salad melt. Great job.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jCiiQvwYXnC5Zkl8DwIlAg"
  },
  "99ruFIygWbA8LBQPbAN7qg": {
    "date": "11/19/2018",
    "text": "If you're looking for a more upscale place for breakfast, this is it. The food is fresh and fabulous, and I dream of the breakfast sandwich, which is the best I've ever had. From beginning to end, every meal has been great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tSAOXRfYQNoYOdREI0axpA"
  },
  "ZFaArr2CdAhXyadRug9_lA": {
    "date": "3/12/2017",
    "text": "Stopped in yesterday after a walmart run in west mifflin. A yelp search of healthy resturaunts in the area brought me here.  I adore the cute rustic feel to it. The menu had great healthy options. I went the pick 2 lunch option and chose the Monterey club and the chicken avocado chop. The salad was fabulous. It had chicken , avocado, black beans, corn, tomatoes, tortilla strips with a citrus vinaigrette dressing. Originally it is served with romaine but I subbed mixed green.   The salad was absolutely amazing I highly recommend it. I wasn't a huge fan of the club. I found that it has too much mayo (top and bottom bun) i didn't care for the cheese on it also.. It was too heavy for such a light sandwich if that makes sense. Loved the salad though",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "YHEfi47kcZDKk_WFqXqehQ": {
    "date": "4/25/2017",
    "text": "This is a great spot for brunch, and it's no hidden secret either--there's very frequently a long waitlist on the weekends. Fortunately, they allow you to get on the waiting list before you leave the house, which is quite a nice feature to offer. Also love that they have coffee for you while waiting, giving you the feeling that they actually care about the customers from the moment they step in the door.  The rustic decor is comfortable, especially coupled with how bright it is with the large windows. The menu is pretty large, and we haven't found any clear favorites yet from coming here only a few times. There are lots of standard egg-based creations, and I really enjoyed their hashes, combining lots of different chopped up vegetables, potatoes, and meats into a tasty meal. They also have lots of things on the sweet side as well, from pancakes to waffles to fruit and yogurt bowls.  One thing I'm not sure about is why they don't have prices on some of their beverages on the menu! Makes it a little awkward when having to ask waitstaff about them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "153pFX2EfIk9rWUQizOUFw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Chickichanga",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/153pFX2EfIk9rWUQizOUFw/o.jpg"
      }
    ],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "9B-eIxUFRpF9WCRL_cwIfA": {
    "date": "2/5/2018",
    "text": "Third visit today and did not disappoint!  Last 2 times I had the avocado toast , which is superb !  But I have been eyeing up other delish sounding menu items and wanted to get something different today.   I got the frittata rusticsa and it just might be my new fave!  Went with the hubs and he is totally addicted to the millionaires bacon.   I don't go out of my way to order bacon, but this is pretty darn tasty!  So tasty we ordered 2 orders,,,  one as an appetizer and one after brunch to top our meal off.   Hubby got the trifecta that comes with a waffle.   Again, not a food im in love with, but their waffles are incredible !!!!!   Can't wait for future visits to try other dishes !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TIVgVhOqM5eTUH2wF6JMqw"
  },
  "n9BjqVBKC9gCgYPahkMOFQ": {
    "date": "11/10/2017",
    "text": "Unfortunately I can't say that I'm a huge fan of First Watch. While it's a good place for breakfast, lunch, or brunch, it's typically not my first choice. By the looks of the menu and the overall vibe of the place, you'd think they're trying to take a healthy approach to breakfast..until you look at the calories of each menu item. I don't typically count calories so that doesn't bug me too much. However, I've eaten here a few times and have not been blown away by any of my experiences. The food is just ok to me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "e-OHx6JLSbvLTL9Wfp9ADA": {
    "date": "11/21/2017",
    "text": "Yum! Such a good breakfast/brunch spot. With how great our breakfast options were, I'm sure the lunch is fantastic too. I live in the city - but would definitely travel to the south hills for this. My biscuits with turkey gravy were a big hit - I don't usually get to have biscuits and gravy as most places serve it with pork or beef gravy (which I don't like)! The iced coffee was also on point - creamy and delicious. I love the ambience and vibes of the location. Even for a Sunday morning, we didn't wait more than 15 minutes!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TVl0AEX--eINGwJeEhRHxw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TVl0AEX--eINGwJeEhRHxw/o.jpg"
      },
      {
        "img_id": "B14clLfNqSqS2h8YIx1isA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/B14clLfNqSqS2h8YIx1isA/o.jpg"
      },
      {
        "img_id": "6LbMe3WPudNV2jYuM7oCdw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6LbMe3WPudNV2jYuM7oCdw/o.jpg"
      }
    ],
    "user_id": "-sv8-a09Psq5CMzmg6E4OQ"
  },
  "apr-sHIbnMKtBfv9lnftiA": {
    "date": "9/30/2018",
    "text": "The food was quite good and the place very clean.  It was also nice they had a line app situation which allowed us to kill time walking around since the wait was 45 minutes. A few points of constructive criticisms- 1) the hostess was not really engaged at her job and was very unprofessional 2) the server was nice but service overall from observation was very inexperienced 3) if you bill the food as healthy, I would recommend healthier looking staff.  The staff does not look like healthy eating is something they care about so the product is compromised.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SssaXuR9ZalpMiDvq3XKMQ"
  },
  "tWXnieZK14RNlRoEe6luPA": {
    "date": "8/18/2018",
    "text": "First time here, everything was fresh and delicious, from ham & fryers omelet to the chickichanga.  Fresh potatoes thoroughly cooked with nice crusty edges. Great wheat toast. We'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YYFNZQuQflk_rx9NooA3jg"
  },
  "lcekdS_e6sx5etegm6lOIQ": {
    "date": "8/20/2018",
    "text": "Finally stopped in to First Watch on Route 51 for breakfast. Outstanding breakfast and fairly reasonably priced! I had the 3 tacos breakfast which was delicious. It comes with a side of black beans topped with pico. My GF had eggs, hash browns and bacon which she loved. The coffee was excellent too along with the service! The atmosphere is really nice, open and airy. You don't feel squeezed in since the dining room is very large. Will return soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lmY3wfI3LehsFARfVvOoYw"
  },
  "22ptP-FmzUMSzoYq4H1nAQ": {
    "date": "8/14/2018",
    "text": "First visit and probably last. A lot pricey for breakfast. I ordered al a cart and was rather shocked at the cost of a very small amount of egg whites and some over cooked turkey sausage.   Another meal the waffle was cold (which was replaced with a hot waffle) and the bacon was well done.   The service was mediocre at best.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LNZrQtiZLVvCNJ6SAK3fSA"
  },
  "QqcDcyNnl21ywljWVuuIkA": {
    "date": "11/25/2017",
    "text": "Five stars!  Best of the Best! Amazing and special breakfast foods, fantastic service (thanks Elizabeth) and even a selection of newspapers and help yourself coffee if you are waiting (we were greeted warmly and seated immediately). We loved the banana granola crunch pancake, maybe the best ever.  I'm going for two next time!  First Watch is a relatively new brunch chain which my wife REALLY enjoyed over in Philly last month. We also checked out their location on 50 West in Bridgeville and it was terrific as well.  This is our new favorite brunch spot in all of Pittsburgh (sorry Square Cafe, First Watch has left you in the dust for us).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HDbaAzgWwyWD0yUuHr1qcg"
  },
  "IJ3KvDcLZO44hkTs5_HTgw": {
    "date": "7/5/2018",
    "text": "Delicious breakfast for a reasonable price. Tons of options to choose from and a nice atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cKkVfQrFa9OmU2GGunqNmg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cKkVfQrFa9OmU2GGunqNmg/o.jpg"
      }
    ],
    "user_id": "pF72EiSCxxMdM5ezyLgMMg"
  },
  "FKvorfpgpZAEfDtAcgCo_A": {
    "date": "7/5/2017",
    "text": "My husband and I visited First Watch for the first time this week.  We had never heard of it before, but had looked on Yelp for someplace new to go for breakfast.  We had a FANTASTIC breakfast!!  We shared the Millionaire's Bacon, which was incredible - both sweet and savory at the same time.  I also tried the Strawberry Smash, which I thoroughly enjoyed.    We enjoyed sitting in the open-air area of the restaurant.  Even though it was a tad noisy from the traffic, we loved the fresh air.  The service was great and friendly.  This is my new favorite local place for breakfast, and we will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qNejjah4Id0gWd-QDAOuuw"
  },
  "4szqXM2NGURqhxpZYr-qMQ": {
    "date": "1/25/2018",
    "text": "If breakfast is your fav meal then First Watch is for you. If you like a healthy breakfast then First Watch is for you. I have been there a couple of times and have never been disappointed. When you walk in it is very inviting. You feel welcomed. The colors are warm. Two of the three times I have been there I have ordered the same thing-The Ham and Gruyere omelette. It is big and not for the small appetite. You have a choice of three sides-Home fries, salad, and I'm blank on the third (sorry). I go for the potatoes. The omelette is packed with flavor. It looks dense but tastes fluffy. My favorite part though is the toast. In Pittsburgh a lot of places serve Italian bread, which I love, but First Watch serves a Texas toast sized piece of dense bread loaded with grains. I've decided the next time I go in I'm ordering a breakfast sandwich. Nothing like preplanning your next meal at a restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Y8iC738ujYRfWGOM5BG_7Q",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y8iC738ujYRfWGOM5BG_7Q/o.jpg"
      },
      {
        "img_id": "Z9pCvB9X7nXM1yLnuNHqMA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Traditional Breakfast.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z9pCvB9X7nXM1yLnuNHqMA/o.jpg"
      },
      {
        "img_id": "-GDvBdcil79FWZb-TbwSVg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Biscuits &amp;amp; Gravy",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-GDvBdcil79FWZb-TbwSVg/o.jpg"
      }
    ],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "T0sHA4S6ej9WSK9J5lIxAg": {
    "date": "8/21/2017",
    "text": "Decent spot for a traditional breakfast. Scrambled eggs were fluffy. Bacon was extra crispy (just the way I like it) The seasoned potatoes were on the dry side and not piping hot. The server told me the toast would be dry and it came out buttered with only enough jam for half a slice. Average service. It took over 5 minutes for a server to come by and say hello.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Lqk2MDNjwNySI8PfUW8Rnw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Traditional breakfast was average",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Lqk2MDNjwNySI8PfUW8Rnw/o.jpg"
      }
    ],
    "user_id": "pD_URrASN38VIween6V3Sg"
  },
  "XVp1fHN97R5gRJSUadQVyA": {
    "date": "4/8/2017",
    "text": "Had brunch there that included the Avocado toast and waffle.   The Avocado came with some plastic string mixed in but the toast was thickly cut and perfectly toasted. Came with a side of eggs that were on the small side but enjoyed.   The guest had a waffle and side of bacon. They enjoyed every bite and would get it again the next time.  Service was prompt and there was plenty of room between tables so you didn't feel squeezed in.   Only because the plastic did the rating drop.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Fx7lZ9hmZpynIOQrgQ6bMQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Plastic in",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Fx7lZ9hmZpynIOQrgQ6bMQ/o.jpg"
      },
      {
        "img_id": "EwEdbIs1YMJnCLdaqvxZTw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EwEdbIs1YMJnCLdaqvxZTw/o.jpg"
      }
    ],
    "user_id": "ZnNcaZ7tAIhvWzihCXjFSQ"
  },
  "Tse_s1VriTJU4tckwzJTFg": {
    "date": "2/25/2018",
    "text": "Blueberry pancakes were good but why is there an additional charge for maple syrup? Cracker Barrel uses real maple syrup without an additional charge to the customer. The only other thing I disliked was the coffee. It was terrible. Also, the poached eggs in the Eggs Benedict were perfectly cooked and delicious.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7c5sKyQk30DX2mK5tHbOkg"
  },
  "SCXhSDvYl8o8R1Vnxm--HQ": {
    "date": "3/11/2017",
    "text": "Worth Noting:  Breakfast, Brunch, and lunch only - but tons of great options. Closes at 2:30.   Atmosphere: Rustic Vibe.  Good lighting.  Porch with a garage door that seems that it will open in warm weather.  There were many different sized tables to accommodate many party types.  Cozy.  I noticed a ton of electrical outlets, so if you plan on doing work at this place  Ease of Entry:  They utilize NoWait, but there was literally...no wait.  I think it was because of today being Parade Day and people were in the city.  The parking lot is very small, so even though there were many open tables, there were only two available parking spots.    Service: As soon as we walked in, we were greeted by two different staff, one of which seemed to be the manager.  We were seated right away, food came quickly.  The waitress was attentive.  We were checked-in on by at least two other staff.  I couldn't have asked for better service at a brunch restaurant.   Food: My wife chose the Floridian French Toast.  It was a very thick brioche with wheat germ (which always throw me off...why the hell would they name it that...who every \"they\" is...I assume ties to a shortened version of germination but let's get creative...haha) and powdered cinnamon sugar - topped with strawberries, bananas, and kiwi.  It was very well prepared and presented.  The flavors and textures were perfect, as expected.  I had the Chickichanga.  I was pretty excited because I've never had breakfast style chimichanga.  It consisted of eggs, chicken, chorizo, chilies, Cheddar and Monterey Jack, onions and avocado...wrapped up in a tortilla.  It was topped with some sort of delicious sauce and sour cream.  It came with a fruit cup and seasoned potatoes.  The potatoes themselves was worth it.  I'm not going to try to describe the taste of the chickichanga, but it is definitely worth getting.    Drink: Water served in a glass milk jug.  I ordered a fresh juice - Kale Tonic - very tasty.  There were two other juices and had a very hard time choosing what to go with, but I was very satisfied with this.   Value: Our total meal came to around $25.  It was a great deal for the quality of the food, service and overall experience.    Summary: We will be returning again.  I don't know how frequently due to the limited hours and we rarely go for lunch or breakfast on the weekends.  I could see this place having issues down the road with accessibility, due to the limited parking and being on busy Route 51.  I will have a hard time choosing something over the chickichanga.  I am glad that we have an option in the south hills that isn't a national chain - and I don't feel like dogshit after eating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yRrCspjXd0q6MutDT1jegw"
  },
  "AqBoidCfKHqgWzhWZ2hOAA": {
    "date": "4/17/2018",
    "text": "The service was awesome! The waitress, Paige, was amazing! She was attentive enough without smothering us. The portions and presentation of the meals were great! The waffle was the best I've had in a very long time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2H3PyftDlizkICoTdm-4Bw"
  },
  "DkifoJaQluZgkTE_NKol3g": {
    "date": "2/23/2017",
    "text": "With most breakfast places serving processed food or with cheapest possible ingredients, it is a big blessing to find a restaurant serving fresh foods. I really like their AM Breakfast Bowl.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sBTb2BOFEbP0YHJxkb-TZw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Morning Meditatiom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sBTb2BOFEbP0YHJxkb-TZw/o.jpg"
      },
      {
        "img_id": "bEkP2JD0W14w1RGISJ8YqA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. AM Breakfast Bowl",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bEkP2JD0W14w1RGISJ8YqA/o.jpg"
      },
      {
        "img_id": "YA8didC3W-97QGCoAqfzCg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Summer Room with Garage Doors",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YA8didC3W-97QGCoAqfzCg/o.jpg"
      }
    ],
    "user_id": "jPum2OzJjg0mkvdck0--JA"
  },
  "QWNMjwkkIzLpzDe0oZhAGQ": {
    "date": "12/24/2017",
    "text": "Very much enjoyed recent visits to First Watch in route 52 South Hills location. I've been wanting to try it and wasn't disappointed. I was pleased with the cleanliness of the restaurant, friendliness of the staff and selection of breakfast options. Coffee is available to guests waiting for their table which was a nice touch!   Our food was served promptly and everything was fresh except some of the avocado on my avocado toast had already turned brown. I don't know if this was because the avocado was overripe or if it was mixed up the day before. It still edible and tasted good. I'm still willing to try it again. I highly recommend getting something from the juice bar. The chilled pear apple cider was delightful!   Prices were also very reasonable. Looking forward to trying First Watch again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "885xDDVcDe9g867BPRxfXg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Spiced pear cider special - delicious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/885xDDVcDe9g867BPRxfXg/o.jpg"
      },
      {
        "img_id": "ca8oRBhFlJC5EQ4zkaP4vg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Avocado toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ca8oRBhFlJC5EQ4zkaP4vg/o.jpg"
      },
      {
        "img_id": "x2yX9sW1adlYBmlfqWhLEQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Elevated breakfast sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x2yX9sW1adlYBmlfqWhLEQ/o.jpg"
      }
    ],
    "user_id": "mm9WYrFhiNqvHCyhQKw3Mg"
  },
  "t_NuzsO6pooniz99WNQVgQ": {
    "date": "2/19/2018",
    "text": "First time here. The place is nice and bright. They have a lot of different items that other places do not offer. They provide the calorie content on the items.  The pancakes and tacos were awesome. The staff was helpful. I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1-5dSnA9ejZj5SeUeHSbqw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1-5dSnA9ejZj5SeUeHSbqw/o.jpg"
      },
      {
        "img_id": "VjM85gYJIxROfzQWTeCgLA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VjM85gYJIxROfzQWTeCgLA/o.jpg"
      }
    ],
    "user_id": "_-Tvg5rZiPC-e-jM04DzKw"
  },
  "rn-lTCIWglvyAb5Nbfq9Tw": {
    "date": "1/1/2019",
    "text": "I would have given 3 1/2 stars but some of the issues I have are really personal pet peeves. The food is good and fresh but it is over priced and smallish portions for the price. Some may say it's worth it as you are getting a higher quality of food such as cage free eggs. You can wait a long time to be seated  and when you finally do  you most likely will end up being 6 inches from the table next to you. There are also alot of kids who act as if there are no parents in site. I thought it may have just been the time I went but I have been there a few times and it's the same everytime. I don't know what it is but I wouldn't recommend going there with a hangover as you seem to always hear dueling crying babies as well. Service is always good but this place is  also always packed. PS: Check your silverware is clean before you use it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nwWUrRCqufRCY8HxEVDkqQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nwWUrRCqufRCY8HxEVDkqQ/o.jpg"
      }
    ],
    "user_id": "q3dIqTQTC_PFk95q_aEhHw"
  },
  "2wgA3xJZPTm-a_W09no1tw": {
    "date": "10/17/2017",
    "text": "We love the seasonal menu and all of the yummy options. Choices for everyone from kids to picky eaters! They always seem packed so use the no wait app to jump in line, it will for sure save you time. I love that they give you a to go cup of coffee if needed!  Service is pretty fast and efficient.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pCgozlpamuAe2vU575TBEw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Pumpkin pancake with bacon and fried egg ! Yum!!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pCgozlpamuAe2vU575TBEw/o.jpg"
      }
    ],
    "user_id": "RkLluG0LGXiJgf2i9dGmDQ"
  },
  "XT9savh4PeKWe1xPvEk4rg": {
    "date": "1/14/2019",
    "text": "This is my favorite place for breakfast. I come here alone, and I also love to bring my daughter, my boyfriend, my mother and my great grandmother and they all love it. Even my daughter asked me if we can keep coming back. This place was recently revamped on the inside, and the menu is revamped every season with fresh ingredients. The waiters are great and the restaurant is so beautiful ! It is however almost always busy, especially on the weekends. But if you wait in the lobby, the offer coffee and water. Or you can give them your number to text you when your table is ready, and you can walk around the plaza! You should definitely go here.for breakfast! My favorite thing to get is the kale tonic. It is so refreshing and I crave it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ETYOL37DPGdRVii6lMcLiQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Steel cut oatmeal with a banana nut muffin.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ETYOL37DPGdRVii6lMcLiQ/o.jpg"
      },
      {
        "img_id": "isvKyahywKg4UEKhxiMe3A",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Fruit crepes on the kids menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/isvKyahywKg4UEKhxiMe3A/o.jpg"
      }
    ],
    "user_id": "z9Fa7_RsEdc-OjtKE8F8Hw"
  },
  "36AfPqP3Q1CmsqSeWQ9tfQ": {
    "date": "7/12/2017",
    "text": "Came here for the second time and finally got to try the French toast! So worth the wait! The pieces of French toast were huge and I got the fresh fruit on top. Delicious. Their turkey sausage is better than any sausage I have ever had. Also, they have a new summer fresh juice that is fruit based rather than vegetable. In my last review I stated how I would love an all fruit juice, they listened! Love that.  Yes, it is pricey. $40 dollars for breakfast is a little over the top, but I promise you will not be disappointed in anything you have there. Splurge and go enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "eY8pzn82zhVO95vBi-mzkQ"
  },
  "06GdvgK50VIzLaf654Y82Q": {
    "date": "3/27/2019",
    "text": "I'm going there for a few years now that was have a healthy breakfast juice if you're into juice and and it's a good place the breakfast it's not your typical fast food",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ee-7uAMeO9kqvQ93gGmPbw"
  },
  "S6SmXXjqDp-6c_9tCOX4CA": {
    "date": "7/1/2017",
    "text": "Second time here was even better than the first.  Their seasonal menu has barbacoa benedict which is amazing.  The meat was cooked perfectly and went perfect wth the rest of the usual eggs benedict ingredients.  My wife got the French toast and they were great as well.    Service was fast and our server was very friendly.  Will definitely be returning soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z2YU860tfm4gRjmYMdYoIg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Barbacoa Benedict with potatoes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/z2YU860tfm4gRjmYMdYoIg/o.jpg"
      },
      {
        "img_id": "aJqoKnAAKpHVwbSvdRryhQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Chocolate milk and their seasonal summer fruit drink",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aJqoKnAAKpHVwbSvdRryhQ/o.jpg"
      }
    ],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "LbQ0odeCyhZX003m67ZJfg": {
    "date": "2/10/2019",
    "text": "Overpriced because the food is not that great. Staff is aloof and atmosphere was just eh.  I only tried breakfast but after the experience I'll pass on attempting lunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "okiRQ5KZtiJJnQHZC0zajQ"
  },
  "5e8gBjlrht3rDi3C650QIQ": {
    "date": "12/30/2016",
    "text": "Found this new breakfast spot on 51 and I love it!! It's a chain but it doesn't feel like it, lots of cool options for breakfast and lunch. All the items are healthy and seemingly fresh made. It's a very cool concept that I imagine will be a model for others, open for breakfast and lunch, and that's it! Do one thing very good instead of a bunch of stuff half way. The menu has lots of healthy delish options, plus fresh made juices. We sampled the carrot orange ginger and it was excellent! I had the avocado toast with egg on homemade toast, it was very good My wife had the power bowl which all fresh made with fresh fruit, and a large banana nut muffin that had to be taken home. They also leave you a carafe of coffee at the table! I know there are at least three locations on the area, the one on 51 in Brentwood, one in Bridgeville, and one in Robinson!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "dKe4CBwpSt8JQz80siDRvQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Now that&amp;#39;s love!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dKe4CBwpSt8JQz80siDRvQ/o.jpg"
      },
      {
        "img_id": "VqROkfW6-ED2TvOnja6X8A",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. The avocado toast with perfect dippy eggs!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VqROkfW6-ED2TvOnja6X8A/o.jpg"
      },
      {
        "img_id": "RAo0apPcuK_CSAAh4A5GoA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. The fresh vanilla yogurt with fresh fruit and granola and a large banana nut muffin!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RAo0apPcuK_CSAAh4A5GoA/o.jpg"
      }
    ],
    "user_id": "eJbN3c794MNnV5cKHBoTnQ"
  },
  "Sj0Nih9jgQ2ChFDYIMc5uQ": {
    "date": "12/6/2016",
    "text": "I rarely give 5 star ratings, so this is a really big deal.    I was immediately greeted by a smiling female, Hannah. She's a manager at the Cranberry location, where ML and I eat before church on Sunday.  My server, Raeleen (Rae), promptly took my order and brought me a coffee carafe, poured a cup, and took my order. I had the Eggs Benedict Florentine, which I've had in their Cranberry restaurant. It was fresh, nicely presented, and delicious. They are consistently good.  The eggs were perfectly cooked, the spinach, tomatoes, and avocados so fresh, I wondered if they had a garden in back.  They bring coffee in a carafe, which stays on your table. As far as I'm concerned, they can do no wrong after that (there are days I want to use my EMT/Paramedic training, and hook up an IV of coffee).They also do the same for water.   I was able to talk with Rae, and Margo, another server, both of who told me they truly love working here. No need. It showed. Infact, Rae said this was her first time being a server, which was surprising; she's a natural. Margo was obviously  experienced and tremendous. Attentive, friendly, but not intrusive. The man I assumed was the GM never approached any diners, nor smiled, but everyone else had genuine smiles,and was very friendly, but not intrusive. Actually, the GM smiled warmly, as he held the door open when I left, wishing me a nice day.  This is casual place, but you'll feel very welcome and at ease dressed up.   It's\"s well-lit, and spacious, with solid wood tables and chairs,  nicely padded benches. I noticed and appreciated the reclaimed wood framed, tilting mirrors in the ladies room.  Their holiday promotion sweetens the experience. Buy $100 in gift cards this holiday, and get $20 Bonus Bucks. They come in any denomiation, starting at $5.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 10,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "gl5EH3WCytpUMckknNLtiQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Eggs Benedict Florentine, presented by Margo, an outstanding server.You can substitute the fresh greens, n/c. Try salmon version, too.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gl5EH3WCytpUMckknNLtiQ/o.jpg"
      },
      {
        "img_id": "ozZYSOLiRP4Nw3NRfhQzIw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Any restaurant that leaves a carafe of coffee and a bottle of water on my table has my vote.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ozZYSOLiRP4Nw3NRfhQzIw/o.jpg"
      },
      {
        "img_id": "zS6yIFzpeTR5FQbvNchXjw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Separate meeting/party room in background, past the glass.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zS6yIFzpeTR5FQbvNchXjw/o.jpg"
      }
    ],
    "user_id": "wrUYC0wc987XBBAoskOCHA"
  },
  "XHku_2VwUWXmGOejZDiB8A": {
    "date": "12/18/2016",
    "text": "I noticed First Watch on yelp, and was eager to try it.  I really like things like quinoa and good oatmeal and freshly made juice.  I decided to try the quinoa breakfast bowl.  It includes Italian sausage, which I did not want but figured I could just not eat those pieces. There are also two eggs on top and olive oil.  I actually didn't care for it. I didn't eat the sausage, but the olive oil seemed unnecessary and left an oily feel in my mouth for 30 minutes or so.  The mushrooms and tomatos were good though.  I would ask to hold the sausage and olive oil.  My companion had the traditional breakfast which included a blueberry pancake and he thoroughly enjoyed it.  The coffee was also good, but in spite of them leaving the carafe at the table there is not enough in the pot to refill two cups.  The space is nice, and other options on the menu sound good and I look forward to trying them.  I would like to see some nutrition facts on the menu, especially for the items in the \"Healthy\" category.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Gq4tiKOj021wamM4aekNmQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Gq4tiKOj021wamM4aekNmQ/o.jpg"
      },
      {
        "img_id": "QJvSXeMU_QybbYi97yJKSA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. So good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QJvSXeMU_QybbYi97yJKSA/o.jpg"
      },
      {
        "img_id": "2OCklgNYuqBbyHalpV06rA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Way too much ice for $3.99.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2OCklgNYuqBbyHalpV06rA/o.jpg"
      }
    ],
    "user_id": "QYKexxaOJQlseGWmc6soRg"
  },
  "HQdfhT_ew1D8URPcKMqKKg": {
    "date": "12/20/2018",
    "text": "I've previously had some pretty bad experiences with first watch, but this past time I was here was outstanding. We were seated immediately and our waitress arrived shortly after they give us our coffee and waters. She was so pleasant and so attentive! I wish I remembered her name because she was without a doubt the best server I have ever had there. I got the avocado toast with the avocado and eggs on the side (because I don't like too much avocado). I was expecting them to somehow mess the order up due to previous experiences here but it came out and it was perfect! the eggs were cooked to perfection and the whole meal all together was amazing. Our server kept our drinks full & checked in frequently. This time around was outstanding! I made sure to tell her what wonderful service we had and went on our way. I hope I have another incredible experience like this again the next time I come!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uvRTbrifQLVWe_ultDd12Q"
  },
  "Mg_PW0fBICtc2EVi-zYmrw": {
    "date": "11/12/2017",
    "text": "Excellent breakfast and all around experience here. I was seated quickly because I used the Yelp Waitlist feature. I would recommend this as it was very busy. I had the fresh pear cider, avocado toast, and a side of dressed greens. Everything was great and I ate every bite. The food was fresh and the portions were good. It is definitely a $$ breakfast spot. My breakfast was $20 for one person. You could do it for less, but there was a lot I wanted to try. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Md07XvRD-21IZmh7cb11-A",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Side of lightly dressed greens- perfectly dressed!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Md07XvRD-21IZmh7cb11-A/o.jpg"
      },
      {
        "img_id": "bNIJS4iFuK9cEVawMleomg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Chilled Pear Cider- excellent!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bNIJS4iFuK9cEVawMleomg/o.jpg"
      },
      {
        "img_id": "z6I_hzz16qIzvHGBVCv0cw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Avocado Toast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/z6I_hzz16qIzvHGBVCv0cw/o.jpg"
      }
    ],
    "user_id": "N8XXNR8bGMFWF1G4FKVV2g"
  },
  "TXsJH4T5H5AAZ0P1Ut3T9A": {
    "date": "1/21/2018",
    "text": "Food is really good and servers were very friendly and caring. I enjoyed the morning meditation juice and the huevos rancheros... tasty!! Reason of only 4: Hostess/cashier - I almost left, not so welcoming",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "URsybOrvvp4M4jq_zAF_bg"
  },
  "LSLRpNaxHu6k9VUVvoRXLQ": {
    "date": "9/16/2017",
    "text": "Arrived to a packed house on a Saturday, we were seated promptly on the \"porch\" which had opened garage doors for a more outside vibe. We ordered iced coffees and were served within 5 minutes.   Food came out fast as well! Service was great and food was really good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "tDxuXnn6RWysmiQztTGXSg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Skillet Hash- Parma",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tDxuXnn6RWysmiQztTGXSg/o.jpg"
      },
      {
        "img_id": "kGU2DLgDhcb25foFpOS6Xw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Really dig the garage doors and outside feeling",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kGU2DLgDhcb25foFpOS6Xw/o.jpg"
      }
    ],
    "user_id": "zHHfb4sap9FNavFN_33rqg"
  },
  "6A4spx48ZFmu-pyGleqVcQ": {
    "date": "11/4/2018",
    "text": "I like the atmosphere, but sadly it was the last time I go to First Watch. The service wasn't good. I feel like I shouldn't have to stare at my empty plate while my server walks back and forth past my table. She gave us our check and didn't bother to check on us at all afterwards. She didn't give us our coffee and water until I reminded her in the beginning, and again just didn't give good service. I expect better service at a place that seems more premium than other breakfast spots, therefore, I'll spend my money elsewhere and save with better service. I had an issue at there Bridgeville location with rude staff, the manager tried to reach out to me but failed to provide a way to contact her.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSa7JJgMsnIALQcvqIzeXA"
  },
  "rVNZYMBJWGepNKjJLUUTNA": {
    "date": "9/9/2017",
    "text": "I love First Watch. This location is never crowded when I go. I don't even need to use the No Wait app (but you should still check the wait time beforehand).   There is a gender neutral bathroom!! Yes!   Also, there is a cute sitting area that features two garage doors and appears that it could let in the nice weather (if this wasn't Pittsburgh).  I like to sit in the high back green booth-sofa things. It just makes me feel regal.   This location is full of babies. Every time I come here there are 2-5 babies in carriers. Most of them a good and quiet (must be from the soothing pancake smell).   I'm easy (like my eggs) and I get the same thing EVERY TIME: Tri-fecta with seasonal pancake (small upcharge FYI). House coffee is great and hot and fresh. The iced coffee is creamy and sweet.   I've never had the same waitstaff, but everyone is generally sweet. On a weird note- last time I visited (today) the waitress kept addressing myself and my uncle as \"Ladies and gentleman\". It was very awkward, as I am not a lady and there were only two people in my party. No harm done though, so 5 stars!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "0bJOdJah9UAUHND0j7NO_g",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Trifecta with Pumpkin Pancake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0bJOdJah9UAUHND0j7NO_g/o.jpg"
      }
    ],
    "user_id": "Kw5RHGNWA3ByBPzMv5oaRg"
  },
  "kbiO8GksO_yQumXCfIEZTQ": {
    "date": "3/12/2018",
    "text": "Delicious! Everything I've tried so far is great. The avocado toast is my fave, love that it includes eggs! Very filling! Their chia pudding, pancakes, and skillet hash's are also all delicious! The fresh preserves are amazing and the potatoes are a necessity as a side! Service is typically very sweet, prompt, and attentive as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EOxmDIA_t5lcBWeYyOv9vw"
  },
  "_OaKb9-dYZoCGGCkEhqRuA": {
    "date": "4/7/2018",
    "text": "My wife and I were headed to eat'n Park when I said we should hit First Watch we haven't been there in a while, so that's what we did, she had the traditional breakfast I had the Power Bowl , quinoa, Italian sausage , roasted mushrooms and tomatoes, it is not only healthy but also delicious, although I did add an order of bacon as well , they have some of the best bacon around, my wife says she thinks it taste like the bacon we buy at Weiss meats , all I know for sure is I like it , the service here is always fast and very friendly, food is so fresh , and prices are not bad at all, much better than breakfast sitting in a warmer box ,",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpkJOFJhMVJkiJgixyqe-Q"
  },
  "wR9LLDPHB28srR6zcEiBng": {
    "date": "8/14/2019",
    "text": "Other than the parking can be difficult, I love this restaurant! I added my name to the waitlist through yelp which was easy and convenient. When I got there they checked me in and we were seated about 2 min later.  This was my first time here for lunch and I was not disappointed. My friend and I both ordered a half sandwich and half salad. Both half's were still a nice size and I did not leave hungry. The Sweet honey pecan salad was absolutely delicious! For my half sandwich I got the Monterey club (minus avavado and tomatoes) and that was delicious also. And a great price for the lunch! The place is always clean and the wait staff friendly. My friend and I got to eat some good food and visit with each other and I never felt rushed to leave. We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g2ZURtSe7TGook2rVS_3rQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Monterey club",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/g2ZURtSe7TGook2rVS_3rQ/o.jpg"
      },
      {
        "img_id": "4vFBQmESknqGGl8NMVteJA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Sweet honey pecan salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4vFBQmESknqGGl8NMVteJA/o.jpg"
      }
    ],
    "user_id": "W8EAuJDTuy9foHWGvoyGxg"
  },
  "5nmy4w1zgsqvlgdZZEfE4A": {
    "date": "8/12/2019",
    "text": "I actually can't believe I haven't written a review yet for First Watch. I can't say enough about it - it is my favorite breakfast/brunch spot in the area. I really appreciate the almond milk coffee creamers, the jug of water and jug of coffee right at your table without having to ask for more. (Side note - their coffee is arguably better than Starbucks, I love it). The atmosphere is just really relaxing and appropriate for a daytime cafe. I can tell a lot of others enjoy it as we often have to make up a parking spot as the lot is always full at both locations near me. The staff has always been great even at busy times and the prices are very reasonable. I only paid $21 (+tip) for my son and I for breakfast recently.  This past weekend I got the Cornbread Carnitas Bowl on the summer menu. I really hope this dish isn't only during summer as I fell in love with it. The cornbread is toasted and the carnitas are so tender - it just melts in your mouth. The photo I am posting speaks for itself. Everyone should go here, it really can't be beat for the healthy options and prices!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GJKFQOwCrXeZ7Y0SYjGi5w",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GJKFQOwCrXeZ7Y0SYjGi5w/o.jpg"
      }
    ],
    "user_id": "5ZjR1N8FC5tYmpihaLd0gg"
  },
  "wseL7Sb5oG2yPZb3Los7mQ": {
    "date": "7/20/2019",
    "text": "I have ate at a couple first watches across the country and this one nailed it.  Decor/service: all excellent, the only Mini problem would be the one sitting area the AC was working so it was hot but they made the smart choice and were not sitting people there.  Food: the egg white omelette was perfect and the million dollar bacon was some of the best I have had. The waffles were very good as well. Nailed everything.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3n0_L8nKX4LcQG1yF61wtA"
  },
  "rSVOOkpPrKzK_fO9RjaE2Q": {
    "date": "5/11/2019",
    "text": "Very nice large venue.  Open, modern farm style setting.  Good parking.  Got the Floridian French Toast (again) and my friend got a frittata.   Not that any place has control over this but the ratio of kids to adults was overwhelming.  Not a big deal until you have two or three kids screaming together and the parents aren't doing anything about it.  High pitched screams are so painful when you haven't even had your first cup of coffee.  Anyway - that aside, the food, staff, and service were great.  BTW - I wish other restaurants would provide WARM syrup with breakfast - simply brilliant.  YES!!!  Early Sunday morning breakfast.  Got there right before the rush.  Got the eggs Benedict carbonara - OMG it was amazing.  Huge pieces of delish bacon with two perfectly poached eggs.  Friend had the biscuits with gravy and two over easy eggs.  Love this place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hY5gIQY5yax03vGON05g_w",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Lemon ricotta pancakes with bacon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hY5gIQY5yax03vGON05g_w/o.jpg"
      },
      {
        "img_id": "UWuf488--NvDHMLInlsJLw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Eggs Benedict Florentine - eggs were over cooked but otherwise good",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UWuf488--NvDHMLInlsJLw/o.jpg"
      },
      {
        "img_id": "wxXofsDiVmqbkxVZWPMPMg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Hacienda Hash",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wxXofsDiVmqbkxVZWPMPMg/o.jpg"
      }
    ],
    "user_id": "VblVPsnCGff5a9MF6HGouQ"
  },
  "zbh4JNFRxmEDd3hKzqaRaQ": {
    "date": "7/8/2019",
    "text": "This is the perfect brunch place and I absolutely love it because they have a ton of healthy options and give you the calorie count on the menu for every item. This place also has a ton of vegetarian options as well. This is my first time coming here and I will definitely be back. I got the breakfast tacos. They were amazing and I almost couldn't finish them all. This place gets packed quickly and parking spaces are hard to find if you come between 10-12. Their app is super helpful though. You can check in online so you won't have to wait in the restaurant. If you register your email with them online, you get a BOGO on your first visit. Give this place a try if you haven't!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pw7KdEJtJ1OvQvlxt9j-kw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Breakfast tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pw7KdEJtJ1OvQvlxt9j-kw/o.jpg"
      }
    ],
    "user_id": "I4BVS9Kkw52Xj6k3nTEuPw"
  },
  "5zjMkuJESxNUbhSFI9cPzw": {
    "date": "6/19/2019",
    "text": "Breakfast/ Brunch food always warms the soul, and First Watch does NOT disappoint! First Watch offers a diverse menu packed with healthy, friendly options! I really loved that, even the coffee offered, had almond milk creamer. The interior of the restaurant is inviting and the staff are quick and polite. You could dine in with a party of all sizes. The food itself was very delicious as well! The elevated egg sandwich had everything you could want (egg, bacon, avocado, mayo, greens) and they so easily removed the cheese upon request. Overall, I had a lovely experience at First Watch. I would undoubtedly recommend here to anyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T9yFs4Dwn0ixRKg66VQ4Aw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Elevated Egg Sandwich, First Watch Potatoes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/T9yFs4Dwn0ixRKg66VQ4Aw/o.jpg"
      }
    ],
    "user_id": "VdVb5Eipk1B5uupaC3J_0Q"
  },
  "IPjcUFkZYskjLlONUKmvsw": {
    "date": "5/12/2019",
    "text": "I got the Power Wrap. It was a very solid, healthy breakfast option. It could have used a bit more flavor overall, but I did enjoy it. The pick de gallo certainly helped.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "b69oHfyaC0KOHDJaFXFHYQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Power Wrap",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/b69oHfyaC0KOHDJaFXFHYQ/o.jpg"
      }
    ],
    "user_id": "oK1NSmUfBepjuD8RWHKMcA"
  },
  "skbHfwe1kzzuKiwtScTO7w": {
    "date": "7/17/2019",
    "text": "My waitress was Raili.  She really was solicitous of my comfort, bringing me fresh half & half, stopping to chat because I was alone that day, and advising me about the menu based on MY needs, not her own. It is a great place to get coffee and just chill & check email (free WiFi). They have good food and nice people.  I complemented my server to the manager, and he immediately went over and complemented her in front of the other servers. No wonder the service is so good!  I was going to go to Peace Love & Little Donuts, but I passed by this place and realized I craved meat & eggs.  I wasn't disappointed, and I started a very busy day with  a hearty, traditional breakfast. The sausage was tender and rich, the eggs were cooked perfectly, and so was the bacon. Coffee was about average, and I was slightly disappointed that they didn't have heavy cream.   I had them make me a big cup of ice water to go so I could get my errands done in this oppressive heat. They have a gender- neutral restroom, but they also have a ladies' and men's room, which I prefer.  So glad I passed on the donuts!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jHXbJ21UUhLKRP9Obl0WjQ"
  },
  "x6maw66qB_sAYJhS__1yrg": {
    "date": "6/24/2019",
    "text": "Just came back from breakfast here and all I can say is wow! Its our first time here and I am sorry I didn't try it sooner. Ive driven past countless times and it is very misleading. Its an unassuming building that is easily missed. It almost looks vacant sometimes. Today changed all that. My daughter stated many times that she wanted to check it out but it always looked closed. Even this morning as we pulled in she said, \"wait. Is it open?\"  The outside is no indication of what awaits you inside. The atmosphere and decor is beautiful and very cozy. Its fairly large and spacious with big comfy booths. I loved it straight away! But the best thing is the menu. There are so many choices with interesting dishes. I had the Summer Crab Omelet which was cooked to perfection. No browned crispy egg here...phew! It had lots of fresh crab and perfectly crisp, not mushy veggies. It was different and so good! My daughter loved hers too. The potatoes are to die for. Seriously everything...the toast, strawberry jam, the coffee. Just excellent! Our server was so pleasant and efficient. It was one of the best restaurant experiences ever. If you haven't yet, just go. You wont be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "28ACaxqGr8h6Q_Tp58PAdw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Summer Crab Omelette",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/28ACaxqGr8h6Q_Tp58PAdw/o.jpg"
      },
      {
        "img_id": "32gnjii9MxUbELnPWnxhtA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/32gnjii9MxUbELnPWnxhtA/o.jpg"
      },
      {
        "img_id": "YEF7wjtpOHrMqwu4DiyS8g",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Summer Crab Omelette",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YEF7wjtpOHrMqwu4DiyS8g/o.jpg"
      }
    ],
    "user_id": "su2CyB0HkROxMYxURGvLxw"
  },
  "vUWFp5Mh7ktHDmO16FECZQ": {
    "date": "9/5/2019",
    "text": "I always go to First Watch when I want a really good breakfast, especially a healthy one. I love the large menu and the seasonal items. They have great omelettes, potatoes, bacon, greens, and artisan bread. And of course the pancakes and waffles are delicious too. I also love that they leave a whole pot of coffee at the table to enjoy at your leisure. Just an overall excellent experience every time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K4wGmMNmLp_qNeIV8FyRGw"
  },
  "VeJw-nTdFvHkrb5TKZvLRA": {
    "date": "8/21/2019",
    "text": "This place has decent breakfast foods. I don't quite understand the hype behind it. If someone were to invite me to breakfast I wouldnt say no but this wouldn't be my first choice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Igx-mFNdq_yx1ifTfevYaQ"
  },
  "I8RE1ABtYREjC0qvZ5smzQ": {
    "date": "8/13/2019",
    "text": "First Watch should be your last stop - they are NOT fresh ingredients- it's prepared food and filled with msg and trans fat",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VWmox-R0b2-RaWxkctlzJw"
  },
  "v0X6xac0gr8i_kV_1_0WaA": {
    "date": "1/11/2019",
    "text": "Loved it!  Farm to table ingredients! Delicious!  Service was fast and friendly!  Prices are reasonable!  Options are diverse for breakfast/brunch options!  This is the place to stop before a Saturday or Sunday shopping stop! Do it!  Eggs and bacon was for me on this stop!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FjVhPk6SVoWGhlQF0ZpXRQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FjVhPk6SVoWGhlQF0ZpXRQ/o.jpg"
      }
    ],
    "user_id": "M_vIHwPO3uw4uxFwSEz4Ww"
  },
  "abJTyxojzaBzN5DaATVqFg": {
    "date": "5/28/2019",
    "text": "Great place for breakfast/brunch! Reasonable prices, great food, and such a cute venue!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LB3sh_vKYl1661U5pdwpmQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LB3sh_vKYl1661U5pdwpmQ/o.jpg"
      }
    ],
    "user_id": "boXzoC7IrbgCgrlFyu0Wdg"
  },
  "Ef3zhRF-T6zllCuOmbSdWQ": {
    "date": "11/7/2018",
    "text": "Every location I've visited is fantastic. And every plate I've gotten is great. Everything seems to be fresh, homemade and yummy. They always seem to change up the menu too! Definitely check this out if you're in any area that has one. Though they're a chain restaurant, it doesn't seem that way.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vnjPenW2Shyz8Y2H1ZHrsg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vnjPenW2Shyz8Y2H1ZHrsg/o.jpg"
      },
      {
        "img_id": "1DmvrY9gxXU67z2rkPk3RQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1DmvrY9gxXU67z2rkPk3RQ/o.jpg"
      }
    ],
    "user_id": "LC1N1SFW-MaLWiq6Du1oCQ"
  },
  "rTVgDTVs0sbsX3-uuHc-6A": {
    "date": "6/27/2019",
    "text": "Staff is Amazing as well as the food!!! Very well run establishment.  I have eaten there numerous times and grab takeout regularly and have never had a bad experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KE8iBWaiE5Y7Wktb9JklFA"
  },
  "p3xblap2lhcEAp8q8PobUg": {
    "date": "7/7/2019",
    "text": "Quick service, very friendly and accommodating. The waitress was pleasant for us walking in at the end of her shift. Even though we waited a little longer for our whole party to arrive. The food was good, with a variety of options to choice from. Can't wait for the next visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4hUUCINvV-fEXEncVhSYpw"
  },
  "Q3cnkhwMr0K6iMgKRbcSoQ": {
    "date": "9/1/2019",
    "text": "So I went to first watch with a group of friends and the service was honestly horrific. Our servers name was Jordan and we sat there for like 15 min before she even came over. She took our order but didn't offer us any drinks. We didn't even receive the water jug you usually receive when you first sit down. So after another 15 minutes of her not coming over or acknowledging us we went over to the complimentary water station and filled styrofoam cups with the water. Our food was then brought out by two other people and we politely asked them for some water. And then we finally received some halfway through our meal. After we received our food we weren't given any napkins and no one came over to check on us. I'm just confused on why weren't asked what we wanted to drink right when we were seated. Like that's kinda what the waitress is supposed to do. And napkins are also kinda very important. I will say the bad service was made up for when we left. The manager there was so kind to pay for our food and was super apologetic.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JgfZDfAeUH9K-moPuI3cfg"
  },
  "7rAcG29ZDdkbVQA69D3_0g": {
    "date": "7/18/2018",
    "text": "This place is relatively new! It only stays open until 2:30 every day! But the food is healthy, delicious and fresh!    My Aunt Ina treated me to lunch today! They have a very varied menu with something for everyone!   Quaint decor, bright and sunny with pleasant servers I would recommend this unique cafe to anyone! Give it a try!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vzgZKCtWE-DRRwTSnwh8eQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vzgZKCtWE-DRRwTSnwh8eQ/o.jpg"
      },
      {
        "img_id": "2mnJzL-7n1lwBOUkH8W4hw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2mnJzL-7n1lwBOUkH8W4hw/o.jpg"
      }
    ],
    "user_id": "tC7MoM-Hes2cKl-s_4JIMg"
  },
  "9Qo2B2ST5wumsl7ubpv3kA": {
    "date": "12/29/2018",
    "text": "Finally I stopped by to check out the First Watch on 51. I've driven past it MANY times, but never wanted to stop by on the weekends because it can get really packed here. When Brendan & I had a random day off during the week, we decided it was the perfect day to finally check out First Watch. We were sat immediately, and had incredibly prompt and friendly service. We both started with coffee, which was pretty good. I was super psyched to see Silk almond milk creamers on the table- the world is a-changing! I prefer almond milk to dairy, so it was nice to have this option for my coffee on the table, without having to make a special request. The menu here is pretty big! I went with a breakfast sandwich- the elevated egg sandwich. It was packed with flavor. The potatoes it was served with were very seasoned and tasty too. Brendan also loved his food. Before we left, our server asked us if we wanted to-go cups for our coffee. I really appreciated that she asked and we did just that! Overall, we loved it here and will return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "obzmXtnG43qHMWnwRSPqxw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/obzmXtnG43qHMWnwRSPqxw/o.jpg"
      },
      {
        "img_id": "z6eL2543MlfThlPxhOpkwg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z6eL2543MlfThlPxhOpkwg/o.jpg"
      }
    ],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "jil3mM8DT0qxYnbEJ7WEgw": {
    "date": "12/27/2016",
    "text": "Maybe they were having a rough day, but multiple tables have been open for 30 minutes and they are having trouble seating people. Also having trouble bussing tables, bringing out food, and checking people out at the cash register. No one seems to have a defined role, but they are all doing everything. Maybe that adds to the chaos. It gets frustrating to see 8 open tables for 30 minutes with NO ONE getting seated at them. I am chalking it up to it being new, but this place is a hot mess disaster.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "16-ZNwbZ2cYE06RdTqjdMw"
  },
  "dg5zEslXFrHHfZkQSnr8DQ": {
    "date": "2/25/2017",
    "text": "At good places you wait. There is free coffee. The herbal hot tea  has many great selections for you to choose.. The Floridian French Toast was tasty . The seasoned potatoes were good and not greasy. Rae was an excellent server. The parking lot was filled. Not a problem. The beet, carrot, and kale drinks will be tried next time. Thumbs up here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zz0dv3MgXz93gDOooW9JcQ"
  },
  "xyXTGikxnScdLaw6bIAICA": {
    "date": "2/8/2017",
    "text": "The food is amazing and fresh and healthy!!!! Can't wait to try one of the juices next time. Our waitress Courtney was so sweet! I asked what she recommended off the menu and she face an excellent choice. The avacado toast and eggs yummmmmm",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7b9lwctCd7RrH1TslR6jxg"
  },
  "_In74KS1kgfrjX33S2b_hA": {
    "date": "12/31/2016",
    "text": "Must try.  Nice place to enjoy breakast. Great addition to neighborhood. Friendly staff. Great breakfast .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-5-D0LcL3WLuYwA4kZ6rIw"
  },
  "6X4LGIG-dv54Y8SF4nYn7w": {
    "date": "12/27/2016",
    "text": "Great food, slightly overpriced for what you get. Our service was very slow but that's because our waitress seemed to be serving half the Resturant so not entirely her fault.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JxpJaHJb3bAi34bRdserLQ"
  }
}