{
  "Bd0FcKXw1-BPfCGdCEnsVw": {
    "date": "2/28/2013",
    "text": "A nice little Mom And Pop place with good old school Italian food.  Stop in some time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "21W8iTZGWdCk1utgudcToQ"
  },
  "PH41qdysinGhW9iRqQxqcw": {
    "date": "5/27/2012",
    "text": "Went here last night for the first time. Didn't have trouble finding a parking spot but I can see how it could be tough to park at times. Menu has a great selection of Italian entrees and sandwiches. I got the meat lasagna dinner, which comes with a huge portion of lasagna (I took half home), soup (wedding soup was delicious), garlic bread and a house salad. Food was good, hearty and filling. House shiraz was good and house wines at less than $5 a glass is a big bonus.  Desserts looked good but we were way too full to consider. It was a little crowded and the dining room was a little warm but otherwise a good dining experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "giSatrGnU8-wqOL02MxBtA"
  },
  "VRllZ5JYL9BpV85_AvOGIw": {
    "date": "8/24/2013",
    "text": "Impressive selection. The in-laws favorite place. Fast. Fresh. Homey atmosphere. I was not disappointed and did not leave hungry!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BxglbjzMOMbVkis_9gFTfQ"
  },
  "XBKLNdct-ijVl-DQbWMdZg": {
    "date": "5/21/2009",
    "text": "I agree, this is the best Italian restaurant in the Pittsburgh area. I think it is because they aren't in it for the money, they are in it for the convenient cash flow.  Prices are incredibly reasonable, and every dinner comes with garlic bread, wedding soup or soup of the day, salad, and a side dish as appropriate. It would be worth coming here if they added $8 to the price of every dish, but most meals are under $15. I'd like to try the Italian Hoagie sometime but I have always gotten a dinner.  Entrees are big and uniformly delicious.  Chicken and veal parmesan are excellent -- it is cooked so the breading remains crispy even under the melted cheese and sauce. Everything is good.  It is crowded during the evenings. You need to make a reservation. Definitely worth the drive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "UYub3BC9K_PbQ0tGShN2-g"
  },
  "kW_SXfkJhBNB06vWzTs7KQ": {
    "date": "5/7/2007",
    "text": "As this is probably on of the best Italian restaurants in Pittsburgh, I am so surprised I am the first to review it.  From what I gather, it used to serve only connected clientele.  But these days any don pretender can sit down and have an excellent feast.  Wedding soup is excellent, as is the eggplant parm and the lasagna is superb.  It is a drive, which keeps it a secret I guess.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "otCGq7DjX08YJFChnRhLaQ"
  },
  "BqDnUrNbw6jZX5wE_bOdaw": {
    "date": "6/7/2012",
    "text": "The place is always packed. People love the food. My opinion is the food is good, not great and its not the nicest place you can go. The prices are cheap and portions are nice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VLon_YAkryfzWg61vXloZg"
  },
  "alI80URJPVzPtgYB-dkJLg": {
    "date": "9/15/2013",
    "text": "Our go to place when we don't feel like cooking! Great food, huge portions, low prices! You really can't beat it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bM55XIkbT7g43fcuE8ebJw"
  },
  "JiwczySiuKQhieKUyXUKUg": {
    "date": "2/24/2010",
    "text": "Great Little Italian restaurant. We have gone here many of times and everything we get is wonderful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2CZmJp_S-DCh-CvII15xxQ"
  },
  "ltTb3Er3d2lHY1P48OcIBA": {
    "date": "10/21/2012",
    "text": "Best authentic chunky herbal Marinara sauce!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rAZmKHxKvC0ArqXbGlPXaQ"
  },
  "z1usktGr6eHTcxdftuHzfA": {
    "date": "6/7/2015",
    "text": "There's a ton of pizza/hoagie joints in Pittsburgh, but not much in the way of actual italian cuisine. This place hits the spot each and every time. The wedding soup, salad/bleu cheese, bread, stuffed peppers, and fettuccine alfredo are all fantastic. Its so good infact that i drive here from the south hills when im craving real italian dishes. Good value as well. I always leave here with half my meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CR0D39AqYLrClEpLU31OkQ"
  },
  "VLraAWSu27AHAb2IW5zJUw": {
    "date": "9/21/2015",
    "text": "The Village Inn by far is the Italian Restaurant in Pittsburgh. I don't care about ambiance, it the food that matters. Many slick place have a huge price and the food is here horrible. The wait staff are deft and friendly. Try the veal Romano its huge and delicious. A salad, soup and their delicious bread accompany your meal. Many restaurants cut that out completely are now considered ala carte. Pasta with a huge amount of porabellas on top is another favorite of mine. Make reservations for the weekends or evenings as it is a very long wait. bona Petit!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R__MXgbUAQ-lNIzRElrhYQ"
  },
  "FjdluERSFfKP7ErDzBiiJQ": {
    "date": "9/12/2014",
    "text": "I can't imagine how anyone can give this place a bad review. Yes it's small,outdated and is always busy but who cares about any of that. The food is great and you will not leave hungry. Homemade soup and salad with every meal! Appetizers are great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9MLQ5N8t9GbcDsG75uBqFQ"
  },
  "otxkb7-PkVMagJCEMwpZ_g": {
    "date": "3/3/2017",
    "text": "went after 3/1/17 re-opening. liquor license yanked, no veal, and parking still stinks",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-6mTytCeK7KwMxdtzyyzDQ"
  },
  "jRqCZI3Xf9UEE0qq8R6MMA": {
    "date": "8/7/2015",
    "text": "The food here is excellent and they have a great wine list! It's a treat to stop here whenever we are in Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3vYh8O9TnZa8jjUgutXHGw"
  },
  "k0X2Q7mkBdzoXrDdSE3eog": {
    "date": "6/5/2015",
    "text": "The bruschetta was good. I tried the Chicken Neptune and it was delicious. The linguini was cooked perfect. Took 1/2 the dish home with an extra side of linguine since there was so much chicken, shrimp and mushrooms left.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H1VpBGsloCGjKiMUhW3L-g"
  },
  "1POGCkcXkLpaILa5EtxceA": {
    "date": "6/3/2015",
    "text": "Wonderful food and great waitresses/hostesses. Best local Italian restaurant around. It appears to be pretty busy all the time, they must have some great dishwashers. ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mCOnreju2PuLhzho9vzcVQ"
  },
  "C__8se_XiMtCd_DgWkC8PQ": {
    "date": "11/30/2014",
    "text": "Tasty if not outstanding food. Great vibe; cozy and homey. Felt like what used to be common in suburban communities in Western PA in the 90's. Steak and chicken salads were mostly iceberg but the portions and seasonings were enormous. Very good yet not great wedding soup.   Insanely pleasant, friendly staff.  Always a wait, FYI.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKrXZY_OjTZ1yg7a3HH_4w"
  },
  "V_FAvDaQnSPgnXTZCvmoZw": {
    "date": "3/11/2015",
    "text": "Absolutely the best Italian food around.  Give it a shot if you're in the area. You will need a reservation as the place is smaller and always packed. If you somehow find room for desert, I suggest you try the tiramisu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NoNF263I30CDdA80BZiONg"
  },
  "hGMBLQ1PO3UbDk_t8S5xXQ": {
    "date": "6/3/2014",
    "text": "Is it a \"great\" Italian restaurant...no.  But, it is hard to beat the value vs quantity vs. quality.  It is worth trying if looking for another Italian option.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JEfQk9SVGmPGSjNlBkyJaQ"
  },
  "eKQ2sUSWDu1qdgW3wrRtjw": {
    "date": "5/23/2014",
    "text": "Went here today for a late bday lunch. It is one of my favorite places & it did not disappoint. I have a tendency to always get the same thing because it is my favorite pasta & that is gnocchi veronese with wedding soup & a side salad with house dressing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ir0myV5VfkjD-_Sg_dQcMg"
  },
  "m5RBv860iVRPU6BcCoSb8g": {
    "date": "10/22/2011",
    "text": "My favorite Italian restaurant, olive garden can't even compare;) !",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "joCcHNyvjrwEg_6KX6MMPg"
  },
  "6gwZwqYwGPCv69Gba2ppKA": {
    "date": "3/13/2013",
    "text": "Best Mom and Pop old Italian restaurant in the area. I've been here a few times and never been disappointed. This isn't just American Italian food but some authentic dishes as well. I highly recommend this place. Fairly priced as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dl-k9Db24FkFFPyIqNFTFw"
  },
  "5C4UIvNqz3EfB4z3wLFF8g": {
    "date": "4/3/2014",
    "text": "We just had lunch today and it was delicious!  Everything is homemade from fresh ingredients.  And they give you a hearty portion. I never go there that I don't bring  enough food home for lunch the next day.  I am almost afraid to write this for fear I won't have a table the next time I go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bMv8zTEWHi2gfaumFrtQ4w"
  },
  "gbmeaqLSw0EyPZy0jwHwWg": {
    "date": "10/19/2013",
    "text": "Food tastes great and portion sizes are just right. Would be 5 stars except the wine tasted like flavored water. So skip the wine!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TGzTlfp-eOW5Yll1_iEPjQ"
  },
  "DU5-o3-NBuJ5eaVzgPDWNA": {
    "date": "10/17/2010",
    "text": "The Village Inn is a pleasant surprise.  My wife recommended we go there and I've been there twice now and had a great meal both times.   They have a large italian menu and the prices are very reasonable.  As other reviewers have said, you get a salid or soup included in the price of the meal.  They also give you some great garlic bread.  Don't be put off by the looks of the place; it's great inside.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HiR6sIyTzkVPmMRtV6axZA"
  },
  "j8cZcW4QyTIO0zQ2AD8WBA": {
    "date": "12/6/2015",
    "text": "Never had a bad meal. Also they have a great and curtious staff,and really cute waitreses.i highly recommend trying the stuffed hot peppers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nZ8BUEiPSDFR-cOyHkN6hA"
  },
  "MF8T5l2hDKe9whSvkcFYlw": {
    "date": "11/7/2013",
    "text": "Cute mom n pop place in an almost residential neighborhood. There are plastic plants and the waitresses call you\" honey\"   ..the food has some surprisingly homemade feel, with good wedding soup and sauces That aren't too heavy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jy9fiTWK-7liefYYkN4KnQ"
  },
  "cT3t5L68SAXApB3F6QlHNg": {
    "date": "8/9/2013",
    "text": "This place is amazing !!! The food is very legit and home made. The service is great. Drinks and dessert are awesome!! The only thing that sucks is the limited parking.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-xlOz4tH5iEbh2mcyoLWzA"
  },
  "Svwhib21DW1PvV9NEzBC_w": {
    "date": "10/17/2015",
    "text": "By far the best Ittalian food I have ever eaten . The service is fast and friendly. All meals come with soup salad and enough foood for one to take some home for the next day.  Favorites are Chicken Parm, and veal neptune. Reservations are recomended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_TIzoqA7V7BAM3BxErlJtw"
  },
  "zPfJMecVhmp5qV-7OT7UjQ": {
    "date": "9/27/2015",
    "text": "Recently visited after living out of town for almost 20 years. Even better than I remember it being. I can't wait to return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rk3wVTj-FQZHT7RhqyPChg"
  },
  "9gKo2l7d8rTi_h_JsxQxeA": {
    "date": "3/21/2016",
    "text": "Love this family owned restaurant, it's sweet and simple and delicious. We order to go as well since we live nearby! You get a TON of food when you come here, be warned! It's like two meals with all the bread and sides, which is great. Order everything, it's all good!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "BiscGdcHdqveU7sJgZzf5w"
  },
  "rh4xE2E7fywNeSJ61FCkUw": {
    "date": "5/8/2016",
    "text": "Great all around! Authentic home made Italian favorites. No corporate chain imitations here. Friendly staff too. This is one of those good old one of a kind family style eateries that can't be beat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zx3ktQcBH0ebjJE_Y2WWhA"
  },
  "GOBCtapAWwU_Tt0Ru77_lg": {
    "date": "9/14/2012",
    "text": "Awesome! 4.5! Succulent and just oh so right tanginess to the village inn tomato sauce.  Hubby and I have eaten here twice so far and we can agree that the dishes we've tried are outstanding!  Very busy restaurant so I would recommend reservations, even in the middle of the week.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Eu_9lumAGZ1HHf3OP3hag"
  },
  "cFLogyIK4EVyPWMVaIpNzA": {
    "date": "3/19/2016",
    "text": "What a great family restaurant!!!!  Meatballs were excellent as the lasagna!!!!  Worth the money!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OyNosRTExb8TfBYc88Dt_w"
  },
  "H2hr-PL-GJPQ4B4ZhadJCg": {
    "date": "3/22/2015",
    "text": "For the record, I would give the Verona Village Inn a 3.5 if the option was available.   It's a shame because, in reality, the food is amazing. This place serves great traditional Italian food; I recommend the veal parmigiana. The Verona Village Inn is fairly known around Pittsburgh. Unfortunately, this draws in huge crowds in the evening and you can barley move around in the small building. This is not a place for claustrophobic people or else their could be a major problem. The restaurant was not made for huge mobs of people to be pushing each other to get inside.  Finally, my last critique is that the food is quite expensive. I took a brief glance at the tab and was surprised! Over $100 for my family and I to eat a small dinner! Jeez. However, like I said before the food wonderful. I had a bowl pasta with Alfredo sauce that was so very good. To sum up, when you want some delicious Italian cuisine and you can take tight quarters and a big tab, the Verona Village Inn is a good option for you.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Fqkte2Wffc9WtzBJYUqh4g",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States. Here is the giant sign for the restaurant. It&amp;#39;s location is very odd; it is on a very small and run-down road.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Fqkte2Wffc9WtzBJYUqh4g/o.jpg"
      }
    ],
    "user_id": "jalNh7u8WZGC2-vpD1tbXg"
  },
  "nigi4yeU9fYBJcwbZ9C5MQ": {
    "date": "4/28/2016",
    "text": "Great Italian food, large portions, reasonably priced. I have tried about 75% of the menu over the years, I haven't had a bad meal or negative experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gRw_qloArroGfgIli1XWOQ"
  },
  "6ZtbwDdFX-apSFGo94ouQg": {
    "date": "4/6/2016",
    "text": "Like I ate at grandmas; this is the best I've been to in years. There is nothing that isn't great from the veal parm to tje talapia Wonderful place, great staff, terrific food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZOC6ZgapSwfEVVTn5zcq0w"
  },
  "DWrmMIke4_1oijqBWmXi-g": {
    "date": "9/26/2016",
    "text": "Great food and service. Very popular family owned Italian restaurant. Never disappoints. My only wishes are a better parking lot, and new decor.  It's starting to get a little \"old\" looking. But otherwise, Great!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RU8k7Kw2PilgyErsZcGYsg"
  },
  "fROFKeHWzwup16OrlTw0OQ": {
    "date": "5/1/2014",
    "text": "This place is amazing. We went here on a whim while in town for a hockey game. I had gotten the chicken parmesan sandwich. This thing was huge it had two chicken breasts where most place only have one. The taste was like something my grandmother would make.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0UJIRuenU3aOCTLfcHt7xQ"
  },
  "DRocAO4f7FVj67tcEhX0TQ": {
    "date": "3/12/2014",
    "text": "We had  the scrod and the alla pescatore while it was fresh,  it lacked seasoning. The bread did not make me think \"homemade\". The red sauce could have used seasoning as well. The gnocchi was a little doughy and needed a better sauce. Spumani was very good as well as the chocolate loving spoon cake. The price was exceptional. The wait staff was very good.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Gjp51CAfonv0gbA9kowM2Q",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States. The lobby area.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Gjp51CAfonv0gbA9kowM2Q/o.jpg"
      }
    ],
    "user_id": "v2isUyncSYcla18r78NInQ"
  },
  "m5S8hRAFmkM5YDckMGFxzg": {
    "date": "12/4/2016",
    "text": "After hearing great things about this place, I finally tried it last month.  My only regret is that I didn't find it sooner!!  I've driven past this place before and haven't noticed it, it's easy to miss.  The menu says to be patient waiting for your food, but the wait seemed to go by quickly.  Before your meal, they bring soup AND salad.  And delicious garlic bread!  It would be easy to fill up on the bread, soup, and salad alone, but then you'd miss out on the main courses!  I had the Stuffed Eggplant Rotelline--it was sooo good!  It is similar to manicotti but with eggplant instead of pasta.  Next time I want to try the manicotti, which I've also heard is excellent.  We didn't have room for dessert, but ordered tiramisu to go.  If you don't have room for dessert, make sure you get tiramisu to go, you won't regret it!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0t2r1VxxukN-cCFyrZyaeQ"
  },
  "HNjiEMhmNSFQ3dmcUEwb2A": {
    "date": "9/10/2014",
    "text": "I had an hour for lunch and the trip took me twenty minutes - and I still made it back in time.   Verona is a small place with friendly staff and some real solid Italian food. I ordered the Bruschetta to start with, expecting a few pieces - I was surprised with about a dozen pieces of bread that were toasted on the outside yet moist and chewy on the inside, just as Bruschetta should. The pesto was flavorful and the peppers had just the right amount of oil to really bring it together. I liked the fact that they let you choose how much tomato or pepper to place on your bread as well.   I also ordered the lunch Sampler, which was excellent. The chicken parmesan was a bit less crisp than I'm used to, but it was well breaded and had a good texture. The Alfredo sauce was cheesy and just the right thickness for a cheese sauce. The pasta was great, and the sauce was a little textbook but still good.   I paid around 15$ for the whole meal - with service and prices like you get here, I don't know why you'd even consider going to any chain Italian restaurants!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q0cEZ47n87Z4mifscoWhsw"
  },
  "KIuzo_b4gs-ger6Hb2CZ6w": {
    "date": "6/4/2016",
    "text": "This is the best Italian in the eastern suburbs get food and great staff love this place I have been here several times  It's the best Italian food in Pittsburgh please give it a try you won't be sorry But made sure you make a reservation  It's s small place with great food Love this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TowbVVlCDBV2nBxt3oFoSg"
  },
  "MEliWyfrzNST45a0DJeFMg": {
    "date": "1/8/2016",
    "text": "Thoroughly delicious. Plentiful portion sizes and very fair priced. Fantastic taste and a lot to offer on the menu. Authentic Italian. A local favorite and a hidden gem to those uninformed. Dinners times get packed so make a reso. This place closes for Steeler games!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZhdH8Ua9-wwqUjrzrmtifA"
  },
  "tndGx0JxgIb9GS1CctFzbw": {
    "date": "12/12/2013",
    "text": "This is a tough review to write, because the Verona Village Inn is a really big deal in Verona. My late father-in-law's wedding was catered by them as a favor- the families were close back in the day. Every \"big news\" dinner in the family is done at this restaurant. It's a friendly place where everyone calls you \"honey\" and the waitresses remember you. In that respect, the place is great.   The decor is a bit out-dated. The right seating section is pretty cramped. And the food... well it's good, don't get me wrong, but it doesn't feel restaurant quality. The presentation isn't great, and the alfredo sauce is a little more bland than I'd like. Last time I went, my fork was still dirty, and the time before that there were used napkins at my feed under the table. Their saving grace by far is their wedding soup- it is amazing.  I think it's a decent place, and I've gone on weekends exclusively, so maybe it's a timing thing. I was definitely a little disappointed each time I've been there, but I'll be back, I'm sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gWLeQBH2tgHk6OsBAUzNxA"
  },
  "VXoPJ0i943bfSnKONPQpiw": {
    "date": "8/19/2016",
    "text": "Excellent cuisine. Every dinner I've had there has been superb. And True Italian, which seems very hard to find. And if you need a good lunch the next day, take a meatball sub home. It's delicious, and a very cheap price. And the sub can feed you  like 2 or 3 times. It's gotta be over a pound of food. Awesome restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yEUJY8bThVyFsLUiA16G7Q"
  },
  "NGf-Esvx0OMF3gloGnf4vw": {
    "date": "10/5/2016",
    "text": "Been coming here for several years and i cant say that I have ever had a bad experience. The prices are great and the food is delicious. One of the best places to eat in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "keuCzE5WArc40W1covlGgQ"
  },
  "icRk4zqpdv1GjRuhZaJ7aA": {
    "date": "8/28/2015",
    "text": "Great Italian food. It is always packed for dinner, so if you order out, make sure you arrive late to pick up your order because they are also running late. The food is good at this restaurant but the service is slow and the atmosphere is lackluster. Take out is the best option.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BzUD4u8HD9ro14XPuxZA_g"
  },
  "0s6zrgK1zdBHhUlkl4f3yA": {
    "date": "7/7/2015",
    "text": "I've driven past this place forever without stopping until seeing good Yelp reviews so we tried it. We will be back as the food is authentic Italian and lots of it. Make reservations as the place was packed on Tuesday night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WjOP-bBFHQ_aLJ_x1OmTsw"
  },
  "TkZj4pnw-gUvOLhrEPhfag": {
    "date": "8/21/2014",
    "text": "This place is definitely old school Pittsburgh. A little outdated, a little worn, and a lot of rustic charm. We went based on a recent recommendation from one of my husband's coworkers, who proclaimed that it was the best Italian in the Burgh.   It was PACKED, and on a random Wednesday night no less. It was only a 15 minute wait, which wasn't bad. I had never heard of this place until we went, but apparently it's a pretty big deal in Verona. The lobby was consistently full the entire evening. Their typical clientele definitely seem to be more on the oldster side of things. Other than the employees, I think my hubby and I were among the youngest people there by a couple of decades (and we're not exactly spring chickens!)    Everyone -- from the hostess to the waitress to the lady ringing up the checks -- was sweet as pie. Sweeter than pie even. The atmosphere there was like being wrapped in a warm, comforting Pittsburgh hug.   The food, however, gets mixed reviews. We started with the fried provolone, which were delicious -- crispy and ooey-gooey without being too heavy or greasy. However, the tomato sauce it was served with was bland. Beyond bland in fact. There were no chunks of tomato. No acidity. No sweetness. Just kind of....nothing. Tomato sauce at an Italian restaurant is kind of important to get right, so this was a big miss.  For my meal, I ordered the chicken parm -- a dish that relies on tomato sauce as its linchpin. After having the provolone, I didn't have high hopes for my tomato sauce-laden dinner. Unfortunately, as I'd feared, my chicken parm was bland. The chicken itself seemed to be well-prepared -- it was coated in panko breadcrumbs and was crispy and juicy. However, it was covered in the bland sauce that really just didn't do anything for it. It needed a lot more seasoning to give it some flavor...unfortunately trusty Mr. Salt Shaker didn't do the trick. The pasta it was served with was kind of mushy, and again it was covered in the sauce that was flavorless. I will say, however, that the portion size was VERY generous -- enough for me to take a sizable amount home for lunch the next day (plus it also came with soup, salad and bread before the meal).   My hubby fared a little better, having ordered a meatball hoagie and fries. His hoagie was ginormous, with meatballs the size of small baseballs!  He thought his meal was pretty tasty, so maybe I just ordered the wrong thing (although his also had tomato sauce, so I dunno).   The alcohol prices were a treat -- $2.75 for a Sam Adams is really reasonable! In fact, in general I'd say that the prices were pretty reasonable overall for the amount of food that you get. My hubby's meal was particularly well-priced ($7.25 for his hoagie and fries). Mine was pricier at $15, but it did come with the soup, salad and bread. Considering we each got two meals out of it, I'd say the value here is good.  Overall, the value, the friendly service, and the decent food earn this place a solid 3.5 stars. I'm not dying to race back here for another meal, but I'd definitely be willing to try it again and maybe get something else on the menu that doesn't have tomato sauce.   PS - The parking lot around here is small, so be prepared to be patient and/or be creative to find a spot.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ogUMHW1tHcLEe2N4h2zkZw",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States. Meatball hoagie the size of your head.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ogUMHW1tHcLEe2N4h2zkZw/o.jpg"
      },
      {
        "img_id": "xz4IyA76mZk_LRqevcVDxw",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States. Chicken parm... huge!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xz4IyA76mZk_LRqevcVDxw/o.jpg"
      },
      {
        "img_id": "62nrhaysxP0y2wqJn0oNFA",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States. Garlic bread and salad that come with many entrees.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/62nrhaysxP0y2wqJn0oNFA/o.jpg"
      }
    ],
    "user_id": "0EhPIlDozxGKpbbHRr6vZg"
  },
  "r-4TOouTz3rQzvB2DME3hw": {
    "date": "8/17/2017",
    "text": "A classic old school Italian restaurant.  If you didn't know this place was popular or you probably wouldn't stop there. Looks can be deceiving this venue looks a little old and drab.  When you actually walk in, the staff is friendly, and the food is delicious and homemade.  They are now BYOB which is also a plus unfortunately the seating is not as much as they used to have since their recent parking issue.  I am just happy they're open again. Make sure you get the mozzarella sticks they will melt your heart.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "exlziNg-2I1-7JZcYPgWJg"
  },
  "jsMVu2vp7agy_LrJotjT1g": {
    "date": "8/24/2018",
    "text": "As a little girl my family and I came here all the time and I remember the food being delicious! My fiance and I were in the area and decided to stop and give it a try since it has been ten years since I have been here. I am sad to say I was very dissapointed. The food quality is not what I remembered it to be at all. I ordered the stuffed eggplant and I really don't think there was even eggplant in it.. it was more like breaded cheese.. The main thing I was very dissapointed in was the pasta it was not drained and when it arrived to the table it was swimming in water with no sauce. We asked our server for more sauce because it was very watery and her reply was \"yea when they don't drain the pasta it gets watery like that\".",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HaHOmqIRWCAJsjC4xQsXMw"
  },
  "88upoLVY1K-xvXxJzK5ysA": {
    "date": "4/17/2016",
    "text": "Every meal comes with soup or salad.  Veal Diablo  (veal with LOTS of banana pepper) and either the stuffed eggplant or eggplant parm are our go to meals.  It is a family owned business that closes over the week of 4th of July so entire staff get a summer vacation.  Everything is made fresh.  There are little Italian grandmas making THE SAUCE.  Highly recommend reservations and carpooling (small parking lot)  ................  They closed and reopened ... now a BYOB with  corking fee and do not accept reservations.  Increased the takeout area in the kitchen and eliminated the bar area.  They are still working on supply levels for use of 1/2 of the restaurant ... BUT the food is still very good ... my family is happy to see the business reopen.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rxw9BOhbTzVUP5rvd5Acdw"
  },
  "dS60RY01En9HAu8l3NvQNg": {
    "date": "4/12/2018",
    "text": "Italian food at its finest! The portions here are so generous with an entree you get soup, salad and their homemade garlic toast! I always get the stuffed shells and they come out perfect each time. The atmosphere here is wonderful and the people here are very nice and sweet! I love this restaurant and if you're looking for a nice dinner with authentic Italian food I recommend! I will continue to come here and be satisfied! Thanks village inn for wonderful food and memories!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4fr_Q-2ozCiqJr3b-hBVgA"
  },
  "mCoox6El5M55aninzrH8aA": {
    "date": "3/3/2016",
    "text": "I highly recommend coming to the Verona Village Inn. the food is delicious and there isn't an item on the menu not worth ordering! Plus the soup and fresh garlic bread brought to your table is just magnificent!!! The dishes are well priced for the portions and taste incredible. I had the Blackened Chicken Alfredo and it was AMAZING! Noodles cooked just right the sauce was perfect and the chicken was fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_wD2Xc7fGrHoPQ5f5TjMoA",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States. Blackened Chicken Alfredo! Noodles so perfect and think and fresh and light! Sauce so well balanced and light",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_wD2Xc7fGrHoPQ5f5TjMoA/o.jpg"
      },
      {
        "img_id": "FcNVFN9xfFlaTcc_xllY5w",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States. Delicious wedding soup!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FcNVFN9xfFlaTcc_xllY5w/o.jpg"
      }
    ],
    "user_id": "XTHDS_FJMACc4X-PK9WjkQ"
  },
  "1FaCcK51psGcsmMWkiXegA": {
    "date": "2/11/2018",
    "text": "Big portions. Parking rough at times. Most of the food is very decent except pizza is disappointment.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1UEvghKMFm90lfpeL4PuSA"
  },
  "QGBTEGaPkLremmo1N3YHmA": {
    "date": "11/19/2017",
    "text": "I've had this place in the past and thought it was average.  Although Yinzers often like to rave about very mundane attributes, this place is okay.  I thought they were to suddenly close down and perhaps the circumstance where the staff was suddenly told they'd be unemployed and then told they weren't waned the passion and pride in serving good food.  I thought the pizza tasted like a reheated Labriola's square cut except the pizza was served to us cold, and the bottom of the crust was essentially raw.  The black olives must have been refrigerated and huge piles were added to the pie aiding in making the pizza cold.    I used to think Pittsburgh knew pizza, seeing as how people around here claim to be so East Coast.  But what I've realized over the past year is that this place is much more like Ohio or Iowa then anything with guts or class.  Bland palate, and recycled regurgitated food.  I'd take a slice from NJ any day.      If in the area, I'd probably get Della Sala's even though that's overrated too, like Turner's Tea, or Pasqualino's although apparently it's well known that the latter gives you a decent case of the shits.  But again, people like to polish turds so maybe that won't bother you.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yTdaR2Kk2t5AIE72rOigyw"
  },
  "2_oAd9tBbt1SUUyYa1iL2A": {
    "date": "3/2/2017",
    "text": "Reopened on 3/1/17 at the same location. No longer takes reservations. One of the best Italian restaurants in the PGH area, and by far, the best value",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "yMCul2anyFnGGo7VCCYrZA"
  },
  "-Xrjy7-ejug7vtWaSC30PQ": {
    "date": "10/27/2014",
    "text": "Hands down one of my favorite Italian restaurants. This place isn't much of a looker, but the food is outstanding!  We came here on a Sunday with a small group. There was a bit of a wait, but we had reservations, so were seated immediately. One of the people in our party is a regular and he said that the lobby is consistently full and he wasn't kidding. Even at 3pm!  We all ordered and sure weren't disappointed! It seemed that all meals come with a soup, salad, garlic bread, and a side. Wedding soup is one of my favorite soups and it was truly the best I have ever had. For my meal, I got the shrimp con aglio e olio and it was delicious. Large portion and shrimp were a decent size. I also tried the chicken Marsala and chicken Romano and they were the best I've ever had - the wine sauce for the Marsala was something I have never tasted before. It was amazing.   We will definitely be coming back many times. The menu is large and there are ao many dishes to try! The prices cannot be best for all of the food you receive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2xyBKyVe_Rf5cZs1nKulXQ"
  },
  "JvPljtED3GXDUdyJ6kVIqA": {
    "date": "5/8/2014",
    "text": "Mamma Mia!  I think that I'm still full from a week ago.  If you have ever seen the movie \"Moonstruck\" and wondered where you could go to capture the same mood, then this is the place.  Everyone knows everyone else who enters and even if you're not a regular, the staff makes you feel like you are. (Regulars get the wait staff that they're used to)    My daughter attends school not far from the restaurant and she recently had a half day of school.  I decided to treat her to lunch there and boy were we surprised.  My daughter is a chicken parm fiend, so she ordered the Chicken Parmigiana meal from the children's menu.  Talk about a huge portion!  Fred Flintsone would have been proud to attempt to take down this portion!  My kid can really eat, but she slipped into a food coma midway through eating lunch and we had to take the remainder home. (She ate two additional meals from the leftovers!)  I had the baked scrod with a side of linguini, salad and garlic bread.  For $7.99, what's not to like?  Pasta was al dente, fish and garlic bread were tasty and the service was friendly.  I also had enough left over for an additional meal.  Additionally, I felt like I had nonna waiting on me.  Don't go there expecting this fabulous trendy tuscan or sicilian meal with an open kitchen and wood fired oven.  This is not that place!  However, if you just want to sit down and eat something that someone's Italian grandmother serves on a nightly basis at a reasonable price, this i your place!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "hnVXeRIxCf6CQc1wcRx3tg"
  },
  "ZGBBB5bPO0CxzmA7-YhP9w": {
    "date": "1/4/2016",
    "text": "My parents have eaten here many times in the past and I have been here once before years ago, but I stopped eating pasta in 2013 and so I haven't been to an Italian restaurant since then (to avoid temptation!)  However, it was New Years Eve and I wanted a big fat bowl of carbs before we went to celebrate the end of 2015 and Bobby and I pass this place multiple times a week.  He has never been.  They could take our reservation the day of NYE at 9pm.  We were seated promptly and it wasn't as cramped as I had remembered/expected although most other tables were full.  Our server was polite, but not over the top.    I ordered their pinot noir that arrived in a very small wine glass and Bobby ordered a captain and coke that also came in a small juice-like glass.  We started with the bruschetta and it was truly to die for.  It stole the show.  We were offered the option of tomato or roasted red pepper bruschetta and we opted for both! It was ready promptly and was on a HUGE plate.  Enough to feed 4-5 people as an appetizer.......so Bobby and I finished it all...by ourselves.  The bread was crusty and perfectly fluffy soft in the middle with amazing garlic pesto and the tomato and red peppers had so much flavor.  I could have eaten it for my meal!  Next, they brought out the wedding soup which was great with a little salt and parmesan cheese and it was followed by a side salad.  Almost all meals include the soup and salad.  The salad was your basic garden salad, but fresh nonetheless.  I ordered their house Italian dressing which was PERFECT and Bobby ordered ranch that he thought may have been from a packet.  I thought maybe they use prepackaged dressings as well when looking at the menu.  This would be my only disappointment with the place if they did!  I ordered the chicken Neptune (chicken, scallops, shrimp in a marsala sauce over linguine) and Bobby ordered their seafood pasta (lobster, shrimp, scallops over linguine in a white or red sauce - he chose white).  Mine was very good and flavorful and he was pleased with his as well.  It was only a few bites before we had to send them to box it up.  Portion sizes are very generous and our waitress was attentive.  Our final bill came to around $50 which isn't bad for two alcoholic drinks, a huge appetizer, plus soups, salads and entrees for the both of us!  Our bellies were full and happy to end 2015 and full and happy again to start the new year after eating our leftovers for lunch the next day!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "NIJWrUAz7-9IEqwZnGBT9g"
  },
  "5ajdH0iLAoD-T9IkZ5AHMQ": {
    "date": "6/14/2018",
    "text": "Cheap, prepackaged, and horrible service. Don't waste your time. Go to Oakmont down the street instead. We were seated and the waitress never came over to greet us, after 15 mins she comes by and says \"are you ready?!\" No \"Hello, I'm ...\" so we ordered wine, no wine list, just a list of varietals. By the taste of it, it's boxed. The wedding soup was the only good thing about the place, however it was very underseasoned. Salad is iceberg and their \"house dressing\" is bottled and the same thing as Pizza Hut creamy Italian. Bread was frozen and tasted like New York Texas Toast. I had the veal diavoletto...absolutely one of the worst dishes I have ever had in my life. There was unseasoned \"boiled\" or cooked in a sauce veal topped with gigantic mushrooms huge onion rings and banana peppers cut into 1/3s all swimming in a huge pool of sauce. It was HORRIBLE. The sauce wasn't even good at all. So I didn't eat any of that and I figured I could at least eat my side of linguine in red sauce, because their menu is Italian American, oh no! The red sauce was even worse than ragu, definitely not homemade. So I didn't touch my food and the waitress comes over 20 minutes after our dinners were served and asks \"didn't you like it? and I said no, there was way to much sauce. She asked if I wanted something else and at that point my husband was already done eating and we had been there an hour so I said no thank you. We ordered their sams club chocolate cake for dessert and when the bill came she didn't even take off the $3.99 dessert and charged for my meal. This place is past its prime and basically just going through the motions. Don't waste your time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KtvUYZGZ4zzVFXw0NEznew"
  },
  "TP1gvAjTrqey0YNVa2yeQA": {
    "date": "12/12/2016",
    "text": "Really amazing red sauce restaurant. Service was amazingly good, totally spot on. As I usually eat in overcrowded and much hyped downtown and east end restaurants, it was nice to go someplace that doesn't try too hard. It was great food, thoughtfully prepared and served, in a cozy environment. Thanks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vuiEiVLs9cgpKwIU-HJ5TA"
  },
  "3JYxJeRUkoQ_wXXJkPUuLQ": {
    "date": "3/4/2017",
    "text": "The Verona Village Inn is back open and the food is excellent, as usual. They have added a great family style takeout menu as well (single menu items to feed four people). There are fewer seats but that doesn't bother me and there is plenty of parking for the number of tables that remain. I encourage everyone to come back to the Village Inn and enjoy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DVzYlY8JNGYHhl8tc_4HEQ",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States. FAMILY STYLE CHICKEN PARM FOR TAKE OUT (12 PIECES)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DVzYlY8JNGYHhl8tc_4HEQ/o.jpg"
      }
    ],
    "user_id": "3xpI4KbIGA0B7kwQy8Ed9Q"
  },
  "oC_5rufxxKsPY7htRgfaxQ": {
    "date": "10/7/2014",
    "text": "This is an all time favorite that we used to come to when we lived in the area back in the 90's. Always a place we try and get back to when visiting family.  Love this place, if I could pick it up and move it to NC where I live I would.  Just good Italian food and other items.  My faves are Stuffed Hot Peppers and Wedding Soup.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Fze6Fxl3KF_xm_sbYsuYyQ",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States. Wedding Soup!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Fze6Fxl3KF_xm_sbYsuYyQ/o.jpg"
      },
      {
        "img_id": "e219a9GHziCpBdQP3aaZkw",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States. Stuffed Hot Peppers YUM!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e219a9GHziCpBdQP3aaZkw/o.jpg"
      }
    ],
    "user_id": "Tave3gled9BLXScqgT3ivg"
  },
  "dNFRcG9cVlPI_dP0e2M7qA": {
    "date": "9/4/2013",
    "text": "I came here because it was basically the highest rated restaurant in the area... without being too expensive (only rated $$) or too far away.  I'm in Pittsburgh doing training for a couple of days--I live in Seattle.  This is my first visit to the area.  The location was more provincial that I was expecting.  Very much like small family restaurants on the outskirts of Vienna. Unique, rustic, a bit shabby in places.  I ordered the Stuffed Sole (on special for the evening) with pasta, the Wedding Soup, salad with Ranch (on the side), and garlic bread.  Everything was included in the price of the Sole ($13.99).  I had a Coors light--one of two beers on-tap, for $2.25.  Great price, right?  Except it was in about an 8oz mug.  The Wedding Soup was really good.  Fresh.  Meatballs with tiny pasta balls in a chicken broth with...Kale?  Maybe, maybe not.  Something dark green.  The salad was a typical side salad.  Nothing special.  Iceberg lettuce, red onions, grape tomatoes, shredded carrots.  The garlic bread was saturated in garlic butter.  I liked it.  Soft on the inside, crusty on the outside.  Italian white bread.  Good.  The Sole was soft and flaky. The stuffing was a decent crab stuffing.  It all sat in a cream sauce that was bland.  My sole had some small bones, but nothing too complain about.  The pasta was spaghetti with marinara sauce.  The spaghetti seemed a bit overcooked, and the sauce was fairly bland.  It reminded me of spaghetti-Os.  Overall the meal was a decent meal... not terrible for $21 with tip, but not what I expected with so many stars.  Maybe the out-of-the-way location made the reviews seem better?  Maybe there isn't much Italian competition?  Maybe the family atmosphere wins people over?  The waitresses were older and had obviously been there a long time, so it seems stable and a good place to work.  Nice to try, but fairly 'meh.'",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6xwDSId52R5_vR3Geyw2vw",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States. Stuffed Sole",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6xwDSId52R5_vR3Geyw2vw/o.jpg"
      },
      {
        "img_id": "coD6FWS0z65FYVJX6Y7EVA",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States. Wedding Soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/coD6FWS0z65FYVJX6Y7EVA/o.jpg"
      }
    ],
    "user_id": "lILKLZLBx43H3T1bdx0awQ"
  },
  "If6HHzHphw11zU2eTPpZ9w": {
    "date": "6/19/2015",
    "text": "Authentic great italian food!  Not a fancy italian place and the seating is tight but you cannot beat the food or portions. Chicken parmesan is my favorite followed by the blackened chicken Alfredo and the sausage and meatballs with a side of penne. Best red sauce in town!  The wine selection is simple but when your there just focus on the food, consistently great service, and great value and you'll leave happy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cRx8ucdGPVv5a7IgXqddAw"
  },
  "Md1kP-gARSJjjVaRqNGZvg": {
    "date": "10/9/2012",
    "text": "Adorable mom & pop, local joint with real people and a family flair. Our clients took us for lunch here, raving about its value - it was phenomenally affordable ($8.99 lunch specials!!!) with great food, and exceptional service.  * Drenched, soft Garlic Bread * Yummy Chicken Parmigiana * Perfectly cooked broccoli * Delicious Wedding soup  Local vibe, nestled into a hill. Loved it.  (was also cute to see so many neighborhood-looking customers, patrons, couples, families, and a wide age range. it felt warm & welcoming.)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "HEPfqAH6ObF36Fp1B9Fi1Q"
  },
  "w3rAkDl9vFKg0n1j58CZiA": {
    "date": "11/20/2017",
    "text": "I have gone to this place since it opened !  The owner is a nice man. The employees are all very nice. The prices are great. The food is good. Never had a bad meal from here. BUT.......I have an observation.......I decided quite a while back to no longer eat IN........I place 'to go' orders exclusively.......btw, my orders are always ready quick, packaged great and orders are always accurate......but back to why I quit 'eating in'........I find the clientele sort of annoying......almost everytime I visited, I'd be seated by Jed Clampett and his wife who do nothing but complain complain complain......you know the type.....no drinks, just water with a lemon, one entree with 2 plates, send it back 2 times, make a nuisance of themselves for an hour and leave an 85 cent tip.....woot woot, the big spenders are in house tonight.....I seen it time and time again.......ridiculous.......so I get my food to go and go home and enjoy my meal in the comfort of my home without having to look at irritating, miserable cheapskates who can't seem to just go out and have a good time......I would love to see the owner move this concept out of verona, where the parking is crap anyway- and go into Monroeville or somewhere....I think he should buy the old DiImperios building on 22.......he'd make a fortune......it's a shame to waste this place on the beverly hillbilly club ! ......just my opinion......been stopping by the place since it was the Pizza Shack !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zaj9NP5U0D62l_QtH4ipjw"
  },
  "PPKIoAmf_GdWTP1WkRWfmw": {
    "date": "8/28/2019",
    "text": "If you're looking for a neighborhood location serving authentic home-cooked Italian food at a reasonable price, Village Inn fits the bill to a T. I had the meatball (2) and hot sausage smothered in red sauce and mozzarella ($10.99). It doesn't come with pasta, but it does come with a big hunk of garlic bread and a side salad (caesar $2 extra) or soup. Service was good AND friendly. Environment was nothing special other than lots of pictures of the Alps. Background music was 50-60's rock & roll, just loud enough to listen to, but not loud enough to drown out a conversation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1roc1BkQVCEt_SnrM6sUew"
  },
  "kU-4jJbDcM6gPXV0YA1bpw": {
    "date": "9/13/2019",
    "text": "I don't understand the great reviews here. I am from dc and my family owns numerous restaurants in the dc md va areas.   The food is nothing special. The service is horrible, They don't even say hello, and ambiance is none existent. Spend your money where it is appreciated its 2019. No need to settle for these places that act like you owe them something.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BM1plFWr5KMHZQIDXABInA"
  },
  "iJDO8rn7RJDX2mpd-oEa9Q": {
    "date": "8/10/2018",
    "text": "All around great. Opens at 1130 and I walked in at 1140 expecting to be the only one there and it was packed. With that being said I wasn't expecting my food quick but there was practically no wait with the food. The lunch chicken Alfredo was inexpensive and was served with a soup and a whole rack of garlic bread. I was very pleased with the overall experience   4.75/5",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9lDqS5-_vZYbZEzNYtvemw"
  },
  "JN1P6kNnQArRMUKMWwM32A": {
    "date": "7/12/2019",
    "text": "In my opinion, this is the best Italian restaurant in/around pittsburgh. Family style meals with soup, salad, and garlic bread included with each entree. Reasonably priced. It's been around forever (since the 80's?). Family owned and operated. Excellent Italian meals. Underrated. Hidden gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iNhKt80XSgk2dXAbY_gVpg"
  },
  "SbEnD1AtYuPbVn39XKBDgQ": {
    "date": "2/17/2019",
    "text": "I've been here twice in the last month.. (no judging lol). This place reminds me of eating dinner at my grandma's on Sunday. It's an Italian hidden gem off the main drag in Verona. I'd recommend the blackened chicken in tomato cream sauce, the stuffed mushrooms, Diavolia (?), and my fav.... they honestly make THE BEST cannoli I've ever had (please don't tell my mom lol). You'll be full from the large portions they give you, so you'll want to take dessert home.  Yesterday I ordered 2 to go so I can have one in my freezer as back up. Not sure if they make their pasta but it surely does taste like it. Staff is super friendly, again a very homey feel.  I don't even live close to Verona but this is sure worth the drive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Rfy598B1ElBFv8uH4cVLJg"
  },
  "fXI1WTfAD5hzuFPEypZmUQ": {
    "date": "7/30/2019",
    "text": "We haven't been to the Village Inn for several years (shame on us)!  I ordered my usual veal romano and it was just as delicious as I remember!  My husband got the seafood pasta special and enjoyed it very much!  With the usual soup, salad and fresh bread we each had a little bit of our main courses to take home!  Eric paid for our check which was totally unexpected but very much appreciated!  We returned to the table to add some extra to our servers tip as our way to show our appreciation.  If you are looking for a nice family run and affordable restaurant please give the Village Inn a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wp-U8iq_YBakYeCiqsl4SA"
  },
  "Ss6bXhwbtpmLk-2qrC7_hQ": {
    "date": "8/1/2018",
    "text": "This place was pretty good. From the outside, you'd never guess that. The parking is also a little lousy, I had to park across the street and it is not easy to cross that street (cars literally fly around semi-blind corners both ways). Was here with a large group. Was most impressed by the service, our waitress was super on top of things. Everyone seemed very friendly. They have a large menu and prices are really good. They served us garlic bread. I had the blackened chicken salad, it was great and sizable for the price. The blue cheese dressing was okay, didn't seem homemade. Would definitely try this place again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "0KhRPd66BZGHCtsb9mGh_g"
  },
  "BmDpBPoPaT5YzavBgorBrg": {
    "date": "2/28/2018",
    "text": "We were in the area and wanted to try somewhere new instead of the corporate restaurants. Based on Yelp reviews we decided on here. I'm not sure how they have such high reviews based on our experience. The service was great but the food is pitiful.  The ranch dressing is Marzetti and gross. The wedding soup was good and the appetizer plate sampler was okay at best although the price was great for chicken tenders, zucchini and cheese. I'm fairly sure everything we had was prepackaged.  My chicken and shrimp marsala was so buttery it almost made me vomit.   Perhaps it was a bad evening for the chef.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Ci7FP9Qh_Kw21Doy9WCYA"
  },
  "VDo_g3Hpd3k3Fp4ebXMssQ": {
    "date": "6/29/2019",
    "text": "Service was polite and speedy. Food was a little above average. I agree with other reviews that the parking is a little cramped and disorganized and the bend there is a little dangerous. The food was a little above average and well portioned in most cases. The price is incredibly awesome. If I had paid $50+ for the food it would be a 3-4/5 stars. But with the just better than average overall and the price......it takes the cake.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SrYEKiZBquEyTIUAcHGnmg"
  },
  "AREYV7SeZsVNoo3VeLDdxw": {
    "date": "4/4/2019",
    "text": "This is my favorite restaurant in the Verona/ Oakmont area. It has amazing Italian food and everything on the menu is great. I guarantee you won't leave hungry because in one meal you get fresh garlic bread for the table, a salad, and your entree. Some come with soup or a side. They have reasonably cheap prices and it's a great place to bring the whole family. Definitely one of be best in Verona.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cJoFugzAPEFSDDOTHsrp1g"
  },
  "r6M4yXJa4rESd9IzLHueEw": {
    "date": "6/26/2019",
    "text": "Such a hidden gem! Love this place-the food is phenomenal, the service is so personal and good, and the lunch prices are very affordable for the amount of food you get.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hgpTtiaa_1d7N17mhnRhBw"
  },
  "0JsbsNf8dvxsTjoqN9bJ4Q": {
    "date": "10/26/2017",
    "text": "All of the wasted years!  I have lived in the area for close to 20 years and finally made it to Village Inn. Others have complained about parking but, we scored a space right at the door. Once inside we gave the hostess our name and was told that there was a wait. Next time we will make a reservation as quite a few groups came in with reservations.  We had a hard time deciding as there are so many choices. Village Inn offers burgers, pizza, sandwiches, seafood, steak, not to mention, every type of pasta dish you could ever want. Once we finally made a decision my wife and I both chose the Chicken Parmigiana which features breaded chicken that is  sauteed and topped with sauce and cheese then baked. It was incredible! All entrees includes soup, salad, toasted garlic bread and choice of pasta, French fries, rice pilaf or broccoli so I have to laugh at other reviews complaining about the price.  Our daughter of course choose the burger which is a 6 oz. ground beef burger char-broiled and served on a Kaiser roll with lettuce, tomato and pickle. You can add bacon, cheese, onions, peppers or mushrooms for 49 each. She loved it and was nice enough to let me taste it. It was delicious!  Since our first visit I've had the Chicken Parmigiana multiple more times. I also had the Sirloin steak salad and Tortellini Trentina. The Sirloin steak salad features tossed salad, assorted vegetables, cooked mushrooms and shredded cheese. It was huge and very good. The Tortellini Trentina features cheese stuffed pasta rounds in a fresh cream and white sauce with crumbled hot sausage. The Tortellini Trentina was outstanding as well! Just as good as the Chicken Parmigiana.   Village Inn also offers their full menu for takeout and ever offer family style meals to go which is more than enough food for four people.  Please don't be like me. Get your butt to Village Inn immediately!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 9,
      "cool": 7
    },
    "photos": [],
    "user_id": "BjtJ3VkMOxV2Lan037AFuw"
  },
  "rcN2IPGXSGSPpUMy52THtw": {
    "date": "4/29/2018",
    "text": "I love the Village Inn. When you want great Italian this is the place to go! Their food is so good. I always get the Chicken Parm, always big pieces of chicken with that amazing sauce, my little boy loves the spaghetti and meat balls(always get extra meatballs). They give so much food salad, garlic bread, and the wedding soup is to die for. I'm glad they decided to open back up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pCBDx3P-Y7lOGZVZbi9YqA"
  },
  "58dJo0sHCu5nuFsEo2_2jg": {
    "date": "9/28/2018",
    "text": "Wow!  3 F's,  Fast, Fantastic, and uh, um, Fantastic. Great food, amazing service. It's everything I like in a restaurant on Yelp, lots of stars and not a lot of dollar signs. Looks like it's real popular with locals. I am not local and now it's popular with my son and me. Nettie is my kind of waitress. She's the best!  But, truly everyone is so nice. Nettie is just my new favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Oyi4dDuax3yGa-Pnyf9jg"
  },
  "lfOElnR7IiVNZaMNa7teWg": {
    "date": "10/25/2018",
    "text": "Excellent home style Italian food!  Got there near closing but was served graciously without a problem.  Enjoyed the veal Marsala -- delicious!  Veal could have been more tender but Marsala made it very tasty.  Garlic bread, soup, salad, and a side are included with entree for a very reasonable price.  Wine and beer.  Plenty of dessert choices but I didn't get to try any this time.  I will be back!  Agree with other reviewers that parking is tight but I had no trouble since I got there late.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HhnbGScnM4RbL4d3qDNzEA"
  },
  "Tgquvze728U2msS8f32kOA": {
    "date": "6/14/2017",
    "text": "I would not return. Typical Italian American restaurant with huge portions so I see how people like it but I didn't think it was anything special. The salad was on such a tiny dish one wonders why they bothered. Particularly alarming is that they do not specify when meat is in a dish. I ordered the gnocchi and there were meat chunks in the sauce. The menu said 'red sauce' so am I supposed to just know there is meat in it?! There wasn't any seasoning either. Sometimes quality is preferable to quantity.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1OrzjZLbGgTeaRk5Qb8YYQ",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States. Street view",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1OrzjZLbGgTeaRk5Qb8YYQ/o.jpg"
      }
    ],
    "user_id": "-zoKnhRd4Knnj_P-qO0GPQ"
  },
  "XU8szqw4rkQTN4jefQ8rkg": {
    "date": "2/22/2018",
    "text": "I've been coming for years. Since I was I kid with my family. Everything is great here. I get the cheese stick every time. You won't be disappointed. Unless your impatient. Everything is made fresh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NR_ZWCpha1vZEB7wSIqu0Q"
  },
  "tPYqOf0h1nY60MT4TQMgmA": {
    "date": "10/31/2018",
    "text": "The Verona Village Inn is a relaxed atmosphere restaurant that our family has been going to for 30 years now. All of their food is exceptional and the portion sizes are fantastic. From the sandwiches which are abundantly sizes to the lasagna and stuff scrod, I have never been unhappy with a meal. Do make reservations as this best kept secret gets packed quickly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hesoYRlut7jYjcoJSwG9fQ"
  },
  "WZ6d7plEIQi99ulCBLOsEA": {
    "date": "9/1/2018",
    "text": "Went on a Saturday at 230. It was busy for that time of day. I ordered the chicken Romano with a side of pasta Alfredo. The chicken was good but the pasta was bland and mushy. The wedding soup and garlic were tasty. Service was good but it felt rushed. I was still eating my soup when my entree arrived. I was in and out in 30 minutes. Probably won't rush back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0GcDSgujgZvTfLs_al51UA",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0GcDSgujgZvTfLs_al51UA/o.jpg"
      },
      {
        "img_id": "NxJlkyeGVsKznVM0q7aiBw",
        "caption": "Photo of Verona Village Inn - Verona, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NxJlkyeGVsKznVM0q7aiBw/o.jpg"
      }
    ],
    "user_id": "TBsK1RfEUr5seAHgAlcDug"
  },
  "ioQHfFze5tPMDta_n6O5Kg": {
    "date": "11/19/2017",
    "text": "I don't know what everyone's obsession is with this place. I have been here numerous times, many of which were family gatherings or birthday celebrations, and each time has been more lack luster than the previous visit.  We just ate here to celebrate my dad who is a cancer survivor, 70th Birthday and we ordered a large 16 cut pizza with extra cheese and olives. It took an eternity to come out, and when it did, it was not even Luke warm. The crust in the middle was soggy and cheese was not melted. Olives were sloppily tossed in any which way onto the pizza cold, not baked with the pie in the oven. Garlic bread served with my dads pasta seemed like store bought crap from giant eagle. The salad looked like a bagged mix with wilted rusty lettuce.  Rumor was it was supposed to close down, wish it would and something Decent would move in where the cooks actually take pride in what they serve.  No work ethic from anyone behind the stove here...",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ojnJburkPT1ABaTn-UGuQ"
  }
}