{
  "GmQnEu1ed8IlORbZ0FP2DA": {
    "date": "5/14/2013",
    "text": "No schwarma, but it'll do for a quick Mediterranean fix tonight!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4HvqOlY0J6Ee4T2QdL8PpQ"
  },
  "Ej50u82TL17qjgkZU-B_2Q": {
    "date": "12/8/2013",
    "text": "This is my new go-to place for chicken gyros.  SO GOOD.  And craycray cheap.  So far, we've also tried everything from gyros to pizza to baba to hamburgers.  Everything has been excellent, and it only takes about 20 minutes for the order to be ready.  Did I mention how cheap it is?  If there is one compliant, it's about the hummus.  It's meh.  They use quite a bit of olives when making it (plus put an olive in the middle of the container), and I'm just not a big olive fan.  Less olives in the hummus, please, and this will be my favorite takeout joint ever.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "xDYZjoE02HNXMH9dZXVlig"
  },
  "xzNxkUwTndTzEQXDjXXa7Q": {
    "date": "10/20/2015",
    "text": "crooks they overcharge you on grubhub with increase price. stay away don't try these crooks. food is terrible so is customer service. there are better restaurants in pittsburgh. this is piss poor excuse for a turkish restaurant.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "l_m7CqwD_-v1LZTgzDjp7g"
  },
  "SuX9-DqSOXYbJpFW9kzPtg": {
    "date": "10/24/2014",
    "text": "I always tell people Bellevue is the capital for churches (there are a minimum of 2 I am aware of on my street let alone at least 4 others within walking distance) and pizza shops. In my opinion, this is where to order pizza from in Bellevue. My favorite is the BBQ chicken (no green peppers)-chicken; mushroom, green pepper, onions, mozzarella, provolone & smoked gouda cheeses (BBQ sauce). They have unique pizzas too like the Moroccan spiced chicken and dried plum pizza which is really unique and tasty (Moroccan spiced chicken, dry plum, mozzarella & provolone, roasted almonds, sun dried tomatoes, fresh mixed green & crumbled gorgonzola cheese (tomato sauce). The chicken gyro is also very tasty and everything is cheap to boot. I ordered some of the greek specialties before and those, unfortunately, were not good at all. The stuffed grape leaves were bland and the falafel was very doughy and cold. If ordering form here stick to pizzas or the chicken gyro. I've never used the delivery service since I'm so close but I will say everytime I've gone to pick up my order it's always ready in the amount of time they said it would take which is a huge plus.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gFsqraWQfG46ohVFRg_d3A"
  },
  "VstEubjZt5_PMHC4s0pQpg": {
    "date": "9/7/2011",
    "text": "I was greatly excited when I received a menu in the Pennysaver for Ephesus -- a new delivery place that might offer something besides just pizza? Yes please! I picked up the phone post-haste and ordered... well, OK, I ordered a pizza. But it was the Moroccan Chicken Pizza, so that has to count for something, right? Phone service was good and delivery reasonably quick, although more on the latter anon.  The pizza itself was kind of awesome; spiced chicken, blue cheese, mixed greens, almost like CPK but better. Next time I'll skip the red sauce, but that's just my own peculiarity. The crust was tasty and the toppings were awesome. I've since tried several other of their offerings, and been happy with pretty much all of them. Reviews of individual items below.  About the delivery: I live about... oh... a mile? from their Bellevue location, and I've ordered delivery at least five times. But every single time I call, they ask me where exactly it is I live. Including yesterday, when I got a delivery order and the driver forgot the 2L; I called right back and they wanted me to give them directions again. Really? Your driver was just here. Bust out the Google Maps, guise. Still, once that's all sorted, they're usually here within 45 minutes, so it's all good in the end.  Food: Moroccan Chicken Pizza - 4/5 - I loved this. It's definitely not a pizza-traditionalist-pizza, but it's delicious and more \"gourmet\" than most of the specialty pizzas you can get locally.  Seafood Calzone - 2.5/5 - Meh. Bog-standard, really. Not good, not bad.  Ephesus Pide - 5/5 - The Turkish menu is where Ephesus really shines, IMO. This pide was delicious, generously sized, and served with salad and a house dressing redolent of mint and olive oil. Absolutely top notch.  Gyro and Chicken Gyro - 4/5 - Tasty, and the gyro meat had good flavor. Their tzatziki is pretty great as well, I just wish there were more of it (this is always True, though). The chicken was actually grilled, and tasted like actual chicken that had been actually grilled, as opposed to \"we put a bunch of black pepper on this so you might think it was grilled har har.\" Sadly the pita was somehow a little dried out around the edges, and the greens were a little sad, but that was probably just a one-day kind of thing.  Fries - 2/5 - eh, they're fries. Steak fries. You know.  Mixed Grill Platter - 5/5 - Seriously, the fact that I can get this delivered to my house makes me swoon a little. You get two kinds of kofte, grilled chicken and grilled lamb, all of which were delicious and not overcooked. The spicy kofte in particular was kind of amazing. Now, what they didn't say on the menu was that this is all served on some pizza dough with black and white sesame seeds, which is somehow one of the most delicious things I've ever eaten. Also, fries, but they're unremarkable in context.  Hummus - 4/5 - not bad at all, served with one pita, and with a healthy amount of garlic.  Babaghannoush - 3/5 - a little slimy, as babaghannoush sometimes can be, but quite tasty all the same.  Baklava - 3.5/5 - A little bit unsubtle, and I don't love the walnut version, but the pistachio is pretty excellent.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "iDeRoR1Rw4vstaOptSb7qg"
  },
  "w79iKibpn8Pvpw6Ox8Iyig": {
    "date": "1/24/2012",
    "text": "Let the sad face prevail ...  After a Pens game, we arrived back in the South Side with a hankering for some gyros, but totally too many beers consumed to drive the 10 whole blocks to Lesvos. So, lazy/drunk me ordered from my go-to spot Ephesus (downtown was the delivery source) ...   Then we waited.  And waited a little longer.  Fell asleep.  Woke up ...  and there were no gyros.   I called and apparently there was someone new answering the phone, who didn't confirm the address. Granted, I've ordered from there at least 10 other times ... eh. Confused, tired, and let down, I told them 'no worries,' but unfortunately, strike one.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F3bO-1gkWI7aOgbxdDD_MQ"
  },
  "CDcyWh8lED7HUQIQ1BFlxw": {
    "date": "11/2/2014",
    "text": "Today will be the last time that we order from Ephesus Pizza.  The last time that we ordered we were disappointed with how our pizza and wings tasted - everything was kind of dry or overcooked, but we were willing to give it a try again since we were only ordering pizza this time, and thought that maybe they just had an off night the last time.  Anyhow, we ordered the Feta and Ricotta pizza Sicilian Style and the crust was dry and bland - it left you needing water because it was so dry and the bacon was undercooked but inexplicably the other toppings were dry and almost burnt except for the whole sun-dried tomatoes which were so salty that it left you needing to drink even more water and the fact that they weren't chopped/diced made the whole cheese and toppings surrounding the sun-dried tomatoes come off in big chunks in your mouth - you couldn't easily bite into it.  Pizza Milano has consistently better pizza for about the same price.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HWonvGt2a73y_4_1xNmxCQ"
  },
  "Tb1UbetiXSBmUtWWew-oAA": {
    "date": "6/27/2013",
    "text": "Got a gyro and hummus.  Gyro was very good and they actually give you enough cucumber sauce.  Most places short you on the sauce.  The hummas was very good.  Great taste.  Could use 2 pitas instead of one with it though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cOMbsVKgASAmOupQkS8QHw"
  },
  "nTjWgerlm8iDFSTDAukAcQ": {
    "date": "1/24/2012",
    "text": "There pizza is fantastic! And you can't beat the gyro and fries special when you need a quick meal. They are fast and friendly - we live down the street and can order and pick up (usually) under 20 minutes.  They have a ricotta and (some other cheese) pizza - add chicken to it and you'll be in heaven!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zvmku2DjonEw2mbalDNz8g"
  },
  "xZkqA-B242yLeuhkjrmfdQ": {
    "date": "7/23/2014",
    "text": "Absolutely love this place! They have a great menu to choose from. I absolutely love the free garlic cheesy bread you get when you purchase a gourmet pizza. So far I've ordered from here 5 times and never disappointed.  The price is great to. Definitely a hidden gem!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VRRNRkDTibwfubsB2hqQbw"
  },
  "X0gVGzT_IQ1aoKF_vibxBw": {
    "date": "8/24/2013",
    "text": "Our office orders from Ephesus Pizza in Bellevue often.  Sometimes we have it delivered and sometimes we pick it up.  The drawback to pick up is trying to find parking along a busy Lincoln Ave, but the food is well worth the minor inconvenience.  Great pizza! Great gyros! Great grape leaves!  Ephesus Pizza in Bellevue is great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N8PxQaPDys6XI0eO0TMCow"
  },
  "Lg3EQH0_mCtmSbPNMTRdUg": {
    "date": "3/15/2012",
    "text": "Pizza great crust tasted like croissant. Yummy.  Don't go there thinking, \"hey, I'll just eat there.\"  Only two tables and you will feel like an intruder.. Service impaired. Sometimes cheese doesn't give me a stomach ache but theirs did!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nOcP-0PIg4REFX4JeR49aw"
  },
  "e26XZIhPU1iVjonPtUr_vQ": {
    "date": "8/12/2012",
    "text": "First time stopping in I had great service and my gyro combo was perfect!  I can't wait to try it again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6vNJZZmkWb-WTJ1YDesQg"
  },
  "SEm9wKXy3m8QHCd46YX9iA": {
    "date": "1/29/2014",
    "text": "We've ordered a dozen times, and food is always good. My absolute favorite is the Moroccan Spiced Chicken & Dry Plum Pizza. It is the best pizza I've ever had, delivery or no delivery. Wings and everything else is good too. I wasn't a fan of some of the Greek appetizers, but I think that was just my personal taste.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NPYPKTEeXNv-Epi-1T-3BA"
  },
  "YiGaU1FLT1cXkFUPGhTbFA": {
    "date": "7/12/2016",
    "text": "Very good specialty pizza. The Moroccan chicken is my favorite: spiced chicken, some sort of dried fruit, sriracha, and goat cheese, finished with almonds and lettuce. Sounds bizarre but it's absolutely delicious.   The plain pizza, however, is pretty underwhelming. The crust wasn't very crisp, the sauce kind of bland, and the cheese was unremarkable. While I appreciate a good gourmet pie, I feel a pizza should be able to stand alone without fancy toppings.   The gourmet pies are pretty pricey, and I wish they offered occasional coupons in the local circulars. Also a $1 delivery fee, at least if you order through Grubhub.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3SrvQNZ1d1D5ynOP2LTVpw"
  },
  "v4VkWu5ngUoQyatHPIhOKw": {
    "date": "7/8/2017",
    "text": "I used to go here almost on a weekly basis but for the past few months, they always seem to be out of certain items.  I have tried to order the adana 6 times over the past 2 months and they never have them (Bellview and downtown).  I am no longer going to try and order food as they probably only have hoagies and pizza, and for that, I'll go to Fioris.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M9Yj_4H87UrhZUu8fZVMAA"
  },
  "-MgFl7RZE0arpbyKdp2KeQ": {
    "date": "11/13/2016",
    "text": "Man, we used to love Ephesus. The food was high quality, the prices were great, and the staff were wonderful people. However, all that's gone now. Quality of ingredients has declined over the past year. New staff are rude, and try to nickel and dime you. For example, in the the good ole Ephesus days, they would let you know if something you ordered had a coupon. Now, they fight you about coupons when you bring them up. The pides used to be amazing and fresh, and now they're barely edible. The Lamajun was so good! Now they don't even include lamb in it. The salads used to be great, with spring mix. Now it's 90% ice berg ends. I miss the old Ephesus. Now we have to find a new pizza joint...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7FAWEeRGS1IqKDjrY7uwaA"
  },
  "XSR2giaZAxbRX_N2I6afyA": {
    "date": "4/26/2017",
    "text": "We order the pizzas from here and they are delicious! I can't say enough about the Gourmet pizzas especially the Ratatouille and the Chorizo & Fontinella.  There are a few more on their menu I can't wait to try.  I can't comment on other food types, but the pizza is one of the best around the Bellevue area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dAhxrgQqrldiJ0sUndGJjQ"
  },
  "36nBaink08qrw5BuSUoCUQ": {
    "date": "1/16/2014",
    "text": "I stopped by here two nights ago as part of a night where I would try three different pizzas in the Bellevue/Avalon area.  I called my order in for an XL pizza ahead of time and was told that I would have a 15-20 minute wait until it was ready.  I arrived right at the 20 minute mark from my call and they had my pizza ready.  There isn't too much to say about the inside of this pizza place except that they have a counter up front with very little waiting room and no customer seating, not that this is a bad thing.  Pizzas in general can be broken down into three separate components: cheese, crust and sauce.  The crust on this pizza was decently thin and cooked through but there were also a lot air bubbles in it which cause almost the whole area around the crust of the pizza to be blown up.  It also wasn't a very crispy crust but I wont hold that against them.  The cheese on this pizza was pretty good with lots of flavor and a decent amount of it.  Finally the sauce may have been the star of this pizza for me with a little sweetness and a decent amount of spices (oregano?) that I could taste.  The bottom line for me is that I would stop back at Ephesus again in the future.  Their pizza certainly had some potential and I would love to try a different one without all of the air bubbles.  The rest of their menu also looked interesting and I could see myself trying one of their Turkish pizzas.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "mZ3wR3DU-OKjk68tH2NHlg": {
    "date": "12/27/2016",
    "text": "Delicious seafood pizza with alfredo sauce.  Their wings are the bees knees-I get the garlic and mild mixed together.  Extra ranch too...always on point and always friendly fast service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jwvnLqZgJyeIrs7mtzDI3g"
  },
  "_jiF7sj4h4EvOuPQmd2e5Q": {
    "date": "8/25/2016",
    "text": "Food is slightly higher than average prices, but the quality is terrible. There are tons of better places in the area for cheaper. Pellegrino and Monte Cellos are two good examples. The sandwich we got was terrible. Mostly bread and burnt cheese. The salad was soggy. The pizza was gross.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oVp5dU3FfrS3Xgb_EcC-EQ"
  },
  "T7Bz83OicD67B8kiPoolsw": {
    "date": "3/10/2013",
    "text": "Good falafel. Not great, but good. Their pizza is good too. Sarah S. says that the buffalo chicken pizza is the best in the area. The grape leaves are hit or miss. Sometimes they are fresh and crisp, others they are mushy and gross.   For Bellevue, this has the best delivery med. food and decent pizza.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3DltS5Wr9MOntnc8StBFBA"
  },
  "8IxB5qwX6Qrh4BE4ROOQig": {
    "date": "11/15/2016",
    "text": "Standard Pittsburgh pizza shop. Edible pizza, standard apps, iceberg salads.   Convenient, and prompt. They will often day 45 mins for a delivery and its there in 15.  Delivery drivers are polite and respectful, and seemingly quite friendly. Great for delivery, usually have coupons or specials that make it very affordable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OcqT-ss0bEatgwfgU8QrFQ"
  },
  "imQVOc8VNP2RYWo5mf2OkQ": {
    "date": "8/31/2016",
    "text": "The pizza is great but the delivery time is ridicule and the driver always has a attitude.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mGXFsmIM9NymTZp0FEkuYg"
  },
  "_QVquREp2s9okKEXNIw8kg": {
    "date": "12/8/2013",
    "text": "So glad this place exists. I've enjoyed everything I've ordered.   Last time around I purchased: Pide with Spinach & Egg - Small pizza-sized, sliced. I like to cut up my food into smaller, less messy pieces so this is good for me. Comes with small lettuce and onion salad, a couple grilled veggies and dressing and cucumber sauce. Great deal for the price. Babaganoush - Comes with a thick pita bread and so tasty.  Not for those on a low-fat diet due to the oiliness. But maybe that's why it so good! Garlic Bread - Pretty standard GB at only .89 cost to you. Falafel - Maybe not the best I've had. Could be a bit more moist, bust still tasty. More cucumber sauce!  Looks like there is another entry for the same place here: <a href=\"http://www.yelp.com/biz/ephesus-mediterranean-kitchen-bellevue\">yelp.com/biz/ephesus-med...</a>",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "pf3PxVmuZsr345YTUFs9KQ"
  },
  "49GQ--mwxT1xvbFIX5Y3sg": {
    "date": "11/26/2014",
    "text": "Even though I only gave this joint a 2, I order pizza and wings from here a lot... It's the only place that delivers to my house late night! If you're drunk/hungry, don't hesitate to call. If you have some other options, well... Take advantage.   5 for taste, 6 for delivery speed",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ix1hv0nEeD8v5vU9_P69Cw"
  },
  "6vXSjNBwJyULrPoWy2hMRg": {
    "date": "2/8/2016",
    "text": "Ephesus is the best pizza in the Bellevue/Avalon area. When my husband and I moved, we were sad to be leaving our beloved pizza shop in Bloomfield. Oh, how I miss their delicious sauce, thin crust, and greasy cheese! Since our move, we have tried every pizza place around. Though we have yet to find any pizza we love, Ephesus is our go-to these days. The sauce is good and the crust is fairly thick and fluffy, though thinner than most pizza shops. Pizza is tastes and hits the spot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0NziGKOvk97_0p-oRlApUA"
  },
  "xiEanTX9JsCnGy4on9j8pw": {
    "date": "9/30/2015",
    "text": "I adore this place! My husband and his friends order their buffalo chicken pizza almost weekly. I love the ratatouille pizza. It is close to were we live, doesn't take long to deliver, they are always kind, polite, and just a good place to order from.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_nrVRhuf3m6I3xLac2YsuQ"
  },
  "KBA9sP6WFOKvuJm_4JBCEg": {
    "date": "8/16/2016",
    "text": "I placed an order for delivery yesterday evening from the Bellevue location. When I received my order, I found half of what I ordered was missing. I called and spoke to the manager thinking he would apologize and send the remainder of the order. Instead, he was rude and accused me of lying to him about what I originally ordered! I am appalled with his belligerence and disrespectful behavior toward a customer. I will never order from Ephesus again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R7gbYp4Xxuydb476-O5hQQ"
  },
  "r-hInXSIye9_JcCA6ZgjqA": {
    "date": "3/28/2017",
    "text": "They have great pizza and Kebobs etc. haven't tried something I don't like. The food is ready very quickly when you pick up and everyone there is always pleasant. The only reason I gave four stars is because the price of the kebobs. Other than this love the place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lNWy9TZS_4o4sIiC_17rwg"
  },
  "f4PdDo6-MTwtPZ9g-ngrUg": {
    "date": "12/1/2016",
    "text": "I was all set to make dinner tonight, but when I went to put the dang casserole in the oven, the stupid thing wouldn't turn on. I tried everything but to no avail. I decided it was going to be a pizza night and began looking for a local place that I hadn't tried yet. Neighbors recommended Ephesus, so I figured I'd give it a try. I went to the website which directed me to GrubHub. The process was so easy. I was able to view their menu, make my selections, pay and tip through the app, which this introverted tech savvy lady sure did appreciate. They said to expect it between 7:20 pm and 7:30 pm. It got here at 7:15, I crushed nearly half of it, and have time to write about it. I ordered a small pepperoni pizza. It came with ranch dipping sauce that apparently god himself made right after he created light. The pizza was delivered by a friendly guy and was piping hot even though it is fricken freezing outside. Pizza delivery doesn't get much better than this folks. Oh, did I mention that it was D-fricken-licious? No? Okay, well it was. I like gooey cheese, bready dough (not crispy) and it had both. I can't wait to try their other menu items. Gyros, falafel, baklava, delivered? Yes please!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hApedwwHRvn8ay-QjYDZnQ"
  },
  "gYj57KHgtFQuw2bjBGubWQ": {
    "date": "9/18/2013",
    "text": "This place is a hidden gem. On first glance they seem like just pizza place with the same carbon copy menu as every other, but on closer inspection you see they also have quite a few unique items. I have ordered from this place a numver of times and their Mediterranean items are whats really got me hooked. First I tried their chicken kabobs which were quite tasty. Then I tried one of their pides. Total yum sauce. Tonight I ordered their ratatoille pizza. Holy crap this is an amazing gourmet pizza! My new goal is to work my way through all their gourmet pizzas! The only sort of negative thing I can say is that their delivery can be on the slow side and they always seem confused by my apartment but my food always arrives and is delicious none the less",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ws3els5s4fHOnB36pq8bXg",
        "caption": "Photo of Pizza Ephesus - Bellevue, PA, United States. Pide Deluxe!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ws3els5s4fHOnB36pq8bXg/o.jpg"
      },
      {
        "img_id": "7dZi0Wo0xIUjGPfwdlzpMA",
        "caption": "Photo of Pizza Ephesus - Bellevue, PA, United States. Ratatoille pizza!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7dZi0Wo0xIUjGPfwdlzpMA/o.jpg"
      }
    ],
    "user_id": "Iwy5e5Bjf-xnSU_PtDj86Q"
  },
  "KdXUZt87v915DPwWQfIEgw": {
    "date": "7/19/2013",
    "text": "The Chorizo & Manchego gourmet pizza is AMAZING! I make sure that all my out of town friends try this when they visit. Pretty good wings, too. I look forward to trying more of their menu, but it's hard to break away from that delicious pizza.  Only reason I'm giving 4 stars is because they have some serious issues with their delivery service. I live 3 minutes walking distance and they don't recognize the street each time I call. They quote 45 mins, which turns into an hour, if it even gets to me at all the first time around. They were very nice about striking an item from my bill on a particular occasion.  I still highly recommend the pizza, especially if you can do pick-up and avoid delivery. So yummy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ISdVOnjN_OUHLpnhdHr5xA"
  },
  "sET7LNF7XwQXViBQaaghiA": {
    "date": "11/7/2013",
    "text": "Good I order from here on a regular bases. I like the pizza and hoagies the best. The apps are also yummy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e9gcBrC64HvCeBB-TuPFSw"
  },
  "EPyb2ePczsZb6N_ntTxoFA": {
    "date": "6/10/2019",
    "text": "We get pizza here all the time.  Good delivery, but my personal preference is to add extra sauce",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0QY1NP_X3pwilPnd3iv9WQ"
  },
  "jALtfY4OS31GDDxaFc193w": {
    "date": "7/21/2019",
    "text": "While ordering via phone: \"sorry we do t have any of the Mediterranean options here, that's at our downtown location only\".   Tsssk.... Then why does the yelp menu show those options, and ain't you specifically a Mediterranean pizza place? Ironic, no?  Ordered a Gyro pizza.   The name of this place should be Regular Old Mediocre Overpriced Pizza.  No offense to the staff who was working, they were alright other than their general unwillingness to help me figure out what I wanted.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7dOhZyyfEGis9l9NRBacEg"
  },
  "0uFnj3I4VvlJ_A87UwaaEQ": {
    "date": "8/2/2019",
    "text": "I love their pizza! The sauce is great and delivery is always prompt. My husband and I order from them frequently because we haven't found anything like it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RSq0la_hiQshfRp7Pgap6Q"
  },
  "Kvw9W6pxE5zrdtcCSyuhEw": {
    "date": "7/27/2018",
    "text": "Ephesus currently is the best pizza that will deliver to the 15202 zip code!!  The pizza is really good (though no pizza will ever be able to compete with my beloved Fazio's in Bloomfield). Sauce is good, not overly sweet like more and more Pizzaria's seem to be adapting. Crust isn't thin, and I would say more on the thick side, but not super thick. Besides the pizza, they make a mean gyro. Love a good gyro that uses fresh ingredients and not frozen lamb meat. Also... One of my husband's favorites to order from Ephesus is there kebab platter. Keep in mind that they are a Mediterranean restaurant and do make some very good authentic Mediterranean dishes.   Give Ephesus a try!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6RAe2L_w5SVzvlxvMvRS3Q",
        "caption": "Photo of Pizza Ephesus - Bellevue, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6RAe2L_w5SVzvlxvMvRS3Q/o.jpg"
      }
    ],
    "user_id": "iMEdq4yEjlhKJJpklTH2wQ"
  },
  "jcJo0NV9Wl2Jt4KMEy_5bg": {
    "date": "8/16/2018",
    "text": "I've been meaning to try these guys forever and they did not disappoint. I'll go out on a limb and call this the best pizza that is deliverable to the Brighton Heights/north side/Bellevue/Avalon area.   The sauce was great, and the cheese was cooked perfectly. It had perfect browning which I think every other pizza place in the area is missing. Generally when I'm trying a pizza place for the first time I keep it simple. I got a basic pie with one topping, though they have a variety of specialty pizzas to choose from. I learned that if you go directly to their website they have online coupons to apply to your order. They don't offer those deals on the yelp app...bummer.   We also ordered mozzarella sticks and they were crispy and perfect.   Next time you're looking for a pizza, look no further. This may be my new go-to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "jaij3nmMTFFguC67URtcxA"
  },
  "D8IXxSh7D6PfM0kNMxFV4A": {
    "date": "3/18/2019",
    "text": "I've ordered from Pizza Ephesus many times. It is my go to pizza delivery. The pizza is always hot and cheesy upon arrival and the ranch that comes on the side is amazing. I often judge a pizza by the ranch that comes with it haha. If you're hung over, this pizza will cure you every time. Love it! I'll be ordering again and again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sy_uis3d_sgIGodPZktQcQ"
  },
  "BE3ShZaT_o_ThK_jf5Lq0g": {
    "date": "1/29/2019",
    "text": "Pretty simple... ordered delivery and they never showed up.  When I called was told the driver said he set it outside my door? Which he did not.  Actually I'm still hungry.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fDABK7ezCKlVmcoMfiyeoQ"
  },
  "w62rkBpW8RL3gbodJG8UpQ": {
    "date": "6/24/2018",
    "text": "The delivery guy was ignorant and threw the bag of food at my teenage daughter hitting her in the chest  because she only had money to pay for her food and not a big tip. When she opened her food it wasn't what she ordered so I called them and they were not willing to fix anything nor compensate us on our next order. Also we were overcharged the pizza we ordered was 16.99 along with a order of cheese fries and the total came to 30 dollars?? Why and i never received a receipt.  So i won't be ordering from there ever again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cjSMZXUAF5lJjuoVzUXvJg"
  },
  "7L-TpXyvxgmdeuQxhoiL9w": {
    "date": "2/20/2019",
    "text": "This is a really good pizza place, we get salads from here a lot. But CAUTION, their \"buffalo\" sauce is a special super spicy sauce so if you're getting a buffalo chicken salad or wings, make sure to ask for mild sauce instead, unless you like stuff SUPER spicy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WP9e2YqFJRX_qIy_ThVkow"
  },
  "n__2cwHFOxd9c1YX2dbARA": {
    "date": "5/18/2017",
    "text": "This is the best pizza place in Bellevue. The food is always hot & always of good quality. Their Provolone cheese fries are my favorite item whenever I want to really indulge & forget about all health concerns. Lol! I always order vegetarian options there & I REALLY miss the breakfast pizza they used to have. This time, I ordered the fettuccini Alfredo for 2 people to split, so we got the family size instead of single size. We now have enough pasta to feed us for 4 days & a whole loaf of garlic bread! It was actually suprizingly flavorful compared to other pizza place's pasta dishes... but maybe I shouldn't be surprised because all of their food is packed with flavor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NKyL5I78GY01sXNQ-VroHQ",
        "caption": "Photo of Pizza Ephesus - Bellevue, PA, United States. Fettuccini Alfredo with Garlic Bread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NKyL5I78GY01sXNQ-VroHQ/o.jpg"
      }
    ],
    "user_id": "JeIVRtZiwUnSP9qR4AmfEQ"
  },
  "rLmIZfsPx8zM3ORk9hhwOw": {
    "date": "5/11/2017",
    "text": "I think this is more of a 3.5 but I am going with 4 considering what others have said about the gourmet pizzas because I definitely want to try them. I have only ever grabbed cheesy bread and plain pizzas. I really really enjoy the sauce and bread and the amount of cheese they put on it. However, I will say the cheese is always a bit gummy? I don't know how to describe it but it just doesn't chew very easily.   But honestly the sauce and dough make up for it so for a quick pizza I can't complain.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tJiWkQtxSmr4UdfEp-EYHA"
  },
  "5ftJtG5G-s4FsdY6O8o8zg": {
    "date": "9/29/2016",
    "text": "The pizza is very good. High quality cheese, plenty of options for toppings (if you're into that), and they deliver fairly quickly. They also have online ordering, which shouldn't be a big deal in 2016 yet is in Pittsburgh (go figure). Will definitely keep ordering.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2_N0-ub_ofu2m2VM_icspA",
        "caption": "Photo of Pizza Ephesus - Bellevue, PA, United States. Pepperoni pizza (they forgot the pepperoni)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2_N0-ub_ofu2m2VM_icspA/o.jpg"
      }
    ],
    "user_id": "EmrahJMelcioolXzG8TVng"
  },
  "WuL-nAOzAEI0ygondfp3Hw": {
    "date": "12/2/2018",
    "text": "Always deliver earlier than their expected delivery time and always delicious!!! Love, love, love this place. It's or go to for pizza deliver",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zESVR_81nghvjKrhqTMx6g"
  },
  "RYzjia56XDuhBadYTVu-uA": {
    "date": "6/23/2015",
    "text": "I was in the mood for pizza today - ordered take out - Small Greek Gyro Pizza $12.99 6 cut perfect to share (but today I couldn't).  I love a good gyro and was so curious about this pizza.  It was cooked just right - not overdone and.. with each bite.. I got different taste every time.  Ingredients include:  gyro meat, tomatoes, feta, provolone, black olives, onions and white sauce.  I usually would ask for light on the onions on any pizza because sometimes they can overpower the taste but the amount of ingredients was just right.  I did taste a hint of garlic too on the crust which was a nice surprise.    I am always in search of establishments that have different or unusual items on their menu... from Mediterranean appetizers to Turkish Pizza.. Ephesus has that.   This location is rather small only two tables in the dining area.   I am looking forward to going back and trying something else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QkQAaPonUbZZuTB5qEDYvQ",
        "caption": "Photo of Pizza Ephesus - Bellevue, PA, United States. Greek Gyro Pizza &amp;#34;Small&amp;#34;",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QkQAaPonUbZZuTB5qEDYvQ/o.jpg"
      }
    ],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "VRGgt6brt_LqWVa1wc2scw": {
    "date": "1/30/2017",
    "text": "1 word: Kebab pizza.   And hummus.   Open late. Free delivery. I order from here a few times a year and that's all I've had honestly. And it's smackin'. I would like to try the Moroccan chicken pizza with dates...and I've heard good things.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zuoNOQcSJT8igbbMx89kBg"
  },
  "98G_1gYDDTP9phPskhroow": {
    "date": "8/6/2017",
    "text": "For 18 bucks, there should be a heck of a lot more spinach on this \"medium\" speciality pizza. It was basically all dough. The lack of consistent reviews on here is warranted.  I've had my own inconsistency in quality from here, but was willing to give the benefit of the doubt. Thought I'd take another chance, I won't do it again. Disappointed is an understatement.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W7gGakyKWrHV3-FkLYCyBg",
        "caption": "Photo of Pizza Ephesus - Bellevue, PA, United States. 18 bucks. Where&amp;#39;s the spinach?",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W7gGakyKWrHV3-FkLYCyBg/o.jpg"
      }
    ],
    "user_id": "zIXsbnqCAHSK5ghC91IUlg"
  },
  "gWYPT4hhzgwxVUWNYGGRQg": {
    "date": "5/21/2017",
    "text": "Fast friendly great food. Plenty to offer on the menu, the only thing that I wonder from time to time as this location is awesome the downtown location not so much.   Hey downtown location take a page from this location's playbook they are doing it just right.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o2SUcC1-qN0yz3Rdg1w_UQ"
  },
  "bbTPweazHL8VSGmxt6XoIg": {
    "date": "1/10/2018",
    "text": "Lack of consistency, just ordered today and if you ask for sides(which I assume are built into the highish prices) they never give you them. This is like the third time this has happened and it's getting old. Their other location near south side is always 10 times better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zEYmgx7hj3_azHkk8anJuw"
  },
  "o09UJ5NqR-mkUKj6fnw-NQ": {
    "date": "10/2/2015",
    "text": "Was in town and just wanted to order a pizza and my brother and his wife suggested Ephesus. We ordered the a Lamb Shish kebab pizza which wasn't that great to be honest. The lamb didn't taste that great and was a little bit over cooked plus really didn't see the point of not having the lamb already on the pizza. Also the pizza seemed pretty bland without the lamb there wasn't any flavor to it and seemed that they really skimped on the toppings. it was basically like eating a cheese pizza with a little bit of lamb.   I do think they have a interesting menu and I would probably try them again maybe just stay away from the kebab style pizza or maybe just get a sandwich my brother said the chicken parmesan sandwich was really good and some of the other pizza sound good. Just didn't care for my first visit and it kind of upset me that they didn't honor a coupon I had for them.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "me31MkrOTfLvSCvtH-070A",
        "caption": "Photo of Pizza Ephesus - Bellevue, PA, United States. Lamb shish kebab pizza (Not that Great)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/me31MkrOTfLvSCvtH-070A/o.jpg"
      }
    ],
    "user_id": "V7o7yy2zxBFQXR2t5pvrRA"
  },
  "vgLMcaNb3nWmBIMZsTRBKA": {
    "date": "11/30/2015",
    "text": "Horrific.  $15 lamb kebob was so overcooked that it was dehydrated jerky. Imagine you don't marinate the lamb. You cut it into tiny pieces and cook it well done. You leave it out all night. You reheat it the next evening and deliver it to us. That's how dry this lamb was. The lamb came with this container of flavorless oil. Am I supposed to rehydrate the lamb in this oil? Argh. No grilled veggie in the kebob, It comes with wide steak fries (frozen and deep fried) and some Lovely tabouli salad.   Tabouli and Babaganoish: The fact that the tabouli is good just proves they know how to cook, and just don't care. The babaganoush was also delicious, making the pizzas all the more disappointing. Like... YOU KNOW HOW to COOK!   The Turkish pizza was delicious, but my husband and I both had acid tummy all night (we are a family of hardcore eaters not prone to upset) in the AM more in the family had acid belly. I thought it was stress. I ate more of the pizza. Had acid upset tummy all day. I adore ghost pepper and Carolina reaper infused oils so... There's a problem with this food.   I've tried this place twice. My friend eats here quite often, and loves it, so I wanted to give it another chance.... but both times I've had it.. It's been a disappointment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G_YTZENmNvgGYkJ2_2hjJQ"
  }
}