{
  "j6q23-gNsb4mw20tXkAI1w": {
    "date": "8/18/2013",
    "text": "I don't think I've ever been to a place with worse service based on lack of coordination, and maybe lack of communication with cooks.  The servers were friendly and they tried, but it would be like asking a child with mental retardation to work for NASA.  They forgot my grilled onions for my potatos.  Steak and eggs both overcooked.   No refill of coffee or water during meal.   No salt and pepper brought out for meal.  No hot sauce or steak sauce either.  No butter for toast.  Oh yeah, they actually forgot the steak with the steak and eggs.  I had to request for that again.  Only plus side, they had ample outdoor seating and open tables, they weren't too busy for a beautiful Sunday at noon, which is all the more baffling that they couldn't figure out a simple breakfast.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3mYtHMLACD-c2Kx-eeTrmQ",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. Corner of patio and building",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3mYtHMLACD-c2Kx-eeTrmQ/o.jpg"
      },
      {
        "img_id": "pu0Swp99v2ykaiqOM4NuKw",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. The glass isn&amp;#39;t half empty or half full.  Just empty.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pu0Swp99v2ykaiqOM4NuKw/o.jpg"
      }
    ],
    "user_id": "_yzhCTh29ytDVUVuIrklGg"
  },
  "AuFAHEJO-jSxjkLqiYPLsg": {
    "date": "7/29/2015",
    "text": "For some odd reason, I felt the need to begin my yelp career on a rough note. I have been to corner stone multiple times, the last previously my dad and I had a very frustrating experience due to service. Well, sadly I can say the service was so disappointing, it changed my day from being great to average. The mediocre service brought me down to finish what should have been a casual relaxing experience. Instead, it was painfully slow , and the food was the worst it's ever tasted. Thumbs down.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y-wZ6OfqZfRqNwp1wKiu6w"
  },
  "fSRfhvgtiEvhl4Og5j472Q": {
    "date": "4/17/2013",
    "text": "I stopped by here this past Sunday morning for brunch with my girlfriend and her parents.  We arrived shortly after 11 and were asked if we had a reservation.  Even though we did not, we were seated almost immediately.  The inside of the place is decent enough with a bar on one side of the restaurant mostly separated from the other side by a divider of sorts.  You could see through parts of it which worked out well for me as I could see the TV while we were eating.  For my brunch entree I was between the breakfast burrito and the potato benny.  My decision was made easy after my girlfriend decided that she was going with the potato benny and so I had the breakfast burrito.  It came with eggs, pulled pork, jack cheese, and jalepenos inside a tortilla with a side of home fries and a small cup of pomegranate salsa.  My breakfast burrito was very full and also very filling.  I appreciated the cheese and jalepeno inside of it and thought it tasted pretty good.  My potatoes were also very good as they were a little crispy on the outside, soft on the inside and properly seasoned.  The only odd thing that I found was the pomegranate salsa.  I guess I just was not a fan of the acidity of the tomatoes with the sweetness of the pomegranate seeds although it was intriguing.  My girlfriends dish was also solid and I liked their play on eggs benedict with the substitution of potato pancakes for the english muffins.  The bottom line for me is that I may come back here again in the future.  While nothing here was really good, everything was really solid and fairly priced so I can imagine giving it another chance.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "DKnXmZEUSZKevd1-PZkeBQ": {
    "date": "6/30/2013",
    "text": "We went for brunch today and wow, it did not disappoint.  Everyone else at my table got some sort of sugary french toast, so I thought I'd go savory, knowing I'd for sure get to snag a bite or two of theirs.  Before I even get to my breakfast, let me just say that the banana bread french toast is out of this world.  I *could* deal without the nuts but that is probably some of the most delicious french toast I have ever eaten. It was dense, sweet, and grilled perfectly.  I think I've found a new breakfast item to try to make myself sometime...  The strawberry french toast was not nearly as sugary, but, at the same time had the perfect amount of sweetness.  Combined with the strawberries, the strawberry french toast was a (seemingly) lighter but still sweet option.    My first choice was the carrot/pea risotto with duck confit.  I don't know what I expected, I was just very interested and feeling adventurous.  However, they were out of duck confit (sad face) so I went with the fritatta (tomatoes, smoked mozzarella, fresh basil).  I love caprese salad, why wouldn't I enjoy those flavors in egg?    It was very good, I got a bit tired of it halfway through, perhaps because I was full from banana bread french toast, but also because I get tired of egg quickly (my own fault for ordering a frittata...silly me).  The red potatoes and veggies that come with it were tossed lightly in spices and oil...there's something refreshing about keeping ingredients in a recognizable whole form.  Typically breakfast potatoes (e.g. hash browns or home fries) are full of oil, smashed in some way, or worse, shaped into some oblong potato patty...but these were just cut in half, and perfectly seasoned.  It all just seemed very 'fresh', which I appreciate.  Thumbs up to the chef!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BTKtAXjPHjH5B3xuT4uiIw"
  },
  "CGqNTXQAu1D-WnMhPVFwww": {
    "date": "9/2/2016",
    "text": "It wasnt our first visit, but probably will be our last. We were greeted by a young eyed space cadet in a collared shirt. I requested outside seating to enjoy a late summer evening meal. At almost 8pm on a Thursday. Table for two next to a couple of screaming kids running back and forth between their seats and Freeport Road. I looked over the sad drink list for the ten minutes it took for the waitstaff to acknowledge us. I thought they had martinis? I ordered a chopped salad with steak medium instead of shrimp. Fiance ordered a wedge salad and wings. 40 minutes later, we had to flag down the waitstaff to ask what was going on. She returned shortly with our meals explaining a large ticket was put in right before ours. (But all I saw was two tops) Undercooked steak on my wilting chopped salad and head of lettuce cut in half for his wedge. Read: a literal half head of lettuce. Wings were almost good. They were trying so hard to be good. We paid the bill and left. Fifty dollar bills underwhelmed and with upset stomachs. Bye felicia.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0XjSAsYmQDIzzggVZvjjNg"
  },
  "BHnyqwQL74rqTc7L3e3FfA": {
    "date": "5/10/2013",
    "text": "Stopped in for a SUnday brunch whilst visiting in Pitt and were treated to a tasty meal.  I opted for the sweet with Cinnamon Sugar french toast that was supposed to be a cinn-bun spin but didn't quite deliver.  They oversold the \"icing\" which didn't really exist and played it off with \"it's on the outside\" referring to the crust.  No, that is not icing, that's a glaze.  Still, it was tasty and the bacon was really nice. The husband got the potato benny with poached egg,  hollandaise, and salmon (our friend got the corned beef on his) and it was delicious.  I would TOTALLY order that again.  In fact, i might make that for breakfast tomorrow....  =)  All meals came with a fruit salad that was an odd mix of fruits with a flavor that did not blend and i, and avid fruit and veggie lover, did not care for the flavor.  This could have been a 5-er...  So close, yet so far.  The big knock down came when i read on the menu \"maple syrup\" and what they had was not in fact REAL maple syrup but flavored corn syrup.  Sorry, i'm a real maple syrup girl and if you don't know the difference...  It's just weird, but i'm an upstate NY gal.  That aside, it was a delightful meal for a decent price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ED7fXMpz8F890Zs1ev1QuQ"
  },
  "Lm7TLrGbmqEblOC__b0Edg": {
    "date": "1/3/2017",
    "text": "I have been here several times. The food is always c consistently amazing. I have never had a bad meal or service there. And I used to be a manager in a restaurant in DC.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qm5e6Xp1yNVvNdEdVfhAug"
  },
  "AIteozrcxdwaR9WJ59Gu-g": {
    "date": "8/17/2015",
    "text": "This place is just not that good.  Every time I go here.... It just misses the mark.   The service was not very good. The server was not friendly at all, and messes up the timing of orders.   The food was average.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R2WPxxtYsVeODrJexPVpww"
  },
  "kNj9Qw2pyfZAe0yEL9JdUA": {
    "date": "7/27/2016",
    "text": "Nice restaurant with a friendly atmosphere. Drink prices are a little high though as well as the food prices in regards to portion size. The food is fairly good there. There just isn't much on the plate especially when I've been there for lunch. Paid close to $15 dollars essentially for a Oscar Meyer Lunchable sized meal. I left there sort of hungry. Sadly the cons out weigh the pros here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HHpogxvD5tKkcbeOiVNiNw"
  },
  "PBcG4DRUEW7zwVpDEXgcyA": {
    "date": "10/31/2012",
    "text": "I have been to Cornerstone several times, twice for dinner and a few others for drinks and snacks.  A friend lives walking distance down the road and it is a great option if you are in Aspinwall and want tasty food and outdoor seating.  Last time we visited they even had blankets at every table since it had gotten a bit chilly in the evening.  The food is good- nothing out of the ordinary but good ingredients and prepared well.  My first dinner there I had the lamb burger and sweet potato fries-- you could put goat cheese on almost anything and I would be a happy camper.  Second time I opted for the soup of the day- a delicious smoked corn soup- and the duck taco appetizer as my entree along with bread pudding for dessert (I typically avoid dessert but it was a little bit chilly outside and this really hit the spot!).  While the food is good, it is overpriced.  $13 for a relatively small burger and fries... $20 for my soup/tacos/bread pudding (and those \"tacos\" were super small) plus another $5-6 added on to each for a beer.  I'm all of 5'1\" and don't require huge meals, so for these prices I should be able to fill on up!  The atmosphere at Cornerstone is great and I am sure I will continue to stop in with my friend from time to time, but there are definitely better places to get more bang for your buck!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zTCC1-ITmJvo14PxINcw6g"
  },
  "LO4yBg7CwEBsBJZMitogWA": {
    "date": "7/22/2013",
    "text": "I try not to judge a place by one underwhelming meal, but...  I had the baby-back ribs, and come on, y'all, I'm originally from Tennessee and didn't even know you could mess those up. The ribs I had were dry, under-barbecued, and generally hard to get down, even for a hungry lady. The sliced zucchini on the side was so salty they were totally inedible. The corn-on-the-cob was, well, corn-on-the-cob.   Prices weren't cheap either. It's unlikely I'll be coming back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fWKX5uIdGjAcsyiHWqxerg"
  },
  "yGQXznW53D1W_9wkF6uM1A": {
    "date": "6/26/2016",
    "text": "I'd like to give this five stars, but I just can't. It's too inconsistent. I've gone there and had excellent meals and I've gone there and watched the bartender meticulously measure a glass of wine to the exact 5oz. mark and then pour out the excess ounce in the sink before serving it.  Seems a bit pedantic to me when you're charging on average $11-$14 per glass.  Definitely try the wings, the flatiron steak, and some of the small plates. The ice cream sandwiches are great for dessert. Avoid the veggie burger since they revamped the recipe (the old one was so good! Why did they change it?!), and some of the pasta dishes can be a little bland.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E8-VH5arI8tumB6Fiv1srQ"
  },
  "jVtCT9XzetXIneZ54pHaHw": {
    "date": "4/26/2012",
    "text": "It's a great place to eat and of fun.  I eat there three times a week. What great food they have. Please come and tease it....  You can bring a friend and have dinner also.  It's a great place to meet people and eat dinner, and have a couple of drinks.  I go there four times a week. It just great, the food is to go.  I love eating there. The food is more than great. Try it sometimes yelp!!!  Great food and having fun!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6gGRtiXRdUS2PbFlu2QmZQ"
  },
  "pqJt4LOkZcTEa8Zq6rkySA": {
    "date": "5/4/2016",
    "text": "Absolutely incredible! I had the filet and a classic lettuce wedge and both were absolutely phenomenal! Will without a doubt come here again if I am in the Pittsburgh area! Loved it! Service, food, atmosphere! All outstanding!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nxdEyMbjOzVKB84CBCRJVQ"
  },
  "j4rxCA9ix6gmFXV1Alv0jg": {
    "date": "1/17/2015",
    "text": "After a number of visits over time, I have grown use to the inconsistency from the kitchen.  One day it is actually pretty good and the next you are wondering why you bothered. But what is most annoying is the inconsistency of the staff as to what actually constitutes service.  There has only been a few good staff who actually knows what it means to be of service.  I attribute this problem to the management and the attitude that they are somehow doing you a favor by serving you food and wine.  And what is really happening is that amateurs are trying to run an upscale restaurant.    So inconsistency will remain the order of the day.  There is no other possibility.  New chefs come and go.  The food gets better when they happen to be good.  But this is a grossly mismanaged affair and there are better options close by for the money.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dZPb7E7DbOrIASu0SPgZsg"
  },
  "uGv8n8rSOjQS9NO9e2Cj7w": {
    "date": "5/31/2015",
    "text": "Really good brunch. Our party got the Vegetarian hash, Tiramisu pancakes and Cinnamon swirl french toast, with Mango and passion fruit Bellinis. Everything was delicious, despite several mistakes on our order. Excellent poached eggs and nice density of pancakes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xDvmXkmLTUSoJw510hqNTg"
  },
  "dUspFI4UUDD-O2kVGO7JtA": {
    "date": "8/4/2016",
    "text": "Have overlooked cornerstone as it has been there forever...but food is exceptional. Best Sunday brunch in the area!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5aGQt51subjg_DCtoF6KOw"
  },
  "KJ4jdNs8sbzkJrfE36mBlg": {
    "date": "1/18/2016",
    "text": "I really wanted to  appreciate this restaurant, so I decided to return after a couple disappointing meals over the last year and a half. As a patron who values good food, and as a professional Chef, I really was incredibly disappointed again. I certainly appreciated our fabulous waitress who was very apologetic, accommodating, and embarrassed, which was the word she described for her state. She was certainly what kept me from walking out.   It is very shocking that this restaurant can stay in business. I will not be returning to this establishment and will not recommend it! The food must be more consistent, palatable, and edible!  The mussels that we had came out with half of them closed and the other half extremely over cooked, spoilt and warm. And when we asked where the bread was, we were told they did not have any due to their week off during renovations. WHAT???The first attempt at the crab cakes came out in the form of something that resembled a crispy potato pancake, flat and very very burnt, and much different from my last experience with ordering these. Although that issue was redeemed by the kitchen and waitress by sending out a fresh pair, the damage was already done after the first 2 courses. I ordered a salad asking specifically that there were No Walnuts on it due to a rather severe allergy.  Unfortunately the salad that came out was riddled with Walnuts causing a reaction. Although comps were made to a few items, that did not satisfy our dissatisfaction. All in all, I am incredibly disappointed and will never ever return!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xRgvSeueXfZ1O6xBteN0gA"
  },
  "Zu2vH3yyy5Yf7xshi-nbiQ": {
    "date": "1/16/2014",
    "text": "On a recommendation from a friend, I came here to lunch today. I was seated quickly, the host gave me a menu; it looked interesting, nouveau American, emphasis on goat cheese, feta, blue cheese dressing, slightly above the bar kind of lunch fare. Unfortunately the lone waitress couldn't be bothered for over fifteen minutes to take my order or even acknowledge me beyond silently giving me a glass of water. The host asked whether I had been waited on -- I shook my head no; he went into the kitchen and said something to her. She came out of the back and cleared some plates from a table, still refusing to acknowledge me (and I'm a normal, pleasant looking guy in my fifties.). So I got up and left.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOmDSeE2n9jekxjKQ79NaQ"
  },
  "cmaVzlh2UdT0u2XfhjVPHw": {
    "date": "4/12/2012",
    "text": "How cute is this place!  A friend had her bridal shower here in the little back room, and it was so perfect for what she needed.  Small space, but enough elbow room, and great food!  We had a little brunch buffet with some mimosas (hell yeah!), and it was super tasty.  Not your typical limp buffet bacon, it was thick, cooked perfectly, and delicious.  Fluffy pancakes that were literally the same size as the inside part of the dinner plate, and plentiful whipped cream.  Just enough food to hold you over.  The staff was very nice, and everything was picture perfect.  I wish I could have parked closer though!  The parking is atrocious (as it is everywhere in the 'burgh), but I did enjoy a nice stroll through Aspinwall (it's like Pleasantville... who knew?!).  Also, maybe the staff should have erased the \"Thirsty Thursday\" advertisement from the chalkboard in the party room.  I wasn't offended (thought it was hilarious, actually), but I can see how someone's grandmother could be.  Aside from those things, beautiful party in a beautiful location!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Sx-NgLzyCBBWT-IKBt9Fw"
  },
  "arEx9w18aFsN8-6Pb7KjlQ": {
    "date": "8/9/2015",
    "text": "I am disappointed in the service at this restaurant we waited half hour to be seated while atleast 7 tables were open. After seated we waited20 minutes for a server it was another 10 before one showed up. No apologies as to why we were not attended to.   Some of the food was good some not so good, we were served French toast burned on one side. Putting the burnt side down hiding it doesn't mean the customer won't see it. I had over easy eggs that were over cooked, broke & cold. Out of 3 meals one 1 did not have an issue.   From prior reviews I expected them to be spot on good service & good food. I will not spend my money there again I can get slow bad service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ffn8uvi9v9r2lyF7iNT9Q"
  },
  "q_dY584pU1qsYby8RaVrMA": {
    "date": "12/14/2014",
    "text": "From beginning to end, an amazing meal.   There were 6 of us and the wait strafe were more than accommodating and friendly.   The scariest moment came when we went to order desert, only because there were so many amazing looking options. Luckily, the 8 year old girl at the table behind us was kind enough to recommend the sundae. That kid has a bright future.   Small bar, appropriate for families or adult with amazing food and a solid collection of wine, beer and cocktails.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uc1T9NGhFtXXD8cQlJm8Uw"
  },
  "gbhhpSr3P0ht05gd6COSKQ": {
    "date": "9/24/2017",
    "text": "The food was fine but the service sucked. Sat outside, Sunday afternoon, beautiful day, only two other tables outside... Our whole meal we watched and listened to a server from the restaurant talk to a table sat near us. She stood there for at least 45 mins in 2 different 'visits.' Not only were they not trying to talk quietly, but the girl sitting at the table had the most loud and obnoxious laugh I've ever heard in my life... it was like something from a Seinfeld episode. Once we got our food, we were virtually ignored, while a waitress stood 3 feet from us talking to her friends and we had no water and dirty plates in front of us for about 20 minutes. I know we weren't at her table, but she could've at least noticed and told the guy who was supposed to be waiting on us that we needed some attention. Sadly people nowadays don't notice anything and stay in their own little world of \"that's not my table/problem.\" They make a really good Mojito here but the service is definitely lacking. Had to go inside to ask for our check, and our server was chatting at the hostess station. This is the first time I have ever seen my husband give a really really bad tip, even though well-deserved. Wake up people!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e7fdnUmNDBc3oMjQMqIn0A"
  },
  "cxI7hlQ4SaECzd0Gg38KHQ": {
    "date": "10/14/2017",
    "text": "Had late lunch here with a friend just before school started in August.  We sat inside to avoid the traffic noise.  It was empty except for one table that finished shortly after we arrived.  The server was attentive and the food was quite good - especially the Brussel sprouts!  We both enjoyed our meals and the kind staff who let us chat for a long time after we finished our food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L0Z7-gRCbVZ_cTUL6z0Lgw"
  },
  "2nqrhoOlI2HGkOrrdwnHbg": {
    "date": "7/31/2016",
    "text": "Brunch is delicious. The West Coast and The Veggie Benedicts are outstanding. The eggs were perfectly cooked and the hollandaise sauce was exquisite. Thanks Jeff for the good service. And the prices are right in line w such great food, service, and atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "B2atT91t-eMDrk8idx07rw"
  },
  "45e4CYLoSNy-xKlyCCeibw": {
    "date": "7/2/2016",
    "text": "Service was ok but the food was bland. Nothing spectacular. Got the veggie burger, it was very boring and tasteless. Would have been better off going to burgatory.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kvRNweWWbKuTGrNBg2f5_A"
  },
  "xwvJX7PjBpLZebFQKimTmA": {
    "date": "5/20/2015",
    "text": "As an out-of-towner with high standards for brunch, I was very satisfied with my meal here. Service was excellent and our waitress was very attentive, informative, and she also had a good sense of humor. I ordered the tiramisu pancakes. They are a game changer! I've never seen that before in all my pancake-eating years (and I eat a lot of pancakes). I was hesitant to order chocolate pancakes with coffee marscapone (which I got on the side) because I thought they would be too sweet/rich, but this was not the case. There were 3 small-ish pancakes, with a side of two eggs and some fruit. Everything balanced out and I felt full but not overstuffed! This place also has so, so many beers on tap. The tiramisu pancakes pair well with Dogfish Head Aprihops beer, just saying. This restaurant let me live out a dream I didn't even know I had, which was to have pancakes and beer for brunch. Highly recommend, fair prices and good food. Everybody at my table was really happy with their meals. Ambiance/decor is mediocre but go for those tiramisu pancakes!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1BLL7Dp4Fiv0NAEyeZTgQw",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. Tiramisu pancakes and beer, a match made in heaven",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1BLL7Dp4Fiv0NAEyeZTgQw/o.jpg"
      }
    ],
    "user_id": "t1yEAhERoVXywVte_6a7bg"
  },
  "gjgT3ygmK3iqnFSWX5bw4w": {
    "date": "5/7/2016",
    "text": "This is a really cute little restaurant and the food is always great.  If I had a complaint it would be that it is kind of expensive.  I love the veggie burger here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Di_qKtEpCOIsEWvveWtVpQ"
  },
  "IFEwtLup4g2QlDeUcNFlbw": {
    "date": "7/19/2016",
    "text": "Similar to other brunch spots, the key is getting there as close to opening time as possible or else you'll be kicking yourself for not completely charging up your smartphone. Likely seasonal, their brunch selections are twists on old favorites. Sweet. Savory. Something for everybody. Ingredients are fresh and locally sourced. And service was on point. This particular space has had a lot of turnover thru the years, but Cornerstone has proven itself and should be on your radar if you're traveling the Route 28 corridor. If you have the time walk across the street and check out the Aspinwall Riverfront Park.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YhkTKKMo9UQmdcxx_umxPA"
  },
  "QfPInqTZOjuvFcWZTlBiiA": {
    "date": "8/1/2016",
    "text": "I went her a few times for a lite dinner and cocktails but yesterday I went for brunch.  The veggie eggs benedict was outstanding!  White asparagus, roasted tomatoes, kale and a two perfectly poached eggs.  The Hollandaise sauce was just the right amount of citrus and creamy flavor.  It was on the lighter side and not drenched all over the eggs and English muffin like most places tend to do. It is also reasonably priced and they have some fun brunch cocktails as well.  I got the high Cornerstone Highball and it was incredibly refreshing with a nice zest of pink grapefruit.  The outdoor patio has abundant seating but I prefer the tables for two inside by the bar since it's usually only one or two in my party.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AxFluVrPUVN0pPBX7LD--A"
  },
  "knEEqNUbhm4SjbamcNtxMQ": {
    "date": "2/6/2016",
    "text": "Very good food - drinks were great - staff were polite and efficient - cozy, trendy space -- will definitely return",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "9L7utWSCqkolsSmDf1Yk6Q"
  },
  "a4I_Lkuz-ueBg1_WU_JDwA": {
    "date": "12/22/2015",
    "text": "Had lunch here today and I won't go back. We waited 45 minutes for salad and a half of Reuben. We ordered sweet potato fries and they came out Luke warm, sent them back and got the same thing. My Reuben came and the meat was shredded and falling off the sandwich. I've never seen a Reuben with meat shredded, couldn't even taste it. After complaining the manager comped our lunch. I still won't go back. This was second time that we weren't happy with this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "DzUqTZY2TzstDQpWmcS9pA"
  },
  "H0SY5Ti2bdoIP_lzZlAFMg": {
    "date": "7/6/2014",
    "text": "Had brunch here on a Sunday and thought the place was terrific.  I had their pancakes, while the table also ordered the Cornerstone Hash and the Duck Quesadillas. Everyone thought their food was delicious!  Service was great, and the restaurant is a feast for the eyes in terms of decorations. The outdoor patio is a feast for the senses too.  Come check our this place!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rBjozHc0BkxFxZMzQRg6hQ"
  },
  "FldZTxulElicw-iStq1eHw": {
    "date": "3/5/2016",
    "text": "Great brunch. The cornerstone hash brisket was delicious and hit the spot ! Also recommend the peach Bellini :) Walked in on a Saturday around noon and there was no wait. Grabbed a seat at the bar . I will be back in the summer to seat out on the patio ! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yf2gT945duBP2iSdYKyJAg"
  },
  "7VBPqrLcXWsMVAro1E7j1w": {
    "date": "3/20/2016",
    "text": "Disappointing. Having been to cornerstone several times before for brunch I decided to go again with my friend. I raved about how good the potato Benedict was having ordered it multiple times. Unfortunately this time around it wasn't. For some strange reason they have changed the crispy shredded potato pancake that forms the base of the Benedict for a mushy potato patty. Huge mistake!!! It completely takes a breakfast that was a \"10\" down to a \"6\". If your reading this, management, make it the way you made it famous!!! The poached eggs also came out well done /hard yolk. We were only one of two tables at 1pm so there is no excuse for a poorly cooked egg. Someone has decided to cut corners, save money, or find a faster way to make these dishes and in the process ruined what was a spectacular dish. Come on!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P_spnXIbdGAfkoux2C9iBQ"
  },
  "GcExvpfq86t1WMLwqH_k-g": {
    "date": "12/30/2016",
    "text": "I love this place! I come home to Pittsburgh about once a year and I look forward to eating at the Cornerstone. The menu is diverse and well executed. The waitstaff is friendly. This year I happened to come on a Wednesday and it was Lobster Night, and was pleasantly surprised by the excellent quality of the seafood (I live on the coast and am usually biased about seafood in landlocked places) I highly recommend coming here with your family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sZFI8uqZI-fU8TiM43Dn0w"
  },
  "5nTlfM5BgRz7qTT9jGKtqg": {
    "date": "4/1/2013",
    "text": "I don't normally write reviews for restaurants but this was an odd and frustrating experience.   We had reservations at Cornerstone on Easter and called to ask if we could make our reservation time earlier. We were told to come ahead and that they would \"work us in.\"  We arrived and were seated in a few minutes but after 10-15 minutes, we still hadn't been greeted by a server. Since it was a buffet, we decided to fill our plates in hopes that a waitress would stop by. Never happened. We were there just under an hour total and no servers stopped by or asked for our drink orders. Not even a \"Hi!\"  We were frustrated but decided to pay the check and leave. I managed to find a server and asked her for the check. We finally got it 15 mintues later only to find a 20% gratuity had been added for a party of 5. Who does that?!?  I talked to the manager, who was kind and responsive. After a few minutes, she came back saying that their computer was down and our meals were on the house (!!!)  Predictably, my credit card bill shows that our meals were NOT on the house. We were indeed charged for our meals but the gratuity was removed as asked.   That said, the interior of this restaurant is cute and the setting intimate. The brunch buffet was small but delicious and varied. While the food items weren't particularly creative, the offerings were well prepared, fresh, and tasty although expensive (Over $20/person for the buffet).  In sum, I really want to give this place a second chance but there is no way! When you ignore a party of 5 for their entire meal on Easter Sunday, walking past multiple times, there is just not much that can be redeemed, even if the food is good.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "cBj0RFmMy3msLJ581ApHjQ"
  },
  "UrnnfB-KeV0orIHaeVt3Yg": {
    "date": "9/22/2013",
    "text": "We've been here a few times now, and the food is generally very good (lamb burger is really tasty) but the service is another story.   When we showed up today for a late Sunday brunch the place was nearly empty and three ladies at the hostess table but none seemed to want to be bothered with seating us.   After we were seated we were given two sets of silverware... For three people.   When the food finally came out, one breakfast entree was completely missing the fruit topping. We had to ask another waitress to correct it because ours kept vanishing for long stretches. Getting our dishes cleared and the check was another chore.   We've been there when it's very busy on Sunday mornings, and it's understandable when things get missed because its so hectic, but when you've got one, maybe two tables to deal with there's no excuse for not being on the ball.   I hate dinging places solely on service when the food is really good, but based on the other reviews this seems to be the norm here rather than the exception.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WUeXlUjg_caEjL-U5lZHsg"
  },
  "HdXqNbO3-7i9jUG5hmY35Q": {
    "date": "2/21/2015",
    "text": "Living down the road from Cornerstone has been the main reason for the many visits. First, they have fabulous happy hour specials every single day with drinks AND food. If living in this area with the minimal night life, and many BYOB restaurant's... this is nice! Now, I've ate at the bar, lunch, and dinner at this point. For lunch I've had the salmon sandwich, which was actually very good. I've had the steak salad which was also equally as good. With trying plenty of the appetizers, none of them are anything to write home about and the bread always come out cold.  When looking their entrees, the prices are over the top and you have to add a salad on for $2. In my opinion they are trying charge fine dining prices for a local mediocre place to eat. With that being said, the ambiance doesn't give those high dollar feelings either. I've never had an issue with service, it's always dead by 8 pm even with how small of a place it is.  Bottom line, great happy hour deals, decent but overpriced food. I'll be back since it's only a few blocks of way and enjoy it, but I'd say it's not worth traveling to Aspinwall for. There are dozens of better places for your buck!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "eYnS0WVYYykN_gRuMUzoOw"
  },
  "ZiJ1I5maxyR-0HpZ8jTGNA": {
    "date": "11/14/2015",
    "text": "Bartender plays great music and is a nice, cool guy.  What else do you need ?   They have a great brunch which can be quite a scene.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rp007n5XVLGJwIOTh9U0-g"
  },
  "d6Jgnyn5Pqdqy1yWk287rQ": {
    "date": "2/8/2015",
    "text": "Came here for brunch and was incredibly unimpressed. Being a major foodie, I was disappointed by this meal. I got the vegetable hash and it was a greasy mess. The Brussels sprouts tasted weird (this coming from an avid lover of Brussels sprouts) and it was pretty much a bowl of potatoes. The two other people with me got omelets there were pathetic, especially the truffle omelet that barely resembled a hint of truffle. We also got the bananas foster bread pudding to share for the table, and it was sub-par. The sauce had a corn-syrupy consistence that just did not lend to the overall taste.  Our waitress was not personable. She didn't even tell us her name. Definitely not impressed by the service.  I would never go here again and would steer people away from this restaurant. There's no doubt I could make a better breakfast at home.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9PZEnbdels_L3sDLZZGwgA"
  },
  "yKh3p-FV56unpliKJMyXWQ": {
    "date": "11/12/2014",
    "text": "When looking for a place to treat a friend for brunch, I remembered Cornerstone.  I've had it bookmarked for awhile but kept putting it off.  I would drool over the brunch menu but then would be turned off by some of the negative reviews regarding service.  But finally, one beautiful Sunday afternoon, I took a seat at one of their outdoor tables to enjoy a great meal on a great day.  Service was good until we tried to pay our bill and getting change for our cash seemed to be a challenge for the wait staff.  But refills were never a problem with our drinks and food was presented in a timely manner.  That being said, I will most definitely recommend Cornerstone for the brunch menu.  My friend enjoyed the Porky Pig and I devoured the Potato Benny, both versions of eggs benedict.    I wouldn't hesitate to return for a lazy Sunday brunch during warmer weather when I can enjoy the outside seating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "WoKCLSctS7G2547xKcED-Q"
  },
  "p_1s3h1Y7GzekPLgWBbT7Q": {
    "date": "12/11/2016",
    "text": "This place is a sweet little gem in Aspinwall. We have been numerous times, and it is always delicious! Whether you are out for a nice dinner, just drinks, or at afternoon brunch, Cornerstone is a solid choice.   This past week I spent two evenings here, one for a work dinner and another for a simple and satisfying meal with my husband. The first meal was a larger party, about 9, but service was quick and efficient. We shared the Brussel sprouts appetizer, and it was delicious! The sweet honey sauce mixed with the spice of pepper is unique and tasty, and sprouts quickly disappeared. Compared to a similar appetizer at Ten Penny, these win for sure. They are not swimming in sauce, and you can still taste the Brussels sprouts. My dining companions also had the flatbread, which they deemed great as well. I ordered the pulled pork, which I had enjoyed on previous visits, and it did not disappoint. A generous portion, if has just the right amount of sauce. Others in the party ordered the lobster Mac and cheese, catch of the day, chicken and waffles, and pork chop. Everyone raved over their meals and many had leftovers for another day.   The second night we sat at the bar, and also received excellent service. We each had a glass of wine from their extensive list. I have also had cocktails here, and they offer strong drinks with generous pours. For dinner, had the smoked wings, which were delicious. They first brought them out with a dairy-based slaw on the side, which had leaked onto the wings. I am lactose intolerant, and once I said something our waitress immediately asked the kitchen to make me fresh wings without slaw. They were hot and fresh, and I appreciated their quick and kind attention to the issue. My husband had the steak, which was cooked correctly but a bit under-seasoned.   On other occasions I have also had the pork chop and the chicken chili, which are both excellent meals. Overall this is a nice, unique restaurant with a great menu. We will go back many more times I'm sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 11
    },
    "photos": [],
    "user_id": "KAsmY6WCUWRYQXE_50AkQA"
  },
  "w-oWqaOTKMd5HCeh-r47BQ": {
    "date": "3/19/2018",
    "text": "I've seen preschools with more generous pours than the bar at Cornerstone, Gerber baby food with larger portions than their kitchen.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gxgpTIbg2LBColfcVFKWkA"
  },
  "hAoR6UlrTMWsVN-DEWTXoQ": {
    "date": "2/19/2014",
    "text": "I stopped in here for lunch this week. This was not my first visit to this restaurant. I want to be fair and say most of my stops here have been better.  I went with the Grilled Chicken sandwich, vinegar slaw, and a pickle. I also had a Palm draft with my lunch. The meal itself was very good. The food was hot, bread was fresh and overall it passed the grade.   Let me lay it out. We sat at the bar, the bartender/server seemed scatter brained...made several errors. She actually came back and asked if I ordered a completely different lunch! She didn't write anything down. My lunch mate dealt with even more issues because she wasn't paying attention. Add to the fact she committed a major no-no in my book. She cost the establishment money because I wanted a second beer and she was too out if it to ask me or push it. Do I look like a person who doesn't need another beer?   Anyway, I like this place. This was one of several times I have been here and the menu is fun and you will enjoy it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6p4ZM-_2XqAaLIZnELA85g",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6p4ZM-_2XqAaLIZnELA85g/o.jpg"
      }
    ],
    "user_id": "Rem81Xoev05aqeA-mFbM4A"
  },
  "ey2nyUuFutGaPKB4DaV-Pw": {
    "date": "6/6/2014",
    "text": "Fins up on Wednesday nights in the summer for Lobster Night!    Ok, it's not a Jimmy Buffet restaurant, but the Fins Up! reference is to let you know that a good nautical meal can be consumed at Cornerstone.    Located in Aspinwall, right off of the main drag of Freeport Road, Cornerstone Restaurant is not a place I would have typically went to on my own. However, a neighbor sent an email alerting me to LOBSTER NIGHT and off we went!  Reservations are strongly recommended for the Wednesday Lobster Night.  We were seated within a few minutes (because we had reservations) and sat at a table already equipped with lobster bibs and shell crackers.  The excitement was mounting since the stage was set, but the table next to us, who were sat a few minutes after us, were approached and served first.  It took about ten minutes until we could even order a drink.    The decor is so-so, no real theme prevails and with the high tin ceilings the acoustics are not great and holding a conversation with those seated across the table called for talking louder than I usually prefer in a restaurant.    When the lobster finally arrived (it took about 45 minutes) I was pleased.  This was a nice sized well-cooked underwater beauty.  Served with a side of yummy fries and cole slaw I was happily sated.  My review would be higher had the service been quicker (ten minutes to return with our checks) and the ambiance a little better.  Will I come back?  Possibly, but only for LOBSTER NIGHT!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYTpi63Tv_UTjsaTMCZUvg"
  },
  "Cc6SQdd_TOdRv82WSNo4UQ": {
    "date": "1/29/2017",
    "text": "Best burgers and sauteed veggies ever! The burgers are huge and juicy and never overcooked. The service is wonderful too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "scEIChXMP8mLnSihDGBicA"
  },
  "Ob9Mxcs6-C0JFoYii_9shw": {
    "date": "2/19/2014",
    "text": "Went here for lunch and this is what's up.    Cute place, arrived about 1:15pm on a Monday, so you guessed it not busy.  Ate in the bar section.  I saw one table in the dining room section and about 3 women at the bar having drinks.  I looked over the menu which seemed unique, the bartender/ waitress was not unique.  Not extremely friendly but not outright rude or anything just not what I would expect.  We asked is there any specials, to another lady who seemed to be the Manager maybe an owner since she was conducting interviews in the middle of the bar.  Weird...  Anyhow she said we don't do specials just different soups of the day.  Ok I say, what kind you got?  Chicken Chili and Chicken Tortilla.  YUM I thought... So on the menu they had pick half a melt or Ruben and get soup for like $9.00.  I was trying to decide on which melt and thought the Duck Melt sounded good, so when our bartender waitress came around I proceeded to order that.   I said I will have a bowl of Chicken Tortilla soup and the duck melt, she says chicken chili, I said no the other one.  She again says chicken chili I said no we were told you have chicken tortilla.  She proceeds to say that is not ready it would be like eating mashed potatoes.  Well that deflated my excitement and I briskly changed to a burger, that was supposed to come with gouda, bacon, and mushrooms.  I was a little upset at the time it took to come out we were there almost an hour and the place had less than 10 customers and most of them were just drinking at the bar.  She brought our food and we began to eat so here is the conclusion.  I am going to rate it a 3, and here is why.  My burger Cornerstone Burger was supposed to have mushrooms, and it didn't (I should have said something but she wasn't around and it was taking too long anyway).  The waitress/bartender was not good, she should have written things down (this is due to after taking our order she came back out like 8 minutes later, and asked my friend about the duck he wanted to order.  He ordered a chicken sandwich.  She said to him you said something about the duck (argumentative), I said, No that was me remember then you told me no soup so I changed my order?  She nods and walks away...ugh) Also I thought for the amount of people in there they were slow in the service department.  I know it is better that she told me the soup was not ready than to serve me something bad but the other lady who appeared to be the manager shouldn't have told me they had that soup.  And the gouda cheese had that inedible rind left on it so I had to take it off myself.  I did really like the food though. The side salad I got with my burger was super tasty.  It was spring mix with pickled red onions, cranberries, and like a candied walnut with Balsamic dressing.  Very good. The burger was also tasty, nice bun, nice job cooking it, just was annoyed by the lack of shrooms and the cheese that I had to pull off and take the hard as rock rind of off and put back on the burger.  I would go back but I don't see it as being a place that you can be at unless you have a lot of time.  And I know if I were drinking I would have been pissed because I am certain I would have sat a long time for a refill as my friend did.   Life is too short to be stiffed on mushrooms...",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "QgxeHFxnl7Yg3UtO4owxlg",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. Cornerstone burger...gouda bacon mushrooms???? Um where are the mushrooms?",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QgxeHFxnl7Yg3UtO4owxlg/o.jpg"
      },
      {
        "img_id": "umbX1_4_WLj3EBBKqV-wKA",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/umbX1_4_WLj3EBBKqV-wKA/o.jpg"
      }
    ],
    "user_id": "_5fx5gexi9OeZIuukV2gHQ"
  },
  "4J2NLqLUxk2bIWBRD7pEjw": {
    "date": "7/2/2016",
    "text": "Had the potato bene today and while the meal was prepared well, the corned beef topping would have been better if shredded (rather than sliced) and the pancakes had a flavor from the meal prepared before it (garlic and pancakes don't mix).    That being said, the patio was a perfect place to enjoy the meal and the atmosphere was good overall.  I would recommend coming here - especially if you enjoy a good Bloody Mary!!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7b2wxD8mKSgeOH8e8pREfQ"
  },
  "l9JcQrRqcpfulg8_JFwu0Q": {
    "date": "9/8/2015",
    "text": "In True Bobby and Tori fashion, we showed up for brunch this past Sunday before Labor Day about a half hour before they closed.  It was almost empty except for a few people seated on the cute patio out front.  For all the time I've lived only 5 minutes from this place and working down the street for a while, I am surprised it took me this long to stop in!  They serve brunch until 3.  Their mimosa and bloody mary were both excellent.  I opted for the Reuben with sweet potato fries for my meal and Bobby got the southwest(?) eggs benedict  (it had salmon, avocado) with potatoes.  My Reuben was cooked to perfection with the perfectly grilled rye, fresh corn beef and just the right amount of tangy sauce.  The sweet potato fries must have been whatever was left in the fryer from earlier that day, but I will take the fall for that one because we showed up so late.  Bobby really enjoyed his and licked his plate clean!  The location is awesome and it is super cute inside.  I love all the neutrals. It has a nice sized dining room and a really neat bar on the other side.  Our waitress was Liz and she was fantastic.  She took really great care of us and didn't seem the least bit annoyed that we were there as they were shutting down shop for the day.  This place gets the thumbs up for us to return...partially because we like a late brunch and also because we want to try dinner :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "NIJWrUAz7-9IEqwZnGBT9g"
  },
  "4BHeGVE4F-nDcjrVqSdecQ": {
    "date": "11/8/2015",
    "text": "Pretty tasty choice for Sunday brunch! I would recommend making a reservation, they get pretty busy. The bar area is really nice and I wouldn't have minded staying to have a few drinks after eating but I had my daughter with me. We both ordered the 'Cinnamon Sugar' one with bacon and one with eggs and it was absolutely divine! The eggs were a little greasy for my liking but the bacon was perfect. I also had a mimosa which you can't go wrong with for brunch!  We had outstanding service too!    Random tip: There was a group forming as we left, and I was thinking that the Cornerstone would be a nice place to have a party or a shower!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJQTqW0Uf4V9MNX1ogtw6g"
  },
  "MCFhsFfdETg1P44n1ZB76g": {
    "date": "4/17/2017",
    "text": "Big win for our family! We will definitely be going back often. Food was great and service could not have been more hospitable. I feel like part of the family now =)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wMelvVevNqxc7Q-r3V9BNQ"
  },
  "VXkoqb-Gnj0HV1HPKMnzoA": {
    "date": "12/9/2017",
    "text": "Wonderful little neighborhood place to eat. The menu is fabulous and not just typical everyday food. They do a great job with large parties too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wgr8fFbujTOPlZAFnNzJFg"
  },
  "ctbbTZN-vwj5tcz0ud3PkQ": {
    "date": "4/27/2017",
    "text": "Their Huevos Rancheros is the best!!! Everything is so fresh- every single time I am here (:",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-_rakxZ9cz0-oZ-oIBQdTA"
  },
  "7u74UBBhGvrRw0siaDShAQ": {
    "date": "4/27/2017",
    "text": "The most horrible dining experience I have ever had. Went there for Easter Buffet Brunch.  The place was overcrowded and so noisy you could not have any kind of conversation. Price was outrageous ($32.95 per person) for a mediocre buffet with nothing more than average food. Then there was some man changing light bulbs right over the buffet while people are trying to get food.  Who knows what fell into the food. So it cost us $89.41 for two people.  Did I mention the automatic 20% gratuity FOR A BUFFET!!! Which was not justified by below average service we received.  Had to ask multiple servers for drink refills which to a long time to get.  Will never go to this place again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1R-L12VMtvbBLF8af_i_6A"
  },
  "RQDoJwjj59biGDXl_umVDQ": {
    "date": "4/17/2017",
    "text": "The Cornerstone was a total win for my family this past weekend. Despite having a few big groups come in before/after us, they accommodated our late reservation. Our waiter was Craig, who answered all of our menu questions, and provided lots of information (probably wouldn't have picked the garlic soup if it wasn't for his description, and it was great!). The food was excellent, and just the right portion sizes all around. Then we paid our bill, but realized we had a lot of extra time, so decided to stay for coffee/dessert. Even though we had already paid, Craig and the manager (Amanda) were super nice about it and took care of us immediately. Then, because of a huge group coming in, they politely asked if we could switch tables and told us that our dessert/coffee was on the house!!! They really treated us like family, on top of serving excellent food. 10/10, would eat again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gDk7ztYBhv97bqrNCtSixQ"
  },
  "nh-hZkDLutgaAmtxm2FIdw": {
    "date": "8/6/2013",
    "text": "After passing by the restaurant and always seeing the outside tables packed with people, I ventured there this past Sunday. The decor is absolutely adorable!   My friend ordered the cinnamon sugar French toast and I got the Cornerstone scramble. Both of us really enjoyed our food and finished our plates. I really wish I could give this place 4.5 stars instead of 5, but they lose a star for incredibly slow service.   Everything else was really good. Will surely be back for lunch!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IKdEmvcKsFBuhz0o8Fibkg",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. Cornerstone scramble",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IKdEmvcKsFBuhz0o8Fibkg/o.jpg"
      }
    ],
    "user_id": "mLDC0DjkT2IJkoppBze4eA"
  },
  "BzEBnlv2xgH3vqMyCqTFcA": {
    "date": "1/5/2017",
    "text": "I went here for brunch on New Year's Day and it did not disappoint one bit.  I had a pickle spice Bloody Mary which was as unique as it was bold and delicious.  I chose a potato pancake benny and it was scrumptious, everyone in my party was happy with their dishes but the flavor of the potato pancake may have won over another fan with an offered bite.  Excellent corned beef was part of the benny.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkBNxJ9KfrosPhaai7bQYQ"
  },
  "qEhPdGEGfNdw7PnhuXHkoQ": {
    "date": "7/12/2017",
    "text": "This is the absolute WORST restaurant in Pittsburgh. The food is mediocre but the kitchen and the service are terrible. Look no further than the unprofessional, unhinged, boorish, and disrespectful male, short, sweaty, bald, misogynistic, profane manager to see why Cornerstone is the nightmare that it is.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tpTn8xSjmLf_i5qhHrO-oA"
  },
  "jqfXWSxCeVWmjge_zbakLA": {
    "date": "11/19/2017",
    "text": "We felt like a nuisance to the staff just getting our orders, check. Beer selection was modest, and the food was pricey for the quality. I'd avoid this place if you're in a Aspinwall. But then again, what are you doing in Aspinwall in the first place?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mkmyHhmKAppEguh8o9SHHQ"
  },
  "K7YPoIUh7-tjTpb4qmpyFQ": {
    "date": "7/18/2017",
    "text": "This is a cute little corner restaurant dahn in the cute little town of Aspinwall.  Stopped by to attend a business dinner and wasn't disappointed. They offer outside seating on warm days which is nice. There is a small bar area that's good for chatting it up. Wine offerings, while limited, were quite good.   Everyone at the table enjoyed their meals with most opting for salmon or stesk. The steak was cooked perfectly and seasoned very well. The menu is simplistic but offers up a nice selection.   The dining area is fairly small but not unconfortably so by any means.  Servers at the table and bar were friendly and attentive.   Parking can get a bit crazy so look to park in the next street over or park in the lot around the corner.  This place is definitely worth a stop.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "B_4cl4IGRqYb0wQSe-rYjQ"
  },
  "0ApSxbzOyM78uv6PbfdKpA": {
    "date": "2/16/2015",
    "text": "I met up with friends here recently hoping for a decent brunch and great conversation with said friends. While I got the great conversation, I sadly wasn't that impressed by Cornerstone.  It didn't take long for me to start thinking that my meal here wouldn't be perfect. I had arrived a little bit late due to traffic, so everyone else in my group was wrapping up their order as I walked in. No big deal: I slid into a booth seat (right in front of the waitress, by the way) as she finished up with everyone else, picked up a menu, and I figured she'd be back in a minute to take care of me. No such luck - we had to flag her down later on to take my order, and you could see a look in her eyes of surprise when we did. Like, \"Oh there's a new person here!\" I admittedly wasn't impressed by this oversight but figured she might be having a bad day, and that I'd reserve judgement until the meal arrived.  Sadly my food really wasn't that good, either. It was ok enough, but my ham and brie omelet was just much too salty to be considered anything other than ok; the same goes for the side of hash browns. I mean, I expect ham to be a little salty, but this tasted like they'd added salt to the entire omelet while it was being cooked. Even the brie had a hint of salt to it. Sad as it is to say this, the best part about the meal was the wheat toast with butter and jelly - the least salty item on my plate.  By the way, that waitress' look of surprise returned at the end of the meal, when some of us had to point out to her after waiting for a bit that she hadn't taken about half of our checks back with her after we laid out our cash and cards for her; obviously we couldn't leave until we'd paid. Luckily for her no one in our party was the type to take advantage of her forgetfulness, and luckily for us we weren't in the biggest rush to clamor on out. Otherwise we'd've been significantly delayed.  I do want to add that while this is not Cornerstone's fault, it admittedly doesn't help matters that this place is located in a part of town that's primarily permit parking only. Luckily I found a stretch of street to park on that allowed non-permit holders to park on Sundays, but if not for that I might have had a lot more trouble, especially given the chilly winter weather. Someone else found meters to park at, but with the snow being the way it's been I had no such luck spotting road-side meter parking.  Overall I'd describe my time at Cornerstone as disappointing. Not outright awful and unacceptable - I've experienced worse - but unimpressive for sure, both in terms of food and service. I won't be rushing back out here any time soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uJhfy9VbqzZFZUqnp_pebg",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. Ham and brie omelet.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uJhfy9VbqzZFZUqnp_pebg/o.jpg"
      }
    ],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "tv1Qt1udBdxW1PB6iAcTog": {
    "date": "3/30/2017",
    "text": "People rave about Cornerstone. I've been twice over a span of time and not visits were ok. Not at all horrible but nothing made me jump out of my seat. It's a cute place with outdoor seating and to me the food was average.  Both times I'd been there for brunch and had pancakes and eggs. Maybe I'll give it another shot during a different time of day. Maybe.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 7
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "TDB60QYOIeHhEIuXJ_N6FQ": {
    "date": "8/13/2017",
    "text": "Just went to cornerstone for the first time. I thought there were some definite hits but also some Misses.   Shared the deviled eggs and fried Brussel sprouts. The deviled eggs were solid, though not memorable. But the Brussels were terrific-- nice and crispy-- with a great sweet Asian sauce.   Also shared the hot chicken small plate, which was probably the biggest disappointment. Chicken was almost overdone and too crispy, such that the crust kept coming off. The biscuit was dry and not very tasty. Would not get this again.  Then had the pistachio crusted lamb chops. They were cooked exactly as I asked for them (medium), and the bites that had the pistachio crust on them were very flavorful (though I would have liked a little less mustard). For some bites on the bigger chops though that didn't get the crust, the lamb was tasteless. Would have probably salted the entire rack if I were them. Potato cake was a good side for this. Crispy and flavorful.  Service was a tad slower but we also had a big party and the bar seemed really busy, so no serious complaints.   I would come back and try this place again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "swusleWKg9xt0br-x-voCA"
  },
  "2ec8O8k1wYn1cwEuM4bO3Q": {
    "date": "6/3/2018",
    "text": "My friend recommended this place for lunch because her prior experiences have been positive. The name of the restaurant suited OUR experience...we were put in a Corner and thrown Stones. After being seated and had our orders taken, 45 mins wait went by with no food in sight BUT yet others that came after us and seated were served. Oh, at 1230pm on a Sunday afternoon- they ran out of chicken/waffles and brisket, really? The manager Rob, if that is his real name, did not come outside to apologize for the \"kitchen being backed up\" or anything; my husband went inside to get the  check for the drinks we ordered and noticed many empty tables.  The manager went up to my husband and offered nothing for our inconvenience. NOTHING. The waitress, Brooke, appeared to be flustered- I guess she was having a bad day - but thanked my friend for HER positive energy while the 4 of us that were with her, I guess, were not as positive. Would you be \"positive\" if you waited 45 mins for your lunch and no one came to your table to at least apologize for the inconvenience? I personally spoke to the manager and his body language showed that he really didn't care if we left. He said that we were \"seated too early\" and that he already went over this with my husband and that he apologized. I let him know that it appeared everyone else is having a good time except for us, we were miserable... my words didn't phase him. Poor excuses matched the service we received= POOR. Managers like him should not be working in this industry at all. I've seen restaurant managers go out of their way to make their customers feel welcomed. Rob did no such thing. I hope the owner of this establishment reads this and fixes this problem so others do not experience this awful service. If your establishment is as popular and has great reviews, make sure you're stocked with the popular food items and hire managers that care. My family and I are definitely not coming back and my friend that suggested this place will no longer be returning as well, nor will her family and friends.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "RMp0bNkwHLZsBftJkC5MdQ"
  },
  "sjeBSxtC7e1A4Hc2A8_f_w": {
    "date": "7/21/2014",
    "text": "I've been to Cornerstone a handful of times for both brunch and lunch, and I've generally had good experiences. I see many others have had problems with slow service -- maybe I've just gotten lucky, but even during crowded times, the wait staff taking care of us have always been pleasant and attentive. They are a touch on the pricey side, but I think their food is generally high quality.   For brunch, I'm a big fan of the cinnamon pancakes with red potatoes on the side. Their pancakes are moist, tender, and generously swirled with delicious cinnamon and sugar flavor. The red potatoes are well-cooked, flavorful, and not too greasy, so they don't sit in your stomach like a gut bomb as soon as you eat them. For lunch, I'm partial to their veggie burger with sweet potato fries. They immediately get brownie points for offering sweet potato fries as an option instead of regular fries, and they're tasty to boot. The veggie burger is delicious, and you can actually see pieces of bean, quinoa, corn and veggies scattered throughout the burger. I appreciate a good homemade veggie patty instead of some artificial, processed Morningstar nonsense.  As a bonus, the steam that comes out of the vent from the side of this building smells insanely good. Like, when I'm walking my dog around the neighborhood and we pass by here, we both (my dog and I) stop and just take in the delicious aroma. I don't know what it is, but it just smells like every tantalizing savory food smell combined into one. I probably look like a lunatic, but I don't care, because free smells = awesome.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "0EhPIlDozxGKpbbHRr6vZg"
  },
  "OdKFr7F9XQQKIOMfJr9JeA": {
    "date": "2/12/2018",
    "text": "We visited in the Fall. Made a reservation but really didn't need it around 5pm.  We had dinner with another couple.  Food was fantastic - service could have been much better.  I love the local location and the inside is quite nice and comfortable.  My husband said it was the best burger he's ever had!  I would visit knowing that the service is not a top priority but the food is quite delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qbnwsWSYwuJDMJH9UXr3_g"
  },
  "HNDsDzVGlYrPgYYdWachgA": {
    "date": "7/1/2017",
    "text": "Our server was Nikki she was phenomenal very attentive from the start... we ordered the mussels and the smoked wings and everything was delicious. For drinks we had the Lion's Tail and Gin Fizz both were amazing. I ordered the Amish Chicken and she had the Faroe Salmon both of our dishes were perfect... The biggest surprise was the kale... with my dairy allergy I couldn't have it creamed so they just sauteed it... it was literally the best I've ever tasted. After finishing my main dish I ordered a side of kale that's how good that shit was like seriously ridiculous. Great service, great food, great atmosphere!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D1m3qR9nMWC-pRiGghX5Ww",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D1m3qR9nMWC-pRiGghX5Ww/o.jpg"
      }
    ],
    "user_id": "GrknDKB_RWlAA5Kk4alOBQ"
  },
  "CwaHqfmi90zk3nksGqVCGg": {
    "date": "5/22/2019",
    "text": "tried it again, because the SO wanted lamb shank. his was ok. although it had a disagreeable grey look. maybe thats normal, IDK. His salad dressing was extremely bitter. my veggie burger was dreck. absolutely no flavor, or veggies besides ground lentils. the fried cheese was as hard as glass. the mac and cheese was a soupy pallid mess. which was kindly sprinkled with bacon, which IDT was mentioned on the menu. could be wrong. this is a wateringhole, not a place to get consistently good meals, and only a few options for vegetarians. our waiter, who was overly unctuous, disappeared after i asked if the mac and cheese had meat in it. he was non plussed. instead of replacing it, we didn't see him again until we got the check. if cornerstone wants an excellent recipe for actual baked macaroni and cheese, i will be glad to share. its incredibly easy, and a lot tastier than their supposed gourmet version.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aTgubK2Qfwpogd4tKrchqA"
  },
  "n4SxmGtfTDMAjBlmMNBLlQ": {
    "date": "11/22/2016",
    "text": "We stopped by for brunch, and walked away with a golf club. Let me explain, this gem is located in a little town with a big appetite for culture and food. We were able to sit outside right next to Freeport Road, so it was busy but still made it feel like home. There was also a flea market nearby, hence the golf club.  The freshness of the food, the delicious brunch cocktails and the lovely waitstaff will keep us coming back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "LHA-L7w6QBPNJwvHyaO2JA"
  },
  "6Rv7V95UNTdgJXFGE_Y6mw": {
    "date": "6/3/2018",
    "text": "The food is fantastic but this review is on our treatment. I suggested this place to my friends. We all went for brunch, they told us a 30 min wait. Ok fine. It was 15 min and we got a table. We ordered drinks and placed food orders. The dranks came but the food never did. A couple that came way after our table of 5, was seated immediately. Not long after their food came. My friend tried to speak to the manager to explain our situation. He could care less. Found out from the server they are under new management. We were the only hispanics there, everyone else was white. Figure it out. Our server tried her best but over an hr wait for food?and still waiting... Yeah not happening. Asked our server where our food was and she kept stating it was coming any minute or we were up next. Uh huh, yeah sure. Paid for our drinks and left. Im shocked because I never had a bad time here. But they are under new management. Manager needs to be fired period. I will not be back. They just lost customers. If this is how they treat people, who knows how our food what of been like .",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JTHH85LRGY8Wpv8sbPpkig"
  },
  "XzFaYXpRofaWT6XCxGWP3Q": {
    "date": "11/15/2015",
    "text": "It has been a week since I ate brunch here with my boyfriend and we are stilling talking about how delicious our food was.    I ordered the Cinnamon swirl bread grilled & topped with apple cranberry compote.  Seriously, delicious.  He ordered the Cornerstone scramble (round lamb, roasted tomatoes, onions, spinach, feta cheese, scrambled eggs, homefries & toast).  The atmosphere inside is welcoming with its modern decor and neighborhood charm.  Half the tables were young people with their pitchers of beers or bloody marys/mimosas and the other half were a mix of young families and retirees.  No complaints about service and parking was easy on the Sunday we went even though the wonderful Freedom Farms Farmer's Market was taking up space in the large public parking lot across the street from the restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "kypiDVRIcY0Szjc-ZN6VJA"
  },
  "kHgxKPkkKozF8icua8IWng": {
    "date": "1/27/2018",
    "text": "Amazing brunch! I went with the raspberry Bellini to drink.  Steak & eggs was my meal selection.  Although, the crab Benny was a pretty close runner up.  The delicious flat iron was cooked perfectly medium with spinach, mushrooms, and onion to add just the right amount of flavor.  I had to save a little for a snack later.  For sixteen dollars, you can't beat this brunch option.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hYCFljfsALsum8ba0EQKew"
  },
  "6BakzIgcnYACfh4DM-hPgg": {
    "date": "10/22/2016",
    "text": "Not coming back. Ordered the steak and eggs medium rare My steak was totally undercooked and my scrambled eggs were over cooked how do you get eggs wrong? They had crust on them.  So the server asked if I wanted them to remake it I hesitated but said sure. It took forever to get back to me my husband already finished his meal. Just not cool we never get to go out and the time we do we can't even eat together.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FkP15lOjzRvw09o4r9MBCw"
  },
  "2r1RjqcwRspV-AsgTdrtyg": {
    "date": "1/7/2018",
    "text": "This was the best brunch I've ever had in my entire life! My friend and I got the smoked salmon benny and the crab cake benny and split them. It was incredible, fantastic, one of a kind , and amazing! The hollandaise sauce was to die for! Great drinks and great food. 10 out of 10! Can't wait to go back !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dawczyZGXxh6uW08kfZrtw"
  },
  "IfsihT-cj701rlW2rfmDCg": {
    "date": "4/2/2015",
    "text": "I work in the Aspinwall area and have been coming here for years. I will say they are one of the most consistent, reasonably-priced restaurants that I go to. My wife and I even decided to host our rehearsal dinner here before our wedding last year.  It's rarely \"packed\" which is something that we really like. Nice decor, good food, and typically good service. My five star review deals with how well we were treated during our rehearsal dinner, I would recommend for private parties.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "dhQOA8-FdpA6D0hNhXEYIw"
  },
  "Z8Y_s60ROOBObOf6yM0S_g": {
    "date": "5/26/2018",
    "text": "Great wines & lovely atmosphere. My husband I go when we're sans child for some apps & drinks. The menu changes, which is a downfall because I've loved everything I've had but I always crave it again! I'd love to try their dinners if they are anything like the apps! Try anything tuna. Omg!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sCUKkwdGzZ4qe8SH-p_UNA"
  },
  "rUsPZpKn4uP-fRb8o1sndg": {
    "date": "7/13/2017",
    "text": "This place has great bones: location, architecture, porch, and plenty of space. Unfortunately, the execution is lazy: staff, food and presentation. A disappointing experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "j-yzsNFaTXRdpucRZW0-lg"
  },
  "lDgUEkEVFWeLSjyNHECaFA": {
    "date": "6/2/2015",
    "text": "So, my sister Luch decided that we should go to brunch on a lazy Sunday and she wanted to go to this place in Homestead.  However, she found out that in order to make reservations, you have to send an e-mail to the restaurant, purchase a secret decoder ring and then wait for acceptance smoke signals to ensure that you can dine there.  Yeah, right!  So anyway, she did a little research and determined that we should go to the Cornerstone Restaurant instead.  Well, awrighty then!  Off we go to The Cornerstone Restaurant!    I am extremely sad to say that I really enjoy Scotch eggs.  Come on, man!  A boiled egg wrapped in sausage and then deep fried?  Instant heart attack? Yes!  Instant gratification?  YES! YES! YES!  So my piggy-self ordered the LOW COUNTRY STEAK & EGGS! (Flat iron steak grilled to order, cheddar grits, caramelized onions, scotch egg & toast!  Yeah, man!)  My daughter Muff ordered the CINNAMON SUGAR French Toast with bacon and my sister Luch ordered the Biscuits and Gravy(Homemade buttermilk biscuits, fried chicken breast filet and sausage gravy served with a side of fruit)    Now let me also say that I am a grit connoisseur.  My mother and several of her siblings were born in Columbia, South Cackalaky (Carolina for those of you don't know any better.)  My father's father (Grand Pap) was also born in South Carolina.  I hated grits as a child because at the time, my family served grits in a \"savory\" versus a \"sweet\" way. (Those are the two grit camps.)  Cheese, butter, salt, pepper, country ham gravy or sunny-side up eggs stirred into hot grits was my family's choice.  However, a few folks that I knew ate grits with butter and sugar.  Either way, I didn't like them as a child.  Fast forward to today and I love almost any type of savory grit.  The cheddar grits at the Cornerstone were just okay, but I have a killer recipe that I got from a chef in Charleston, SC that would make you smack your mama twice!  My steak was prepared exactly to my liking and my sister liked her biscuits and gravy served with chicken.(Luch said that the biscuits were a little dense, but everything overall was quite scrumptious.)   My daughter Muff managed to cut me off a smidgen (And I mean smidgen!) of her French toast and it was as tasty as she claimed.  My only complaint is that I probably wouldn't order the LOW COUNTRY STEAK & EGGS again because of the overload of protein and starch.  I would probably eliminate the grits and stick with a fruit cup to lighten the plate up some. I don't know what I was thinking...  My bad!  Other than that, this is a quaint neighborhood restaurant that provides a nice backdrop for casual family and friend gatherings.  The menu offers something for everyone including the kiddies.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hnVXeRIxCf6CQc1wcRx3tg"
  },
  "-oC2svv5Dtsyr8wZGg7iOA": {
    "date": "11/19/2017",
    "text": "Cornerstone is great. The food is good and they have a great wine list. The managers and the staff are also amazing. We were celebrating my mom being cancer free and they gave us the \"good costumer-cancer free\" discount. It made our day even better and It made my mom cry-happy tears of course. We will always go back to cornerstone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rB2kFxfrsMXhMSl00lc1tQ",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rB2kFxfrsMXhMSl00lc1tQ/o.jpg"
      }
    ],
    "user_id": "ljighTAIqyqnxnynjCIBRw"
  },
  "1CiN4KN8NfVbzMTtDxYcpA": {
    "date": "5/28/2019",
    "text": "Nice ambience.  Parking on the street so a little limited.  Old building nicely redone on the interior. First class.  We were eating vegan that day and they had some options.  These were delicious but I have to deduct a star for portion size.  Plus the dessert we ordered to ensure we left full was very nondescript and lacked good flavor.  The cheesecake.  Maybe if we had ordered the fried chicken daily special we would have been happier.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9E2958KjJWn4qFwa1HjoPA",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. Bar area",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9E2958KjJWn4qFwa1HjoPA/o.jpg"
      }
    ],
    "user_id": "GPrCMiV4h3RNmVBlhfJCbg"
  },
  "BfoiwYs2UyiIJs07UcKVwA": {
    "date": "8/26/2019",
    "text": "I was surprised to see several negative reviews.  Our experience was pretty good, but it was at a non-busy time during Sunday brunch.  We got there around 1 and there were plenty of open seats.  The service wasn't super quick, but wasn't too bad.  We got the Brussel sprouts, chicken and biscuits and the  1/2 order of peach stuffed French Toast.  All were perfectly cooked and excellent tasting.   Sprouts were perfectly made and crispy with some sweet honey on them.  Chicken biscuits was a great take on the original with a friend chicken breast, sausage gravy on a very tasty biscuit.  And the French toast was wonderful.  We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iKCL4-cBZ3S1GEvOAWwxyg",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. 1/2 order of peach stuffed French toast.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iKCL4-cBZ3S1GEvOAWwxyg/o.jpg"
      },
      {
        "img_id": "2TCrUfvGyJrjSTX1emqleQ",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. Chicken and biscuits.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2TCrUfvGyJrjSTX1emqleQ/o.jpg"
      }
    ],
    "user_id": "xHyJ2AUvvCfKjMTfSPPI2g"
  },
  "Tv4fd3IZKQGFXjOKpbNL-g": {
    "date": "8/12/2018",
    "text": "We want to love this place.  It's so cute and the menu is great and they have a nice outdoor seating area.  This is the second time we've tried their Brunch and been totally underwhelmed by the service and the food.    In all fairness, my fiance tried the same dish twice (the Smoked Salmon Belly with potatoes, green beans, and egg) and realized that she really didn't like it the first time either.  Here's why.  They don't \"clean\" the fish so you end up with these rubbery, thick pieces of wet salmon skin mixed in with your salmon.  It's very unappetizing.  I tried the Benedict with smoked salmon and a side of potatoes and it was good.  Our server was younger and didn't seem to have much experience.  She was absent a lot and not very attentive when she was there as she forgot to bring waters after two requests and then had no reaction whatsoever when we pointed out the salmon skin issue.  That was a real letdown because we were not rude about it all and it was obvious we left a lot of the dish uneaten.  An apology would have been appropriate.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IJYIY60PDC6H9tCsolmfaA",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. Rubbery skin served in the Salmon Belly w Egg &amp;amp; Green Beans and Potatoes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IJYIY60PDC6H9tCsolmfaA/o.jpg"
      },
      {
        "img_id": "wdAa-ckpkGlNJ7JxmMHxnA",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. Salmon Belly (as served - see next photo)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wdAa-ckpkGlNJ7JxmMHxnA/o.jpg"
      },
      {
        "img_id": "RSPohATAxCuOztJ4Mop_ng",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. Eggs Benedict w Salmon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RSPohATAxCuOztJ4Mop_ng/o.jpg"
      }
    ],
    "user_id": "X7mVSZxStPxD4GbN_29pYQ"
  },
  "IAkeCm_0erT8Ribz7fBWQw": {
    "date": "3/24/2019",
    "text": "This was my first visit to this cool spot in the cute town of Aspinwall. I love a good brunch and Cornerstone did not disappoint. My friend and I started with Bellinis; Mango and Raspberry. Both were very tasty. We had the homemade doughnuts as a brunch appetizer and it was great for two people to share. The doughnuts were a little crispy on the outside, doughy enough on the inside over a raspberry reduction. Delicious. I had the \"Benny (Eggs) Benedict\" with home fries and it was so good that there wasn't a bite left on my plate! I also got a to go order-the lamb burger with a side of orzo salad. Wow...one of the best burgers I've had all around. I will definitely return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o_wGBRCngYy0KxCg2vRE_w",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. Raspberry Bellini",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o_wGBRCngYy0KxCg2vRE_w/o.jpg"
      },
      {
        "img_id": "i8l5ojZQmhUYOmEnU4eH0A",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. Benny Benedict and Home Fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i8l5ojZQmhUYOmEnU4eH0A/o.jpg"
      }
    ],
    "user_id": "BxyzMzUjuJGLBjO_Hjqp5A"
  },
  "FOeSU4AurxvgOOvwVj0_Rg": {
    "date": "7/21/2019",
    "text": "I never post reviews, but I am so appalled by the food and service that I received that I must say something. This restaurant does not even deserve one star. At our brunch, we were served rotten fruit, rotten avocado, and were charged $2 for one slice of toast. The wait for food and beverages was unnecessarily long. When I spoke to the manager, she was rude and unaccommodating. I heard several other customers make complaints as well. I will never come back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nYElZZOf3gsNFoaKqnIapg"
  },
  "6uTfy_hk3a6QKexmS1uTFQ": {
    "date": "7/20/2019",
    "text": "Always a consistently good meal here. Both the brunch and dinner are solid. I've seen the negative reviews about the bad service but never had any issues myself.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rR6gc6LfD8-66_plsVeh4A"
  },
  "dtFdA8AqazAxDFh5Mm_Jbg": {
    "date": "8/13/2019",
    "text": "Excellent brunch. Excellent service. Very clean. Nice atmosphere. I highly recommend this place and will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SE_xRmBBvpkpC7kwGJd0eg"
  },
  "XkibXx0YVlsCiUO7vpjeSw": {
    "date": "7/1/2018",
    "text": "My family went for Easter brunch this year and it was a success.  The staff was welcoming despite it being a busy holiday brunch crowd...and it was a large crowd. We were seated at 11:30 in the back room through a narrow hallway. This made it awkward to go back and forth to the buffet.   Food was spread around the front rooms with stations for omelettes, meat and sides in chafing dishes, salads and fruits, and desserts. There was plenty of food and many options to please all of my family's different tastes. I didn't know what to expect from a buffet but the food was really good and I didn't leave hungry! I noshed on grilled veggies, mini bagels and lox, a fish entree, salads and fruit.   It was a treat to go out for a meal on a holiday so I don't know if we'll do it again but we'll remember The Cornerstone if we do.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "-zoKnhRd4Knnj_P-qO0GPQ"
  },
  "wanZrewBEoEC3ZqbyGk4pA": {
    "date": "8/4/2019",
    "text": "With so many good reviews, I was excited to try this local place! We went in for brunch at 10am on a Sunday. The positives were these- taste and quality of the food was good, atmosphere on the patio was very nice and relaxing. Customer service left a lot to be desired. We had two servers checking on us initially, but I think there was some confusion because we were pretty much ignored for the rest of our visit (unless I got the attention of a server to ask for something). I had to request a new fork since there was caked on food still on mine, and many of the creamers they provided me were past their expiration date. When our food arrived (40 minutes after we ordered) it was lukewarm at best. The plates were warm, so I'm guessing maybe our food sat under a heating lamp for awhile. Anyway, I don't think we will be returning. We were so disappointed! Like I said, this place has several good reviews, so maybe our experience was simply a fluke.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pD8mdVBPqM6uBV8BgTQt0g"
  },
  "wtiLd_WuSADvEJjEQ2VWyQ": {
    "date": "7/1/2018",
    "text": "Been here many times, a solid choice for food and drink. They have a large outdoor seating area right along the main stretch in Aspinwall and also plenty of seating inside. The service is generally pretty good though sometimes they get pretty busy. I typically come here for drinks (they have good happy hour specials) but as far as food goes they have great chips and I like their Brussel sprouts too. Their sandwiches are pretty good as well, I most recently had the pulled pork. Overall, worth checking out.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "0KhRPd66BZGHCtsb9mGh_g"
  },
  "JpNJz-cIU9qxH5aRyaET5g": {
    "date": "7/21/2019",
    "text": "Went to brunch on a Sunday and it was a horrible experience. Drinks took an incredibly long time to come, especially considering there were only 10 people in the restaurant. When food came out it was extremely disappointing, to say the least. Portions were very tiny and food was not fresh at all. A side of fruit accompanied a Benedict and it looked like it had been poured out of a can during the depression era. The avocado that came on another Benedict was completely brown, rotten, and inedible. They charged $2 for a \"side of toast\" that was one small piece of soggy bread. When we told staff and management of the problems they seemed completely uninterested in helping at all. I went to the bathroom shortly after and heard the servers, bartender, and manger talking about how our party and other guests \"were completely crazy\" and laughing out loud. This was also while I watched them making themselves screwdrivers at the bar and heavily drinking. We made eye contact and they laughed even harder. Their solution to everything was to take $15 off of a $150 check. When we asked to split the checks they seemed annoyed and also like they had no idea how to. I wouldn't recommend this place to my worst enemy.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "44STBLoAV0v5awK4DqhjEg"
  },
  "Rq2NXXGjpMuXwBKMVJe5qA": {
    "date": "11/7/2018",
    "text": "While the food was delicious, the service was awful. It took forever to get our appetizer, which was followed within minutes by our salads, with our dinners right behind that. A bad cadence of courses is pretty much my biggest pet peeve at a restaurant. On top of that, our waitress didn't even come back to check on us after we ordered (someone else even brought out the food). And, while the appearance of sitting outside might be attractive, the noise of traffic on Freeport Road and the deafening pitch of trains going by, made the patio a miserable place for dinner. I hate to pass up such good food - but I don't think I'll be going back any time soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YNkbvkPhLMFlOFYH2PLMwA"
  },
  "tevI2QMX0zZ2cYtp2YClkw": {
    "date": "8/2/2018",
    "text": "This is my first yelp review.   Cornerstone's charm can be found in its staff and decor. The bartenders and servers are friendly and attentive and the restaurant's space is quaint, clean, and contemporary. Both areas deserve 5 stars.  The food is a bit more difficult to rank, mainly because the portions do not justify the prices. Most meals are between the $14-22 range, with appetizers being priced from $8-10.   Judging taste alone, Cornerstone earns 5 stars, I particularly like the Lamb burger and the Salmon entrees (both are delicious!) but each time I've had them, I've left hungry and wanting more.  The appetizers are egregiously small. During my most recent trip, my table of six ordered a flatbread and deviled eggs. The flatbread ($9 for five mini-slices) looked great, but it was too small to taste. The deviled eggs ($8 for two eggs cut in half) were fantastic, but priced for a king's budget. The appetizers cost our table $3 per bite.   My lamb burger ($14) was grilled perfectly: it was juicy and succulent. It was an average size and the coleslaw side was portioned like the appetizers. I needed more with my meal.  My girlfriend's \"Dr. Bob's burger\" came with brisket and was also delicious. She ordered a side salad rather than fries and was hit with a $4 up-charge. Her $18 meal tasted great but it simply was not big enough.  Obviously, a person's size impacts how much he or she eats. I exercise regularly and weigh 160 pounds, meaning I can eat more than most people my size. That being said, the $50 check (this includes the tip) should have been enough to fill two people of average size.  In summary, Cornerstone has great potential but falls short on value. My advice to Yelpers is to avoid the appetizers and skip the side salad due to the up-charge.  My advice to management is to increase the size of food (especially the appetizers and sides) just a bit so the restaurant can earn a 4 or 5 star overall ranking.  Thanks for reading!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wh3rhrE5SScQSzAwXlk0Tw"
  },
  "5-MFhGSBygFEuQ7ZJwjFEg": {
    "date": "4/6/2019",
    "text": "I eat at Cornerstone frequently but do not usually order the soup. However in the last 2 weeks I've had 2 of the best soups I've had in a long time. Last Friday the Curried Cauliflower was just the right mix of sweet and spicy and today the Apple Parsnip soup was outstanding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7zObrCadfCWLnM_c2gGn3w"
  },
  "sBtMUkWIHeesuhatCRyGTQ": {
    "date": "8/22/2017",
    "text": "I normally come here for breakfast/brunch. First time here was lamb burger. Really good. Went back here a few months later to try their salmon Benedict and went back a few more time for it since then.  Can't say much about their food, it's salmon benedict for me every time.  Well staffed.  Clean.  $14 for salmon Benedict is reasonable to me.  Never waited too long.   A True hidden gem, I think.  (who goes to Freeport Rd anyway??)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qug5VM2jkOK1YPUm12eZqw",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. breakfast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qug5VM2jkOK1YPUm12eZqw/o.jpg"
      },
      {
        "img_id": "U5OL_LiADlOQ62PqlV9Hyg",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. breakfast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U5OL_LiADlOQ62PqlV9Hyg/o.jpg"
      },
      {
        "img_id": "WKtzFt2fovhpdL8W-3bc6w",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. lamb burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WKtzFt2fovhpdL8W-3bc6w/o.jpg"
      }
    ],
    "user_id": "YQvXj_PfSEw2bccbLNop-w"
  },
  "9FSMSWuBWf7OW_c_08ynCw": {
    "date": "12/28/2015",
    "text": "We were quite wary, given the mixed reviews, however we had very good food and excellent service.   Okay, we had one odd thing happen, we ordered the cheese plate and I made our server promise the 3 cheeses were St Andre, Taleggio, and Humbolt Fog. But when the cheese board arrived, they substituted a cheddar for the Humbolt Fog. I'm not one to complain, because they just ran out, but it was a bit strange she didn't ask us if we still wanted the plate.   Our other food arrived, as ordered, and it was delicious.   The specials are an excellent value. For dessert we had their specialty ice cream sandwich, which was delicious.  Our waitress was attentive, helpful, and very professional. We enjoyed a nice meal and will probably go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "T0U0SytwFM0xEHcTRiRs9g",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. Ice cream sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T0U0SytwFM0xEHcTRiRs9g/o.jpg"
      }
    ],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "9io5lVt5AjzhlufrmiLOpQ": {
    "date": "3/15/2019",
    "text": "What a disappointment!!  Again!  Was there years ago but didn't return because of the noise level which they corrected by lowering the ceiling.  Returned yesterday with friends.  My cocktail, pomegranate something, looked unappealing and wasn't special.  The roasted beet salad, also ordered by another, had few small chunks of beets and just as little dressing...bland.  I had the brisket sliders...dry chunks of brisket.  Others had seafood and seemed ok.  My husband and I won't be back.  Too bad because we're locals.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fvg2ERYVv1ONjCAIbqLIgw"
  },
  "g5RX7rzeIxfpodq5JAdlBQ": {
    "date": "4/27/2018",
    "text": "I don't have cable so I go places to watch games.  I stopped at the Cornerstone for a beer and a burger.  And man, did it hit the spot.  the burger itself was cooked perfectly to Medium, still juicy and tasty.  If you don't like the burger on the menu, you can build your own.  Instead of sweet potato fries (which is a great addition to any menu), I opted for the orzo salad.  Fresh and light as a great complement to the burger.  There were alot of seats at the bar and you can see the TVs from pretty much anywhere.  The bartender was attentive and kind.  Some salads came out that looked hearty and fresh.  I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "RFXdqe9P56RI1vW3BhHn6g"
  },
  "9zQrRhCs2cwkDA9e89H1sA": {
    "date": "12/10/2016",
    "text": "Nice!!! One of the things we have always said about the Fox Chapel / Aspinwall area is that there is a dearth of middle to upper tier restaurants from which to choose. Sure, there's some great Asian food on Freeport and Old Freeport, and a tasty steakhouse on Fox Chapel Road, but there hasn't really been a comfortable bistro-style place to use as a regular haunt for us...Until now.  Sure, there are some areas where this establishment could improve, but overall, I thought the menu was solid, with a nice selection of appetizers, main courses, and desserts. The drinks are tasty, and they have a nice selection of beer and wine to accompany your meal. One of the biggest surprises was how kid-friendly they were. In my experience, bistro restaurants like this with a big bar and lots of ambitious food aren't really interested in catering to families with kids, but this place welcomed our two kids with arms wide open! Their kids menu is similar to the ones you've seen before, but with healthier, less-processed choices. Their mac and cheese came with steamed peas, and our youngest gobbled it up!!  My only deduction came from my own opinion of what mussels should be like - mine were a bit on the small side, and that the dish is served with far too little broth to fully enjoy. They had three different options for the mussels, but not the classic \"moules a la Marniere,\" which is my favorite. The frittes that came with my dish were exceptional, but were served with standard ketchup, missing an opportunity for the Chef to provide a creative aioli or ketchup version.  Our appetizer oysters were the epitome of freshness, and the duck breast my wife ordered was delicious. We are eager to return in order to sample more of their menu, and are so happy that we no longer have to cross a river to get this type of food we so enjoy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "4r33dXcE1oYZxjONrhxTiA"
  },
  "LBGsCZAPQOoGpOprt51aPw": {
    "date": "6/3/2018",
    "text": "One of my significant other and I's favorite restaurants in Pittsburgh. The food is always excellent, great atmosphere, the wait staff is always exceptional. They make great drinks and are super accommodating. I've never had a complaint about this place. It's a very cozy and intimate environment inside, which makes it a date night favorite of ours. Outside is great too during the warmer months.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3G5u8x1YijMDqiZ0Lo94zQ"
  },
  "h5JOlUiCf-3SXqx3KiEesg": {
    "date": "4/22/2014",
    "text": "Tried this Aspinwall spot after a recommendation  from friends.  Searched Yelp reviews that were mostly mixed.  What we got was a restaurant with a comfortable atmosphere and a friendly and efficient wait staff. The menu wasn't overly ambitious but had something to suit everyone's taste.  My wife and I had dinner salads which were quite good and had decent portions. The other two diners with us had sandwiches which they liked.  We plan on returning in the near future.  We like to eat in the bar and  the Cornerstones looked warm and inviting.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z6PFhb5suokEG23VHWZxHw"
  },
  "vR_SVeQdfIJXeYQJ4Inf8g": {
    "date": "2/15/2016",
    "text": "Their appetizers are much better than the actual entrees from my dinner experience.  Starters/Appetizers- The lamp chops were amazing, and the brisket tacos equally amazing.  With these two, I should have ended the experience.  Unfortunately, I asked for more than I could bargain for. My medium steak was cold in the middle, had the taste of freshly cut meat from the butcher, and literally was moo'ing at me as I made one attempt to eat it.  If it has legs, it would have made its way to the pasture.  I am convinced their definition of medium is much like egg done over easy, or even sunny side up.  Sear the bottom, sear the top, serve.  Medium doesn't mean a cold middle.  I don't necessarily need to eat meat like Leo DiCaprio in the Revenant. I sent it back for more heat. It came back still raw despite what appeared effort to microwave it.  Call me picky, and maybe snobby.  But I am convinced, cooking requires that ever so important component called heat.  I flick my finger through a burning candle for kick, but I don't do that for cooking.  I let the meat cook.  Anyways, I packed it up and cooked it at home instead.  It was warm in the middle, oooh, aaah.  So in the end, appetizers - 4/5.  The flat iron Steak, about 1/5.  Overall experience 3/5.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnNAYd7tKwdxHt7UuwcErA"
  },
  "pxi2Pwh0bbJvMEKl8M1jYw": {
    "date": "5/24/2011",
    "text": "As a local, this is one of my go-to spots.  The food is always great, the service is always on point, and the wine list is extensive for a suburban location.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "h1eGIGu8BVK4uINmz0Gj3A"
  },
  "8_UgZxEdGanCP-7AnrZNzw": {
    "date": "9/12/2014",
    "text": "We visited there for lunch today. Didn't seem very busy so we didn't expect to have any issues getting our good in a timely manner. We reviewed the menus before we got there so that we would be ready to order right away. A waitress immediately took our drink order so we were optimistic that things would progress quickly...but they didn't. We all ordered from the menu - no changes, special requests, etc. and it still took over 30 minutes to get our food!! The waitress only came to our table once during that 30 minute period and only because I called her over to ask how much longer it was going to take. As soon as our good arrived, we asked for our checks because we were going to be late getting back to work. Two of the four checks were wrong! We showed her in the menu that our food included the side that we ordered - she said she would have to look into it and left. She never came back to out table!! We left our payment on the table because we couldn't wait any longer. While the food was good, not great, we won't be going back there for lunch! Seems like most of the negative reviews mention poor service - hope the owner does something to address this...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JUmksoNde2bAqS-APZJLUQ"
  },
  "_mUbu705o_Z_0WLznQ-O2g": {
    "date": "8/28/2014",
    "text": "Have eaten several times there. Spotty service. Tight seating. Kids menu Macaroni and Cheese was a ripoff. My 3-year old daughter finished a serving and we asked for more but had to pay for another meal.  Ridiculous. $6 for each kids meal. Have had some decent meals there. The salmon dish is pretty reliable and tasty. Have had a few different variations but they are all pretty close. Good location for them with few competitors. Nice, laid back spot for a cocktail at the bar.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A9Z_MnR5Gza5CJI8crFOAg"
  },
  "ryViwa_C9GHrwnYAGmWAZg": {
    "date": "4/2/2011",
    "text": "Great food, not great service, awful hostess. You know what they say about first impressions. It's hard for me even to compliment the food b/c the hostess left such a bad impression. On Friday evening, she didn't know when the happy hour would end (turns out is 6:30, despite their website saying 7) and didn't know and wasn't willing to check what the happy hour was featuring (which for the beer was Corona, which makes no sense in Pittsburgh). The attitude of the waitress wasn't great, but not really her fault, there wasn't enough wait staff. She was constantly running around and we still we got our bread 10 minutes after she said it was on the way. It was a shame that these things so poor as the food - bread, beet salad, orzo salad, lamb burger and macaroni - were all great.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "j19vrd3-Fj7XfuVD-DW7RA"
  },
  "-UOVhlfHbjEEcmyvsRNOyw": {
    "date": "5/10/2015",
    "text": "the BEST breakfast in Pittsburgh! especially the eggs Benedict and huevos rancheros. a little pricey but well worth the cost if you're looking for an amazing meal",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "G7WNv04WwGKqbXPXkhKgkg"
  },
  "ZQkLynfYhjzwGIik3YWGgA": {
    "date": "5/20/2012",
    "text": "My third, and final, visit to the Cornerstone.  Let me say this - the food is fine.  In fact really good.  But every occasion to eat there has been marred by poor to horrible service.  I can't decide if the staff is always overwhelmed due to short staffing, or just simply inefficient.   During brunch, a fairly busy time around noon on a Sunday, we saw our waitress once before ordering, and then not again until our food was delivered.  I had to flag down other members of the wait staff to get refills on our coffees and drinks.  Each time a refill was provided, the waitress took only one glass or mug away and brought back to the table then took the next.  If the waitress wasn't such a rarely spotted experience, this would have been OK, however this just caused more waiting for us.  Sadly, good food cannot save a restaurant that can't provide the service to support such great efforts in the kitchen.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "mcOHFDmhynWwhPia2Y7kRQ"
  },
  "7k1kFDc2lAP53xh-3f-u7Q": {
    "date": "4/23/2013",
    "text": "Wow!  Awesome place and owner and manager  treated us out of towners like  royal  guests.  Cute place   sat outside for dinner and had a great meal. Prices are  very competitive  as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PAur0-r81fdaiEJSMYG7Vw"
  },
  "IHaNysF0-Ie-1Hr8k-Qtig": {
    "date": "9/9/2010",
    "text": "their salads are INSANE-- the biggest i've ever seen. my caesar salad was basically a whole head of romaine lettuce cut in half, with such delicious roasted tomatoes and--hello-- fried capers! so good.  also the waitress we had was the snappiest, least shit-taking person i have ever met; she initially said it was impossible to make a PIZZA vegetarian. needless to say, i loved her.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-W1NF5LWPKs4wHGG_gc3-A"
  },
  "7gj1tCn4AUirSLB5XgffUw": {
    "date": "4/13/2013",
    "text": "Not bad... Not great... They have some reasonably priced dinners and some fancier items on the menu. The service was slow but the atmosphere was nice. I would dine there again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZmOWqTUhyLXv_mRglx2MIQ"
  },
  "gZ4kQVIJSM1veSDIZ05EdA": {
    "date": "7/1/2011",
    "text": "We stopped here mid-afternoon yesterday, and sat down in front of the worst bartender/server ever in the history of yuppie restaurant service. I mean, this sort of place, with the generic, one-half-step-above Olive Garden furnishings, is where you'd expect to find obsequious servers with cheap smiles to match the character of the interior design. Cornerstone no doubt employs such good souls, however one bad soul has ruined any good thing I could say about this place. Our unfriendly bartender was gruff beyond what one could expect at the nastiest of dive bars. Other than one Michelob Ultra drinking regular, we were his only customers. He ignored us for what he thought was long enough for us to make a decision, at which point he came over and asked \"you know what you want?\" But damn, he underestimated the power of this girl's indecision, what a bother. I told him that I was undecided between two different weiss beers they had on draft. He promptly turned around and walked away. During his absence, I decided to just not get a beer, in fact, to spend as little money as possible because this guy had the air of being the owner (who else could get away with being such an asshole), whom I did not want to support. So eventually my partner got his beer (which he could have ordered much earlier if this guy had a molecule of patience) and we ordered one entree, a mushroom sandwich, to share with a salad and also a side order of sweet potato fries. Except for some rotten salad greens, the food was good. This could probably be a three star review if it wasn't for the hostile environment that we experienced. To top it all off, as soon as we got up to leave, he came over to the book to check his tip (guess what, it wasn't very good!) and sarcastically yelled after us, \"thanks A LOT\" followed by some indiscernible muttering. My genuine tip: fucking retire; play golf or travel the country in an RV or something, just spare the public your unpleasantness.",
    "rating": 1,
    "rated": {
      "funny": 8,
      "useful": 10,
      "cool": 2
    },
    "photos": [],
    "user_id": "b4ZbEEDbCPT6pVT4ImJU4w"
  },
  "ZBETTNiU9jrf7eQDFvUrsQ": {
    "date": "1/16/2012",
    "text": "These folks are nice but the food is pretty bad. I had the meatloaf which didn't resemble any meatloaf I've ever had. It tasted (and had the texture) of soggy toast. My Bloody Mary was horrible and even the vinaigrette dressing was bad. And its overpriced to boot.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tcd0SxgdAGkEdNR_-jSvBA"
  },
  "PSCPH-wl4wxcAiTZiSB3zA": {
    "date": "1/1/2013",
    "text": "We ate at the Cornerstone early this New Year's Eve from the Limited menu. The food, service, and atmosphere exceeded our expectations! The drinks, house salad, delicious generous portions and competent, friendly waitress made this a wonderful start to our evening. We will definitely return here before considering any other restaurant on that side of the river!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y_cPO6IrYjxx5jfD-oBxtA"
  },
  "THH8BSF1VcCspJwnLzyJoQ": {
    "date": "11/14/2011",
    "text": "Three of us had dinner Sunday evening.  Salads (especially the Caesar), salmon, meatloaf, and pumpkin fettuccine entrees were all super good.  We all had dessert as well, also good.  We will definitely return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "68i0FBN7eUMDyOzh7bHlsA"
  },
  "lPFpXnpyfvYMFFai7QR-7g": {
    "date": "9/28/2011",
    "text": "My husband and I have been to Cornerstone several times, sometimes enjoying everything very much and sometimes being disappointed.  This past Saturday was a HUGE disappointment.  We arrived about 7:30 p.m. without a reservation and got a table with no problem, because the main dining room was at least half empty.  Not a good sign on a Saturday night.  There was no problem at all with the quality of the food; we enjoyed a salmon flatbread appetizer special and very good crabcakes for our entree.  The problem was the absolutely abysmal service.  I admit that the \"do you guys want a wine list?\" always sets my teeth on edge, but we were willing to overlook that.  Our wine arrived, the waitress seemed very impatient for us to order quickly, so we ordered the flatbread.  She appeared about 30 seconds later basically demanding that we order our entrees, so we obediently did so.  In a flash, our side salads arrived - well before the salmon flatbread appetizer.  Trying to be good humored about it, we decided that eating our appetizer along with our salad wasn't such a bad thing.  The moment we took our last bite of salad our plates were cleared and our entrees arrived.  My husband eats more quickly than I do and of course the waitress -who must have been in a rush to get to a hot date because there certainly were no customers waiting to fill the empty tables - very brusquely cleared his plate and asked me if I was done.  I still had an entire crabcake on my plate!  I was permitted to take a few more bites, when she appeared again asking if we wanted dessert.  I WAS STILL EATING MY DINNER!  WHAT PART OF THAT IS CONFUSING TO YOU?  Because I wasn't nearly ready to think about dessert we both declined.  Within 30 seconds, she appeared and dropped the check on the table, as I continued to try to salvage a pleasant dining experience.  IShe never asked if we would like coffee - which we would have.  The entire goal was to get us the heck out of there as quickly as possible, and it ruined our Saturday evening.  It is such a cute place and it is very close to our house.  And my husband and I both make a real point to patronize locally owned businesses.  But folks, you're making it awfully hard to do so.  It will be a long time before we go back.  (I want to be clear about what my 2 stars mean:  ZERO stars for the inexcusable service, and 4 stars for the food.)  I pity the chef.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wf9Gw0T1daf4dYqC-1_YXg"
  },
  "Kb6crvYuqUU_2AZcVeJRQA": {
    "date": "7/8/2014",
    "text": "My sister and I came here for lunch on a Tuesday. She had the salmon, and I had the Cornerstone Cobb. Her salmon was the tiniest piece of fish I had ever seen, plus was not very tasty. My salad, while good, was nothing special or extraordinary.  I agree with the other reviews that address the service as below par. In addition to our table, our server had one other table with 3 career professionals. She neglected our table, only visiting us twice: to take our order and take our money.  Overall would not recommend.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zhQCRgBaUJPqwyvTV0LsbQ"
  },
  "Mdk7lDJvoVHakSHG5ggYMw": {
    "date": "5/11/2014",
    "text": "Had a fantastic brunch here, great eggs Benedict and an Irish coffee! Walked right in when they opened and though it filled up over the next hour, plus a party, it was never too busy and the service was very good. I would definitely recommend to others and go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cZ_-u_syzFfg-iAz6LR0pQ"
  },
  "Frf6omc8L54VrG58DgQHIQ": {
    "date": "3/22/2015",
    "text": "We don't live near the Cornerstone but make a point of having dinner there once every other week because the food is consistently superior and the staff is always friendly and attentive. I had salmon last night - perfectly prepared and  truly outstanding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QAn6RGDW8HhOUS-CNEBz-Q"
  },
  "QG01mrCnQ-Hp7pWCIrvDqw": {
    "date": "2/28/2014",
    "text": "Went to the Cornerstone for brunch recently and was delighted. My meal portion was plentiful and delicious. My mimosa was perfectly made and the service was friendly and quick. My coffee mug was never empty. I will definitely return for brunch and probably try dinner at some point, as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wULTnUZQ2Y4VP5lE0YzWSg"
  },
  "xUSO2sdAEPGpC3SdDa_xYA": {
    "date": "5/22/2011",
    "text": "Cornerstone is very bipolar in terms of food quality. We have had great, meticulously-prepared seafood (halibut, crab cakes, scallops) and salads (try the cornerstone cobb, with small carefully cut pieces of lush green vegetable goodness) here. We have also had a disturbing mediterranean platter (baba ghanooj was just like water), very mediocre fish, and a carelessly prepared salad (again, the cornerstone cobb, with humongous pieces of unevenly cut, questionably green lettuce, with sprinkles of bacon that are not supposed to be there) over the course of several visits. Literally last weekend we had a great seafood dinner where everything on the table was almost perfect, and this weekend the same halibut and the same salad were subpar. And, this was not the first time Cornerstone turned bipolar on us.   Suspiciously, when we really enjoyed the food, it was a Friday or Saturday night. And, our bad experiences seemed to fall on Sundays or weekdays.  Maybe the chef is bipolar. Or maybe the competent, caring chef works on Fri/Sat, and the hatchet-job chef takes over for the rest of the week. Regardless, if our experience is telling, I would recommend paying a visit Friday or Saturday evenings and staying away otherwise.   The wines are not bipolar at Cornerstone. They have always been good. So has the bread.   The place is very cute. On the corner just across the railroad tracks, you would perhaps not expect such cuteness. The outdoor seating is very nice during the summer. The indoor atmosphere is friendly and elegant. Service staff have usually been very friendly, sometimes slow, but friendly.   With so many pluses, one wonders why the inconsistency in food quality. If they fix this critical issue, this will be a great gem in Aspinwall, possibly surpassing Luma.   Cornerstone has made us bipolar, too. We will definitely avoid its food Sun-Thu, but we will definitely be back Fri-Sat evenings.",
    "rating": 3,
    "rated": {
      "funny": 7,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "vf2ZkqTJNAjA844Kowf1ww"
  },
  "34NDgFx1Ve4Eqk141j0hbQ": {
    "date": "8/30/2015",
    "text": "We regularly take our elderly mother who lives in assisted living here for Sunday brunch. However, this Sunday we had a very unpleasant experience. I asked to speak with the manager and the bartender spoke with us. He was extremely rude. We have spent hundreds of dollars in this place over the past five years.  Never again. We went down the street to Luke & Mike's Front Porch, and they were wonderful.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DBZYIuJMBxeHiqmSl8Jl_A"
  },
  "dQ8sigVZrPw34cRM3_I-tw": {
    "date": "2/21/2016",
    "text": "Brunch menu offers something for everyone.  Food is good, but kitchen was slow.  Our server was extremely friendly.  All in all good place for brunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_SgWwEyvERa03kn7823vJQ"
  },
  "CQwYUBKEtov0wZ7jH5c_CA": {
    "date": "9/7/2014",
    "text": "Stopped by for brunch and was seated immediately. Service was friendly and quick. My server was Alesis and she is the best I have ever had! It was a wonderful experience! Food was delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U8Yz75K2s5kaC95WqnxShg"
  },
  "pJbvvpF0HLFql8sWQV-H6w": {
    "date": "9/17/2011",
    "text": "A recent Brunch on the patio at Cornerstone was lovely. Weather permitting, I recommend you try the same. This was the occasion when I discovered the miracle that is \"Monkey bread,\" - banana bread turned into the most delicious french toast in the universe.  Our group ordered and shared the Bagpipe Hash and Greek Omelet as well, but Monkey Bread was the clear favorite. We were also very impressed by a flatbread appetizer special of the day. The flatbread was topped with goat cheese, smoked salmon, roasted cherry tomatoes and arugula. Our service was friendly and prompt and the bill was reasonable given the high quality of the food. The next time I'm in Pittsburgh, I'm definitely planning to make a return visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H728y-iPAfzzg1MOWoOQ8w",
        "caption": "Photo of Cornerstone Restaurant &amp; Bar - Pittsburgh, PA, United States. special flatbread app of the day",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/H728y-iPAfzzg1MOWoOQ8w/o.jpg"
      }
    ],
    "user_id": "0skp2OojHXdTtLtusgnsFw"
  },
  "psOo7BlpWxcMifpl59e9Ug": {
    "date": "7/5/2013",
    "text": "Really wonderful brunch food and I love the atmosphere. The service was lovely, as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8DNhTBYVIZGPsz8ro0oPCA"
  },
  "5WbE8u2kUqzIMRq8nYZwfw": {
    "date": "11/17/2013",
    "text": "The brunch was excellent. We loved the selection and the portions were large. Everything we tried was delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SKre6GKJAA3FLgb2e875Rg"
  },
  "2qecxhRTS9NOuJCJXhchpw": {
    "date": "6/11/2014",
    "text": "Had a great dinner on their outside seating (note this is on the sidewalk and the train is very close so if this would bother you I'd advise sitting indoors, it doesn't bother me though!). Had the pulled pork sandwich which was very good and a side of sweet potato fries. Any restaurant with sweet potato fries is a huge plus in my book! I have been here in the past for brunch and I have never had a better breakfast out it my life! I got the French toast with all the usual breakfast sides and it was too much food! Of course I paired it with a Bloody Mary which was a bit too peppery but this was also the first Bloody Mary I've ever had so you can't take my word for it. All in all the indoor and out door atmosphere and food are definitely worth checking out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KdY9N4BV84-PxQcvxTXwFQ"
  },
  "LxE-8DyOJHBg0arcA_2e8g": {
    "date": "2/18/2014",
    "text": "Went to this restaurant for brunch last Sunday and was a bit apprehensive because the reviews seemed to be all over the place.  I have to admit my experience was excellent.  Prompt, polite, and friendly service.  I had the Brisket Hash and it was wonderful.  I also had 2 Bloody Mary's they were better than average.  3 others at our table ordered various items and were very pleased.  I think I need to work on my review writing skills!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CbxS-Ve428MRGkRDZmL2fg"
  },
  "ujx3bnOPhgJHDE811GOXVQ": {
    "date": "2/2/2014",
    "text": "I had my wedding reception at Cornerstone on New Year's Eve 2013, and it was an absolutely fantastic event! Everyone on the staff was so friendly, attentive, and helpful the whole evening.   My guests could not stop raving about how great the food was! Erin, who I worked with, and Jerome, the chef, were really great about helping me pick from their extensive catering options. I'm a vegetarian and some of my guests have other dietary preferences or restrictions, and we ended up with a menu that ensured everyone had delicious things to eat. I was very appreciative of little details they thought of (that I forgot) like labeling the salads with what ingredients were in them!  We had the place to ourselves, and I loved the ambiance (I barely decorated-- I wanted a place that had its own character). The layout was great-- they let us put a dance floor in the front room, then lots of room for conversations and mingling by the bar, and dinner was served in the back room.  I would definitely recommend Cornerstone as a private party venue, and I look forward to dining there with my husband in the future and remembering what a great time we had there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vqikjyfaZopDgPNuIa0I1w"
  },
  "rDsqQAsxNp8kIkcRVA6WPA": {
    "date": "6/6/2013",
    "text": "Good food but not worth the price, especially with the below rate service we experienced. We've been advised to give them a second try by close friends, we'll see !",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6P6gmrl6L1Son8EwUHypVQ"
  },
  "lAZD_yjl0eFzA8jdONINgg": {
    "date": "1/31/2013",
    "text": "Ate here for lunch on Saturday. Ordered the veggie burger. Made with quinoa. Service was slow. The blue cheese coleslaw wasn't very good, and the lettuce for my burger was wilted. My husband liked his Cornerstone burger, although the cheese wasn't melted. Underwhelming.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dKa12_fEaqYSKnIYwOCYiw"
  },
  "SjxovCUrhBYp4xnoj6De6w": {
    "date": "9/16/2015",
    "text": "Terrible terrible terrible worst service disgusting food with hair all through it attitude from manager attitude from server just bad all the way around go to some were else the percentage of you enjoying this place is 20/80 bad",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r2AcILrFbpoBH4ZJIfjwgw"
  },
  "7JfMdQiM2WG6sH1QT7DlWA": {
    "date": "6/22/2015",
    "text": "I have visited this place twice now once for breakfast. Went today for lunch and I don't think I will be going back horrible service by the server she was extremely rude. Food was very disappointing to say the least.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xYrnL-2s2R3k0_DG491LWQ"
  },
  "_yjLPTw-9UKqctQkn10o3w": {
    "date": "11/11/2013",
    "text": "Do not go on Sundays. We got Amy as a waitress. She was rude since we ordered our drinks. After we finished our dinner she never picked up the empty plates. Our table was a mess full of empty glasses and plates. Don't think we will go back.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "105c-Rv42eIf7Zm3GbOcoA"
  },
  "_8oxKEpLrshiRSW-wu7NKA": {
    "date": "4/3/2013",
    "text": "Impressed with the food. Good portions and affordable prices. I was especially please with the awesome drink selection. The waitstaff is very nice, but not nearly attentive enough. I really think there's just not enough staff for the place. If you're looking for good service, go elsewhere. It's a shame because i LOVED the food!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AWCgv1iapDxKGeMa7m1JVQ"
  }
}