{
  "LSIJB-nA14DoMfu5GjXGDg": {
    "date": "7/29/2011",
    "text": "[+]  huge portions  have tried pulled pork and brisket \"my mother makes the best brisket\"  you really could get away with sharing 1 meal with 2 people  great side options..beans, corn bread, potato salad  maybe some of the best bbq Ive ever had and i lived in North Carolina for 2 years   [-]  seating  location  flies",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-vHZgAXI-tDOKtBsJi3oFQ"
  },
  "LOzjcpu7mVlIDRtGrTxWsg": {
    "date": "9/7/2012",
    "text": "As the former owner of A.J's Smokin BBQ I have to say Pittsburgh BBQ is the best in Western PA. I just stopped at the Banksville location and WoooW!.... I had the Half Chicken, Spare Ribs and Beef Brisket. All were smoked to perfection. The sides were wonderful especially the Baked Beans. I can't wait to try the Pulled Pork.  If you're an authentic BBQ fan you have to try this place. They also have a place in Murrysville.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6r-TaEw0ksA28Rwbd6e4hQ"
  },
  "c5w2O-upqb6mkPWUenEZFw": {
    "date": "6/15/2014",
    "text": "Love this BBQ, just wish they'd peel the membrane off of the bottom of the ribs before cooking.  It literally comes right off and let's the smoke get to the meat!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S8awhy-J2lpIUO3z3fIhMQ"
  },
  "v7WI4MhxdiG3JTFpz-thhw": {
    "date": "6/7/2011",
    "text": "zomg!!! REAL, Authentic, finger lickin' BBQ in Pittsburgh, of all places?! HELL YEAH BABY! This place is super easy to find, even when using a GPS navigation system. Unlike the routes to almost every other destination in Pittsburgh, the highways/roads to PBC involve no dead end streets, detours, construction zones or unnamed gravel paths. I guess that helped start off the trip out to PBC on the right foot. The food took care of the next part all on its own. Hands down, best BBQ I've had, and I have had some of the best in Tennessee, Texas, and Kansas City. YEE HAAAW BITCHEZ!!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QCFcjh6m0WUH0j-VMS28Cg"
  },
  "YhKXOP4DHpSnkP0lu03l_A": {
    "date": "3/29/2012",
    "text": "This place is great!  We have passed this place for a few years on our way home from work and always wanted to stop so we finally did.  We were not disappointed!    We tried the Spare Ribs and they were perfect.  Meat was falling off the bone and the sauce was great.    We also tried the Macaroni & Cheese which was pretty good.  The cornbread is to die for!  It is amazing.  It truly is the best I ever had!!    We will definitely stop again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GOhcg4IPetfoYzEyfOPM0g"
  },
  "5QRWJJRotLkbwSi-x04MxQ": {
    "date": "1/25/2013",
    "text": "Very good ribs, tender and distinct woodsmoke taste. Spicy sauce but not overwhelmingly hot. DO NOT MISS the beans. You will be sorry if you do because they're absolutely wonderful, made with like 8 different kinds of beans in a sweet/spicy sauce. Chicken is good and competent but it's not exceptional, and one time I ordered a half chicken but instead they gave me two breast sections which some people might enjoy but I'm a dark meat fan and I felt cheated. Ok the location is lousy and sometimes when I go there I end up on the wrong road. It's not a restaurant, it's a shack and you will most likely want to take the food home and heat it up. If you're cool with all that, you can't go wrong.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cGEcpa2fqX3UqM97ljVfNA"
  },
  "_m3qcpHEC1Wxuoph0r8-cg": {
    "date": "11/17/2010",
    "text": "Some of the best BBQ I ever had, no questions asked, but not a restaurant unfortunately. They do have a few tables to sit outside, weather permitting. Plan on picking up some awesome food to be consumed elsewhere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VDw0GeJI_DaW5DRLN6KjRA"
  },
  "V39ZxpzzRbdNdbkl1aBdTQ": {
    "date": "5/12/2012",
    "text": "The best BBQ place that I have ever been to.  I had always driven up and down Banksville Road and had been intrigued by the wonderful BBQ aroma wafting from the smaller cabin looking building.  I finally made the trip there to pick up some dinner and was not disappointed.  I had to try a lot once I made it in there and went with the pulled pork, tried a couple different flavors of ribs, the mac n' cheese, and the baked beans.  They each may have been the best I've ever had.  The pulled pork had an amazing vinegar sauce that made my night and the meat from the ribs just fell off the bone while it was difficult to decide which flavor I liked more.  The mac n' cheese was so good that my girlfriend stole half of mine after having her own serving. The baked beans with multiple types of beans, caramelized onions, and bacon was a great addition.  On top of that we received great service from a friendly guy named John who treated us like regulars and was extremely helpful.  I'll definitely be heading back again soon, I can't wait to try the brisket and maybe a baked apple knowing how good everything else already is.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "eQ5TNwtN8egHd7SAk1matw"
  },
  "Zxi-7nNWxT9mIwIG9P2yqw": {
    "date": "8/12/2012",
    "text": "My wife and I absolutely love going to Pgh BBQ Co.  We are both big fans of bbq and have eaten at all kinds of bbq joints.  The food has been excellent everytime we have gotten take-out.  Our favorites are the beans, mac and cheese, brisket, and ribs.  The brisket is so good that my wife became a brisket convert!  It's tricky to get to if you don't know what you're doing, so make sure you know how ot get there before you go!  But once you're there, these guys will treat you like their favorite neighbor.  They even gave me a bite of brisket for my dogs waitingin the car!  Stop in, bring a big appetite, and enjoy the food and the guys behind the counter!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IBSoFdkXuR6Q-EOHSwANDA"
  },
  "345ZqpNGEZAO3srF4C11lQ": {
    "date": "7/23/2010",
    "text": "All I have to say is WOW!!!  We got a full slab of ribs and 2 sides Mac & Cheese.  It was so much food we actually have leftovers and that is rare in our house.  These were real ribs not the skinny ribs you find in other chain BBQ joints.  I can easily eat a slab of skinny ribs from a skinny pig.  Not these pigs - they were large and fat.  I would absolutely go there again.  Too bad it took me 2 years of driving by to finally stop.  Now I know.....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jxldw6CCK1DaaR5hxR7XgQ"
  },
  "UwEG5igroYyTaSwAeWJRXw": {
    "date": "7/20/2014",
    "text": "Good BBQ, vinegar based BBQ aside I def liked the pulled pork. The cold slaw was lacking, and the whole no place to sit or even wash your hands kinda sucked. But it's def a good place to just grab some takeout!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NcC7xt16wi5_iQEt_KKTzA"
  },
  "2jTmXAs27iKNNAQm9s6uJg": {
    "date": "8/15/2011",
    "text": "Mmmm...BBQ.  I am a sucker for convenience. This place got an extra star just for being close to my apartment. The location on Banksville Road is a tiny little shack behind the Days Inn (There are other locations that are more restaurant like) and is carry-out only, unless you feel like a picnic table in the summer.  I always get the beef brisket. It has just the right amount of lean meat and spice. I can't handle spice very easy, and though this isn't exactly mild (not hot but won't disappoint the bbq faithful for being weak) I suffer through because it is just. so. good.  And the cornbread! I could write a sonnet on the cornbread! I am not picky about my conbread. I will make the just add water and oil box variety at home-slap some butter on it and I'm pretty pleased. But this cornbread! So moist ( a word I've only utilized to describe a really good brownie) but not leaden and it has actual corn kernels in it. Yumm!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "3rdmwatxNw8YnfAQ9zZZ8g"
  },
  "hGRjnnUDuz0Ube3NQ4QD3Q": {
    "date": "10/26/2011",
    "text": "Two things that I miss since turning veg in  January, BBQ and BBQ. This place has it all, brisket, chicken, pork, and all the fixings. Don't worry about me though, I get my fix from Morningstar Farms Ribletts. Sorry ....that's another review.  The Pittsburgh BBQ company is hidden behind Banksville Rd, you can smell it before seeing it. And that smell is amazing, more amazing as you get closer.    I used to order the brisket sandwich, it was tender, juicy, and loaded with smoky flavor from slow and low smoking. The slaw and beans rounded out this dish that no steak can ever wish to top. The chicken was good too, as are the ribs. But to me BBQ means brisket.  I still get the beans though, pretty damn good and they really fill that void for BBQ!  Hurry this place will be shutting down for the winter, usually they shut the doors for the winter in November and reopen in the spring.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "UsmTxWbobLsI6WR1Db0W7A"
  },
  "f_FBc808ruzzbgb3zR3lIg": {
    "date": "7/16/2014",
    "text": "Great barbecue, probably the best in Pittsburgh.  Not a huge fan of the sides and mostly get the pulled pork or brisket sandwiches.  Very generous portions and very tasty.  We love the sauce.  We often smoke our own pork or brisket and serve it with their sauce.  Once you figure out where they are, it is pretty easy to get to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "m9tPYl77eABXl9YWTmJ4dg"
  },
  "U-ZfvFON_iExKqAe_11pXw": {
    "date": "1/13/2014",
    "text": "We got PGH BBQ Company to cater a buffet dinner for ~100 people in our backyard. It was excellent!   The food was all delicious. We had: Brisket, pulled pork, mac and cheese, cornbread, baked beans, portabella mushrooms, spinach salad and some trays of cookies/brownies.  Guests raved about the brisket, but I was most impressed with the pulled pork - excellent eastern North Carolina style vinegar sauce! The bottles of hot sauce they provided were also very very good (on everything).   Art took care of organizing everything for us and he was great to work with. He prefers phone to email but once I figured that out he was very responsive and he got all the details right.   The women who came out do set up / clean up were also very good. Nice, prompt, efficient, hardworking - even helped us fit the leftovers in the freezer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C9rvhSBSpgyP3wD_25eSjQ"
  },
  "kG_ikDsK9eail_GHGixShg": {
    "date": "6/7/2013",
    "text": "The meat itself isn't to bad but the BBQ sauce, Is terrible!  You can find much better in the burgh.. like at the dream or Clem's or Showcase and at a much better price",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "q3dIqTQTC_PFk95q_aEhHw"
  },
  "MNRF7Uc2dT62GhM6CZqQTw": {
    "date": "1/9/2016",
    "text": "Awesome bbq- best I've had in Pittsburgh! Way better than Rowdy (eating rowdy now and sad) ...just wish it was was open year round! Brisket is awesome, pulled chicken awesome, sauces great, all sides are good..and cornbread on another level!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "59hs9tR5xf4FeTLVqaeffA"
  },
  "Z9NE6Z8W8gu0HOgOMDyRCA": {
    "date": "9/27/2013",
    "text": "I am loving this place!  The brisket is smokey & delicious & the chicken was to die for...but, the sauce especially the spicy version, which has a hint of garlic is to die for.  Not to mention the baked beans & the baked apples....still need to try the ribs, but just know they will be smokey & succulent, as well.  Try this place - you can't go wrong with any choice you make!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ekZTNP2DTBEpQMwz2DQ3Gg"
  },
  "fT9SX2eK9BfQ7qbBrKewCQ": {
    "date": "5/28/2013",
    "text": "We had the Pittsburgh Barbecue Company cater a large picnic (100+ people) over Memorial Day and they were great! Their prices are reasonable, they were friendly and helpful the day of the event, and best of all the food was amazing. The pork from the pig roast was great, they brought all of the napkins/plates/utensils, and all of the sides were perfect. The cornbread was a huge hit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cZ_-u_syzFfg-iAz6LR0pQ"
  },
  "Lpk1XkGPqZYHHp_kAcqeiQ": {
    "date": "9/12/2010",
    "text": "Simply awesome!  We went here for lunch the other day and were very impressed.  The huge smokers outside are quite a sight.  The owner and another employee were extremely pleasent.  I got the pulled pork sandwich , the girlfriend had a beef brisket sandwich, and we shared a half chicken.  Everything was great.  They even gave us a free pork rib to try on the way out because we hadn't had any ribs!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "opbjtBIf1ze2QCu7SoxEig"
  },
  "vPq4Mo70mWP6_80CnFywAA": {
    "date": "4/7/2015",
    "text": "The best part about this place is the smoky smell and flavor of the meat. I got a full rack of ribs and the pulled pork. This is the type of barbeque where it is good, but the meat will not stand up on its own - it definitely needs the sauce. I found the pulled pork a bit dry, and the ribs not flavorfull enough, and not tender enough to my liking. Like I said, though, it did have a nice smoky flavor, and was not bad for Pittsburgh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ia2dQGFt3djNAw_QbCj9gg"
  },
  "U3Xwau6GGtPJ9f1jTDmQnQ": {
    "date": "11/15/2012",
    "text": "The best kept secret in Pittsburgh.   PGH BBQ is everything you want in a barbeque joint. You can't go wrong with any choices on the menu. The staff are super friendly. The fact that they operate out of essentially a shack is a sign that they let the food speak for itself.  My friends and I went literally every week while attending college in Pittsburgh, and everyone we brought along was a fan. From money-minded people to food critics, everybody loved it. Do yourself a favor and head on down there ASAP.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AKlBjnHw56jWttFkejpE0w"
  },
  "w0RslXvh86zbl_39Bip9Gg": {
    "date": "6/11/2012",
    "text": "I passed this place on the way to work everyday for the last 7 months. Since it was closed for winter months, I had to wait until March to stop by...and then kept putting it off for awhile simply because of the location-I take a different way home than I take in the morning to get to work.  Well let me tell you...I should have stopped on opening day. This place is great! It's hidden off from Banksville Road and you see always see the steady stream of smoke coming from the fresh barbeque. It's just a little place...with grills outside and just an ordering counter inside. (there is also a sign on the menu...encouraging you to Yelp about your experience!)  We ordered pulled pork and mac n cheese. I'll start with the mac n cheese...it was not good. I'm sorry...I am digging this place, but the mac n cheese had so little cheese on it that it looked and kind of tasted like buttered macaroni. It was cooked all day in a giant soup pot-sort of like you see in a cafeteria or in Giant Eagle in the prepared foods section. I'm wondering if perhaps the cheese almost cooks off when it's been sitting there all day...whatever the case, pass on the mac.  The pulled pork was a TOTALLY different story. It was succulent and juicy. Full of flavor. And it came with a side of the great house bbq sauce. Seriously delicious. It tasted like summertime.   The other meats looked great too...the chicken looked and smelled so yummy, and I can't wait to try the ribs and the brisket. The sides simply don't fit my taste...I could so go for some grilled corn on the cob...or a fire roasted corn dish of some sort. mm mm mm. For now, I'll stick to ordering the meat there and preparing some easy sides at home.  Due to the nature of the business this place is seasonal...don't put it off...go today!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "jaij3nmMTFFguC67URtcxA"
  },
  "74AcGmh6NDnhVYCMgiCLgA": {
    "date": "5/9/2012",
    "text": "Greta vinegary sauce, love the brisket sandwich on a hard roll.  Great mac n' cheese, stellar cornbread.  It's not a cheap meal, but its not made up of cheap ingredients.  The ribs are pretty good, and the pulled pork is also excellent.  I like the sauce on the side, so you can really appreciate the smoked taste in the meats.  I'm glad this is close-by, so I can satisfy my BBQ fix when I get the hankerin'.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "eVBJgxQg-XRMImQFYwta-Q"
  },
  "jAG6cGzTh9HtHwUUbWT3Wg": {
    "date": "6/17/2012",
    "text": "This was the best father's day idea yet. Go get bbq! Living relatively close to this place we decided to go ahead and give it a shot. so glad we did. We ordered a pound of pulled pork and a pound of brisket. The brisket was phenomenal. Great pink smoke ring, and it was perfectly done. Just off the smoker.  House made sauce was tangy and just how I like it. I'm incredibly happy we tried this place and will go back. it was a perfect end to a great fathers day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1lbhkv_rWRvFlKkwe1PmOw"
  },
  "1bYpb8yXZKW2dnVaGHTDdA": {
    "date": "5/1/2016",
    "text": "If this review had been posted before May 1st, 2016, I would have given Pittsburgh BBQ a solid and resounding 5 stars. Unfortunately, after today, I would give it 1 star (I would actually give it 0 stars, but that's not a choice, so the average is a generous 3 stars. Today, around 3 pm, I ordered a half rack of spare ribs, 3 cornbread and a pound of brisket. By 5 pm, I had eaten all but one of the ribs, all 3 cornbread and a few slices of brisket. By 6 pm, I began to experience nausea and stomach cramps. By 8 pm, the majority of the meal had resurfaced. By 11 pm, I am still feeling the ill effects of whatever parts of the meal did not resurface earlier. I am disappointed as I have always loved Pittsburgh BBQ Company and have made many visits there previously. Sadly, this will be my last visit. FYI, this was my first meal of the day and the only food I ate today, indicating that there was no other gastronomical reason for my distress.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qHQikkRmcjoeiMbAXuaAtg"
  },
  "LQnmzF-hROFsFfsgLGOMeQ": {
    "date": "2/9/2015",
    "text": "Drove 30 miles on Saturday for some of the best pulled pork and cornbread in Pittsburgh. There was a sign painted \"Closed until March\" would have been nice to know.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zXfQkBXkAwMIxoiw0suU8Q"
  },
  "DqJl7osPIXlQ24FBmm-SpQ": {
    "date": "9/25/2011",
    "text": "I don't understand what people see in this place. I can honestly say that I was not blown away by anything I ate there (nor were any of the other people I came here with). The ribs were bland and had no discernible smoke ring. The brisket was not freshly cut and was very dry with no smokey flavor. I was not impressed by their BBQ sauce or any of the sides.  When I hear people talk about the food here, they say, \"The BBQ is good for Pittsburgh...\" People should not use the location of a restaurant as a justification for it not being as good as other places. There are plenty of great restaurants in Pittsburgh that stand on their own and can go toe-to-toe with places all over the nation. Don't settle.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "qzxT8LECo3lGlSZbIDUH_A"
  },
  "DWL7Akbl3CcLpvwm97jrpA": {
    "date": "9/23/2006",
    "text": "Memphis, Central Texas, St Louis.  These are pilgrimage sites for the BBQ faithful.  And while Pittsburgh doesn't rank on that scale yet, if the meat coma I got from the ribs at Pittsburgh Barbecue Company is any indication then they are definitely on their way.\r \r And even though the ribs are flavorful and juicy enough, thanks to an incredible rub, that they don't even need sauce on them you should still get the sauce because its vinegary/peppery taste has enough spice to enhance the meat, but not overpower it.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "k6Y8yT_EJtL5hhwnYPDUfg"
  },
  "8rFLNfCXqu7PXAhM8rgtmQ": {
    "date": "8/10/2011",
    "text": "The food may be good, but the walk up service is poor. The staff seemed unable or unwilling to multitask. I ended up at a chain just down the road after waiting forever for a basic 'hello' at this place. What a shame.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Zgr-qrMpofQSHKlXdYaWHw"
  },
  "XmMb5P30pivhsAGlu_wXrw": {
    "date": "9/28/2017",
    "text": "Art, the owner, was wonderful!!! He partnered with me to provide food for my fundraiser benefiting Animal Friends animal shelter. Not only did he drop off the food, he also came back later to pickup his equipment. Everyone raved about how good the food was!!! I heard multiple people say they would be stopping by the restaurant in the near future!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OphOu_7jpJD_Bvvam0Rvwg"
  },
  "ZadcMvXU2HHKapAPPFdyUg": {
    "date": "5/12/2014",
    "text": "I have been here a couple of times, most recently a couple of Sundays ago with my fiance for dinner.  Getting to their location isn't too terrible but the problem is that it is difficult to see from Banksville road.  The inside of the shop is nice and clean and you can see all the meats that they have in a giant display case.  If you happen to order some ribs or brisket they cut it right then and there in front of you.  The workers here are also very friendly and have talked to us quite a bit each time that I have been there.  For dinner on this night my fiance and I decided to share a number of different meats and so went with the pulled pork, smoked chicken and brisket with sides of cornbread and macaroni and cheese.  We were also asked what kind of sauce we would like: spicy, regular or a combination.  We choose the combination which got us two of each which was more than enough for all of food we had ordered.  The spicy one had a nice little burn to it that seemed to grow as you ate more or it yet wasn't too spicy while the sweet one also had a flavor that I enjoyed.  One thing that was nice about all of the meats here is that you could easily taste the smoke on all of them.  My favorite of the meats that we ordered happened to be the brisket which was seasoned nicely.  The smoked chicken was my second favorite which surprised me since I am not much of a chicken on the bone type of guy.  It was moist and had a great smoky flavor that didn't overpower the chicken flavor.  Finally the pulled pork was also pretty good although not nearly as good as the other two.  As for our sides, I am not a huge cornbread fan and so only took a small nibble of it and it tasted fine.  The mac and cheese ended up being decent but it seemed to be more like something I could make out of a box than a really good mac and cheese.  Of course I should probably remember that this was a side dish at a BBQ place and not a gourmet mac and cheese at which point it was fine.  The bottom line for me is that I will be back here again in the future.  I have enjoyed all of the meats that I have had here and really enjoy their BBQ sauce as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "YXRy8tuB4DDQR-hQOkayjg": {
    "date": "5/21/2016",
    "text": "We tried the beef brisket, and found it to be okay but not something we want to try again.  We found much more flavorful smoked brisket at Smoq, similar to some of the best smoked brisket we have had during the 25 years we lived in Texas.  We tried Pittsburgh BBQ because it is so visible along Banksville Road and it was said by some reviewers to have the best bbq in Pittsburgh.  We found the smoked brisket to be better than some Pittsburgh beef bbq (Double Wide Grill) but not nearly as good as the smoked brisket at Smoq.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_pNqgLc7uk2Az93Cqmqkaw"
  },
  "TNh1oDLp8VuVHCUu7dz8gw": {
    "date": "6/26/2016",
    "text": "What a begining to a great weekend! Where do I start, the ribs were amazing, just dip them in that BBQ sauce and you will feel what real BBQ ribs should taste like. And the cornbread, if you love good, homemade, authentic cornbread, then you are in luck, this place has the best homemade cornbread I've had in a long time. And the pulled pork, don't get me started on the pulled pork, it was to die for! There is no way to properly descripe the meal, the only way I can think of is to just beg you to try it for yourself.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xcr8mt2DjvTiZnA1y4pvYw"
  },
  "cdmh_2MmNO4p0QP4oCsn1w": {
    "date": "8/26/2013",
    "text": "We had the Pittsburgh BBQ Company cater our wedding on August 17, 2013 and we are SO happy we went with them.  The value was absolutely incredible & the food was amazing. All our guests loved everything - especially the cornbread. I should note that we, our families, & a good number of our friends are originally from the Carolinas, so we are pretty discerning when it comes to good BBQ... this definitely got two thumbs up all around.  They were great to work with - the servers & bartender we hired through them were fabulous & hard-working.  If I had anything negative to say at all, it would be that sometimes my email interactions with Judee were not as easy as I wanted them to be. However, she was always available via phone, and was super nice & helpful, so I'm chalking that one up to the fact that not everyone loves email as much as I do. It definitely doesn't change my rave review at all & I wouldn't hesitate to work with her/them in the future.  In fact, we're already contemplating throwing a pig roast party catered by them in the near future...  Bottom line: Delicious food, fantastic value, great people. Go here, eat here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "5sHwZzTfqgm1FFo0wYML4g"
  },
  "VECQYUJsvM0suEO2kmQOiw": {
    "date": "4/15/2013",
    "text": "Honestly, there is no better BBQ in the burgh.  Hands down, awesome.   I have been here many times and eaten many things - chicken, ribs, sides (mac and cheese and cornbread are to die for), but nothing, I tell you nothing, compares to the catering that can be done.  When my husband and I had our wedding party at our home, we wanted something special and unique.  So I called up Pittsburgh BBQ and ordered up a whole pig to be delivered to our Brookline home on a truck to display for all the world to see.  The whole pig arrived, was on display for about an hour and then was chopped into pulled pork deliciousness.  We also got tons of sides and had mounds of leftovers for a completely reasonable amount of money.   Have a party, get a pig, be infamous!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "2JjI8DCyrpabtg36iL5lrw"
  },
  "ltMjR9_1aoUDwi-FBmHgyw": {
    "date": "3/17/2016",
    "text": "Best BBQ ever! I love this place and been going here for years.  There is a BBQ place near my house and I would rather drive out of my way to get there food. There brisket is my favorite",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HDgYtTZNE2UCVq3bKLlFsQ"
  },
  "Y-8oRw-gxEXfS3g0y3zJrQ": {
    "date": "4/28/2013",
    "text": "Tucked away on the way towards regions unknown lies a nice lil barbecue joint.  Though not much for seating, this is definitely a nice spot to check out if you can squeeze over here during lunch for some takeout, or want to bring home a worthy ready-to-go picnic.  PROS:  1.) Excellent Service 2.) Tasty BBQ  3.) Fair prices 4.) Amazzzzin' cornbread  CONS:  1.) Some of the sides are underwhelming 2.) Wish there was more variety of barbecue sauces 3.) Not cooked/finished to order  I'd have to say this place, as a whole, is definitely a gem. The (owner I think) gave us literally one of everything on the menu because my friend was here from the UK. He tossed us extra sides, and gave us a huge bargain. Now, onto the good bits..the actual food.  The brisket was akin to grown-up beef jerky. A tiny bit dry, but that didn't really affect my overall perception. The burnt bits surrounding the meat was a meat icing on my carnivorous cake.  The pulled chicken was interesting; I was less of a fan of it on a bun (not overly seasoned) but by itself it was far more delightful.  Pulled pork was choice. I don't think I can pick out much of a complaint here  Spare ribs/full rubs:  I much preferred the full, fattier beef ribs to the trimmed ones. Fat = awesome and I think it's a selling point to why ribs are so tasty.  Mac and cheese: Though it had promise, I am eternally against storing pasta with the sauce. This ruins the texture as the pasta absorbs the sauce. It was decent though.  Macaroni Salad: Ah, this let me down a bit too. There just wasn't much to talk about here.  Simmered Apples: Though it's not winning a complexity contest, I was completely fine with these hanging out on their own accord  Cornbread: Yea. Get the cornbread. Trust me.  Overall this ruled. My point about wanting food to order should be clarified; I think having some fresh grill marks and temperature would have been greatly appreciated, but I understand that this establishment is a little more fast service. The food is served from chafing dishes. Interestingly enough I think this is a catch 22 as smoked meats are generally prone to overdrying, and I think there would be a confict of fast service if all the food was cooked on the spot. Oh well.  Go here please. AND TELL EM BRIAN SENT YA  (please don't tell them I sent you.)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RsgcXHipYKv5QVjSpAy2-A"
  },
  "lz2YuDajpRFoIJLqbr1yTw": {
    "date": "10/24/2010",
    "text": "I am a BBQ snob. I've had BBQ from Memphis to Raleigh to Atlanta and beyond. I didn't expect anything great in PIT. I have to say though that this is some of the best bbq I have ever had. Like others have said, the sauce is really good without overpowering the meat. I had the ribs and the pulled pork. Both had very well balanced smoke and meat flavor.  Not only is the BBQ top rate, but the sides are outstanding. The beans had 3 kinds of beans in them, were smoky, spicy and had nice big pieces of bacon. The cornbread had big kernels of corn and was dense and moist. My favorite were the baked apples. Think of the most tasty baked apples you have ever had and you are close to what these are - amazing.  If you are within 50 miles of PIttsburgh and like BBQ, I would recommend making sure to stop here next time you are in the area. It is tucked behind a Days Inn, so keep your eyes out for the sign. Yelp gave the hours as 11-7 but it is 11-8 everyday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 2
    },
    "photos": [],
    "user_id": "IoLMXv6wzfKaisN60u5iyg"
  },
  "ngLtI0JSBISpHFRTO3Vg-Q": {
    "date": "7/23/2015",
    "text": "Art and Judee did a very nice job catering our wedding rehearsal dinner. Good communication and organization. Very cordial. The staff they provided at our dinner were very nice and professional.  Judee went above and beyond one afternoon after we stopped by the store to sample a few of the items for our dinner. We thought we'd ask for a small sample of a few things. Judee gave us these huge portions all for free. Very nice.  Food is good. Really liked the brisket and spare ribs. Only thing I did not like was the macaroni salad . But everything else was really tasty and we heard only good stuff from our guests about the food. Pittsburgh BBQ was exactly what we expected and wanted.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zhLAF5XM3gHH6Brc0s2YEg"
  },
  "rbmvneSPRYR1Cx-0xRLvww": {
    "date": "9/23/2012",
    "text": "Positives *Generous portions- You get a lot of meat for your money. *Good selection - brisket, pork, chicken, lots of sides *Good service - they are polite and efficient, and get your food as fast as they can. *A few excellent dishes - I think the brisket is incredible, as is the mac and cheese. Everything is good, but these two really stand out. *Good quality - in both meat and ingredients  Negative *Horrendous location - tough to get to, weird spot. Especially if you do not live to the West of the city. Some have said it is close to downtown, which is True, but you have to go through the Fort Pitt tunnel to get there, which is usually a humongous pain to deal with.  Overall, the food is very good, great if you have a craving for BBQ, and you get a whole lot of it. Definitely the best I have found in Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "136ks3kOkzhNQdQY7B9MkA"
  },
  "161nmj-i5D21W-d5Dht1Fw": {
    "date": "10/23/2015",
    "text": "Have heard great things about this place but was left less than impressed.  Silverskin wasn't removed from my ribs and there was a price of plastic wrap in my Mac and cheese.  Cornbread wasn't bad though and I enjoyed the BBQ sauce they offered.  Main complaint was the tempature of my food which basically just slightly warm. When your meat is sitting in a hot box to stay warm after smoking please make sure it reaches the appropriate tempature, no one wants to get sick from lunch.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h2u6zWZSAnwVg28I2AmPZw"
  },
  "yDzEFxUz2oONBcqJfohOtg": {
    "date": "9/2/2012",
    "text": "Those who say that money can't buy happiness have never purchased a rack of PGH BBQ's slow smoked pork ribs with a side of home made sweet corn bread!  Their standard grilled ribs were still good, but not as tender, do not deprive yourself of the magic that their smoker works on whatever is lovingly placed in it!  I consider myself a discerning authority on BBQ and soul food and they have some of the best smoked ribs, pulled pork and hands down the best corn bread I've ever had in my life.  The corn bread is so sweet and flaky it melts on your tongue, and it has sweet corn in it that explodes on your tongue like flavor crystals.  Conveniently located near Murrysville and Downtown Pittsburgh this is a great place to pick up food before a game or for takeout for a party.  They have picnic tables available if you want to eat there, but they are primarily geared for takeout.  They also offer signature catering including pig roasts, a fairly unique offering which I fully intend to take advantage of for my next massive party.  If you're in the area and you appreciate bbq, take advantages of PGH BBQ's massive smoker and treat yourself to some of the best soul food in Pittsburgh!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "MDeA-Gx8NScCyAdziq7IeA"
  },
  "DSHN01x_c6Wud8slnjbX-g": {
    "date": "4/12/2013",
    "text": "My son and I tried the pulled pork, st Louis ribs, and brisket.  The brisket was one of the best I have had, and I spent a lot of time eating BBQ in Texas, so that says something.  The bark was excellent, the rub came through nicely and there was a good smoky taste.  The pulled pork was tasty as well, still moist and smoky.  The ribs were good as well, though I would have preferred some of the brisket rub on them for an extra kick.  We also tried the beans, coleslaw, and baked apples.  All were very goof representatives, and the baked apples may now be my favorite BBQ dessert. even over other traditional BBQ deserts like sweet potato pie and banana pudding.  The folks behind the counter were fun people, we enjoyed talking BBQ with them as we were figuring out what we wanted to order.  In for the weekend from Colorado, had a hankering for BBQ, and am quite happy with what we found here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MO1LbyZfS_ku1YpOirYkoA"
  },
  "QLqbHacZl10jLgRP7NqtJQ": {
    "date": "11/26/2014",
    "text": "Just picked up a smoked turkey, I live 5 minutes away, remember this is the day before thanksgiving. Brought it in and thought I would unwrap it a bit and look. Thought.....I'll just try it, my god! It was so moist and melted in my mouth, not too smokey, absolutely perfect! Started thanksgiving today folks! Yum! Oh.... And the staff was amazing, friendly and attentive, love them!  If you haven't tried this place you should. I also happen to know the brisket is the best I've had.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FeASWBPIZTgi-undzSExeQ"
  },
  "nbIojsRe__pBASRqlssCmQ": {
    "date": "8/27/2014",
    "text": "The cornbread should be illegal as it has addictive properties. Order a few pieces so you don't immediately have to drive back for more. The ribs are awesome. Best value for ribs is their rib combo (half rack, 2 sides,a drink). They don't really have anything that I'd rate low, except the mac & cheese. Just beware the withdrawal symptoms when they close for the winter.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "YFQ2NB2pOFGJG4pJVXoLPg"
  },
  "K46CaQJwZw5hIx6IqFQ96w": {
    "date": "7/29/2014",
    "text": "Mac and cheese was awful! Ribs were not better than quick grill homemade style! I'd avoid at full price, and only visit with a Groupon, the food is average, if not below! Not worth the wait !",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "EOS1aH7ZASKaE2BfbQjeJg"
  },
  "dE29dpBUw_jAYvi09uaKuA": {
    "date": "10/17/2012",
    "text": "Been hearing a lot of good things - stopped by on my way home today and picked up some ribs.  AWESOME...  Tasty, tender - a bit of a smoky flavor - but not too much.  Got to go back and try some more of the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "GcYao8ugtrbLESgajrwNRA"
  },
  "4FZwli6VNlvg0zCo1vlo4w": {
    "date": "9/20/2014",
    "text": "Really? This is what yinzers consider good BBQ? Im from Texas so i sure wasnt tricked. The pork was half way decent at best and the chicken didn't even taste like BBQ chicken (had an off flavor). The ribs looked like every other rack in the city, hard and dry. If I were to bring this back home id embarass myself out of the state!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CR0D39AqYLrClEpLU31OkQ"
  },
  "5xb6ECiQVBfSRo-sI38KfA": {
    "date": "8/15/2015",
    "text": "Now this place is a gem. The food is great and I love the brisket. They give you tons of food for your money. And the staff are nice and the place is clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g50vZBMZ7WJ9mprrIbb-BQ"
  },
  "siQCt7kDglWMcbb_uC1Thg": {
    "date": "4/29/2017",
    "text": "All of the meats are fantastic. PBBQ has the best corn bread in the city! The barbecue sauce is so good that I stock up on it for the winter.  I only have two complaints; The Banksville Road location has no indoor seating and I'm not a fan of any of their sides. If you enjoy the typical dry sides of a barbecue then you might like them, though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vu3lX-8xw-2j4OFjTILlzw"
  },
  "_jySrrEKGrb1D0-O9KD7SA": {
    "date": "10/2/2017",
    "text": "I've been a customer of Pittsburgh BBQ Company on Banksville for several years but frankly they've been going downhill. Most recently I ordered a half chicken and almost refused it when I saw it, frankly I should have refused it but I was hungry. All of the chickens they had were tiny, overcooked to black and dry. The ribs I've had here have always been good but this was awful. The sides here have also been sub-par. The beans looked good, but weren't; they made them with several kinds of beans and some were nicely cooked while others were grainy, and they were bland.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "989O-qZsZvVKt4Ue9Rm2rQ"
  },
  "zz8hC7xLS-ho_yvhhptdew": {
    "date": "3/28/2016",
    "text": "The pulled pork and their BBQ sauce stole the show! Our yearly ritual is that the day before Easter, we spend the day at my in-laws. It is a lovely day and it makes the weekend a little easier, so Sunday we don't have to run all over western PA. It has gotten difficult for my mom-in-law to cook all day so to make it easy we decided to order. My father-in-law actually made the suggestion after seeing the commercial on TV. We agreed with the decision ( can't pass on BBQ). We ordered a little of everything, meat wise.  Enough of the back story on to the BBQ. We got ribs, brisket, chicken, and pulled pork. The pulled pork totally stole the show. It was so tender with such awesome BBQ flavor. The sauce is a little on the loose side but sweet with just a little twang. Delightful! The brisket, not good for me. A little too tough in my opinion, eh. The ribs were very good as well. The meat was so tender it fell right off the bone. The hubby said the chicken was tender and tasted smokey. He liked the chicken.  And the fact that it travels well, awesome! They packaged everything up so nice and tidy. Overall the meat was terrific...and again- the pulled pork was the star!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 12,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "xrIdB-Ctiaalv9ovbkmUFQ",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xrIdB-Ctiaalv9ovbkmUFQ/o.jpg"
      },
      {
        "img_id": "TFxdO3xZDhIkDRsHKsqyag",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Bbq sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TFxdO3xZDhIkDRsHKsqyag/o.jpg"
      },
      {
        "img_id": "KxZCpHHdLp7IJKRehWtI-w",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Pulled pork and ribs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KxZCpHHdLp7IJKRehWtI-w/o.jpg"
      }
    ],
    "user_id": "NAZzgDkNIL_DpHg6xu9APQ"
  },
  "uuLg3dwON3wwQZWnaXL3gg": {
    "date": "6/4/2015",
    "text": "Best barbecue in pittsburgh! Ribs are great and moist, choice of regular and the leaner St. Louis style. You can't go wrong with either. We love the chicken here, first time I've tasted vinegar soaked roast chicken and apparently how it's made in some places in upstate new york.  Occasionally there might be a bit of a miss with us occasionally getting chicken or ribs more charred but the taste is always there so no big deal. Cornbread is the same thing, sometimes good other times just okay. All are still good when reheating at home. They give out dinner rolls which is just okay... But hey we're here for the meat not the free bread.  Their meat is so tasty and flavorful we rarely even use the sauce (there's a spicy option). There are like 3 tables outside but not a good place to eat with constructions going on across. This is mainly a takeout place, not even a bathroom for customers. Still, we will travel just to get takeout their amazing ribs and chicken.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-i8KtsXTRCoMz62ZoDMGGg"
  },
  "JAm3PL4ikl7ZNBFrcsKuKQ": {
    "date": "3/29/2014",
    "text": "If I could give 6 stars I would. Now with that said I really have no other choice but to tell you that yes I don't like vinegar based BBQ sauce and yes that's what they serve. So why in the world would the rating be so high? Well because I was given no other choice.   After circling the area for an extra 5 min thanks to GPS we arrived at the pearly gates of BBQ heaven. Walking in Vince introduced himself to one of the very nice guys who seamed to be the manager. He came over introduced himself and even gave my boy some dabs. Once I found the menu on the right wall and had the girl at the register explain it a bit we went with 1/2 pound each of pulled pork, brisket and a ribs. The sides we chose were baked beans and corn bread. Once we had paid the girl at the counter remembered my sons name and said bye Vincent. I was very impressed.   There is a single little bench outside that was open so we took a seat. Once we started to open stuff up we realized the girl that was next to us in line got our order and we get hers. It was an honest mistake. We ended up with a pound each of pulled pork and pulled chicken. She took the bag closest to her. So Bry went in told them what happened and reappeared 5 min later with a bit of everything they had.   The pulled pork was my favorite. It was so tender and the flavor was perfect. The chicken tasted like it had been marinated in vinegar so it wasn't quite my thing. However it was cooked to perfection. The ribs were fall off the bone good even though they left the membrane on. One of the guys even told Bry there butcher takes the membrane off. So maybe they need to talk to the butcher. I have to agree the Mac and cheese isn't anything to rave about. It wasn't very creamy but My son likes it. The cornbread is amazing!!! The sauce is a vinegar sauce but it's not overpowering like so many places I have tried. I actually really liked the spicy sauce. The vinegar cut the spice nicely.   The service hear is amazing and they go out of there way to make sure you are happy and understand that it's not just about the food it's about the entire experience. I will have no issue coming back here for a yummy pulled pork sandwich with some spicy vinegar based BBQ sauce.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 9,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "SW4a3Kl6UVlgDz-SmxqLfQ",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Welcome to the pearly gates!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SW4a3Kl6UVlgDz-SmxqLfQ/o.jpg"
      },
      {
        "img_id": "GkgISmOWFtOSpOSeTrLxmw",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. This made me really sleepy. It taste really good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GkgISmOWFtOSpOSeTrLxmw/o.jpg"
      },
      {
        "img_id": "7u1lVA6NX2JP-LpOLUbMhQ",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7u1lVA6NX2JP-LpOLUbMhQ/o.jpg"
      }
    ],
    "user_id": "U92V-gp13uMZL-sl_naTHA"
  },
  "NJYqBDRTYrlqhUPLCgyZ7A": {
    "date": "1/22/2017",
    "text": "I normally don't write negative reviews about anyone, but I was disappointed with my experience with Pittsburgh BBQ Company this weekend at a bridal show I attended. I have celiac disease, which means I have to be SUPER careful that everything I eat is gluten free. I politely asked if the samples were gf, the chef facetiously said that the meat was NOT gluten free (even though he later said it was) and that if I eat it I will get cramps, heel over and DIE! I was taken back by how insensitive he was, especially to a potential client! I will never go to this restaurant!!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "52LgldNRxPq_bzVWR7EUJQ"
  },
  "YhSIheSwK1ZdBAgnwVB_Fg": {
    "date": "2/12/2016",
    "text": "This is my go-to. Alas, closed in winter. Open NOV-MAR. SMOQ is open and at or about as tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OIjnT93oosQbMI8rtrd8vg",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Well rounded meal!  Pork, Mac N cheese, baked beans, bristles apple pie and... Uh, pork.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OIjnT93oosQbMI8rtrd8vg/o.jpg"
      }
    ],
    "user_id": "0buwrNb-4PIfcsa5XOXOEg"
  },
  "0x6mErT41iitgb_Uj1uyTQ": {
    "date": "3/30/2017",
    "text": "My husband went to pick up some BBQ on Sunday, March 12th but they weren't open for the season until March 15th, so he returned on Friday, March 17th. So they had only been open for 2 days. The food was good but the meat was pretty dry. Being from Texas, I grew up loving brisket and I don't slather on a lot of BBQ sauce. Therefore, on to what we ordered. We got a pound each of the brisket and the pulled pork. When you order a half or full pound of meat, the Pgh BBQ Co includes bread in round buns or long rolls. My husband used the round buns with his pulled pork and I used the long rolls for my sliced brisket. So, we each ate BBQ sandwiches and I had to put mayonnaise on my brisket sandwich since I didn't care so much for their BBQ sauce and don't like to cover the BBQ flavor of the brisket meat. My husband also go potato salad which was creamy but could have used more flavoring and seasoning. I also got the stewed apples which was good, but I was hoping they would be sweeter like the kind you would find in an apple pie. There are no tables at this restaurant except a table outside, and it is still too chilly to sit outside to eat during mid-March. So, the best bet is to buy it to take home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nM0xx9y_sKhqNfHNmcBysQ",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Up Close : Thicker sliced brisket",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nM0xx9y_sKhqNfHNmcBysQ/o.jpg"
      },
      {
        "img_id": "r2_qfRnE6mPtC-jAYXOklg",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Pulled Pork on round bun with a side of potato salad - creamy but could use more spices.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/r2_qfRnE6mPtC-jAYXOklg/o.jpg"
      },
      {
        "img_id": "73HauWDbNAkXep1MVTFhAw",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Brisket sandwich on long roll with steamed apples",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/73HauWDbNAkXep1MVTFhAw/o.jpg"
      }
    ],
    "user_id": "OcFwWG6Mmx66-BmAqLWwUQ"
  },
  "gpn1RljXwsfnxNiLwGzqxQ": {
    "date": "5/29/2015",
    "text": "Fantastic.  Got ribs, brisket and pulled pork.  Ribs are to die for. Fresh cut brisket is so moist and smoky. My mouth is watering just writing about it.  Pulled pork,  although slightly dry, I could eat 5 pounds. Great sides. Awesome employees.  Everyone is extremely friendly and very honest.  I love this place and am finding it hard to find a better place with better BBQ and better people.  Don't forget to pick up a few on their smiley face like cookies---PIGS! They really care about the food that they serve.  THANKS",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M3UMxTtLF-zoPalKMPeTdw",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Yummy",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/M3UMxTtLF-zoPalKMPeTdw/o.jpg"
      }
    ],
    "user_id": "5ieSTYGXs76CcstX-SzwCQ"
  },
  "PK-gymD-41xGWPARr5A_8Q": {
    "date": "8/27/2013",
    "text": "A most unfortunate location doesn't seem to phase Pittsburgh BBQ much. They may be right off Banksville Road from downtown, but blink and you'll miss the turn. I honestly really believed for the longest time that the only way you could enter in is if you were coming from town! I just realized you can turn at the hotel and make your way along the gravel drive. Not the most convenient, but if you want BBQ, you find a way to get it!  Since passing them day after day I was eager to try and I will say they did not disappoint. I like the idea that you can get a combo meal. So one meat and two sides, plus a drink. And it's a lot of food! I ate for two days after! I ordered up the brisket, which was tender. The baked beans, which had a mixture of beans in a tangy sauce and the cornbread. It was the gooood cornbread too. You know, the kind that's made with bits of corn in it. Plus, they gave me a bun for the brisket to make a sammie. I liked the sauce too, it tasted strong of vinegar and wasn't very thick.   My hubby, on the other hand, was not a fan of his meal at all. Weird since mine was so good! I can't speak for the ribs, because I didn't try them, but I took a bite of his mac n' cheese and it was AWFUL! It tasted very weird. I was really surprised considering BBQ places usually do it up big with the mac. Bummer.  I'd for sure go back, but maybe avoid the mac.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 3
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "gvQk2v11PraPQmf3cMvryA": {
    "date": "5/26/2014",
    "text": "Definitely worth getting too it's just one of those hidden gems we have in Pittsburgh just off the beaten path that's part of mystique of it and then it's your own little treasure !  I tried the pulled pork sandwich with regular BBQ sauce the portion was huge it comes with a knife and fork you'll need it .  Definitely will be going back to explore the rest of the menu",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LKYlGUsDYp1wwOikbB_VJQ",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LKYlGUsDYp1wwOikbB_VJQ/o.jpg"
      }
    ],
    "user_id": "ALfJctlmJE-kF5RfR8oudQ"
  },
  "vkKyACGVWTjHUdlbTFijnw": {
    "date": "4/27/2017",
    "text": "Always swing by for BBQ take out on a late night or game day. Great BBQ, not the best I've ever had but good. Run by vets and nice service. Prices are okay.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8oWBRCg3_GBQtk-4ll5Ydg"
  },
  "MIuexAgoi3nUx-YFOe9mwg": {
    "date": "10/28/2015",
    "text": "It's really hard to find a good BBQ place on this side of town so this is maybe the only decent choice in the area. I haven't been there in a while but I do remember the food being pretty delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "91koVXu54Y6tIiZKKxVmrw"
  },
  "i2X5Dl2LT9iVMtIyPefrAQ": {
    "date": "10/22/2012",
    "text": "Homina, homina, homina....  I rolled up on a Friday afternoon for a couple sandwiches before they close for the season.  The smell is amazing.  The menu here is modest, which is good.  I don't need to many options when it comes to BBQ.  I decided on the pulled pork and chicken as well as a side of cole slaw.  The gentleman filling my order asked me if I'd like the meat packaged separately instead of him assembling the sandwiches since this was a to-go order.  I thanked him for his wonderful idea.  My order was filled quickly and I was on my way, drooling from the enticing aroma.    I'll get the bad news out of the way first.  The cole slaw was dry and did not seem fresh.  I'm guessing they make a batch for the whole week on Wednesday and by Friday it's not so good.  But I can forgive the dry cole slaw only because the pulled pork was a thing of beauty.  When I opened the container, I was overjoyed to see the seasoned and burnt ends carelessly mingling with the pink colored smoke ring and some other bits and pieces.  Often pulled pork does not include the ends so it looks pretty and more presentable.  I prefer this messy hodge podge that contains all the flavor.  The sauce was good, but honesty, I didn't even think that the pulled pork needed it.  The pulled chicken was presented much the same way but I did add some sauce to it.  Should I talk about the portions?  I had enough for 3 sandwiches from each container.  Had it been assembled for eating there I'm not sure I would have received as much...or my sandwich would have been overflowing with meaty goodness.    I should thank Darren W for his info but also update it.  Yes, Pittsburgh Barbecue Company is on Banksville Avenue.  The Days Inn is a good landmark to watch for as PBC is just behind it.  If you are on Banksville Road heading into town, the left turn for Banksville Avenue is just before the Days Inn (and if you pay attention you will see a small sign that directs you to BBQ).  There is no median to block the way now and there is a turning lane.  If you are on Banksville Road heading away from town, you will be making a right turn on to Banksville Avenue just after passing the Days Inn.  There is also a street sign that you may not notice coming the other way.  It should also be noted that they have restricted hours.  They are only open Wednesday through Sunday and are closed from November until March.  They also have an outdoor tent with picnic chairs in case you just can't wait to get home.    I know it's almost time for PBC to close up shop, but making it over for another round before November is definitely on my to-do list.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "WoKCLSctS7G2547xKcED-Q"
  },
  "RpOCNlWFHXGzseI0CfX8uw": {
    "date": "9/22/2015",
    "text": "Tiny little take-out counter on an industrial frontage road.  They'll put half a strongly spiced, rather wet chicken in a bag.  Doesn't need any sauce.  Interesting taste, but very dried out meat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vlrAxP8VNwsQO6kB4DM48w"
  },
  "_vAwphngvcQKvY0civkypg": {
    "date": "7/30/2014",
    "text": "We had take out dinner since the only seating is outside on benches by the road. Surprised no indoor seating.  We had two pork sandwiches baked beans and baked apples with drinks.. $28. A little pricey. The pork was dry and the sauce was nothing special. The baked beans had an assortment of beans and were tasty and so was the baked apples. The portions were ample. Definitely not the best BBQ that i have tasted. The ratings are overrated. I was hoping for a better experience. WONT GO BACK...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "lXEPwm3S6iILKljoeYmWiA"
  },
  "LZ1MiLVliaUbidcGzMxoyw": {
    "date": "8/26/2017",
    "text": "I've gotten take out 3 times here now. The guy working suggested the brisket, so I've just stuck with that bc he's right- it is delicious. Where they totally get it wrong is with the sides. Complete fail on everything I've had. The potato salad is completely flavorless, I added a little salt & pepper at home which helped but.... and the same thing with the coleslaw. It wasn't sweet or tangy or vinegary, or anything really. Just some cabbage that tasted not quite fresh. The corn bread was greasy! It was literally DRIPPING oil when I unwrapped it. I've never seen a wet-looking cornbread before, maybe it's supposed to be like that? Idk dude. The biggest disappointment tho by far was the mac n cheese. It's soggy noodles that are barely holding together. I did not even taste any cheese, like at all. They keep it in a crock pot/ soup warmer so maybe that's why it's so over cooked and ratchet. I'll def be back for the brisket, but that's about it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vDix29L-XkjAL3pRGaSxcQ"
  },
  "xrheirV4I0_dUFlUNb3Uvw": {
    "date": "3/28/2012",
    "text": "Note #1: Pittsburgh Barbecue Company is actually on Banksville AVENUE, not Banksville Road. Look for the Days Inn motel; PBC is right next door.   Note #2: PBC is strictly carry-out, and there is no need to call ahead. You just walk in, tell the folks behind the counter what you want, they ring you out, and your meal's boxed up for you to take away. Everything's ready to eat immediately.   On a secret, gravel-studded street off of Banksville Road sits a house of stained wooden slats. Spectral vapors can be seen floating into the air from a tin chimney only to vanish into a powder blue sky that serves as a backdrop for an early Spring evening. A campfire aroma will comfort your nostrils as vehicles race up and down the highway--you will briefly forget that you're in a major Northeastern city.   The other day, I treated my family to another bring-it-home banquet, finally getting down to trying PBC after years of procrastination.  What we found were St. Louis Ribs that were fat with luscious pork that almost pulled itself from the bone and blushed when torn into.   Speaking of which, the pulled pork sandwich was tall with protein, crisp skin, and sweet, blackened debris.   A runny, vinegary sauce with just enough bite to it dressed the smoked animal flesh.  Whatever fires that burned in our traps were extinguished by a fresh, vibrant, crunchy cole slaw.   A lackluster macaroni and cheese was kicked out for loitering while a serving of baked apples arrived fashionably late, stealing the spotlight with its wealthy, fruity, pie-filling lava.   If barbecue is a science, PBC should at least be nominated for a Nobel Prize.   I only wish they'd add potato salad to their menu.  My personal food obsessions notwithstanding, fly down to Banksville and take home some sapid, smoldering Southern fast food for you and yours. You'll win hearts and minds.",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 22,
      "cool": 17
    },
    "photos": [
      {
        "img_id": "TCInhsJl0kCVpM-jtrsrcw",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Cole slaw and baked apples",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TCInhsJl0kCVpM-jtrsrcw/o.jpg"
      },
      {
        "img_id": "LhEIWsjBJyIqBDrQlSiQPQ",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. St. Louis Ribs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LhEIWsjBJyIqBDrQlSiQPQ/o.jpg"
      },
      {
        "img_id": "WeIHjVpM4zXTYZU7KRdilQ",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Pulled pork sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WeIHjVpM4zXTYZU7KRdilQ/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "zuoX3K-aFueDTfyK05Zi-A": {
    "date": "6/4/2016",
    "text": "There's not a whole lot to say about this place other than the fact that you should already be eating there.  Order half a slab of ribs with two sides. The hot bbq sauce is actually hot, so don't eat it unless you have an easily-replenished beverage at hand.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ir9KEnn-0IIEdQ2xnEcNuA"
  },
  "tRNr-_HskB1gQyslJRVg2g": {
    "date": "6/12/2016",
    "text": "I love their sauce and buy it by the bottle. My favourite thing to get is the ribs. I also like the brisket. I have had better but I really enjoy this place. I love  to get some rolls from the Italian bread place nearby and combine it with the meat and sauce from here. BBQ hoagie heaven. This may be the most and only intelligent thing I have done in my life to date. Please write on my grave stone!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V-FY5zG20RRJxMV2p_QKGQ"
  },
  "Qgx9ldSuuy2pgbPxbHO1Ug": {
    "date": "7/29/2019",
    "text": "We had Pittsburgh BBQ provide catering for an event in our backyard with approximately 100 guests. Judee was absolutely fantastic to work with, and was extremely accommodating, as we changed the details several time up to the last minute.  We got the Brisket, the Ribs, Smoked chicken, and Portabella mushrooms, along with a bunch of different sides. I cannot express how delicious the food was. Our guests spent most of their time debating which protein was the best. We've been eating the leftovers for days.  It's also worth mentioning that we had them provide two servers and a bartender. They were all wonderfully nice and extremely helpful.  I wouldn't hesitate for a heartbeat to use Pittsburgh BBQ again for a future event.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-njbqPAW-wbBx9NxQmVlIA"
  },
  "asHVTTf-7u2AKrVGD2jgmA": {
    "date": "5/27/2019",
    "text": "These guys catered the Memorial Day event at Soldiers and Sailors Memorial Hall in Oakland.   My wife and I got a pulled pork sandwich with the Mac and cheese and baked beans to share.  The Mac and cheese was pretty good and I enjoyed that there was a hint of pepper to it. The baked beans have a variety of beans which makes it a little more fun that your regular baked bean varieties.   The pulled pork was quite good! There was a generous portion provided and it was still nice and moist. The homemade bbq sauce was just the cherry on top.   I don't know if I would consider it $10.00 dollars good, but I'd probably come back :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iicg8bnAevUC20LlXRNv8A"
  },
  "InyFv4ay436Hlvr8bx7EOw": {
    "date": "9/20/2019",
    "text": "Forgot to check in while I was down there but just made it home. I ordered a pulled pork sandwich with the spicy BBQ sauce. I can already tell from tasting the barbecue sauce and the barbecue it's going to be outstanding. And the fact you can really taste a smoked flavor on the BBQ. Magnificent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OaLZDcNOYKRfeXHFOYFtlg"
  },
  "i-5aK3b3Pzuw6UnCKvQAJw": {
    "date": "9/17/2019",
    "text": "Love love love this place, been coming here sence i was a little kid, anything you order will be great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dg27vGDj8YtrHGahk6HCuA"
  },
  "UMBctyKwKJBgZX7XzkG7nA": {
    "date": "9/14/2019",
    "text": "Okay as a last resort. Meat is usually dry. Sides just aren't the best. This used to be one of my favorites.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a6O6XF9-qSmxGOjbasC5ZQ"
  },
  "oTSkC7loHwGyqwHrw9gCEA": {
    "date": "7/30/2018",
    "text": "Catered an event at work and everything was outstanding. Shredded chicken was good - not dry. .. flavorful.  Cornbread was on point.  We had mac n cheese and red potatoes .. went well with the chicken.  We will no doubt be ordering again.   I increased the number of person count just to be on the safe side.. and it was a great balance!   Love that bbq !   Thanks Pgh BBQ Company~!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "xqho94TTdA6rQNsU-d-7yQ": {
    "date": "9/18/2019",
    "text": "We hired Pittsburgh Barbecue Co. to cater our wedding.  The food was absolutely amazing and our guests were completely wowed. The staff was incredibly professional, efficient, knowledgeable and friendly.  One of the servers actually found me tucked away in a side room while my mother was hopelessly trying to bustle my dress to ensure that I got some of the appetizer mini pierogies.  Our bartender was equally wonderful.  She set up our bar perfectly, warned us before we ran out of ice and stayed late to help us break things down.  Of course a huge thank you goes to the owner, Art Cohen.  He was actually there at our wedding making sure everything ran perfectly.  He called me several times in the weeks proceeding our wedding to see if I needed anything and he took charge.  I have never worked with a better catering company and I will definitely be looking to hire his company again.  Thank you Art and thank you to your incredible staff!  You all made our wedding absolutely perfect!! Love, Mia and Brian",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uPNgUnsL6_IFFIIESRHMdw"
  },
  "R2cYU66jKL7x6iFv3ZjC2Q": {
    "date": "8/9/2019",
    "text": "We've had food from PBBQ several times and I've never written a review. This barbecue is great! Reasonably priced, delicious food without all the work. My favorite is the pulled pork. We grabbed food yesterday to take to a family gathering. Pulled, pork, chicken, brisket, mac and cheese, greens and cole slaw. They provided the fresh rolls, spicy and mild barbecue sauce and even offered plates and flatware. All this for food for a large group for under $100! And, best part, leftovers!! No need to cook all day when this is available.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SvB9kYlZy0Mmsec15Gix_A"
  },
  "F07DmrqwsafOU7ZnkeVFfQ": {
    "date": "7/25/2019",
    "text": "Found this place on Yelp and probably should have gone there before today. I am always looking for a good BBQ place in Pittsburgh region. A co-worker and I decided to give PGH BBQ a try. The location is near a local hotel. I had the beef brisket with two sides and drink. I wish they had sweet southern tea. The portions were great and the food was hot. The brisket was tender and BBQ sauce on the side was good too. The potato salad was decent and the Mac/Cheese was fine (doesn't beat my mothers though)!  I plan on going back to try the pulled pork and ribs next time plus some different sides.  Only drawback was they need more covered seating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H9uWy6u0C7AwW0JPNJbOSQ"
  },
  "ITOENNjkhAcsJiLKegBzxQ": {
    "date": "4/24/2019",
    "text": "We tried this place because it was close to our hotel, and Yelp said it was good. Yelp was right- the pulled pork and the brisket was amazing. The Mac and cheese, beans, coleslaw, and greens were also delicious. It was super reasonable and the portions were generous.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xLqcEtEPhtCiFVdjZETGKQ",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xLqcEtEPhtCiFVdjZETGKQ/o.jpg"
      }
    ],
    "user_id": "EB0REmXF-zYlvUclVEVvqA"
  },
  "GQtesaUB9mf6rpk2D2PZaQ": {
    "date": "8/9/2018",
    "text": "Found Pittsburgh BBQ by chance and are so happy we did. Had a fantastic fulling meal at a bargain price. The ribs were smoky and succulent. The brisket was out of this world. The sides were plentiful. The potato salad not to be missed. Ordered the collard greens on the pretense of a healthy side and would give that a pass next time. But I wouldn't think twice about ordering anything else. And of course get a cookie. They are made specially for the restaurant. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3cATijudW_nKXdPXYAhcMQ",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Hidden away behind a hotel. Worth searching for.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3cATijudW_nKXdPXYAhcMQ/o.jpg"
      },
      {
        "img_id": "FeK-bbcTwWXv2PX5FJOasA",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Ribs, Brisket and Sides",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FeK-bbcTwWXv2PX5FJOasA/o.jpg"
      },
      {
        "img_id": "Zuun-57r2l83u7jcgEhUAg",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Go early and often.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Zuun-57r2l83u7jcgEhUAg/o.jpg"
      }
    ],
    "user_id": "PmrjobTmD-IDx43bQ-mnHg"
  },
  "wdQ27tV2fQC_EZidDsh2Og": {
    "date": "7/28/2018",
    "text": "It's not complicated. If you want fantastic BBQ, this place delivers. Portions are healthy, prices are reasonable, and the barbecue is amazing.   Had the brisket and pulled pork. Fantastic on both counts. Also, the mac and cheese was delicious. The coleslaw wasn't really my cup of tea, but the brisket and mac and cheese was more than enough. If I go again, I'll only get one meat and one side, it was definitely enough to keep me full for a while. Also, their sauces were really good. I could always go for a spicier one, but what they had was delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C0gxyn5rsN3B14hX0WzvKA"
  },
  "mOHQDb8_I9BEA61lJXA6Vw": {
    "date": "11/5/2016",
    "text": "This is excellent!  If you want real pulled-pork, this is your spot.  This is take-out only; there is no place to sit!  Not a problem, just be aware.  There is plenty of parking, so it's easy to swing by and carry out.  The pulled-pork is just right.  It has a slightly sweet, smokey flavor, and is very moist.  They mix the pork well, so you'll get some stringy inside bits and some slightly charred \"bark\" outer bits, too, which I like.  Their sides are excellent as well:  The baked beans have a mix of bean types, and a bit of hot \"bite\" in the mix.  The beans are not over cooked to mush like some BBQ places do.  The corn-bread is very good, too.  It is NOT sweet corn-bread (some BBQ places do sweet corn-bread that's more like a corn muffin).  It is dense and heavy, but just tastes great.  Finally, I find this place to offer a great value.  I get a pound of pulled pork, some fresh buns (wrapped in foil, thank you), and a couple of sides and it feeds my family of five, sometimes with left-overs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "yVMvS4Q7JTxHALm8CTwSZQ"
  },
  "BIvp-zd5jsw5y7p4Dj7prg": {
    "date": "1/4/2019",
    "text": "Went there last weekend 10/27/12.  Clearly the best BBQ in the city. Spare ribs were outstanding and the brisket melted in your mouth. Best cornbread I ever had. We even went back for seconds!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TguOu1v5o8nPrw0oUnC3nA"
  },
  "pY-f7fMjz05Cox-RWLOBcQ": {
    "date": "6/9/2018",
    "text": "This is a great take out place. Very nice and clean inside. Barbeque smells so good when you walk in. They also do a lot of catering. They offer BBQ and home made sides. For anyone who likes cornbread, theirs is the best  I've ever eaten. The BBQ portions are large and inexpensive. Food is delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GRTWB_T1jeA9iS7TitE9Ug",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GRTWB_T1jeA9iS7TitE9Ug/o.jpg"
      },
      {
        "img_id": "RwNqVL8kTGDahdZ4I62k9Q",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Catering info",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RwNqVL8kTGDahdZ4I62k9Q/o.jpg"
      },
      {
        "img_id": "xuqoTAHOjc1Sr6gZr1G3-w",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Pulled chicken, home made beans &amp;amp; Cole slaw.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xuqoTAHOjc1Sr6gZr1G3-w/o.jpg"
      }
    ],
    "user_id": "6s8pzEG392M-zHvayaIBRw"
  },
  "sJBwcful2Re0laRiSXN2tA": {
    "date": "10/15/2017",
    "text": "No Barbecue place should ever say \"We cut our Brisket really thin so it's easy to chew.\" That's what I was told word for word when I walked in and I should have turned around right then. I asked them to cut it a bit thicker but it was extremely tough and needed more time on the smoker. The ribs were over cooked and gummy. The silver skin (thin membrane on the underside of the rib) hasn't been removed so that made it hard to eat.   They didn't even finish cooking the corn bread. It was almost raw dough.  I'd stay away from this place.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "whaxdWo-7SSqPMU2__tDjA"
  },
  "s7HqeZ1rOhp8mKXBuzWkmQ": {
    "date": "10/30/2017",
    "text": "Away overpriced and the food wasn't good at all... not easy to park within the area  Overall I would never come back, considering other BBQ options in the city I will definitely try something else",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sYTzEYS9iHd2PD0guyRQuA"
  },
  "A93henh8bMkpiTwecaGWnw": {
    "date": "7/29/2016",
    "text": "Typ bufetu. Asi typicke americke BBQ. Na moj vkus trochu suche - vypecene do sucha.  Obsluha mila a poradi",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "m7axhayDmCF2hi48JAhc3A",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Fazuľa - veľmi chutné",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m7axhayDmCF2hi48JAhc3A/o.jpg"
      },
      {
        "img_id": "JFtgruDpCPPB62Cp3zWeUw",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Kukuričný chlieb a kapustový šalát",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JFtgruDpCPPB62Cp3zWeUw/o.jpg"
      },
      {
        "img_id": "dvxNaoxAB3jV6e0luH-4rw",
        "caption": "Photo of Pittsburgh Barbecue Company - Pittsburgh, PA, United States. Kurčo a rebierka",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dvxNaoxAB3jV6e0luH-4rw/o.jpg"
      }
    ],
    "user_id": "PDn1Pa-sdWpJXiH4n09WrA"
  },
  "fc8XfzR-ClIpiJfpQhwM1g": {
    "date": "9/19/2018",
    "text": "This is not BBQ--bland, no taste...cannot even describe the taste...as is bland--no vinegar...no bbq--taste like fake smoke added....??? After living in VA for 30 plus years....this is just shredded pork and chicken...ugh.  They give you sauce in little ramekins...what is it?  No flavor and no taste....just like the meat.  Also, inconsistent--we had the chicken recently and it was super dry.  They claim...taste like NC BBQ--not sure why they think this...did they pass through and area of NC and have bad BBQ and say...we can duplicate this--??  You can smell the fake smoke--like they are mass producing to get it out the door....the meat has to be slow cooked for a LONG time...no fake smoke added to fool the True southerners....maybe Pittsburghers believe this is good.... The buns are the best part... I can make more flavorful BBQ--and after tasting this a few times...have opted to cook my own....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gINBy5fb6azFKdCuof5Big"
  },
  "2OJF7LVGIhZobFWxBEwMZw": {
    "date": "5/21/2017",
    "text": "This is as good as it gets for BBQ in Pittsburgh. When it's open, it's a staple for me at least once a month. That said, if your expectation is BBQ from a part of the country that's famous for it, then you're going to be disappointed - not just here though, but everywhere in Pittsburgh.  Otherwise, this is really solid BBQ. I've enjoyed all of their meats that I've tried (brisket, pulled pork, ribs). Very good value/prices, too.  Their cornbread is one of my favorites I've ever had - it's dense, cake-like, and a little sweet.  The only miss here is the Mac n Cheese. It's really not very good: flavorless and even a little soggy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GI4axyIecDl-tgNwpQmZSQ"
  }
}