{
  "PrHG_0-68fmg-yiCess1jw": {
    "date": "7/20/2015",
    "text": "Pros:  -great choice of sandwiches and cocktails.  -They don't have a huge beer selection, but a pretty good one, I like unique beer or micro/local and they had  a couple of good ones to choose from. -super friendly staff. -I had the special, pulled pork with an onion ring and my partner had the turkey sandwich which looked sooooo good, I had sandwich envy. We both enjoyed our sandwiches. -felt like a hometown bar, not a cliche chain. Cons: -smelled funny when we first walked in -the steak fries were just ok (but I'm not really a fan of steak fries)   Summary: That's it, only two cons! I'd definitely go back. If I lived in blawnox I'd probably be a regular. Great for lunch or to meet friends for a drink.   Cheers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hKXgyD6UeazjjqbzplvZw"
  },
  "mkWvUzHkX8N7abaDsZQ9nA": {
    "date": "6/25/2017",
    "text": "Food was delicious...service was wonderful....and the place was very clean. I highly recommend Nox's!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bvLh_CWY758WhdJVa_f2BA"
  },
  "IJ4t7bgaxxdkO6rDXb8Ecw": {
    "date": "6/26/2017",
    "text": "This is a great neighborhood bar with awesome food. Have never had a bad meal there. This past Saturday a bunch of us went for dinner and we were not disappointed!!  The fresh made chips are wonderful and the strange and yummy chimichangas. My burger was perfectly rare and the sriracha wings were excellent!!  Hot, hot. Many many kinds of beer to choose. Sat on the patio and enjoyed the local fireworks test run!  Good,knowledgeable and attentive waitstaff. Go and try it, for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XykWey533GvpcasPInrFZw"
  },
  "AD4eGKN4Er26BlJLgJof9A": {
    "date": "4/13/2016",
    "text": "Best wings I have had in years. Great staff and great atmosphere. The nightly specials are great. Their burgers are better than all of the foo foo 15 dollar Burger places around and 1/2 the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "71DxavFEGk3BPY5gG-XoKA"
  },
  "7SEhvj1VhJUoE-b2HFMC9g": {
    "date": "6/6/2017",
    "text": "Very nice bar and the atmosphere, I was there just because it is near to my company but I will definitely go back to have some beer and wings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ksQDegGxrLIFHNtWL11QVw"
  },
  "o3AOm8IfXeA2adnYZ_wOXQ": {
    "date": "9/9/2015",
    "text": "This is a great neighborhood bar. Always has good food and drink specials. Attracts a nice crowd and is modern and very clean. I would like to see more vegetarian options such as a veggie burger.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Rgtl1H2yZ_qnsBjHMhWTQ"
  },
  "XbRYP3QQ0A8xZ1OVp3tkGQ": {
    "date": "10/25/2014",
    "text": "We visited Nox's Tavern late last night for dinner. Even at the late hour, our service was awesome, and the staff were very friendly. I tried the Smashing Pumpkin cocktail, which was delicious, on special, and looked amazing.  For a neighborhood bar, they have a nice list of tasty cocktails.  The food was also awesome. They make steamed burgers. I had ever tried one before, and I don't think you can find that technique at many restaurants in Pittsburgh. Overall, it is a low key bar with great, unique food and drink with competitive prices. Definitely check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WhdC9ESN8bfdBjpPLD1iNw"
  },
  "DmS08wF9rE-6gy3YKYMVSg": {
    "date": "12/31/2014",
    "text": "2nd time here, last Sunday night! yum yum! So pleased with this local place, my kids in the 20's loved it too............the only think I would ask for is more craft beer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "GFR5vWJ0KVxuOIxlQFK-Lw"
  },
  "aoP1TaU6NVRUgf9wS147Bw": {
    "date": "1/28/2016",
    "text": "Tremendous service! The atmosphere is as friendly as yogi bear. Amazing buffalo chicken egg rolls. One of my favorite spots in Pittsburgh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w2iMZHUoq9InpV9BcKcm5Q"
  },
  "T3FTlH6u8RUE8cvBnajVvw": {
    "date": "12/17/2014",
    "text": "My family and I absolutely love Nox's! It's a great place to catch a bite to eat and a drink. Haven't been disappointed yet, and we've tried many menu items! Burgers are delicious, as well as the loaded fries, pretzel sticks and wings! If you're looking for great atmosphere, awesome service and delicious food then Nox's is where it's at!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wXolwZEXmJ9ELHXzxu5BZA"
  },
  "vVHZxRGi5xiUVP303roPug": {
    "date": "10/9/2015",
    "text": "OMG!!! Steamed burgers!!! WTH is a steamer?? Juicy, succulent steamed burger on a soft kaiser roll. Wings were perfect, loved the jalapeno cheddar wing sauce. Homemade chips, steak fries... That's all we could try this trip. Great menu, excellent drink/beer selection. Super-duper friendly and helpful staff. Quick, attentive service. Nice divey bar feel without being a real dive bar. The restrooms were super clean too. Looking forward to our next visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kNFxzHyQ486Ez3MjMVMTwQ"
  },
  "koAcud8AkrrtTFa77rdrJQ": {
    "date": "7/7/2017",
    "text": "Gooo heeeere!   What a hidden gem!! If you're look for great food, Nox's won't disappoint! Especially if your craving wings, this has to be your go to!  Don't let the fact that there's no designated parking, entrance through only a small side door, or the small, divey inside deter you.. The people are friendly and the food is on point and that's what counts! The wings are some of the best we've had, and that's saying a lot. Honestly, if you're choosing a chain restaurant for wings over this place or somewhere similar, you need to reevaluate your choices.. those places have got NOTHING on a local establishment like this.  There aren't many tables in the dining/bar area, but I'm certain I saw a sign for patio seating while we were there.    If you're unsure, don't be.. trust me and your fellow yelpers and try this place out! You won't be sorry!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Az_JgEpXqAii_5EDkw2tw"
  },
  "_iv8mubWqNMpr0dEwvdKgg": {
    "date": "2/7/2018",
    "text": "We've been here twice now for lunch, and both times were great. The steamed burgers are incredible (I was skeptical, but they really are super moist and flavorful without being greasy), the fries came out piping hot both times - no way these sat under a heat lamp - and the service was friendly and fast. You can't ask more out of a great lunch spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_mo3JudKCb7dthW00pZTUg"
  },
  "tMGivXIqRxk0igqCh7wc5g": {
    "date": "5/18/2018",
    "text": "What a cute place and so clean.  Very impressed with the friendliness and quick service.  Nice menu selection too. Rated it a 3 due to the hamburgers we ordered.  Really tasteless, and in need of seasoning.  I was sorry we did not order the wings based on the reviews.  We thought we'd order the hamburgers based on the high ratings, but we're disappointed.  We'll be back to try other items on the menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ccQoTNlwneWz7mC4uy7lhg"
  },
  "RIY1pwG-Lcr-CvMFq2-gvQ": {
    "date": "2/23/2018",
    "text": "The steamed burgers are THE BEST (and huge). They are cooked perfectly, and don't leave that charred taste when burgers are grilled. So good! The house chips are really flavorful and crunchy, highly recommend getting them. I tried the American burger (make sure to ask for the nox sauce on the side because it doesn't come with any sauce), and my husband had the lumberjack burger- both with no complaints. The staff was extremely friendly and the prices were comparable to other places, not too expensive. We ordered takeout, and I would definitely order from here again. I'm not sure how I've never heard of the steamed burger before, but I don't think I can go back to the regular old grilled burgers. Loved it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gKU45Tq9JJ9Z7HiZChu3ew"
  },
  "tzCOv_Y7LUSAWWJS5nj0CQ": {
    "date": "5/15/2017",
    "text": "Visited Nox's Tavern for the first time and it did not disappoint! I really enjoyed the friendly atmosphere that all of the bartenders exuded. It felt like I was in an episode of \"Cheers\" or something. We ordered the famous mesquite wings and they were absolutely delicious. Another favorite was the pretzels with the white cheddar cheese sauce! Will Be coming back on a regular basis!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sr696bqeUXLr7rB3iIvQlQ"
  },
  "DGO4FSrWN8uOpTK3Jk198A": {
    "date": "10/14/2016",
    "text": "We searched long and hard for the best wings in Pittsburgh, and we finally found them at Nox's Tavern! This is a hole-in-the-wall small establishment with a lot of heart and great food. We find ourselves here at least once a week! The kind and friendly waitresses are always quick and efficient, and one even brings over our drinks as soon as we sit down. They are the best waitresses around.   We always start our meal with a basket of their homemade chips, and they frequently come out piping hot. They are generously salted, and crispy after they have cooled. Since their wings are so good, we usually go for those. Wing night is on Mondays, but their prices are so reasonable that we get them on non-wing nights as well. I love the sea salt and cracked black pepper, which are dusted with oil and big chunks of pepper. My husband usually orders the spicy garlic Parmesan, which come with actual strips of Parmesan on top. He also loves the wet Cajun, and we occasionally share the dry Cajun. He has also had the hamburger, and enjoyed the fresh buns and generous toppings.   They have a nice outdoor patio that we frequented quite a lot this summer and September, but the inside is never usually too loud (except the one night when a live band was playing, which turned out to be a lot of fun!).  Last week, we ended up here on trivia night, and we had a great time and won $15 for a return visit. We will definitely be using it soon for more delicious wings!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "KAsmY6WCUWRYQXE_50AkQA"
  },
  "OyeUB_uWXWzGJr-XBpB6Sw": {
    "date": "7/24/2018",
    "text": "Reuben was awesome as well as the burgers.small place ,hard to find parking but food was very good,",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jMRzHWYLAlxTcyphoELe7w"
  },
  "1zRnjt75LarKOkYe9N2G2A": {
    "date": "7/5/2018",
    "text": "Best local bar around! Convenient location, solid wing night, creative monthly specials, excellent service and fun atmosphere! Especially the back patio in the summer time. The staff keeps up quite well for how busy this place can get. I have introduced several friends to Nox's and they all loved it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q5id8l-8neWf78rbe0qbeA"
  },
  "wj4N-UxEsokqu9-z_u0e0A": {
    "date": "12/27/2017",
    "text": "Rrally bad service......dont know whats going on .....i been waiting to eat for over 40 min!!!! GARBAGE!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a4xadTXEY9BGtDR3HdO94A"
  },
  "kWNu7TgUlSQTMNcoVTUlYg": {
    "date": "6/24/2017",
    "text": "We were in the area for a baseball tournament and decided to try Nox's based on their reviews. We were not disappointed! I would highly recommend the Key Lime Pie drink and Hot Garlic Parmesan wings. Everything was fresh and flavorful. Service was as good as the food and they were still nice to us when we told them we were visiting from Baltimore. You won't be disappointed if you check out this local gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a6xMp_CZXW8GQwzb6ZrKEg"
  },
  "X8iV7ASxHP632vFXH6hp4w": {
    "date": "5/21/2018",
    "text": "Stopped here after picking up some drums 2 min down the road at Pianos N Stuff. I saw a couple of great reviews saying the wings were on point, so my boyfriend and I decided it was a great place to check out, especially since were pressed for time. Turns out it was wing night (Monday) so the wings were 6 for $3 or something. Between us we split 12 wings (hot and wet cajun) and a jalapeno burger. Everything was amazing including the coleslaw. The only thing that slightly lacking was the thinly sliced celery. Make sure you order your blue cheese/ranch and celery separate bc it won't automatically come with your wings! Overall awesome experience. The service was fast and the woman behind the bar/serving us was friendly. The place was empty. I think there were 3 or 4 other customers who were also sitting at the bar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gAOaZAldm_DyNnJUXLTHIQ"
  },
  "DuVwMQ70Q7caAadlbFgftg": {
    "date": "9/3/2016",
    "text": "Heard the food was good so recommended to the office for take out for lunch.  It's now the go-to place every Friday for take out.   Recently been there twice for dinner and it was great.  Great food, top service and a small, clean fun atmosphere. I had the Cajun wings- as good as wings suds and spuds without the 40 minute drive.  Wife had a fajita wrap and it was very good.  Kids just had chicken fingers so nothing different there.  Last time I had the sausage and that was great.  For lunch I usually get the chicken parm sug-  again vary good.  Chips good.   And the best part, the prices!!! Love the place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-0-R267zNIQDPI9rxJlprQ"
  },
  "Lm6ARZjaqULra0tDgVe4YA": {
    "date": "3/22/2018",
    "text": "In my opinion this is the best wing place in Pittsburgh. Great variety of wing flavors. The place doesnt look like much from the outside but its a neighborhood bar and the inside is updated, comfortable and clean. I also recommend the homemade egg rolls.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lqy21XyyxcDoISvaJHuzZg"
  },
  "OPhmZusw_j-ec6Rmsji-Tg": {
    "date": "3/25/2016",
    "text": "I've only ever had take out from here. I first tried their wings at the wing festival last August. Their mild was good, but the butter mesquite was amazing, and it even won best exotic flavor.   The wings are crispy and delicious and that seasoning is so good.  Since then I've gotten take out a few times, always wings. I think we ordered some kind of appetizer before, but I don't remember what it was. They are really fast making their wings, even on Saturday evenings. It usually only takes around 15-20 minutes, and they include celery and ranch or blue cheese for no extra charge. It even took only 20-25 minutes when we ordered 96 wings, and they came out nice and hot, with a whole container of celery.  Nox's doesn't have as many flavors as some places, but the flavors they have are really good. My favorites are the Butter Mesquite and their honey cajun. The butter mesquite is seriously like nothing I've had anywhere else, so it's worth going for that.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "6djyuTKCGCJHMk79AeiFYg"
  },
  "SIX1E8JczXEhfWWA8YjyCw": {
    "date": "3/18/2017",
    "text": "Loved the St Patty's day menu, good beer and the bartenders were good at what they did.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6P6gmrl6L1Son8EwUHypVQ"
  },
  "JT9gLFatNBzdAkAqlfUP0Q": {
    "date": "12/3/2016",
    "text": "Good selection and service. Highly recommend the Nox's grilled chicken. The beer selection is good as well. Parking can be a slight challenge, there is a Main Street nearby but you may have to walk half a block",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WrvcNZ14w3cBR7Tql5x9dw"
  },
  "IYzn3CpFYHUriyGAmWgy0g": {
    "date": "3/3/2016",
    "text": "We came here because of the five star rating and were not disappointed. Fast friendly service from Rachel. The Nox Steamer was EXCELLENT. Chips were great with the tasty Philly Cheese Steak. Can't wait to come back to this hidden treasure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iqEAk2e_Pke_FFX8kolgPA",
        "caption": "Photo of Nox's Tavern and Grille - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iqEAk2e_Pke_FFX8kolgPA/o.jpg"
      }
    ],
    "user_id": "uetxLBl_uIX0xNk3eUkjTg"
  },
  "RHw17Wki70hhbVZuNrIkUQ": {
    "date": "11/27/2017",
    "text": "If you want a great burger, incredible wings, or just all around good food, then go to Nox's Tavern and Grille.  We frequent this bar/restaurant often, and I can't believe I have not written a review for them until now.  No matter what you order, the food is always tasty, it's plentiful, and you won't go away hungry.  If you love wings, you have to try out their award winning wings.  In the past three years, they have taken two, 1st place wins in the King of Wings contest in the exotic category, and this past year they took 1st place for the BBQ category for Steph's secret sauce. Their burgers are steamed, yes, steamed.  They are very flavorful, juicy, and you have a variety to choose from.  If you like appetizers, try their homemade egg rolls....and not the kind you get at a Chinese restaurant.  Theirs are filled with buffalo chicken, and the other is a ruben, which are a staple on their menu, but they always have an egg roll feature for the month, and you won't be sorry.  There are daily dining and drink specials as well, and drink specials during sporting events.  Try them out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bnfiNF0jpL1glJGd1W0wvg"
  },
  "LFEBxcq1asY8rmmZjE9h6Q": {
    "date": "8/27/2016",
    "text": "Awesome food especially wings !!! Go in wing night Monday's half off !!! And best part is it's no smoking !!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ahEX_LnLCrBb38vSaaGdzQ"
  },
  "0AH2svUchQT1_GH9TvR3dQ": {
    "date": "10/6/2016",
    "text": "Best burgers Iv ever had. Nice establishment and nice people. Quick service and clean place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4_ksMIy5Nglfa9fXNwiZPQ"
  },
  "UNgfmUWj85Tr-gZr9g_xFg": {
    "date": "8/27/2019",
    "text": "KILLER KILLER KILLER....we always forget about his place and then kick ourselves for it. I've never had a less than amazing thing from here. We love the locals and the staff. Extremely affordable. The steam burgers and the wings are  the Staples but everything is awesome. Try the daily special. Put the ranch dressing on EVERYTHING. It's the best I've ever had. They do not deliver but I believe grub hub and Uber eats work with them. Fantastic local place.highly recommended . May be the best fish in the area. Love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8fZAaVX2Q6v4bigD14tnRA",
        "caption": "Photo of Nox's Tavern and Grille - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8fZAaVX2Q6v4bigD14tnRA/o.jpg"
      },
      {
        "img_id": "S7V41sChqH9Je2dZFp-4ww",
        "caption": "Photo of Nox's Tavern and Grille - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/S7V41sChqH9Je2dZFp-4ww/o.jpg"
      },
      {
        "img_id": "hB76E6gXyPMcwZUn8Z4QiQ",
        "caption": "Photo of Nox's Tavern and Grille - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hB76E6gXyPMcwZUn8Z4QiQ/o.jpg"
      }
    ],
    "user_id": "HpOw5taicM9lQyoE3d1B-g"
  },
  "XJQAmyHC1uIezetxQkathQ": {
    "date": "8/28/2019",
    "text": "Went for Trivia night. So much fun. Service excellent & had a Reuben that was delicious. Beer selection excellent. A hidden gem and we will make this our hometown bar!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iVe05k3OPJ9ZgfiP5dzwSw"
  },
  "ufxdnmz-VA7AKshPGjdH9w": {
    "date": "8/7/2018",
    "text": "Both times that I have visited I have ordered the buffalo chicken sliders which were great both times! Waitressing could be a little faster but that's okay  4.5 rounded up to a  5",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Pxc6nKC2efw6UrMyPcrHsw",
        "caption": "Photo of Nox's Tavern and Grille - Pittsburgh, PA, United States. Buffalo Chicken Slider",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Pxc6nKC2efw6UrMyPcrHsw/o.jpg"
      }
    ],
    "user_id": "9lDqS5-_vZYbZEzNYtvemw"
  },
  "tT_JXvN4UkR6HIYcFcS3HQ": {
    "date": "5/11/2019",
    "text": "We were in Blawnox and didn't know where to eat I checked yelp and saw a good rating on this bar and grill  it's great place had a steak sub couldn't be any better great choices of beer on tap also excellent service and friendly crowd highly recommend it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnR4i0dAJRWkemzVu3jdEQ"
  },
  "ZdnnEKBzhMZIALP0ltdUww": {
    "date": "7/26/2019",
    "text": "Wow! This place was such a good find. I saw all of the good reviews on Yelp and wanted to check it out for myself. I had the buffalo chicken wrap and it was amazing! The cocktail special was a gin and cucumber drink. It was also delicious and so refreshing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NVSaNRczbL4MBj043DC7-g"
  },
  "2j7FmQCcAPd-mVxOSZZfTQ": {
    "date": "8/23/2019",
    "text": "My husband and I just went to Nox's for the first time and LOVED it. The burger was the best I've ever had and my husband loved his wings. Their mixed drinks are also really good and the waitress tailored it to meet our preferences. We will definitely be coming here all the time..such a hidden gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jjle5ZewVHEjsWKxsAKDJg"
  },
  "gkumLrfuYoZBMdaLbEkB_Q": {
    "date": "6/29/2019",
    "text": "Wouldn't know this place is even open from the outside but once you open the door you're greeted with a comfy little local bar and grill. Good food, good drinks, good prices and a friendly staff. The venue is very clean and smoke free. Definitely give it a shot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dg-xiuh4O1HSodTCdnmyNA"
  },
  "pMs-4xyYLAqW5jWMeJ-TUg": {
    "date": "1/6/2019",
    "text": "Super wings, garlic Parmesan was tasty . Steak fries were crispy and perfectly salted. Tortellini Salad very good as well. Great service and some higher end beers for 2 bucks . Will definitely stop again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tpLWXsk3Uyx_qyxcN_tEA"
  },
  "Gp918PQeqmAQFILUNk8S_A": {
    "date": "1/15/2019",
    "text": "steamed burger;) why not I thought! I'm a bit of a burger whore so when I give a 4 out of 5 that's a solid burger! The only way it would be better would be if they had an upgraded beef option, slightly bland most likely from a bulk beef package. Service is good, cleanliness is good, parking sucks:(, beer selection is solid for. 8 tap kind of place \" I'm tired of the 100 options some places have anymore keep it fresh!\"  All and all I think in a 20 mile radius it's the best burger you'll get. And that includes the Pittsburgh favorite Burgertory! In this radius.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "POoW7qoeXPi_h2dTDZvapw"
  },
  "qdresG3tI8aqgVnXjmuG1Q": {
    "date": "1/19/2018",
    "text": "The most underrated burger in Pittsburgh. Nox's serves 1/2 pound steamed burgers, rather than grilled and wow is it a difference. They are the most moist and flavorful burgers I've ever had. They have seasonal specials every now and then, and around fall they have thanksgiving egg rolls. They are fantastic! I was apprehensive at first, but now I'm so sad they're not a year round menu staple. The staff is so nice and friendly, I feel so at home there. There are sufficient tables inside, but it does get full on weekends. Great daily specials as well! Can't recommend this place enough.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qjWrH1UEbVFoVn_fu2jeiQ",
        "caption": "Photo of Nox's Tavern and Grille - Pittsburgh, PA, United States. Mushroom swiss burger! So good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qjWrH1UEbVFoVn_fu2jeiQ/o.jpg"
      }
    ],
    "user_id": "pZuK6cMZoQlvjNojbOBJIw"
  },
  "MM2E6EKP4U7plg6TSTUEdQ": {
    "date": "8/9/2018",
    "text": "Nox's was the reason I got on yelp. After visiting here, I needed to let everyone else know how good this place is. Hands down the best burger I ever had. It was their monthly special so it hasn't been on the menu since. The outside of the bar doesn't look like much, but when you walk inside, it's a whole different vibe. I love how to the bar lights up and all their chalkboard walls. Their monthly specials are always amazing. I like how extensive their menu is as well. Choosing what I want to eat is the hardest decision, but I have never been disappointed with what I got. This is the only place in the city that I'm craving 100% of the time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I4BVS9Kkw52Xj6k3nTEuPw"
  },
  "WCSoQKF-U3fHiyvb1UGhRg": {
    "date": "12/6/2018",
    "text": "I have been here a couple of times and everytime it has been good. I had wings and they were good burgers are great. The prices are good too. I think its a hidden gem its small but it really nice in side and food is great prices are too",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "oGvs4aDSHrd76hPo073F1g"
  },
  "5nm-H8hWx7RfZX2RQxJugw": {
    "date": "1/13/2019",
    "text": "The food is excellent, the service is great.  There are so many good menu choices at Nox's that it is hard to decide!  The wings are great, as are the burgers, etc.   Very nice comfortable place. The staff is very friendly and welcoming.  Great prices, great food, great people!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kTdck-W5vrSxOTrGlV2vpg"
  },
  "-aG2WGXA3dX_i1FvV3KrOA": {
    "date": "8/24/2017",
    "text": "I've been here a few times and it is always very good!  I had wings the last time and they were good, but I had to go back for a steamed burger again this trip and it was great!  If you are looking for a really good burger that's just a little different, check this place out, you won't be disappointed.  This last trip they were a little busy and the service was iff just a little, but I stayed with 5 stars because our waitress was really hustling through a busy crowded time on a weekend evening.    We also sat outside this time.  They have a nice little courtyard with a big screen TV so you can see local sports while you eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rD84vTnTl7c8wUrdpReE0A",
        "caption": "Photo of Nox's Tavern and Grille - Pittsburgh, PA, United States. Lumberjack!!! freakin awesome.   I subbed Nox Sauce instead of Spicey BBQ.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rD84vTnTl7c8wUrdpReE0A/o.jpg"
      },
      {
        "img_id": "JsykJn2DNUty20asgxDdTA",
        "caption": "Photo of Nox's Tavern and Grille - Pittsburgh, PA, United States. Great place for a Pens Stanley Cup game.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JsykJn2DNUty20asgxDdTA/o.jpg"
      }
    ],
    "user_id": "GnZoOPrN-mgf3qHmax30yA"
  },
  "jAogzDvY2YtAP7eJM__5Ww": {
    "date": "8/9/2017",
    "text": "I ate here with some coworkers and had the Steak Fajita and fries.  I thought it was good although maybe a little too much on the cheese (I think that's what it was) but that's a personal preference. Service was fast and polite. It seemed small so I can imagine it getting a little crowded. Nox is interesting in that it looks like a house and could easily be passed by.  Everyone I was with loved the fries. Wings are also highly recommended.  They have house made chips, but everyone in my group opted for fries.  It's an interesting place to try out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "agGWDhkVvIHaf8w16jLTng"
  },
  "r6vJptCRk1k2l8n_0WJN3Q": {
    "date": "4/5/2018",
    "text": "Went to try the steamed burgers, ordered a Dubliner. Which was a half pound steamed burger with corned beef, sauerkraut,  Swiss cheese and thousand island dressing. This was the best burger I've ever had ,Ever!! Service was exceptional and very prompt. We also ordered the 'OMG' onion rings and the half moon breaded mozzarella cheese bites, all were fantastic. The only bad thing is the place is kinda small but this will be no problem if you go during the week or Sunday night,  like we did. Definitely will return",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i6K7TizVP2Azjaw40qoF5g",
        "caption": "Photo of Nox's Tavern and Grille - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i6K7TizVP2Azjaw40qoF5g/o.jpg"
      }
    ],
    "user_id": "Qu-rarnR8pRpRHsTy-tzlg"
  },
  "bkZuADc4e7GP4kJNcVC7HA": {
    "date": "1/26/2019",
    "text": "A hidden gem one of the best burgers around. Love the nox sauce. Very good reuben and Rachel. Food is slow is the only negative and the only reason i am not giving it 5 stars.I eat here regularly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WPxT5O25WxgUAVh6knkZ5w"
  },
  "gfhP018NafRsWJR7hmZSBA": {
    "date": "8/21/2015",
    "text": "This Blawnox neighborhood bar and grill is what I wish our neighborhood bar and grill in Aspinwall was like.   This place doesn't look like much from the outside...it's located in what appears to be an old house. Inside it's a bit divey (dark and small), but it's very clean. They have a full bar and decent beer selection. They don't have a ton of beers on draft, but there's at least one of something for everyone, from cheap domestics to microbrews. It definitely draws more of a \"local\" crowd, which is not exactly my scene, but it nonetheless feels welcoming to everyone.  The food was what impressed me the most. They do bar food and they do it right! They have a variety of sandwiches (I've tried their chicken parm -- delish!), burgers (never had those, but apparently they are \"steamed\", which is a special tasty cooking method), and yummy appetizers. For example, their provolone sticks weren't just generic cheese sticks....they have a unique garlic butter flavor and were served with fresh shavings of parmesan cheese over the top! Another favorite app of mine is their buffalo chicken sliders. What sets their food apart, I think, is that they go above and beyond the usual bar fare protocol....you know... \"take this from a bag of frozen, put it in the fryer, and serve.\" Rather, they make a lot of their own food and it shows. Their food is exactly what I want in a neighborhood bar....indulgent, delicious, simple, and high quality.  The service was tremendous as well. Both times I was there, there was only one woman (one of the owners, I think) tending to the bar and all tables, and she was not only super friendly, but managed to juggle everything and provide excellent service.   This will definitely be a regular spot when I'm craving drinks and bar food. Well done, Nox!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vhfp4BPB-uMFURNCoGx9VA",
        "caption": "Photo of Nox's Tavern and Grille - Pittsburgh, PA, United States. Mac and cheese side (subbed for chips with my sandwich). Super creamy, sharp, and decadent. One of the better mac n cheeses in the &amp;#39;Burgh!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vhfp4BPB-uMFURNCoGx9VA/o.jpg"
      },
      {
        "img_id": "ZUXpVE7ebVhy867CNerPuA",
        "caption": "Photo of Nox's Tavern and Grille - Pittsburgh, PA, United States. Wednesdays are build your own steamed burger nights. This one is with bacon, jalapeños, onion ring, and wing sauce.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZUXpVE7ebVhy867CNerPuA/o.jpg"
      },
      {
        "img_id": "hPQTaH7nDiqE-Zg8HpgZBA",
        "caption": "Photo of Nox's Tavern and Grille - Pittsburgh, PA, United States. Award winning wings. Crispy, meaty, and generously sauced (these ones were sriracha honey...yum!!)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hPQTaH7nDiqE-Zg8HpgZBA/o.jpg"
      }
    ],
    "user_id": "0EhPIlDozxGKpbbHRr6vZg"
  },
  "jRb58K5zecc3JQQgJu5f_w": {
    "date": "4/30/2018",
    "text": "The food here is awesome.  If you are in the mood for a fish sandwich with something other than beer batter, this is the place for you.  The fish sandwich is large enough that I rarely can finish it.  The service is very attentive even when it's packed.  I've tried a couple different menu choices and they are all good. I keep going back for the fish sandwich.  During lent, I dont know how the kitchen keeps up with the orders but there was a steady stream of of customers leaving with boxes of fish sandwiches.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zC3Vot_HRlPfPhX7wUz6MA"
  },
  "2xlTYA64hGZCRw-xRKPBzw": {
    "date": "6/27/2018",
    "text": "Just discovered this treasure. Great food and drinks and good prices. Specials daily. Friendly staff. Going back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k-X5qr6Ev9WY9qloopCuOA"
  }
}