{
  "SOPSlmP3NK9gL4MDsd1rRA": {
    "date": "8/31/2015",
    "text": "If you're a fan of big huge hoagie sandwich subs, then this is the place to go! Personally, I love going to this place because of the fresh ingredients that they use to make their sandwiches daily. You also have a pretty generous palette of options to select from, including the classic Italian hoagie to the lovely cheesesteak. They also sell some items as sides/appetizers if you're into that kind of thing. However, in general, this is the place to go for huge subs. Fresh ingredients ... oh and did I mention the great prices, considering that the subs you're getting are more than generous in portion sizes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MLf4JUa1uzQkDLrBJ5yJHA"
  },
  "JUilapng4hFFs94Ye-t7LQ": {
    "date": "10/24/2015",
    "text": "Perfect sub in a real PGH neighborhood... TV's and pounders to make for a great weekend lunch spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uNvf8xIR1P0Jpe5kDJleag"
  },
  "XjUwv0ZiUQCOOvqHJuqjvQ": {
    "date": "9/17/2014",
    "text": "Great place for lunch. Excellent subs on amazing bread. Fresh, fast and healthy!   Better than any chain sub shop.   Had the 6 inch torpedo. The battleship is huge!!!!!!!   They have an ATM inside and only take cash.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "R2WPxxtYsVeODrJexPVpww"
  },
  "nIDKfIgdQE__Gyz6a-Fspw": {
    "date": "1/22/2015",
    "text": "Ordered a super battleship and wasn't disappointed!  Fresh meat, lots of it, fresh bread and great dressing!  For the price it can't be beat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MWYGZ_lv7HZI2Wuzbd7rJQ"
  },
  "I4vqePNU7pYilobjKbriNQ": {
    "date": "5/29/2016",
    "text": "awsome food just got a battleship an over hr ago piles of meat mmmm havent been here in a long time good job guys you get better all the time",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N3U08ouLfYnOlMZE3UiSJQ"
  },
  "wK1fnZdSCASCUbaRgz0PQg": {
    "date": "8/21/2014",
    "text": "I have not been to the Triangle for more than 20 years, but have told my husband about it many times (the place I used to go in college with friends late at night that had amazing hoagies named after ships - destroyers, battleship, etc.).  He had never been there and never heard of the Triangle.  Today was my lucky day!  We went to Kennywood and I realized the Triangle was just over the bridge.  My husband, a big Danny's fan, was game to try it.  The neighborhood is a bit sketchy, but parking was easy and the Triangle was exactly as I remembered it, especially the orange and green tiled floor!  We ordered a battleship and a cheesesteak destroyer.  Everyone (kids, grandpa) loved them.  They were even better than I remember - fantastic fresh bread stuffed with meat and cheese, lettuce and tomato, just the right amount of oil and vinegar, salt and pepper.  Like other people say, you'd think that such a sandwich would be easy to find, but for some reason good simple  things (basic awesome bread) are hard to come by.  The cheesesteak was fantastic as well.  We felt that the cheesesteak was better than Danny's.  We have NOTHING like this in the west.  Definitely a great place, a fantastic  price, oh, and Turner's iced tea too!  I just hope I don't have to wait another 20 years for my next one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "C-FakOw-KuchLg9Y6n7Udw"
  },
  "MllDg56QG7s8eUu48K7eQw": {
    "date": "5/1/2015",
    "text": "Stopped in and had a battle ship,fresh bread and good eats.it's definitely worth a return visit.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OpRDrqByZR8gS1ZGgG004A"
  },
  "W_lGet3ymC6juDyfbjwY3g": {
    "date": "5/3/2016",
    "text": "All I can say for this place is that if you were starving in the desert and stumbled upon it you'd actually might rather starve to death.  The dressing was good. But if im looking for a hoagie I'd rather go to GetGo. First and last visit.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tDAU2g9I5irGRVH-a-vtog"
  },
  "aQyGjbOA9R_X4e6zXhallQ": {
    "date": "3/8/2015",
    "text": "The only place you need to go for football games. They have the best hoagies! Make sure you call ahead if it's game day because they will get slammed. We always get the go-go and the super smasharooney or whatever, roast beef and turkey. Fresh bread, fresh everything.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dDriEMQCyu1qZil3wAxa2Q"
  },
  "pkMZsymxdLMMW9K-jmgIfw": {
    "date": "5/22/2016",
    "text": "Great sandwich! As big as a canoe! Really enjoyed it. I will be back. I must lay down now. The meat sweats have arrived.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V-FY5zG20RRJxMV2p_QKGQ"
  },
  "j4e9p1m1dhcZ2MyFmEV5Nw": {
    "date": "8/14/2016",
    "text": "I love the triangle, get there a little early, I've came later, like 4pm and there was no bread l eft... Great sandwich.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mLVEhqhQM9N5i0C1SFnt-Q"
  },
  "Zt_tNjg0bqsHyLLcC2eEdQ": {
    "date": "3/20/2015",
    "text": "Best damn hoagie in Pittsburgh, order 5 super destroyers every steeler game, get the destroyer and you won't be disappointed!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Jw2E9lNUa87tCt3mytrFQ"
  },
  "btdH-mihZ3ElhOd4vFO5JQ": {
    "date": "3/6/2015",
    "text": "Gonna get some cold cuts today!  I must say that they know how to make a quality sub or \"BattleShip.\"  You come in to this place and you know its quality by the line stretching to the door. I saw one guy walking out with at least five. I've ordered these for parties and events but will always stop (even if I'm not hungry) when I'm in the Swissvale area.  There is just something about these subs I can't explain.  They do everything right here.  From the breads to the meats, to the shredded lettuce these battleships are legit!  They serve 40's too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C_yxM4XqJ3AVDGlBp_6D3Q"
  },
  "wWYDbtkWruslBRiqxPyUOg": {
    "date": "9/27/2011",
    "text": "Think fresh bread, fresh vegetables, daily sliced meats of the highest caliber served in white butcher paper by very slow service.  Ahhhh, the joys of ordering a torpedo (around six inches of bread) or a Battleship (fasten the hatches!) from the Triangle.  They make the best cold hoagies -- turkey, italian, and ham are among my favorites!  They also have a bar and TV's for that minimalist game viewing adventure with regulars from nearby homestead and braddock propping up the stools.  It's a great take out place -- call ahead though.  A Pittsburgh classic you must try once for a Steeler or Penguin game party.  Terrific!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "X7mVSZxStPxD4GbN_29pYQ"
  },
  "6YfgiCAMqZxd_kj6YJ_7mw": {
    "date": "12/2/2013",
    "text": "Best Freakin sub in da burgh, I live in Cleveland but originally from McKeesport. Every time I come home I will have da Super Battleship hands down best sub I've had thus far!! Steelers for life, down with the browns!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TiBjpqrunfGUMShGnVYLHQ"
  },
  "wl4nD1mZxO0F_mGpaAniFw": {
    "date": "7/25/2014",
    "text": "Growing up in Swissvale, we got a battleship for every football game, birthday party, and so on.. now in my late 20's my mom and I still have a ritual of going out to shop and then to each grab a battleship for dinner at our separate homes at least once a month. In over 20 years I can not think of a single bad experience with the place, other than the long wait which I will forgive because it's totally worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GAeutek-rDK-Rr7GTS7_Bg"
  },
  "1ERhWjpEVqrmSkM9vSTAMA": {
    "date": "3/19/2014",
    "text": "I think triangle hoagies are great for parties and tailgates.  I normally order one or two battleships and all the fixings.  They are huge, they are reasonably prices, they are prepared quickly, and they are delicious!  I definitely will be back for more soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tq5RrgsNOaA9YgLfA7Ye5g"
  },
  "5D8y06wexwg5MWrEjTM_sA": {
    "date": "8/11/2014",
    "text": "My friends and family rave about this place, but I am not a big fan at all. Every time I've gotten a sub, the bread is dry and crumbly (I like my bread to be fresh), and their toppings are limited. I do support small business tho, so if I'm hungry and in the swissvale/Rankin/Braddock area, I'll pick up one to share. But otherwise, I'd rather opt for a sandwich in regent square or on the waterfront.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dFWFpHSGqMxPBFgHvjF_lg"
  },
  "FVVECBb0CVZy-W8kBXCIOg": {
    "date": "9/2/2016",
    "text": "For years people have been coming to my restaurant telling me how good the subs are here.  Never having any reason to go to Swissvale though, it took me this long to make it.  Overall the sub was very good.  I'd say I've had similarly good subs at a few other places, but the price was right ($16, but could feed 2 big guys or 3 normal people), and they have smaller options as well.  I would have given the place 5 stars, but the place is run poorly.  There were about 10 people in front of me, and I had to wait in line about 30 minutes.  It should not take 30 minutes to make food for 10 people, although they were getting call in orders as well.  I can blow through a line of 20 people in 10 minutes with myself and my employee.  Whoever designed that place was a nut job.  The 3 employees were working hard, and fast, but they have to go over to the cold bar, then over to the grill, then over to the fridge, etc.  Then at the end when they take the money, the register should be right there, but it's against the back wall.  So again, they have to walk over to the register, then walk back to give you your change.  If i ever had a chance to go back, I'd call ahead so I could skip the line.  Definitely worth the trip if you're around Swissvale though.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Gn52HDDe_aYUN2lYHLQWQ"
  },
  "QDlrObfZuNGWYpoHqUQIhA": {
    "date": "1/9/2016",
    "text": "Worth the hour drive and crazy Pittsburgh traffic to get these best tasting Classic Italian Super Battleship Hoagie loaded with double meat. DAMN GOOD HOAGIE!!! Thanks. John in Sarver",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ItBbwKXjxC1VSBlhvCoR4w"
  },
  "XTEbupuvVfArOF4EvcD_NQ": {
    "date": "11/2/2015",
    "text": "Just in from California and had to bring my family here everytime I come to Pittsburgh. The super battleship is fantastic and feeds my whole family.6 of us .6 big pieces.love this sandwich.its all good.Just get over there and try it.You wont be disapointed.See you in 4 months when im back in town guys.Keep up the good work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fLeFcVWD-bsS6FzClZvb5w",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fLeFcVWD-bsS6FzClZvb5w/o.jpg"
      },
      {
        "img_id": "-u98SwjqE6A3NsoGdgObAA",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-u98SwjqE6A3NsoGdgObAA/o.jpg"
      },
      {
        "img_id": "jKUuficV8FNtnNxgMRpFtw",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. Great family feast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jKUuficV8FNtnNxgMRpFtw/o.jpg"
      }
    ],
    "user_id": "UJlhiYOpJMRp_8Lfqf-prQ"
  },
  "a5zP2vcuUhhLTiGtr1w5lA": {
    "date": "12/13/2016",
    "text": "Every time I come here I order the 'destroyer' Italian sandwich for take out. It is more than enough for two people, and a quick, inexpensive meal. The sand which itself is packed with meat and cheese and really very good. When I get home I usually like to pop it in the oven for a few minutes to heat it up (its served cold). This place is definitely worth checking out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yrRcno5vFGQhsbQu5rWk2Q"
  },
  "BOfHN7y7o9w362rKZnvaAQ": {
    "date": "9/14/2016",
    "text": "I absolutely love this place. Before I moved back to PA, I'd always have my family bring me one to where I was staying. The Italian beast would feed 3 of us. I don't really know what it was called, but I call it a beast because it is huge. You will be licking your fingers. Getchu one.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "jen0KskW0qmZ1jvjbZiVyQ"
  },
  "aMuuI5vS1NhtZZVu773iGg": {
    "date": "8/6/2015",
    "text": "Want a huge hoagie? Triangle bar is the place to go.  I decided to take a drive and try a place that I know has a legacy of being a Pittsburgh hoagie place to try.    Beer:  I know that they have a bar, but taking my meal as takeout, I did not drink.  Food:  I got the Super Battleship which was 2+ feet of happiness.  The take out bag had to weigh five pounds of meat cheese and toppings.  The bread of the hoagie was fresh and had many different meats (even though I do not know exactly what they were) was perfect on the sandwich.  Overall, the hoagie hit the spot but being the first time going here, I ordered it with everything, not knowing what everything was.  The one item I would pass on would be getting it with Mayo.  It was overwhelming.    Pros:  They have plenty of different types of hoagies to get and would be perfect for big parties.  Cons:  Not the cleanest place in the world and the building shows its age and personality, so it stays True to its roots.  The line to order was long, but that highlights the demand for the hoagie.        Conclusion:  Will revisit in the future but going no mayo the second time around.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "U-kDCTAzIn4m-RG2mY3o7w"
  },
  "xPBX511U02lKyjq4Qyq76Q": {
    "date": "9/16/2016",
    "text": "Absolutely CAN NOT GO WRONG with a Triangle Battleship.  All our friends call each other if we are going to be anywhere near Triangle Subs so we can all place orders and enjoy the tasty goodness.  Have NEVER had a bad sub",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "se6B7VJqZMJ2HJ82S-MxQg"
  },
  "zHPNLIngD0hLGI4GwQRoKQ": {
    "date": "7/30/2015",
    "text": "It's nice. But they use the cheapest meats they can find and you can taste it. Also, If you are going to call it and Italian. Use Pepperoni.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tz0ndV9zMZ9N_1evSJWAUQ"
  },
  "cG5wjYLO_eYQyZMF_h_c0g": {
    "date": "2/20/2013",
    "text": "I find it hard to believe that a place like Triangle Bar and Grill only has 8 reviews.  I guess it's just not hipster enough for some people.  Which is fine with me.  I love walking in to this place.  It's never really crowded when I stop by on any given afternoon but they certainly have a steady stream of customers coming in for delicious sandwiches.  The crew behind the counter always greet me with a smile and are happy to make me a sandwich.  I have to admit that despite their many options, I've only tried the Super Battleship, a 2 foot Italian sub.  At only $14, it's quite a deal and great for parties.  It's packed with fresh meats and cheeses, lettuce, onion, tomato and sprinkled with oil and vinegar and oregano.  Some might say it's the perfect sandwich.  It's definitely remained one of my favorites.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "4tPaVW8XiY0dTqd0M_qD5A",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. Making the Super Battleship",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4tPaVW8XiY0dTqd0M_qD5A/o.jpg"
      }
    ],
    "user_id": "WoKCLSctS7G2547xKcED-Q"
  },
  "SiDZ39FUoaNDJe13HYRi-g": {
    "date": "7/27/2016",
    "text": "What can i say about triangle that hasn't already been said. I grew up on these subs if you never had these what are you waiting for.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9TY2iU0mhsVL17VP0S2D4w"
  },
  "aS77vY1bFYP7FeIFkYi9AA": {
    "date": "8/6/2015",
    "text": "Got Five more subs for my 31st class reunion. Gateway.  Almost everyone had some and as always the super battleships were great.  Called ahead and they had them ready when we got there!  Thanks guys!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KT0aRNAr2FpFY6Eoggcf8g"
  },
  "47Faz_FFm6B8KTXLZ7yv0A": {
    "date": "3/26/2016",
    "text": "I had a party for my birthday on 03/22, and I got three of the battleship hoagies, the chicken salad, roast beef, and Italian.  They were a huge hit with everyone at the party and they were absolutely delicious!  I read the reviews of this place here on Yelp and everyone said they had the best sandwiches in Pittsburgh.  They definitely did not disappoint.  A fantastic way to feed a lot of people, and I can't wait to return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "diq97ZN5hG_HVsbopHE92Q"
  },
  "6GopVvn2Eo3l6HEXGVpCJA": {
    "date": "12/4/2016",
    "text": "Omg best cheese steak ever!! Gigantic subs and gigantic taste! Perfect hoagie  bread  ratio of bread to filling was perfection and meat was juicy and veggies fresh. The drippage was perfect and flavor on point!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L53quff2Zd-yRwLTrGacAA"
  },
  "P5nENSfwbOHu-s1vT1O-6A": {
    "date": "9/18/2015",
    "text": "Great corned beef hoagie... The Torpedo was more than enough for lunch. I will definitely visit again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GnZRxixNUetCtIFgTq0EIw"
  },
  "7B41Yb3qAc1vgi3Nk7HHAg": {
    "date": "3/2/2014",
    "text": "Prior to taking in the Amon Amarth concert at Mr. Smalls Theater, I met up with friends for a pre-show apartment party in Millvale. Food was to be provided by Frank's Pizza and Chicken, but when I arrived, the pie had vanished.   \"Wait, Darren,\" a friend I'll call The Wizard said. \"I got a Battleship!\"  \"From Triangle Bar?\" I asked.  \"Yeah. And it was barely touched!\"  A chant began, long-haired hellraisers representing both genders in tattoos and black shirts began to shout my name in unison.   A Triangle Bar Battleship -- a hoagie 26 inches long that is blessed with an Italian vinaigrette so magically pungent, has the capacity for making standard iceberg lettuce, garden tomatoes, and plain white onions dazzle -- was waiting for me.  The deli meat is piled as thick as 2X4's, the fresh-baked bread is akin to a Portuguese roll, and 2 foot plus submarine can feed a brigade of hungry metallions.   Except it wasn't a mere grinder...  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DA1NIC_xKLBo&s=3a530e620dd21ad47458b9668446614b77662adcf7ece23aa6a6787d7ee8e856\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=A1NI...</a>  It was a manifestation of Jormungand, the Midgard Serpent...  <a href=\"/redir?url=http%3A%2F%2Fwww.facetasm.com%2Fbundles%2Fbilderundworte%2Fuploads%2Fcatalog%2Fproduct%2F11001%2Fitem11265.1.jpg&s=5f4b706d97d2159da904dc28c2becf51078a9faa83931e2d8355a9b289327e56\" target=\"_blank\" rel=\"nofollow\">facetasm.com/bundles/bil...</a>  <a href=\"/redir?url=http%3A%2F%2Fi388.photobucket.com%2Falbums%2Foo326%2FOneDumbG0%2FThor%2520Fights%2FThorvsJormungand.jpg&s=725b69fd8db06f210c0d7cd8f6a5a4db575adb9128d22d63d6cc8de3edcecb96\" target=\"_blank\" rel=\"nofollow\">i388.photobucket.com/alb...</a>  Being deemed temporarily worthy of Mjolnir I had channeled the mighty god of thunder...  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fresults%3Fsearch_query%3Dtwilight%2520of%2520the%2520thunder%2520god%2520amon%2520amarth%2520%26sm%3D1&s=46b444ebf8da86703fe41a896d1ab81cb95a4239f5f0c6b4f4e7e0ebb2620987\" target=\"_blank\" rel=\"nofollow\">youtube.com/results?sear...</a>  Would this be...?  <a href=\"/redir?url=http%3A%2F%2Fi131.photobucket.com%2Falbums%2Fp299%2FLeescomics%2FMay%25202012%2Fthor157.jpg&s=0865c18de5d2659c976ffb7423845be2bf72dee1370d13afb421154e2557a5e3\" target=\"_blank\" rel=\"nofollow\">i131.photobucket.com/alb...</a>  The sandwich snake's juicy proteins, lead-heavy grains, and vegetables squished when bitten into, lashing out, thrashing, whipping its enormous tail at me.   Nonetheless, Jormungand would fall, Earth's demise would be averted, and loud, guitar-driven merriment ensued.   After not having had a Battleship in 7 or so years, I found that its quality had not wavered. It is truly a zep for all time, one that offers to its competitors...  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DJJm8fZ6WS5Y&s=1fb946b6ee59eee9d592d8bf03259325ce23dd12d6adfa4694b23f889c5b0702\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=JJm8...</a>",
    "rating": 5,
    "rated": {
      "funny": 10,
      "useful": 11,
      "cool": 11
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "qZFMVqUMZCW3Elzm7q-W7A": {
    "date": "3/31/2014",
    "text": "I have been a customer of the Triangle Bar & Grill for over twenty five years.  They have the BEST subs ever.   BUT on this trip I was buying several to share with people from out of town.  They are cash only and more than happy to show you an ATM that charges you $2.50 per transaction.  The employees don't set the rules but have to live with them.  That $2.50 came out of their tip, they can hit up their boss for the rest.  Its 2014 and they still don't take credit and or debit cards.  Shame on them.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "xaTuUdi4shUpcYxYsrxL5g"
  },
  "cmFTTRKBVnychLWPAV93-Q": {
    "date": "1/4/2015",
    "text": "I have loved this place since I was a kid. It has not changed since then. This is not a \"nice\" place to dine in. It's a hole in the wall bar that makes Pittsburgh's best sandwiches. Huge stuffed hogies. I mean huge. The \"Battleship\" is the cornerstone size and it could satisfy 4-5 men no problem. My favs? Corned beef, steak, and the famous fried baloney but any selection is good. Go here get a hogie and take it to share.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2YVGKKcup6mjQmDQ6arEg"
  },
  "odrLPogVoRYQhWEb7hv0Yg": {
    "date": "12/3/2016",
    "text": "Two battleships to go..cheese steak was awesome..add the mayo to the grilled chicken and its yummy too. You will wait in line, no matter the time I hear, so prob best to call ahead.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "D5_iQw0N9wO7kT7FrT7j6A"
  },
  "Q2WJRHAgtsyTWKvbXfv3MQ": {
    "date": "4/5/2014",
    "text": "I'll make this short and sweet.  I grew up in the Pittsburgh area and now have retired at the central California Coast. I have tried hoagies throughout the United States and the hoagies made at the Triangle Bar in Swissvale are BY FAR the absolute best hoagies in the United States of America!!!!  When I go back and visit Pittsburgh, the Triangle Bar is a MUST stop and I usually buy a couple of extra hoagies so that I can bring them home on the plane to California and enjoy them here!!!  The Best of the Best!!!!!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ifQWbdfPZUDPQISsKn0Otg"
  },
  "R64SFHKOL04d6GUflbRLlg": {
    "date": "11/14/2015",
    "text": "my dad always raved about the battleships, and often we would make the drive just to get them. Very fresh ingredients, and simply delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SAU8ANF44wlXdDCylFYDrA"
  },
  "i6D0ddlBtPT4owa7OmUEyg": {
    "date": "5/8/2016",
    "text": "It's a staple in my family. Nothing like a cold beer and a battleship. I prefer the roast beef. It's amazing. I always get a battleship and a small roast beef for myself. The seasoning and oil with the provolone and fresh soft chewy bread.....amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hicnSca1i6d7YCcHh-3D6g"
  },
  "gTCjJEhDGzp_yAeNzaHxjg": {
    "date": "3/13/2016",
    "text": "I love their sub sandwiches during the Football season that's my favorite spot. The Decour is kind of old but don't let that scare you, food is fantastic and the service is A+.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m0CrPdfQhR4PjolWSppXdQ"
  },
  "ELPnMt1Z-_ib0hUC8lopBA": {
    "date": "12/3/2017",
    "text": "Finally got around to visiting this place after being a transplant to Pittsburgh from Philadelphia-South Jersey. Starting off I decided to give the battleship cheesesteak a shot to see if I could sink it! First off Triangle uses a pretty much identical sub roll from Philadelphia-South Jersey it's cut down the center then split open, stuffed with the goodies and not baked. The sub roll it self has a bit of chewy-toughness to it this is how it should be hence the Philadelphia-South Jersey in me. The meat was good a bit on the drier side just not greasy but don't get me wrong it tasted great. Regular american cheese it is no Philly wiz here stick with your tried and True keep the american on it a winner every time! Keeping it still simple let's just do lettuce. So next time around I'm going with the extra cheese to add some extra bite into the taste buds and then top it off with some other goodies which should make it even harder to sink the ship lol. All around it's a solid place to grab a sub it's been around for years and there is a good reason. $20 cash gets you a 2 foot long sub and great customer service to boot. 4 out of 5 all day long on the cheesesteak review next time an Italian sub is on the agenda I got a feeling were going 5 stars!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1RY4HwJ5c42ieHkGTcpHTA"
  },
  "OoxVtHHEi1rYM5F0cLN5iQ": {
    "date": "2/11/2018",
    "text": "Haven't had it in awhile but their hoagies are sooo good! The inside of the restaurant/bar is pretty cool too, never had an issue when I went there",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "trMMt1C3bhdzFXAD-ZKwyw"
  },
  "GjHFy0z94vwvF8hcSJ2wGw": {
    "date": "6/30/2018",
    "text": "the absolutely best steak hoagie in the state of pennsylvania.......   i promise you'll want another... and to top it off the price is even better u get real steak fresh veggies and most importantly soft fresh bread!?!?! #battleship",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DNwz6pVjCxaw44BvXh5NzQ"
  },
  "7SEhoeC6Y9e-bUaW12ThJg": {
    "date": "12/16/2016",
    "text": "Pulling up to the building is very unimpressive to say the least and same goes for the inside but I have to say that the classic Italian sub we got was good. Tons of meat but not a big variety and could use more cheese. But the flavor is good and it was HUGE! Real nice guys working there",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Xf_O9kJ5fjN8nZ9U5xh0vw",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. &amp;#34;Super battleship&amp;#34; classic Italian Hoagie. 2 1/2 ft of Hoagie for $20",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Xf_O9kJ5fjN8nZ9U5xh0vw/o.jpg"
      },
      {
        "img_id": "iyo4R9-KD10bsqJWRUSuNA",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. Italian Hoagie",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iyo4R9-KD10bsqJWRUSuNA/o.jpg"
      },
      {
        "img_id": "QGGzOlauppkRA5l9UYa79A",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. &amp;#34;Super Battleship&amp;#34; Classic Italian Hoagie. These hoagies are 2 1/2 ft long",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QGGzOlauppkRA5l9UYa79A/o.jpg"
      }
    ],
    "user_id": "o75sJFl1mETSrAVilAFIgg"
  },
  "ZUSsKLCWaZcMPFGuWi3JCA": {
    "date": "8/26/2016",
    "text": "Wow!  You wouldn't think much of this place if you were judging a book by its cover....or even from the appearance on the inside, but OH MY GOODNESS!!!! They have a great menu.... Simple,  but wonderful. We got the Super Battleship Italian hoagie last week and decided to make the drive to get a Battleship Meatball hoagie this afternoon.   Despite battling Pittsburgh traffic to get there, we were both very pleased!  Cheap prices for what you get. Where else can you get a 3 ft hoagie with FRESH ingredients for $20?!  The staff is friendly and quick!  We will return time & time again!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_O5ajREINPG9zeyhW5Dmqg"
  },
  "Bi7BPwwTvdPlXLAOzdHu1Q": {
    "date": "10/4/2016",
    "text": "Yummy! So I love a good Italian hoagie and this place delivers. I arrived around 11:45 and had to wait about 20 minutes before I got to the front of the line to order. Totally worth it though. All of the fixings available and the women who work there are very friendly and efficient.  They also have a small bar, which could either be cool for a chill night or really creepy depending on who is there with you. But whatever! Hoagies!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8sSu2zx6fK5nCSUrOiYUSQ"
  },
  "YXUA-4gcUDh5gzOBHGAQpA": {
    "date": "11/1/2017",
    "text": "Been coming here for over 50 years. Hands down the best hoagie in the Pittsburgh area!  Moved to Ohio recently and will make the drive on a regular basis for my fix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MXnSGQWGVOVaJMS-Tsl7Cg"
  },
  "77AmRL6Z8FiGnpx8VElWrw": {
    "date": "6/22/2017",
    "text": "A place in the Burgh where you can order a two foot sub... what?! I NEVER heard about this place, but Brendan and I were hungry and in the area, so I checked yelp, saw this place and off we went. At first, I thought this place was closed. It's at the end of a street and just kind of looked closed from the outside. Inside, there's minimal table seating, a bar with seating and a counter to order your food. We had to go for the battleship, even though it was just the two of us. We asked for the toppings on the side, so that we could take it home and heat it up there (we prefer toasted subs over cold). The battleship is huge and the flavors are just as big. They packed meat and cheese onto this thing- it's honestly a steal. $16 for basically 4 Italian hoagies. We had this thing for dinner for 2 nights. It heated up well at home- the bread was fresh and the meat was juicy. The house italian dressing was delicious and of course we enjoyed it with the classic toppings of thinly sliced onions, tomatoes and shredded lettuce. I can't wait to come back here for some battleships the next time we have a get together at the house- you can't beat the price for the quality you get here. Delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "mAL20D9yUsGVvMOAZW62uA": {
    "date": "10/14/2014",
    "text": "**** BEST SANDWICH *****   My friend's and I go out in San Francisco looking for great sandwiches and nothing compares to this place. There's a guy named Ryan that works here - good looking kid, and makes the best sandwiches. I Highly Recommend   The Italian Battleship and The Roast Beef.   Just the best - good Italian long roll with plenty of everything! Family Favorite since I was a kid - a long long time ago.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "qVCGzJCDnjwut1dnHef2Og"
  },
  "SqSC_1L_fi2IcGBG1oMn0w": {
    "date": "11/10/2014",
    "text": "One of the best Italian subs you can get!    After many years of having the TB&G on my list of must go to places, was able to stop by and get some take out.  Fun to watch the staff of about 4 making the sandwiches. Just get in line and order when it is your turn.  The 26 inch Italian was so tasty with lots of meat and the sweetness of the Italian dressing.   The place was jumping with people in line and all the tables and bar full of people eating one of the great sandwiches.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "HF2cgdM9--5hdxlkfwHVRg": {
    "date": "6/11/2016",
    "text": "I've been coming to get hoagies here for the past 5 years. They are amazing. Sometimes they get a lil heavy handed with the oil and vinegar, but a quick \"hey go light on that\" has always worked. You can't go wrong with a battleship or if you are really feeling it, a Super Battleship. I always order the the Battleship for myself and it ends up being 2 meals.  This is not a place really where you order and sit down to get your grub on. You're best ordering it to go. Don't forget to get a Turner's Tea while you're there too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zVDZlOJJSLSsGmTYR7PW7A"
  },
  "bNIqCPFnpuizuQgEJpFSEw": {
    "date": "3/26/2016",
    "text": "Triangle serves up the best hoags in Pgh, hands down, one of a kind and delicious! Their Battleships are such an easy thing to take to a tailgate or game day party, always a crowd pleaser! Besides the battleship they also have a delicious fried fish sandwich that I would definitely recommend for lent. They also carry Turner's Tea, and you really can't eat a Triangle hoagie without having Turner's to wash it down with.   I would also recommend calling in your order ahead of time because it can get really busy in there. Plus during lent they might run out of fish, and you don't want to be without that delicious crispy fish. If you do call in, you can skip the line and go to the right side of the store to pick up your order. No matter what, it's worth the wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJQTqW0Uf4V9MNX1ogtw6g"
  },
  "2szw4J6l8j_5jIVa0p37xA": {
    "date": "7/29/2017",
    "text": "Best place to get hoagies. Haven't been here in a while. Hasn't changed. My favorite is cheese steak. Hoagies come in torpedo, destroyer, and battleship sizes. Great if ordering for parties. Reasonable prices. They make hoagies fresh. They do get busy during sporting events and holidays.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AYarmqNQXDpUdZIL-jSXtw"
  },
  "F1LdhWOZ4VUi_sfEety0fw": {
    "date": "3/28/2016",
    "text": "Exceptional...no other way to say it. These guys make hogies the way they're supposed to be made. Best in the 'burgh, bar none!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rs3pq6wRmaSIADCInQXp9g"
  },
  "Dkf0OSKmtHtkpuwPGIOjOA": {
    "date": "5/10/2017",
    "text": "Was so excited to try this place.  Literally walked in at 9:00 and they told us they're out of bread.   I don't buy it.  #youreasandwichshop",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jf0Uz70I1ywZ4ZYpX8x1Rw"
  },
  "Tee5ObozKFx5qD1N8LfqQg": {
    "date": "3/15/2018",
    "text": "Best Italian hoagies in Pittsburgh!! The bread is extremely fresh and prices are great! Been going here for years.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sIEAiidJTJ9zd26AvFh-pw"
  },
  "yELgWctIOpAXbRVu86Xl8g": {
    "date": "2/21/2018",
    "text": "This place is one of those hidden gems in the city. Giant sandwiches with competitive prices. I had a cheesesteak sandwich, which is one of my favorites. They are cash only, which I respect but be ready as it cost me 2.50 plus 3.00 bank fee to get money out. The place itself is very bare bones blue collar, which is perfect for a neighborhood sandwich shop. They also sell 40s there. I look forward to coming back to try and take down the battleship sandwich.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "okDrUeuutEENZwbpYZUlKA"
  },
  "t-jzv3czBmFPHsdhecD62A": {
    "date": "12/14/2015",
    "text": "This place does hoagies right. They pack plenty of meat in the sandwiches and use plenty of fresh vegetables. I ordered the pastrami destroyer and was amazed by how much I got. I'm not usually a sandwich person but was told that this was a must try in Pittsburgh. It didn't disappoint at all because I inhaled it like it was nothing.  Too bad this place is kinda out of the way or I would be eating here much more often.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "03tU93DGIpbRtUqPXMeiPA"
  },
  "Al-I-COi5nG70LvPiyOM3A": {
    "date": "5/16/2017",
    "text": "I'm a local, so I'm sure some people would say I'm \"biased\". However, this is one of the BEST local sandwich shops you can find anywhere! The bread is fresh delivered (which is why you see all the whiny comments complaining about them being out of bread. Yes. If you come at 9, and they close at 10, they'll probably be out of bread OR if you show up right before any Pittsburgh sporting event, yep, they'll probably be out of bread, unless you pre-order like the other smart customers!)  The steak hoagies are my personal favorite, my boyfriend loves the original/Italian hoagie. I've heard good things about the meatball hoagie, also, just haven't tried it personally. Yes, they are CASH ONLY! It's a small town, local sandwich shop, EXPECT to have cash on hand. And don't take your frustration of having to carry cash out on the guys and gals making your delicious hoagies; it's not their fault you don't plan ahead.  Parking is Not hard, unless you come early on a Sunday. There's a church right behind them and they park up and down the surrounding streets. Again, small town local sandwich shop. It is what it is. The small things that seem to bother the non-knowers are things the people who know and love this place are completely fine with. The food is worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6VNtHln3FdiK6K24yzJnLg"
  },
  "bDYT2oQGqx6smeuOvcfiog": {
    "date": "11/11/2016",
    "text": "All you need do is get ya self and a super battleship and a 6er of whatever you choose.  Nuff said.  This spot will continue to kick out the best hoagies around da burgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Xmw_WcUCShPD0qGO1UD7w"
  },
  "ZTfERpyx2T-7K6OO6tCjRg": {
    "date": "4/30/2016",
    "text": "So many people have told me how amazing the hoagies are here and I can't believe it took me this long to finally give it a try!   Triangle is not a fancy establishment but I totally appreciate that. Their specialty is hoagies and they have a number of sizes and meats. They're famous for the battleship but since we were only feeding two people, I got the torpedo and the hubby got the destroyer size of the cheese steak. The sandwiches were loaded with meat and the oil and vinegar dressing added such a nice flavor. I can definitely see why the hoagies here are famous and literally everyone I know knows about this diamond in the rough.   Next time you're looking to feed a crowd, skip the sandwich ring and get a battleship or even super battleship.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "asw9Nqm1jlUTsKZBHU-gqw",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. Torpedo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/asw9Nqm1jlUTsKZBHU-gqw/o.jpg"
      },
      {
        "img_id": "eWbKJyTUhmKQNGMEY5iWuA",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. Cheese steak",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eWbKJyTUhmKQNGMEY5iWuA/o.jpg"
      },
      {
        "img_id": "flXquHKEEmjL6l0lovSNhA",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. Cheese steak",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/flXquHKEEmjL6l0lovSNhA/o.jpg"
      }
    ],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "4ERW1yRRHAqAXZBYYN0LrQ": {
    "date": "1/31/2017",
    "text": "The Battleship hoagie is a long-time favorite in my family... by far my favorite cold Italian sub in the area!  These subs are great for parties, a game day feast, or eating alone on your couch.  No one said you had to share! :)  Their bread is perfectly soft, meats are well portioned and evenly distributed, and the tomatoes and lettuce are always fresh.  I've never personally been to the brick & mortar location, but my family has always remarked how quick and pleasant the service is.   The Triangle hoagies are a must if you're looking for something quick, easy, delicious, and reasonably priced to tote along to your next family get together.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "fp6wXrr5r3poOg6YhL4yvQ"
  },
  "dVO-inx6LPH_CeuKeiR-3g": {
    "date": "2/3/2017",
    "text": "How insane I've never reviewed this place. This historical land of sandwiches. Of course the Battleship is my favorite. I love that it's an unassuming establishment, neighborhood place oozing yum. Here's a favorite story from probably 15 years ago. I'll preface the story: my parents retired to their home in Conneaut but prior lived in McDonald. My dad and his friend would make the drive from McDonald to Swissvale once a month for Triangle sandwiches. These guys are old school and have known the goodness long before the rest of us. Ok anyway, the story... When my daughter was 5 or so we'd been visiting my parents. While there my dad came home from a monthly Triangle visit. When I was asked to partake of course I didn't refuse. I devoured my portion of that sandwich as though I'd never eaten before. When we got home my daughter's father (just home from a 12 hour workday) said, \"I thought you were at your mom and dad's.\" When I told him we had been there he next asked, \"So why so you smell like a Battleship?\" Busted!! There was none for him. These guys have been at it a long time and have remained consistent to bring us some pretty damn tasty hoagies!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "dHezDPzthXS7L3lglXdeow": {
    "date": "2/22/2018",
    "text": "Best sub in the Burgh!!! I highly recommend the fried bologna!! Clean and inviting  The Best bread!! And Rick Sebak Love it here too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ere_OyOm4ecW0U75FOXLkA"
  },
  "1UrgEPU2uFxg5YgJcgWlFw": {
    "date": "3/6/2019",
    "text": "I love dive restaurants and bars, so I was really looking forward toTriangle Bar and Grill, but I was extremely disappointed. My sandwich was nothing special. It was too much bread, which had I flavor, and I could tell if there was seasoning or vinegar and oil. They don't even make the bread in house! Tasty fresh sandwich bread makes an average sandwich taste amazing, and this wasn't even close. This seems like a neighborhood favorite for blue collar people, but I would recommend going and wasting your calories on a below average sandwich.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6mXVlJrW1bMobh19RuGeVQ"
  },
  "zoKGji9hcar6HZv2Ns_HBw": {
    "date": "5/24/2017",
    "text": "Triangle Bar & Grill Iconic place that everyone should experience. We have been purchasing these heavenly Battleship hoagies for years. It used to be a dirty bar that sits on the edge of Swissvale on Monongahela Avenue. For years I refused to go in alone. After years of improvements, I now have no issue going in an ordering a Battleship on my own. It's not the most attractive dining place in Pittsburgh, mostly take out, and we have never sat in, always take out.  I like watching them make the subs in front of you. I can tell them little or no dressing. I have found a new love, the Torpedo Roast Beef, Sheetz stopped offering roast beef subs, to my benefit, Triangle Bar's is so much better. They offer 4 sizes of great delicious hoagies. The Super Battleship which we have only had once, The Battleship is our favorite, The Destroyer which we have not tried yet, and my new personal favorite The Torpedo. They do offer other sandwiches as well.  Well worth checking out. For years one of our kids would have a friend that worked there, and I knew I would get a great sub, it was a bonus that we took advantage of. Sadly, no one we know is there any longer, BUT.. we always get a great sub!  After 30 + years we have not tried the cheesesteak, I am looking forward to trying one. This is a must experience for anyone living or visiting Pittsburgh. Highly Recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eHxHgfcNJ7b8qpMH7Tv89Q",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eHxHgfcNJ7b8qpMH7Tv89Q/o.jpg"
      },
      {
        "img_id": "In8TKYq3ZyBqNWzjbJTlHg",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/In8TKYq3ZyBqNWzjbJTlHg/o.jpg"
      },
      {
        "img_id": "H_zFwwq8Otwf5uzyrSEVvQ",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/H_zFwwq8Otwf5uzyrSEVvQ/o.jpg"
      }
    ],
    "user_id": "3egcdazws_x1wW35jgXfNw"
  },
  "a8YhDkZpTGza7s7vQ2j68Q": {
    "date": "2/16/2019",
    "text": "Cash only! They do have an atm available but it does have a fee. These subs are so good. We got the largest sandwich available and we were able to eat it for a few days. The oil and vinegar added really makes this sub a standout. They have hot subs available as well which I want to return to try. Most subs are served cold but great to also take home to heat in the oven.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S8eGbu7qZmyJc6-Uh1w4EQ"
  },
  "Ii-U2l-tq7V3Dw5BMF5SLw": {
    "date": "7/23/2018",
    "text": "Consistency! Consistency is the best review any business can receive and every time i come here it tastes exactly the same way great the best sandwiches in town well worth the line....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ex7cBjsR7oBBVrUjWVJXjw"
  },
  "VrYu5SqMGynBD1ISH6jOnQ": {
    "date": "11/26/2016",
    "text": "I just bought my first destroyer Italian hoagie.   It looks delicious can't wait to try it  Triangle Bar And Grill is mostly a take out order place for sandwiches and hoagies",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ja3UuCX089ym6wVa4OVaoQ",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. Mostly take out, some eat in",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ja3UuCX089ym6wVa4OVaoQ/o.jpg"
      }
    ],
    "user_id": "yksg2E0ZQI0gkjVJMzgeyQ"
  },
  "Fvw6A8JVbns5hGS8wBb3hg": {
    "date": "1/15/2019",
    "text": "Okay, so, don't expect a the posh, swank lobby of a Subway. This ain't it! but what you have is one of the most underrated, hidden gems of the Burgh. Caught a Food Network show a while back and had to go. We went around 2pm one day and they had sold out of bread! Over 400 loaves of it. Went back a few days later, a bit earlier in the day and scored. Okay, so, get ready for an incredibly, large, and tasty sub made to order. We ordered the Super Battleship combo of Ham and Turkey, a destroyer tuna and a destroyer Pastrami/capicola. WOW! All good eating. Will be going back there when I'm back in the Burgh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2iy1wJ4E9L89YHzJVO1nEQ"
  },
  "qAzuQ5LahQw4fmzgmQoHBw": {
    "date": "6/2/2018",
    "text": "Great Food and the people that work their or great to  The only trouble is I like to have big cold beer after I order 2 sips and the food is in front of me and then the ride home I have to smell that food with my mouth watering LOL",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TyO9NY523caWO4fz7gRTJg"
  },
  "tOVu_M3QB1pNEa4ZqZ2kAQ": {
    "date": "4/27/2018",
    "text": "Love this place. I've been eating here since I was a kid. The hoagie buns are fresh and the oil and seasonings make the sandwich.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zkjOkYXS3ctmJ6DlseFqzg"
  },
  "Gf5lMNv4dRTp8wybGkfbpg": {
    "date": "5/13/2018",
    "text": "One of the best cheese steaks in and around the city !!!!! After all these yrs I still find myself craving one every once in awhile.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B1AK9TjoZqhvRj2GVJkm4A"
  },
  "Z_tpD6mg3FcPFoZqxyOksw": {
    "date": "5/6/2018",
    "text": "I thought this place would be good. Had the Italian hoagie and noticed right away that the lunch meat was low grade !!!! TERRIBLE",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AArhVXFj0Su5EfngmyGPyg"
  },
  "IqY_b1kKLffby1HgeI8fvA": {
    "date": "4/11/2017",
    "text": "Triangle hoagies are second to none. When I  think about them when I'm hungry, my mouth starts watering immediately. This can be torture because I live thousands of miles away right now. But when I get into town my first meal is always from here. The hot sandwiches are very good but, for me the way to go is the turkey battleship. With that high quality meat and cheese, the veg and sauces on those soft italian rolls, it's sandwich perfection for me. Best yet, the Triangle is a bar, so you can sit down for a drink or grab a big bottle of beer to go, and some Turner tea to wash it all down.  Bring cash and an empty tummy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "mwbC8pNu8sj11Nhjz2ev5w",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mwbC8pNu8sj11Nhjz2ev5w/o.jpg"
      },
      {
        "img_id": "0XdQuydQHtHvDIV2v_jvqg",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0XdQuydQHtHvDIV2v_jvqg/o.jpg"
      }
    ],
    "user_id": "u-tJjCJrn9lSJfSpTewPrQ"
  },
  "91CJMT5DDl-NBH0M4hTJBw": {
    "date": "4/17/2018",
    "text": "No need to order extra meat on this battleship! Its perfect as is! This is a Pittsburgh staple!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SxhoJEj0qHw3fLab_FGz2g"
  },
  "Si5O2nqPSBjCZR9-pUQ7Eg": {
    "date": "2/27/2018",
    "text": "Really good!!I l love these subs and they have the extended sizes for a reason. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cK9KDD7qsSFZbpXkQLtGWw",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cK9KDD7qsSFZbpXkQLtGWw/o.jpg"
      }
    ],
    "user_id": "-Pk25bOBsvemFaWKDBVBzA"
  },
  "9_uOSqgBaDOPxx5By4TnQA": {
    "date": "4/5/2018",
    "text": "Haven't been there in a while but had gone the other day. The food is still great!  The best in the area!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w8OQ5JLQ2fb2BtQ0FGOJNw"
  },
  "lqiy_JsO6qDoBIF0FNQ6CA": {
    "date": "12/7/2016",
    "text": "So this place was featured on a past food network show called Cheap Eats and naturally when we watched a re-run of it on Sunday morning before the Steeler game, we knew where we were headed for dinner at halftime later that day.  Around 630 that evening we headed over to Swissvale.  Without knowing about the place or checking the hours they are open, you may not even realize its there.  We went in and it was exactly what we expected - a sub shop. No frills, no fancy decor.  It's a neighborhood bar that whips up huge, delicious sandwiches.  There were 2 or 3 televisions with the game blaring through, some bottles of liquor on the back bar and coolers full of 40s, pounders and 12 ounce bottles.  This place does not have anything except sandwiches and a few sides - no wings, no chicken tenders, no fries, no salads, and no appetizers.  That was perfectly fine with us.  I was fully prepared for a Sunday cheat meal (as I don't often eat sandwiches anyway).  We ordered the 26 inch (destroyer? .. $20) steak & cheese sandwich to split.  It came with shaved steak, provolone, lettuce, tomato, vinegar, mayonnaise and fried onions & mushrooms.  We also got a side of potato salad that was in a medium sized Styrofoam container and was more than enough to share ($3). It all was EXCELLENT. It reminded me of my absolute favorite sandwich place at IUP when I went there except Triangle's bread was MUCH better and extremelyyyy fresh.  Bobby went to order a captain and coke and we were told \"we are more of a shot and beer bar..we don't have any ice right now\" LOL which was funny and perfectly fine - we both settled for beers.  Please note that they are cash only. There is an ATM, but it wasn't working while we were there so Bobby had to run down the street and withdraw money while I waited for the food. Once we were finished, the guy behind the bar came over to check on us.  He was shocked that we had both finished our 13\" halves (please......we didn't come here to mess around).  It was honestly more than enough to take home for another meal, but I couldn't stop!!!!!!! It was so good!  Triangle is a great local little spot to stop and get a really delicious, filling meal at a cheap price.  It seems they do a good takeout business.  We'll be back! Huge fans.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 8
    },
    "photos": [],
    "user_id": "NIJWrUAz7-9IEqwZnGBT9g"
  },
  "qXxvxV9JAysCQ0FdMEpiTg": {
    "date": "9/21/2015",
    "text": "As I do whenever I review a sub shop, I must state that I'm from DE, and have high standards for subs.  After trying a battleship sub this weekend, I can say without reservation that the subs here are the best in PGH, without a doubt.  If you haven't tried one, you need to ASAP!  Given that I've been wanting to try a battleship for a long while, a friend and I decided to pick one up and have a picnic in nearby Frick Park.  We called in our order, and they gave us an estimate of about 45 min., which worked well given that we had other errands to run.  By the time we arrived at Triangle, our battleship was ready, so we were able to cut in line, pay ($14.75), and be off to have our picnic.  Unwrapping the sub, it was immediately apparent that it encompassed 26\" of goodness.  Since it wasn't pre-cut, I tore it in half crosswise, which gave each of us 14\" to chow down on. The sub was generously filled with meats and cheeses, with a sufficient but not overwhelming amount of vegetables.  The bread was substantial and of good quality, and didn't tear or crumble as we ate our portions of the sub, as lesser quality bread does.  I ate half of my portion, and my friend was unable to finish his, despite intending to do so.  I ate the other half for lunch the next day, and it was almost just as good as it was upon receipt.  Both my friend and I were very impressed with the quality of the battleship, and it kept us full for a subsequent long-ish walk in the park.  I'd highly recommend it as an ideal picnic item.  Whether you live near Swissvale or not, be sure to try a battleship, since it's without a doubt the best sub in PGH!",
    "rating": 5,
    "rated": {
      "funny": 9,
      "useful": 22,
      "cool": 18
    },
    "photos": [
      {
        "img_id": "go64fizNmIL60cCrcvOXAg",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. Battleship hoagie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/go64fizNmIL60cCrcvOXAg/o.jpg"
      },
      {
        "img_id": "ChB105uC6g7rYlqQdWWxeQ",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. Battleship hoagie--cross section",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ChB105uC6g7rYlqQdWWxeQ/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "SNM1QWu0dfgdNkfByLZAeQ": {
    "date": "9/10/2019",
    "text": "Killer subs, torpedos and destroyers. Folks are friendly and helpful. Food is fresh and flavorful. Def recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0mvmbhiUfeTMVsUmvBqHxA"
  },
  "ECyl6cNSGGqKCiOngls6Eg": {
    "date": "8/26/2019",
    "text": "I will try to call in my order ahead more often .  The shop is getting busier and busier every year and deservedly so as they have some of the best cheese steaks and cold cuts in town  I am happy they are doing so well",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uC6DS0jrlIpAlxMpqPYmGw",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uC6DS0jrlIpAlxMpqPYmGw/o.jpg"
      },
      {
        "img_id": "hAsNRrv-J5FnClnhib0iRg",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. Ham and Cap battleship with pepper rings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hAsNRrv-J5FnClnhib0iRg/o.jpg"
      }
    ],
    "user_id": "0SHgYK_hIUllm9GpbIwsWg"
  },
  "WACwfONMSEXjJNyX8MIacw": {
    "date": "9/13/2019",
    "text": "There's not a lot to describe about this place. It's a bar that specializes in submarine sandwiches. They have really big ones and regular sized ones. They are very good but typical of the sub sandwich style in this part of the country. Definitely give it a try or several. The neighborhood and the building don't look too nice, but it's worth the trip.  CASH ONLY",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "piVWCVJw5NLthnFQX-FNsw"
  },
  "oMFfuRn_yVRbK_QWJaQt2Q": {
    "date": "5/21/2019",
    "text": "I returned after 40 years to try a Battleship. I really enjoyed the Italian hoagie that was nearly 3 feet long. I tried dirty chips that were buffalo blue flavored and I was not a fan. I had a favored spiked seltzer that was really good. We ate at the vintage bar and left with 3/4 of our battleship to go- filled up and happy. This Pittsburgh no thrills institution is a must visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wcv9qdf0AMTTZgs3OhEAOw",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. A huge hoagie that is impossible to sink- the battleship.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wcv9qdf0AMTTZgs3OhEAOw/o.jpg"
      },
      {
        "img_id": "F_7TLjQQQL4SIIcOHnR9gg",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. Triangle Bar in Swissvale",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/F_7TLjQQQL4SIIcOHnR9gg/o.jpg"
      },
      {
        "img_id": "9kIp1bjFAI3NlR9PRXkPFA",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. Triangle Bar",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9kIp1bjFAI3NlR9PRXkPFA/o.jpg"
      }
    ],
    "user_id": "UetOIhAdPBkGjm_o-mSC3Q"
  },
  "FI8GYeijUKf9n3eNIhjvCQ": {
    "date": "7/27/2019",
    "text": "Best subs in the 'Burgh no doubt. Sandwiches are giant and always filling. Simple fresh ingredients, nothing overly fancy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "g0WzrF5If-_6DFkR0nC7dQ"
  },
  "j3ksQlwk9TI86MUv6oDNOg": {
    "date": "12/23/2018",
    "text": "This place gets so much hype. The sandwiches are huge and they make a good ass Italian hoagie.  Workers are friendly and fast. Entire bar reeks of onions. My husband and I had ti wait outside because our eyes were burning  Sandwich was great. Overall a 3.5",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "3OrSiiLCW72EQffafgixdg": {
    "date": "9/6/2019",
    "text": "Pittsburgh perfection! Nothing more to say about it! My only issue with this place is stopping me from coming 6 days a week!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CZxTyU7RJSybqjCCtO970w"
  },
  "3omuEoOC8nUzB_W7keXTeQ": {
    "date": "6/17/2018",
    "text": "The Battleship is an excellent value and feeds quite a few!  My tip best to call ahead with your order especially on Steeler Sunday's. If I had a wish list for the triangle, I'd add a place order here line and a pay here line.   6-10-18 update-called our order in we were given a 30-35 minuet wait time. Prior to hanging up the gentleman told us 45 minuets...ok... We arrived to pick up our order we were told it would be ready soon...25 minuets later we left. NO Organization what's   6/10/18 called in my order and was given a 30 minuet pickup time, prior to hanging up he changed my time to 45 minuets. I arrived to pickup my super battleship and was told I was next...fast forward another 20 minuets...nothing...nothing but consistent disorganization. I left and went to poppa johns.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ulQ8Nyj7jCUR8M83SUMoRQ"
  },
  "67FtRsVHJXuScV_DYU6V2A": {
    "date": "4/12/2019",
    "text": "I had seen this on two shows and finally said ok I'm gonna make the drive. I ordered by phone so the two times I've been there both where phone orders for pick up. I know everyone raves about the the Battleship Italian they have but the Butcher Boy is where it is at! So much fried jumbo that I actually couldn't eat the normal amount of a sub I do. I recommend this place is you like fresh subs that are really good. They make their bread in house also.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "kEtVOmQDxjijMdiwzMTc0w"
  },
  "FtHwxblwTlj2Ie0h_t92Aw": {
    "date": "5/20/2018",
    "text": "I absolutely love this place! It makes the best subs in Pittsburgh. They always have a line but the employees work hard.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j6zr9cFWDXw9I8Xm7m9wiA",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j6zr9cFWDXw9I8Xm7m9wiA/o.jpg"
      }
    ],
    "user_id": "TeCu4zf1aPEPk96oReqpkQ"
  },
  "fC8lk0Ygq4E3zsz6mQL3LA": {
    "date": "9/4/2018",
    "text": "I went past a couple times before I stopped in I'm from out of town and the neighborhood looked a little sketchy with not a lot of parking. But once inside it was small but nice with a few people in line to get subs. I ordered a corn beef/pastrami sub and it was really good. Customers I talked to said all the subs are delicious. It's a must stop if your in the area. The menu is posted in the pics they have different sizes I got the medium.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "3KO39yppDX-1uhQgDmii-A",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3KO39yppDX-1uhQgDmii-A/o.jpg"
      }
    ],
    "user_id": "3xBFFH866WoySDG7uuwBSQ"
  },
  "LsdFbbblbBTtA2eSSU2s_w": {
    "date": "10/17/2018",
    "text": "Great place, not what you initially expect from the outside I must admit. Talked to the guy at the counter. Things done in house and well the subs are as long as an arm. They arent all bread like some places. I would like to see French fries pop up on the menu but that's me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "huT-w5GXm9S0mLwYDMRtKw",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/huT-w5GXm9S0mLwYDMRtKw/o.jpg"
      }
    ],
    "user_id": "uo1k6T3rppPX6FoE17OvRA"
  },
  "FS3CvYLxTuRDAalP2Mk-fg": {
    "date": "8/11/2018",
    "text": "Great Subs and my all time favorite since growing up as a child is getting the Battleship or the Destroyer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pO1dWviX0AdRzflJ0SlL2w",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pO1dWviX0AdRzflJ0SlL2w/o.jpg"
      },
      {
        "img_id": "V2sTJWeZXvWDEslULJw2xw",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V2sTJWeZXvWDEslULJw2xw/o.jpg"
      },
      {
        "img_id": "InZ6hyIUoolNUCIUGagf5Q",
        "caption": "Photo of Triangle Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/InZ6hyIUoolNUCIUGagf5Q/o.jpg"
      }
    ],
    "user_id": "8QmcZPx0sbFKu73_eOiLiw"
  },
  "dkX-jioDn5yH0_5bkNs3Cw": {
    "date": "2/16/2019",
    "text": "Heard from family about the famous subs here and had to try it out. I've never been a fan of untoasted subs but I am a changed woman after trying the Battleship. From the soft bread to the spicy meat to the simply flavorful dressing, this sub is out of this world. I'd recommend anyone coming in to try it. The line is pretty long so be prepared to wait- but isn't that a good thing???",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CyMbVhxlDZxRwZwjDn6Ptw"
  },
  "AKWkN-VhTVczBmkw-BqgOg": {
    "date": "3/24/2019",
    "text": "Fresh made giant sandwich.  Staff is friendly.  The sandwich ingredients are abundant.  This shop is a local legend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6AXkDBFblxOGLlN-uxjuHQ"
  },
  "Km4MXwh6ilxFAXQiXxVlhg": {
    "date": "9/17/2018",
    "text": "I absolutely love this place. Sandwiches are fresh and delicious! Would give 5-Stars, but the parking blows, it's CASH ONLY (there's an ATM on location) and it can be pretty busy at times, so there's often some wait time.  Will continue to visit and would highly recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iv2rd8x9vzkhwwLDOQSk0A"
  },
  "gxukfQULpqLed_vExFwLXg": {
    "date": "3/17/2019",
    "text": "Great food never had a bad sandwich in the over 20 years I've been going. I only wish I lived closer",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F36uryt1okcLe7oFQvJ0dA"
  },
  "8-DFGrnlgYXecBXln1IvgQ": {
    "date": "1/15/2019",
    "text": "This is the best sub shop. The length and weight is out of this world. The topping are fresh. Bread is fresh delivered every morning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WntBno172d1TPMnbTeNPzA"
  },
  "VAfcxX4_PPP2D2BFerSFwQ": {
    "date": "2/7/2019",
    "text": "Best sub shop around. My fiance and I went today, and we got 2 Italian subs, I got potato salad, he got chili, and we got a battleship to take home for lunches. We got mayo, and my fiance didn't finish his as he wasn't a huge fan of the mayo. The guy came over and made sure everything was ok, and when he realized my fiance had tried to wipe the mayo off (the napkins on this plate, lol) he made him a whole new sub AND a whole new battleship! The potato salad was SO good and the chili had a smoked taste to it. I recommend! The food and the customer service was awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfM_vB58M_Zih3oNKpnyEQ"
  },
  "RRKqm3FwYBF7g77eqpvXYg": {
    "date": "11/6/2018",
    "text": "I've been coming to this place since I was a kid, it was also featured on a tv show which says a lot about this place. Make sure you come here to get you a battleship and I assure you that you will be a very happy customer! One of the best hoagies that Pittsburgh has to offer is right here so be sure to check this place out if you haven't already",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pAF0N2AJ8ZV0RlXsUhj9rw"
  },
  "bW2UIq6L_GozX6tbPXVWnw": {
    "date": "4/13/2013",
    "text": "After further investigation, I opt for the butcher boy. Fried jumbo. Jumbo? Jumbo what? Seems its a local delicacy you can only get in Pittsburgh - just kidding. I don't even like bologna but I actually drool thinking about this sandwich. Heck, I would practically be a vegetarian if I stopped eating here, but its so worth it now and then.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2dTQmS9iUhzdvhSElbkOOQ"
  },
  "clouZrq2D8cULt6iH5zYNw": {
    "date": "9/20/2010",
    "text": "Another place I've been going with my family for years. Triangle Bar has huge (26\") battleship subs for very cheap!   Our favorite is the italian, which is perfectly balanced with salami, ham, cheeses, vegetables, and spices. My father loves the roast beef subs too.  I love that it hasn't changed a bit in the two decades I have been going there. Kind of dirty, barred, on the corner of the street... but excellent food! On game nights you will see a stream of people picking up their subs.  Now you know why.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "tu5AwWOh6QlSvpi5CXalQg"
  },
  "h-2N5sYOGKEASZYADFBEDQ": {
    "date": "2/4/2013",
    "text": "This monster sandwich was a beast. Great Cappicola. Friendly people. Def go if u are in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_22sEOBieahvEGAQetchEQ"
  },
  "Yue3pEi_3c_H09Hain722Q": {
    "date": "7/10/2012",
    "text": "I have been a customer of the Triangle for decades. If you're a Yelper who craves trendy chic establishments, you need to look in Shadyside for places that just opened 6 months ago (and will be closed in 6 more) and skip the Triangle. It's practically frozen in time from 1970 other than the flat screen TVs. Oh, and they don't let hardcore drinkers lay their head down on the bar for a quick nap any more either.  Having grown up in the same area, as a kid I just assumed every neighborhood had a place like this where you could get a massive hoagie freshly made and done right every time on fresh bread at a great price. Alas, it is not so. It turns out the Triangle is a one-of-a-kind with respect to the wonderful, awe-inspiring Battleship.  I don't know why anyone buys a sandwich ring from a supermarket when for half the cost you can have a better quality sandwich that's even bigger.  Even my wife, who is such a non-foodie she never cares where we go to eat or what we eat, is jazzed if I offer to grab a Battleship before I head home from work. And that trip adds 15 miles to my commute home so it's not a visit of convenience.   If you love a great hoagie, you have to try these. I hope they never change. I'm not eating there for atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "tdAOfrdNHBeWkASn90Lk6A"
  },
  "40VW3bdqrUyEJQaOu9xRYw": {
    "date": "11/15/2015",
    "text": "Got a meatball hoagie today. It was delicious. The meatballs are huge and juicy!  Would order again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BIRfTastfwSDhLdWnuq8mQ"
  },
  "sAy_Fwv-r-jB2OiHWkaDXg": {
    "date": "10/6/2015",
    "text": "Hoagies are amazing!  This 1 sentence explains it all. You must try it if you never have!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SEWXKf5WDE8KJEqkpfX-jA"
  },
  "inuOc0n4Bd8sw79NKVPo2w": {
    "date": "9/8/2015",
    "text": "A s chief cook on LST 325 I can attest to the quality and flavor of great hoagies, the bread was especially good thanks for a wonderful meal on our short visit to Pittsburgh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aBz7dYDNydnx9dS2zwrlxA"
  },
  "y0nKYqu1bu8YnW2x7OiHTQ": {
    "date": "7/23/2013",
    "text": "THE Place to go if you want to feed a family of four for under $20!!  Meat is fresh, toppings sublime, and the friendliest owner as well.   Just don't expect to sit and eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k3wR9pC7bdfx7kUuIK91eA"
  },
  "uxrFtfhwL-g4fW7nd2oZWA": {
    "date": "3/30/2015",
    "text": "We never watch a game or have a party without a Battleship hoagie!!!! Always a crowd favorite!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ihFUQ7QjYZ0uMHKeGAX1NA"
  },
  "cEIie0J-y_1dKLOYCttSVg": {
    "date": "4/30/2009",
    "text": "I can't believe I'm the first to review!  My husband and I saw something about the Triangle Bar and Grill on an old WQED rerun about good places to eat in PA.  We stopped by yesterday and are VERY glad we did.  The Battleship hoagie fed us for 2 meals (3 feet of sandwich with 2 lbs of meat!), and that's saying a lot, we like our food!... and it was only 12.95!  It was one of the best sandwiches I've had, hands down.  We are definitely going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "RHEpX_rqlslCNtJDTVVIKw"
  },
  "nIEKacFDrECGgLFZnZKr8Q": {
    "date": "4/30/2009",
    "text": "BEST SUBS EVER.  Seriously.  We saw this on \"PA n'at with Dave and Dave\" and it looks awesome.  We took the drive to Swissvale and got us a \"Battleship\" and it was literally 3 feet long, just the right amount of veggies and meat and delicious.  It was 2 meals worth of food (for two people).  Even better the next day.  And the best part was that it was under 13 bucks.    It's great, fast food.  I can't wait to bring friends there to enjoy their selection of 40s along with a Battleship.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "w5eJ0K3XXZaIKAdUkGb1eA"
  },
  "CRIRsSf0dB54apYIT4cEaQ": {
    "date": "10/19/2010",
    "text": "the battleship. 26\" of good bun fresh meats tons of lettuce and tomato all for 11 bucks?  ill admit, driving through and parking on the streets of swissvale brought me closer to God since i said a prayer that my car was going to start.  i saw the place was held up a month after we were there but that could happen anywhere. good sub, i omitted salt and pepper and oragano bc it just doesnt seem right on a cold sub.  they have hot subs too, maybe take my chances and go there for a cheesesteak",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "GdAtRPF7QG2ahEeoEqQuQA"
  },
  "YIhNt2GXgJ8MZ5qD0yXpMw": {
    "date": "6/4/2013",
    "text": "Layers of cheap cold cuts, lettuce, onions and tomato on fresh Italian bread doused with the perfect amount of oil, vinegar and oregano.  Enough to feed four, but if you're saving it for yourself it only gets better the next day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DOa_TMWFib5ISs7cpQHANA"
  },
  "XANagjZMvg5NoXz9WJZlBw": {
    "date": "7/21/2010",
    "text": "Huge, huge \"battleship\" sandwich w Italian meats + bologna, exotic malt liquors, craftsmanship, and a barred window entrance hiding it's charm. Great experience.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "lghSa1ymV_h0muL3YSBI7w"
  },
  "YZAOnt7tVCl1_hZyz5I3Ew": {
    "date": "6/22/2008",
    "text": "Simply put, the Battleship is consistently the best hoagie I've ever eaten. Every time.   Especially if  you're lucky enough to have it made by one of the many tattooed men.  (I'm not sure why, but the more tattoos the sandwich maker has, the better the hoagie tastes.)  Yeah, the neighborhood leaves a lot to be desired. Grab a buddy, lock your car, and get the sandwich to go and eat it elsewhere.  It's absolutely worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XTwS2UZ4NVIFQbj8Z6ksTg"
  }
}