{
  "btgCfYA0SkridoOTI9OaQg": {
    "date": "1/31/2019",
    "text": "Condado is great. The taco selection is more than anyone could ask for and the margaritas are on point. This place can get busy, but they were not too crowded on a Wednesday evening. The food came out quick and the tacos are decent in size (2-3 are plenty per person). The JuJu shell is a must-try. A soft shell/hard shell combo with melted cheese and chorizo between the layers. Game-changer. Overall, the atmosphere is great and inviting and the service is top-notch. Definitely one of the best taco joints in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pkDk_kooopE11QxJQ5kN5w"
  },
  "21E7b50eQfNT7IPwCuXfPQ": {
    "date": "7/1/2019",
    "text": "Love this place fun, energetic and great food. Went there with my kids and the ability to make your tacos to your tastes is perfect. Beer cold and service good. Can be crowded, we took a walk and enjoyed Lawrenceville.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FUCCBv9aiaVOOQKok6t3ew"
  },
  "NdlfZxLiD01IooMqmrCaZQ": {
    "date": "2/6/2019",
    "text": "A solid bar with very okay tacos.   I've tried Condado three times now (first time at the Lawrenceville location). They have a wide list of margarita options and beers on tap. As for the menu, you can choose from a create your own adventure taco to their signature pre-designed options. Their tacos are definitely more of a tex-mex style with flour tortillas and shredded cheddar cheese. Compared to some of the best taco places such as Edgar's or Las Palmas, taste and quality wise Condado doesn't come close. Compared to Bakersfield which boasts a similar vibe and menu, I prefer Bakersfield tacos, apps, and drinks overall.   Stop here if you want to munch on some nachos or guac with your drink, otherwise these aren't the tacos you're looking for.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iNlWUNXJ4xBNODjDHvpv5Q"
  },
  "d6zRAxNfFNt3F_rBiKjw0Q": {
    "date": "12/7/2018",
    "text": "Okay. I originally gave this place a 4 star review but have to knock it down for several reasons.   1. I actually hate (HATE) the seating arrangements. It's so cramped and I don't want to sit at the same table as random people, especially when I can't even hear the person across from me because the music is so loud and I have people I'm touching elbows with also screaming.   2. Our waitress sucked. She didn't bring water until we were signing our checks and didn't check on us the entire night, but made sure to check on the bros sitting next to us who were flirting with her several times. I got the tres amigos dip trio that came with salsa the last two times I ordered it and didn't this time. When I asked her about it she just said \"oh it's complimentary so sometimes you don't get it\" what???  3. The food isn't good. Seriously, if you want real tacos with good ingredients and good service, I highly recommend Baby Loves Tacos up the hill in Bloomfield!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eCtBztD59kMEWajLoVQ2fw"
  },
  "BPMYyLIofd-yoXscyKu7IA": {
    "date": "3/25/2019",
    "text": "SOOOOOO GOOOD! Get the layered taco shells and Jalapeno margaritas.   As someone visiting from a different city, I would 10/10 recommend anyone to eat here who is planning a visit to Pittsburgh. Surprisingly cheap, too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UeBva3Hvw5Qj1jBvUCL9gg"
  },
  "PwmP_tC6dXCMtbJvXctHuw": {
    "date": "6/20/2019",
    "text": "This is my favorite place for tacos! You can design them in whichever way you want or order one off of the menu. Great guacamole and chips. Love the queso! I've had really good experiences here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A1LpFwHzqGMWYOVs3OQQjw"
  },
  "A1Kgk8xHi2Ei3W-PxbaOvg": {
    "date": "12/9/2018",
    "text": "This place had me at margarita flights!!!  They have a flight of 3 margaritas for $15 with like ten different flavors to choose from!  They were pretty good... some better than others but a perfect way to try their flavors!  The nachos we shared were some of the best I've had and the tacos were amazing... filled to the brim with all the toppings you could ever want!  Lost a star for service.  It was really slow ... friendly but slow.  Amazing options for veggies here with jackfruit, tofu, and mushrooms.  I want to go back for the jackfruit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "x5LRKDMZUDqYc5O-rotRfA",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/x5LRKDMZUDqYc5O-rotRfA/o.jpg"
      },
      {
        "img_id": "YXH26-JPTy4b2L_U1g9eOw",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YXH26-JPTy4b2L_U1g9eOw/o.jpg"
      },
      {
        "img_id": "0MvZh3wG7y1I4BqVmbXNtQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0MvZh3wG7y1I4BqVmbXNtQ/o.jpg"
      }
    ],
    "user_id": "1ccI2Y60Z0hZQLuHr_X8Uw"
  },
  "PDpdAE2eJVbHBdIM-viKGQ": {
    "date": "5/20/2019",
    "text": "Great food and great prices. I'm picky and love that I can build my own tacos. The queso is outstanding. Actually, all of the food is outstanding. The staff seems to get a little overwhelmed when it's busy and don't really have a system down to handle it. I was there during happy hour and it was definitely a younger crowd and it got a little rowdy. I loved the food though so I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ckc3kU1lv15TjaPx_yZ1LQ"
  },
  "SbMez4JHp4FbmnCQhNypag": {
    "date": "12/11/2018",
    "text": "Honestly, condado probably has some of the best tacos around pittsburgh. Not only is the queso phenomenal, but the being able to completely build your own taco is so nice. The taco sheet is fairly easy to follow, you can make your selections from each category, and there is quite a big selection of options for any picky eaters. And the pitchers of margaritas are very convenient for larger groups. The only weird thing consistent among the condado's that I have been in is that the seating is crowded, and happy hour only goes on in the front room.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pZuK6cMZoQlvjNojbOBJIw"
  },
  "PyVmEssU_oPf9kucMT7tww": {
    "date": "8/13/2019",
    "text": "Mary was such a great waitress, extremely helpful and kind, and the service was extremely fast with great food :) Will definitely be returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IG5h7UMhtrJWzaHPGEBtHg"
  },
  "hRJepDoXJwo7pssRAG2L1w": {
    "date": "7/25/2019",
    "text": "Did not like the tacos, I don't think they really know the meaning of Mexican food or how to cook it. Sorry I had to post such horrible review, I don't mean to be rude or cruel but if you're from California, don't expect to get the kind of tacos we're used to get here!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tm6v2qqfdrWWpW9I32ThKQ"
  },
  "W_DVS9vxPhKhotji7sr5Og": {
    "date": "8/11/2019",
    "text": "First time coming to the Lawrenceville area as I'm pretty new to the city. Our food runner (tall man with an eagle tattoo on his forearm) took time out of his busy schedule to answer a few questions about the area and fun things to do in the neighborhood for the night! Ended up heading to arsenal for some bowling and had a great night, cheers man!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZcIiWW88TIAn1kgT8Iyvrg"
  },
  "B3H3-itCth3bfBBVUyM_Zg": {
    "date": "10/20/2018",
    "text": "I went here on opening day and was really surprised with how well prepared that they were considering it was opening day.  The service was excellent and the food came out very quickly.  The only suggestion that I have it to turn down the main music just a tad.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "91koVXu54Y6tIiZKKxVmrw"
  },
  "5Wbo-HC0iQ-8ABHau2pYYg": {
    "date": "12/12/2018",
    "text": "Very friendly staff. The food is also really good. We got the monthly special gauc, it is a great combination of corn(sweet) and chili(spicy). I got two tacos, korean pork belly is awesome! The food is not very heavy and in a good portion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pVyYknW7weRMb9ZgiIuKAQ"
  },
  "33j_W8BZfM6CGCe0AmN2Gg": {
    "date": "8/7/2019",
    "text": "Never disappoints!  Great, consistent experience every time, every location.  The queso and margaritas are on point!  Everyone I see a Condado, I go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ni5I7jGDB4mpLKS8zq6_Q"
  },
  "ckqoaRy2TtM2CCUJZ4i3GA": {
    "date": "11/11/2018",
    "text": "The restaurant itself looks great, there's lots of neat artwork all over the walls. The music is loud and the seating is communal style so everyone is kind of on top of each other and that makes it even louder. There was a table between us and the entrance though even so every time someone came in (which was often), we were hit with a blast of cold air. Later we found out as we were leaving the outer door of the vestibule was propped open... kind of strange given that it was in the high 30s outside. Bring a coat in case they seat you near the door. Lots of great options on the menu. We wanted the pineapple salsa to start but they were out of it so we got the corn salsa instead, it was great. Their chips are great too. The wait was pretty long for the tacos. The Lucy's Fire was fantastic, I'd recommend it. I also had El Tracional and Bubba Kush, both were fine with preference towards the latter. The tacos are sizable, after chips and salsa I was only able to eat two. Worth checking this place out for sure.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VKcRWF6VAN-OJ_jzEWjtdQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Bubba Kush, Lucy&amp;#39;s Fire and El Tradicional",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VKcRWF6VAN-OJ_jzEWjtdQ/o.jpg"
      }
    ],
    "user_id": "0KhRPd66BZGHCtsb9mGh_g"
  },
  "70uFFqpjTiduX6g8UhFjXw": {
    "date": "5/26/2019",
    "text": "Great ambiance and friendly staff. Tacos however are 80% tortilla. The last couple of times I have been there with friends our build-your-own tacos came with so little filling that it felt like a rip off. I regret not taking pictures. The tortillas are small and yet you can wrap the taco like a burrito. They are even double layered to prevent the taco to break, although I suspect the real purpose here is completely different. The first time we let it go and blamed it to maybe someone new in the kitchen, but twice in a row it is definitely a business plan so we agree we won't be coming back. If you need to cut costs do it somewhere else but don't mess with the food, or increase the price a bit. Although $9 for two tacos is not super cheap either. Cantina for example charges $1-$2 more per taco but you actually get to eat a meal not just a bunch of cheap corn.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DfZ2bbM_2Pi7GEXn9nY8iQ"
  },
  "0yJf47qUHCCgPfkkG8KC3A": {
    "date": "4/13/2019",
    "text": "Visited here on a Friday night- it was busy but we were seated within 30 mins and they use no wait so you can walk around downtown and come back when you're close to being next to be seated! Our group started with a sampler of dips- traditional guacamole, chili rellanos queso( which was AMAZING) and pineapple salsa. I Got two build your own tacos and that was more than enough food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dlkhcw19blfbfc5xA5PPtw"
  },
  "091UKjfpswDWaLnH8ai4Eg": {
    "date": "4/9/2019",
    "text": "Might just be my new favorite taco spot in the Burgh. Love the build your own taco menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sv4oBhiv5_QccRCZsxNN_w"
  },
  "kPXE-SfDcKetr0P7Xfx8_A": {
    "date": "2/16/2019",
    "text": "Condado's newest location doesn't dissappoint; their quality of service and food is just as great as their downtown location! As with the downtown one, you can't go wrong with just getting a couple of tacos, but make sure you order an appetizer as well (specifically their guacamole. They will refill your chips if you run out! And those are excellent in their own sense!) All of their margaritas are also done well: not too sweet, and just enough of a kick. They change their featured flavor around on a monthly basis, so be sure to come back to check them out!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4mj5fAQOvias3GprAI85OA"
  },
  "_Y5hI4lMecrnT8zV6O3aJg": {
    "date": "10/18/2018",
    "text": "If you like tacos, good drinks and load music, this is the place.  Love the murals painted on the walls and the friendly service.    You can build your own taco, so you better get it right!  Or you can order from a list of house specialties taco suggestions.  I built my own tacos and had a brisket with bacon and some interesting salsa and a pulled pork.  The brisket had a nice flavor, I think the pulled pork lacked a little flavor but that may be cause I built it wrong.  Anyway a nice stop and your can certainly build an interesting taco.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 18,
      "cool": 14
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "TH9zxohwtrNuIL1TiSNf-g": {
    "date": "10/29/2018",
    "text": "Maybe I'm getting older, but I wasn't sold on Condado Taco. I liked that I had the option to make my own taco, but it felt like something I probably could have done at home too.  It's really loud in here and it makes it super hard to even talk to the person next to you.  I also wasn't a fan of the artwork that included a scantily clad woman with avocados on her top in just the right place to indicate what exactly was underneath. I'm not against that type of artwork but it just felt like they were trying super hard to be, I don't know, cool? So again, maybe I'm just getting too old.  The service, though, was 5 stars.  Our waitress was helpful, friendly, and she seemed to enjoy working there which makes it easier to ask questions when you're new to a restaurant.  Food also comes out rather quickly.  We did go on a Saturday evening when it was crowded and were told they didn't know how long it would take but they would text us.  We went across the street to grab a drink and as we received our drinks, were told our table was ready.  We quickly went back but were informed that because we didn't text back within ten minutes (we arrived in 8 minutes of the text) they had given our table away. So if you do this option, definitely text back or your table will be given to the next party.  I rated a three because I think it's definitely a place you need to try out for yourself.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "agGWDhkVvIHaf8w16jLTng"
  },
  "PQ0q3Su8EwkwfiFO1emWPQ": {
    "date": "10/28/2018",
    "text": "Came here on a Saturday night and surprisingly the wait was not too bad. Was excited to try this location as I frequent the downtown location often. The decor was on point as usual with pretty neat artwork. We started off with some queso and chips. Their queso is one of my favorites as it is the perfect dipping consistency and doesn't taste artificial. We could have used a refill of chips, but I don't think our waitress noticed. Despite it being pretty busy, we got our tacos fast. The tacos were delicious as usual. I love their chorizo as it is quite flavorful. The prices are so reasonable, as you can fill up the tacos with an unlimited amount of toppings, cheese, and sauces. My only complaint would be that the tables are a bit tight. My back was hit by a waiter multiple times. Also it can get quite loud. Other than that, a great place to grab tacos with friends!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "gofnmwo5ptoEnQI47zCBYg"
  },
  "0w1mBdX2CgN6sdXK5smryg": {
    "date": "10/20/2018",
    "text": "Condado came to Lawrenceville! I have high hopes for this establishment  -- a meal here with drinks will give you the same hip and fun experience as other bars on Butler but at the fraction of the cost. Furthermore, their happy hour goes until the much more reasonable hour of 7pm (unlike Smoke or Merchant down the street). For these reasons, I can definitely see myself coming here for a drink and perhaps a small bite or two.   Their tacos are customizable, which is a big plus, but I still think a general problem for this chain is the temperature of the food. The tortillas are consistently cold or room temp and the protein slightly warm. I understand they have to crank out a lot of tacos, especially during happy hour but I think serving slightly warmer food will really enhance the flavor of the tacos and make for an overall better experience.   The art is amazing and the staff is extremely enthusiastic and welcoming. I'm glad they came to Lawrenceville!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "zdpn-MrLT_QPhwJ5-KHKCA"
  },
  "PGfE61jVYSp86RxWpp1IwQ": {
    "date": "8/10/2019",
    "text": "Really cool that you can customize everything on your tacos. Good price too, ranging from $3-$5 each. I liked their dirty queso Blanco half dip, enough for two people. Stephanie our waiter was super nice and attentive to my custom order. It's a bit noisy inside near the front, but the back was all right and easy to carry a conversation",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bS_XfYBhQThv0tPtRj09ZA"
  },
  "jk7gu5zcEE1z17D4kjjneA": {
    "date": "11/9/2018",
    "text": "Delicious.  We love these tacos.  The build your own option is a family favorite.  Since opening in Lawrenceville, our family has been getting tacos to go and eating at the restaurant multiple times throughout the week.  We never get bored with the menu.   The take out service is amazingly fast. Which is great for a family like ours.  I have two young children who are picky eaters. They love being able to pick exactly what they like on their taco. I like that I can order and am able to pick up lunch or dinner for my family 15 minutes later. And everyone will be very happy with the high quality meat, cheese, vegetables, beans, and grains that are in these delicious tacos.   I also am pleased with the interior provisions that the restaurant has. All members of the neighborhood to enjoy dining there. A changing station is located in the upstairs restroom and high chairs are available.  The downstairs and reserved side room are great areas to dine for families and mature neighbors.  The staff and management are warm and upbeat. While all of the establishment is decorated with a fun vibe that is clean and sparkling.   Finding your favorite meal might be the only difficulty! The food is really good and I suggest being adventurous. Try many items over several visits.  Two tacos fill me up. Our family typically also splits an order of nachos loaded with every kind of cheese available, chicken, fresh tomatoes, lettuce, corn salsa, green salsa, and guacamole. They're delicious. And big enough for 2 kids and 2 adults to pick at as a side!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "qBgIv20mEGMuZtylhTz5eg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. I love the family friendly seating and set up at this location. Great neighborhood addition.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qBgIv20mEGMuZtylhTz5eg/o.jpg"
      }
    ],
    "user_id": "Jk0AcqPCVMfc_DTWO3SzwA"
  },
  "YiaxFKXXqvgEwbl1qij7wQ": {
    "date": "7/28/2019",
    "text": "I haven't been to condado in a while and didn't expect too much from this visit but my friend and I said outside with our server Caitlin and she was amazing. We talked about tattoos and work and she even gave us sunscreen to put on! The food was incredible too which honestly was a pleasant surprise. Definitely ask for Caitlin when you go",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FktetW33WyzK2aqsePLuVA"
  },
  "uDBBfGRQeS8PSggYxYmgAA": {
    "date": "4/9/2019",
    "text": "The best taco spot on the burgh! Their happy hours specials are great and what's better than good specials paired with great tacos?! Everything is customized to your liking and you can add basically everything you can imagine to your tacos! The service has always been great and the food comes out super quick!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r35IgvyOy-6A30ieweQUGQ"
  },
  "H5gkzprOo53kpDEumD8-3Q": {
    "date": "7/28/2019",
    "text": "My husband and I tried Condado Tacos for the first time last night after hearing wonderful things about this new amazing restaurant. And let's just say it definitely did not disappoint and we are already planning on returning this week to try some more of their crafted tacos. We were able to customize our own tacos to try multiple combinations as well as try some taco suggestions. I tried their taco if the month which was a Burger and Fries taco. Delicious. In addition to making my own. Fresh, well seasoned ingredients made for the best tacos we've had. We even had the choice of several shells that are unique to Condado. My husband loved the spicy hard corn and the JuJu that was a combo of hard and soft filled with more goodies. And don't forget about the cheesy white queso that left us regretting only ordering a half portion. Again-delicious. So if you are looking for great service with extremely tasty food and drinks, you should give Condado a try. It will not disappoint!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e6jt2_C2pqK35eIcJt5Qgg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Custom tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e6jt2_C2pqK35eIcJt5Qgg/o.jpg"
      }
    ],
    "user_id": "vSuUGQQiFMqAjmejodAYrg"
  },
  "z79dpEP4_dexHGaUwuOeqA": {
    "date": "2/26/2019",
    "text": "Two things combine to make this a great choice for a taco adventure: fun bar/main room, and solid tasty value.   Tacos are much larger than every other taco establishment I have visited in the city. They include a lot of meat, and the sauces are delicious.  The shells are very fresh, and some have a delicious soft/hard shell combo.   The value here is excellent. My wife and I each had a draft Mex beer, a taco, and shared some chips and wonderfully  spicy homemade salsa. Our bill was something like $19.50. Try pulling that off at other nearby establishments!  The bar is decorated with funky murals. Staff is pleasant if not super chatty/friendly. We have decided to make this our new go-to spot for semi-regular, solid value outings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Pzpkx0tCdCORANffdF5rGQ"
  },
  "A9uyAHvn7KJF5sM3LEEI3g": {
    "date": "7/23/2019",
    "text": "It was difficult getting through the narrow bar to make your way to the back room. The tables were too close for my comfort. The margaritas were good. The tacos were fair, decent amount of meat and lettuce. Exiting was a task, the narrow set up makes it impossible not to bump into anyone. I will not hurry back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SY8kU4kFBDekW-Q0F1Ld1g"
  },
  "5gFxinO5DAaqyWwcp-ob9Q": {
    "date": "8/31/2019",
    "text": "I ordered online, which said 15 minutes to pick up. I got there about 20 minutes after ordering. My food was not ready, which was okay, but I ended up waiting for a very long time. I waited a while, and asked if I could cancel the order if it hadn't been started because I had people not getting good waiting in the car. The hostess got a manager, who went in the back to do something. I then got a text saying my order was ready. I thought he was going to bring out my food, but no. Ultimately I waited over an hour, to leave with no food. I was given a gift card for another time, but I am here on vacation and live 9 hours away, so I will never be able to use the gift card. The staff kept telling me the kitchen was 30 minutes behind, which I understand, but there were 5 take out orders being waited for, and they were not even started.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hkLoHVCb25KRn3CoNmS_UA"
  },
  "FefbhdH_unUE3_5vIyWGNA": {
    "date": "5/6/2019",
    "text": "Lively atmosphere, friendly and attentive staff, strong drinks and custom tacos!  The prices are reasonable, the quality is on point and you can have exactly what you want on your taco/nachos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gm-kEiEsSk_92_kr_6ln1A"
  },
  "7DZrQMILy1ybQ22B1zzKBQ": {
    "date": "4/17/2019",
    "text": "Everything was cold.  Got pulled pork, chili lime steak, and chicken with various toppings/shell combos and the flavors were indistinguishable.  Taco of the month was only remarkable because the blue cheese clashed with the Cajun seasoning on the shell.  It's an overpriced, overhyped Taco Bell quality of food.  I'll keep my $3 Las Palmas tacos with hot, fresh proteins and their self serve topping bar from now on.    Much better/bigger bang for the buck.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ppxumUWp3KWgxsbv3W_sdg"
  },
  "uZQpUK36HZNgwUZV1lznbw": {
    "date": "2/28/2019",
    "text": "The service left a bit to be desired, in all honesty. Our waiter was a very talkative fellow, and while pleasant, didn't seem to understand when he was crossing the line from interestingly sociable to downright annoying.   The artwork and ambiance is quite different from what I was expecting. This place is every bit what Lawrenceville is trying to be. It's trying to pull off an effortless sort of cool that is honestly kind of tacky-- it's all too bright, too loud, too much. I did like the small, communal tables, though. It adds a touch of intimacy to an otherwise painfully self-aware establishment.   The food definitely made it worth the chatter. The nachos I ordered came piled high with chicken, cabbage slaw, salsa, and this incredible cheese sauce (annoyed because I can't quite remember the name). It was delicious and my only critique would be to add more of that wonderful cheesy goodness. I also grabbed a few jackfruit tacos and was pleased by them as well!   Altogether, it was a good time and the food is probably what will bring me back here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lmDX0nZc31weS74V0HwZCg"
  },
  "CC7jL7btdUpfA5l9rNWKCQ": {
    "date": "7/16/2019",
    "text": "Good tacos.. and really cheap with large portions compared to most taco places I've been to. Large menu with the choice to fully customize a taco to your liking. Always excited to stop by here. I thought the tacos were somehow better made here than the downtown location but that location is good too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c8S6S68FGQYiFaB-kpujOw"
  },
  "iOHuov56NX0pdPG-1ziVEw": {
    "date": "4/12/2019",
    "text": "Best tacos in Pittsburgh!! Amazing service! We had drinks and enough food to take home all under 45$. Plus the kids love how cool it looks on the inside",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vfX2iHDbLBe-kdenkHLhCw",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vfX2iHDbLBe-kdenkHLhCw/o.jpg"
      }
    ],
    "user_id": "CqyGF4QvMTd9zv-84-eEfA"
  },
  "1GybRbE7FnniBmHEu4CKgg": {
    "date": "7/11/2019",
    "text": "I love everything about Condado. The location is great, the decor is really fun and interesting, and while it's not huge, it doesn't feel too small or claustrophobic. The last time I went it was a really nice day, they had the windows up, and it was a great time. I like the make-your-own options for the tacos, but honestly, I always go with the suggested tacos, because I could never come up with a taco as creative as those can be, or as delicious. Also, I highly recommend the elote queso. *chef's kiss*",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nCwb_yBnF5qU9nq0q6O0Ww"
  },
  "r-m1Do5sEvVwa4ZLaUbzYQ": {
    "date": "2/22/2019",
    "text": "This place served soggy tacos worse than da bells. Also, beer in plastic cups was lame. Not sure the attraction to this place. Only giving a two because prices are good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UqgEOWZl9h5YLyoJRurJsA"
  },
  "XP9AYlPC8_rhAQua8cYZPg": {
    "date": "7/4/2019",
    "text": "Really nice ambience and decor. We are vegetarian and they had a lot of vegetarian options on the menu. We have been to a similar restaurant in Boston and loved the idea. Fusion street style tacos are our thing. We liked the preset taco options there were 3 vegetarian ones we tried 2 of them. My husband loved the pulled jackfruit one and I loved the mushroom one. Was perfect. Chilli tofu was okay. Just dry and lacked flavour. The sauce options are amazing. Love it. I think it was slightly on the expensive side. So I would suggest to go during happy hour as the tacos are $1 cheaper. They have some specials during July month which looked good but there wasn't any vegetarian options in that. Also we got a side of guacamole and rice and it wasn't anything special.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PCRQ721-08NKKZm5PoBMsA",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PCRQ721-08NKKZm5PoBMsA/o.jpg"
      },
      {
        "img_id": "IwGBw8vl6qp4W2LaL8nt9Q",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IwGBw8vl6qp4W2LaL8nt9Q/o.jpg"
      }
    ],
    "user_id": "QN8H1SirFeOr9npIR2ahWw"
  },
  "GEIqps0SNQ23Kcw6wLyk7Q": {
    "date": "11/15/2018",
    "text": "It is my favorite spot to get tacos!! The Skywalker nachos with added steak and pulled pork is my number 1 favorite",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sCEDgmeuuayME55QFuLuvg"
  },
  "0q5PTWRWMgy9phixaibgug": {
    "date": "11/11/2018",
    "text": "Great food, staff, and atmosphere! The guacamole was delicious, loved the Thanksgiving Tacos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Xi3qdnTl5pp9nmBRVYy5Q"
  },
  "4O23SSv36_OXfyyI-Qsecw": {
    "date": "4/12/2019",
    "text": "Best food I've had in Pittsburgh since moving here in August. Tacos were awesome and the customization makes the options endless! Would highly recommend Condado Tacos to anyone in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ljSjND4AMD6439-8A6R0Kg"
  },
  "CwqTagKjALV2p2kyEuyTSA": {
    "date": "10/31/2018",
    "text": "We took our family of 4 here for dinner on a Tuesday night. We got there at about 5:45 and they had just sat their last table for Happy Hour. We only had a 5-minute wait until something opened up. We could have been seated immediately downstairs, but then the happy hour specials (1/2 off house margaritas, $1 off tacos) don't apply. Happy Hour is 5-7 pm. The jalapeno margarita was outstanding! We ordered the Tres Amigos and got blanco dip, chorizo dip, and pineapple salsa.  Tacos are MTO - you fill out a sheet and select all of the fillings/toppings/sauces that you want. I ordered chorizo and pork tacos on soft tortillas, and both were excellent. They made a simple cheese quesadilla for my daughter (off menu) and she was thrilled. Our service was really good despite the restaurant being absolutely packed.  Highly recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nMB1JKgBpZf4CE4k77ezqg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Jalapeño and Blackberry margaritas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nMB1JKgBpZf4CE4k77ezqg/o.jpg"
      },
      {
        "img_id": "Ajx8XLTe2oQfU_Sy14vL5g",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ajx8XLTe2oQfU_Sy14vL5g/o.jpg"
      }
    ],
    "user_id": "ZuhOfEF3fCKztYDELbwBTg"
  },
  "JTXXLeE94EbUU2IZ0_g5Sg": {
    "date": "2/18/2019",
    "text": "Great bang for your buck! If you want a quick meal and drinks, no better place for it. I love how you can make your own tacos. The bubble system they use is great and they come out perfect every time. Also ask to sign up for their points system with a credit card and earn points every time you eat there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W_RA_Jr0Aabu9fTyuEBjUA"
  },
  "eE0bxLc8kXPQ5KCTAyrwYQ": {
    "date": "2/2/2019",
    "text": "It was our first time to Condado (the Lawrenceville location) and it was amazing!! The bartender recommended great drinks & the tacos we chose were awesome! The spicy margarita was so good!! Go there! You won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CfCfO-V3ZgNJXdZYdKWc4g"
  },
  "gDpFygiQEC9ZQWdqnfDQ_Q": {
    "date": "12/27/2018",
    "text": "Worse-than-average-tasting tacos, incredibly loud space, offensive decor. Don't know what is so special about this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Im8vAPO3TL31IwaiKVj9Cw"
  },
  "SY4pSM6-paQ26zJ7vFiQXA": {
    "date": "10/17/2018",
    "text": "Delicious tacos. I also had a rice bowl with chicken, salsa verde and other yummy stuff. The atmosphere is bright and festive. The wait staff are friendly and very helpful.  I definitely recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vCeqw0yQgeEIiC7cK-1i9g"
  },
  "rbbZrRbgjviz4IH2EADm9w": {
    "date": "12/29/2018",
    "text": "I'm a frequent taco eater and cannot get enough of a good margarita. I've dined at the downtown location a handful of times. The first experience was less than average. The margaritas tasted like chugging a bottle of simple syrup. The tacos were average nothing special or fancy. The service was the worst of the entire experience. Wouldn't recommend for a large group or those wanting good drinks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2480GO2mRTiFvH8cwefEDA"
  },
  "nGyFN7zumVoSGl9xrtfVEQ": {
    "date": "2/4/2019",
    "text": "Solid place to grab a bite! Very unique idea and I have to say well executed. It is very artistic inside. Very good food. If you wanted a salad you will have no luck, they only sell tacos. With that being said they still have a variety of vegan and vegetarian options, and even show the allergens. If you have ever gone to Burgatory it is the same concept but for tacos and better executed. I have one gripe, and that is that I ordered two tacos but they gave me one, but I got a new one that was better. Overall great place to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "agK_53eVu9CWscfzhctkfg"
  },
  "7sWIRTsWq6CTM4EdJa_ICQ": {
    "date": "12/29/2018",
    "text": "My first time at Condado Tacos and it was great. Even though it was super crowded, the service was excellent. Happy Hour made it an even better value. I would recommend this place to friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C49FGofhvMItiemdk-d9cw"
  },
  "9WmFdJciDEEoh9ElhiX05w": {
    "date": "11/17/2018",
    "text": "Good food, great vibe, MUSIC is too loud!!!  I'd like to be able to hear my friends without shouting",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a4Fbd-IUNPGeRDfyNLN5sA"
  },
  "FtKC0q3ZF2BkO3Ua4C-Gdg": {
    "date": "12/7/2018",
    "text": "Good drinks, great food. Amazing and affordable! It's so nice to have a place like this downtown.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ypyh--o11_lWw8N3gj_rCw"
  },
  "8uah2Ols0MoLpPOeEqmnyA": {
    "date": "11/13/2018",
    "text": "This is the second time I have eaten here and I can't say enough about the quality and freshness of their tacos.  They are quit simply the one of the best in the city.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fSQWciHbwshJGbNv9Gcayw"
  },
  "9-N4Yy5Zve8DsHvVkD1wwQ": {
    "date": "10/26/2018",
    "text": "Great service. Tacos are fantastic. Server was very helpful we ordered recommended on menu and made some of our own. Good portions on all tacos. We will make it a regular stop.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TwXr97ZYnPp5HTRUyADjWw"
  },
  "4YsGJ0v5LzpFVH595ljX4g": {
    "date": "3/7/2019",
    "text": "i have been to both condado locations a couple of times and i have to say i like the larryville locale better-a little bit of a chiller vibe. great hh food and drinks! also food/drinks are really reasonably priced all the time so honestly if yr not a huge marg fan (like myself) its a better call to go outside hh time (when margs are half off and tacos are a dollar off- drafts are a dollar off i believe) as it can get pretty wild. highly recommend the build your own nachos!!! they come out piping hot and cheesy wirh yr protein of choice-portabella mushroom yum! also i have always had really good servers but tonight our server was above and beyond- Austin took care of me and my friends and he was extra welcoming and friendly and attentive!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hkp5vEq8tc-_eOucy3CROA"
  },
  "gLrIwddsay6oKVL0OKLczA": {
    "date": "10/19/2018",
    "text": "This place is awesome. Great Taco's  and a really cool environment. Their queso is probably the best I have ever had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1BxgALFhPNc7oRghVwkGUA"
  },
  "Ra43UG0NkHi8MQDRd7ASlA": {
    "date": "3/29/2019",
    "text": "I love Condado - it's one of my favorite places to grab a bite to eat. The chips are bottomless, the taco's are highly customizable, the margaritas are some of the best in the city, and everything is reasonably priced. Not to mention, Condado is allergy and vegan friendly! I honestly didn't think Condado could get much better until I visited the Lawrenceville stop. The interior is beautiful with great lighting. You don't feel too close to other people even when the restaurant gets busy (which I found in other locations). Not to mention, the wait staff is excellent. I 100% recommend Condado to anyone looking for a good taco or an excellent happy hour! Side note: if you come around peak hours, there will likely be a wait.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lfOV31vusOnXmz3T87JtDA",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Lime Margarita",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lfOV31vusOnXmz3T87JtDA/o.jpg"
      },
      {
        "img_id": "fz7xo0tp8fchYsPyXTNsDg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Dutch Dragon, Chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fz7xo0tp8fchYsPyXTNsDg/o.jpg"
      }
    ],
    "user_id": "VdVb5Eipk1B5uupaC3J_0Q"
  },
  "8-KkVrkuJ6s1cYRXHHmRZA": {
    "date": "3/29/2019",
    "text": "Condado is probably my favorite place to get tacos in Pittsburgh. They're build-your-own style is so much fun and the food is AMAZING. Happy hour is a great deal, half of marg's and dollar of tacos.. wow!  My boyfriend and I took advantage of the happy hour specials and each got a strawberry margarita. They only serve them on the rocks, which is preferable for me but not him, however they were a good balance of fruit and tequila tastes.   We then ordered the blanco queso. It was fantastic, and comes with endless chips (if it can last that long...). We each opted to create our own tacos and were incredibly satisfied by the size and flavor of them. The set-up of the Lawrenceville location is really nice.. it allows for more comfortable seating and it's a lot quieter than the downtown location. There is also more space so less of a wait.   Overall, honestly might be my favorite restaurant in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IlFVXFwX-VEf-c9m5AQs8g"
  },
  "w_UpnRcR0oonJgB1BsXUcg": {
    "date": "4/3/2019",
    "text": "This place was just OK. The environment definitely fit the Lawrenceville aesthetic (hippie, young, vibin'), but the food was just average in my opinion. Tacos weren't that cheap, albeit was cool they were 'build your own' style. I also wasn't particularly surprised by anything, and the dips are pretty pricy. Parking (street parking) is pretty much near impossible to find on a busy weeknight or weekend.   The good news is you can join the waitlist from yelp! The bad news is that sometimes it's pretty inaccurate. I was 'late' for my spot and found there were still parties ahead of me who haven't even been seated yet.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cx6QIU9RAxBc96uxsbyNbA"
  },
  "8mx4uPit4k9SfZJvXM0dAA": {
    "date": "2/11/2019",
    "text": "I stopped by here yesterday with my wife for lunch.  We had both been past Candado Tacos before and so decided to head over here whenever we had time for a Sunday brunch.  The inside of this restaurant is sort of deceiving as the area you walk into is the bar area which also has a ton of high top tables.  As we walked in I was hoping that they had enough room to seat us but I shouldn't have been worried as they have another dining room down a hallway.  This room was decorated with a mural (like most of the restaurant) that was soothing with its purples and blues.  For lunch on this day my wife and I decided to start off our meal by splitting the pineapple guacamole.  It came out somewhat quickly and was really good.  The tortilla chips were clearly homemade and tasted quite nicely.  Meanwhile the guacamole had a good consistency and flavor to it which I think was helped by the sweetness of the pineapple.  Then for my entree I decided to make four of my tacos which would end up being entirely too much food for me.  In any case for my first taco I went with a firecracker shell with Thai Chile tofu, fajita peppers, lettuce and chihuahua cheese.  Taco number two was a flour tortilla with bbq jackfruit, jicama and cabbage slaw, queso fresco and corn salsa.  For my third taco I chose the  shrimp ceviche on a flour tortilla with fajita peppers, the smoked cheddar, pineapple salsa and Mexican chimmichurri.  Then my last taco consisted of the fire cracker shell with ghost pepper marinated skirt steak, jicama and cabbage slaw, queso fresco, salsa verde and cilantro lime aoili.  On the side of all of this i got their three hottest sauces: mango haberneo, candado secret taco sauce and dirty sauce.  Now if you made it through all of that I imagine you realize I had a ton going on with each of the tacos.  So let me say that I enjoyed each in their own way but I think that the steak one with the firecracker shell and the jicama slaw was my favorite.  Out of the sauces I really enjoyed the Mexican chimichurri as well as the dirty sauce, the latter of which i put on everything.  At only $3.50 for each of them I thought it was a good price and as mentioned before I was only able to eat two of them at Condado and finished the last two at home later that night.  The bottom line for me is that I would head back here again in the future.  Condado has a huge list of ingredients to make your tacos from and if you don't want to do that, you can choose from some premade ones as well.  Both our guacamole and the tacos were good and I look forward to patronizing this business again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "UFbT5yyvWtyK5XUIEgwrew",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Shrimp ceviche and ghost pepper marinated steak",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UFbT5yyvWtyK5XUIEgwrew/o.jpg"
      },
      {
        "img_id": "8_SBErHBzK4k2D9BCChJAQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Thai Chile tofu and bbq jackfruit",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8_SBErHBzK4k2D9BCChJAQ/o.jpg"
      },
      {
        "img_id": "-VVMp67jpdE8Zrv6IYY6Og",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Pineapple guacamole and chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-VVMp67jpdE8Zrv6IYY6Og/o.jpg"
      }
    ],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "1onLnfAQvPsb7-A_wscvbw": {
    "date": "9/1/2019",
    "text": "The food is always great. My only complaints are how loud it is and the shared seating",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X-_5cwy5TWXsyQHayf6aVg"
  },
  "QBhQacqb0HOn2L5zZJpaog": {
    "date": "3/23/2019",
    "text": "I love the Downtown location and this one is just as a good. I went around noon for lunch and it wasn't too busy. However, as I was leaving about an hour later it was getting pretty packed. I always recommend the blanco queso and the a taco with the sweet Lucy shell. I didn't really think a Lawrenceville location was necessary but I'm glad it's here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c86aARDzs929syJ1kjoqHQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Mango Margarita (tied with Peach for my favorite)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/c86aARDzs929syJ1kjoqHQ/o.jpg"
      },
      {
        "img_id": "BgqMq-UT8o47j6c_rvfVng",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Blanco queso, salsa, and chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BgqMq-UT8o47j6c_rvfVng/o.jpg"
      }
    ],
    "user_id": "uKNH69DumrRvm8Ugq6yX3g"
  },
  "44tyAqKZS0ikev-OZGboTQ": {
    "date": "8/30/2019",
    "text": "We are from out of town and happened upon this place while we visited Pittsburgh. We went during happy hour so tacos were 1$ off. We were so pleased with the food that we actually visited twice during the few days we were there! We chose to sit inside the first time and that was a mistake. It was extremely loud and crowded. You are sat at long tables with other people and you could not hear the person across the table. We created our own tacos and they came out in a decent time. The tacos were delicious. Definitely the best tacos we have ever had! The second time we went, we chose to sit outside where it was not loud. The only thing was the waitress took awhile to come out to take our orders and we never got drink refills. But because the food tasted fresh and flavorful we would recommend this place to anyone! Get the JU JU taco!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jB8SZ-i009oiQAH6mSqtJg"
  },
  "FKk1MGElxXo4v8x7oDwZ1w": {
    "date": "2/16/2019",
    "text": "Having been to the downtown location, I was excited that they decided to open another in Lawrenceville. The decor was fitting and apparently all of the artwork is done by local artists, which I love! The atmosphere is loud and hip, a lot of young people chowing down on tacos. We were seated in the downstairs part, which we didn't mind. However, the one thing I didn't like is the way the tables are set up. We shared the table with another couple and I just thought they were a little close to us, but it wasn't a huge problem!  The Happy Hour is by the far the best part, $1 off tacos and cheap margaritas, you can't beat that! I definitely recommend going during this time because you get the most for your buck.   As for taco recommendations, if you like pulled pork, the Bubba Kush is the way to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVA0taHyfAR-B4n-cUoYxQ"
  },
  "X40EnrQKm7FTQw7N3woUpA": {
    "date": "2/10/2019",
    "text": "First time stopping by the Lawrenceville Condado location, and it's pretty much what you expect. Good tacos and a good selection of drinks. Came on a Friday night, and it was packed. My group reserved a table about 30 minutes in advance of arriving. It really helped with the wait time.  It's been a while since I've been to Codado but was pleasantly surprised to see they added eggs and bacon to the menu. Breakfast tacos whenever you want. (Of course that's what I had to order).   I'd also highly recommend the Banana margarita. A friend recommended it a while back and I'm hooked.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DvFDfCst0pWyvjG-xkWFTQ"
  },
  "4kdLhOQdXDoGk1IrtMzejQ": {
    "date": "1/6/2019",
    "text": "I soooooo want to give this place 5 stars, but there is a very important reason why I didn't.  It's the ordering / variety of their \"build your own\" style of menu. While some diners may love 48,000 degrees of freedom, I'm often perplexed with menus that are seemingly like something Willy Wonka would put together.  Clearly, this style of menu and ordering works well and the chain is successful - we'll be back, of course, but it was taxing in a loud, colorful space with my whole family looking at me to help them build their tacos. In the end, everything was SUPER tasty and very fresh, so it was time well-spent, but for those 10 minutes, it was stressful!  Our waitress downstairs (they have seating in the basement) was exceptional, and really made the effort to streamline things and help get us settled in. They have a gargantuan drink menu as well, so be ready to sift through that!  Chips were delicious. Perhaps TOO delicious, as they fill you up while noshing on their \"guac of the day\" whilst filling out your taco ticket. Salsa was on-point, too.  Tacos were great - chicken and pork carnitas were good choices, and I loved the shrimp ceviche, but lamented the miserable paucity of shrimp in my taco - I'd rather be charged more and get more for a more expensive ingredient than have a teeny tiny teaser of a sample hidden in my taco!  OK, I hope you kept reading, because the bottom line for this place is that it is an amazing place to come and get some absolutely delicious street tacos with top notch ingredients and lightning fast service. Even with all of my micro-dissection of our experience above, we WILL be coming back for more, and very often!!! I'm sure next time, I'll bump it up a star... once I get used to that dizzying taco ticket, that is.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "4r33dXcE1oYZxjONrhxTiA"
  },
  "wKy-Gjj_4oLp_xXoJ8hNJQ": {
    "date": "3/28/2019",
    "text": "Cool space and vibe but underwhelming taste. I love the idea of totally customizable tacos but the meat has always been a little tasteless. Their margarita flights are what keeps me coming back. I have tried the chicken, beef and shrimp. The shrimp is the only meat that had flavor and only because it taste like shrimp...  The taco shell to get is the combo one of hard and soft shell- game changer. Also their guacamole and salsa options are pretty tasty. Some are a little strange- one of the guacamole's has grilled peaches in it. Worth a try but wouldn't go back just to try that.   Fun for a good night out with cheap food (each taco is like $3-4) but I would not recommend if you want to be overwhelmed by taste.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1aoKJdKP934v_GetgrP3IQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1aoKJdKP934v_GetgrP3IQ/o.jpg"
      },
      {
        "img_id": "rGD7L7djBneGTHXYkTSIXA",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Inside art",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rGD7L7djBneGTHXYkTSIXA/o.jpg"
      }
    ],
    "user_id": "Jxa62HNYqSdqs_u2uEpOdQ"
  },
  "k5K1cXJuqZqM_KnpLgEsiA": {
    "date": "2/25/2019",
    "text": "While I was sad to see Tender Bar close, this was one of a few spots that I couldn't get mad about opening up in it's place. The downtown Condado was a new favorite hangout of mine and it was nice to see a second option appear close by. For the record, I can't find any discernable difference between the two locations, but maybe someone can correct me if that isn't the case.  It's a trendy place, dimly lit, with a Mexican Day of the Dead theme and decor to match. Two floors of seating. It always feels decently crowded, but I've never waited long for a table.  For your tacos, if you've been to Burgatory, it's the same setup. You get a checklist and make a completely custom order. There are numerous options for your choice of protein, toppings, cheeses, sauces, salsa, and even down to the shell itself. Chorizo and ghost pepper marinated steak tend to be my favorites. The guacamole and queso are worth ordering to share at the table and other sides are available as well. They have all your basic Mexican and domestic beers by the bottle and draft, with a few crafts on tap also. Several options for margaritas (even by the flight), specialty cocktails, and a good selection of tequila and mezcal round out the drink choices.  This place is hip and contemporary but still very casual. I know I can come here for good tacos and the complete customization aspect means I'll never get tired of the choices. That's what keeps me coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y-ffoQAiDQKMKCJ9q_7sGg"
  },
  "Q3xD4fCUlvCoSkx4GACLQw": {
    "date": "12/27/2018",
    "text": "I first tried Condado at the Downtown location and then it was like a gift when they opened another here in Lawrenceville. First, this location is fantastic and super artsy. They left no wall blank or unpainted, and it's awesome! The space is bigger than it looks from the outside; there's another dining room in the back. It could be perfect for a party or company gathering. These tacos never disappoint. I love trying the different proteins and cheeses. The queso blanco is delicious if you want to be the odd person out and just get chips and queso. I fully recommend the margarita flight. If you're like me, you easily get bored with the same flavor of margarita after awhile. With the flight, you can choose 3 flavors. I never had a banana margarita before and it was actually pretty good! In short, the tacos are great. The space is awesome. The staff is friendly. Go here. Now.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "4-B2GWLIXUhUbsVYgH3T1A",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Love the art",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4-B2GWLIXUhUbsVYgH3T1A/o.jpg"
      },
      {
        "img_id": "nioKjpcDH4xOsAZPJIOQDA",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Queso Blanco",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nioKjpcDH4xOsAZPJIOQDA/o.jpg"
      },
      {
        "img_id": "KROscdJgnKC1LxIqgT03Eg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Margarita Flight: banana, blackberry and strawberry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KROscdJgnKC1LxIqgT03Eg/o.jpg"
      }
    ],
    "user_id": "UyXqGEKod-veD6m6Hq0EDw"
  },
  "8FpEaOhOwSSaUf_oQFiRmw": {
    "date": "12/23/2018",
    "text": "Fun environment. Despite the disappointing tacos the place is super cool and the staff is great. Four stars is for the cool environment and the hope that the tacos get better soon. Otherwise this place would be three stars at most.   Definitely just mediocre tacos for drunk people. The art is cool but the tacos leave a LOT to be desired. Traditional tacos are flavorless. Corn tortillas are dry as hell. They need to be warmed up on a flat top or cooked fresh. All of the tacos we have were a bit watery. The pork belly taco was decent, but in general the textures were off. The elements didn't blend together nor did anything particularly good stand out. They were just... Okay ish. At least they were pretty big...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7dOhZyyfEGis9l9NRBacEg"
  },
  "UK05bDmnTXNjosNRM77AUw": {
    "date": "8/13/2019",
    "text": "Been here a bunch of times in the afternoon. Great food, great selection. Good painting artist  Also, they're open late!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "upOloGWJC7UlBwigYoDnNw"
  },
  "PzvYiAdACNIYVqa9c_Slog": {
    "date": "6/28/2019",
    "text": "Went during happy hour, got a really good marg and guac.  The problem - got two of the breakfast style vegetarian tacos. No spice level listed. Apparently they have the 'dirty' sauce on them, which is the HOTTEST sauce they offer (found this out by checking the 'build your own taco' menu, a completely different thing then what we ordered off of.)  After two or three bites, I was DYING. So spicy I couldn't breathe. Sweating, nose running, etc. Wouldn't go away even with guac, a marg, and two full glasses of water. The kicker? I have stomach ulcers that make eating spicy food completely unbearable for days. I only had a few bites before the burn, but this could make someone (me) really sick not knowing what they're signing up for.   I want to like Condado and the guac and margs were great, but the sneaky sauce ruined it for me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FdWGCMbx3-Y2G_TkO_gG6A"
  },
  "s52BmQ62GtxHTjVnZIEFkA": {
    "date": "5/16/2019",
    "text": "This place is just A-OK. First, I will say their prices are incredibly reasonable. Tacos are very inexpensive and with the menu being so vast, the options are endless. However the prices are reflective in the quality of the food. Looks can be deceiving. I've eaten here several times now and love the ambiance, wait staff, and drink selection, but the food doesn't do it for me. Watch what toppings you request because I've have food served to me cold as ice, with the waitress just saying it's the chilled toppings. Recently the tofu bowl came out as if ordered from a kid's menu, miniature sized, with two pieces of tofu and browned lettuce. They do have a ton of vegan and vegetarian options, jackfruit, portabella mushrooms, and tofu to name a few. Be mindful if you order chips & dips they'll top the salsas with cream or cheese. Great spot for happy hours (only select floors of the restaurants) or late night food given their kitchen is open late. These restaurants drawn insane crowds! Love that the Lawrenceville location features all local artist's work on the inside.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P5SYQPtJXjh_wOZ6jwLAMQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. They now have bowls!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P5SYQPtJXjh_wOZ6jwLAMQ/o.jpg"
      }
    ],
    "user_id": "HdEM0xeldw4QAweECyOwcQ"
  },
  "8UkAsNQ6CCwAFYnB12ebIg": {
    "date": "12/8/2018",
    "text": "Safe to say that I am a huge condado fan!! I've been going to the downtown location since I moved to Pittsburgh and condado is one of my favorite taco spots in Pittsburgh. The opening of the Lawrenceville location has been AMAZING! We went to this location for happy hour and had no issues getting a seat whereas the downtown location we would have to fight for one. The service was great and the server was super friendly. The November guac and queso specials were soooo good and the tacos are always amazing AND cheap! ilysm condado",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3TEwd3nJrg_-pzKe5HGDmg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3TEwd3nJrg_-pzKe5HGDmg/o.jpg"
      },
      {
        "img_id": "X9NDah_R1Zd-YrcYuFwRkg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/X9NDah_R1Zd-YrcYuFwRkg/o.jpg"
      }
    ],
    "user_id": "6BnvEluqfazShd1tg9kqGg"
  },
  "sR6Vctn0nEefyoAMMO0mcw": {
    "date": "8/9/2019",
    "text": "I came here yesterday with two of my friends and my fiance. We arrived during happy hour. We each got several tacos, and they all got margaritas. We all thought the food was excellent. The tacos may look small, but they were very filling. We were all stuffed afterwards. We would definitely eat here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gfhpetcLLWHO6tbZQaFzyQ"
  },
  "gKj_QNdXDLbmYqcYSwWN3A": {
    "date": "11/15/2018",
    "text": "I want to like this place. A lot of my friends do but there are too many lows compared to the highs. First, location is great. It's in the hip part of town with a small pay parking lot next door. Very convenient.  The decor is urban, bright and fun. I love it.  The tables are family style. All high tops. Its cramped. No place to hang your coat or put your gloves. I do love that they have plenty of small hooks to hang your purse and scarf.  The staff is a mixed bag. Love the bar staff and host was lit.  Our server was lame as hell. I asked for more details on the taco of the month, the Thanksgiving taco.  He told me it was like Thanksgiving dinner in a shell.  I have no idea if the Thanksgiving dinner included mashed potatoes, cranberry sauce, gravy.  So I moved on and asked about the California roll guac. He told me it was basically like a California role in guac.  No shit sherlock...can you elaborate a bit? Or even tell me of its awesome. Lol. I was gonna ask about the grilled cheese queso and the blueberry maple margarita but I learned my lesson.  We got queso dip and chips. The dip was good. See the pix of the chips. The sheen is from the oil. You can just guess how well the salt stuck to the chips....it was kinda gross.   My dirty something taco- one the suggestions menu- was great.  Absolutely a highlight.  I took a gamble with the egg taco.  It was hella bland. A total low.. Finally I got the skinny skeleton. It was just okay. Not worth the 8 bones. The place was packed. Had a good enough vibe. You might like it. I wont likely go back any time soon. Too many other superior choices..",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7jZZftO_aT8B456SZf57Yg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7jZZftO_aT8B456SZf57Yg/o.jpg"
      },
      {
        "img_id": "dhenaxOaX1bdzK3SJhEbCw",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dhenaxOaX1bdzK3SJhEbCw/o.jpg"
      }
    ],
    "user_id": "SHyWxJxb-mKiNgHPUSu3_g"
  },
  "sb0sBo-uHl_NR6BidvaveQ": {
    "date": "5/6/2019",
    "text": "I absolutely positively am upset that Condado Tacos took over one of the best bars in the city. However, if I could choose anything to take it's place, I guess I would hope for a good taco joint!  Condado continues to be my favorite taco spot, because of all the options! Their prices are affordable, and there are pretty much unlimited toppings. I love the other location downtown, but this location is nice as well. There is a parking lot right next door, and on street parking as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "q7kb0GVCWOdORhOrRfkxbw"
  },
  "udDNnVwmV1vq8ObF4GTC7Q": {
    "date": "7/28/2019",
    "text": "I love the build your own taco experience. It's fun to come up with a different combo every time I go. I love the honey chipotle on any taco. The drinks are always good too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f9-RjaI3UDgzeIGqaqM3_w"
  },
  "pZQAHWiFRqYadENTyXQEug": {
    "date": "11/8/2018",
    "text": "On the plus side, Condado has late hours and really good food. You can choose from a list of tasty options or build your own.   The decor is very cool, they let a creative artist go wild with cartoon inspired wall murals.   I loved the European style billing, your credit card never leaves your sight, and you pay at your table on the spot.   But what about the annoyingly over-cool music? I'm glad I'm not the only reviewer to mention it, because it's much too difficult to have a simple conversation.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 12,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "g17Cn6QN3QR9mCUCHcSYlg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. 2 veggie tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g17Cn6QN3QR9mCUCHcSYlg/o.jpg"
      },
      {
        "img_id": "tjkDLhSsI_PY4c79WG43Eg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tjkDLhSsI_PY4c79WG43Eg/o.jpg"
      },
      {
        "img_id": "0dLFqhAongKwlGRZyioByA",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. SKYWALKER",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0dLFqhAongKwlGRZyioByA/o.jpg"
      }
    ],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "8FC6toczy-4pPfOFpBCS4w": {
    "date": "11/11/2018",
    "text": "This was my first time at Condado. They are on the NoWait app so you can put your name in beforehand. It was packed and they were playing loud music. It was a fun vibe for a Saturday night.   You can build your own taco or order from the menu. I ordered the chorizo and the thanksgiving taco. I would give the chorizo taco a 3 out of 5 and the thanksgiving taco a 5 out of 5. It was tasty and filling yet not too much. I will definitely be back here!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "qXH33niWN2UxVB-MueCNDA"
  },
  "M-AJq0zwMdvsGfXhpSNQJw": {
    "date": "12/1/2018",
    "text": "We LOVE CONDADO, and this time was no exception. This was our first time at the one in Lawrenceville. The art work is so different and so unique to each place.  We started off with the day with a pitcher of the Maple Blueberry Margarita. Then we ordered the quest of the month which was \"Grilled Cheese\" queso. It was magic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jvcnihxmubySE8WJVQTd4w",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jvcnihxmubySE8WJVQTd4w/o.jpg"
      },
      {
        "img_id": "r1o_pBEXcf4BM3QzptIEmQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/r1o_pBEXcf4BM3QzptIEmQ/o.jpg"
      },
      {
        "img_id": "GIwf2gb1XDh0FCEgRHdtjg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GIwf2gb1XDh0FCEgRHdtjg/o.jpg"
      }
    ],
    "user_id": "YxxIO3hZ10rMWtModKb9hg"
  },
  "nx0Owc35ZA-OlaUhHO4J6w": {
    "date": "11/20/2018",
    "text": "OH MY.  Went to the Lawrenceville location for lunch last Friday afternoon. Not overly packed and we were able to grab a seat immediately.   We ordered over $40 dollars worth of tacos for 2 people. Ha! I got the veg ones: the thai tofu and the bbq jackfruit. We also got some from the suggested menu like the ooey gooey and others I can't remember, but I know one had a flavored/red shell! All I know is that the flavors melded together perfectly. There wasn't a bad taco. Well, we did get the taco of the day which we didn't realize was going to be a nod to Thanksgiving. I bet it was good but neither one of us wanted to try it.   We had leftovers and they were STILL delicious a couple days later. The side of rice and beans was not huge but just right for $1.   These tacos are not similar to authentic Mexican cuisine, with hard corn tortillas and soft flour tortillas as your only options (well, that along with fancy selections that sure as heck aren't authentic).  But with all of that being said, they are so delicious. And this Mexican gal can't stop thinking about them! Seriously I already asked my coworker if we can go back again soon.   The ambiance is cool to boot! Def worth a stop. Maybe next time I can sample some bevvies :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "XYCIjBLP7VAJTIr5Ig0uwA"
  },
  "IIXyUi6bcxMbVHT8bvk3AQ": {
    "date": "10/25/2018",
    "text": "Stopped over here for lunch since I was in a hurry. I was glad to see it is located right across the street from the metered parking lot on Butler St.  A very nice waitress explained the concept to me. I could either choose from the premade tacos or build my own. They also feature what they call the taco of the month. You place your name on a sheet indicate quantity and if you are building your own then you would indicate what you want on your taco.  I did notice they have some vegetarian tacos here. They can be made vegan upon request. I decided to order two \"Dutch dragon\" tacos but without the hard shell. The fast casual restaurant has long tables where more than one party can sit at and a full service bar.  At the end of each table is a roll of brown paper towels-believe me you will need them! I had my tacos within 5 minutes flat and as I starting eating they got very messy. The Dutch dragon taco is consists of guacamole, roasted portabellos, tomatoes, jicama/cabbage slaw, jalepeno's, corn salsa, and salsa verde all on a soft taco shell.  I must say they were good but those jalepeno's sure had a kick to them. The order is served in one of the paper food holders and your only utensil is a plastic spoon/fork mix. That item is not very good at scooping up the drippings that fall out of them.  Condado's has a full bar with TV off to the left side of the entrance. Their wallpaper and layout is truly a Mexican influence.  Service is fast and my waitress they brought my check quickly so I could finish up. This is their 2nd location with the first one still in downtown Pittsburgh. I definitely suggest bring a wet nap because I went through tons of paper towels just to clean my fingers and hands. Overall the food was good. Prices are very reasonable especially if you aren't ordering that much. A welcome addition to Lawrenceville.",
    "rating": 3,
    "rated": {
      "funny": 12,
      "useful": 23,
      "cool": 20
    },
    "photos": [
      {
        "img_id": "GHsRXN8PVNA_os1Qs7BkRQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Dutch dragon tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GHsRXN8PVNA_os1Qs7BkRQ/o.jpg"
      },
      {
        "img_id": "8j7MAnhAboASOEgey1iQAQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Wallpaper",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8j7MAnhAboASOEgey1iQAQ/o.jpg"
      },
      {
        "img_id": "vQKRN8TqnS_NC8MxkDjQrg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. outside entrance on Butler St.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vQKRN8TqnS_NC8MxkDjQrg/o.jpg"
      }
    ],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "13aeEulE1ISrUDAwWiMGWQ": {
    "date": "4/20/2019",
    "text": "Not a big fan of cold Tacos   I tried Condado twice at two different location and both times my tacos are cold. I think it is just how they do their tacos and I'm just not a fan.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VswUoaRCaDcu4D-_hrHuaQ"
  },
  "kRluVjh91GW_5RHwTxgjCw": {
    "date": "11/5/2018",
    "text": "I finally made my way to Condado, so I figured I better make my way here to taco 'bout it.  I came here for dinner with a relative and when we arrived, the hostess provided a few options: we could put our name on the list for a table in the front bar/dining area to reap the happy hour benefits (pro tip: they're on NoWait!), grab seats at the bar for the same perks, or be seated right away in the other dining area sans happy hour specials.  Loving a good happy hour as much as the next person, we decided to put our names down and belly up to the bar in the meantime.  One jalapeno margarita and order of guacamole later, our table was ready.    The majority of the seating in the front bar is communal and I've noticed this becoming more and more popular at restaurants  around the city. I didn't find any issue with it during my visit, though I can imagine it may get cramped when they are at capacity.  Our waitress was attentive and helpful in answering our menu questions and she was very patient as we spent a good chunk of time chatting before being ready to place our orders on a sheet that took me back to the days of high school Scantron exams.  For my tacos, I ordered the shrimp ceviche and ghost pepper steak, both on flour tortillas with various toppings.  I was pleasantly surprised by how many things I could add to my tacos without incurring an upcharge.  The shrimp ceviche had a nice balance of citrus without being overly acidic and the portion of shrimp for the price was great. I was surprised that this isn't one of the protein upcharges for that reason alone.  The ghost pepper steak didn't pack as much heat as I was expecting, which isn't necessarily a bad thing.  I think my only complaint is that the tortillas themselves weren't served warm.  The only thing I love more than a toasty little tortilla blanket of love for my taco fillings is a good deal, and Condado certainly provided the latter.  For five tacos, an order of guacamole, three margaritas, and three beers, our bill was $45 before tip.    I spotted a few other taco options that piqued my interest, so perhaps I'll use another happy hour special to do some R&D for creating the perfect taco.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "4TlgdMUFvATtMTPbBV9uOQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4TlgdMUFvATtMTPbBV9uOQ/o.jpg"
      }
    ],
    "user_id": "fp6wXrr5r3poOg6YhL4yvQ"
  },
  "5GvDPqZ7MQVhuJXNXjVENQ": {
    "date": "8/18/2019",
    "text": "I  build your own taco places....as a frequent of Barrio in Cleveland, Condado was extremely similar (and maybe better). Margaritas are fresh and come in many flavors. The fill out the menu and build as many tacos as you wants is my favorite. I usually go for veggie and shrimp ones. The layered hard and soft shell tacos  are my favorite and there are many options. Also a new addition than what I'm used too is the fire shell taco (similar to Taco Bell only like 100x better). The appetizer where you pick three dips was also very good! The corn  salsa and queso was my favorite. Next time I'm in Pittsburgh I'm coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MGOdgPWieNV37avou-ZFJQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Build your own tacos and breakfast taco",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MGOdgPWieNV37avou-ZFJQ/o.jpg"
      },
      {
        "img_id": "qRqYsBVm1zAVvL0p-D5q3g",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Triple dip appetizer with queso, guacamole, and corn salsa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qRqYsBVm1zAVvL0p-D5q3g/o.jpg"
      },
      {
        "img_id": "-dqJu7ib77WHYKKD1RYcvA",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Menu cover",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-dqJu7ib77WHYKKD1RYcvA/o.jpg"
      }
    ],
    "user_id": "JkvkUTglQAMc_2BtkNT1Ig"
  },
  "Dysw2GJJUoQk2YXTB3sa3w": {
    "date": "12/18/2018",
    "text": "I am smitten for all places that let you customize the food each detail of your item. Thankfully, many of the items on the Condado menu are perfect by themselves, but a symphony in your mouth once they all come together. We took our kids (one with a food allergy) and even they had a blast building their own tacos. The online allergen menu was super helpful, so we had very little worry heading here for a lunch. We all shared a queso and chips (but really, the kids ate most of the queso). The chips are fresh and shatter in your mouth, not in the dip. The drink menu was equally delicious and just as extensive as the taco list.   If we're looking at things to be picky about, I'd pick the chorizo. It was just alright, more spice, less grease? Just a bit...meh as a filling. Maybe better as the double deckeresque option.  Anyways, go here...now...so many different ways to customize your tacos, taco bowls, bowls etc.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aI_4HnYRb3m_7Wm0vZ-puQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aI_4HnYRb3m_7Wm0vZ-puQ/o.jpg"
      },
      {
        "img_id": "WznCUsketdkXEbHbsIUwQQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WznCUsketdkXEbHbsIUwQQ/o.jpg"
      },
      {
        "img_id": "csC4ZJlCz03zJydGynHy4A",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Custom taco",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/csC4ZJlCz03zJydGynHy4A/o.jpg"
      }
    ],
    "user_id": "WjsmRfQ_ruPazoZl_9AQcA"
  },
  "U300R6gkEZx7Mfenn-zd9A": {
    "date": "10/19/2018",
    "text": "Condado has always been one of my favorite spots in the city. Now they opened a second location closer to my house and I don't have to fight to find downtown parking!  #Winning    If you like good food but don't want to spend a ton of cash, this is a great place to go. You can build your tacos with as few or as many toppings as you with. And they don't charge extra if you go overboard. You can easily fill up on food and a few Margaritas for under twenty bucks!  And the atmosphere is amazing. Even though Condado is based in Ohio, the made sure to hire local Lawrenceville artists to fill the walls with colorful artwork!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xWPEyKVnJr7z1-3Ly_o6_w",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Bar area",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xWPEyKVnJr7z1-3Ly_o6_w/o.jpg"
      },
      {
        "img_id": "Mks6C0XqEMmX4BXF6sMc7A",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Bar area",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Mks6C0XqEMmX4BXF6sMc7A/o.jpg"
      },
      {
        "img_id": "juHl_KtcttNJ-srcnSfjsQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. More art!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/juHl_KtcttNJ-srcnSfjsQ/o.jpg"
      }
    ],
    "user_id": "xX2-5ZXzH7L7YJdtoMr_Nw"
  },
  "GZcLkTooMb92WCC0uOi79Q": {
    "date": "10/17/2018",
    "text": "Last night, I got to preview the Condado - Lawrenceville location and it is AMAZING.   To start, we ordered some margaritas! I ordered the Strawberry margarita and it was delicious! It was so light and refreshing- my friend ordered the jalapeno margarita and she enjoyed hers as well.   We ordered some apps - we got the salsa Rojas, the salsa verde, the original queso, the traditional guacamole, and the pineapple salsa. Their chips are to die for! The queso and the guacamole were my favorites!   For my entree, I ordered of the Build Your Own Taco - I ordered the chicken tacos with lettuce, cheddar cheese, bacon, sour cream, and tomatoes. OMG these tacos were incredible!!! Mouth-watering good! I also tried their rice as a side dish. I liked the rice a lot and would get it again.   In conclusion, Condado in Lawrenceville will be the new spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "BxvSsxpzlhPYZgy8lu9Jgg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BxvSsxpzlhPYZgy8lu9Jgg/o.jpg"
      },
      {
        "img_id": "j8V1MSCJz4EEMfMK9_RC0w",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j8V1MSCJz4EEMfMK9_RC0w/o.jpg"
      },
      {
        "img_id": "8x4bfbM1GwRFHj7CsWAedQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8x4bfbM1GwRFHj7CsWAedQ/o.jpg"
      }
    ],
    "user_id": "Lph6pJNcM2Hhrb6_5i3oBw"
  },
  "PClCtjmN9-2YmQJtayS0bw": {
    "date": "11/30/2018",
    "text": "Wow, very impressed. I've worked 4-5 blocks from the downtown location for the last 6 months and I don't know why it's taken me this long to come check out Condado Tacos.  We had a large party of 7 show up for dinner on a Thursday evening at their Lawrenceville location, while it was really busy, they had no problem seating us in the back away from the bar and commotion where the longer tables are for large groups. Our waitress was friendly and wonderfully explained the at-first intimidating menu to us - on the \"Make Your Own,\" menu, each column is essentially a taco, and you have a ton of customizability with this - a great way to play with the flavors. They also have a well crafted pre-made taco menu in case you're not feeling all that adventurous, but the tacos on there too are insanely good.   Definitely order the queso, it's seriously some of the best queso and chips I've ever had, especially in Pittsburgh. Blows all the other Mexican-queso-serving restaurants out of the water. The homemade chips and queso also come with a dish of two other salsa - your standard red salsa, and a green salsa. The green salsa was surprisingly impressive, very garlic heavy with just a slight kick - just as good as the queso.   We also ordered a pitcher of house margaritas to split among us, and while it felt a liiiitle light on the tequila, the sourness of the margarita made up for it, seriously a delicious cocktail. I found Condado's to be a tad more sour than other Mexican places, which I loved.   After a bit, our personal crafted tacos arrived. While I don't remember the specifics of each one since there are sooo many options for these, I will say that the pollo, pulled pork, and ghost chili pepper marinated steak were absolutely sublime.  Play around with the CYO menu, it's hard to ruin a taco from here because everything is that good. I can't wait to come back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nwKuzMxEy_vKq7eoPqTrqQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nwKuzMxEy_vKq7eoPqTrqQ/o.jpg"
      }
    ],
    "user_id": "h4MPk8UK1OwhFlWECVw7SQ"
  },
  "H3L5wpTcUchUGi729rkXcQ": {
    "date": "11/30/2018",
    "text": "Love it here!   I have come a few times since they opened and it's always yummy.   Gotta start with some dips (of course). This time we had the green and pineapple salsa. Both had a good amount of spice but let's talk about the real star of the show...the chips! They are crispy and fresh. Sometimes a little on the greasy side but typically and consistently good.  I like to build my own tacos and try new combos all the time. It's easy and fun to try new concoctions every time. Typically I go with one chicken and one ceviche. Then I mix it up with the toppings and salsas.   The only reason I can't give it 5 stars is because the margaritas seems to be pretty inconsistent. Sometimes they are great and sometimes they are waaaaay too heavy in margarita mix.   All in all though, you've gotta check this place out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bFhxi48agvq3Juggo7Tihg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bFhxi48agvq3Juggo7Tihg/o.jpg"
      }
    ],
    "user_id": "Bx1x3Zfatt71jDz9OKeQsg"
  },
  "ZguUx-2s_1EA8TCxAC78yg": {
    "date": "9/1/2019",
    "text": "Late night bite with out of town guests, what a great decision!   Both friends stated the Guacamole (Tuscan) was best they'd ever had. And the tacos, owe!  Delicious not adequate - they are downright perfect!  Made to order, fill-out the order sheet and wait for the tacos of your dreams.  Excellent service too.  She handled a slightly rowdy crowd like a pro.  Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hiiGVP8udvaHeioSTTaHMg"
  },
  "aHN4wTpThTVQmr2KlK_kaA": {
    "date": "11/22/2018",
    "text": "Condado is honestly my favorite place to get tacos, so I of course had to check out the new opening in Lawrenceville! The secret to a good Condado taco is all in the combination:  1. Get the Sweet Lucy tortilla--you get a hard shell and a soft shell so it's the best of both worlds! Also it's vegetarian 2. If you like flavor, get the Thai Chili Tofu, you won't be disappointed! 3. Get all the veggies, cheese, and salsa your foodie heart desires 3. Top off your taco with the Chipotle Honey sauce and your taste buds will be so happy!!   The Lawrenceville Condado location did not disappoint! The food is equally as stimulating as the decor on the walls. My only qualm is the size of the space--it was cramped the entire night and the waiters kept bumping into me as they tried to serve other customers. Also, the music was really loud so it was hard to hear other people at my own table. But the food was spectacular as always, so I will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N2JQ6SUnF4BUHI7e8CoFfA",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N2JQ6SUnF4BUHI7e8CoFfA/o.jpg"
      }
    ],
    "user_id": "i1erqSCaenXvzeaswerWoQ"
  },
  "Z7WncmJGEokvL5lidvNf1A": {
    "date": "4/4/2019",
    "text": "I cannot stress enough how much I love this place. Margs? Delicious. Homemade tortilla chips? Bathe me in them. Their corn salsa? Yup. BUFFALO CHICKEN QUESO??? I would name my first born condado if they added it as a permanent menu item, I'm not kidding.  I took my boyfriend here and he lives in California, and even HE said it was amazing. We got drinks, the tres amigos, and 3-4 tacos each. Basically had to roll us out of there, but worth it.  The best part is, they keep refilling the chips, no matter how quickly you finish them. And honestly? Couldn't ask for better service.  The vibe and atmosphere is so relaxed, and all of the bartenders are attentive and just want you to have a good time. GET THE PRICKLY PEAR MARG.   Overall, I love this place. Whenever I make plans to go here, I truly can't stop thinking or talking about it until after I've had it and even then, I crave their chips on the reg.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1L7UpiYNuTZ2tzgHCX3hkg"
  },
  "gvqXyLBEjI9az8fhyEemrA": {
    "date": "3/10/2019",
    "text": "I love Condado! Seriously, can this place do any wrong? I mean, it probably can, but it would be your own fault! Let me explain... You put your own taco together with a handy sheet you fill out. Add in all the fixin's between meats, veggies, cheese and so many good sauces. Ugh, the sauces!  I love their brisket, pork and shrimp the most. I always end up making a taco with a variety of different sauces, but I do love the crema the best. They also make a killer gauc, so that's a must! The only miss I can see is the queso. It's a little too runny for my taste, but still flavorful. Which is weird. I'll still eat it, don't get me wrong!   Their margaritas are also fabulous. You know those super sweet syrupy margs? You won't get those here. They're super fresh and satisfying. I've been on a spicy drink kick and recently got the deliciouso, which is cucumber and muddle jalapenos.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 10
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "7iQVwr9bhfInocsZpL9jfA": {
    "date": "10/31/2018",
    "text": "I'm a big fan of the Condado downtown so I was really excited to check out their new location in Lawrenceville!   My friends and I decided to meet at 6, right in the heart of happy hour. I'm not a big fan of places that will only honor happy hour in the bar area, but I am used to it because of the other location. I put our names on a text list for a table. I was told I would get a confirmation text but never did. When I brought this to their attention, they said it didn't matter but I ultimately never got the text about my table either. When I brought it to their attention they weren't apologetic and I was disappointed that happy hour prices weren't honored.   Other than that - awesome experience! I knew I loved the food and it was consistent here, too. We had an awesome waitress who was very attentive. I love that there's a new option in this neighborhood. Go check it out soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LaiylSIbrA3aPvOYtl-J4A"
  },
  "ikHBVXfyjaPVl6N1FlNpUg": {
    "date": "9/12/2019",
    "text": "I had my first visit here and fell in love! It was actually my first time back to Lawrenceville in years since it really started to develop more (other than to a friend's house). It is really cool to see all the new restaurants and shops. The atmosphere is just so chill and very modernly artistic at Condado. The paintings were just so cute that they just added to the relaxed vibe of the restaurant.  My friend and I came on a Saturday afternoon and were seated right away. The only trouble I had was a little difficulty finding street parking as the lot closeby was rather small and full.   My friend was here before and to downtown location so it was her suggestion and she taught me how to order. There are ordering slips at your table where you choose pretty much everything that comes on your dish from the protein, toppings, type of shell for the taco, sauces, etc - just by checking next to each choice. I attached my selections on the sheet. I got the Juju and sweet lucy style tacos with shrimp and steak. I also had rice and black beans (has extra spices on them and taste different than regular black beans but good!) ordered as sides separately. They were both made pretty similar with hard shell on inside and soft shell on outside. I was skeptical at first but the two textures together were delicious! The tacos are pretty filling - only had two and was stuffed. However we did have chips and guacamole (some of the freshest guac I ever tasted!)   The margaritas are delicious as well - I had a blackberry and a peach one. They are made just right and just two give you a happy buzz. I can't wait to go back! Wonderful food and service with the addition of the pleasant atmosphere! Can't go wrong here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fU74IomYq4tWZezfkC31jA",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fU74IomYq4tWZezfkC31jA/o.jpg"
      },
      {
        "img_id": "0NzQonq4WtA2xxtpgDnL8A",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0NzQonq4WtA2xxtpgDnL8A/o.jpg"
      },
      {
        "img_id": "LHXX9-QJbrzmZEX4sBYI_w",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LHXX9-QJbrzmZEX4sBYI_w/o.jpg"
      }
    ],
    "user_id": "5ZjR1N8FC5tYmpihaLd0gg"
  },
  "X-EGQsnGm9ujo0wER1HkGw": {
    "date": "9/15/2019",
    "text": "Of all the reviews I've done up to this point Condado is by far the hardest review I've had to do to date. Everything I formulate in terms of an overall experience is established by service, aesthetics, cleanliness as obviously the food.  But, at Candado I felt like there was something missing in the end. I mean, what does this place not have? As you walk in it's clean--there's street artwork painted throughout the entire establishment leaving you a unique means of entertainment as you sit and eat. Hell, they have a very presentable bar with the proper lighting--and a display of the premium liquors the restaurant serves.  But, as you enter into the downstairs area which is where the bar decided to send us; you couldn't help but feel like you were entering a basement. Art work still canvases the entire area and made it feel less like a basement, but a basement still it felt.   Warmer than the upstairs due to a lack of air flow the entire downstairs was not even considered popular by the waitress who served us. She was very nice and served our every need but there was nobody else down in the basement so she was never really tested in terms of her capabilities in juggling multiple tasks.  I would love to describe the formula which I decided to build my tacos, but it was just all too complicated for somebody who would have never seen a menu of this magnitude before-- witnessing the offspring of Burgatory and Cheesecake Factories love child. The decisions were profound and I didn't want to mess up the taco for the price. Which is exactly what happened-- my bill very quickly rose above $40 after I purchase my food.   All in all, this restaurant is incredibly unique and provides a unique take on the term taco. We got a drink, we got some tacos and we got a bowl that were uniquely qualified to leave you remembering the place.   Feeling like we ate somewhere unique and genuine, I certainly advise going at least once. I believe that's why you go to a place like this-- you go for those unique experiences that don't feel like a chain.   Lastly, based on the fact that it's a humongous portion. I would also suggest that \"To-Go\" isn't really great reheated. Order what you're going to eat, and eat it cold.  The reason why I don't give 5 stars is due to lack of air flow and the complexity of the menu for those who are not regulars at the restaurant. The alcohol was good, but wasn't worth $11 and the prices were a little out of left field for a taco. 7.9/10  Tacos: 8.1/10 Bowl:   7.9/10 Salsa:  8.2/10 Queso: 7.4/10 Drink:   5/10  A/C: Not Really  Pepsi or Coke: Unsure  Ketchup: N/A",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A-sUkGpT3XD45wq3g_El9w",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A-sUkGpT3XD45wq3g_El9w/o.jpg"
      },
      {
        "img_id": "E3WYFAfgexVCbzUJUwFVXQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/E3WYFAfgexVCbzUJUwFVXQ/o.jpg"
      },
      {
        "img_id": "U52TFipeW5xNrrAFy6uJmg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. To go Tacos.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U52TFipeW5xNrrAFy6uJmg/o.jpg"
      }
    ],
    "user_id": "CW3gwKp12oviDb7MzR-RSw"
  },
  "PBaJ1nW7WdL9-PmXqBTLyA": {
    "date": "7/29/2019",
    "text": "Condado is one of my favorite taco spots - you generally get fast service and if you don't do alcoholic beverages it's very reasonably priced. I was excited when they opened up a spot in Lawrenceville - going downtown is always kind of a pain, and Larryville is close enough to my office that I can pop in for lunch tacos.  Quality for this location is equal to downtown - food is always good, service is great, environment is loud and upbeat. The big positive of this location over downtown is that I've never had to wait more than 15 minutes for a table, whereas I've stood waiting for an hour at the downtown location. Worth it, but I'd rather not!  Favorite things to get here - I'm a big BYO kind of person, and I almost always opt for the Thai chili tofu and the roasted portobellos as my protein. I vary with filling but always something crunchy (red cabbage or jicama + cabbage slaw), always cilantro and onions, and the pineapple salsa goes really well with the Thai chili tofu. Guac and chips every time, their guac is really good!   I don't bother with drinks here though - every margarita I've gotten tastes like mostly mixer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gH144bG_roPadHLjHag-cQ"
  },
  "qyOORGoADfJrdhRA2SANgg": {
    "date": "9/15/2019",
    "text": "The food was very good. There was a lot of space and it seemed very clean. The staff was attentive and nice and also very helpful. They don't tell you that the tacos are pretty small so you should buy a few. The \"mild\" stuff is also pretty spicy still. Overall it was good and a very good bargain for your food, just watch if you are sensitive to spicy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fut8lQcx0HyZONQ_PTE0VQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fut8lQcx0HyZONQ_PTE0VQ/o.jpg"
      }
    ],
    "user_id": "2P-9NHIYv37OA_hlGrLDjg"
  },
  "oDBJcRDQCKDrGc0jEi_ElA": {
    "date": "7/14/2019",
    "text": "Way overrated tacos. Decent margaritas.  The tacos are a little light and uninspired. There really isn't much that sets these apart from what you'd make at home with a kit. There are no soft corn tortillas, only flour tortillas and corn hard shells. This would be excusable if the flour tortillas where better than the kind you'd buy at at supermarket, but they aren't.  The tacos are pretty expensive, too. The taco quality did not warrant the $3.50-4 price tag.  On the upside, their margaritas are pretty good. But for $8-9 there really wouldn't be an excuse for them not to be.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BNgHRH23yIbvSkx0NdKCjw",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Margarita, Tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BNgHRH23yIbvSkx0NdKCjw/o.jpg"
      },
      {
        "img_id": "T8OwWjHhG7IOgdlRaJZ4zQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Taco",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/T8OwWjHhG7IOgdlRaJZ4zQ/o.jpg"
      }
    ],
    "user_id": "7l0zTMR4_dgw8vKFr1p3qg"
  },
  "lGROKaw59j4BWd6nO8PDzw": {
    "date": "7/4/2019",
    "text": "I had a great experience at Condado Tacos. I walked here so I'm not sure about the parking situation, but I noticed there was street parking available. The walk through Lawrenceville was nice, though, as there are a ton of other businesses nearby and it's a lively area!  The atmosphere is great in Condado, with giant colorful taco-themed murals on the walls. They offer a build-your-own taco menu, along with a few premade order-able options. I built two of my own tacos and had a margarita and spent about $20 - but I got a couple of the pricier options on the taco, like the special shell that is basically a hard shell surrounded by a soft tortilla and cheese.  Their house margarita was served in a mason jar and was a better-than average margarita and cost $7.5. I would definitely recommend coming here during happy hour for 1/2 price margarita and $1 off tacos and eating and drinking to your heart's desire. Next time I'll have to add a special flavor to my margarita - they have 9 different choices! though it adds $1 to your margarita price.   Additionally, our server was nice and knowledgeable about the menu and attentive to our table!  I can't wait to come back and try some different marg flavors!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nfGC_3F7-urw7FirVRMcdA"
  },
  "cOT0R8e6LNfv1rVAT_Q7Xg": {
    "date": "6/10/2019",
    "text": "I've been here twice now and I'm in LOVE. I'm not the biggest fan of tacos, but I've found myself craving these ones on multiple occasions. I can't help but order the sweet Lucy shell for all of my tacos. It's basically a hard taco shell surrounded by a soft tortilla -- soooo good. This time I also got a plain hard shell taco too, and it was really good.   The customizable menu is a little difficult to grasp at first, but the servers should be able to explain it pretty well. There's so many delicious options you can choose from. I highly recommend topping off your tacos with the sweeter salsas on the menu because they compliment everything really nicely.  The margaritas are always really great. I tried the Kahlo margarita this time, and it was super tasty. They also have several fruity flavor options you can add to certain margs. We also ordered the chips and pineapple salsa, and you really can't go wrong there. The salsa is seriously so good, I wish I could have it every day. I will be back very soon, especially for happy hour!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MjIGzEuj8AxE-70ImRz5fg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Pineapple salsa",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MjIGzEuj8AxE-70ImRz5fg/o.jpg"
      },
      {
        "img_id": "7Jed-OWFHw2-c_JNoLGZjQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Sweet Lucy tacos -- customized",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7Jed-OWFHw2-c_JNoLGZjQ/o.jpg"
      },
      {
        "img_id": "iDNqGXb9YdDuC3N8SX6VtA",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Kahlo Margarita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iDNqGXb9YdDuC3N8SX6VtA/o.jpg"
      }
    ],
    "user_id": "jhm1OR3WVUpk_hBTi4Fh3g"
  },
  "OzTyd6s7RxTFdYlC_hG_eA": {
    "date": "7/27/2019",
    "text": "This is the second time at Condado for me, but first time at the Lawrenceville location. I don't like how all of the servers work. It seems a little dis-shuffled. Like we had about 3 servers our whole time there, but no one mentioned if it was like \"hey grab any of us if you need anything\" new people just kept popping up. After we ordered our food someone else came out and asked if we were ready to order lol  The food itself was very good. The first time I ever ate at the one downtown I had tacos and they were cold. This time I had a bowl, and it was hot. It was delicious. They give you a card with check boxes of ingredients, and you can make your own tacos or bowl. I'm so indecisive so it took me a little to decide. But when we ordered we got our food fairly quick as well as our cocktails.  Can wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DF3pL8EatKCBfsF0ok1qYw"
  },
  "b2JuOpZC0UCfxsrdEVKI7Q": {
    "date": "9/16/2019",
    "text": "Been too many times to count! Never disappoints. Personal fan of their guacamole and queso. But by far, best thing going is their margarita flight! Plenty of seating so haven't found myself having to wait more than 10-15 minutes on a busy night. Definitely my to-go when craving tacos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hIp-FHmOYf70msygdgqqA"
  },
  "gOiY8Iaejj2Byq1RomUFfQ": {
    "date": "3/12/2019",
    "text": "Woah momma! This place is absolutely amazing.   Last night, I came here after volunteering at the Ronald Mcdonald house up the street with my co-workers. (Quick Plug if you can help volunteer there for meal prep that would be great). We came for the end of happy hour. As soon as you walk in it is a very vibrant, colorful, and upbeat place. Def has that Lawerenceville vibe to it. I don't remember exactly which tacos i got because i let all my other coworkers pick for me, but this place hands down has the best tacos in Pittsburgh. Their queso is so good that I envisioned myself turn into a butterfly and then fly towards the most beautiful flower and then drank it's divine nectar. Yep that good. Our waiter was great. Wish i could remember his name. Had a real good time their. Personal preference for the margs though is that i wish the jalapeno marg was a bit spicier.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DavGkdd0OgVGVmLO4yuRmA",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. My tacos... accidentally ate two.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DavGkdd0OgVGVmLO4yuRmA/o.jpg"
      },
      {
        "img_id": "TQkV21TOnbnnbh1kVBuMjw",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. All the dips that came with the nachos.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TQkV21TOnbnnbh1kVBuMjw/o.jpg"
      }
    ],
    "user_id": "Nnzn3dwE_GQhxdzTFH3DNg"
  },
  "rmujmC39RvQQdiCEXWHkjA": {
    "date": "2/21/2019",
    "text": "We came on a Wednesday night to check out the spot. It's an interesting vibe with large communal like tables. We were seated downstairs where it was quieter, but had a TV playing Jeopardy....  We ordered drinks, with only one local craft available on draft (two others were out). Our waitress suggested the queso of the month dip, buffalo chicken. We ordered those as we look over the taco options. The waitress recommended 2-3 per person.  So, here's what we ordered and thoughts: El Tradicional - Both hubs and I got this one. It was certainly more authentic than the others and the chorizo was tasty. Downside is that it is messy to eat and the seasoning linger on your hands all night, no matter how much you wash your hands.  Dutch Dragon - Hubs ordered this and it was his favorite. The portobello gave it a heartier taste. I took a bite and thought The Mantis was way better, partly because I don't care for corn salsa (preference thing).   The Mantis - My favorite! I love the heat from the mango habanero sauce, which worked well with the jackfruit. The Lucy shell had a soft spice and crispiness to it. Definitely not authentic, but a good fusion of flavors.  El Santo - Our least favorite. I was intrigued by the Condado Secret Sauce in the description. We didn't taste it. It was such a basic taco, so bland and lack of creativity compared to the others. Pass.  Queso of the month: buffalo chicken: Rich and tasted like buffalo chicken. It's a sizable portion. We probably ate half before the tacos arrived and that was too much. Hubs regretted ordering 3 tacos. I was wise in ordering 2.  It's an okay spot if you're in the area and want to hang out with friends. I can totally get that vibe--grab some drinks, some chips, and maybe a taco or two.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AF0OfJy3Ls83F-VRnFk9cw",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Taco Wednesday!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AF0OfJy3Ls83F-VRnFk9cw/o.jpg"
      }
    ],
    "user_id": "2i0A5OoKyiwskqvnkGq7cA"
  },
  "67GxNYfFrFi0gctbZcfr2w": {
    "date": "6/9/2019",
    "text": "I'm thrilled there's a second location for Condado now! I most frequently come for their happy hours, which is half off margs, including their flavored ones, and a dollar off tacos. I love their muddled jalapeno margarita - having sipped some of my pals' flavored margs, I think the jalapeno meshes the best with the tequila without being overly sweet like some of the fruity ones. I haven't had a bad taco here yet, but am still trying to figure out which one reigns ~supreme~. Probably one with their double soft-hard shells.   I like that condado isn't really trying for authentic Mexican, bc lbr that's hard to come by this far east, but just tasty food. Veg friendly too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z39kx8fc9uox67hP953cEw"
  },
  "CqJetd6hh6QVVLq0cFR84Q": {
    "date": "3/7/2019",
    "text": "I love that Condado opened this location in addition to the one downtown! The food is just as good here, with cool artwork on the walls that is uniquely Lawrenceville. Even when it's busy, the food comes out quickly and the waiters are attentive. It can be a bit tight when it's busy, since they'll seat multiple parties at the same table to avoid a wait, but it isn't really an issue.   Condado's monthly specials are always interesting and include a new drink, guac, queso, and taco. I like the options to either make your own tacos or order some of their suggestions--there's definitely something for every taste! Their tacos are stuffed to the brim, unlike some of the other popular (and more expensive) taco places in Pittsburgh. They have plenty of vegan and vegetarian options, which I appreciate. Their margaritas are also always good, not too sweet but flavorful. The best part of Condado is how affordable everything is! We got 5 tacos total, chips and a huge bowl of guac, and two margaritas for $30. We left feeling happy and a bit too full!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "dckPo4Rh1A_u1LF1gjyrmA",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Dutch Dragon and The Mantis vegetarian tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dckPo4Rh1A_u1LF1gjyrmA/o.jpg"
      },
      {
        "img_id": "oMhvgji6njQywK1Ch-QiAQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Blackberry margarita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oMhvgji6njQywK1Ch-QiAQ/o.jpg"
      },
      {
        "img_id": "D7nFUImnSVdRFQNAWHy8gw",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Tuscan guac",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D7nFUImnSVdRFQNAWHy8gw/o.jpg"
      }
    ],
    "user_id": "a-p_jg612cvzZnoGPNOgAQ"
  },
  "J43OGvP8gbLI5scRKcxmOQ": {
    "date": "1/26/2019",
    "text": "Finally I've made it to this location! Woohoo for me!  I'll start off by saying the decor is one of my most fave things and I'm not biased because the artwork was done by my pal Matt Spahr. Seriously he's so talented.  Everything is pretty much fun the same as it is downtown but the layout here makes it feel more roomy, even if it may not be.  Staff is friendly and accommodating.  I stick with what I know: build your own tacos. Can't go wrong.  The tacos always come out as ordered and in a timely manner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "stnrPBHEVKOxPo0-rP8hcA": {
    "date": "1/12/2019",
    "text": "HOLY TACOS! This place is my new favorite taco spot in town (new to me)! We stopped in after a tiresome day of bowling at Arsenal to refuel, and were pleasantly surprised by the fun decor and tasty food! Plus, they only had two items with gluten that I need to avoid which is a HUGE plus for me!  We started with their chips and queso before realizing that they had tons of different queso options! Next time we hope to try the broccoli and cheese queso. Then we each ordered two tacos which were out in record time and very filling! We sat at the bar, but the rest of the place is set up with community style tables.   They have a very extensive selection to make your own tacos or you can choose from some of their most popular selections! In my opinion, you can't go wrong, but be sure to check out their taco, queso and marg of the month!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "k42Cz6IMSdcRPNpyMzK4mw",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Fun decor",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k42Cz6IMSdcRPNpyMzK4mw/o.jpg"
      },
      {
        "img_id": "J7QFfVwq3HEM7KiJLZtmpQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Sat at the bar!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/J7QFfVwq3HEM7KiJLZtmpQ/o.jpg"
      },
      {
        "img_id": "NMpztxOTrAax_mkvFvfGUA",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Ooey Gooey and something delicious but I can&amp;#39;t remember the name!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NMpztxOTrAax_mkvFvfGUA/o.jpg"
      }
    ],
    "user_id": "3CYDgFXGK5M8qfF8COrXGQ"
  },
  "3AYW7KgvEwIdslyogHF4Jg": {
    "date": "6/11/2019",
    "text": "3 stars because no other option than tacos  Happy hour 1/2 off tacos & margaritas ... I ate and drank for ~$20.  The blackerry margarita (which is served over ice in a short mason jar) was delicious.  So similar to Burgatory, a handful of \"pre-built\" tacos or build your own.  If you have issues with spicy food, either pre-medicate or skip this restaurant.  My mouth and belly were on fire.   I started with 2 shrimp \"pre-built\" tacos and ventured out to a build your own.  Leave it to the experts, their taco was better than mine.  Ample parking next door in an open lot.  The main floor is LOUD.  The typical Pittsburgh basement is cool and quieter EXCEPT when a PAT bus blocks the basement window and the area darkens quickly.  Give it a try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rxw9BOhbTzVUP5rvd5Acdw"
  },
  "y4FQOqBiwae7jt67bwD-hw": {
    "date": "7/7/2019",
    "text": "This place has the most amazing tacos, queso, and guac that I've ever had!!! We typically choose Mexican style restaurants or food spots because we love that type of stuff and we were definitely impressed with Condado Tacos. Such a friendly vibe, with awesome art all around.  We will most definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NdFMwNS8dX3geXwBihMGfA",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NdFMwNS8dX3geXwBihMGfA/o.jpg"
      }
    ],
    "user_id": "085t94y98Fl9xDqF7lXNeQ"
  },
  "M7TJofkEqE9S827CtdQ_OQ": {
    "date": "12/12/2018",
    "text": "On a recent Thursday night, I decided last-minute to check out the new location of the infamous Condado Tacos. I figured I'd save myself a table given the time I was visiting, so I logged onto my Yelp app and checked myself into their line. I got a message that it would be a five to ten minute wait, and there were three parties ahead of me. Cool; no problem here, right?  Well imagine my shock when I arrived and was told Condado Tacos doesn't use Yelp and NoWait to reserve spots. Something about how the business owners activated the service on the Yelp page but the staff don't have access to it. Um...WHAT? No. Unacceptable. There are hundreds of businesses in this city that don't Falsely advertise a line service to their customers. There is no reason for Condado Tacos to do this. If anyone from Condado Tacos management reads this, please either disable NoWait on your page or give your staff the tools they need to utilize it.  Anyway. I ended up sitting at the bar since it was the only place where there was (barely) room for me. Not exactly ideal, given the time of year - but I managed to roll my winter coat up to fit into my lap, as well as safely tuck my computer bag under my feet on the floor.   The bartender, to his credit, was very nice. And I soon had a margarita in hand while waiting on a couple made-to-order custom tacos featuring my shells, proteins, and toppings of choice. Think Burgatory, but with tacos instead of burgers - and I think that's the real appeal of this place. I had noticed Condado Tacos does have a \"standard\" menu as well, but hey, why not take advantage of a custom option when it's available?  While waiting, I was able to look around the restaurant a little. The decor is wild - we're talking bright glowing murals surrounding a bar backlit by appealing and calming blue lights. It's a very cool looking place, I'll give them that. But the music was just too. Dang. Loud! Combined with the chatter of a full restaurant and bar, and I couldn't really hear myself think while I was here.  Anyway, I didn't look around long because the tacos arrived pretty quickly. And they were...OK. Not bad at all, but for all the hype I've heard about Condado Tacos this year, I think I expected more in the seasoning and flavor department. I guess the low prices and ability to order exactly what you want are ultimately what people like here. And the quick service was impressive given how busy the place was.  Still, I'm not sure I'll be back to Condado Tacos. The place is too small and too loud for my liking, and while the custom menu option is cool the tacos didn't \"wow\" me as expected. It's an OK place though, and I could be persuaded to return in the right circumstances.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "rrttTaDPG4AuVvLdCDOx8w",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rrttTaDPG4AuVvLdCDOx8w/o.jpg"
      },
      {
        "img_id": "_E4GJu0k6bqpXp7UsmMW7g",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_E4GJu0k6bqpXp7UsmMW7g/o.jpg"
      },
      {
        "img_id": "HUUkXUdr4BoGwFSSwYZsUg",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HUUkXUdr4BoGwFSSwYZsUg/o.jpg"
      }
    ],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "hGzD1s00l4kTpn1puCUBmw": {
    "date": "12/12/2018",
    "text": "Just as good as the one downtown. Love that they are on the no wait app as well!! Honestly one of the best happy hours in Pittsburgh!!  We had the quac, queso, and salsa. Good portion for the price. The margaritas were strong, and steak tacos in the juju shells were amazing. Cooled them off with some pineapple salsa.   I dream about eating this food no joke!!! Have never been disappointed! Great value and quality for the price!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nbXmPx4bd4kfEo3yXNYSbw",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nbXmPx4bd4kfEo3yXNYSbw/o.jpg"
      },
      {
        "img_id": "14yOlYjODhaHwi_9caIhbQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/14yOlYjODhaHwi_9caIhbQ/o.jpg"
      }
    ],
    "user_id": "xASVspzBP-HSUrTvL4qUSg"
  },
  "cqY3Vlgmdp9d00JTjFwnkQ": {
    "date": "9/17/2019",
    "text": "Happy hour was amazing. Margaritas are so good, so we're the tacos. The place had a great vibe as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kcj-vJTnRlawfGDsRTzRnw"
  },
  "qvJ0vb7vx4Ais2TbRxp7Hw": {
    "date": "5/24/2019",
    "text": "Last week on a hum bug, me and my best friend went here. It popped up in my yelp notifications as \"hot & new\" so we decided to give it a go. It happened to be Halloween and happy hour, which was perfect for us. The atmosphere was VERY welcoming, and place was packed (in a great way)! The hostess was friendly and seated us right away. We got sat next to a couple who was finishing up and they gave us their remaining gift card which had $15 left on it! (SCORE) anyways, the special for happy hour was 1/2 margaritas and $1 off tocos. Let me say... the margaritas were amazing!! They aren't blended with ice, but rather severed over ice in mason jars (another PLUS) and the selection of choices was amazing! After we placed our drink orders we began building our tocos (their menu is set up like Burgatory) and the options to create your own tocos are endless. The service was fast despite how busy it was, and everything was FRESH! Our waitress was super friendly and very helpful & knowledgeable. After we finished our tocos, we sat and finished our drinks. My best friend lives in North Carolina now & is talking about flying back just for this place & their tocos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u01P1dsS4OKaKQCtbe4V-Q"
  },
  "8liIsmpV5QuS7aYfFHDQqg": {
    "date": "11/3/2018",
    "text": "The vegan tacos were really good! The Double dutch taco was very flavorful and spicy. Didn't get why it needs two tortillas though. I was soooo happy when they had an Impossible taco as taco of the month. It was soo good. I had it without the cheddar cheese, if they had had a vegan cheese sub it would've been the ultimate \"meaty\" vegan taco. The Impossible patty was crispy, such a good texture! Deff recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ytmin9rj20pcX-08IwGRew"
  },
  "Ew9zpBodX9lNOtwwTxDVcA": {
    "date": "1/16/2019",
    "text": "I LOVE THIS PLACE! This is my second visit to this location, along with visiting the downtown location once. Gets better every time! My family started out by ordering the pico de guaco which came with salsa and we all loved it! For our meal, we all made our own tacos off of the check list at the table which makes it so much easier to make sure you'll like what you order. Ive had their chicken every time and it is the BEST! I would 10000% recommend this place and will definitely continue coming back every time I'm home!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1AJ2kxXB7HZqgPp5DLm3HQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1AJ2kxXB7HZqgPp5DLm3HQ/o.jpg"
      },
      {
        "img_id": "B_KPfbcv3Pl6U8dNi2wclQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/B_KPfbcv3Pl6U8dNi2wclQ/o.jpg"
      },
      {
        "img_id": "HOIf2o133EXB1teYQ7jglQ",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HOIf2o133EXB1teYQ7jglQ/o.jpg"
      }
    ],
    "user_id": "j5bklAXY3j4iv2hMsN8KMA"
  },
  "VuNboz4BjI-lfrpmCthryw": {
    "date": "2/15/2019",
    "text": "I know I'm the odd one out here. Everyone I know loves Condado. Their margaritas are are too sweet and syrupy tasting to me. The do it yourself taco idea is a cool idea in theory, but it can be a little overwhelming. I do enjoy their list of \"predecided\" tacos. I usually pick one off of there but even those ones are just okay. I would recommend going during happy hour.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g9oN-ew3tefix64mt9TXog"
  },
  "I-H5kW1RyVhgqOytBbDXqg": {
    "date": "2/14/2019",
    "text": "The vegan tacos r the bomb but the atmosphere is lacking. Not handicap accessible. Most seating is communal, high bar stools",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uheyXqWYvlpqqLjdGesi0g"
  },
  "GUL4V4XptJpcY5sKsaRJPg": {
    "date": "7/15/2019",
    "text": "Good place, good food, clean, and mostly consistent hours. Although whiskey and tequila selection is great at the other store, selection and perhaps a fair variety of those here, this location has a small beer tap selection that they don't keep properly stocked, and it's worse for their cans/bottles. Also, no WiFi available for customers, unlike the store down on Liberty downtown used to have (may still have?). The music is mostly solid at this location, and fits the theme/format (downtown location can be tough to visit because one bartender likes to commandeer the playlist to off-theme/format hip-hoppy pop--painful), but some staff will come out blaring portable speaker music players (loud) to drown out the ordinary store music well BEFORE closing time (and the store will feel closed as early as 1:30 a.m., perhaps with most of the lights out--little says \"get the hell out of here\" more than that). I've been to this store a fair number of times, and want to come back, but this last time I was hustled to close out my tab perhaps an hour before I was ready to do so--all for server convenience (I can understand a server wanting to close out, but there has to be a way to credit servers by custody of the table, net of tips and all--not hard to program). Why should a customer be harassed over more than one transaction and have to lose the table service they bargained for? Also, how long must one wait at the front of the house to be seated while the host watches television? This place may be slipping fast.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mw0VDBL1kf4vgvD2Lu6Mlw"
  },
  "QoAUoFtbwcZbBb6bgGfiiQ": {
    "date": "2/8/2019",
    "text": "Tacos were a little soggy and not as hot as I'd have liked. But the price was right and I love the ability to customize and the big selection.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kvRzyZnfwe7ebhYzJGJhWw"
  },
  "4KIIOH0ka9VSdmUsazUizA": {
    "date": "12/9/2018",
    "text": "This has been a great weekend. A friend recommended Condado Tacos to me and I have to say probably the best taco joint I've ever been to. First off, really nice service. Great people who are personable and friendly. The queso appetizers are incredible. A real must-- especially the one with corn. Also this place uses the papers with check marks as well. I haven't told a waiter or waitress what I wanted to eat in days! I did the build your own tacos and I got three which I really recommend. Great food, great atmosphere, great service. The only thing I didn't care for was at first they tried to seat us at a long table between two parties. Wouldn't have had much room so I recommend sitting at the bar. But I'm sure they hear that all the time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L4BGb93THTf5VJdlURnvuA"
  },
  "Ls_ArKKJ5ysc-RAVrHDY5Q": {
    "date": "11/25/2018",
    "text": "I'd give the food 4 stars but the music is so incredibly loud that it prevents me from enjoying this place.  We went with friends on a Friday the week they opened.  The place was incredible crowded and we waited about 20 minutes for a table.  We noticed the volume of the music was inordinately loud and we basically had to shout our conversation.  But the food was delicious.  A month or two goes by and my wife and I are looking for a place in the neighborhood for a quick bite on a Tuesday night.  We literally walked in and heard the loud music and immediately walked out and over to another place on Butler.  We're not senior citizens that hate loud music but I don't know if we will be back until this place becomes less like a nightclub and more like a restaurant, especially with so many other options in close proximity.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ko_INmbY-0NMc5FEppvYCA"
  },
  "gl9NY5hSQ9CTon-D9hn-2w": {
    "date": "3/31/2019",
    "text": "The manager and waitstaff were wonderful when my large group of friends came for dinner. We had a bit of a wait (which was expected for 19 people on a Saturday) but the staff were all so pleasant and efficient. Don't get me wrong, the food was amazing too but the service was just wonderful. Get the queso blanco and the blood orange margarita for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KuW8mY_SQjloPbBSei86xg"
  },
  "nu8CHyROQYAaFaTuNP7UXA": {
    "date": "11/5/2018",
    "text": "Delicious! Friendly! A coworker and I stopped for lunch today.  The environment is friendly and artistic.  Our server was friendly and helpful.   The food was perfect.  You complete a sheet at the table full of options to build your own taco or you can pick a pre-made piece.  The queso was dead on with the added chorizo.   We received our food quickly and it was correct the first time.  I would go back in a heartbeat.  I highly recommend you check it out next time your in Lawrenceville.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ohhzhkUgSepfE7e7ip4yA"
  },
  "8liIIBYsHlWRvdJr-nPN_Q": {
    "date": "11/15/2018",
    "text": "Awesome tacos, even better margaritas. It's the burgatory if tacos with the build it yourself menu",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kaQs9nss01gsaahVBu3biQ"
  },
  "poW5vhJJgRlbSu_Cj55qrA": {
    "date": "11/3/2018",
    "text": "This place is incredibly loud.  When I arrived, I asked the hostess if she could seat me in a room that was less noisy, she told me the the other rooms were closed.  I looked later and they were definitely open.  My ears still hurt the next morning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lfEzRIhpoQ5Yw3GZAQh2tw",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. It is extremely loud.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lfEzRIhpoQ5Yw3GZAQh2tw/o.jpg"
      }
    ],
    "user_id": "8Pjb5UXyS5XmFvdTTNJnSA"
  },
  "AvkhyHvv1alXQNnHKkKUow": {
    "date": "11/2/2018",
    "text": "Amazing! What a great new addition to butler street. Very nice happy hour with half off yummy house margaritas and $1 off tacos. Tacos are delicious and a good portion. Really enjoyed our time there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wwRWW7j_zg3raVGKwh2G9g"
  },
  "2hFJph4zzibvQ7-MDPGZ5w": {
    "date": "4/26/2019",
    "text": "Awesome food great service cool space. Food came quickly and was amazing - chips and salsa was also yummy. definitely worth the ride. Can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OZ8DsB1b-CkCWd4AoxG1wg"
  },
  "CE_0lfLinriI-xiPjIAjbw": {
    "date": "11/4/2018",
    "text": "Wide tequila selection. Little more than a few drafts including a unique collaboration that at least at the moment is fantastic (New England style prickly pear IPA). Awesome tacos, 2 were enough for me but possibly could've stuffed myself with 3. Fun music (rock/metal), fun environment (colorful), and a couple TVs above the bar for catching the Steelers or Pens game. I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gFI1lEppec7QJAmdFdPQjg"
  },
  "WldxEmKViJqlU-dk-_7Ncw": {
    "date": "11/10/2018",
    "text": "I live a couple blocks away and eat here all the time. Since opening, I've probably gotten food here over ten times.   Pros: High quality food - I've enjoyed everything I've eaten from Condado. Lots of variety for vegetarians and new seasonal items each month Cheap prices- You can get a full meal for under $10 Great service - Everyone that works there (bartenders, servers, hosts, food runners) has a great attitude and actually seem like they enjoy their job. Everything comes out quick and with a smile Rewards program - 10% cash back deal when you sign up. Great stuff  Cons: Literally nothing.   I feel like this review sounds like I work there or own the place but I really don't. I live off 47th in Lawrenceville and couldn't be happier that the perfect restaurant opened in my neighborhood. I will take all out of town visitors to Condado. Keep up the good work!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rcOADMkAtCLRCN39LvxZLw"
  },
  "Y6uakUFJ70rQqq6VECnT1A": {
    "date": "11/30/2018",
    "text": "I would definitely recommend coming to this if you want some interesting tacos. If you come here, I would also recommend the queso and salsa. The queso was awesome and very tasty. All of the food came out very quick, which I was very impressed with. We loved that they refreshed our chips throughout the night. The reason why I wouldn't rate this a 5 is because you make your own tacos. They do have recommendations for quick tacos, but none of us were interested in many of these tacos. One of the tacos that I made was really good, but the second one was mediocre. I would have liked more guidance in regards to good pairings. Additionally, some of the tacos were very greasy and a mess to eat.   Best drink: blood orange margarita",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jRFz-uMIjmmiOcVMVHbSrQ"
  },
  "KlCO6QBMf2XdugSpIKaPBA": {
    "date": "4/26/2019",
    "text": "This was my first time coming here and i'll definitely be back! Food was amazing, chips and salsa is awesome, and the service is great as well. I would highly recommend coming here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OR7PvDIq7QuT5mmPcn9bkA"
  },
  "9SUuhOgG4V7o9PwBNZVGkg": {
    "date": "11/29/2018",
    "text": "This place has the best tacos in Pittsburgh. The amount of choices for shell, protein, toppings, and sauces is amazing. The price isn't bad either.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ITeYPqm_mXoABjGdjoZ8Ow"
  },
  "IIc0-7PoE_fN9cMBg0iMFw": {
    "date": "5/5/2019",
    "text": "Margheritas acidic, food terrible. For a place that has 4 stars, it's awful. The salsa's, are flavorless. Our meal was a huge disappointment for a Mexican restaurant. Service very scarce, but the bartenders were awesome!  Not worth the money",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CeA1qDGWe2-7KPtAaxe-4g"
  },
  "b6r8PQOH_HtBQHP2deBt4w": {
    "date": "4/15/2019",
    "text": "Taste like A bunch of Indian spices, the only option for tacos are hard shells or flour, there's zero authenticity to their \"Mexican\" dishes. The only part that wasn't bad was the waitress. They should clarify that it isn't authentic Mexican tacos, it's like a Taco Bell for hipsters honestly but somehow mixed with Indian food ? I don't get it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GdY1sO0sYdnqEvG4gNw0rw"
  },
  "_Ld9Rl4MW9HR_Fc_sKDFlg": {
    "date": "10/26/2018",
    "text": "Great decoration and atmosphere. I was excited because I like the one downtown alot. I missed happy hour which was from 5 to 7 in the bar area. But I didn't feel like drinking maragrita. I got the surf and turf taco which is my favorite because of the ghost pepper sauce, also got the guacamole because they give you sooooo much for a great price!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SCTrnpH1ulIpBp-26P9I2Q",
        "caption": "Photo of Condado Tacos - Lawrenceville - Pittsburgh, PA, United States. Beers and guac!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SCTrnpH1ulIpBp-26P9I2Q/o.jpg"
      }
    ],
    "user_id": "pQU9P_m9OF-C5TciUbVKhA"
  },
  "ALcc5HtDHzFv_WnPJdk90w": {
    "date": "4/27/2019",
    "text": "Good margaritas, good chips and dip, fast service. Tacos weren't as good as everybody hyped them up to be. Staff was very young and constantly on their phones.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oRkWd-xJpVY5X5z78dfF8g"
  },
  "vkaWibfXQzE-MlIW_CZISg": {
    "date": "11/29/2018",
    "text": "Wow! The food the Art and just the overall feel is great.  The crew is well trained and fun!  Prices are surprisingly reasonable.   A must visit when you are in the area",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4YwzpmbohMBKHeoV7ozDAQ"
  },
  "Dw-GuRpvw9_PoMfS88ly4g": {
    "date": "4/5/2019",
    "text": "Delicioso! The margs & the tacos here are delish! And happy hour is 1/2 price margs and $1 off tacos 5-7pm M-F. We had an amazing bartender for pre-dinner cocktails and an equally amazing server for dinner. Prompt, attentive, friendly and knowledgeable/ the staff here is friendly and courteous. We had dinner in the sun-ground basement. It's cheerful, busy and colorful so you forget you're not above ground. The ofrendo del mezcal margarita is smokey, sweet and spicy all at the same time and is perhaps one of the best margaritas Ive ever had. The tacos are prepared equally as deliciously the cocktails. Great lively ambiance. If you're looking for quiet and romantic - this isn't the place... this is a fun Friday night with friends or a night with your partner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "igNpjD8hUo8OoGOCHX3hlA"
  },
  "uNUyt9w5EdIPeMp480xt0Q": {
    "date": "4/22/2019",
    "text": "I constantly dream about the food here! Hands down best tacos/nachos I've had. Doesn't hurt that you can custom order both! The two options- custom or chef created- make for a perfect meal either way. My hubby likes the chef created tacos. Every new taco he bites into he says, \"oh my, you HAVE to try this.\" Amazing each bite! I'm more of a nachos fan, and I appreciate that options available for topping. Everything all the way down to the tortilla chip is amazing. Also, their dips are phenomenal, too. I highly recommend their guacamole- those pickles onions are everything!- and their chorizo queso. Our last visit we opted for the queso blanco, and I found myself missing the spice of the chorizo. It was still delicious though! Can't wait to go back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BgY4NXGvwQsPvJlO-7uruA"
  },
  "b0fEQtURIpRyCcJif3eLtQ": {
    "date": "3/12/2019",
    "text": "I sat on posting this for a while, but the other night when I walked in this past Friday, there wasn't a change. The bar staff I encountered was rude and not attentive. I by no means want the server in my face, but she could use an attitude alignment. Great that Condado is expanding, but the service should come with that never had anyone rude to be at the downtown location even when they are slammed pack. My food was okay, and I don't think this place has the most fantastic tacos, but if I wrote in on my sheet I want it, and I was missing things off my tacos.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3gwqM0K5iPDugcy75Qal5A"
  },
  "fpGF_r36tGgaUxC-C1VRYQ": {
    "date": "4/21/2019",
    "text": "Very artsy contemporary vibe which I am a fan of. Food was pretty good and it's located in a ever so growing Lawrenceville.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bncm4IJeX39AuG8hatf4XA"
  },
  "G4K9XCVuVvaZeOqAaU3lsw": {
    "date": "3/11/2019",
    "text": "It sucks to leave a bad review but have to break it down. Tacos were really bad and cold. You would have more luck and money well spent at Taco Bell. Service overall not the best. Forgot my drink and unapologetic. Kinda my pet peev when people do that. Guacamole can be found in the supermarket. Low quality ingredients. I asked to make the guacamole spicy and got charged for pickled jalapenos. If I knew there were no fresh jalapenos, I would never eat there in the first place. It's a red flag. In addition there is no instructions on how to order the tacos if you are a first timer. I think that is on the server though. Overall everything was bad and I felt the place was dirty. It was unfortunate as it was my fiancee birthday that day.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MAcHAs6PGth70x-kJRixrA"
  },
  "raAhstt1mTx_zERkwU4djQ": {
    "date": "3/18/2019",
    "text": "If you like Tacos and an awesome atmosphere. Condado's is the only place to go. Been here since November and I can't count how many times I have had Tacos for breakfast. The bartenders are the best. I'm headed to a new town and will miss you guys.  Thanks James from Texas",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QL73hVzXhPTRElc8i3F3eA"
  },
  "kUd4OGP2NQ3Tqn7dGbcUcw": {
    "date": "4/7/2019",
    "text": "Great spot good food. A couple tacos and beers turned into a 60 dollar bill with tip which seems high even for the hipster environment of Lawrenceville but all in all it's a good spot and I'd visit again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "daVGGqJb8oJC_azW5Cx4XQ"
  },
  "1acD19pCfj2scuCietoUtA": {
    "date": "2/14/2019",
    "text": "Ever wondered what a taco spot would be like if investors googled what was hot with youth culture then built a restaurant off the first 5 results? Well, you get the idea. The food is passable but the service was terrible. At best we were an after thought for staff and had to sit and listen to deafening music while we waited on our food. As I mentioned, the food is passable but not great. It could be compared to overpriced Taco Bell. On the plus side they serve food until late, so there is that.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d8qB4gMilbxFG6vy9RS3CQ"
  },
  "tfJIcxhMjoRYhygQa_7i5g": {
    "date": "1/17/2019",
    "text": "There is no such thing as too much condado. This is our favorite place for tacos for so many reasons. The food is great and delicious. You can customize to build whatever tacos you want. I am a fan of the Juicy Lucy taco shell with pulled pork and pineapple salsa. And the prices are just right, especially for the portions. These aren't wimpy tacos. They are the real deal! We also love their dirty queso and that they have guacamole specials that add unique mix-ins and toppings that unexpectedly just work so well together.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fhAk9y00oF5yvXwn8gl3JQ"
  },
  "uFfF-zJW5Ebmlzm4i5DvrA": {
    "date": "3/27/2019",
    "text": "Great atmosphere. I've been to the one downtown but the lawrenceville spot was so much better. My tacos were made correctly and full of flavor!! Wish I could say the same about the downtown location.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xm1Ly1K6Iyhf2ZcfkP7uag"
  },
  "AFUWmPBlS4uFnQfOQzXEew": {
    "date": "3/27/2019",
    "text": "I've been to both of Condado taco's pittsburgh locations. As an avid fan of ethnic cusine with a special affinity for tacos I really and truly want to like this place. I mean I kind of do in theory, completely customizable tacos, queso dips, guac, and nachos. A cool and inventive menu even offering vegetarian and vegan options, who could beat that?? But everytime I go I am unfortunately underwhelmed, I don't know if I'm always choosing incompatible flavor combinations or if I just really and truly don't like the taste of Condado's food. And after three different tries at two separate locations, I'm leaning toward the latter. Customer service is usually not bad here, but the set up of the restaurant/bars are a little funky in my opinion. All in all not a bad restaurant, but definitely not my favorite place to get a taco.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jNmFKflxBihlh0vxw5yrUA"
  },
  "LUO1_gWqxc9wXhiZnkpwaQ": {
    "date": "6/22/2019",
    "text": "Busy and brightly decorated. Lots of combinations for tacos. Definitely worth checking out. Service was prompt and our server kept tabs on us. Friendly staff. Fun atmosphere but very loud and tightly packed when busy. Great for a casual dinner when you want quick service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6krN7tPgc9AtVz_r9WpznQ"
  },
  "Y8i9-0XfdrGGZ_OVvv3VUQ": {
    "date": "1/5/2019",
    "text": "If I wrote this review based solely on the food, I would give Condado Lawrenceville higher marks. Everything was great! Tasty food, reasonably priced and good service. However, this is just part of the equation in this case. I like a place with ambiance and this place just doesn't have the right vibe - at least for what I'm looking for in a dining experience. They squeezed way too many people into the space. The music they played was unrecognizable. It was too loud and just awful - and I like all kinds of music. And most of all, what they did to the beautiful space that was Tender is just criminal. If none of this matters to you, by all means go here because the food is good. But if you want a more chill place where you can have conversation, this might not be that place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "21W8iTZGWdCk1utgudcToQ"
  },
  "uHd9c8jukcdUB91dSIyt7A": {
    "date": "6/17/2019",
    "text": "TAKE MY MONEY! I am obsessed with Condado and feel lucky to live within walking distance. The food is affordable and delicious. I wish it was a little quieter and I don't love sharing my table with strangers. However, sitting in the back room or downstairs is quieter and I do a lot of take out. Friendly servers. Keep it up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AWHIqL73-r53VtdFZv1GAw"
  },
  "hWjZvnWvhFKKGJa47aCLSw": {
    "date": "1/21/2019",
    "text": "This place is rotten! Went there on a Sunday night at 7. Sat for 25 minutes while we were ignored by the waiters and then saw a fight about who was assigned to our section. Finally got waters and ordered. Food was cold and they never came back by. Had to go to the bar to ask for refills on water. We also had drinks, but they never came back by to see if we want another. On top of all that, the place if filthy. There is a layer of grim on the tables and floors. Do not go.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "znHFwzoCWziEAjjwMgLI7g"
  }
}