{
  "n5Gwu8kpO2B0oLO11zStqQ": {
    "date": "9/13/2009",
    "text": "Winner of many awards for excellent ribs, pulled pork and chicken. Great management. Recently added a 2nd location in the strip district. Primarily just take-out but they have a few outdoor park benches for good weather. Absolutely the best in Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "giI0L-STpJd_bEuBvqt-2Q"
  },
  "4Kwgfg8v350irFVE3BJe3Q": {
    "date": "4/30/2016",
    "text": "As you drive into the lot your mouth begins to water because you have just taken taken in the heavenly smell coming from the smokers.  You will find that the food is  just as heavenly...and the ribs divine...this was our first meal but won't be our last one at Two Brothers...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VNPEOZieQxbry4xmFbtAZA"
  },
  "W4LeID4EpTn39cMo-rqhmg": {
    "date": "8/12/2014",
    "text": "Great BBQ! Had the brisket and the pulled pork platter with potato salad and Mac n cheese. The whole meal was amazing!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HxK7chGwceuKol0zD3rbhg"
  },
  "QQ4vPEf4O2ONotghOxtDCA": {
    "date": "6/26/2013",
    "text": "The Fried Shrimp and Bacon Po Boy and Brisket Sandwiches are game changers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ccfYicnJienP1eZa86m-Vg"
  },
  "z0dYCBG9--U5XFTXWyNbfw": {
    "date": "9/19/2013",
    "text": "Got ribs, Mac and cheese, and bbq beans. All very good was very surprised at beans tons of flavor. Got all for only $13.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2M9m15DtMgoUyxMfXey4Yw"
  },
  "g9J1HzBKOR9xdf8BaTE9zw": {
    "date": "5/23/2015",
    "text": "Haven't tasted the food yet but based on service alone I'm very disappointed. Waited over an hour for a small order. No apology or explanation. Bad attitude. Won't be back anytime soon",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dB2vjCoE5et2raN1AEj5uA"
  },
  "PsRopOXsF44YwdCQmS9anA": {
    "date": "8/8/2013",
    "text": "Everything was really tasty! Pulled pork, mac and cheese, cole slaw, and cornbread with a hint of jalapeno. It's a small place, all takeout. They have several picnic benches with umbrellas, so it makes for a nice little picnic. An earlier reviewer said they only take cash, but they were accepting credit when we went. If you like bbq, you definitely need to try this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N1d9IVzvvT1bwoHeCovLXg"
  },
  "BsRsWfLLem48wrDNHsER8w": {
    "date": "5/6/2015",
    "text": "The most authentic bbq you are going to get in pittsburgh. Very good food and huge portions. I just wish they had more locations.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iz-bIFsLSlCxp2hSqBQChg"
  },
  "MuI6vd5uy7wdJuwKsCBukg": {
    "date": "7/3/2016",
    "text": "first time here ordered egg rolls,half chicken dinner,poy boy, wings,and half rack dinner.everything was very good.will be back.next time im going next door to get a case to drink with meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1kXccJQ9a6kflhUs82dXyg"
  },
  "ijWnsNtKFQTlUG7voq-CFQ": {
    "date": "5/7/2012",
    "text": "If you LOVE BBQ like I do , you GOTTA try this place. They have a great menu with something great for everyone... I had 1/2 rack of hot rib's and wings !There's even a beer store right next door ... What more would you ever need ?Yummieeeeeeeeeeee. 5 stars",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "67IMqiMGTTlobnDMEWszmw"
  },
  "ZtKqciUZtXfhTdOgsVUEZg": {
    "date": "9/12/2014",
    "text": "For the East Coast, especially this part of western PA, the BBQ was very good. I had beef brisket and BBQ chicken with baked beans and cole slaw. As a FYI, there is no indoor seating here... there are nice picnic tables with umbrellas. So bring a jacket if it's cool or do take out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nz-kbFesFhb0S-8Q6PsEQw"
  },
  "W8L1tyC7fQD5JuUOTyDv3w": {
    "date": "6/26/2011",
    "text": "We stopped here after a long morning of yard sale-ing needing some sustenance. I'm always skeptical of bbq places after having experienced the pure bliss that is Slows BarBQ in Detroit, Michigan, and I wasn't expecting much. Well, color me impressed. I had the pulled pork with the spicy sauce and it was moist and tender and the sauce was quite tasty. The macaroni and cheese is good, although nothing to write home about. The corn bread has little jalepeno bits in it and a hint of sweetness. I'll go so far as to say this is now the best barbecue I've had in the Pittsburgh area. Especially for a shack on the side of the road!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "M9MXoSsb193m1g0QmmUYBQ"
  },
  "UGPLubG5lvsTEeDEs9neVg": {
    "date": "6/11/2014",
    "text": "Loved the food here, portions were a little on the smaller side, but the food overall was one of the best for BBQ that we have tried. The brisket was excellent very tender and juicy and smoked just right we also got the chicken which was pretty good as well, we were a little disappointed that they didn't have beef ribs only pork because we go to BBQ places a lot and love beef ribs, maybe someday they can add them to their menu. The sides were ok but very small like I had mentioned and the Mac n cheese was a little original not much flavor. I would definitely go back maybe for takeout but the overall service was horrible the woman at the window was extremely rude to every customer and very irritated with everyone, we felt like every time we asked something we were a bother and she said you cannot even sample the sides or sauces and just the whole way she proceeded to take our order and others was with an attitude when we came up to order wings as well it was like wecouldnt even ask any questions, because she didnt want to be bothered,  poor customer service and business ownership. To add to this...the wings we tried  at the spare of the moment, garlic parmesan and they were excellent, some of the best I have had, or maybe it was the sauce?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lvGyDFhe8Yh9yg4knY-i-w"
  },
  "-KfpjJKzemiarAxXJYTf1Q": {
    "date": "9/21/2012",
    "text": "I love the fact that you can pull over to the side of the road and get great bar-b-q. The ribs were huge and tender. Pulled pork was also delicious . I would suggest this place to anyone looking for Bar-b-q in Pittsburgh . Great job brothers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7wmjkbq-iTG1_z62fgnvoQ"
  },
  "SkcfC1zM-fECwGNn9y2Qiw": {
    "date": "4/23/2014",
    "text": "2 bros catered our wedding reception and we got TONS of compliments, even days later. prices are great too. wouldn't change a thing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GS6MGLQTf0h5d9vL2cgwqQ"
  },
  "ZAo2LWEeFTlFiEXIicFrLA": {
    "date": "7/31/2014",
    "text": "Finally!! Having moved to Pittsburgh two plus years ago, I've been searching for great BBQ . For me, I found it at Two Brothers BBQ just slightly south of Pittsburgh. The drive was only 20 minutes from the North Hills (Sewickley). Two Bros. Is easy to find, although my GPS said it was on the left and it was actually across the street on the right. Their menu has many options, but we love the brisket and pulled pork, taking home a pound of each after lunch. If you love BBQ, eating at their outdoor tables is fitting and fun. Great sauce, both mild and hot (my fave). By the way, they take credit and debit cards.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wdDdwIJe-t4z0DgILVyMtg"
  },
  "LiYJZlntu_qQqchuqVmX3g": {
    "date": "8/29/2009",
    "text": "The best BBQ around!!!  Try the Pulled Pork Nachos!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XT_Ns6Asav0d7NhBWW7pUQ",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XT_Ns6Asav0d7NhBWW7pUQ/o.jpg"
      }
    ],
    "user_id": "dsvPsJjn5DI8sJngq8y1xA"
  },
  "FNl4sk5QzBQGkS_BT5CyHg": {
    "date": "11/11/2012",
    "text": "Excellent food, large portions. Out in the middle of nowhere but definitely worth the trip. Recommended",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ri5LGh5ioMMOqm8JybpdOQ"
  },
  "W9u5V20KL2Et2X6LOT_f1Q": {
    "date": "5/24/2010",
    "text": "I LOVE THIS PLACE! I think Pittsburgh is a great eating town, and this still tops my list! For me the necessities here are the pulled pork nachos and the beef brisket--of course, smothered in the BBQ sauce, probably some of the most flavorful BBQ sauce ever (whether hot or mild).  I'm glad to know they've expanded, though this location will always be my favorite. I love walking up to the trailer and eating outside at one of the picnic tables on a sunny day! Just wonderful!  P.S. CASH ONLY!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "mnDcilbDG8tw648CrlOn8w"
  },
  "KxBNAkEZxKW16qv9YoZZuw": {
    "date": "7/29/2011",
    "text": "Great food good price well worth stopping down in presto it only minutes from Carnegie or bridgeville. Has a few outdoor tables and does take out and catering.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q4E_ImMbl-mP62WgwDlfpg"
  },
  "VJYkHMUQwGCCDmqhLFkOsQ": {
    "date": "8/28/2010",
    "text": "Good food. Fabulous staff. Quick service. A large portion of ribs for a half rack. Food tasted fresh and was served hot in under 10 minutes. You will get your moneys worth here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xY1zfShmkxuvtbGpXXmuaQ"
  },
  "VslZqHWXANUFeakNrkJ-lQ": {
    "date": "6/23/2014",
    "text": "Ahhhh... BBQ. such a satisfying treat and recently my husband and I found ourselves in the area and looking for a place to eat. Apparenly most places are closed on Sunday but we were lucky enough to stumble on Two Borhters and check it out.   Located in a parking lot with picnic tables to \"dine-in\", the amped up food truck looks, cheerful and well maintained - very clean. The menu has a number of items to pick from including brisket, pulled pork, ribs and chicken (plus some other options as well).  My husband opted for the brisket sandwich and I had a half rack of ribs dinner.  The sauce - obviously house made - was fantastic - just enough of a kick and sweetness. I got baked beans - also clearly house made and easily some of the best beans I had ever had. The ribs were really meaty and with the sauce - perfect! The brisket was not bad either although I feel the brisket at Pig and Chicken is better. Either way - great meal and a place we would not only recommend but likely make another special trip down from the city to enjoy again. it is a little pricy - both meals with bottles of water hit $30 and you are also expected to tip although it is a pick up window and you bus your own table.   The reason it is not a 5 star review is pretty much non-food related. First, the woman at the window could not be less friendly and inviting. Either she hates her job or is just miserable. A question my husband had was met with a look of annoyance and when i tried to pay her a compliment - that was met with stony silence. Maybe it is just me but having a welcoming person to interact with customers is pretty important - especially at a food truck.   We were also put off by the tip thing. We paid with a card and when the screen came up - she turned the screen around to us and said - you can put your tip in here and just waited. Again, we are picking up our food, we are cleaning up our trash. I don't normally tip in this situation but you are expected to... um, ok? I ended up leaving a couple of dollars in a cup. But honestly, why are we tipping? Are the employees not paid enough? Maybe this is why she is so miserable. a tip at a place like this should not feel like an obligation.   Anyway... we really enjoyed our meal and would totally come back again... next time I am going for the pulled pork ;)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7bymkn2vy7QV2ry9TDWraw"
  },
  "5wlvWux7yQkEVnjg0g_l5Q": {
    "date": "2/1/2014",
    "text": "We used their catering service for our wedding and were THRILLED! I couldn't count the number of complements we received on our wedding food. The amount of food was perfect! Plenty for those who wanted seconds. They are about to travel (even in a snow storm- thank goodness!) They are prompt, professional, friendly and took care of everything. They are also super affordable, and as a bride on a budget, I really appreciated this. I 100% recommend them and plan on using them for any of our family's future catering needs.   (Thank you JP and Terri- you guys were awesome and a highlight of the wedding!)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ndBHcZn8ivIrACwh1KXzng"
  },
  "SvKpKaDM9JXDElJTIOBOrg": {
    "date": "7/24/2016",
    "text": "Ribs are so good they don't need sauce!  Chili is delicious.  A little pricey and the cashier can be unfriendly, but all-in-all not too bad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HLiSNRuix7klzayUa-2ong"
  },
  "4ylDhwwZlm28FPdy4m__HQ": {
    "date": "7/12/2017",
    "text": "BBQ chicken sandwich is amazing!!!! It's huge so you can easily split it with someone....I don't so don't feel bad if you eat the entire thing. I think it's too good to share! My husband loves the pulled pork sandwich! Love the food! Highly suggest calling in the order...it's made fresh so waiting on the food can get a little long.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T20MVmg6bi2qqub8LZ7yiQ"
  },
  "z0UUfxJA8oo7i4bJfIFeiA": {
    "date": "10/15/2013",
    "text": "If you lament the lack of barbeque--not to mention, good barbeque--in the Pittsburgh area, you'll be extremely happy that this place exists.  I first heard of Two Brothers by doing a Google search for the best ribs in Pittsburgh. A WPXI/Channel 11 survey came up, and Two Brothers had been voted as the most recent winner of their Pittsburgh's Best Ribs contest. But then I thought to myself, where the heck is Presto? I looked it up on Google Maps, and...hallelujah! Just a short drive from my workplace!  My coworker and I decided to try it out the next day, arriving at around 11:30. I ordered a half-rack-and-half-chicken dinner (with sides of cornbread and potato salad), and he ordered a full-rack dinner (with sides of macaroni and cheese and cole slaw). I guess we went at a good time, because there were only six outdoor picnic tables for seating, and we claimed one of them before the rest were taken. Tables are covered with shade umbrellas, and there are rolls of paper towels in the middle of each table (like at other authentic barbeque places), as well as toothpicks and moist towelettes.  The ribs, I must say, were amazing. I've probably had ribs from over 10 different places across the Pittsburgh metro area, and these were the only ones I would consider excellent. There are outstanding--I would say, possibly even better--ribs to be found across the border at Barry Dyngles Pub in Boardman, Ohio--and I did eat those in Pennsylvania at a catered event--but it would be kind of a stretch to call Boardman or Youngstown part of the Pittsburgh metro area.  Anyhow, Two Brothers' ribs: They're firm but tender, deeply smoked, \"buttery\" in taste, and come off the bone fully but neatly. They're served Texas-style--drizzled with just enough sauce. As a Texan myself, I like my ribs coated with only a dry rub and minimal sauce, so these hit the spot. Having that smoke flavor is also extremely important to me when it comes to barbeque, and these ribs didn't disappoint. My coworker loved his ribs just as much, saying they were the best he'd ever had other than his dad's. (He didn't finish the second half of his full rack, but he said the next day that they were just as good after reheating them in the oven.)  My chicken was okay but not impressive. The skin was smoky and crisp, but the meat itself didn't really have any flavor. Barry Dyngles' chicken definitely takes the trophy here.  As for the sides, the potato salad was pretty standard, but the cornbread was good. Not out-of-this-world good, but decent. (I didn't ask my coworker how his sides were.) Also, they'll ask if you want hot or mild barbeque sauce on the side, and we both got the hot sauce. It was good but not necessary for the ribs.  The second time we visited, we both each ordered a half-rack and a bowl of gumbo. I found the ribs to be almost as good as they were the first time, maybe just a tad drier. My coworker said his were just as good as they were previously. The gumbo was okay, but I don't know if I would order it again. It was topped with plenty of big pieces of Andouille sausage and chicken, but it tasted weirdly sweet and had only a few specks of vegetables and no visible okra. It also seemed to be missing something seasoning-wise.  I'm eager to try the pulled pork, beef brisket, and baked beans next time.  Service is alright. Pretty business-like--not bad but not especially friendly, either. One neat thing about Two Brothers, though, is that they use an iPad for credit card transactions. I've only seen this done at a few hipstery coffee shops, so it's a pretty unexpected touch (no pun intended) at a little shack of a barbeque joint. It's a huge step, I would say, from what I'm reading in reviews from two years ago, when it seemed like Two Brothers didn't even accept cards.  Customer traffic is steady, and I assume that Two Brothers does pretty good business. There's a wide variety of customers, ranging from business people to construction workers. If one can get a table, I think it would be a neat place to hang out for lunch on weekends, with the convenience of a drive-thru beer distributor sharing the same parking lot.  Whether you have the opportunity to eat your food on-site in its Styrofoam clamshell box or have to take it with you someplace else, the barbeque is worth going out of your way for, and the inconvenience of not having much seating--much less seating that's indoor or climate-controlled--should not deter anyone from giving Two Brothers a try. With so little competition around--both good and bad--it doesn't seem like it does.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "TwagK-fF6ceDSpxsR4yF4w"
  },
  "PmcgspB-5fpajDH5MndjOQ": {
    "date": "3/23/2015",
    "text": "The first thing you'll notice on a summer day with your windows down is the smoke. When you see the trailer, you know, this is going to be great.  Ribs, pulled pork, brisket, burgers, and more. It's all good. My girlfriend swears by their pulled pork egg rolls, but go early, they sell out.  The seating is all outdoor, which is fine. Obviously, if it rains it makes it an issue, but it's still so good.  You can get big orders to feed big groups, if you've got a big gathering, begin this and make friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FyV1Un8Csw3beQ9vOkk7lg"
  },
  "zmnFiVa5LZGgy5MfM5JEBw": {
    "date": "11/22/2013",
    "text": "This place is fantastic! If you are looking for the best pulled pork around, this is the place to go! I love the jalepeno corn bread too. It is a small(ish) traveling pit stop that will make your mouth water. Great for football party food too. We are glad you are nearby.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PuCMCx8LvgUWgZhnt2PHJg"
  },
  "hIrcFd7XmH17NW-IL8BB7A": {
    "date": "6/20/2015",
    "text": "This place has that Roadside BBQ gem you've always wished for feel.. and does a descent job of meeting that expectations !! We went for the 1/2 rack of Ribs and 1/2 Chicken meal ... Meals come with 2 sides that are just enough to give 2 people a taste .Potato salad was a hit but the Mac and cheese was cheesy but lacked flavor and crunch ! The ribs were meaty and cooked perfect! The meat was tender and you could easily clean the bone if so inclined (I was) . The chicken had a nice blacked skin which makes you wanna fight over it !! We got the mild and spicy sauces , both were extreme flavorful and left you licking your fingers. You could eat at the picnic tables provided but it is in the back of a parking lot so  if ambiance is your thing .. Probably best for pick up which most people did. I would definitely try other dishes",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HPMv4_YAavoKqjgajXleqw"
  },
  "8OixvZroSLF3lOecpWwQpw": {
    "date": "4/4/2015",
    "text": "My mouth waters at the thought of some Two Brothers' Brisket, or the Pulled Pork, or the Po' Boy....AND THE RIBS?! Don't even get me started on the ribs - they're fantastic.  In fact, everything at this place is, from the food to the people - it's all really good.    I am fortunate enough to live about 2 minutes away from this place and even if I lived further away, I'd happily drive to this place to grub up.    Just today I went down to get my favorite item, the brisket sandwich.  The couple ahead of me ordered a full rack with all the fixin's.  They threw a curveball when ordering the sides - they said some magical words that I'd never heard before.....\"Pulled Pork Eggrolls\".  Yea.  You heard me.  Needless-to-say, I had to order them.  But I was torn, how could I betray my one True love, the brisket??  So, in the end, I ended up getting the eggrolls with a side of some brisket, I had to.  And they were nice enough to accommodate that request.  (But they did have some fun teasing me because I always order the brisket)   And maybe that's what makes this place so great.  Sure I could go on about how the wings are boundlessly juicy and taste fire-kissed, how the pulled pork sandwich is piled so high with succulent meat that you have to always eat the scraps that fall from the bun (it'd be sacrilege not to), or that the ribs flavor dances across your tongue as if  your mouth has opened residence to the famous Russian Imperialist Bolshoi Ballet Company.  Sure I could say all that, and it'd all be True.  But I love the people too, and they're definitely part of this story.  Go see for yourself - you won't regret it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mgrIy4Qrv9MeYrnN8-QDdg"
  },
  "xVjAuZ510BLqYenHvgo6gA": {
    "date": "10/18/2014",
    "text": "Best BBQ Around, food is simply amazing, service is great, and plenty of parking! I luv going here time and time again. Such a great place to go for yummy bbq food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2AhFmqwzlaW7QB0PbnJEcQ"
  },
  "hv0b5Ogem0asE8SdG6zp6Q": {
    "date": "5/30/2015",
    "text": "Being from the south I guess I have higher expectations for bar b q. Food here was good but not up to levels I've had in the past. I rate it as average. Definitely skimped out on the sauce. I'll go back but would absolutely prefer joints down south.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "km2sN1hVTHXpw4eXR6fc0Q"
  },
  "Bg92gG56yGrnf1Zb3QWpuQ": {
    "date": "6/21/2015",
    "text": "Good food! Portions are reasonable, menu is diverse enough everyone can find something. No indoor seating so go on a nice day or you'll end up eating in your car.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ygpTWieOmS1nE4Ft-qdWg"
  },
  "BrR06sHHiJ7R9BuQ-MM-cg": {
    "date": "5/31/2014",
    "text": "Excellent beef brisket with mild or hot flavored barbecue sauce ...tender smoked baby back ribs what more can you ask for",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sef8t9tk67p8X-ShCaYRIQ"
  },
  "cr_VFMtDkUK3dzAWm4a1uw": {
    "date": "9/13/2016",
    "text": "First time at Two Brothers and definitely not the last. The pulled pork eggrolls are not for dainty appetites -- two behemoth cylinders of crunchy deep fried goodness stuffed to the point of bursting with succulent pulled pork. The hot BBQ sauce was a bit too much, the heat overshadowing the juicy smoky pork. Husband had a pulled pork sandwich, which was piled high with meat on a sturdy Kaiser roll. Son loved his 1/2 rack of ribs, moist and meaty, topped with sauce. We all had sides of baked beans, which were delicious, loaded with their house smoked bacon. Son had an additional side of mac-n-cheese and cornbread, which he deemed good but not remarkable. Staff was friendly -- and the smell of roasting meat was wonderful. We took our meals home, although there are picnic tables for dining on site. We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EnCxzX8jtT1qqZB6fEHwMw"
  },
  "dEVr3yGp_18ZHJDhF9KNHw": {
    "date": "4/18/2014",
    "text": "Yes, this is a hidden gem! I had wanted to try it for years, and the opportunity arose when friends visited from out of town. We ordered take out, and it was ready within 35 minutes. The food was so fresh, and exactly what you want from a BBQ.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FBd1Qjnnc1Loh7ZY7FD9Zg"
  },
  "iBxO3WkmDWwVQ0Ymjd5Cpg": {
    "date": "12/9/2014",
    "text": "This place is tasty! The brisket is delicious and the mac and cheese is wonderful. We even ordered fries and our order was ready within 10 minutes which was great. Prices are a little high ($30 for 2 at lunch), but the food really was very high quality I wish they had an indoor location for seating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AlycOrSWiIb8RLvhJENHxA"
  },
  "2UibMPpkxNay826lW5w_UA": {
    "date": "9/26/2014",
    "text": "I love absolutely everything about this place! From the wings to nachos to pulled pork sandwiches! I usually get a bottle of sauce to go and use it on everything at home! During the busy hours the wait is well worth it! Also nice sitting area to byo beer or wine and enjoy your bbq :-)!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KUIj6XfQH0qqHSXc7jEfBA"
  },
  "j-PO4qt73VcFs39jzQ79HQ": {
    "date": "6/27/2016",
    "text": "Very good bbq! I would get the beans, so good! I luv the pulled pork nachos and pretty much anything else they make. This is a must place to try and while the prices may seem a bit high for a place on the side of the road, I continue to Lee going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YAC7mZQ0wkuuz5K-iwAH_Q"
  },
  "OJQqro8tfZfBNUpMbveSiA": {
    "date": "7/16/2015",
    "text": "Their BBQ meat is awesome - smoked sausage is killer.  The sides are so-so but the baked beans and coleslaw are the best out of the bunch.  Gumbo is nice and spicy.  We liked the food so much we are having the ribs, pulled pork, and the chicken for a family reunion dinner.  Still looking forward to try their smoked chicken wings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yzNjrknwfCCKOZqjoHZXwA"
  },
  "1j6o2kkdIe1Ood1yqYKIaQ": {
    "date": "9/29/2014",
    "text": "We had a barn party catered yesterday.  Everything was great!  We had the backyard barbecue. Hamburgers were huge and delicious! Pulled pork and chicken were also great!  Mac and cheese and Caesar salad were also great!  The set up was clean, and everything was handled very professionally!  Totally recommend these guys!! Also a shout out to Terry!  She answered all of my questions before hand and made me feel completely confident with how they would handle things!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cr9jCysQCYVH_Pw168sRPA"
  },
  "W5NOiEaiphsxdobW7hk25g": {
    "date": "10/10/2017",
    "text": "Excellent bbq some of the best in da Burgh area. Good variety to choose from, your stomach will love you. Prices reasonable, and location is easy to get to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r5iu6xjD9UEwSlAIiTmaNQ"
  },
  "BfEwOVz5XGU2-lVDrNQ74Q": {
    "date": "5/21/2017",
    "text": "We drove about 40 minutes to try this BBQ based on all the other great reviews as we often will travel to try something we haven't before.  It's a cute little trailer across from the Presto fire department. There are picnic tables with umbrellas. We both ordered chicken breast with man n cheese and baked beans. As we waited it begin to rain pretty heavily but the umbrellas kept most of the rain off. During our wait at least 10 other people came and left... we assumed most had called in for take out orders..  as we waited we realized there were no restrooms. So FYI: the guy at the beer distributor is really nice and let us use his...  Finally our food was ready... as we opened the bag and took out the containers everything look good an smelled good...   And that's where the good ends... My chicken was a soggy, watery mess.. that resembled a wet plastic dog toy.. and I even began to have concerns of it being cooked the whole way... So I asked to try my husbands to see if his was better.. and it was.  So I ate my lackluster sides and waited until the people placing orders were finished and in the rain I took my styrofoam container of soggy chicken up to the window..  I began to politely explain .. and was met with rudeness... and was told its like that because its marinated.. and that it is cooked to temperature... blh blah blah...  I Told them my husbands was better. Their response was that mine must have been in the  \"deeper part\" of the marinade.(seriously??? I may have fell off a truck but it wasn't yesterday!!).. at this point I relized I knew exactly what they were doing and they would never admit to it or even try to make me happy... I would have settled for even just a sandwich of some type... but NO!!!  They know darn well that they steamed this chicken after the fact and it was now a nasty mess and I was stuck with it!! I still am so upset by their total disregard for my issue and I just walked off the porch and tossed it in the garbage! I hoped they liked my money because its the last time they will see it!!!!!  Response to your questions: Being that we didn't leave and sat there to eat not closing up the containers to take any place, I am not sure how any condensation could have formed. As soon as I opened the container yes I put the bbq sauce that accompanied my meal on top, this photo was taking within 2 minutes of geting the food. I am not surprised by your response because I figured since after getting the food I went back up to discuss it and instead of being combative with me and just provided good cutomer service, this situation may have been resolved. MY order consisted of 2 pieces of alleged chicken, mac n cheese and baked beans. No other meat.  WE also sat there and waited well over an hour, so even with 15 min of cook time it still makes no sense.  Perhaps instead of trying to make customers look like they did something wrong, you should just provide a good product, I am a reasonable person and know not every  thing will be perfect, so maybe next time when a customer has an issue take it seriously instead of treating customers poorly",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2OJ_arYFSxYLDlWLlXLccQ",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States. Even in this photo you can see, it looks like this chicken sat out in the rain!!! And this was how it was given to me ( minus the sauce)...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2OJ_arYFSxYLDlWLlXLccQ/o.jpg"
      }
    ],
    "user_id": "q3dIqTQTC_PFk95q_aEhHw"
  },
  "A3WaEWR1-2YQeiBs6-IL8w": {
    "date": "7/8/2014",
    "text": "I hadn't been in a couple years so I thought I would see if much has changed.  The food was definitely better on this visit.  I wanted to give them 2 last time and couldn't do it just based on one visit.  They could just have had a bad day.  I ordered the same this time.  1/2 rack, beans, slaw.  It was good.  I would return.  I think some things could be better so I hesitate to give them 4 stars.  The ribs are good.  I like them to be a little juicier but they were definitely not as dry as my first visit.  I liked the mild sauce.  It has a little tang and is sweet but not sickeningly so.  They have a rub on them but it's indistinct to me.  Does it sweat off in a wrap as they hold them?  I don't love the texture of them and maybe this is a heat issue on the smoker and maybe it's the way they hold them.  I still like them and gobbled them up.  The slaw was good and had a lot more flavor to it than the first time I tried it.  A little sweet with a nice tang.  The beans weren't swimming this time and I really enjoyed them.    This is a trailer, not a restaurant but I do wish they would do a couple things to rise above.  There's no recycling.  None of the product they use to serve and package is recyclable except the grocery bags. Not even the aluminum foil lined tissue they put in the bottom of your styrofoam box is recyclable.  DON\"T serve my food in aluminum!!!!!!  I also saw they wrap their ribs in aluminum foil and I hope they use plastic wrap first.  Either way, I bet they're throwing it away.  If you aren't going to offer recycling or use recyclable product, buy biodegradable.  It's time to take some responsibility.  It's not the 70s anymore.  I didn't order a drink (all bottled) or I would have taken the empty with me.  You can do better than this and for $15 a half rack I think you could step up and spend a little more money for some better service ware.    It probably won't be 2 years before I return again.  Maybe I will bring my own service ware and have them dish it out on something else!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2wFpHNYp5fzMSI4MXmItQw",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States. 1/2 rack dinner",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2wFpHNYp5fzMSI4MXmItQw/o.jpg"
      }
    ],
    "user_id": "QQtoHnP0cP7nzNnUob_1CQ"
  },
  "4njtcL0Whb6Y8nCUKMdaXg": {
    "date": "8/11/2018",
    "text": "I want to give it a five. Had the ribs, basic poutine, slaw and macaroni and cheese.  Everything was really delicious. The flavor of the ribs were really good and they were the meatiest ribs ever. I like them falling off the bone and they weren't. Despite tasting great, I felt they needed more time to cook. This one star off. I will definitely go back though. I liked eating outside on the picnic tables too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mp_qeT89Cbu6qKEshBDBWA"
  },
  "GxMFu7vSc6TLY5ls3rR8Kg": {
    "date": "9/24/2017",
    "text": "Weird little place but the brisket was excellent and my boyfriend's pulled pork sandwich was great. Mac and cheese side was pretty mushy and not great. The cornbread, however, was my favorite part!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z9gzNYnjaCq_oIKEpCUzNQ"
  },
  "1GzThhRK5Yu5ySv2N5y-UA": {
    "date": "9/2/2016",
    "text": "Love it.  The smell of the hickory smoke gets me every time.  I recommend getting a pound of the pulled pork and then taking it home and make your own pulled pork sandwiches!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ozrxTY4IbT3uuc_9wNXO3g"
  },
  "grkdJ093tEATXgWn_hg07w": {
    "date": "8/14/2016",
    "text": "I have never been a huge BBQ fan but I came here and now I keep wanting to go back every weekend. I've been a couple of times and have not been let down. Their pulled pork egg rolls are huge and so good. We tried the new chicken ones too and those are also good!  I got the dinner with brisket and pulled pork along with baked beans and potato salad for sides - and are we're so good.  I can't wait to go back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Z26i4Awq1_cRMw35LmX9Q"
  },
  "bEmqtZHv3cwc0NJqDh45og": {
    "date": "10/2/2016",
    "text": "Back again... Had the pulled pork sandwich. Great little spot. Owner came out to inquire how everything was.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4MW6sjKNfV9Qzlx7pLzcrA"
  },
  "6fCzRl_GLlcHWVXoJigL0A": {
    "date": "5/6/2018",
    "text": "This BBQ is wonderful. The pulled pork sandwich was probably the largest, tastiest, and most tender I have ever had. The house-made pickles add just the right crunch and acidity to accompany. The pulled chicken egg rolls were crispy, spicy deliciousness! The staff were fun and informative. Be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YoYAP_CjnfYtQOJWTK8Atw"
  },
  "v4nCZa5nRkUXCCrjTr9NTw": {
    "date": "7/4/2015",
    "text": "I have been many smoke houses and tried many different ribs.  This by far is one of the best, if not the best.  Pittsburgh's best ribs by far.  They have many medals indicating so as well.  These delicious, succulent ribs fall off the bone.  The Bbq sauce was excellent. Very excellent quality meat and not fatty.  I ordered the full rack.  The full rack is prolly enough for two average eaters.  A half rack filled me up which allowed excellent left overs.  The fries were very good as well. My wife had the half chicken.  It tasted good and was moist.  Only drawback was it was all dark meat.  All their meat is smoked and cooked right outside their restaurant.  Be prepared to eat outside.   Eve though you are outside there was no issue with flies or birds disrupting your meal.  Very well kept and clean.   By far the best BBQ in Pittsburgh.  I definitely will stop by every time I come back to Pittsburgh.  I only wish they could ship them back home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fFGZhsAU7ni5Et043hyI1w",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States. Half Chicken &amp;amp; Mac&amp;amp;Cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fFGZhsAU7ni5Et043hyI1w/o.jpg"
      },
      {
        "img_id": "bkTfl11--uWyvMmv3pWaTw",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States. Full Rack Ribs &amp;amp; Fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bkTfl11--uWyvMmv3pWaTw/o.jpg"
      },
      {
        "img_id": "2rUbaUGKTpB838ofgGX00w",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States. Restaurant",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2rUbaUGKTpB838ofgGX00w/o.jpg"
      }
    ],
    "user_id": "8d7Ja4I1PogIJ4307dkSig"
  },
  "6QPYlfFambzhWLm8GW0y_A": {
    "date": "4/19/2018",
    "text": "Two brother makes incredible food!  Their beef brisket is fantastic and you can't go wrong with any of their sauces.  I have never had a bad meal here.  Only negative is they aren't open all year. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gdxMuDiR_5GTp8jXb3ugJg"
  },
  "yc0r_uAeBjH87Zfn5eAiRg": {
    "date": "8/8/2017",
    "text": "Consistently good.  Love their pulled pork, chicken and ribs.  Solid smoke flavor without overpowering the meat.  Large portions on the entrees. Two choices of sauce, mild and hot. Neither one will knock your socks off, but will suffice.  I usually have a couple of my sauce favorites on hand at home for take out. And take out is what I usually do.  At the location, there are a few picnic tables that you can enjoy if the weather is nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z_4FiLBNho5uF5fKX5oXRg",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z_4FiLBNho5uF5fKX5oXRg/o.jpg"
      }
    ],
    "user_id": "Pc91H_ESc5lAH86lkQGpqw"
  },
  "RBqalLKSiQXO_gbJHnHKWw": {
    "date": "5/27/2017",
    "text": "This place is perfection. I've never had a bad meal here. The only way it would be better is if they would be open in Monday's but I understand everyone needs a day off . Their food is so good so my company always hires them to caterer our company picnics.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PnX9YRYFOaVU7keG_99-UQ"
  },
  "yiR5YYbbVvbN6dpnM1HzSA": {
    "date": "8/7/2014",
    "text": "From the brisket to the fried crawfish, this place has the goods.  Even the Mac and cheese is legit.  Be prepared to wait, the last three times I've eaten here it's been over 20 minutes each time- but it's always worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xx0soYuwNzDkaUQIpK4Qnw",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States. Fried Crawfish Poboy",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xx0soYuwNzDkaUQIpK4Qnw/o.jpg"
      }
    ],
    "user_id": "MCsNB80uwohCMB16vc0mTg"
  },
  "qJq2-mktOwnzCrW1CmZcaQ": {
    "date": "6/12/2015",
    "text": "Easily the best BBQ I've had in Pittsburgh.   The ribs/pulled pork/burger/Shrimp Poboy were all especially delicious. The pulled pork quesadilla is my absolute favorite and HUGE. Most places make quesadillas by flipping one burrito sized tortilla over (14\"). This place uses two tortillas on top of each other, with a ton of cheese and pulled pork inside (if you like it spicy, get the hot bbq sauce and jalepenos).   The meat is very tender and well cooked, and the veggies on the poboy/burgers I've gotten have been extra fresh and in my opinion this makes a big difference.   I admit that the BBQ sauce they serve is more my style than other places around here so it's one reason I favor here so strongly. It's not a thin vinegar sauce like some of the other places around here. Definitely worth a stop.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nZtw5p27KSl6D4qPJIjSCw"
  },
  "gAMBpS16VP00FIQS3UaWHg": {
    "date": "6/28/2015",
    "text": "I was driving back into pittsburgh on a day trip when I was craving some BBQ so I decided to stop by this joint. Oh boy was I happy I did!  The award winning ribs here did not disappoint, they had a nice smokey rub and were super tender- that  fall off the rib kind. Brisket came in a bun which soaked up all the juiciness in the meat and BBQ sauce, making for big tasty bites. On top of that, the mac and cheese side was really tasty as well!  Brothers also has a lot more interesting food choices besides the typical BBQ, using their meats for some gourmet and fusion options. I didn't get to try this but definitely will next time!  One tip, don't expect this BBQ place to big a quick order and take out kind of deal despite the shack appearance, it took 10 minutes to get our food. Well worth the wait though!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h7sSvnQ3DX_yTRPcahwXgA"
  },
  "tYjjQGVuSKjl5O2tEos9gA": {
    "date": "8/5/2016",
    "text": "Pricey but worth it! In obsessed with their Thai chili wings. Always fresh and flavorful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mVYi4dF-HpiNqs9rNgfX-Q"
  },
  "1VUqP2nVeyk2YAT5xkKknw": {
    "date": "10/21/2016",
    "text": "Best BBQ in bridgeville area hands down. Kinda expensive but you get what you pay for. Lots of food that is phenomenal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U06ok8edw-DMMW2tm9RY2w"
  },
  "5u_oJCViBxRXdPpatWEatA": {
    "date": "7/15/2016",
    "text": "First visit. Ordered 2 meat dinner with pulled pork and brisket. Meat was very tender, lean, and cooked just right. I got the hot sauce and have to say it was very tasty. I had the Mac n cheese and Cole slaw as sides. Portion were just right. My girlfriend had the pulled pork sandwich with Cole slaw. The downside was the bill. $2.50 for a 20 oz Coke is pretty steep. Total bill was $32. We will bring our own drinks next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3mYYyDQ8hGBvysoe2ag47Q"
  },
  "JYlXwF4sbRxo2HTtMYcYKA": {
    "date": "5/29/2016",
    "text": "Thank you very much for providing myself, my boyfriend, and our friends for such delicious food for our Memorial Day barbecue. We Willkie ordering again!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1GMjy7MrTNlSYz4zF-uhjA"
  },
  "CgowGUl5baE5VSUr6-J6tA": {
    "date": "6/20/2019",
    "text": "This is the best bbq in Pittsburgh. The service is fantastic and the food is phenomenal. I loved their pulled pork and cornbread. All of the sides I've tried have been delicious. The cole slaw is also delicious. They have a variety of menu items available like bbq quesadillas, sandwiches, and chicken wings. If you like juicy meat, go here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zNS0QgKFDww0T9xKynjTww",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States. Pulled pork, cornbread, and potato salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zNS0QgKFDww0T9xKynjTww/o.jpg"
      }
    ],
    "user_id": "R2h9P0n3GZqNyNox_xalXQ"
  },
  "TSgu_THP-qAArAEz1mfKhw": {
    "date": "9/16/2019",
    "text": "One of my favorite places for BBQ chicken.  Very nice people.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3hyzFWb_c9q2ZlVeidmfrA"
  },
  "373M6HmxpNJIr0RP_c6z8A": {
    "date": "5/21/2019",
    "text": "The ribs are good!  Smokey and tender, but not over-cooked that you get at so many other places.  A nice tasty meat flavor.  They add just a little sauce and give you a small container so you can have it with or without.  Finally had a couple of sides.  The slaw is good and the Mac & Cheese is very cheesy.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 12,
      "cool": 11
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "znBXKGVWS2VlhTjgikG2Tw": {
    "date": "6/9/2019",
    "text": "BEST BBQ!!!  Best bbq by far in Pittsburgh. Great selection. Amazing flavor and always fast.  There is a nice outdoor area only of picnic tables which make it fun to see the giant smokers. Take out is great as well. Would love to use them for a catering event in the future!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4NopZyuV06yniq-iHlA_NA"
  },
  "_TD8NqJ354w9WUllX0YBCg": {
    "date": "8/18/2019",
    "text": "I was told being from Tx that two brothers would be as good as I could get here in PA. So driving by I tried it, and the place is inviting, the menu prices are reasonable, and the service was good/friendly. I ordered the Texas brisket and it was Smokey flavored and also a generous serving. I must say it was dry and lacked the moist tender feel I am used to but it was a solid effort. My gf ordered the pulled pork and her's was definitely better than mine. I asked for pickles to go with my brisket sandwich and u have to pay extra for the pickles!!! Haha if this was in TX you would get laughed at. But it's solid food at fair prices and I didnt see much on the menu offering veggies.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6V2QVNLboiRQ5QRHyUDqjg"
  },
  "cGg_F2j1fkiXhDG7BiO26g": {
    "date": "8/25/2019",
    "text": "Phenomenal shrimp PoBoy. Best I have ever had. The bread is fresh, the shrimp were grilled to perfection, the super crunchy lettuce and ripe tomato with the spicy sauce is great. Oh yea, don't forget about the thick cut smoked bacon to top off the perfect treat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LolIAhEa_JQFCxYRbGPyIw",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States. Grilled shrimp PoBoy",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LolIAhEa_JQFCxYRbGPyIw/o.jpg"
      }
    ],
    "user_id": "jqEbyzB9vB4xlfVF4H9n8A"
  },
  "nReHshLAlmnk6xCatPgDVw": {
    "date": "5/26/2019",
    "text": "\"Burnt ends\" poutine had the consistency of pot roast and nothing was burnt(charred/crusty/flavorful) about it. There might have been, but the pool of brown gravy wiped any brisket flavor that might have come through. The quesadilla was almost a half inch thin. Wouldn't have paid more for something more than a snack size First time we ever had anything subpar here. Generally the pulled pork is delicious but they were temporarily out on this trip",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ba_3_EDR27ddnJWT8BMmMA"
  },
  "y_Dcz4C3rWG_N-r3F1p7bQ": {
    "date": "11/3/2018",
    "text": "Had heard great things about this place so i was sad I didn't enjoy it.   I ordered a chicken sandwich and sweet potato fries. The chicken was extremely dry and chewy. The sweet potato fries were good but some were undercooked.   Don't think I'll be back again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bx1x3Zfatt71jDz9OKeQsg"
  },
  "OQgsDNN599oD8aLNHqGAKg": {
    "date": "7/6/2018",
    "text": "We went here last 4th of July, we came here this Fourth of July. I read through my review from last year and knew that we had to order the ribs again since they were so spectacular. We also went with a quarter chicken in addition to the ribs. Couldn't be happier with what we received, the food was spectacular. The mild sauce goes perfectly with both the ribs and the chicken and the service here is very fast. I would definitely recommend this BBQ to anyone in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0SkthlOqGceR_3BOf47axA",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States. Chicken. Fabulous!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0SkthlOqGceR_3BOf47axA/o.jpg"
      },
      {
        "img_id": "c5VkFZpKE3_C78Tr7oKJbw",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States. Ribs. So good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/c5VkFZpKE3_C78Tr7oKJbw/o.jpg"
      }
    ],
    "user_id": "NUjPmuf284g5J6EGT-Uhjw"
  },
  "0ag1l0Ok835YyFhSLxXP6g": {
    "date": "4/20/2018",
    "text": "This is great BBQ. Here is what I like:  The RIBS are incredible. They are smoky and tender, but not over-cooked to the point of falling off the bone. The meat is delicious - sweet, smoky, and drizzled with just a touch of sauce.  They is no evidence of heavy dry-rub, just great meat flavor.   The sides are very good as well - the slaw is nice, the cornbread is not overly sweet (which is a good thing). The baked beans are maybe just average.   The people working there are friendly and helpful. I'll definitely be back.   If their pulled pork is as good as those ribs, I'll raise my rating to five-stars. Can't wait.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "yVMvS4Q7JTxHALm8CTwSZQ"
  },
  "ZW1v1SczKhJ8J-Wek9fdTA": {
    "date": "6/15/2019",
    "text": "The best BBQ in Pittsburgh, hands down. We've never had a bad meal here; it's always juicy, well smoked, with a nice bark on the meat. Sauces are great too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rkB_o7QjosK2S1Clp_8kHQ"
  },
  "3npbGpyV4PKZ_WTnLngVhA": {
    "date": "5/25/2019",
    "text": "Was excited when moving to the area and getting to try 2 bros.  Disappointed.  Food was ok.  Not a lot of flavor.  Lacked that good smokey flavor.  Will try again because I can't resist a bbq joint.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WGnlgUvSU51Z1NlE0sBGiA"
  },
  "dcM7REjZHUF4uBPWJZ5CSQ": {
    "date": "11/4/2018",
    "text": "I heard all the hype about this place so I had to make sure I got to taste the goodness before they closed for the winter. I'm a huge bbq fan and I was not disappointed! I live in the city so it took awhile to get all the way out to Presto, but very worth it. It's a small building. You walk up and order and then there is a separate window to pick it up. There are some picnic tables outside to sit at but besides that it is mostly just a take-out restaurant. Since this weekend was their last weekend to be open for the season, I figured it would be super busy. I was glad when there were only a couple others in line in front of me and it moved quickly. The lady working said that most people get orders for pick up so it doesn't take long to get everything put together. I ordered at the restaurant and it only took 3 minutes for my food to be out! I got the pulled pork nachos, which is one of their best sellers. So good! They load it up with nacho cheese, pork, and bbq sauce (you get to choose hot or mild). Even though it is a little messy, it was worth it. There is a lot of parking available as well, but you don't need to stay for long if you're just picking up. Everyone working was very friendly and made it a quick and easy experience. I'm not quite sure if it's the best bbq I've had in Pittsburgh but if I'm in the area again, I wouldn't mind stopping.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aR5wxt90UdrDBiQeBIyHdw",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aR5wxt90UdrDBiQeBIyHdw/o.jpg"
      }
    ],
    "user_id": "I4BVS9Kkw52Xj6k3nTEuPw"
  },
  "Oh1q-0a0idI4H3MOsDd6gA": {
    "date": "9/7/2018",
    "text": "I've had Two Brothers BBQ twice which is a shame because I do not live far from their stand.  Tonight I had a pulled pork sandwich and fries.  The sandwich wasn't shy on the meat and wasn't saturated in barbecue sauce.  I was happy because a little BBQ sauce goes a long way.  My wife had the brisket sandwich.  I had a small portion of it.  It had more BBQ sauce on it than I would like but it was fairly tender.  Someone has commented on the prices.  I feel they are fair.  No reason to avoid stopping.  Fries were tasty.  I will definitely be visiting here more often.  Keep up the good work.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vs844SYuQRjULR9oXC0Ckw"
  },
  "WaPAo0EXkt44VqPWv_VAYQ": {
    "date": "4/27/2018",
    "text": "Holy cow (and pig! ) this place is by far my favorite bbq spot. I used to be lucky enough to live down the road from them and would go all the time, but now it's a special treat. I've even gotten my office to order catering from them. The smoked chicken was a delicious choice for catering. My favorite is their pulled pork and their potato salad. I add some of their hot bbq sauce to each option and its perfection. The coleslaw actually made me like coleslaw to begin with, as I used to hate it; that must say something too! The brisket is also great. I tried their pulled pork nachos years ago and they still stick out in my head so I'll need to retry those soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "qBUpsQJdUrXhVVKM5S1vjQ"
  },
  "grx7mrLrzBMY70EC37uUUw": {
    "date": "10/17/2016",
    "text": "What a pleasant surprise!   Keep in mind, this isn't a full service restaurant. Just a trailer with some picnic tables. Food is served in styrofoam containers with plastic silverware. It doesn't seem like much upon first impressions, but wow! The food is good.   A lot of reviews are saying this place is overpriced. You WILL most likely spend more here than almost any other BBQ place in the city of Pittsburgh (but this is the burbs, what do you expect?) The pulled pork is about $2 more than what you can get in the city. The pulled pork sandwich is huuuuge, though. The rack of ribs was $5-7 more than we usually spend, but they were delicious. We didn't even put the sauce on them because the dry rub was so good.   Coleslaw was sweet and crunchy. Mac and cheese was super cheesy and creamy. No complaints here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "eK5juDwFmISkZvs2Ko2mDg",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States. Pulled pork sandwich is ginormous",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eK5juDwFmISkZvs2Ko2mDg/o.jpg"
      },
      {
        "img_id": "zA-Sx9-G7b14q_8jM4Nq7g",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States. It&amp;#39;s a beautiful day for BBQ!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zA-Sx9-G7b14q_8jM4Nq7g/o.jpg"
      }
    ],
    "user_id": "DtzguIRjy-oRbrwVidAxQQ"
  },
  "iyO0KGLyRdiD6OT3FnqdcA": {
    "date": "9/17/2016",
    "text": "This place was not what I had expected. It's in a little trailer across the fire department.  We came here close to their closing time. I was excited as I had seen reviews of this place and they were pretty positive.  We ordered the fried fish sandwich and the pulled pork sandwich. The food took a bit to cook which was about 15-20 mins. When we got home with our ordered, I was actually surprised!  My pulled pork was amazing and the fried fish was really good too. The pulled pork was filled with tender meat and bbq sauce. It just melted in your mouth as soon as you bit it. The fish sandwich was crispy and fresh. The only thing that I would say is that it's a bit pricey for the food. I wished that we had ordered side dishes as I was still a bit hungry after my sandwich.    Overall,  the food is pretty good. I would definitely have to go back to try the spare ribs and brisket. Just a warning though, while waiting for your food in the summer, there are a lot of mosquitoes so I would suggest waiting in your car.  My friend got bit really bad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pGB3k70ZBN2lZrSb5M7_Nw",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States. Fried fish sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pGB3k70ZBN2lZrSb5M7_Nw/o.jpg"
      },
      {
        "img_id": "5wJzjY6Pjil6Quv2XnjLPg",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States. Pulled pork sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5wJzjY6Pjil6Quv2XnjLPg/o.jpg"
      }
    ],
    "user_id": "gmCK2ARSx22S_4_RQF9Jwg"
  },
  "PU9SJgsX1Xmj8KisnXDZ-A": {
    "date": "8/3/2018",
    "text": "Two Brothers deserves that you to pull over and stop for some bbq. We had driven by several times and finally stopped. Just a heads up that they are closed Mondays and Tuesdays. My husband got the pulled pork sandwich and I got the pulled pork nachos. We shared the baked beans, Mac and cheese, and a piece of corn bread. We had enough food for lunch and dinner. I would encourage you to share or split things; the meal portions are large but the sides are made for 1 person. The pulled pork nachos are old school style. Round chips, bright cheddar cheese sauce with a mass of pulled pork and bbq sauce. My husband's pulled pork sandwich was huge pieces of pork with sauce on a big Kaiser roll. His sandwich comes with their homemade pickles which had lots of sugar and dill on them. The beans were nice and thick with a touch of smokiness to them. The Mac and cheese is close to a thick custard style. My husband didn't share the cornbread. Well worth the price and clean picnic benches with paper towels and wet wipes. A great place to stop if you are in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uKoiNJ24aO65Abpr63ja2A",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uKoiNJ24aO65Abpr63ja2A/o.jpg"
      }
    ],
    "user_id": "_WZOZE2kAZre4hN_yzojaQ"
  },
  "VuUiBf9QkbdVc-dCUQKYiQ": {
    "date": "4/23/2017",
    "text": "The best barbecue  just outside of Pittsburgh Pennsylvania located in presto PA. The chicken, the ribs ,the sandwiches ,the side dishes,  the everything is good.  Presto Pennsylvania",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mlnS2gFVDbOx0LYFlpRzhg",
        "caption": "Photo of Two Brothers BBQ - Presto, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mlnS2gFVDbOx0LYFlpRzhg/o.jpg"
      }
    ],
    "user_id": "Ygooz9kZ_Xd5NmcjWcX_pA"
  },
  "pQd2OQno_67mjaxCMe80mQ": {
    "date": "6/22/2018",
    "text": "This is the best BBQ place in Pittsburgh that you've never heard of. These guys do top notch bbq with great seasonings and sauces. 110% quality and top notch service.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pJJ0mvnYvo_R9lpTtQpQ3Q"
  }
}