{
  "w_SmnuLpkSBHMY084LBXSQ": {
    "date": "3/20/2012",
    "text": "This definitely qualifies as a hidden gem in the vast Robinson shopping complex of Malls, strip malls, and big box stores.  Tucked away between knick knack central (Kirkland's) and Verizon Wireless (give or take a couple store front), this particular Chinese/AsianPacific restaurant doesn't jump out at you at first glance.  Upon entering there's a greeter (both times I've eater there its been a very nice lady) and you get promptly seated.  Again...even at this point it seems pretty standard fare...a nice sit down place that serves Chinise/Asian/Pacific foods.  Once you actually sit down and read the menu...that's when you start thinking...hmmmm there's more to this place that meets the eye.  From pricey dishes to the basic chinese-food stables in the affordable plates section...we tried all major proteins and rice/noodle combinatios with success.  The food was served quickly and piping hot out of the stove.  Quality and flavors were definitely excellent.  I can't wait to go back and try something different!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B-60XQ_fR72PevFzHM-ieQ"
  },
  "s2gQQl9xButJvckyQuJeRA": {
    "date": "2/16/2015",
    "text": "Delicious entrees, delicious Sushi delivered to you the way it should look, and a nice atmosphere to dine at.  I have yet to encounter a bad experience here.  If you find yourself hungry, but not HUNGRY I suggest you get the smaller portion option because you'll definitely be full.  I personally get the full entree and take the rest home if I have any left over.  I'll definitely be coming back here for awhile.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jOEv6hJfc64gov0gG-wnUg"
  },
  "mpsCGrl1lQ3xaVj81LhxzQ": {
    "date": "8/1/2014",
    "text": "My wife and I eat here whenever we get a night out without the kids.  The food is very fresh and tasty.  The only reason that I didnt give it a 5 is because it is located in a strip mall and I am an atmosphere guy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f-KBs0b1EDDqSqtRFSCXnA"
  },
  "iPGBZ-6HNzAoMjTHamfUqw": {
    "date": "2/24/2011",
    "text": "Ya Fei is tucked away in one of the many faceless plazas that makes up Robinson Town Centre. It has a nondescript sign and could easily be passed on as \"just another Chinese restaurant\". In this case, you'd be wrong.  Ya Fei handles Chinese food and \"Pacific Rim\" dishes with a tastefulness not often found amongst the neon signs of box retail establishments. The food is obviously prepared by a chef who knows his craft and is eager to show his patrons. It does not suffer from what I call \"soy sauce syndrome\" which a lot of Chinese businesses succumb to; so many Chinese restaurants, in an attempt to appeal to the often bland American palette, cover their food in soy sauce to the point where everything shares the same salty, dull taste. Ya Fei is fresh, tasty, and can be as bold as you want it.  Their sushi is also expertly made by a professional. Right next door is a Japanese steakhouse that boasts twice the price, half the taste.  I love their dumplings and their kung bao chicken. The hot chilies in the kung bao are absolutely fiery when eaten but add a delicate spiciness if left as a garnish. Their \"pre fixe\" menu is also a great way to eat amazing food at a slightly lower price. It includes appetizer, entree, and desert. I cannot recommend Ya Fei enough to anyone who is tired of the same boring Chinese food that you seem to find in most suburban neighborhoods. Robinson being a huge victim.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "knDrH7HggUkpMSO92bzJLQ"
  },
  "qPmJHWSIjJMag8H6UlHSrQ": {
    "date": "3/6/2017",
    "text": "My family and I have been going here for years and have loved it. Unfortunately, after our most recent visit, I don't think we will return. Several bites into our meal, we found gnats in two of our dishes. I was tempted to take out the part of rice that one was touching and continue eating. The food is that good! And, I know it happens. But, then my husband found one in his meal and we wondered how many more we had already eaten and how many were still there. The waitress was extremely apologetic and offered to get us something else. We had lost our appetites at that point. As she took our dishes back to the kitchen, she showed the co-owner(I believe that's what she is).  She did not say one word to us about the issue. No apology. She even told us to have a nice day as we were leaving, knowing it was us. Not a word about the added ingredients. Very unprofessional and rude. That turned us off more than the bug problem.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aa0YfUiK4FCj3VvEev35rg"
  },
  "xdx0wyW9KuKodBtNLEM6hA": {
    "date": "3/14/2013",
    "text": "In full disclosure, this review is about my takeout order, so I cannot speak to the venue, service, or ambiance. I can speak to the food though, and it was very good! I had the steamed dumplings and the Philly roll. The dumplings were cooked nicely and served with the standard sauce, but the filling seemed much more flavorful than I typically find. My standards for sushi have gone down quite a bit since moving from the Pacific Northwest, but using my Pittsburgh sushi standards as a baseline, I very much enjoyed my Philly roll. It looks like they have some good lunch specials too that I will have to try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iJp3Wu-pYl7osiYqz1Gv7A"
  },
  "D2xQW8UZSvHjs9OvveYezw": {
    "date": "10/29/2014",
    "text": "It pains me to write a 2 star review for Ya Fei because the service is AMAZING. I had really high expectations after reading the glowing Yelp reviews and was even more convinced that my experience would be awesome when the staff was super sweet and attentive as soon as I walked in to the restaurant. My boyfriend and I went in for takeout on a Saturday night and it was fairly dead because of the Pens game. We selected sushi combos and were offered drinks and snacks while we waited. The host who took our orders was super chatty and knowledgeable about the menu. 5 stars for service. Unfortunately, we got home and found the food to be inedible. The wonton soup (me) and miso soup (boyfriend) tasted off and the fish was extremely stinky and rotten tasting. Even the rice tasted 'off'. The leaves in the salad were wilted. Usually when sushi is subpar, I finish it anyways, but the food from Ya Fei was so foul that we did not eat it for fear of getting food poisoning. I would have gone back to return it if it was not a 20 minute drive. Sushi is just a fraction of their menu (and is not even a Chinese food, technically), but it is all I have to base my review on.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "lLZxjm_7eDxUCDNVaE1fcA"
  },
  "uYwW27Pg-QLJ1LRW5QBNdg": {
    "date": "2/24/2014",
    "text": "Easily some of the best sushi in and around the Pittsburgh area and for a very reasonable price. The Pad Thai is also excellent. My wife and I can get out of there stuffed and taking leftovers without spending a fortune.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4HSXRneryN9zE4Y_WL-7Xw"
  },
  "Z1NM0bbAsO4HDbRmGZs26A": {
    "date": "10/11/2010",
    "text": "Go for the dumplings and the duck. We had sushi here too, which was fine, but seriously, dumplings. duck.  That is all.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "g5qD10shooDJEPjt6miMrw"
  },
  "AlSIMXFay-tPyavw6kL96A": {
    "date": "1/28/2016",
    "text": "Best Chinese food and sushi. Have eaten here many times and the food just seems to get better and better. You can't go wrong with anything on their menu. The General Tso's is excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U1GTUg6YgYIb-UBNCvwqIA"
  },
  "8d4_wUPG-aScWB1idSr5eg": {
    "date": "8/18/2012",
    "text": "OMG, the pineapple duck and shrimp were sooo delish! I'm surprised this place is in Robinson. I wasn't crazy about the dumplings though, but minor gripe.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7AGLlj5YzqdBfCPiZCa1mQ"
  },
  "1xFuhFa7YitOjzl6lEQoIw": {
    "date": "6/12/2012",
    "text": "Mike Lin joined the restaurant as the sushi chef last year. He is above, and beyond, the best sushi chef I have ever experienced. In fact, I followed him to Ya Fei from another restaurant. Stop in and meet him and you can order off the menu. But once you get to know him, visit him on a week night when they restaurant is not as busy as a weekend and tell him your budget for the night and let him prepare a meal for you, off menu. Nothing, and I mean nothing, compares to the experience. Ask him to show you his photo books of some of his work. You also can order take out or a party platter for events that will leave your guests craving more. The owners are also very nice people, and the service is very good. This place is a hidden gem for sushi!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gvLm5KI1HqENv9yk7NS8Lg"
  },
  "NZHHt94lXUlCqT7Nj9cC_A": {
    "date": "5/28/2012",
    "text": "I love this place! I go here by my self, and with friends. It is always so good. I like big special sushi rolls and here you can have one as a meal and be completely satisfied. I pick this place before the chain hibatchi places everytime. It is a hidden treasure, I stumbled on it after leaving verizon one day and was very impressed and have been back many times. From the parking lot it looks like a regular small chinese place, but its not at all. Good for lunch or for a romantic dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lLwC66WOUYHPKQnuk-IhrQ"
  },
  "8y3PyvL8IzhnYWcTDAxDYw": {
    "date": "7/8/2014",
    "text": "Last night I ordered take out, and I was very disappointed. I came home to find that with my Pad Thai there was almost no sauce on it, and the General Tso's Chicken that we ordered had a piece of plastic in it. I will not be ordering take out or dining in here due to the fact the meal was so overpriced and was not very good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6IZcitsOhCzL48GLovjVhg"
  },
  "OP7aMa6E329_yU79jM4ZNw": {
    "date": "6/21/2009",
    "text": "I've only had sushi here, so I can't comment on the rest of the food, but the sushi is delicious and presented well.  I had the sweet potato tempura and california rolls.  I finally went here on the recommendation of what seemed like a million people telling me that their food was great.  It's a quiet little place that probably gets lost in the shuffle of everything going on in Robinson. But it's been around forever, and with good reason.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "-c_t-8ORqOZBuKE-jdY8aQ"
  },
  "fM7zgGdniT6CJcgRIYXWYg": {
    "date": "11/29/2012",
    "text": "The quality of the food was superb.  However, I do wish they had more variety of Chinese dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lb5gAXcVq9O0zV-4Vcq9fA"
  },
  "3FjEZUqo36asX-1kxBY72w": {
    "date": "2/21/2010",
    "text": "What would possess us to brave Robinson Towne Center on a Saturday afternoon?  Well, the answer is we needed to buy a fryer to make fried macaroni and cheese balls for a party we were attending that night, but that's another story.  However, I've been meaning to try this Chinese restaurant for quite some time, not so much based on its reputation, but based on the fact that the owner (Kathy Chen) is married to \"Richard Chen\".  If \"Richard Chen\" sounds familiar to you it was the ambitious foray into high end Asian food that attempted to find its footing in the East End (East Liberty to be exact).  It was easily the most anticipated restaurant opening in Pittsburgh that I can recall and lasted less than a year after a lot of hype.  Incidentally in the same space, a pretty good Asian restaurant (\"plum\") with a well stocked sushi bar.  Richard Chen is the chef at Wing Lei in the Wynn.  It's pretty much regarded as the base Asian restaurant in North America and the only Asian restaurant in North America to receive a Michelin star.  We got here mid afternoon yesterday and we avoided the lunch rush.  The restaurant itself is pretty non-descript and it's located in a strip mall just like thousands across the country.  We were greeted quickly by Kathy Chen I think and walked past a small sushi bar to a large dining room with a few other couples.  The server was quick to take our drink order and we began to look at the menu.  I was pretty disappointed initially because most of the more interesting dishes were not offered on the lunch menu, such as \"walnut puffed shrimp\", \"Beijing lamb\" and \"Steamed Fish\".  I guess I can understand the need for a pared down lunch menu.  We were primarily stuck with pretty traditional Chinese and sushi options.  I started with the spicy crab salad, which was okay...It had good flavor, but unfortunately was much more lettuce than crab.  Annie tried the chicken corn soup, which was \"velvety\" and better than usual.  I also sampled some sashimi, specifically \"white tuna\" and \"salmon\".  The sashimi was excellent.  It was cut perfectly, extremely fresh and they were generous in the portion size bringing 4 pieces of each and not the 3 indicated on the menu.  Next we shared the fried pork dumplings, which were pretty good but nothing memorable.  Finally, Annie ordered general tso's chicken with only white meat, which they were happy to accommodate for only $1 more.  It was fine, again nothing too special.  The service overall was efficient and maybe a little rushed, but no big deal.  The prices were very reasonable, especially for the lunch special.  I was surprised to notice they also deliver.  This is a perfectly acceptable Chinese restaurant with good value and service and a little above average food.  I probably won't go out of my way to visit again, but I'm glad I at least tried it.  It seems Richard Chen doesn't have much influence on this little Pittsburgh spot.  I guess I'll have to try his place next time I'm in Vegas for the authentic experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "1TkFY3Z_g62uZ6xNhAhXoQ"
  },
  "Ko32-VPb6ybr4LNvz2XB8w": {
    "date": "9/6/2011",
    "text": "I admit, this place was tough to find. It didnt help that google maps did not take me to the right place. Once i found it though, I was glad i ordered from here! The take out order didn't take much time at all, the food was fairly priced and awesome portions. Its above average compared to the generic \"american chinese\" restaurants. Needless to say, I am super picky about chinese food and this is a place I would definitely order from again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qEKSuXFazXJSsNowXzkF0Q",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qEKSuXFazXJSsNowXzkF0Q/o.jpg"
      }
    ],
    "user_id": "7KsnvR80M9WsIS-hXeevpQ"
  },
  "BKjPaqr2NUgoyCxhpJENVQ": {
    "date": "4/30/2016",
    "text": "We came to town for the Piits Marathon. We loved this place. Delicious Sushi, great service and so friendly. We will return next year!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cE20UfJ65RkWg7k9Hyw2Aw"
  },
  "6LllmiQjapkvm_cGB-nkEA": {
    "date": "10/8/2016",
    "text": "Tasty tofu! And the meat eaters in my house loved their dinners also. I hadn't been to this place in a few years because I like to try new places, it was excellent! They were decently busy when I went to pick up my food and I waited around for about 5 mins before anyone got to helping me. I got general tso's tofu and a sweet potato sushi roll. I opted for brown rice which was a little extra but worth it. I'm always hesitant to order tofu because sometimes placed do not know how to cook it. Not the case here! It was perfect not crunchy nor overly soft. It also wasn't greasy. I wish it would have come with more than 3 pieces of broccoli though.. the sauce was tasty and my food wasn't swimming in it.  My mother inlaw ordered a chicken entree and said that the chicken was really good and fresh. I'll be back sooner than later the sushi menu looks great! If you want to dine in they have a nice wine list!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "b4DS6aKcyAc2m-URu3p5Lg"
  },
  "9Xeof30wn2NyPd_nEJtFuQ": {
    "date": "2/27/2016",
    "text": "Today  was  our  1st  visit  here. The  service  was fast and non-discript. My  wife & I had the tuna and smoked salmon sushi the food was good however the pieces were so small that you could not get a good taste. Because  of  the  portion  size  we will not  be  going  back .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AaonvdnBJRDes8Fi5Oqiow"
  },
  "JzzVUn80FSRU3nDV2lggiw": {
    "date": "12/18/2016",
    "text": "Excellent Chinese food. Had general tsao and yellow curry. Bit were delicious and fresh. I would definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mp_qeT89Cbu6qKEshBDBWA"
  },
  "lrTK1gxA3IdMhixtdlt3rg": {
    "date": "12/26/2014",
    "text": "The sushi is great. Not outstanding, but great, especially from Pittsburgh. I had excellent and quick service, and everything went smoothly. For standard Chinese takeout, the quality is a bit better than some, but you will be paying for it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "FBd1Qjnnc1Loh7ZY7FD9Zg"
  },
  "8xcY0XknK-Mt_uSbCzW2ig": {
    "date": "9/23/2015",
    "text": "Ordered Delivery after the Steelers game And Also in person prior to leaving Pittsburgh. I was pleasantly surprised at how good the food was. Had the sashimi combo, submariner roll and the lobster roll. All were great and I would def try if I were in the area again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t9uLPLXRoBgDv59NSfjD_A"
  },
  "j7Xa2Vta3hYj21MheB4n3A": {
    "date": "6/26/2014",
    "text": "Great Chinese food in Robinson. I'm not personally a fan of sushi, but from all my friends that have ordered it there have been no complaints. It's a bit pricey for Chinese food, but then again you get what you pay for.  Some of my favorites are the Crispy hot shredded beef, Amazing Chicken, Spicy Hunan Chicken and the Garlic Green Beans.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NvQVQUm6Yr_UT6Bi8A3KTA"
  },
  "sCrVY1vIdlvRA5IUhhrhSw": {
    "date": "12/25/2014",
    "text": "We were here just a few hours ago. Didn't feel like making a family dinner for just us and the 5 year-old.  This place really let us down. Bad on nearly every point.   First it was a pretty cruddy looking place to eat. 1960's tables, out of place paintings and horrible lighting.  2nd They had pop and alcohol nothing kid centered like milk or juice (they did have tomatoe juice) these first two were signs, just small things.  3rd my coke was mainly carbonated water. Being in the Christmas spirit I didn't want to complain I just ordered a separate sprite. That sprite barely had any syrup in it just nasty seltzer water.   By this time I wanted to pay for the drinks and leave but the wife talked me into staying.   4th the food was generic, not bad just no different than the foodcourt at the old mall.    5th we had no assigned waitress just a young girl an older woman and a man all interchangeing jobs. The man brought us our food. My wife and I ate quickly as it wasn't comfortable and we wanted to leave. As I was chewing the guy asked if we needed boxes \"no that's ok\" then he asked if we were done. Obviously my daughter wasn't and I was chewing. So by that I thought he meant do we want the check. I said yes and he took all our plates. .. still food on all of them and my daughter and I were even chewing.   Well they have is the $ 50 check (for general tsos, honey chicken,  and a side of rice and lo mien). Id like to tell you they were at least quick on refills but I wouldn't know because even the soda sucked to the point we didn't drink it.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ib0b2n6bLCxyXpS_3xH8Iw"
  },
  "tc_PUaBx_Ad-m_-UFU55mg": {
    "date": "5/25/2016",
    "text": "Service in the restaurant can be a little odd/eccentric. Seems to me like Americanized Chinese food with the perfunctory sushi bar. Basic dishes not involving breaded and deep fried meats bathed in sugary glop can be quite good. Lo Mein, fried rice dishes have been tasty.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lx4qae4sfIovjT-MT57Axg"
  },
  "84QIpTf6fmJ9tnyo5mPifg": {
    "date": "10/20/2015",
    "text": "This place is amazing!!! My son and I looked all over for Sushi and we found them and this place is clean fast and wonderful!!! What a great dinner can't wait to stop back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eCYWzBtkx8Q-SXT2QPKe8g"
  },
  "ua5yKJBeXkhhcPtT2w_qeg": {
    "date": "11/2/2013",
    "text": "This is a staple on our dining. My son and I love this place. As an 8 year old sushi and Chinese aficionado this is his favorite place.   The Won Ton soup is very simple but very good. From the Moo Shu to the Amazing Chicken if is all wonderful.   The ownership has always been very welcoming and aside from one or two unhappy servers the overall service is very good. The atmosphere is not the greatest but it is welcoming. It is the best Chinese in the Robinson/airport area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hr4cbrQg0j2UET2aXEsegA"
  },
  "tNWyF08jTqzuaD4raS6DBg": {
    "date": "10/14/2014",
    "text": "Amazing. Really, really amazing. Considering the area, there is just no other place that comes close. The Beijing Duck is absolutely astonishing- with a nice beer or a glass of plum wine it's worth writing home about. Split one with your table today. The dumplings are great, the staff is friendly, there's not much else to say except go now! If I'm 100% honest, no it's not the best Chinese in the world, I've had better- but then again I can only say that because I've been in a restaurant where I was regularly the only person speaking English. If you've ever wanted to get away from normal takeout and try \"real\" Chinese, this is a must. Nice place, nice staff, very good food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f_aadRoNXdkQKMoy0SSZCg"
  },
  "JlRLHw8OtKsg4r_vjx5sww": {
    "date": "6/5/2015",
    "text": "I took one of my guests from the UK to this restaurant. We tried their Sushi and Sashimi and it was made to order. The quality of ingredients used was fresh and the ambiance was very mellow.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HB5-MhRJ_n-XcNNW25NDSg"
  },
  "y7y6GsqplHKi9WHWcLfW5w": {
    "date": "4/3/2013",
    "text": "My hubby and I went here after a long trip back from California on Easter Sunday. Most restaurants were closed, so we decided to try this place.  And we left with huge smiles on our faces. The manager there is incredibly friendly, and attentive. He even checked to see if the temperature in the table area we were seated at was comfortable enough for us! He even had the waiter attend to my infant.   If that wasn't enough, the food was superb! The serving size is plenty, and the dishes are very flavorful. We love Chinese food (Asian food in general) but with good Chinese food, we typically run across very crappy service. Not here, the food and the service was impeccable. We are definitely going to go there again when we are near...  Yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9zRva_hDT9q_nlODask_zw"
  },
  "fpdSHGvwAqfIc88yXMvYKQ": {
    "date": "11/6/2015",
    "text": "Honestly this is the best Asian restaurant around. Fresh ingredients, prepared and served perfect! Service is awesome too! I was with a party of 6. Everyone loved their food. To name a few, Hawaiian Roll was SO good. Egg plant was so delicious. Shrimp ceviche was perfect!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ofGIqG1NvYV5w2Z1p4VB3A"
  },
  "CTKjcvCUmC4jmsdpK0AL6Q": {
    "date": "10/23/2015",
    "text": "This is my all time favorite restaurant in Robinson.  They have many items on the menu, so anyone can find something they like.  When they make a mistake on an order, they fix it, plain and simple.  Their staff is friendly, professional, and just plain nice.  This is my choice for lunch and dinner any day of the week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MH3i-G8PSs_3lB_SsFexBw"
  },
  "V_EwLhQpzaOZwGpn00__DQ": {
    "date": "3/5/2015",
    "text": "They Deliver!!! and the Sushi is amazing :) Where I work we are always trying to find places that deliver since there isnt really enough time to go somewhere to get something... and I am very glad we found this place... wonderful food and courteous employees!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q10wq9_eqXDGBbuFuRy_Qw"
  },
  "6NeV6yIBMDh7RCTf7CtmEA": {
    "date": "5/1/2015",
    "text": "Just love love love their hot and sour soup, best I've ever had!!!!  Food is way above average for Chinese food.  Staff is ok, hard to get water refills,  but all in all we go here for lunch and never get a bad meal",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hm9rIGXTgQ7fV8p6UtwL-Q"
  },
  "KkiTB0PlCmjMul0H0dRvYg": {
    "date": "9/13/2014",
    "text": "Very good clean place to eat. Attentive service the server was on top of his game. Got spicy tuna, shrimp avocado, and shrimp tempura sushi rolls. The sushi was well made and tasted very good. We also got an entree with noodles curry tomatoes chicken and tofu... Was very tasty. It was the Friday entree!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Osx-Q-wHz3IG9OaYBoLi5Q"
  },
  "cZ76ifpcjVJ5cL38690msQ": {
    "date": "4/19/2017",
    "text": "Had the Vegetable Lo Mein, asked for snow peas and was charged $4.00 extra, ($14.00) I consider that gouging. The Crab Rangoon had very little cheese and no crab. Shredded Beef was OK (the vegetables in the plate made the dish).  The Egg Drop Soup was the STAR of the dinner. I would go back just for that. Also their HOUSE MADE MUSTARD is great but they CHARGE EXTRA for it.  I don't mind paying extra for good food but this was just run-of-the-mill Chinese. I've had just as good at hole in the wall take out places that cost less than half what they charge.  $42.00 for what I described above no egg roll or fried rice included with the meal. This was a $25.00 meal at best.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ngl27B77_naAxc-ct_0fCw"
  },
  "D2ZEno79GspjPZSEHxRaag": {
    "date": "12/6/2016",
    "text": "This was a disappointing  and uninspired meal. We ordered a cocktail and hot tea. Received the cocktail, but no tea. For appetizers we had the baked avocado with lobster (actually langostino) and a Samaria roll.... both were just fine, nothing special.  I wouldn't recommend either. We ordered the asparagus trio and a scallop & shrimp dish.  We did not get the asparagus dish, but instead something completely different. The waiter was not quick to offer to correct the mistake and we kept the incorrect dish rather than wait for a replacement. Both dishes were fine... but bland and not special or interesting.  The service was disinterested and poorly executed. We will not be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-3uEQhR9MXaC5QTHJ4lraw"
  },
  "McOdKzcZ_YqNNDcMXhuR2A": {
    "date": "10/21/2015",
    "text": "Idk what happen to the economy but the prices went up and the portion shrink in size. I'm 5'1 ft tall and 117lbs. My hands are small but my hand is a little bigger than the container. I used to live here and order from them all the time..atleast 3-4x a week because their food was good, prices were good, and so were their portions. Now I'm back to visit and crave for their food but the Food is ok and the portion shrunk. Disappointed! I thought if the economy was bad you would do the opposite? Lol idk",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hqV-ADFWI5QANBWJrf_mPw",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Disappointed what happen to the portion size?",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hqV-ADFWI5QANBWJrf_mPw/o.jpg"
      }
    ],
    "user_id": "VpHMe8D0fykMzgBJyLJMhg"
  },
  "KrlDRziQG-oRx0bNDlqdIA": {
    "date": "1/29/2018",
    "text": "Great menu options for anyone's diet/preferences, great service, great price for what you receive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ThDFQ9WnxIEuG_SbViQzA"
  },
  "CriMrw3uphK4PJThjf900w": {
    "date": "11/13/2011",
    "text": "I have eaten here twice on my Pittsburgh Adventures.  The fool is really tasty.  As recommended - I have tried many and look to try more.   There is nothing I can say negative about this place.  You should quit messing around and try it.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JgOcyMF1lTwSVCarSZrrrA"
  },
  "sq9Cmfmg5ks16sZ0SAW_AA": {
    "date": "4/16/2013",
    "text": "The best Chinese food in Robinson and one of my favorite places to eat in the whole city. The portions are huge and delicious. The prices are on the higher end compared to a lot of Chinese restaurants, but the big portions make it worthwhile. I usually get 2 meals out of each visit.  We have ordered delivery from here a few times as well and it's never as good as when you get it in the restaurant although that really shouldn't be a surprise. I definitely recommend that you eat there, especially if it's your first visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "SzZZ-i7kPNV6A3jxnymPfQ",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SzZZ-i7kPNV6A3jxnymPfQ/o.jpg"
      }
    ],
    "user_id": "vuH41CWzOYlwKmMmZnjV7g"
  },
  "sAI5MrWajU6XyhOTc6zaHg": {
    "date": "10/13/2016",
    "text": "This food has gone down hill..Ordered General tos lunch special.... the breading was soggy and the chicken was way over cooked and dry.... the fried rice, was just that... rice. I did see a few specs of onions and one spec of egg....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ColQAb3LXUzhEt-s-zu26Q"
  },
  "tpzltuWfV9XkL8JNVmmCFw": {
    "date": "1/18/2015",
    "text": "Nothing all that special.  The egg rolls were unusually crispy and definitely fresher than average.  The Kung Pao (Kung Bow on the menu) was a little too bland.  There was definitely enough heat, but the sauce just lacked a robustness that is usually expected.  I would definitely go back again, but for the prices (well above your average Chinese joint), I would rather head to Sewickley or downtown for a meal.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MXy1fO4n7Q5-FRdgSWWXDQ"
  },
  "9rh5tcWwaYIRW8_V9gQnCw": {
    "date": "7/26/2016",
    "text": "Had my very first bad experience. I called in for an order when I got there they gave the food to another patron. They call the person with the wrong food to bring back and gave them a gift card and there food I drove 20 mins to get the food and waited 20 more minutes to get the food. Then paid and didn't get a sorry for the inconvenience. Just here is ur food like its my fault. Sorry for ur poor customer service. I guess my 40 min wait didn't justify a gift card. And I do believe u gave me the food that the customer took out to the store home back to me... Bad judgement I'm glad I paid with American Express.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9WCG_ltp2w6AbrYh9griwg"
  },
  "iFfZNJ8yVuhTdp_X3uUOVQ": {
    "date": "3/7/2017",
    "text": "Traveling from out of town.  Stopped in because was close to my hotel.  I ordered noodles and half way thru found a fruit fly fried into it!  Gross!  Pass it up.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "19iFpwyZvDaQNbu54qAujg"
  },
  "EOd9GC1bS5iHuhmAWlRkMg": {
    "date": "8/18/2012",
    "text": "Last weekend, Kay and I were returning a piece of furniture to IKEA and needed grub, so we headed to Ya Fei, an Asian restaurant that fights to the last against Robinson's many chains and stands tall.   Now, we both found Ya fei's steamed dumplings to be a touch underwhelming despite their heft. Each dumpling was about as big as a toddler's fist but were filled with a dry pork that resembled bad chorizo sausage in flavor and mouthfeel. Methinks they forgot to add the eggs.   Everything was aces when it came to the entrees, however. Large portions, ones that were easily fit for two, graced our plate. Enter: Pineapple Shrimp and Pineapple Duck.   In both cases, weighty fresh chunks of juicy, tropical temptation along with bell peppers, carrot, onions, broccoli, and snap peas surrounded either plump, popping shrimp or crisp, lardy, candied duck. Fluffy, generous helpings of white rice served as beds for each dish, but when we ran out of rice, we had no problem devouring the remaining vegetables, fruits, and proteins.   With so much on our plates, we bypassed desserts and took what remained of our meals home.   Ya Fei is not everyday Asian cuisine; it is truly gourmet, done graciously, brightly.    And it is in a suburban strip mall. Go figure.",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 7,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "WDVXoGIRLDK3ortK8HNeOw",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Pineapple Duck",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WDVXoGIRLDK3ortK8HNeOw/o.jpg"
      },
      {
        "img_id": "ax90PGZa5GzJnAEsFMUVUA",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Pineapple Shrimp",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ax90PGZa5GzJnAEsFMUVUA/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "fr2bpxzllvTE41-wDBPMqg": {
    "date": "5/26/2016",
    "text": "Not sure why this place gets the ratings it gets. Food was mediocre. Delivery driver was super rude.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MCrPVEivtfgP476OwRsj6A"
  },
  "yeC-y4kzc6RkYTWUK3mknw": {
    "date": "10/6/2016",
    "text": "We had the egg rolls and fried dumplings. Egg rolls were not my favorite. The main dishes were great. We had the Chicken Mongolian style, Beef Teriyaki, Lo Mein combination and Shrimp Yan Chow. It also a great Sushi bar. Service was friendly and fast, maybe because we were one of the last customers. I heard from my friends the the portion got smaller and the prices went up. Would go again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "92cGXWJKQAIPJEKEUPlowg"
  },
  "mJf9SBJjLykl-XjvOClfYw": {
    "date": "8/23/2016",
    "text": "The Chinese food was quite good all around, not gummy, just spicy enough. Very good wait staff, never intrusive but always available. I'd go back for the chow fun. Sadly, the sushi was average at best - and I do not recommend getting the ikura (salmon roe) sushi. Really below average on that one.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q4Oz1c_OjGu_a8ZkP53Vnw"
  },
  "viI-W2QpI2m-OtkFVqvZzA": {
    "date": "10/16/2015",
    "text": "Food was excellent, service even better.  Owner Mark Vincent was exceedingly hospitable and friendly to my family and I, making our visit unforgettable. From the beautiful windowed succulents and deliciously wholesome cuisine, to the beautiful waitstaff, chefs, and astounding manager, Ya Fei is a can't miss for those of you who love sushi and Asian dishes alike. Best Chinese in Robinson area, delicious sushi for Pittsburgh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B9TqfNawEHSzHj4dPAWqvg"
  },
  "wbmppIEI-_-4q0-CH7uDpw": {
    "date": "11/26/2014",
    "text": "This Chinese spot is very clean. Service is attentive but can be a little slow even though we were literally the only people at the restaurant.   VERY basic standard sushi...nothing special.  The main dishes however on the menu are pretty exceptional! Simply delicious!   Would not go back for the sushi...but the main menus foods are pretty on-point and worth a second try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PJ6vY7qWaPs8lkFWqDMTZg"
  },
  "NCqiD7LIEhcarsCvep90iA": {
    "date": "4/10/2012",
    "text": "We randomly stopped in for dinner as my wife and I were in the area and Chinese food sounded good. Overall, I'm glad we did.  A quick glance at the menu was a little overwhelming, as Ya Fei is hardly a \"Chinese\" restaurant. They really touch on bits and pieces of nearly all of the East Asian cuisines, which makes the menu a little excessive. Since it was our first visit, we went a kind of nuts and tried too many items. Some of it was excellent, some was okay.  For one, any place that serves scallion pancakes always makes me happy. They were great. The tempura vegetables were pretty standard and I'm not sure if they were good enough to order again, but they weren't bad by any means.  We ordered some of their sushi, and I thought it was really good. I'd like to try more of their sushi offerings next time to truly gauge how good it is, but I was pleasantly surprised by the quality of the fish and selection on this visit. Plus, the sushi chef that was working that day was the person who greeted us and sat us. He was incredibly nice, and pulled my wife's chair out for her. He also came back to check on how we liked the sushi even though we were in the dining room area.  My entree was really the only disappointment, but I know that it had everything to do with me not ordering white meat for my orange chicken. I just don't like the chewy dark meat they default to, and the textures just killed any shot of enjoyment. I also wasn't a huge fan of their orange sauce, so I might just steer clear of the orange chicken altogether in the future. My wife's chicken and broccoli was really good, though.  Overall, I think the food can be hit-or-miss with such an unfocused menu, but the great service, polite staff, and decent food will make sure we keep Ya Fei in mind next time we're hungry and in Robinson. I can easily see this place deserving a 4-star rating, but for now, I have to stick with a 3 until I find the right entree(s).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JiPMk9WmbJu-VfTRAKpZpw"
  },
  "0bhKtjq9PAavI2oZoTC8UQ": {
    "date": "1/4/2016",
    "text": "I WOULD GIVE THIS PLACE 10 STARS IF I COULD!  I honestly can not say enough AWESOME things about this restaurant and their impeccable service.  My very first visit and the second they seat me for lunch, the owner of my company calls me. Can't not answer it....so as to not disturb the other diners, I snuck outside. One of the employees, not sure if it was a manger/owner/etc, (think it was the manger or owner) came outside (in the freezing cold) and got me and directed to a table in the back of the one dining area, not occupied by anyone at the time, where I could sit, talk on the phone, and not be interrupted or interupt anyone else. He brought my water, menu, and had me all situated. SOOO nice! AND he brought me over hot tea almost instantly cause I was still shivering from my 10 minute convo al fresco in the 20 degree weather. Still on the phone, I thanked him a million times, and he whispered, \"no worries, relax, you're totally fine\". We'll get your order when you are done kind of thing.  This was seriously so kind an understanding!! When I finally finished up my 35minute phone call, my server came right over, got my order, and my soup was out immediately. EVERYTHING I ordered was delicious. I'm not just saying that because of the service. It was delicious!  My miso soup was flavorful with lots of tofu and nice and hot, my salmon sashimi was SO fresh and perfect temp, and my steamed veggies with brown sauce on the side where perfectly cooked and it might've been the best brown sauce I ever had. I'm leaving here extremely impressed by this place and will definitely be back!  I can't wait to try everything on the menu cause everything looks delish!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Ln1AHZnU_hlieNdLq_Vrw"
  },
  "WBnkIH46iuqOTHTeizbYhg": {
    "date": "4/22/2017",
    "text": "Great food, fast service, friendly people... the only thing I had a small problem with was the price,but you get plenty of food so in the end it's worth the price",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S-kW3i5XqprwUjyyQGFu2Q"
  },
  "Olnw3neaQXjdgCCE4xNmDA": {
    "date": "3/31/2016",
    "text": "Great food prepared and seasoned very well. An item was left out of my carry out order and owner/manager (?) brought it to my hotel room. Very refreshing to see somebody who is dedicated to their business and its reputation! Thank you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tG4t8hlqRGFxN1cUziJSlg"
  },
  "ZhGJPlKnNuOUBjwCRjrrBw": {
    "date": "6/20/2016",
    "text": "I have never been conflicted about a review, I am always straight forward. This was, well odd. We were greeted by a very welcoming hostess. Our seats were not even in the chairs and we had water and were asked if we needed anything else, awesome right?  Then we got the menu, my daughter and I wanted mei fun. And I thought I made that clear to the waiter, but obviously not. I know that different people call mei fun different things. So I explained thin white rice noodle and what he brought out to us was not what I ordered:-( I was so bummed. I didn't know what to do, I didn't want to send it back and then I didn't want be super bitchy. Morale of the story make sure you and your waiter are on the same wave length.   I also learned that dumplings and Gyoza are different:( very different. We also had the California roll. It was not bad. So maybe if I am ever in this area again I will stick to the rice and sushi. I won't count this place out it was an honest misunderstanding, just pissed that I paid for something that I essentially picked at! Oh well I suppose that I have wasted more than 25 dollars on more crap. I did leave a tip.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Oz21pBYHtf1DkcqmcUhhAQ"
  },
  "hhwYIZrs5CGpCbqWbcH8jg": {
    "date": "10/5/2018",
    "text": "Might be the most expensive Chinese restaurant outside of a major city, but it is pretty darn good. The online ordering and options to customize each dish are awesome. Egg rolls were decent but not outstanding. Pork with garlic sauce was very good with clean flavors and good veg. Spice level was a little weak but that is not a deal breaker. Will go again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8fGBAAIFEFUo-QLvSJPVaA"
  },
  "00Gp2mzuozLkBIOOlfvR4w": {
    "date": "1/23/2018",
    "text": "Really like this restaurant. Food is excellent. Prices are good. Location and parking is great. Service is average.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TuAPnFyQeHXO6mNVNq01fA"
  },
  "KskkG2_0pojSqTWesHY-mw": {
    "date": "6/18/2017",
    "text": "I go to Pittsburgh weekly but have never heard about this place before. Will definitely go back. My friend said that he had never had any sushi there he didn't love. We ordered sushi had that avacado and shrimp. I forget the name but will get again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tuWfuUu3P0Wu_k4E4BjXgw"
  },
  "X9gkFwGuZaxK9V6kBQnhlA": {
    "date": "9/20/2017",
    "text": "We just moved to the area and we're looking for the best Chinese food in Robinson; this place had good reviews and was local.  The lady who answered the phone was extremely polite and delivery was very fast.  We ordered sweet and sour chicken, general tso chicken, and Crab Rangoon.  The chicken left a little more to be desired, and the rice was pretty dry.  Wasn't the best I had nor was it bad.  The crab ragoons were fantastic; out of all the places I've had them before these ones tasted like it truly had crab in it!  They were a little crispy, but I didn't mind.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5TAXlqET-Mx1oUO7gqa_Qg",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Crab Rangoon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5TAXlqET-Mx1oUO7gqa_Qg/o.jpg"
      },
      {
        "img_id": "u6ttgCuSq1gSYKDmA5w_Xg",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Sweet and Sour Chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u6ttgCuSq1gSYKDmA5w_Xg/o.jpg"
      }
    ],
    "user_id": "ZnLwnq8KeXbbqK2qXyFI6g"
  },
  "LmdUh7T5kG26JET7knTFDA": {
    "date": "9/5/2018",
    "text": "Good Chinese food. They take extremely long to deliver. I ordered my lunch at 12:20 and they didn't get it to me until 2:15 PM almost 2 hours after I ordered it!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pi9fYPSXk-vKXbd8VydbTw"
  },
  "-79zftmRoXsjM9HUpVYBrA": {
    "date": "3/19/2017",
    "text": "Nice, clean restaurant with attentive staff. Chow fun and lo mein were really good and came in generous portions, though the prices are quite high. Many of the signature dishes are over $20, and two egg rolls cost $5. I enjoyed my meal, but with prices this high I won't be back soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p1VSgB1_hV3eo42mJuJn4w",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Chow fun was really good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p1VSgB1_hV3eo42mJuJn4w/o.jpg"
      },
      {
        "img_id": "JEbMESp0bsHUy6Z-gef34Q",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Lo mein was pretty good and came as a large portion.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JEbMESp0bsHUy6Z-gef34Q/o.jpg"
      }
    ],
    "user_id": "SkV59K_uL9w22cwE_K1IyA"
  },
  "7rBmS_Gea9ut2LhXR9oKeQ": {
    "date": "7/7/2018",
    "text": "Nothing fancy but decent sushi.  Its a plaza mall restaurant.  Service was fast but then again it wasn't busy at all but we were there at an odd time.  The Chinese food was typical and just ok but the sushi was better than I've had at some places.  A though it was also a bit pricey.  I'd give it a 3.5 star but not 4 because the price.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "igO_22cGAMn13qNdUwsexg"
  },
  "oLOhB5dRPGSq85RRPAx6zA": {
    "date": "6/9/2018",
    "text": "Love love love the quality of their food. The meat is tender, not chewy or over cooked.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gvrfTaSSvOEpqFW0vfrShQ"
  },
  "KSrhKGIokUNDzdpvw7LRRg": {
    "date": "8/27/2017",
    "text": "We went in for take-out and ended up treated to an intro to sushi along with hot tea while we waited. It was way above and beyond in service and what every business should try to emulate. The items we ordered and took home were fresh and tasty. More effort clearly went into the dishes than most places attempt. I wouldn't let the location deceive you; for a little restaurant in a strip mall on a Saturday night it was a delightful surprise. We'll definitely be back to sample more of the menu.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ikvKNwQkX6BDWOc3pGz9ew"
  },
  "bpbFde8HDXramtzVUaYrDw": {
    "date": "8/15/2017",
    "text": "I'm always trying to find decent to excellent sushi when I travel. I've been to this place twice now when traveling in this area and both times the food was great. The service wasn't bad last time but it wasn't great either. This time, the service was just plain excellent. The sashimi was REALLY good too. Some might think it's slightly over priced for the size portions, but I would disagree. I'll take preparation and good fish over portion size any day of the week. I can see myself stopping here every time I'm in town going forward.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "02DmOZgg7sE2-OroA1dmLw"
  },
  "C5CIBxij6xcLdksw-J7kPg": {
    "date": "8/12/2017",
    "text": "Traveling from out of town and jonesin for some Chinese. Just didn't do it for me. Egg rolls had a strange cabbage funk, general tsos was OK.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tVzsQ9tP7yR9gG28cf77jA"
  },
  "wcNy2nnIWqeaVICzlbSMnA": {
    "date": "6/29/2016",
    "text": "Strip Mall Chinese, apart from being a fantastic name for a punk band is not a great descriptor for Ya Fei.  The restaurant is clean and well-decorated.  The chinese menu items are done well and...  So are the thai and japanese menu items.  With competition in the same strip mall from a Japanese place, I still find myself ordering sushi from here more often than not.  Similarly I find that the pad thai they serve here is better than the pad thai at the nearest Thai restaurant, less than a half mile away.  I probably order takeout from this location about once a week.    Downside might be the recently increased price of their sushi, but still a great restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DCAKyYwrhKEbxT8XIfPIeQ"
  },
  "OuXOeEicdyhygjxkUuTHQQ": {
    "date": "7/27/2018",
    "text": "I am having a hard time understanding why this place has such good reviews. My mom and I went on a Friday at 2pm and the place was completely empty. We were seated promptly and that's were the positive part ends. Our server was very rude to us during the entire time we were there. We were asking him something about the lunch special and he kept angrily saying that it wasn't like that so I pointed and read out loud the part of the menu that said what I was saying. After he brought our food he left and went eat at a nearby table and we had to wait a long time for our check since he was the only person servicing our table. In terms of food, it was ok at best. I ordered the Hunan style chicken lunch special with a spring roll and my mom ordered the chicken chop suey with fried rice. My food was average and definitely not worth the full dinner price (so I'm glad we paid the lunch price). My mom food was so bad she only ate half of it even though she was really hungry. Their fried rice is the worst fried rice I have ever seen OR tasted. In summary, I will not be coming back ever again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JGBZIKv5knmx21gWYd24-g"
  },
  "czYFTA4I1uoonfCTe3JGog": {
    "date": "12/4/2014",
    "text": "This is my favorite ma po tofu in pittsburgh!  I love Ya Fei.  It's a strip mall restaurant, but its really good.  Their sushi is really decent also.  I don't know that I'd make a specific trip for this restaurant, but as I work in the area I def will continue to order from them for lunch!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "PD3X7S70zXHeOx1NjeicjQ"
  },
  "PYHFQxRjIEuMLmjJCYGRRQ": {
    "date": "6/18/2017",
    "text": "the service was good and prompt.  the appetizers and hot tea were tasty and satisfying. the fried rice was rather lacking in vegetables (for a veggie fried rice) and the veggie/tofu dish did not have hot and fresh fried tofu (it was served a bit on the warm side). would return to explore the menu a bit more...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KcJOH2AcP5l_tGBOuZS73w"
  },
  "8S76EBvJpuMlP6NwIlKIIA": {
    "date": "4/19/2018",
    "text": "This is the absolute best Chinese Cuisine in the area.  Whether it is the pork, chicken, or beef, you can taste the freshness in every dish.  The atmosphere of the restaurant is quiet and peaceful.  It doesn't matter if you decide to dine in -- or you are driving by and decide to order a takeout -- or my favorite lazy way of preparing dinner -- delivery!!  Mmmm, every dish is freshly made.  The only negative comment I would make would be the price.  For a single meal, includes signature dish served w/ white rice, meals are $12-$22.  Other than that, excellent experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FQwP7xDk4pbG5fOWLWxX_A"
  },
  "tY7d8vjKM9LBujJ2I7xm7A": {
    "date": "8/20/2016",
    "text": "I like to shop/browse at many of the stores in this plaza and this restaurant is an added bonus. I love the pad Thai here. I have tried another version elsewhere and the dish was too fishy, sour and unbalanced. I find theirs is perfectly balanced to my taste. I also like to order another dish (forget the name) that has beef, sauce and a wider noodle -- also very good.   I have only dined in and the service has been prompt -- no long wait times for being sat or receiving food and water was refilled often.   I wish prices were a little better, but I find the food such a treat that I am willing to shell out a few extra dollars for consistently satisfying food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qyVgFXl8CJ0mUtzSaaivIw"
  },
  "m5Plk_ribebMG-E5SG_XBQ": {
    "date": "5/10/2017",
    "text": "We have ordered from here before but tonight was simply awful! And expensive at that! We ended up throwing away a ton of food :(. Beef and broccoli tasted like they just dumped soy sauce over it and two orders of chicken lomain were mushy and had no taste. We also ordered crab Rangoon which were all cheese. Very disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P9oo311Cwcy4Xan065b-iQ"
  },
  "JI6luz5GLAS4mhaZD5iqMw": {
    "date": "9/4/2015",
    "text": "My husband and I were looking for Chinese delivery in the Robinson area and found this place through Yelp.  It's in the same shopping center as Home Goods (across from Ikea).  My husband got the chicken lo mein and I ordered the kung pao (bow) chicken as I wanted a bit of spice to my dish.  We also got spring rolls. While the delivery option was convenient for us, and the spring rolls were crispy and tasty, I was disappointed in the kung pao.  Rather than tasting like kung pao chicken (spicy and flavorful with peanuts) it was sweet and sour tasting and had no spice at all.  There were peanuts but that's as close as it gets for resembling kung pao chicken.  I would try them again, only because of the convenience and will try something else and hope that it tastes like how it should.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NnrCwpS1i5mZtkGGzmIk0g"
  },
  "vJfjZmpj-rko9phQTcChHQ": {
    "date": "9/9/2019",
    "text": "Consistently great! Have been eating here for over 6 years. I usually get delivery and can't remember my experience eating once inside, so this is a delivery review:  delivery is about 1/2 an hour for either sushi or other items.  Great selection and service.  The staff is really helpful with customizing items due to allergies.  Very large portions and appropriately priced !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4NopZyuV06yniq-iHlA_NA"
  },
  "ktjDtX6iB3stVoU-uZeXCQ": {
    "date": "5/26/2018",
    "text": "Ya Fei was close to my hotel so I thought I would give it a try.   The atmosphere was different- I was the only person in the place. No frills- strictly business if you know what I mean. With that said, there were nice tablecloths and and it had a better than fast food feel.   My food was really good! Shrimp tempura roll and egg rolls were delicious. I don't always need personable- especially when I'm traveling.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gdFkZ9T7eznGm60rj2317A",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gdFkZ9T7eznGm60rj2317A/o.jpg"
      },
      {
        "img_id": "zy0zDkLsR0vLotAnFiNlnw",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Shrimp Tempura Roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zy0zDkLsR0vLotAnFiNlnw/o.jpg"
      },
      {
        "img_id": "1buUUtrds3AmSyDwI5OtYA",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1buUUtrds3AmSyDwI5OtYA/o.jpg"
      }
    ],
    "user_id": "DpkYPnW-TvDOuYAyArm5pw"
  },
  "s3J9HiMDOEFwq0MHJdHJkA": {
    "date": "7/8/2019",
    "text": "My aunt and uncle brought me back food while I was recovering from eye surgery. I ordered chicken Lo Mein. It was ok, not very well seasoned. I usually like my Lo Mein a little saucier. It seemed dry. The noodles were angle hair. Not like the thick ones. The pork fried rice again not seasoned very well. I always ask for extra egg. Instead of mixing it in they laid it on the top. Weird. The wonton soup was great the only thing I enjoyed. I am giving them 4 stars because I blame the anesthesia, it may have effected my tastebuds.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Pi_yOeVTUBrldOqXqO8FiA"
  },
  "8ROscEiBsN5Kl9sDXlVm6A": {
    "date": "6/30/2019",
    "text": "Solid Chinese food that delivers with very good service in Robinson.  Never dined in the restaurant.  Only get delivery.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2j54q0SIJSujVf-utjCPKA"
  },
  "sWzvYwkuPQ_niHjwhaXviw": {
    "date": "8/15/2018",
    "text": "Updated review:   I've gotten food from Ya Fei delivered to my house twice in one week. Ya Fei is one of the best restaurants in Robinson, and they have the best Chinese food in Robinson too. The lady who answered the phone the past two times I've called is very friendly and cheerful. I think from now on I'll be getting delivery rather than going to the restaurant, since I've been having better experiences with delivery. I really appreciate the fact that they have delivery, because there's not a lot of great restaurants near me that do delivery for when I'm staying in for the night and don't feel like making myself dinner.   A few days ago, I had the combo lo mein with gluten free noodles. I love how they have many GF options on the menu along with GF noodles. The lo mein was quite tasty and the portions are big. They also give you plenty of different sauces and fortune cookies with your takeout/delivery order. Tonight, my family got different dishes for our delivery order- Combo Chow Fun, Chicken Singapore Noodles, Chicken and Chinese Eggplant, Shrimp Pad Thai, and Kung Bao Chicken. There was so much flavor in all of these dishes that I didn't need to add sriracha to them. My favorite was probably the chow fun though.   I'm definitely going to keep getting delivery from Ya Fei from now on. The food is always fresh, amazing, and satisfying.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "CbSC3bV_Azl6S9HpsduQzw"
  },
  "XYw_MVZez2vpB24Kon6bfg": {
    "date": "12/5/2018",
    "text": "Rice was ok, I wouldn't know about the rest of order because they forgot it. Now I have a credit to a place I'll never order from again.  And it took little over an hour to get.   12/5/18 People are nice. Veg rice was good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WrnUDgCUoiaMlb_bCUNrmQ"
  },
  "8Uu8VQSYNCLYdhmGE0HqpQ": {
    "date": "8/12/2018",
    "text": "Came in last night and was surprised because the reviews aren't accurate. I originally skipped this place but 2 other sushi \"bars\" within 3 miles do not serve alcohol. Actually the businesses told me that no Sushi restaurants in the area served alcohol.  This place serves super fresh sashimi, & sushi, good hot saki (needs to be a bit hotter) staff were all super professional and friendly. Place is nicely set up and feels welcoming considering the space they have to work with. My server was excellent and the Sushi chef was busy and still took time to help & make sure I was doing ok. I'd give it a 5 star but as I mentioned to the server, if you charge 35.00 for sashimi combo it's should not have packaged crab on the platter. When leaving, 3 of the employees thanked me and told me to have a good night. Above average service for sure, The server did say to me that they do get very busy but do their very best to make sure everyone is taken care of when I asked her about the rating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FWZNWyysVjQKxOYCMr29gg"
  },
  "dvd2h0VBZbVVNzA0trSm5w": {
    "date": "9/9/2018",
    "text": "Ordered Delivery. Great Service from phone call to fast delivery. I order combo fried rice, beef salad, and edamame w/ garlic sauce on the side. The beef salad was excellent with the fish oil, lime dressing. Nice chucks of season flank beef. Combo fried rice was good and it's enough for 2 people, maybe 3.  If u order the edamame w/ garlic sauce on the side, I'd say ur welcome... mind blow. There garlic sauce was beyond good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0r87OacmDebbdKwS992TxA",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Beef Salad..",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0r87OacmDebbdKwS992TxA/o.jpg"
      },
      {
        "img_id": "mcV7Dm5ozRM1PYPyFXwZQg",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Edamame w/ Garlic Sauce...",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mcV7Dm5ozRM1PYPyFXwZQg/o.jpg"
      }
    ],
    "user_id": "DFty4XG0IJpG9jLBcq0frQ"
  },
  "ypn1riVjcMcYtTLPcxt57Q": {
    "date": "7/5/2018",
    "text": "We were out in the Robinson area and decided to give this place a try because we were craving Asian food.  We walked in and were seated immediately.  The restaurant was about half full.  People seemed to be enjoying their food.  Our server was very nice.  She gave us time to look at our menus and make our lunch choices.  I chose sushi.  They had several types of sushi to choose from.  It was a nice selection.  I chose a Dragon roll that had tempura shrimp, tuna, another ingredient or two and was topped with Eel Sauce.  All of the ingredients were fresh.  It was very tasty.  The roll was pretty big so it was all I needed for lunch although I did snag a bite of my husband's egg roll.  It was crispy on the outside and veggies on the inside were nice and crunchy.  I wasn't sure what to expect from an Asian restaurant in a strip type mall but the food  and the service was very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "leh4101hIMBULNVnEzyzzg",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/leh4101hIMBULNVnEzyzzg/o.jpg"
      },
      {
        "img_id": "u0kijoWS_rlwD6cKjjlp1g",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Dragon Roll",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/u0kijoWS_rlwD6cKjjlp1g/o.jpg"
      },
      {
        "img_id": "ETYWwwN1gxipUBQivczebg",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Sichuan Seafood Delight",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ETYWwwN1gxipUBQivczebg/o.jpg"
      }
    ],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "vvvXqtjX2hXOS73-YooPRg": {
    "date": "9/27/2018",
    "text": "Well I'm torn about this place. Order taker and delivery were great. But I'm a picky Chinese eater, I read on the menu that hunan beef came with beef and broccoli, I don't care for the vegetables and always leave them off and pay for extra beef (since most places are heavy on vegetables), so I expected beef with no vegetables, it came with very little beef and a ton of vegetables, the beef was excellent but it was difficult navigating around stuff I don't like. I don't understand why stuff that isn't listed as ingredients are thrown in. I also tried the egg rolls and dumplings which were very good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YdY8uy-Cl5e8naBlkWVPaA"
  },
  "VEIK7zRbJprrPF4jdCvhMw": {
    "date": "10/13/2018",
    "text": "This is the best Asian/Chinese restaurant in the USA!!!! New York City's best rated Asian restaurants cannot compare nor compete!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UBrTA-5294nO5o4K9l-dLA",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UBrTA-5294nO5o4K9l-dLA/o.jpg"
      },
      {
        "img_id": "1jKoTCdEW7M3N4D2X4Ms7g",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1jKoTCdEW7M3N4D2X4Ms7g/o.jpg"
      },
      {
        "img_id": "cb7jFdbnLLm__RF8P1fl2g",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cb7jFdbnLLm__RF8P1fl2g/o.jpg"
      }
    ],
    "user_id": "PvuWg1lOK3F_4GrUXcbT2g"
  },
  "XqYyA3OryjrDdznTKl57eQ": {
    "date": "2/5/2019",
    "text": "Was impressed by this place. Ordered through DoorDash to have it delivered to my house. It was kind of strange that they put kale(?) in my chicken fried rice. The combination Singapore noodles were solid and the beef chow fun was a little odd with the snow peas. Besides that...I'd order from them again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "anJqd58cidxpBqJpgBhTcg",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Chicken fried rice. Is that kale(?)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/anJqd58cidxpBqJpgBhTcg/o.jpg"
      },
      {
        "img_id": "XkSNI-fjhyN4kizP0rxVXQ",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Combination Singapore noodles.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XkSNI-fjhyN4kizP0rxVXQ/o.jpg"
      },
      {
        "img_id": "g0NFg3RjVnQQ5pyvtzrxjA",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Beef chow fun.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g0NFg3RjVnQQ5pyvtzrxjA/o.jpg"
      }
    ],
    "user_id": "xyRePkTTGbgqrCDrwpY1sg"
  },
  "hBvt-cETWRoAggOiAAROjw": {
    "date": "1/6/2019",
    "text": "Party of five on a weeknight. Service was attentive but not intrusive.  I had the sesame chicken and it was delicious. Could have uses a bit more broccoli...3 small pieces. Definitely a repeat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pW7KYx27qcC8OzR_Td1xVw"
  },
  "EELbjcP5fR-LkXZu0TWKrQ": {
    "date": "10/1/2017",
    "text": "I like this place. I've been here for sushi and for Chinese and they're both good. This time around we had Chinese and we were in a hurry because we had to make a flight at the airport. The waitress was extremely accommodating and made sure to bring our food out quickly. she also got the check and to go boxes out very quick. You need to go boxes because the portions are generously sized. we started out with an eggroll and hot and sour soup. Is it me or do egg rolls seem to be getting smaller and smaller no matter where you go? But they were still good and a hot shower soup was a nice size bowl. I had the Chinese eggplant with pork and my wife had Sesame chicken which is best to eat there and not taken out or it gets soft and loses its crispiness. I wish this place were closer to my home in the Northhills and I would go here a lot more often",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0T9gTIztjpBtNwEwR_QZzQ",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Chinese eggplant with pork",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0T9gTIztjpBtNwEwR_QZzQ/o.jpg"
      },
      {
        "img_id": "M_NZhXVY46Ykka9_2qe_2A",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Sesame chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/M_NZhXVY46Ykka9_2qe_2A/o.jpg"
      }
    ],
    "user_id": "KglzrviHcRiN0nreA3c_xg"
  },
  "0Wk2_g8I8zfgOnGjUfFROg": {
    "date": "7/22/2017",
    "text": "Stayed at Hilton Garden Inn in my way to New Jersey. It was late when arrived at the hotel. Surprisingly the restaurant opens late on Saturday until 10:30. Ordered Shrimp Chow Fun (with less soy sauce). The food came with big portion and lots of shrimps. The noodle was fresh with good texture.   Definitely a great place for Chines food if you are in this area around PIT airport. They also serve sushi as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HftbwgHemfDTCV3xPAPAaA",
        "caption": "Photo of Ya Fei - Pittsburgh, PA, United States. Shrimp Chow-Fun",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HftbwgHemfDTCV3xPAPAaA/o.jpg"
      }
    ],
    "user_id": "MaRHn1fHEUO87NAuvFk5-w"
  },
  "oKtsT44awXp3XWv5XgAEtg": {
    "date": "10/3/2018",
    "text": "I was in town on business and in the mood for sushi so I took a chance here based on the yelp reviews. It did not disappoint!!! My seaweed salad was huge and my sushi roll was delicious. I got carry out so I can't comment on the service, but the restaurant was clean and the staff was friendly. I will definitely be a repeat customer whenever I'm in town!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5sJzvGUa-IvwMQQFmyglVA"
  },
  "QIwbD9Anpy9PquXn7hLIRw": {
    "date": "8/23/2018",
    "text": "Nothing special. Very American. Service was good. Had the triple crown, shrimp was overcooked, not filet mignon as described, sauce lacked flavor. Fried rice was tasteless, dry, no veggies, oily. The egg roll had zero flavor. It was terrible and I will not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rGbekXmAH0T65G6Cw-mAEg"
  },
  "yr89am92aq-b8Dhlhaj_Zw": {
    "date": "3/23/2019",
    "text": "Great food and great service. We enjoyed everything we ordered (pan-fried dumplings, scallion pancake, shrimp spring rolls, chow fun, General Tso's). All delicious. You can make substitutions on protein and rice type. It's all good. Pop in after you've exhausted yourself at Ikea.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UM6qWM4Mt7DgK0zawVJo6w"
  },
  "RQGZStLD5wa32KC56u5VUQ": {
    "date": "8/3/2018",
    "text": "This place was crazy busy when I was here so I am not even going to mention the service. They did the best they could considering the amount of people they had. The eel roll I had was so-so but the general tso tofu was the best I have EVER had. If you like fried tofu dishes, this is the place for you!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SNQ9zV4Xjgq7VDP69-1v4g"
  },
  "av1-H97NtOa2PlxFoM8svw": {
    "date": "4/18/2018",
    "text": "I arrived after the lunch  rush @3p, so seating was not a problem. The environment is clean, with hints of Asian decor and pop 40 hits in the background. My meal (Scallions with beef) came promptly. I was pleased with the flavor, good taste. My only complaint was the service was Eh... not terrible, but not welcoming. If in the area I'd come back, but only for takeout...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JLjXr6xn_0j9gjOzBcOE3w"
  }
}