{
  "6tdny5gxNCAdOFrV8YbO6Q": {
    "date": "2/24/2011",
    "text": "This is the kind of pizza where the toppings are added after the crust is cooked. Cheese included. It's a novelty, and for some folks it's their favorite pizza. The taste is good, if a little weird, but for me, it didn't satisfy my pizza craving.  This location was crowded and the wait was long, but the people were nice.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fmgXGi9LndwKmg7u-tatAQ"
  },
  "JmiZbnhMaELDKN35d_Jj8w": {
    "date": "1/5/2011",
    "text": "Apparently, Beto's has conformed to the tourist since they now have definitions on how they cook their pie.  If you want your cheese and toppings melted, be prepared to wait an extra 15 minutes and asked for it \"baked\".    Well, I didn't get the memo in time.    I split the Italian Hoagie and two pieces of pie, extra cheese.   **Italian sub - superb!  5* winner!  The bread was warm and crusty, but not hard.  The meats were warm, not too greasy, and plentiful.  The serving size was ample.  Must order this again next time! **Pizza with extra cheese, not \"baked\" - no really, shouldn't you cook it first?  I'd give the pie 3*s.  Overall, the quality of the ingredients were high and the cheese was very good.  I especially liked the whole tomato pieces they served on the slices, but if I were to order this again next time, I'd either get it \"baked\" or go light on the cheese.  I couldn't even come close to eating the 2nd slice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZ6j5wyq4oda4h4IiLJwcw"
  },
  "rcuXlweQIp4t5gyJeg43Pg": {
    "date": "7/6/2013",
    "text": "It's like fruit cake either you love it or hate it, very different I must say. I am so not for the cold uncooked toppings on my pizza, sorry I need melted cheese and hot toppings to please me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SrYu6EMSfNzcdD3wgQ4c2Q"
  },
  "iiS_pbS7gK5_lcD8PU1HVg": {
    "date": "11/22/2013",
    "text": "Ohio valley square pizza by the slice...or cut(I should know better!) Crispy crust, chunky piping hot tomato sauce, cold cheese....but you have to eat it there! Loses its appeal if cheese melts and crust gets soggy.  My family has been eating here since they ran it out of the old building next door! A real craving-type pizza with an acquired taste. Also a family of 4 can get out of here for around $25.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cf9LfwlavrEyIlxJoC2u1A"
  },
  "LXjPayQte2cz_D7Vc1GD4g": {
    "date": "11/5/2013",
    "text": "The thing about Beto's is you either love it or you hate. I personally love it. The uniqueness of the cold toppings on the hot pizza is something that Beto's does perfectly. I've been a loyal customer for 10+ years and have continued to order 3 cuts with extra cheese every time. One of the biggest perks to Beto's is that it's family owned by a great group of people. This place is sure to not disappoint.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jhuMKY2t-EL0fYNh3Kab_Q"
  },
  "my5Ru1foe3wB_oe3wIidDA": {
    "date": "5/6/2013",
    "text": "Wow what a great place! My coworker and I were told by locals that this was the place to go and they were so right!!! I got a two cuts of pizza with pepper on top and what they do is cook the crust with chunks of tomato and then the add cold toppings including the cheese... sounds strange, but it is amazing!! Great concept, very friendly workers and delicious food!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d9JuPUj2XDiBp0gW5mS8tg"
  },
  "qyBzs6cOFZXKKBIGL4KuUA": {
    "date": "11/11/2015",
    "text": "I disliked the cold cheese and cold pepperoni on so so crust. Obviously many people like it.  I went out of my way to go there, and had heard of the cold cheese gimmick. Not my cup of tea...just a heads up if you go there to compare to other pizzerias.  Not comparable to the other top ten pizza joints in Pittsburgh.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qwew_DcKu7H6JrsTSmAaNQ"
  },
  "pBsQHpcGfN2fXiaRy-bv6w": {
    "date": "1/1/2014",
    "text": "A different style (love or hate) pizza. A square cut thicker crust with cold shredded cheese on top. It's different enough that it is a good chance of pace to your standard pie.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "owsX5JI9cHzkCiTvuVGhVA"
  },
  "Q3o_vVWATMlEztOLPZR43g": {
    "date": "11/8/2015",
    "text": "The BEST pizza I've ever had, I love as their sauce that they use fresh, chunky tomatoes; also the unmelted cheese makes this pizza my favorite. When I go (which isn't too often sadly) I get 3 pieces because it's so divine!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SQg4_pL2W6AWYFlFD_q3KQ"
  },
  "z_gqiEchA8pxgcOhZ9B7xg": {
    "date": "9/2/2013",
    "text": "Been going here for years, and will continue...I agree with some of the others, you will either love it or hate it.. It's just different, but classic in its own way... Square cut pizza with cold toppings... So frigging good...just let the cheese melt.....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fw4w4eTk5SZVA6GL1Fj2hw"
  },
  "vOUdnlLgrw-KG4PcR4RKJQ": {
    "date": "5/24/2013",
    "text": "Love the pizza but they have changed the pepperoni again. I love spicy but with the profile of everything else it throws it off for me. Still will come back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vgx-TZLq55PZnEumT-NOXA"
  },
  "5fJN99QppV_ADyGK1kraNQ": {
    "date": "11/20/2013",
    "text": "The pizza deserves 5 stars, it's not like any other pizza on the planet. Nice hot crispy crust with cold cheese& toppings thrown on at the last minute before serving. Definitely an awesome experience, but the bad... I've had the steak hoagie which cannot be more straight forward, steak-um(unseasoned) LTO and cheese. Just stick to the pizza. You won't be disappointed",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KzFJXkFz6PYDcKmXSZcd6w"
  },
  "QQeCmRlFM5VjlsiGypMoHA": {
    "date": "7/4/2012",
    "text": "Not like any other pizza you have ever had. The crust is crispy and the cheese is uncooked. I hated it at first...but now I live it!  You might have to try it a few times. I will keep coming back. And the price is so cheap! $1.45 for a slice? Kidding me?",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y1-u2W49HeM0ta2ZuwsaHw"
  },
  "2miK12zKouXPWbNiu_1SAQ": {
    "date": "3/2/2013",
    "text": "This is a place you either love or hate   I love it!  every time I am in Pittsburgh I have to stop in and get enough so I have take home.  The pizza is sold by the square slice.  The sauce is chunky tomato based and baked with cheese. period. after it comes out of the oven it is sliced and heaped with more cheese and what ever topping you want.  I suggest just sticking to the peperoni.  The toppings are not cooked, the cheese melts a bit but not all the way and the peperoni is lukewarm at best.  My mouth is watering while I write this.  You probably will not see 3 stars on any reviews.  Give it a shot",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6u3S4iKNerG-fSOSaYydcQ"
  },
  "y2JiMuYySc_ySRrddJfYaQ": {
    "date": "4/1/2012",
    "text": "Canned green peppers!?! Way too much cheese. The yinzers seem to like it. The average BMI in that place was probably close to 30 and no wonder; the food is incredibly unhealthy. The pizza crust tasted like Pizza Hut. Maybe this place gets good reviews because it's a unique twist on unhealthy; loads of uncooked mozzarella.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6lu-nRaojUcVdP4nhi3Asg"
  },
  "kZUcBLrLMo9ukciVVbLHWg": {
    "date": "6/25/2012",
    "text": "I'm a fan of Betos. I like the fact that the cheese isn't always melted. The slices are square and the prices are reasonable. Ranch dressing or bleu cheese and you're good to go! The pizza itself is simple: crust, sauce, and cheese. I'm pretty certain that you have to go pick it up, or that's just been my traditional order of things. It's been a while since I've had their pizza, but it's definitely worth the trip.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RlF9Ic5ZV54JjV81TrJVSw"
  },
  "wuSw5kIzmoaYE7kI268bTw": {
    "date": "8/10/2015",
    "text": "Quick service. Good sauce. Nice selection of toppings. So much cheese I feel greasy. It's okay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wC1-KNoDWee0uaGXIHNkpA"
  },
  "LDsu5nW5UNwiwhQ9jcStKg": {
    "date": "6/20/2015",
    "text": "This place has the best Italian hoagie ever. The pizza is also a very good change of pace from other traditional styles of pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xtXE5peYslO9MCXC_oGOUQ"
  },
  "vZ81T8pAXintx72RyYgT3g": {
    "date": "8/11/2008",
    "text": "Love it or hate it?  Well I hate it.  My Pittsburgh vacation would not be complete without a visit to Beto's.  I loved your city, your hick bars (although I was told that it gets even more hick than this, but I wasn't ready to experience more), your redneck walmart, your sandwiches with the sides in the sandwich and not on the side like the name implies, and finally, your Sheetz.  Sheetz is my favorite.  But back to Beto's.  It just doesn't taste good.  The dining experience is not high class.  It's not even middle class.  It's like lower than McDonald's.  What's with that TV gaming system at the bar?  I didn't enjoy hearing that throughout my meal.  Please melt your cheese.  I like my pizza hot.  Is that really so much to ask for?  Me thinks not.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "Qa2NoSc6DphQArihBgY9Gg"
  },
  "lF83XOuNBZeoxhcAvXJC-g": {
    "date": "8/11/2011",
    "text": "This place is billed as a \"unique\" type of pizza. Its unique alright. Unique in the \"Osama bin Laden\" is a unique kinda of man kind of way. Yes, it is unique. But so would be giving customers a raw steak, a spork and a jagged piece of glass and calling it a steak dinner.  Why such hard words? Well this pizza stinks. Its disgusting. I'd literally rather eat ipecac than this crap. \"It can't be that bad,\" you're probably telling yourself. Rest assured, my friends, it is that bad....and its even worse than you can possibly imagine.  You have to buy the pizza a slice at a time. And I use the word slice liberally. They're not really pizza slices. They're more like halved loaves of bread. They cover the bread in canned tomato paste and chuck it all in the oven. Well wait...what about the cheese and the toppings? Well at Beto's, you don't worry about cheese or toppings.. Instead of giving you 100% of a completed pizza, they give you 75% of a completed pizza and call it unique. You get this half-loaf with enough sauce on it for three pizzas. And instead of hot melty cheese, they take a huge pile of ice cold dollar store cheese and pile it on the saucy half-loaf. And if you want toppings, they pull them out of the fridge and shove them into sandwich bags.  This is not a unique way to eat pizza, its a unique way to waste your freaking money. The sauce is disgusting. The cheese probably would be alright if they melted it. The toppings are nasty and cheap. The fact that they shove them into sandwich bags like you're a drug addict is just insult to injury.  Now if the magic of this place is in the childhood memories of all the yinzers and various hillbillies. Well if this is the truth then you got screwed when it comes to childhood memories. I'm sure people that group up in Cambodia in the 70s have a few child memories, too. It doesn't make them very nice ones. If this is the kind of pizza your Mom and Dad forced down your throat when you were a kid, well I hope you don't hold grudges because I'd hate to hear about a wave of disgruntled adults forcing their bedridden parents to swallow Draino cocktails.  Its that bad, folks. I'd rather ride the Port Authority than eat this pizza. The only people who say otherwise are idiots who don't know any better. Don't take it out on them. But don't eat their pizza.",
    "rating": 1,
    "rated": {
      "funny": 8,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "NHwqfU8b_8cf1H05FDt9Eg"
  },
  "xuv-Ual3LDBcaOqMnYP4VQ": {
    "date": "9/4/2015",
    "text": "Beto's- you either love it or you don't. It's a unique pizza- baked with the sauce on and then the cheese goes on cold. It's kind of like an adult lunchable. Most recently, we called ahead and ordered our pizza. They were pretty busy, so we waited about 30 minutes for pick-up. What's a little annoying about it- you order by the slice... making it pretty pricey for pizza. If you are getting your pizza to go, I recommend getting your cheese on the side. Besides keeping the cheese cold, you can also control how much cheese goes on each slice. Otherwise, you'll end up with what we had. TOO much cheese- yes, I said it. Way too much cheese for my liking. I ended up taking half of it off to enjoy the pizza. If you haven't guessed yet, I lean on the side of not loving Beto's... although I can't speak too much for their other menu items, their pizza is just not my favorite. I will say, it is one of the most unique pizzas I have ever had, and is definitely worth trying.   ps. If you order pepperoni, know that it is pretty spicy and they are really generous with it.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "r1wk2THzQI_U-5xyEjJ4oQ": {
    "date": "1/24/2018",
    "text": "Excellent pizza with a unique approach.  I look forward to having the pizza if I have an opportunity when I return to the Pittsburgh area",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j2RGLYXROz_Y0OyusGU8Cg"
  },
  "QVl3_we8WkIhCt8SHMwFOg": {
    "date": "9/29/2015",
    "text": "Pizza connoisseurs delight. This is a unique pizza experience like no other. The sauce is full of flavor and the mounds of fresh grated mozzarella cheese never disappoint. Order two cuts - one cheese and one with extras.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8I6tUqUTi4xL9j3FuwgjIQ"
  },
  "N1khqnMtFFLE1I0qsezB8A": {
    "date": "12/3/2017",
    "text": "Had the worst excuse of an Italian Hoagie yesterday. I heard this place was awesome and basically got an heated bologna sandwich. The meat was disgusting & cold. Took a few bites and pitched it in the garbage. The place was busy too! Completely disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PoF4p0nT9_r7_YVNDoFoCg"
  },
  "zaz3ACNAszJ0jeCWm23Vvw": {
    "date": "2/17/2015",
    "text": "Ok, so the gimmick is cold cheese and toppings on freshly cooked dough and sauce.   It doesn't work.  I get the same effect from a microwave pizza that wasn't in long enough. Also, if you are going to serve your food this way (unfinished), at least have the decency to use quality ingredients. I'm quite certain the pepperoni was of the Hormel variety.   I don't understand why you would spend your money on a low quality, unfinished pizza when there are SO many better options in the area.  However, based on the amount of business they were doing you may want to give it a try. I for one will not be returning...",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "UOBCa2YcfwEgAEGO3F7wFA"
  },
  "XbtZFXuX0Wai8oW4Ij2Lug": {
    "date": "4/1/2015",
    "text": "Forget what you know about pizza. Beto's is entirely its own thing. And it gets five stars because it is something you will crave more often than is healthy.  A Pittsburgh favorite, I know multiple folks who've moved out of town and include this on their \"must do\" list each time they come to town. (Visit pap, watch the stillers, drink an iron city, eat a few slices of Betos pizza - check!)   Anyhoo, the crunch of this pizza crust makes me go weak at the knees. I just want to HEAR everyone at my table bite into their slice of pizza...is it so much to ask? Then you experience the perfectly thin layer of sauce. Then the mound of shredded, uncooked mozzarella cheese, some of which falls to your plate for you to snack on later. And you realize, I'm eating pizza but it's a whole other experience entirely because the cheese and toppings are raw! I like getting anchovies on mine because the salty bite with the rich cheese and deluxe crust is, in my opinion, the perfect bite. It is the stuff dreams are made of.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ht6gPxpBBHtUxus7VlRasg"
  },
  "qCYidCF__LYfyFUlRDx3xg": {
    "date": "10/26/2016",
    "text": "Only tried the meatball sub. Really good though. Well beyond what you would get at Subway for about the same price. Lotsa mozzarella. Got one each for me and my wife. The bag felt like it weighed 10 pounds. Probably will split one next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xD7-cG4Uj_-H7jDaL0GlBg"
  },
  "eMgPawI9flREqjfEEvfXcQ": {
    "date": "10/2/2016",
    "text": "Beto's is tasty and unique. They only have square pies and they sauce and halfway cover them with cheese, then they add your toppings(including cheese) cold. It's different but good, and folks in the South Hills swear by this place. Order ahead or you'll be waiting as they have an intensive process for even a single slice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uRRuulSQNLwa4gF599EE9g"
  },
  "jB202-uAUGL63Qr750r0VA": {
    "date": "5/10/2015",
    "text": "This is some of the best pizza in the Burgh! Glad they added more seating and did some renovations. This place is usually pretty busy, the food is great at the right price. Two slices of their square cut pizza is enough for me and at a $1.40 a slice you cannot go wrong. The shredded cheese on top is truly for the cheese lovers like me. You can ask them to melt the cheese on top but I like it just as is. If you choose to add toppings they give you plenty and charge about 50 cents def worth it. They also serve hoagies and sandwiches which I would love to try but the pizza is too darn good not to get.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bu1mtWwxuayzV6b3VScWLw"
  },
  "DESP2E6ugGr6LYsLnuhJgw": {
    "date": "7/30/2015",
    "text": "When I'm in the Burgh there is no other pizza choice! Worth the drive from anywhere!   Great selection and priced fairly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3DdOJ-oJHXlqJm6pZcYwrg"
  },
  "3bkUXYSUN9AjpPcSyUyUkQ": {
    "date": "6/30/2015",
    "text": "For being an out-of-towner, this is always our first stop as soon we we get into Pittsburgh. This pizza is like no other! The portions are huge, and worth every bite!! The shredded cheese on top & chunks of tomatoes just make your mouth water!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7kbgj121ZH6skZXTby-Fqg",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7kbgj121ZH6skZXTby-Fqg/o.jpg"
      }
    ],
    "user_id": "RTzCVCF0NzALmgDmdrqWJg"
  },
  "V1Meuo5XHqMTCilSrpjiow": {
    "date": "8/3/2015",
    "text": "I wasn't sure how I'd feel about cold cheese and toppings on my pizza, but Beto's has made me a fan! The crust is good, the sauce (chunks of tomatoes) is delicious, and the cheese was high-quality. Plus, for the price ($1.40/slice), you can't beat it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "64nM80q0nNsObF-8VGI7hA"
  },
  "pc2N9hutC4mqUXYRdqLT5Q": {
    "date": "9/7/2014",
    "text": "Nowhere else quite like betos. If you love cheese and like trying something different this place is awesome.  I grew up in Pittsburgh and get back rarely,  but when I do I go out of my way to grab a couple slices!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bL9jQobgp4FA4pjppqNXhg",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Mmmm",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bL9jQobgp4FA4pjppqNXhg/o.jpg"
      }
    ],
    "user_id": "I37f_4_wG44MDERVxS3biw"
  },
  "G-572Shwe_lTua2PnLzWAw": {
    "date": "10/4/2016",
    "text": "It's interesting to try once but not a place I would go to again. On a positive note the crust and sauce are okay. The issue is the 10lbs of cheese the put on each slice. The cheese isn't melted which is fine but it's not good cheese and its way too much. If you do heat up the cheese you end up with a pile of grease. And this pizza isn't cheap. It's definitely over priced for what it is. Try Bados and not Betos!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CB6e5sFpxyan-zrIemCZqw"
  },
  "eKn-edC9zWz2qTY5FggxMQ": {
    "date": "8/7/2016",
    "text": "We all got pizza and I asked for my cheese to be melted and Lo and behold my pizza comes out 45 minutes after my friends. Other than the wait time the food was okay nothing crazy but it was decent pizza.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-RaCAWu1N55auQAzFKp0_A"
  },
  "DH2KLoiqSUvi21G6t62ONA": {
    "date": "12/20/2015",
    "text": "I really wanted to like this place but alas it just wasn't happening. They put WAY too much cheese on everything. I know, you say, how can one possibly have too much cheese. We ordered a salad and it was topped by probably more cheese then it had vegetables, I had to dig the lettuce out. Then the pizza had so much cheese on top that the cold cheese wasn't able to really melt because it was piled on so high. I could see how the cold cheese would be good if it all melted together but because of the amount it just didn't work. Also the toppings (mushrooms and peppers) were cooked, just FYI - I was expecting raw since I thought it said all toppings raw.  When I got home I had an awful stomachache from all the cheese. Totally my own fault, but still, watch out. This was my first visit here though, so I dunno, maybe it's not always so cheese-rific. Or if you really love cold shredded mozzarella cheese, then this might be the place for you.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "MKeWSLsayBxEqz4xMeMeow"
  },
  "AcgAurLk4bCXt_mMzxlXOw": {
    "date": "3/2/2012",
    "text": "Beto's Pizza is definitely my go-to pizza in Dormont, even though I have to hop in my car and drive down there. Trust me, the drive back always seems like it takes forever, because I feel so weighed down from their delicious pizza.  Beto's is a little unorthodox when it comes to your traditional pie of pizza. First, they sell pizza by the square slice ( which isn't so unorthodox, I know) and second their pizza comes out with the cheese uncooked on top of the hot crust, along with any other toppings you might fancy. So, yes, you will eat your pizza with uncooked cheese on it. And yes, YOU WILL LIKE IT.  Beto's breaks the holier-than-thou commandments of pizza with their methods of pizza production, and while indulging yourself with their pizza, it never felt so right. Try eating more than four pieces, I dare you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "2bJL-BO-uEgHJbWZLyoBow",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Beto&amp;#39;s pizza topped with banana peppers",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2bJL-BO-uEgHJbWZLyoBow/o.jpg"
      }
    ],
    "user_id": "WC235EldJD3vxmh7VFnGpQ"
  },
  "nrozc_z1jXu3mpg33a9HfQ": {
    "date": "11/17/2014",
    "text": "One of my favorite pizza spots in Pittsburgh.  Been coming here for years.  The only downside is if you go and they are just putting a pizza into the oven.  The wait to grab your cuts can be a long wait.  Well worth it because of how damn good it is.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "91koVXu54Y6tIiZKKxVmrw"
  },
  "IUMvxeMt6cU3bBga9HPwDg": {
    "date": "8/2/2016",
    "text": "Fantastic & Unforgettable Pizza! Pizza crust is crisp & not overdone. Sauce is Delicious & Fresh. Cheese on top is Soo Good & Different! Always Deliciously Consistent!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5YvDZGxzxBIHJsnHKoW17g",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5YvDZGxzxBIHJsnHKoW17g/o.jpg"
      }
    ],
    "user_id": "qQ9vjTQABKRUh1vcY4nf7A"
  },
  "EsOXKKplWqVx4m1Dgn6N-A": {
    "date": "12/18/2014",
    "text": "Either you get it or you dont.    The cold cheese might sound weird, the toppings being cold might not sound good, just shut up and try it.  This pizza is unlike any you've had before but if you like pizza it is a must have.  I dont make a trip to Pittsburgh with out stopping by Betos.  The toppings are plentiful, the cheese is ridiculous and the crust is super crispy.  Love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uwHXzO9FhQ9NWLREF7EUBg"
  },
  "S7vpQJG9ESqF517BQ04SVQ": {
    "date": "12/29/2017",
    "text": "Not my favorite pizza ever, but as far as pizza goes in general tough to beat this joint, great crust and sauce but the cheese steals the show and if you get a topping that alone may fill you up, great wings and hoagies too..super yummy stuff. yinz will like it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OKKdrXefCFEi7xoiY1xEnA"
  },
  "HsU41G_dLBrvfwPyyLKtog": {
    "date": "8/16/2016",
    "text": "Got hooked on Beto's when I went 4 years ago when my girlfriend and I first started dating. Instead of regular pizza, Betos cooks the pizza without cheese and piles fresh uncooked cheese and toppings on your slices. The uncooked cheese and toppings are not for everyone and admittedly there was a period of time I grew tired of it, but when you're tired of the pizza the hoagies and wings are just as good. My favorite part though is the crust. I have had my fair share of pizza but I have to say that Betos makes the best crust in Pittsburgh. It is firm, crispy and tasty, and the contrast with the cold cheese is a great balance on your taste buds.  My girlfriend's parents have been going there since they were teenagers and I wish I could have experienced the time when you ate Betos in your car with your friends hurrying so the cheese didn't melt. Regardless I highly recommend trying this unique pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "td_A1KFjOKtPrWdK6yi5kw"
  },
  "dmrQv9ytg5xwZpqP3vwuPg": {
    "date": "9/11/2015",
    "text": "Finally got a chance to try Beto's with my wife and some friends. The place was jumping on a cool Friday night and we waited about 5-10 minutes for a table. Didn't have a great first impression as the whole place was a bit of a mess. Dirty tables, floors, screaming kids - but I got past that pretty easily.  My wife isn't a big pizza person, so we played it safe by ordering salads, wings, and a couple cuts of plain.  Food came out fairly quickly and in order which I thought was great (and wasn't expecting). Salad itself was fine but didn't find the huge pile of cheese necessary - I get that this is what they're known for and knew it was coming, just not on the salad. Lots of onions, tomatoes and olives which made me happy.  Wings were surprisingly good, we had a dozen hot and the sauce was basically franks - but I'm ok with that. Well cooked, hot, and lots of sauce.  Pizza was pretty much what I expected, nice crispy crust, chunky tomatoes and lots of cheese. Little off putting as the waitress set the plate down on the table the cheese rubbed up against the tabletop which caused me to remove any of the cheese that touched. I enjoyed the pizza, and would I back, but not sure my wife would.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhQOA8-FdpA6D0hNhXEYIw"
  },
  "eXOZS7k3HwX133QdyVW8_g": {
    "date": "3/15/2015",
    "text": "I stopped in here by myself this past Saturday at around 6:30 in the evening.  I had been here once before but it had been a number of years prior.  Man was this place packed!  I had trouble finding a parking spot and upon entering the restaurant there were no open tables and about 10 people waiting for their orders.  Since I was due elsewhere later in the evening I decided to order four cuts of pepperoni to go.  After that I sat down on a chair to wait.  It was at this point that I heard one of the employees telling another that they should tell everyone it would be about a 30 minute wait.  Thankfully it only ended up being a 15 minute wait before I was out the door and into my car.  So how did the pizza taste?  Sorry Beto's and the South Hills but I just don't get cold cheese and toppings on top of a baked crust.  This is now two times that I have tried it and this time I was prepared for it and more than willing to give it a better chance.  However it just does not work for me.  The positives for the pizza are that the crust is super crispy, almost cracker like, which I really liked.  I don't know that I have had another pizza crust that was this crispy before.  There was also a ridiculous amount of cheese on my four slices which I consider to be a good thing.  As to the negatives of the pizza, the main one is the cold toppings.  To me it doesn't really feel right and I am not a fan of it.  This also causes a secondary issue of the pizza being extremely messy to eat.  Since the cheese hasn't melted together and also hasn't melted the toppings on, it goes everywhere.  The bottom line for me is that I probably will not be back again in the future.  While I know that many people love it, it really doesn't do it for me.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "OsLb6_nKkNtcsVyew4ihDw": {
    "date": "4/23/2018",
    "text": "I traveled 40 minutes to try the famous Beto's Pizza and boy am I glad. So I'm used to the cold topping pizza, to me it's a great twist to the old classic. But what sold me was the crisp texture of the crust and sweet tomato sauce. Beto's crust is flavorful but the level of crisp texture is out of this world. First bite and the crunch is mind blowing! This crust could hold toppings for days, don't get me wrong I'm not talking concrete strength. It's nowhere near burnt, but seems to be double baked to where the bottom crust is golden brown with a full crisp bite. Now for the sauce, full tomato chunks that are naturally sweetened. A robust tomato flavor not overly seasoned allowing for the True tomato taste to shine. Next visit I'll be asking for extra sauce on top or on the side because it's that damn good. Normal toppings which were good and added extra flavor to an already awesome pizza. I'll definitely be back for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "38zVOHdO02GB3kfc31q2Kw"
  },
  "GLf90rHwb8h2-NwRmqaAwA": {
    "date": "10/15/2017",
    "text": "My Grammy used to make pizza for us from scratch; she'd make her own dough that resulted in a sheet crust that was thick, crispy on the outside but fluffy on the inside. She'd put the sauce and cheese and toppings on late in the baking  process and the cheese never quite melted completely. The resulting pizza had a flavor and combination of textures that were really unique, and until I found Beto's, I'd never had pizza from a restaurant that was anything close to how my Grammy made it. The pizza from this place is different, and not for everyone, but it's worth trying.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wrfKakI7BHbYk4KIieYsQg"
  },
  "qdF45B4Bl3L8IBxx4VtlHA": {
    "date": "2/19/2015",
    "text": "I was super excited to try the pizza and I am so happy I did. It was so different but so so delicious !! I also had a side salad.. It was ok, I would have liked to see a little variation of lettuce but it was just plain iceberg. It was a nice size and had some fresh veggies and of course some of the amazing cheese!!! It's the coldest day of the year and they have the fans on, that's my only con about the place really. It's freezing in here!!! Also, I would like to add the staff is super nice and friendly :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "iFWKx1S9MBns69i5OfR8Zg",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iFWKx1S9MBns69i5OfR8Zg/o.jpg"
      }
    ],
    "user_id": "RkLluG0LGXiJgf2i9dGmDQ"
  },
  "s0E3ZUolmX6MmFZKG2CbbA": {
    "date": "8/11/2014",
    "text": "Good stuff. It's places like this that make me almost interested in moving out of sunny Southern California and into Pittsburgh.   We don't have pizza like this here.  I've been to back to Pittsburgh like 10 times and I've stopped by here every time.  A couple cuts of cheese pizza will fill you up. Yummy,  Don't order extra cheese. A normal cut will have more than enough cheese.",
    "rating": 5,
    "rated": {
      "funny": 10,
      "useful": 12,
      "cool": 13
    },
    "photos": [],
    "user_id": "VtnCudEFLBjnxblLUAPYhA"
  },
  "3IpMy4Ilwvse-sBtHiDhUw": {
    "date": "4/5/2015",
    "text": "Much has been written on that of the mythical Beto's pizza, so I will keep it brief.  A local favorite; the dough and sauce are baked in the oven, and THEN the mountain of fresh mozzarella and toppings are thrown on afterward, right before it's served to you. Resulting in a multi-temperature slab of pizza goodness that is actively melting together as you eat it.  Extremely inexpensive. Quick service. Down-to-earth staff. A very 'family-run' feel. Bring your buddies or your S.O. or your family, eat some delicious pizza, and then disappear into the night toward your next destination. You will be satisfied.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NqCKk-Fgw7Jv9PIGqcPELg",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Delicious pizza mess",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NqCKk-Fgw7Jv9PIGqcPELg/o.jpg"
      }
    ],
    "user_id": "QF_BpTDypixPoEviPQRdeA"
  },
  "ovKnzqIy8vqSKIyExCfCDA": {
    "date": "9/29/2017",
    "text": "This place is great!  The raw cheese seems unconventional, but it works!  I will be coming back the next time I'm in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MJiZMe1RkKbMRQZa_p9AlA"
  },
  "MAAWcINg5INL9zBf9Ecmrg": {
    "date": "5/21/2016",
    "text": "So sometimes I really get a craving for their pizza plus it's so close to my house it's an easy meal. The cold cheese isn't everyone's cup of tea and while it is unique, I don't think I'd rank it with \"the best\" in Pittsburgh. But there's something about mounds of cheese on a crisp crust at a pretty cheap price. For the best experience, I highly recommend eating it there and not getting take out. It's best and most crispy right out of their ovens. I think it loses a little something sitting in the box.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xwecV1wwnA_2oZH0GkpZOw"
  },
  "NfSiTABxSRe_99F-HtQllA": {
    "date": "4/16/2017",
    "text": "Best pizza in the burgh! The negative reviews you see here are morons that wouldn't know good pizza if it smacked them in the face!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "khy6-3rI7q2lWnVVR04k0g"
  },
  "45h8L3PX5wKyhKqLcfm_8g": {
    "date": "6/30/2017",
    "text": "While I personally despise the cheese being cold, that's apparently just their \"thing\". My entire family loves it, and Beto's is always a good sport and will melt the cheese on my slice(s) for me no problem. The pizza isn't extraordinary by any means, but it's good local pizza and a Pittsburgh classic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QbdMp3irBF5u5Y9IOOC0iQ"
  },
  "CgMt8i_bxobXemIE5OggtQ": {
    "date": "1/21/2017",
    "text": "Not my thing at all.  Not after just having awesome Jersey style yesterday.  Jesus...this was a mess.  Some ghetto crackhead kept ripping her kid around yelling at family and blowing her rank breath up the nostrils of newbie patrons.    We were given a mess that quickly began collapsing the box.  I tried a slice after getting home and it was a dilapidated amorphous pile.  I tried to heat a piece and that must be some weird cosmic shit as the cheese quickly engulfed all signs of the crust.  I was left with a cheese pile, some chunks of tomato and a limp sliver of wet dough.  Anyone with the stones to pretend that this place is a 5 star affair likely grew up eating roadkill.  Take it from me.  I understand these things.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yTdaR2Kk2t5AIE72rOigyw"
  },
  "V0iCW8dnom_gLUjmomG80A": {
    "date": "3/24/2015",
    "text": "I truly have never had better pizza in the entire city of Pittsburgh. My boyfriend & I went as first timers last Friday after hearing a million good things from our friends.  Beto's did not disappoint. The staff was friendly, place was casual, and service was fast. We will be going back every Friday as a new date night tradition. If you have never been, do yourself (and your belly) a favor and make the trip (and order extra-- it makes for amazing leftovers)!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Bts8Dmi4uwfr6y1lcrG0bA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Mushroom pizza! NOM NOM NOM!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Bts8Dmi4uwfr6y1lcrG0bA/o.jpg"
      }
    ],
    "user_id": "hJz36D3w8Mt5sU6APl_Fhg"
  },
  "EkOnkVH1rd7y5bdeLXR4PQ": {
    "date": "12/4/2013",
    "text": "I've had a rough day. A really rough day.   I'm not even hungry. I really want to do nothing but sleep. But I CAN'T. You know why? Betos pizza is down the street! I can't miss out on the amazingness that is betos. This has been a staple in my family for several generations, and i try to stop here whenever I can. The secret to their pizza- a combination of regular, melted cheese and then a whole bunch of cold cheese on top. It creates a beautiful harmony of dairy delights. This is deserving of a normal picture.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "SvmwynkMbdBizwXOWG7tHA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Beauty.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SvmwynkMbdBizwXOWG7tHA/o.jpg"
      }
    ],
    "user_id": "2oStIL_6IfaXvdRQluTX7w"
  },
  "zJluplko3NHhlSjQb6NQQw": {
    "date": "8/8/2017",
    "text": "Hands down best in the burgh   this pizza is so unique and delicious. Who can eat anything else?   This menu goes from delicious to addictive. From pizza to hoagies to wings. It's epic",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ufz_yQ4JmEblAwKF-bRuUg"
  },
  "t3vJUoM9cVEZrAwXFEYrUQ": {
    "date": "8/10/2014",
    "text": "Best pizza in the land (Steeler's Nation that is), enough said.  Eat it there for the crisp crust, if you like crust a little more forgiving get it to go and let it soak up the juices from the San Marzano tomatoes.  Another bene to having the pizza on premise, the cold sprinkled cheese.  To die for.  Coming at peak times is risky, as the dining room is small and seating is first come first served.  I love this place, and have been eating here for 25 years, since I was a little guy.  I would say Fiori's is a close second, but when I am in town and have limited time...Beto's it is!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9_PT31RxTMpKJYGC7BI8aQ"
  },
  "12zB6lFN4qpH2qwl53RUnQ": {
    "date": "3/12/2017",
    "text": "This place is amazing, now it not your typical piz pizza shop it puts the cold cheese on top but it is very delicious so if you don't like cold cheese on top of your hot pizza then this will not be a good place for you but I can tell you as someone who grew up here that is by far one of the best pizzas you ever try",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WrLe80KxpEoV9aiZMR5fvA"
  },
  "EqeacJdUuwI8Fl_2fqOuyg": {
    "date": "11/2/2015",
    "text": "The pizza here is different from your traditional place. They only bake the dough and sauce then pour on the toppings cold. It reminds me of the those Lunchable pizza snacks I used to eat when I was little where you have the ingredients separate then you put it together yourself.  This pizza joint isn't one of those places you fall in love with immediately. Eating pizza with cold toppings is a bit strange at first, but once you get over it its pretty good actually. It took me a few tries until it started growing and now I find myself craving for it often. Its pretty awesome how they give soooo much topping on each slice too.  I usually get take out from this place but there is a small seating area to eat at. This isn't one of those places where you must eat at the restaurant since the pizza is cold anyways.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "03tU93DGIpbRtUqPXMeiPA"
  },
  "HDuKGcpLb5s65iY_KeLLSA": {
    "date": "4/21/2015",
    "text": "Amazing is all you can say about this pizza. Being that I am from Weirton, West Virginia originally this is the only pizza that reminds me of \"home\". If you have never had square pizza I recommend you get some right now. Top those slices with some nice cold cheese and you don't even need any other toppings. I can't speak highly enough about this place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g3ed9dHoRs5xvad1sJavOg"
  },
  "T9mLitq0xrw05jhJVu9iFw": {
    "date": "8/22/2011",
    "text": "I tried the \"cold cheese and toppings\" slice that Beto's is famous for.  If you have heard about there style of serving pizza, and are wondering what the punch line is, there isn't one.   They make a big square tomato-sauce pizza and throw cold shredded cheese and other cold toppings on it, and that's it. There's no secret ingredient or special something  that makes it tastes like anything other than what you would get it you grabbed pizza fixings from your kitchen and forgot to bake them.     I guess a lot of people like it, and more power too them. But I don't get it. Ramblin' Boy didn't get it. I see zero reason to agree with people that say that this is the \"best\" pizza in the region.    Maybe their hoagies will be better.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "6uJbsF_YaXqnffQpLTW47A"
  },
  "nQOOtsagK1ORQ-4hf0-IaA": {
    "date": "8/13/2013",
    "text": "No way. A ton of cold shredded cheese thrown on top of pizza? No no no. No beer either.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "rzEcrfLUfS3Nn7e3qZvk7A"
  },
  "y5MGJ-3UbG88zvUWrWsAng": {
    "date": "10/1/2014",
    "text": "I love Beto's pizza! It is not always the same though. Occasionally you get a day when it's off. It is also not for everyone. Tons of unmelted cheese, whole tomatoes, very crispy crust. If your up to try something different, Beto's is it. Their hoagies are also very good. They aren't super expensive, and I like how you can get as many cuts as you want. Sometimes I just don't want a whole pizza!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RL7HLEBCuD5a-qFneAigeA"
  },
  "KkCqrWhI_qyzioNODBJ8mQ": {
    "date": "8/15/2015",
    "text": "We are from out of town and heard this place had good pizza. I decided to call and order a pizza, so asked about what kind of sizes, type of crust and if they do white pizza. The guy told me he only had pizza crust and red sauce and since I was asking for a different type of pizza, that this wasn't the right pizza place for me. He told me I wouldn't want to order from them and hung up the phone. Not sure if it was because if my Hispanic accent or what but he was extremely rude and didn't even give me a chance to order or ask. I would have been perfectly fine with a red sauce, regular pizza crust with cheese and pepperoni but he wouldn't even take my order. I was just trying to ask. Rude. Very!",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "IhGAPYmYd9468Omk9U_oeg"
  },
  "vg83AFDU4QgFmrLonx7Eow": {
    "date": "6/2/2013",
    "text": "They cook the pizza pull it out of the oven then throw cheese and toppings on it then cover it up in a box. When you get home to eat it you can hope that the cheese melts enough so that you can eat it without the pieces of cheese falling off of it. I get it its definately different and tasty.  The place was as clean as you would expect from a pizza shop. There are two problems I have with this place and the first one is their prices. A slice of pizza is $1.30 which I have no problem with it seems fair. However if you want a topping its $0.50 per topping which is ridiculous for one slice of pizza. A small fountain drink (aprox. 16 oz.) is $1.99 which is also very expensive.  The other problem is the parking lot. Whoever painted these lines did not measure out the area. I was in a van parked in the middle of the parking lot and could not leave until the car that was either in front of me or behind me left.  Don't get me wrong the pizza is good but the hassle I could do without.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w4zFlHj5k3Bry5Zt1FZCJw"
  },
  "-HfY-v_LK_WdE-EGUMUCoQ": {
    "date": "8/19/2011",
    "text": "Say what you want about Beto's but it is certainly unique. You either love it or you hate it. I love it. But... this wasn't always the case. When I first went there, after hearing my boyfriend rave about it for years I was nervous to tell him what I actually thought. Cold cheese? What is this nonsense. But after the second trip it grew on me. Now I'm hooked. Like other people have said when you want pizza you get pizza. When you want Beto's you get Beto's. If you're in the mood for a typical Friday night quick pizza place this isn't going to do it for you. But, if you go in expecting it for what it is you may just enjoy it.   Now it's always busy. If you want carry out call it in, as I've found myself waiting 25 minutes when I thought I'd swing by and pick up a few slices. If you want to eat in prepare to wait for a table at peak times. Then try to awkwardly make a mad dash to the next available table while competing with 4 other people.  Since I've been going in there most of the people working are nice. There's one bad apple who seems to be a total snot and I can't stand her waiting on me. But, there are a bunch of other nice ones to make up for her 'tude.   I've heard the other food is great. I've only had the onion rings and they are awesome.   So try it out if you don't like it you're not alone but if you love it you're a member of the cool kids club.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "EKLEgw8LBo_v1gvvdS9F6A"
  },
  "kR6KzNw7Qo8pCE4WTMj2Xg": {
    "date": "8/6/2011",
    "text": "I absolutely LOVE betos  When i first moved to Pittsburgh i actually hated it and refused to get the pizza, so i would just stick with the Italian Hoagie..... Yummmm it is probably the best hoagie in the burgh, no jokes.  The pizza i grew to, and i assume that some people have to do the same. But boy did i grow to it fast once i did. I remember one day just trying a slice and was in love with it. I think it has to be the sauce, it is so so so so sweet and just abosultely amazing. The cheese is also amazing because it makes the hot cold sensation just that much better. I always get 2 slices, 1 mushroom 1 plain and an italian hoagie with lettuce pickles mayo   I Truely cant wait to get back to the burgh to have some betos  A down side to betos is it gets pricey if you eat alot. But hey if thats what good pizza costs then so be it, im happy with it",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "SfkCNaq_JLYkutheYo_sIg"
  },
  "ZJ1ZFIC2QGqcr0xLkIon5A": {
    "date": "1/23/2014",
    "text": "I have been eating Beto's pizza since i was a little girl.  Our family would pick up 4 cuts for carry-out, but we werent allowed to open the box until the cheese had melted a bit.  I make it a point to stop by whenever i am in town.  There is something about the fresh cheesy goodness, the crispy crust, sauce with big chunks of tomato and pepperoni ( even though it is not cooked) that makes my tastebuds and my heart sing.  Either you love it, or you just cant figure out what it is because it's so unlike any other pizza you will have eaten and you will hate it.    To be clear, they bake the pizza and sauce and when it comes out of the oven they load on the cheese and any other toppings.  The cheese melts a bit, but not entirely.  There is a lot of cheese - no need to order extra cheese!    Good subs as well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WBX9XQDXWraCcEwYaxz2VA"
  },
  "9LZmftDu9hTLoN2_FxU85Q": {
    "date": "5/31/2014",
    "text": "The pizza is ok. The tomato chunks are delicious and the pepperoni too. But they don't bake it and the stuff all slides off the crust. Overloaded too much with cheese . Not horrible but certainly not the best.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-xlOz4tH5iEbh2mcyoLWzA"
  },
  "IKq5kFmoGqolUpCaHkNXnQ": {
    "date": "5/17/2016",
    "text": "Pizza is good with the cold cheese but the place is Always dirty and no one wipes off the tables. He employees walk by dirty tables then people sit at them.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U0WraZ_ezmt84GyOAUWgQA"
  },
  "ttUqQRuzd_YuHpA0uOCi1g": {
    "date": "2/5/2016",
    "text": "Get the cheese baked. I love it that way! It is delicious! It is usually always crowded, call ahead for take out! I wish they would open a few more in other parts of the city!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s49XcBEol0Zf4HsvB6TC2A"
  },
  "xI0Vkptem3peSAy_tqaFkg": {
    "date": "5/20/2013",
    "text": "You will either love it or hate it.  As a Pittsburgh native, I absolutely love it and it's my favorite pizza.  They cook the pizza without the cheese and when it comes out of the oven, they put the cold cheese and toppings on the pizza. If you are eating there (and the pizza is best immediately out of the oven), the cheese will melt in your mouth as you are eating it.  The slices are big and they really load them up with cheese. Also, the sauce has huge tomato chunks in it, unless you ask for it without.  As far as the actual restaurant, they made a major upgrade a few years ago and it is much more accommodating than it was before. Prior to the renovations, it was tiny with a few small booths and very little standing room.  I believe this may be a strictly Pittsburgh thing because I have found nothing like this (other than a chain in West Virginia) that makes pizza this way.   That being said, every time I visit Pittsburgh, Beto's is my very first stop after leaving the airport.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "e0wJ-gIHuK7-fI96bGQRrQ"
  },
  "c-yvLL1ZJ5g7ISOhEzphKg": {
    "date": "3/25/2016",
    "text": "Don't know what I just ate but 10 minutes after consuming what I thought was pizza, heart burn is kicking in strong. Wouldn't recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ghGBx0XlWr_k_yDM87mKPg"
  },
  "3GyR8S1lHQ-HMy6XCOZM7g": {
    "date": "6/20/2011",
    "text": "Blah blah blah, cold toppings, piled high cheese, yinzer childhoods, etc. Beto's gets three stars because it is inconsistent - and they themselves admit it. I've had pizza from here that is outright bad, I've also had pizza here which nudged against my all time top pizzas list. Usually there will be a cycle for me where I will have a really good slice, and convince myself I have to go back there - sometimes in the same week. Then I'll have a bad slice and forget about it for months, maybe even years. Then I'll be in the area again and the cycle will continue.   The cold cheese doesn't bug me because you get so much (portion size here is far beyond ample. $1.25 for each slice - 4 is well beyond my maximum - gets you about a 1/3 of a bag of mozzarella, an extra $.50 will get you as much of whatever topping you feel like having). If you get take-out, it'll pretty much melt by the time you get home if you leave the box shut.   One thing to note - this is my favorite place to get black olives on a pizza, since they don't go into the oven.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B5FTjNWSgkAQ9UjOKVjGhw"
  },
  "u2wLYCY8OUnkbROffKKYNg": {
    "date": "3/7/2016",
    "text": "Betos has always been a family favorite. When I was a child and would stay at my grandparents house it always was a treat. Now that I have children of my own. I also bring them to Betos for a treat. When they come it's so exciting.  Now that I have grandchildren they are getting to experience this great treat. Betos is the best. They do not deliver but that's part of the Betos experience. The wait whether it's to go or to get a seat in the restaurant part is exciting. Just love Betos",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LFpVISjT8V3RHxO646DbpA"
  },
  "mpzs9uWoV7eTeSobShGzNQ": {
    "date": "1/7/2011",
    "text": "I was out with a friend the night before new years eve. Note to self: veggie burgers are not a meal for a man. After seeing Harry Potter 7.1 at the theatre we both proclaimed we were hungry for abnormal pizza. Let me explain, we didn't want to order generic, neighborhood delivery pizza. Pretty much I'm tired of tasteless, no crust pies that lack nuance. Since lesbian friend of Joe D lives in Dormont, Beto's was a natural. She's never had the beto's experience. So I told her to follow my lead, I ordered two slices, one with black olives, the other was plain, small drink. She ordered two slices , extra cheese and pepperoni. I forgot to tell her, nay, I purposely didn't tell her about the cheese because I knew she'd turn her nose up at it because the idea of cheese not melted on a pizza would surely upset the planets and cause disruption in the space/time continuem. But it backfired on me and the one thing I didn't expect was her to order extra cheese.   We sat down and I explained to her the total stupidity of ordering a large drink in a place that offers free refills. Order a small, it's way cheaper and this really sounds like a scene that could have played out on an episode of Seinfeld.  Pizza time! The look on her face was one of shock, like mine when I realized that America was indeed stupid enough to elect George Bust for a second term. The cheese was piled high, and no visible evidence of anything under this massive mass of diary goodness. Like a trooper she picked up a slice and dived in. She liked it!  After we downed our slices I told her how sitting here has brought me back to my high school years. The pizza still has that same texture, creamy cool cheese, warm crunchy crust, and wonderful smell. Beto's is still my choice for best pie in the Burgh",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "UsmTxWbobLsI6WR1Db0W7A"
  },
  "IpsHU1Ln-i6B4tmTINbw9A": {
    "date": "10/17/2010",
    "text": "Pops has telling me for years that the hot sausage sandwich is the thing to get at Beto's.   Well, the Cosmic Trickster was REALLY being a tool yesterday, throwing my plans into a blender with a number of pranks that included an unexpected road closing among other glitches. Our circumstances basically left us with no real choice but to go to Beto's.   The girlfriend's sick of sandwiches and pizza. Hence our apprehension. I Ioved their food the last time I was here but didn't wanna hear any kvetching. People with low blood sugar get into...\"moods.\"   I got her an Italian hoagie to play it safe as I got into a knock-down, drag-out streetfight with my hot sausage. The sausage itself was packed with spices and was probably made in an Italian grandmother's basement. That sauce was over-the-top, over-the-top like that Bullet For My Valentine tune...  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dc8k0Gkl6rDI&s=759316e5b351526d4a4396341c4ebd0e7edb3326cb222bf0634cfc37de6b0af4\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=c8k0...</a>  Now as you should know if you don't already, Beto's controversially coats their pizza in unbaked cheese. Hey, I kinda dig it but many don't. They DO melt it for the hot sausage however.  Hmmmm...  It was as good as I had heard, but man was it a handful in terms of getting eaten. I looked a bloody mess after I was done, as if my dining experience was instead a barbed wire deathmatch!   Mothers gawked in horror, shielding the eyes of their kids. Portly men cheered me on, stomping their feet and chanting my name when I got into trouble.   A little old lady hit my sandwich with a cane!   I kid the hot sausage.",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 7,
      "cool": 6
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "-JWaEX39o-ISIGhtCiMJ3Q": {
    "date": "4/22/2013",
    "text": "I love this place.  Every time I am town I have to stop and pick up a couple cuts.  I even take them home with me to Baltimore.  They are great even days later.  Coming to town in a couple weeks and am I definitely taking some home to my fiance.  Cheese cheese and more cheese please.  This is my favorite pizza ever.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BLzucuX05g-bMSzQuiQ-wA"
  },
  "M99AR0pMaPda26tZM6w30g": {
    "date": "11/29/2015",
    "text": "hands down the most slept on pizza shop in pittsburgh.  its the best in my opinion.  cold toppings is badass to say the least. not your typical pizza which puts it light years ahead of the rest of the pizza game.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oeqU0xooF_BkFvMJ_dDbxQ"
  },
  "fyHk44iO67DH851K0xcPkA": {
    "date": "8/5/2016",
    "text": "The best of both worlds.   Who has not awaken and had a cold piece of pizza?   This guy right here!  The crust and sauce are hot.    As other reviewers mentioned, they shave fresh mozzarella cheese that starts melting immediately on the hot crust and sauce with cold toppings of choice.  I really enjoyed their cheese.  I am not sure if it was fresh or because it was freshly grated (thin) on my individual slices.  I did sausage (cold).  It was very good.  The slices were large and filling.   The meal was inexpensive.  The only con's I have were seating (small area - crowded during lunch) and plastic wear.   The knife and fork did not do too much for me so I went caveman style.    I will get it again (take out).   I think I will get more sub toppings (ham, onion, banana peppers, etc...) on my next slice.   I am sure if you are a fan of hot pizza - this is the perfect take home.  Stick it in the toaster oven when you get oven to cook your toppings :)  Service was great too.  The person that took my order mentioned if I did not like, they could stick in the over to cook the toppings.     Great experience.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "JgOcyMF1lTwSVCarSZrrrA"
  },
  "PBCYjR41qGMlaguqqC12wQ": {
    "date": "7/29/2018",
    "text": "If you like half cooked 'pizza', you'll love this place. Seriously, the pizza is served like an open faced, cold cut sandwich and should not be referred to as pizza. The toppings and cheese are thrown on in a mound on top of a toasted crust and warm sauce. You might as well go to subway. And it's overpriced.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e6qUvRwsKwmyJFN5hEJ_Qw"
  },
  "JzjUkJMy2I9JrBAyw29KvA": {
    "date": "1/11/2019",
    "text": "This place is Sooo inconsistent!!  Could be great, could be soggy and sloppy or could be tough and flavorless. Guess they do train staff well.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NbXG40X0oYPiPJxPOQme8Q"
  },
  "uqtiF4dD56F1Hr4cn25Glw": {
    "date": "5/15/2018",
    "text": "Love love love this pizza!! Located on Banksville Rd. The thick crust with tons of delicious mozzarella and toppings of your choice. The mushrooms are my favorite. They are HUGE and delicious! Pizza is bought by the slice which I love. You can order as many or few as you want.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6s8pzEG392M-zHvayaIBRw"
  },
  "0HhwoCor96IFnbUFsAbEAw": {
    "date": "8/18/2017",
    "text": "Not a fan, the food here is cheap and it shows. Not my style at all! It's pretty dirty in the dining area. The staff is nice but the place is really gross. Come here at your own risk.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ACDUQC6zzRLQKTtyCgL6w"
  },
  "NQkjGWMPdf7jxwfYBHNoyA": {
    "date": "1/23/2017",
    "text": "This pizza is a shame, I mean what the Fuk . . . .  If you're not already really drunk and at the point of nearly eating out of a garbage can like a bum, I don't see what purpose this mess serves..?..?  Because no sober person with a shred of self respect would eat this shit-  OR have the nuts to give it a 5 star review??  Sickies..Maybe its all the fracking going on in this part of the country, peoples standards along with any intact brain cells have just vaporized into a noxious gas and blew away into the thickly polluted air.  Anyway, if you like slimy squares of barely warm , undercooked , generic factory made \"pizza\" crust with a pile of Fuing COLD, worm like cheese piled on with nothing but canned toppings, I guess you're in luck with this pitiful establishment.  Really, high school cafeteria pizza is better.  To top things off for your classless PA dining experience prepare yourself for manly, know-it-all,  loudmouth Italian 'women' to shove in front, steal tables and let their genetic reject offspring run a muck in the dining area .",
    "rating": 1,
    "rated": {
      "funny": 13,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "8ojnJburkPT1ABaTn-UGuQ"
  },
  "RBsfSuO9LTVvTUL0NeBTzA": {
    "date": "12/10/2017",
    "text": "Cold cheese and thick crust might not be for everyone but I fucking love it. Always busy for a reason, they have great prices and consistently delicious food. I love that they are open late and serve up a different style of pizza!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "k_YO7nMN9Hshw1yZ1ZuoPw"
  },
  "z4mhXmZUSIU0fuxh-QyQWQ": {
    "date": "2/19/2018",
    "text": "Just love this pizza. It's just as simple as it gets and absolutely delicious. Reminds me of my mother's homemade pizza. Love the chunky red pack tomatoes on top, not sweets at all, and the fed cheese on top. We always get the cheese on the side and have a huge bag leftover to use the rest of the week. Also love the Italian hoagie. Been coming here for many many years.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xCjoVozCWX1i91rJweJeBQ"
  },
  "LeydElWbKcApp-PINa3Qtw": {
    "date": "5/17/2016",
    "text": "Beto's---I love you!! You had me at raw toppings! I'm one for extra cheese on everything. The cheese on this pizza is so generous that extra is never needed. I've been a patron since I was a kid. Primo pizza. Thank you for existing!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "SvGOdpqRFy-j6mTRuynQ3Q": {
    "date": "1/9/2018",
    "text": "Ah yes, this is the place that we've all heard about that serves the uncooked toppings on top of a thick crust. Look, let's be perfectly honest... Sure, it's a very creative idea, and maybe for some people, it's right up their alley. However, this is the town with Mineo's, Aiello's, Fiori's, etc. The competition for best pizza in the 'Burgh is heavy, and quite frankly, this is just too gimmicky for me. It's not to my taste. I think it's become clear to me that I want my toppings and cheese to be cooked, and I want a thinner crust. Beto's may be for some, but it's just not for me.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ry4atEgXsi28sKFDGiVVw"
  },
  "8ozae-X_Ch5e4XTjXd0hwA": {
    "date": "10/26/2017",
    "text": "This restaurant should be called \"Chopped\".  They give a lot of ingredients that you have to repurpose to enjoy.  The pepperoni is raw. I'll probably fry it an mix it with eggs and green pepper.  The Pizza crust and sauce are okay.  The crust has a crispy crunch.  The pizza taste like cafeteria pizza.  The shrimp basket.  Skip that.  The cauliflower and zucchini need a better batter and to be hard fried.  When I think food next time I will just mix a Metabolife shake.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cSw5a_GcSiBR6xukfRuqGw"
  },
  "vyO9EsIwzW0B0McHQuk6JA": {
    "date": "3/3/2018",
    "text": "Hot pizza. Cold cheese. Weird? Yes. Delicious? Absolutely! When you want pizza but also something a little different. Sauce is very \"tomato-y.\" I've never had anything other than their pizza because I love it so much. Very reasonably priced.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e5jL6i7aeAKktpZcSLyLDg"
  },
  "kBbWZEUAzp2q_tszIFL62g": {
    "date": "12/31/2017",
    "text": "Beto's Pizza is as unique as they come. Baked crust and sauce and all toppings are placed on the pie after it's cooked. The combination of hot and cold make this an awesomely different pizza. Some traditionalists may balk but you only live once and Beto's is an awesome pizza. Different is good and I'm sure you will either love it or hate it. I along with my friend and brothers are sold on Beto's. Give it a try, it's truly unique.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0fq238YFVW5qWcWwebQaQA"
  },
  "zCdH31aB-kiAU_Rks2hYeA": {
    "date": "7/18/2014",
    "text": "Okay this place is freaking wild. If your from my generation than you can remember Ellio's rectangular frozen pizza. This place brings me back. Any place that goes there, then you know they're doing something right.   If you go here you will be in cheese heaven. I agree with the other people's review that you will either love this place or absolutely hate it. I'd have to give it a thumbs up but instead of calling it pizza, call it beto's raw cheese baked bread haha. They cook the bread sauce/tomatoes and then throw a heaping cheese pile after your meal is cooked. Then they throw on any toppings. I call it raw cheese pizza. It is good. Crust is crispy and the sauce is delicious.   Eatability I'd give a 2/10. The whole point of pizza is that you can bend it in half and then stuff it in your face. Here it's more of a fork and knife operation. The cheese falls right off because it's not melted so you end up slurping it up like spaghetti.   I dig it though. Good job beto's. Way to stand out from the mediocre pizza that plagues pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G4OblLYTV5BHr_9oMowpqg",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Raw cheese pizza! Yes!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G4OblLYTV5BHr_9oMowpqg/o.jpg"
      },
      {
        "img_id": "5uqFdRC1Q6560CQMZRYvdg",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Mac and cheese with raw cheese on top.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5uqFdRC1Q6560CQMZRYvdg/o.jpg"
      }
    ],
    "user_id": "pwpKFY_WRFddFj7B_w578w"
  },
  "kAyQu4cCfM6n8Ug1qolnRA": {
    "date": "2/17/2018",
    "text": "The pizza here is both unique and tasty. The marinara sauce definitely did it for me. However, the service was pretty mediocre. My boyfriend and I went with another couple. The other couple received prompt service and got hot pizza in a timely manner. I'm pretty sure they forgot about my boyfriend's and my order. The pizza took twice as long to come out and it wasn't even hot. The whole point of serving the pizza the way that they do, is so that the cheese melts as they bring your slice out to you. I'll probably go back, but I will most certainly not be dining in.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ONUwIGF2eDsx3mz6bP_LYg"
  },
  "_XpP97VEkfzErWW4EnRRwA": {
    "date": "8/20/2016",
    "text": "I will preface this 3 star review by saying it is my fault for not reading any reviews of this restaurant and blindly going off of word of mouth alone but this pizza is terrible.  Don't get me wrong, I've went through my early 20s drinking warm beer and eating cold pizza the day after a house party but the difference was that pizza was fully cooked at some point in time.  This pizza is near raw.  The cook bakes the crust, slathers on cold sauce, dumps a handful of cold cheese and toppings onto your pizza and hands it to you.  I can't handle this.  Even as a rare steak eater I need my cheese, banana peppers, and pepperoni to be cooked.  On top of that, where are the red pepper flakes?    Perhaps this is just not for me but it has such an amazing reputation in PGH (so much there will be lines out the door during Steelers or Pens games) that I can't give it 1 star (that and my own idiocy).  Let me say: I've warned you.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "hcwTFR_dvxiDZwdMyXCzIw"
  },
  "XVEHfiEmCaIQINNWx8glFA": {
    "date": "8/30/2015",
    "text": "I went here for the second time it's been remodeled. I decided to try the pizza with melted cheese. It has good pepperoni but the sauce and cheese aren't flavorful.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i47K7svqu8HgxNsSJekYtA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Pizza with baked cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i47K7svqu8HgxNsSJekYtA/o.jpg"
      }
    ],
    "user_id": "HgeE8guC565OELCyWLmY6w"
  },
  "472p0V6-L8r_zDBajr26EQ": {
    "date": "2/11/2015",
    "text": "I'm not at all surprised by the mixed reviews of Beto's.  I understand this is the kind of place where you either love it or hate it, you either get it or you don't.  I think most people who like Beto's do so because it's familiar and probably something they grew up with.  I get that, too.  It may not be the \"best\" pizza I've ever had, but there's a comforting nostalgic feel when you have something that has remained unchanged in decades.    Beto's has their own unique take on pizza and if your unaware of their preparation, I can see it being off-putting.  But if you go in with an open mind I think you'll find it enjoyable.  Service may not be the friendliest, but they aren't rude and orders are prepared quickly.  I've gone in, placed an order for a few slices and been handed a box before my change.  I usually just get cheese or maybe pepperoni.  It is absolutely not necessary to order extra cheese.  When you look at the pictures, you see why.  The crust is baked nice and crispy with the sauce.  Cold toppings are added after you order.  It might sound crazy and at first I thought it was crazy, too.  But the cheese starts to melt and the melding of flavors as you chow down is unlike any other pizza I've tasted and the often sloppy distribution of the toppings is all part of the charm.  I can handle 2-3 slices in a sitting due to the generous toppings and the cost is cheap.  The square size is very reminiscent of the pizza slices I remember from the school cafeteria in grade school and it makes me feel like a kid again.  Fortunately, Beto's pizza tastes better.  Just don't forget the chocolate milk.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "dYw3mZEvNPHvYbh3_1hqEw",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. 4 cheese, 2 pepperoni",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dYw3mZEvNPHvYbh3_1hqEw/o.jpg"
      }
    ],
    "user_id": "WoKCLSctS7G2547xKcED-Q"
  },
  "Ncgz_jRkF1YMQsUdbCYOVw": {
    "date": "10/6/2016",
    "text": "Their pizza is fabulous. Tomatoe pieces with handfuls of Cheese. Order a topping and see what you get. Crust is perfectly crisp.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Ci7FP9Qh_Kw21Doy9WCYA"
  },
  "rYAtjnHVDK-yNUejQKii7A": {
    "date": "6/1/2016",
    "text": "My family and I have always loved Betos!  However, our last experience saddened me.  My daughter and I ordered my pizza slices to eat in and hers togo. After finishing mine, we inquired about our take out.  After waiting 15 minutes ( around 45 minutes after we arrived and I ate my pizza), we were presented with a cold, sauce less piece of pizza, wrapped in a smashed pizza box top, wrapped with tape.  We left without complaining but really upset about this experience.  Shame on Betos for such poor customer service and product!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "E8hq2X_tN_AZs4BPtTpmMQ"
  },
  "sUB9SPgaPwoUAVW3CaCw2g": {
    "date": "4/27/2017",
    "text": "My favorite pizza in Pittsburgh.    This is the kind of place people either love or hate because of the different way they serve the pizza.  I love the combination of the cooked dough and sauce with the fresh cold cheese.  If the cold cheese is not your thing, you can ask for the pizza \"baked\" which will make it just like a traditional pizza.  They also have great Italian hoagies, wings, curly fries, and mozzarella sticks.  Some good homemade ranch is the only thing this place is missing.  I worked here when I was younger and it was the funnest job I ever had.  From my experiences I can say they use all fresh ingredients for their pizza, and you can taste the difference.  The owners are great people and truly care about the business.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "87ZXnEPJDy75nBcE5X2fHg": {
    "date": "7/10/2019",
    "text": "You never know what Beto's you are going to get! The last two times the pizza was great but today it was horrible! There were a lot of folks there today at about 12:30 and the very long wait was understandable. No one was getting served which again was understandable. Our order came and the order was wrong so we just let it go. Now, the pizza was cold and there were a few dried tablespoons of sauce on the slices! We asked if we could get more sauce which was no problem. They poured more sauce on top the cheese and now the cheese melted into a ball. Absolutely terrible pizza! I read that the original Beto's sold to new owners and if that is the case it shows!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QmNAl2oOW2NyzTNBxgTKXQ"
  },
  "ym0XZwMeyVzz21a4HQbguw": {
    "date": "2/8/2018",
    "text": "Simply the best! It's a weird concept if you've never had this kind of pizza. Cooked crust and sauce but the cheese and most toppings come cold. The first time I got a slice of the regular and one cooked, just in case I didn't like it. It's amazing! They put so much cheese and are generous with the toppings. I get cravings for this pizza. They also give sharing sizes of the appetizers. The only thing is, space inside is limited so if its busy, you may have trouble finding a seat or order might take up to 30 minutes but it's worth the wait. I would only eat the pizza inside the restaurant unless you are getting something else. It just doesn't taste the same if you take it home",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tgUZcFi8Al9gNdttgGPmiA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Cheese pizza slice. Had a sausage slice as well but not shown. Put a few pieces on this piece though",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tgUZcFi8Al9gNdttgGPmiA/o.jpg"
      }
    ],
    "user_id": "pLy8-MTpmY-xIKrfdSv1CA"
  },
  "YvkPcVzQ4mU4EIGE-q5qqA": {
    "date": "7/18/2018",
    "text": "Pizza with a twist! They heat the dough and sauce and thrown cold mozzarella cheese on top and it melts as you eat it! Cheap cuts and great wings, and desserts! Love this hometown place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rWZ43o97skQXb4Hk9V1pHw"
  },
  "lYKIx9R5nXQ-gEVVK8NdIQ": {
    "date": "1/9/2019",
    "text": "I made better pizza in a microwave in home ec class. All the south hills yinzers love it. The shit sucks.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7LwSrAsueQnkh75OndZ7bA"
  },
  "5OXShWcu90L9uMC5Vd5nqw": {
    "date": "3/5/2019",
    "text": "Not your typical pizza but one that either you love it or hate it.It's one that I go to for comfort because it has been my pizza shop since preteen years.It's familiar,it's what suits me.The hoagies are great too.At least a must try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ctCLYu7jKx4oCofnf7Tpeg"
  },
  "jKXiCMmfEMNECBkTYYwxIA": {
    "date": "9/21/2018",
    "text": "Shame.  I really like the pizza.   But this place employs the laziest help.  One Guy standing at register taking phone in orders while ringing the people up who were placing orders and ready to pay .  THREE guys standing by pizza oven doing NOTHING.   My take out order was right on the top of the oven.  I asked one of the guys doing nothing to get it for me.  He Points to the very busy guy standing at register on the phone taking orders and says \"he'll take care of you \".   I waited another 10 minutes while the busy guy at the register was getting no Help.   I was so pissed that I walked out while my take out order still sat on top of the oven.    I really like the pizza   But the lazy employees are too much.  WHERE WAS THE MANAGER?      Ps.   Go to SLICE on Broadway in Beechview.    There you will encounter pleasant helpful employees as well as terrific pizza.  Betos needs manage their lazy employees.   It's hurting the business and though I like their pizza, I'll live without it.  I like to feel that my patronage is appreciated by the business. Not happening at Betos.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "j72c8XdtMD5sA-t97OFZFg"
  },
  "P_SURavA2PETTZYFWfkDvA": {
    "date": "7/21/2018",
    "text": "This was my first time at Beto's and it was very good. I was thrown off my the cold cheese on top, but it ended up being really good. The garlic sauce is awesome and I got mushrooms and onions on top of mine. It's definitely an experience eating this slice of pizza, but I ended up liking it way more than I thought I would",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g4obzOuBmjQTShYScBxnFQ",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/g4obzOuBmjQTShYScBxnFQ/o.jpg"
      }
    ],
    "user_id": "imofk1BgcacEGUv2VLeWQQ"
  },
  "Dt7iqXDt8FnbGp3xaY1wZA": {
    "date": "10/5/2016",
    "text": "I did not think that I would like this place because the pizza does not look appetizing. Nothing would be further from the truth. This pizza is delicious!! It is served with a hot crunchy crust , pizza sauce and comes out of the kitchen smothered in cold cheese and whatever other topping that you ordered.   I gave them 4 stars because the poppers were plain and the fried mushrooms were still cold in the middle. The side salad was filled with fresh veggies and ice cold... I loved it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "suXHn7qr8LzUxvMVAR4TnA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/suXHn7qr8LzUxvMVAR4TnA/o.jpg"
      },
      {
        "img_id": "EjlEBtEF5f934FO9BamW8Q",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EjlEBtEF5f934FO9BamW8Q/o.jpg"
      },
      {
        "img_id": "rM1hh736jq04Kxu-qpPe5g",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rM1hh736jq04Kxu-qpPe5g/o.jpg"
      }
    ],
    "user_id": "YTu0c-1I9ECeksIgoHXFPA"
  },
  "mU7NB3RGH_S4AUiPKt-Ngw": {
    "date": "11/5/2018",
    "text": "Everyone loves the cold cheese pizza, but don't overlook the Italian Hoagie which I think is the BEST in the city.  The bun is filled with delicious salami, ham and yes, lots of melted cheese, lettuce, tomato and onion with dressing.  My order is always 1 piece of pizza and half of an Italian Hoagie.  You can't beat that! Delicious!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DX9L1YL-rd94-t-r-4Jaog"
  },
  "4g65NDUhKBF5yhw-h7AwPQ": {
    "date": "4/16/2019",
    "text": "Always go out of my way, to stop at Betos whwn I'm in this area! They never disappoint!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fcNckRiv5_57ZW03t3HYmw"
  },
  "nPe17Xo6SZqmeF5ZfGI02A": {
    "date": "1/30/2019",
    "text": "Thank you for remodeling the seating area! I can actually sit down and enjoy my meal without worrying if duck tape is sticking to my pants!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9Bck-KEoZOI_SucWyLgBw"
  },
  "U7j-wJPVOAQxbfiT5hgSXg": {
    "date": "4/9/2019",
    "text": "Been going here for 20 years! They just fixed up the interior again and it looks great. Pizza is fantastic. I like to ask for the cheese on the side so I can apply it myself and it stays nice and cold. Hoagies are solid and fries are a great deal (not fresh cut but always crisp). Prices are solid and it's an easy quick stop.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QCW9e0dehBOT0hfcjv266g"
  },
  "AEax5ll5hR3Ss5RGU57Dig": {
    "date": "5/2/2017",
    "text": "Love the concept ever since I was introduced to it. My first experience, I thought, ehh, its ok. But the days after it, I couldn't stop thinking about it. I've moved out of Pittsburgh now, but everytime I come back to visit family, this is a MUST hit-up spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "d9CjWPv9wFxR1KA2WkFs4Q",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/d9CjWPv9wFxR1KA2WkFs4Q/o.jpg"
      }
    ],
    "user_id": "ZzxfIQRL7AssuXzepfjsVA"
  },
  "BtMfA-RSgiqD_2wUWypQbw": {
    "date": "4/5/2018",
    "text": "Don't order the steak salad. It was the most pathetic salad that I have ever seen. I asked for it to have no onion and olives, and of course, they were on it. Very little steak. I grew up in the south hills and a couple of weeks ago was my first time at Beto's, and I'm 45. Apparently, I'll have to try the pizza, but I don't think that I have been missing anything by never having gone there!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mzQhuyHR3EdouyIYYJEluQ"
  },
  "-TimSPeFbII1Hn5LqonD7g": {
    "date": "3/28/2018",
    "text": "Beto's was great! I had heard about it on Insider Dessert and we were so intrigued by it. The cold toppings really make the pizza, and the sauce was excellent. Would definitely go back, it's really worth the trip!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HPmGQDLJBJ2H0NkRPcfVkQ",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Cold cheese on a hot pizza, sounds weird tastes GREAT!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HPmGQDLJBJ2H0NkRPcfVkQ/o.jpg"
      }
    ],
    "user_id": "9wexW3LcAPK-ZhXmkKgzOQ"
  },
  "uue5aknZB4yBOrMPKFJ_ng": {
    "date": "1/29/2018",
    "text": "Interesting concept to serve the pizza with cold cheese. It was actually pretty tasty the crust was very crispy and the sauce was delicious. I had two \"cuts\" and that was sufficient. It was fun trying something different, but I prefer my cheese melted.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vKb4J3KqOE2GFXxvEs7J_g"
  },
  "vVWFhmQarXHUzFNOJyOv8Q": {
    "date": "8/27/2018",
    "text": "Our first visit after reading the fanfare online.  We won't be back.  The place was filthy, it makes you wonder about the kitchen.    The pizza presentation is what everybody talks about.  It was different but not necessarily in a good way.  The toppings go on cold as the pie comes out of the oven.  Crust was average, sauce was average to below, cheese was excellent, the other topping were right out of a can and extremely dissapointing.  Overall the pizza was below average.  There are much better pizza opportunities in Pittsburgh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UFUiuItHCnpw3ReZtpof-A"
  },
  "g8EChO3MJdE6RgwEm7PaBA": {
    "date": "7/30/2018",
    "text": "This pizza joint is classic! Be ready for a unique take on Sicilian squire pizza. The fresh, shredded mozzarella cheese is added after the the dough and sauce it cooked. It's unlike any other pizza - and DELICIOUS! A must-try! Also, the hoagies are very tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HnLY_ZJvZ4PiZS0bZrPxAg"
  },
  "Zo9Xu3oSfbIcyyHA87KhVw": {
    "date": "6/3/2018",
    "text": "I heard that some people love this pizza but it's not for me. The floors were sticky inside and the pizza slices took forever. I'm not a fan of the cold toppings so I'll pass.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k60kPT4azn6KF2AZQnrAvg",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k60kPT4azn6KF2AZQnrAvg/o.jpg"
      }
    ],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "ftyBv-uCvWvQkbG7RBeETw": {
    "date": "12/15/2012",
    "text": "I'm a fan of their pizza and wanted to try one of their hoagies for the first time. I was disappointed since there was only two thin pieces of turkey for a $5.50 hoagie. Would have opted for the more fattening Italian hoagie had I know there would only be 1 oz of meat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PR4c68HskyJQCNvCxiB_cg"
  },
  "VFlFDVNvjtmpieOkU3DoeQ": {
    "date": "6/24/2010",
    "text": "Beto's is a love or hate place.  I love it.  Great crust, lots of topping, sauce with chunks of tomato.  If you want a \"classy place\" go somewhere else.  If you want high-end pizza then go somewhere else.  If you want good blue-collar pizza that is tasty and cheap this is the place.  By default the toppings (cheese included) are thrown on after the fact and come out raw.  That's OK with me but if you add the magic word \"baked\" as in \"I'll have three cuts pepperoni baked\" they will put the toppings on and put the pizza back in the oven until it melts.  It is still awesome.  the italian sub is also great.  Ask them to add pepperoni, it's worth it.  I've been going there since 1994 and am indebted to the guy that took me there for lunch. If you think it is a dive now, you should have seen it then.  definitely worth a stop if you are doing a pizza tour of Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m9tPYl77eABXl9YWTmJ4dg"
  },
  "_sNcfFBWvMOwOSUzZPDHNw": {
    "date": "10/17/2010",
    "text": "There are only so many ways to make the American bastardized version of a pizza, but for some reason there are as many \"pizza shops\" as there are stars in a clear night sky. As they may be stunning to behold, from afar each one is pretty much the same thing. This shop is another place that tosses sauce and cheese on bread and serves it to their patrons. Ok, so they DO have a slightly different take, throwing the cold shredded cheese onto the pie as soon as the dough is out of the oven. This does not melt the cheese, and I do see how the pizza would be cold after heaping on the cheese.  Some customers may like it, me, not so much. I tried the Italian hoagie.  It was a good size and the meat was flavorful. But that's about it. They put oil on the sandwich, but no other dressing. I expected a nice tangy flavor to compliment the meat but was disappointed. My date ordered a hot sausage hoagie. I didn't sample it, he liked it, but it was way too messy. The bread got soggy and the darn thing fell apart. It looked more like tomato soup with sausage than a sandwich.  The staff did seem pretty nice, even trying to keep a smile while dealing with the stress of a busy crowded restaurant. The dining room is also a bit cramped. There are plenty of booths, but the tables are rather close together and hard to maneuver between. Hungry patrons also are constantly getting up to visit the soda fountain. When they are busy, it is a claustrophobic nightmare.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7AGLlj5YzqdBfCPiZCa1mQ"
  },
  "hrfKwZ2uxwd3aTsJl_15yQ": {
    "date": "10/17/2009",
    "text": "Square Pizza is a great Pittsburgh area thing that alot of people just don't understand Beto's is new to me there is Tons of Cheese and Pepperoni and great Sauce very generous with toppings a little expensive but well worth it.  If you like this pizza try Osso's in Washington PA.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ccfYicnJienP1eZa86m-Vg"
  },
  "xmzUqTAoADaEI_Yq6-jz0w": {
    "date": "12/24/2007",
    "text": "They don't make pizza like this where I'm from. I don't even know if they make pizza like this anywhere else!  My fiance introduced me to the wonders of Beto's when I visited Pittsburgh to meet his family. But back to the food...The crust is not really thin, but it's nice and crisp. Then there is the sauce, which I did not really notice. But what really makes this place different is the the cheese. It's not melted! They put it on last minute before serving. Normally I would think this is nasty and frozen-pizza-ish but they use some high quality cheese at Beto's that practically melts in your mouth. If you ask for pepperoni, be prepared to have it sliced and raw on your pizza. I don't mind this at all since it's not as greasy this way and reminds me of snacking on pepperoni right out of the fridge. Also their hoagies are awesome. Next time I'm in Pittsburgh, I will definitely stop by Beto's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "dZjAjpEdIoFQMVakp7o1wA"
  },
  "1Ba_gp7TQL0--AralaZunw": {
    "date": "10/29/2009",
    "text": "I'm from California so I'm a BIG Fan of Soughdough Pizza, which of course I have never found it anywhere but here at home. My step dads from Pittsburgh and was always ranting and raving about this place so I was not surprised when the first place we had to stop from the airport was here. This was about 3 years ago, I was little scared of this place because it was very old and outdated and they were doing some type of construction, pretty much looked like the biggest hole in the wall I had ever seen! After ordering my cheese piece ( I forget what they call the slices) I forgot about the gross table I was sitting and and had to go order another \"piece.\" That trip I think we went at least 3 times ( my step dad prob 6, literally) We recently went back there this summer and they have completely remodeled and it looks great! Definintely a huge fan, even though it's not sourdough, and wish they'd open one here in Cali!! : )",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Fz9CDUmZMAto2Bugq0ziFQ"
  },
  "l4iF3e--YeAVl2OM1IZmxw": {
    "date": "4/1/2008",
    "text": "Beto's is a tradition in my family, but the two previous reviews say it best: people either love it or hate it.   The crust, sauce, and cheese illustrate unique qualities of Pittsburgh pizza.  Crust tends to be thin like New York pizza, but chewy rather than crunchy.  Pizzerias often use a blend of provolone and mozzarella or straight provolone, and if it's a pizzeria worth anything, the cheese will snap when melted (think of how stringy the cheese gets on cheap delivery pizza).  Pittsburgh pizza sauce will taste distinctly of red wine and not oregano (thank God).   Beto's parbakes the pizza and then finishes it for a few minutes before topping it with the cold cheese (by the way, they'll melt it if you tell them).   If you like provolone and want perfect Beto's, get six squares to go, and leave them in the box about 10 minutes.   Last time I flew into Pgh, my mom sent me to Beto's before I even got to her house.  They've been open for 61 years without offering delivery service, and only the best pizzerias can make that claim.  It's not for everyone, I suppose.  Beto's lovers, unite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nhotL_6tRbOKtAkGRDjH7Q"
  },
  "qrzobjiuhMs2-EDwpdx88A": {
    "date": "10/29/2008",
    "text": "It depends on your point of view, I grew up in the city and absolutely love it.  If your getting more than one slice and want a topping, just get it on one.  They over load the cheese and toppings, and its not all the way melted.  Always served hot.  Also the curly fries and hoagies are delicious.  Love it or hate it is what I've heard.  It's different, but my favorite and I make sure to go there every time I get home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FeCt1SSvEi_uThrbVleriA"
  },
  "rae-ob6c4JTB9gHGulxlVA": {
    "date": "8/16/2009",
    "text": "This pizza is as unique as it gets. Crispy crust with quality ingreients. Not very spicy. If you don't eat within the first 15 minutes, it's ruined. The baked hoagies are to die for. You will not find better anywhere. A little pricey but worth it. The place could be cleaner and it looks like employees are all kids. I still give it 5 stars though. As a sidenote, I know for a fact this place has been in business for more than 40 years. That says something.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JjDshKDY7yZxIt2JAr82BQ"
  },
  "wYh3zcpmO3vdrP9mvy8Wkg": {
    "date": "8/5/2019",
    "text": "This place is a unique experience that is a must when you come to Pittsburgh or happen to be tired of the same endless rendition of pizza. The salad is equally as amazing and the establishment gives you a very liberal helping of mozzarella on your pizza and salad. I would highly recommend going, and rate it as one of Pittsburgh's best.   My only criticism is the seating and lack of beverage choices. Most mom and pop locations provide Pepsi products which is a war crime if you ask me. 7.2/10 from me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CW3gwKp12oviDb7MzR-RSw"
  },
  "263YIZ6CF5oD3vP4ACnSrw": {
    "date": "8/6/2019",
    "text": "I am not happy with Beto's and their new pepperoni policy. If you are not going to give the \"regular\" amount of pepperoni then tell your customers before they pay extra for toppings.  This is the second time they did this, the first time I figured was a fluke but I see now this is how they do it so I will not be going there my normal 5X a week moving forward.  The food was delicious but I ordered pepperoni and this is the second time they didn't deliver.  Thanks Beto's I guess I'll try somewhere else......",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rXMCu01QHLfsR7cBI3oD4A",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Beto&amp;#39;s has been extremely cheap with pepperoni recently.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rXMCu01QHLfsR7cBI3oD4A/o.jpg"
      }
    ],
    "user_id": "R5P1nG4z0Q0OeVW3mhIKeA"
  },
  "w-xDKzYS2ZYu0Q323dla3A": {
    "date": "5/4/2019",
    "text": "The only thing that is keeping me from giving this place 1 or 2 stars is that the food is still good (when I'm lucky) other than that it has gone downhill. We called in for a to-go order and were told 20 minutes which quickly turned into almost an hour after forgetting our hoagie...this is the second time in a row this has happened and when brought up to the employee her excuse was \"sorry we have a new employee\".  Maybe instead of standing around and having conversations you should pay attention to your 15 disappointed customers who have been waiting much longer than their given time.   Overall, the food is still good but the service is horrible. A majority of the employees are nice but some are not.  I may try one more time but if nothing improves I will be taking my business elsewhere.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "x82XG6_yWaMvsRFvbONmag"
  },
  "_o3rJyZKJ3N9Qq_DPK2VzQ": {
    "date": "9/19/2019",
    "text": "Quirky but delicious, if you like cheese, tomatoes, and bread, Beto's is the pizza for you.  For those not otherwise in the know, I've recently learned that these square-cut, French-bread-like pizzas of my youth are now appellated \"Ohio Valley Pizza.\"  And, I've learned that Police Station Pizza in Ambridge, D&G's in Beaver Falls, and Beto's are far from the only places where this type of pizza is served.  In fact, it seems that it originated in Steubenville, OH after World War II!  Digressions aside, though, like an AVPN pie, after a while it's the innovations on the platform, the contributions back to it, that really keep it eternally young.  And Beto's is that innovator in the Ohio Valley space, if you are going to eat a slice of OVP (Yeah, you know me) then you might as well eat an interesting one.  The crust is brilliant, a nice thick tray-baked Sicilian in those classic gas deck ovens.  The sauce lays down on the bread, just the right amount, but Beto's leaves more tomato fillet for you;  you get a really satisfying, individualized tomato \"bite\" in at least a few bites of each slice.  And the cheese, well, that's what you came for, right?  I like to pick it off and snack on it before eating the slice, but I also spend too much and don't save enough for retirement, so don't take my advice.  Seriously though, You might love it or hate it, But having tried Beto's, you'll be a better version of yourself.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5gBSNLJrsfK3aK9BsRREHg"
  },
  "IbSbOA4O3mDIsJ-rGKPEMQ": {
    "date": "7/25/2019",
    "text": "I've been meaning to try Beto's pizza for a while now, so i think my expectations were higher than they should have been. The reason I'm giving them 3 stars is because the interior of the restaurant was pretty dirty, and while the pizza was good, it wasn't exceptional. I really liked the concept of having the raw mozzarella put on after the pizza came out of the oven, but there was WAY too much cheese to enjoy (and I eat a lot of cheese). They stuck a whole glob of shredded mozzarella that was just a little unnecessary. I felt wasteful taking half of it off ultimately to be thrown out. The sauce was good though and so was the crust. I'm happy I gave it a shot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c6QuFIpeAZgziUN7biCz8A"
  },
  "vmnbpBJSZIPKT6m1c-PguQ": {
    "date": "12/31/2018",
    "text": "I was very skeptical when I was told about Beto's. Raw cheese on pizza, what?!   But it was amazing! The cheese is fresh and I think I could eat bowl fulls of it by itself! But also.. the sauce!  Their pizza sauce falls among the top of any pizza I've had.   I'll definitely be craving this pizza until my next Pittsburgh trip. I highly recommend giving it a try! The place doesn't look like much from the outside, but there wasn't an empty table in the joint.. that's how good it is!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GqzEsKoo9n9S2ZkgjcX6FQ",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GqzEsKoo9n9S2ZkgjcX6FQ/o.jpg"
      }
    ],
    "user_id": "uLL_dxuUW2BPGGad6Fmplw"
  },
  "ev7VxUhVS9txvbz-BfRfvQ": {
    "date": "3/4/2019",
    "text": "We have been going to Beto's for years and it never ever disappoints.  The crust has a  perfect and satisfying slight crunch to it when you take a bite.  What makes this pizza different is they put cold cheese on after it's been baked so if you're getting it to go by the time you get home it's melted and delicious!  They are square cuts and so tasty - we never have a bad square here.  Their sauce is delicious and ingredients all taste fresh.  We will continue coming and devouring their squares!",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 20,
      "cool": 17
    },
    "photos": [
      {
        "img_id": "aFPJrwK2Cn85CotAkUZyaw",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Pepperoni and cheese squares",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aFPJrwK2Cn85CotAkUZyaw/o.jpg"
      }
    ],
    "user_id": "hjk--8VuDX3479_atPJQ1g"
  },
  "y85wYpGVLaOzaGsaXKzTGg": {
    "date": "11/2/2018",
    "text": "i'm an east coaster who grew up on new york style thin crust and love chicago deep dish so most pittsburgh pizza i've had was not cutting it. I'd heard of Beto's but finally made a trip across the tunnel - and now i know, I just hadn't yet had THE pittsburgh pizza.  i was skeptical. it's off the side of the main road but not well lit, it was nearly midnight on a rainy friday, they serve you on styrofoam plates and the seats are beat up. and seriously, cold cheese just sounds weird. but it's AMAZING. the crust is crispy and chewy all at once, the sauce is flavorful, and the cheese melts as you dig in, falling off the top but it just gives you more to cram in your mouth after. it was a late night snack, so i had one and a half cuts which was perfect.  this place is cheap, tasty, and fast. the staff is kind without being overbearing, they get you your food and keep the place running. it's quiet enough for good conversation with friends. I'll be back for sure - crazy as the pizza seems, there's a reason it's been here forever.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GWUi3nVyfPHd08BMZLsF8w",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. cut of pepperoni!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GWUi3nVyfPHd08BMZLsF8w/o.jpg"
      },
      {
        "img_id": "v9ZavgqFGnseJl5kIjplhA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. cut of cheese!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v9ZavgqFGnseJl5kIjplhA/o.jpg"
      }
    ],
    "user_id": "lRMJ0oztyFvoXQVWqjodYw"
  },
  "bUCqZ2Df_fYq61pQJZNHNw": {
    "date": "8/18/2019",
    "text": "Not your typical pizza but great nonetheless.  The shell and sauce are cooked then the cheese and toppings are added cold.  Lots and lots of cheese it is worth a try it's like eating a cheese stick with toppings and some crust their other foods especially the salads are great as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DQcYFFlDzs7MtS2ZLep_Aw"
  },
  "ZQ95jpkYKQy1kY6wAysdCQ": {
    "date": "7/1/2019",
    "text": "I was a little skeptical about trying to pizza spit my Husband has been on several occasions he loves it so today I decided to go with and I must say hands down one of my new favorite spot it was so tasty cheese fresh if you are in the Pittsburgh area try it it's a must!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g7LrbPfdQoIdSPwQUikO0g",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/g7LrbPfdQoIdSPwQUikO0g/o.jpg"
      }
    ],
    "user_id": "UG-5DN3ugalcU-89C7hnYQ"
  },
  "f9VcZOLEyxGycvVEb96aog": {
    "date": "12/21/2018",
    "text": "I've never heard of cold cheese on pizza, so I was very curious about Beto's when I learned about it. Basically, they cook the crust/sauce then the cheese and other toppings are tossed on top. It kind of reminded of a pizza lunchable. It's definitely not the best pizza in the city, but it's unique so I'll give them that. I love cheese (especially cold) but I think taste wise, Beto's is pretty average. I think it's a fun concept and will come back, if I'm with someone who has never been. The food can take awhile, which I found surprising, considering they don't cook half the stuff that goes on the pizza. It also gets pretty busy because it's beloved spot. If you've never been and are curious, it's worth checking out!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c3zrD0APvmh_0Hs2wF0hHw",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Pepperoni and banana peppers + pepperoni and mushrooms",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c3zrD0APvmh_0Hs2wF0hHw/o.jpg"
      }
    ],
    "user_id": "uKNH69DumrRvm8Ugq6yX3g"
  },
  "vNkEkVFF0kNOybDiW2baPA": {
    "date": "3/15/2018",
    "text": "I'm pretty impressed! We had this for lunch on a Sunday and it was pretty satisfying.   The cold cheese on the pizza was intriguing and I honestly thought that it wouldn't be worth the hype. However, I was pretty happy with it. I think their pizza would suffer if the cheese wasn't cold but I guess that's the point.   The fries were eh - what can you expect from a pizza place though? It's not their specialty. I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Qqza1AhKYOkWq5KZNJ_fAg",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Qqza1AhKYOkWq5KZNJ_fAg/o.jpg"
      },
      {
        "img_id": "m5aj9vxuyPEmxHfBhArX7g",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/m5aj9vxuyPEmxHfBhArX7g/o.jpg"
      },
      {
        "img_id": "GmbnapmIoNPgfxm9Z4CFkA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GmbnapmIoNPgfxm9Z4CFkA/o.jpg"
      }
    ],
    "user_id": "dTMhVGbU-BGpnCDmikhgfA"
  },
  "9crLdyKCwh0l2wc-6U0kwA": {
    "date": "6/23/2018",
    "text": "This place is so polarizing! Some people think it's the way pizza should be served. Other people think it's serving the ingredients for pizza. I think I'm the latter.   I would be more on board if the crust and sauce had enough heat to melt the cheese a little bit, or push the pepperoni even to room temperature. But it was just like a slab of ellios with shredded cheese and cold pepperoni on it. I like eating pizza cheese right out of the bag. And I even eat pepperonis off frozen pizza before I eat it. But I don't need to leave the house to do those things.   The layout of the restaurant is also not intuitive. You order at the counter but there isn't really space for a line to form. And then you take your number to a table, if there's a table to be had. If not, just hover until one opens up. And then deal with people hovering around you waiting for you to finish eating because they want your table.   Also, pepsi products. Bummer.   I have leftovers in my fridge right now and I kind of don't even know how to properly prepare them?  Glad I checked it out - but won't be back. Not getting my repeat business will not hurt them AT ALL. The place is busy busy busy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "exRlK6etVbbxGPwn8SKTrQ",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. I like everything in this picture.  But I don&amp;#39;t need to go to a restaurant to get it.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/exRlK6etVbbxGPwn8SKTrQ/o.jpg"
      }
    ],
    "user_id": "9oKIvFRyb_gPkhhRmob6zA"
  },
  "Qv40ulMbXhH21VSh38ynGQ": {
    "date": "6/26/2018",
    "text": "Loved it!. I really liked the hot crust/sauce with the uncooked toppings. Similar to the popular DiCarlo's pizza in Weirton/Wheeling. Not quite as good as DiCarlo's, but still very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nVN20tunCTGzxSXrhD9K6Q"
  },
  "lQzoY3l-dIRRZW66lboyHg": {
    "date": "6/4/2019",
    "text": "Terrible simply terrible. If we need to get Dave Portnoy here so that he has the worst score for his pizza reviews ever.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lGUxB5XjqVrBovemgQzB0Q"
  },
  "SgZXQAumkCL209V3Hu9P-A": {
    "date": "5/27/2018",
    "text": "A very good pizza joint on Banksville road, just a couple miles from the 376 Parkway, near the Fort Pitt tunnel. Slices come in squares, good crunchy crust, almost Chicago style. Goid traditional sauce, chunks of tomatoes, a little on the sweet side, which i like. The cheese and toppings are put on last, after the oven. So it comes with fresh grated cheese on top, not melted. I got pepperoni and sausage for my toppings. Overall, good pizza, my first time there. I will go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yWSBt_jMS85XE8PWo5i8bA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Sausage and Pepperoni",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yWSBt_jMS85XE8PWo5i8bA/o.jpg"
      },
      {
        "img_id": "epebIWLhOElk49NGId5x5g",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/epebIWLhOElk49NGId5x5g/o.jpg"
      }
    ],
    "user_id": "rOW7GDjnOkz1lbIWzFlsOQ"
  },
  "QQXZx-zIHfYSU0j0DzEVcQ": {
    "date": "5/27/2019",
    "text": "Wow! Cheese is my favorite food so i think that's why i like this place so much. Slices are huge. I never tried anything else from here, but i dined in once and got a few boxes to go another time. I expected the dining area to be a little bigger for how crowded it gets here. But i would definitely recommend stopping if you're in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AWLE00TDHBstjDc9OINbxA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Believe it or not, there&amp;#39;s pizza under there.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AWLE00TDHBstjDc9OINbxA/o.jpg"
      }
    ],
    "user_id": "q5id8l-8neWf78rbe0qbeA"
  },
  "SQ-TlGVWfCpp7fbMj6QODw": {
    "date": "5/19/2019",
    "text": "Used to love going here once a week to get a tray for the kids. Last 3 times were the last for me. Hardly any cheese on it, told the lady the 2nd time, and she said it was the person that cooked and this time should be better. sadly it was the same. wife came in a couple weeks later, and again. i saw sauce with very little cheese. $40 plus for just dough and sauce is not worth it. i hope they get back to the old way, or old owners way of having it. because it really declined",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vp8qv4v8PT4DmH282nKYhw"
  },
  "2TfmgHd5t04GYTyoFh-IQw": {
    "date": "10/23/2018",
    "text": "Guys, this pizza is so different, but so good!  When I first tried Beto's I was a little weirded out by it and not quite sure how I felt about it, but after trying it again I actually really like it!  Beto's cooks the crust and the sauce, but all other ingredients are placed on the pizza uncooked.  The heat from the crust allows the cheese to melt just a little bit, which is perfect.  The crust is super crispy and the sauce is very tomatoey, but good.  I will say that I have found, that while I normally love pepperoni or sausage pizza, with the cold toppings on Beto's pizza I don't care for these toppings.  Instead I opt for just cheese and black olives, which I highly recommend.  Beto's pizzas come by the slice and 2 slices fills me up!  Each piece is $1.60 a cut plus 55 cents for extras, so it's super affordable!  I have also tried Beto's wings and salad which are both good too!  The salad is mostly mozzarella cheese, so how can you not love it?  Beto's is also open til 12:30 AM every night so if you just need a late night snack it's perfect.  For people that are wary, keep and open mind, I think that you will grow to love this pizza just like me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g6JEq93vsbaHSggzJsgDWA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. The piece with olives is the regular cold toppings, the plain cheese I asked to have melted. I actually liked the cold toppings better!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g6JEq93vsbaHSggzJsgDWA/o.jpg"
      },
      {
        "img_id": "TbhUgVs9qNGv09uT0sTRcA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Wings!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TbhUgVs9qNGv09uT0sTRcA/o.jpg"
      },
      {
        "img_id": "IDJ77_a6gVVulM0qUdnanA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. There&amp;#39;s a salad somewhere under the mozzarella",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IDJ77_a6gVVulM0qUdnanA/o.jpg"
      }
    ],
    "user_id": "p7VESlDGmZpTP1Yck52Seg"
  },
  "dnG-Kr_b4LoHX5Y52V5YCQ": {
    "date": "8/5/2018",
    "text": "Beto's has been around for decades, and amongst Pittsburghers, the pizza appears to be one that you either love or hate.  The highlight of Beto's pizza is that the toppings - from cheese to pepperoni to sausage or whatever else your heart desires - are not cooked onto the crust. The dough is baked to a crispy goodness, topped with some excellent sauce, and the generous portions of toppings are added after it comes out of the oven. It is unique to be sure, and one that this reviewer loves, though others may not prefer it that way. But the good news is that if you wait an additional 15 minutes, the toppings can be baked on.   It should also be noted that Beto's sells square cuts. As of August 2018, they are $1.60 a slice and $0.55 per topping per cut. You can buy trays, but Beto's does not sell whole pies. Among their other goodies are salads, mozzarella sticks, and jalapeno poppers to name a few. They do have a website with their full menu.  Until several years ago, Beto's had a small eat-in area that had about five booths. They remodeled and added additional seating, restrooms, and a bit more space for your elbows. The new seating has already taking a beating - likely from the shoes of many kids that have graced the surface of the material - but the interior is pleasant and is about what you'd expect from a casual pizza joint.    After placing your order, you are given a number and you can sit where you choose. Of course, you can also carry out.  We ate in, and all of our food was brought out within ten minutes. This wasn't a bad wait time, but it can be longer at peak times. Plan accordingly. The employees who brought out our food were friendly and someone walked around and was asking the customers about their meals. That's something I hadn't witnessed before, but it was most welcome in this era of customer-centric dining.  Beto's serves great food in a pleasant environment for an affordable price. The pizza isn't for everyone, but it's worth a first-time visit if you've never been here. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lWNLQSPFUam08NZTDW1PMA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lWNLQSPFUam08NZTDW1PMA/o.jpg"
      }
    ],
    "user_id": "avX2imic0PJ90NTo5D_Mqw"
  },
  "pLMkPhNYQ_UtP3tWEQytqA": {
    "date": "8/23/2011",
    "text": "I guess for what it is, a thick crust with a canned tomatoes and uncooked mid/low grade cheese, it was fine. It's just not my style of pizza. They do have some of the hottest wings I have every eaten, the very aptly named \"after burners\". The sauce is very tasty with an INTENSE slow burn.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "DOajn8AtMjNtCZ87YoIlwA"
  },
  "UnWXHnDiI0HyDGL6UjdZ0Q": {
    "date": "4/14/2015",
    "text": "Subs are out of this world!  Huge in flavor and size!  Definitely worth the stop.  Fast service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VsCYkHJ44MytxSxYZY5cYA"
  },
  "vTK3RNaZdA_deG2aHtgb4Q": {
    "date": "8/15/2009",
    "text": "Being from Chicago, I'm a pizza snob.  Yeah, I know, it's like comparing apples to oranges, but still...this is my review for Beto's.  Anywhoo--this was a unique experience...the pizza comes out of the oven with just sauce, then mozzerella is piled on for a semi-melt addition.  Who would have thought of this!?   The pizza itself was good, and the sauce decent, but the whole semi-melt, I'll have to get used to.  :-)  I'd be back for a second shot at it!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "XKAFikZAfddYv0Vg1PUkwA"
  },
  "8R-9PwuC9zincaZWrTqGUA": {
    "date": "1/10/2010",
    "text": "From reading other reviews and dining guides, it looks like this is very much a hit or miss place. Either you love pizza with toppings thrown on after cooking, or you don't. I fall into the later category: I didn't like it at all.  I ordered a slice of cheese pizza and a grilled chicken salad. For the pizza, the crust was salvageable after I pushed aside a good quantity of cheese (most of it). The salad was...nothing short of horrific. Overloaded with fries and (big surprise) more cheese, getting to the lettuce and other toppings took some digging. Eventually, I found bland tomatoes and shredded iceberg lettuce hidden far below.  I don't get this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ftr4uAp04ak8yspmjT7GhQ"
  },
  "RCrlDjFhf6EhmQmlClRItA": {
    "date": "7/10/2010",
    "text": "I'm a N.Y. thin crust guy.  This pizza is the antithesis of N.Y. style pizza so I didn't really get it.  It's just not my taste but it may be yours so read on.  I went with a born & raised Pittsburghian who hasn't lived in the 'burgh for a decade.  He had fond memories of this place so late one night we set out for Beto's.  He was surprised to find that the place is now housed in a fairly new upgraded building giving off a somewhat upscale vibe.  Even though it was after midnight, they were still serving take out... so hooray for their late night hours.  We orders some \"cuts\" (Pittsburgh's way of saying \"slices\") to go and ate them in our car in the parking lot.  For the former Pittsburgher, the place may have changed, but the pizza tasted just as he remembered.  Tangy sauce, cuts in rectangular shape, crust was bready but had some crunch on its underside.  The unique thing about this pizza is they take it out of the oven and then add the cheese... and alot of it.... so its not altogether melted when you eat it.  My friend loved it.  To me it was unique but just okay.  I like a thinner crust, cheese melted and cooked all the way through, crust less bready.  You may like it.  However, You just may need to have eaten it as a kid to truly love it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ltSmOwuKNmUBK3VH-XOpBg"
  },
  "-vC-6zkYrisQnYc85J7jGQ": {
    "date": "4/1/2016",
    "text": "stopped by when visiting colleges in PA and loved the place. friendly staff, good prices and good size plates. hint: make sure you love cheese. will be back if in the area again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e3l1DpmhcNuwNIM8DEzAZw"
  },
  "k6xspgIEoWZiS-9-Ipn2Sw": {
    "date": "12/27/2008",
    "text": "Came back for the holidays, and stopped by Beto's.  The pizza hasn't changed a bit, and it remains in my top three in the town.    However, can someone please teach the kids working there how to keep up an establishment?  Not once did I see someone clean tables or remove the number tags from the table.  We had to clean our own table.  The floor was littered with straw wrappers and napkins, especially under our table.  The bathroom was in shambles and my friend mentioned that the ladies room was out of tp.    Therefore--three stars, with the pizza saving the review from total damnation.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KYJJUiUBnJHGxPm2zElqfA"
  },
  "bvNO5HRpTsNh4yTBZF_XMw": {
    "date": "10/6/2013",
    "text": "I knew the original owner of Beto's and she would be furious for what is being done to it, now.  If the pizza slice gets any smaller, you'll have to call it a breadstick.  There was almost NO meat, on my Italian hoagie, which used to be the best around.  Whoever recently took over, should be ASHAMED.  Betos now STINKS.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qXLWeNPNcEplWj4meCckdA"
  },
  "MO_aSOpoQG3J_hxeAP2OCg": {
    "date": "2/11/2009",
    "text": "Any pittsburgher knows the top 3 pizza joints: Beto's, Fiori's, and Vesuvio's. Beto's is my favourite.   I was never a fan of square pizza until I was introduced to this place. I love how they put the cheese on very last & isn't melted when they serve it to you. if you want extra cheese they give you a whole bag of shredded cheese. and it's cheap!! .99 a slice!  I can't wait until I'm back in the 'burgh to take my fiance there so he can see what real pizza is like.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wxrComr6CCKGJbPtGsvTDg"
  },
  "RENB0MI21Xf9jF-PS0i6kA": {
    "date": "12/6/2009",
    "text": "Some of my favorite pizza on the planet. If you haven't had it remember, it is unique, don't walk in expecting 'factory' pizza. It is square cut and the cheese is put on after the crust and sauce are cooked. MONEY!  If you are taking it out get the cheese on the side, we even get 'extra cheese' a lot of the time.  Toppings: most toppings on the pizza are put on after it is cooked also. I usually go straight cheese ( not a fan of cold pep or mushrooms)   The sause is old school nothing fancy but darn good, nice chunks of tomatos in the sauce.    If your in town worth the experience, if you live near by...lucky you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7MI0oX7_fTwjU5NML80jsw"
  },
  "dDg35e_UXP1KWhFAZV6DGQ": {
    "date": "2/15/2014",
    "text": "Didn't live up to my expectations at all.  Waste of time and money.  Sloooooow service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MEZircit9fcbOQ2S_85jKQ"
  },
  "Pvv_FaUakjf2imEGv5IjIA": {
    "date": "1/3/2011",
    "text": "This was just bad pizza.  For the money I expect that the toppings will be cooked on the pizza.  The cheese and pepparoni were added after the crust came out.  Also the mushrooms were out of a can.  Do not waste money here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "6AxPBtxJYcm81uYes2q09A"
  },
  "hMyOXZSCEAOlnKK3uUDZkw": {
    "date": "11/29/2011",
    "text": "You have to be goofy to not like this pizza. Their sauce is tangy and delicious, probably the best I ever had, and The crust is perfectly crunchy not doughy and chewy which I cant stand. Truly unique and worth a try. I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "su2CyB0HkROxMYxURGvLxw"
  },
  "Oe9DEhNneiTUrUjo0TOIpw": {
    "date": "12/27/2010",
    "text": "This is my Man's favorite pizza place.  When he has visited Pittsburgh in the past without me, he sends me picture messages of his slices.  On the plane ride coming into Pittsburgh last week, all he could talk about was Beto's.  So, when we landed we of course drove right over (after being awake all night on a red eye flight) so that I could taste all that is awesome in Beto's pizza slices.  It was very good.  We ordered the simple extra cheese pizza.  For those of you who are like me (from Oregon where I guess NO pizza is good), this pizza was hot crust, sauce, and minimal melted cheese, with fresh cold mozzarella piled HIGH on top.  I have never had a slice of pizza put in front of me with so much cold cheese piled on it before.  I wasn't exactly sure how to eat it, but figured it out, and it was very good, different but good.  I would take Beto's pizza over Oregon pizza any day.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wPOUpLnf2yx4wlGxFYN_ng"
  },
  "JvH2WTbxx6-zFEhtLeudpQ": {
    "date": "4/22/2014",
    "text": "This is absolutely my favorite pizza of all time. I've been going to Beto's since I was a kid, and it's as good as it ever was. I can see why some people may not like it, because it is so different than your typical neighborhood pizza, but for me, it can't be beat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nzxGuaQixh9CYxk4BjRC7A"
  },
  "t3jS_JDZk0tVpx_R0nZ3RA": {
    "date": "10/7/2010",
    "text": "Sorry, but our pizza was cold.  All nine cuts of it.  And the garlic wings didn't taste like garlic.  Maybe it was an off night?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "P-p4B5uXO4hW-nhu_yOirQ"
  },
  "NbaU8Y5ynFmOxWHkYmEX8Q": {
    "date": "11/14/2012",
    "text": "So you walk in and proceed to the counter.  You order the pizza with whatever toppings you so desire.  You get handed your drink cups and a number to put on your table and try and find a seat.  Maybe a 15 to 20 minute wait for your pizza.  Your pizza comes out and...... \"what the hell is this?  Take this back!  My cheese ain't melted and the pepperoni ain't cooked!\"  Chill my man.....take a few deep breaths....it'll be ok.....just TASTE it......there ya go.....holy cheese right?!  What a blend....It's all over the place and people actually order extra!  That sauce, nice.....sweet and chunky....yummy.  And the crust....the crispy, chewy wonderful foundation that holds it all together.   It's a bit different.  But different in the best way.  There's some great pizza out there.  Different styles and different tastes.  Do yourself a favor.  If you're in the Banksville Rd./ Dormont area stop in this place....it's just delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QytKqa6aczH34PmT0VkpJA"
  },
  "3CkGi85rz9nK0zsNjwP5rw": {
    "date": "4/29/2011",
    "text": "I love Beto's! Having said that, I acknowledge that their style of pizza is not for everybody. Do you love cheese? Do you love it so much that you want it so thick that it doesn't melt? I do! The sauce has chunks of tomato in it and the crust is thin and square cut. It tastes like no other pizza, but if you grew up eating it, nothing else is as good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cUKXCDWut80gT1y2Z-4wTQ"
  },
  "3_nbq00mTV-pqoa4r0qFsA": {
    "date": "4/23/2012",
    "text": "Uncooked canned toppings dumped onto overcooked crust, and then sold for the highest prices around. You've got to be kidding. This was easily the worst pizza I've ever eatin.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cD9m_uvrbXUE5qHs_b8kKQ"
  },
  "B3YkFV_528ncmndjoyOatg": {
    "date": "7/9/2012",
    "text": "So on our first night here in Pittsburgh it's getting late and we are hungry. Everythings closed at the point and it's only after 10 pm on a Sunday. We accidentally end up at Beto's and plan to get a medium pizza. They inform us the sell pizza by the slice and it come different from traditional pizza. The pizza crust is cooked with sauce. Once removed from over COLD cheese is put on top with cold topping of your choice. At this point I'm thinking about a sub! My wife decides to try the cold and they tell me they can make them hot if we wish so I get 3 hot ones...I decide I atleast need to bite hers to try this out. We are from Ct...and are accustomed to not only the best pizza in the world but it also being hot. I try my hot version of their pizza and it's just ok. Then I try the cold slice they are known for and it's pretty awesome. I finish my hot slice and we get 2 slices to go...the way they make them normally. I have to confess I should have gone with my first instinct which was just to try it the way they make it....after all it's kinda the point of going to new places...you should not only experience the culture but the food aswell! A must try if you passing through and have never had it like this before.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mlO1N5zXWw6fWYNoLYLqDQ"
  },
  "q-jCGkBQmLwz5_05Iui3gQ": {
    "date": "12/3/2015",
    "text": "Hot, crispy squares of pizza with mounds of cold cheese on top.  Kind of weird when you first try it, but dammit, it does grow in you.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kneey6lq_XsBoM6yN7IeHg"
  },
  "eVRbjQ0WCD8Rct0r-ydXSg": {
    "date": "10/2/2014",
    "text": "I really enjoy Beto's Pizza because it's truly unlike any other pizza you've had! The dough is hot and the toppings are placed on cold! Be careful, the car ride home really can make the toppings all melt together, which makes the pizza still very good, but not as good as the unique tasting cold toppings that you go to Beto's for! The pizza can get pricey with additional pricing for many of the toppings, but it is totally worth it! The ingredients are so fresh and the pizza is so yummy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "13URNpJQPWwXehKYaEvLkA"
  },
  "5zZHBK_0ASpdznG7yNlpnQ": {
    "date": "7/3/2011",
    "text": "Beto's Pizza is a \"must have\" when I'm in Pittsburgh. This place is full of nostalgia for me because we used to get it when we visited my Gram and Pap. It's definitely one of those love it or hate it places.   You order the pizza by the slice. I've only ever had cheese, extra cheese and pepperoni. My favorite to order is just plain cheese. They bake the crust and put on the sauce (with these big, sweet pieces of tomato) and then slap the cheese on cold. If you get it to go, you close it up in the box and the cheese is the perfect bit of melted by the time you get home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xy5mDm4GsVppEGXLmhOnlw",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xy5mDm4GsVppEGXLmhOnlw/o.jpg"
      }
    ],
    "user_id": "XOIr1qUKJbUL4ujMaleyRA"
  },
  "InKzzCoYHYjQ8rYSHf9gBQ": {
    "date": "7/18/2015",
    "text": "I don't know why everyone is complaining about the cheese not being melted. THAT'S THE POINT! Delicious, cheap, and fast. Easily one of my favorite spots in Pittsburgh. My only complaint is that the dining area is very dirty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FvxYptCO2VzMWJWZjB_TwA"
  },
  "0hoNMe14tus4ujB9iRvMaQ": {
    "date": "8/28/2015",
    "text": "My Uncle Chuck turned me on to Beto's 40 years ago and it's every bit as good as when I was a pup.  This is one of the most unique pizza joints I've ever eaten at. If you love mozzarella cheese, this is the place for you. If you're not a fan, don't bother.   People often use the phrase \"food porn\" these days, and as you can see in the photos (money shots) that customers have shared in their Yelp page, the description is accurate.   The food is cheap (and cheesy) as can be. Swing by for lunch, dinner or a late night stuffing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xFypgR3Cf9krJiJdXm_DBw"
  },
  "6e6kfD28FyKJfszgo14Xrw": {
    "date": "5/3/2012",
    "text": "Ok , I have lived here in Pittsburgh most of my life , And I LOVE Pizza.  Beto's is a Pittsburgh Icon but defiantly nowhere near the top pizzeria.  But you have to have your Beto's \"FIX\" once in a while.  I usually get 4 cut's with Pepperoni , and you  get your money's worth.   Plenty of Pepperoni & Cheese. If you do not like the un-melted cheese , wait a little , it will melt.  As for you pretentious types , Pizza is NOT a health food. If you need a Salad , maybe go back to California and eat your wheat grass.  I Like Beto's and I will recommend it to folks , Just not every week !",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "67IMqiMGTTlobnDMEWszmw"
  },
  "EKp8ja_qWV6hwyxfaNMxiQ": {
    "date": "8/2/2012",
    "text": "My first half cooked Pizza!  So I have heard about Beto's for quite some time now. From my main man, and Dormont's own Anthony Pecora (now), to my other main man, Nick Rockwell, who used to play at Dormont park and eat the pizza as a kid.  My first imprecision, \"Damn, they didn't cook my pie!\" I have heard a lot about this pizza but know one has ever said anything about a \"Raw\": slice of pizza! But to no avail, it was an illusion. It seems as if they cook there pizza and then top it with the toppings....? Strange..? Well, yes it is strange to this jedi, but Beto's knows what they are doing!   The crust is in word, umm, ahhh, AWESOME! Nice and crunhcy, light and flaky, and also has the moistness of a biscuit.......if that makes any sense. Sauce is also good, nothing crazy, just good ole pizza sauce. The sauce reminds me of Kiddyland Pizza at Kennywood, or it has the feel of Della Sala's Pizza (Verona).   I went with my favorite pizza combination, Mushroom & Onion. I was excited because they use canned mushrooms and loaded them on. Call me weird, but i love canned mushroom on my pizza. Another delight, the onion was sliced into rings. Onions HAVE to be sliced into rings for pie....plain an simple. Diced? One pissed of jedi! Like I said before, raw toppings, so it was a shock to bite into raw cheese and onion. The raw onion went well with the whole Beto's thing they have going on. I was pleased.  I will be back to Beto's and it is a great change of pace. I do not know if it is blaspheme to order the pie \"double cooked\", but I would like to try that. It would definitely be a knife & fork pie.    * JEDI APPROVED *",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hMry-aR2iJMC6OdLosr31w"
  },
  "FmFZbxoJrRY7GQ_P8m_mUg": {
    "date": "6/26/2015",
    "text": "I visited Betos 6/25/15. I ordered 4 cuts with mushrooms. The young lady who took my order was very polite. My pizza was promptly brought to my table and it tasted outstanding. Betos has always been my favorite pizza in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y1XDv5AFffY0hGri2zncWg"
  },
  "n9Y3PLaq62FEKmUDuBA4sA": {
    "date": "4/1/2012",
    "text": "Wow, just wow. That was without a doubt the worst \"pizza\" I've ever had in my life. Maybe you would like it. Do you like all of your toppings out of a can? I didn't even know you could get canned green bell peppers. Do you like your slices of pizza to be covered with a huge several inch thick mound of uncooked mozzarella cheese? If answer is yes, then maybe this place is for you. It is definitely not for me.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "g7njeAIFI1QT9b2uoYgsAA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. Pizza?",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g7njeAIFI1QT9b2uoYgsAA/o.jpg"
      }
    ],
    "user_id": "2ZZNOoMQ7WFvFoxDUFw1wg"
  },
  "SPUhpD_ZRR1J-47Nhu4Eig": {
    "date": "1/20/2015",
    "text": "I always love it here!  Huge tip: if you get an order to go, ask for the toppings separate so they are still raw!  Its absolutely awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6RHfgRlvHNvWpv9F3t8Ycw"
  },
  "AJM3A2c22XhpZLx9WydU5w": {
    "date": "8/17/2015",
    "text": "First went here in 1967. Two slices with free extra cheese and pepperoni for 15 cents. Even when it was free, few ordered the extra cheese. I mean, why bother given the normal amount. The price has certainly gone up, but I still stop by every time I am in town. Two slices with pepperoni and half Italian hoagie, does not get much better. If only they could expand the parking lot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dpOLOs0qHS0tMlE5dd1oOg"
  },
  "nTdIezBiCFQwANScIbCX4A": {
    "date": "11/27/2014",
    "text": "Addicted to this place. What a unique burst of flavors when you bite into a slice of Beto's pizza. Cold cheese, hot sauce and crunchy crust truly speak to my mouth's palate. I always find an excuse to stop her. Last time we had a steak hoagie too. It was big and full of flavor as well. It's no wonder they have been around for a long time. LOVE. LOVE. LOVE BETO'S. ~ Dionne Malush, Pittsburgh Realtor",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H4sowuhvnTan0d2ZeVrOkw"
  },
  "VOCFcz6VTkDJozLQSqr5PQ": {
    "date": "12/18/2014",
    "text": "Definitely a must have but different..only place I've ever been that only bakes the dough n sauce then puts on toppings including a mound of cheese once it's out of the oven..the sauce is great w chunks of tomatoes....you can also bring home the pizza n bake a few minutes to melt the cheese n toppings  which makes it a 5star pie....The Italian hoagie is really good also..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uTBeZCW6nSsuPgqScbf-0Q"
  },
  "fCve7iWPlHZeqywIyI0bZw": {
    "date": "12/10/2014",
    "text": "On a busy Sunday night, my family and I walked in, put in an order, walked over to a table, and the food was at the table within 5 minutes.  The quick service deserves 3 starts.  The staff consists of all teenagers, at least from what I saw.  They were all super friendly though, so no issues there.  The food though was amazing.  I had 2 super picky kids in my group and they loved it as well.  Two pieces are enough to fill you up, if not too much.  Like another reviewer mentioned, the pizza does come with a lot of cheese so I wouldn't recommend extra cheese.  I highly recommend this place if you are in the mood for pizza with a twist and I can't wait to come back to Pittsburgh specifically for this place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_JV_Eklv8BqYVXFYF_m_bw"
  },
  "1yKgD5xk7xnQsw5E5xU3hg": {
    "date": "4/7/2015",
    "text": "My friend brought me here for the first time over the weekend and honestly, I was extremely skeptical when I saw the pizza. She said it was a \"must try\" if you're in Pittsburgh, so I figured I'd give it a shot. Wow. It was unlike any pizza I've ever had. It should be its own genre of pizza. I had a slice with extra cheese, and it was wonderfully messy. The cheese isn't melted, so it was falling all over the place. But seriously, it is actually incredible. I also had some of her Italian hoagie which was delicious! If you're looking for a unique pizza experience, definitely try Beto's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "csN3loYzNd2YDq-hj2AiuQ"
  },
  "xiFKdJH5RkotCD1teGwR4A": {
    "date": "12/19/2014",
    "text": "Love the food... Service could be better, waited almost an hour for two cuts of cheese pizza, but it was great",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xezuq8Nb6JoG95pm2R3otg"
  },
  "dAeTU4zzHdi_0wkZ_Bgy6A": {
    "date": "5/27/2013",
    "text": "The pizza was fine. My issue is that, if you aren't like other pizza places with your pricing, you should maybe tell me that when I call to order a medium with two toppings. We ended up with a $36 pizza that will take us days to eat, when I THOUGHT I ordered a medium with pepperoni and sausage on half. All young kids working there. No professionalism. No explaination of anything. 50 cents per slice for every topping? Well yeah we got 14 slices, so do the math. NOT a medium. Boxed up horribly, so on our 3 minute ride home, the box was leaking grease out of the corner. I was so upset over spending nearly $40 on something that I thought would be cheap and easy, I couldn't even enjoy the pizza. Its just whatever pizza anyway.   Save your money and go to Slice on Broadway. 1/3 of the price,  staff is wonderful,  and they have a liquor license and fair prices. Slice should get half the publicity this place gets.   Never mind that I've lived in Pittsburgh all my life and have never heard of Betos until I moved 3 streets behind it. NOT a \"Pittsburgh institution.\"",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wCL1RkdI3CMh3refumBzqg"
  },
  "UN1rI9aIXjVw89BCeVyy0g": {
    "date": "7/20/2016",
    "text": "One of a kind pizza in pgh, YES the cheese & toppings ARE put on cold, but get it to go & you'll find out just how good it is when all that cheese turns warm & starts melting!!!! Love it both ways mysef, eat in or take out",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xojC8MiBSbIJA3OYwNVNMA"
  },
  "8snIRGC4jMDR_BsYcV7lsA": {
    "date": "4/27/2016",
    "text": "I love this pizza! I never would have expected to like pizza with cold cheese on top but it is so darn tasty! My husband is not a fan of the cold cheese and has ordered the hot sausage hoagie and wings. Both were very good. There is also a little sitting area to eat your food there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yR2Ck_FztBOWA66oV16OEw"
  },
  "6M4TgBqKy6FXASHk90yZ6w": {
    "date": "10/10/2013",
    "text": "Worse than store freezer pizza. What with the cold cheese on top of hot pizza? Terrible. If you want quality; Fiori's is a few miles away.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "1W3_JUSkH5tsrIWdIXoK-w"
  },
  "qeycIkrugVQQ9mYk3rqo7w": {
    "date": "11/28/2015",
    "text": "Gotta say this place is HUGELY overrated.  Girls working there were just plain rude and in need of a serious attitude adjustment. You work at a pizza restaurant, you're gonna be busy on a Saturday night, get over it or find another job. I did it myself when I worked at a pizza shop years ago. The pizza itself is ok at best.  There's absolutely no organization in the dining area, pretty much a free for all for a table. Even if they had 1 person to clean tables and seat people, would make it much better to eat in. And to me, it seems like there were more than enough people to accomplish that during the busiest hours. A few  minor changes would have me coming back, and I'm guessing many others. Or they just don't care because they're gonna b busy either way.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZT2b4Jg_8qTbp32CSbPwQw"
  },
  "CGr5nccOWM5BgUE0NHvBQQ": {
    "date": "5/4/2014",
    "text": "As a lifelong devotee of Chicago deep dish pizza, I was a bit skeptical when my uncle took me here on a trip to Pittsburgh a few years ago. \"Cheese is supposed to be melted\", I thought.   Sure enough, the pizza was great. Enough to win me over, even. The crunchy crust combined with the warm sauce and cold cheese piled high was like nothing I've ever had before.   When I came into town again this past month, Beto's was my first stop. Do go here.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1JgaRBX0oiRsvEhHF3ZMjw"
  },
  "lJx5qMvZfosRjsX-8YJr3Q": {
    "date": "5/25/2016",
    "text": "Best pizza in Pittsburgh, it's not like most pizza. Something about cold cheese going on hot pizza that melts slightly makes it delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y0PpSMbSfQotWj9R_b1VMw"
  },
  "NoVvaRJiTIatJ8gbQQW7_A": {
    "date": "6/29/2014",
    "text": "This is a place where people either love it or hate it. Beto's offers thin, square cuts. They bake the tray of pizza with a handful or two of cheese. When it comes out they pile fresh cold cheese and toppings. If you eat it right away you get the unique flavors of warm crust, hot sauce, cold shredded cheese & cold toppings. It's a unique style & in my opinion ranks Beto's in the top 3 pizza spots in Pittsburgh.  In addition to their pizza, I think Beto's has the best Italian hoagies in Pittsburgh. I believe their cheese is what elevates their food. Absolutely amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xlSxGDgMKWjn_DlVYuFlGw"
  },
  "GIce0qDME1tlVep5jshDsA": {
    "date": "3/6/2015",
    "text": "A friend of mine had been begging me to try this place for quite a while.I have to admit, it just didn't sound good to me, but he claimed it was the best pizza on earth.  Finally, in desperation, he volunteered to pay for me if we went there for lunch. Free lunch? I'm in!  So, to sum up my Beto's experience:  1st trip: I had to admit that it was good, but it wasn't my favorite. I thought of it as something that was great when you were in the mood for it. 2nd trip: I was craving it, and instigated us going back. 3rd trip: I was hooked and referred to it as the greatest pizza on earth! 7th trip: had a family member visiting from out of town and made the 75 mile round trip from my house just to have pizza there. 9th trip +: Still loving it!  If you haven't tried it, you have to! And if you haven't tried it more than once, do it, and you'll be addicted too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mXkFwIKoNbCzMC4crdaVIQ"
  },
  "uYb_23_OBAr8uqvWmvpVXg": {
    "date": "4/4/2014",
    "text": "We only moved to Pittsburgh last year, so we are far from locals, but it only took one visit for us to become devotees of Beto's.  I understand the polarizing nature of a Beto's style pizza, but we definitely have established ourselves at the far THUMBS UP end of the spectrum.  By not cooking the pizza with the toppings, it preserves the fantastic crust, by not allowing the oil from melted cheese to make it soft and gooey.  Instead the crust remains fresh, firm and flavorful.  They sauce is deliciously fresh and tangy, with lots of nice chunks of tomato.  And the toppings, we get either just cheese or cheese/pepperoni and generous and delicious.  It may take a little getting used to, and you may have to wait because of its popularity, but Beto's is worth it.  As someone who has enjoyed NYC and Chicago style pizzas at their best, Beto's has redefined great pizza for my family and me.  Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZ_8cDDZMrpcja5Afb_BxA"
  },
  "DQc_y2rccvDwMR8d4sq5Ww": {
    "date": "8/20/2014",
    "text": "This has been one of my favorite Pizza places in the US. When i get into town it is my first stop. I love the crisp crust and the generous amount of toppings. The cheese is the best! Plan and simple is best in my book and in my belly!   Cheers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CDQBXNNIE6tLo5NNwCspKQ"
  },
  "ZHKA_op4BsMFdLMISBCdOA": {
    "date": "11/4/2013",
    "text": "First off, had my boyfriend not told me that every topping on the pizza was cold (including the cheese!), I would have never known. They should really have an illuminated sign that advises the customers.   I'm sure you have gathered that this pizza is kind of presented exactly like frozen pizza from the store except the bread is cooked. I think the appeal to this place is that it is different - Some people go to restaurants where you can cook your own food because it's different but the fact of the matter is that when I go out to eat, I don't expect to cook it myself and I don't expect it to come half cooked.   Had this pizza been cooked, I feel like it would be subpar. The crust was very crispy and the sauce was a standard tomato (no extra hints of basil or pepper). The peperoni reminded me of the peperoni that comes in Lunchables - actually the whole pizza reminded me of a Lunchable (except a pie made of 28 cuts is $35.28 with $.50 per topping a CUT!) To be fair, each cut is $1.30 and you only need 3-4 to really, really be full.  They really lay on the toppings - about an inch of cheese, 20 slices of peperoni and a handful of banana peppers for just two cuts with toppings .  I feel that you really need to be in the mood for Betos before you go there. When I am in the mood for pizza, I am heading for the flowing, stringy cheese and the flavors melting together before it hits my mouth. I would eat here again if I get the craving - some people in the restaurant had ordered other menu items that looked to be pretty good. I wouldn't take somewhere here as a Pittsburgh Destination though.  There is about 10 tables in the restaurant (booths/tables) ... clean/reputable.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KD11gaNNZEEweNNafL7jTw",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States. 3 Cuts - Cheese/Peperoni/Banana Peppers",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KD11gaNNZEEweNNafL7jTw/o.jpg"
      }
    ],
    "user_id": "4qO7lMezWhpwSHPLqCR4uA"
  },
  "rnDCHRrmPwQbg2sCi6qNYA": {
    "date": "5/22/2014",
    "text": "Thinking cold toppings is going to tast great sounds odd....... But, this is great pizza.  When you commit to doing something as odd as cold toppings you are going to strike out or hit a homer. Betos hit a Grandslam.  Please stop in. It's a dive but it's outrageously good!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3zbqo7TkjCOoGZnEx56wQg"
  },
  "1DXU9jcGx49qQaCVNoJ30A": {
    "date": "10/8/2015",
    "text": "If I could rate it zero stars I would. Their pizza is nothing more than a glorified \"Lunchable\". That was my son's description, and it was spot on. I can't understand how this place stays in business. I have eaten pizza in Italy, so I know good pizza, and this is not even pizza!!! It's a thick cracker like dough with canned sauce (tastes like that) and COLD cheese covering everything. JUST AWFUL!!!!!!!!!!!!!!!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qzNDrgdlKChifOLJOiKAwg"
  },
  "EAwdWfn38601d45hZUmhlw": {
    "date": "1/17/2015",
    "text": "Love this place!  Either you like it or you dont....theres no in between. The cheese is thrown on cold to a hot out-of-the-oven crust. Simplicity at its best. The dough and sauce are fresh made by hand daily (at least they were when I worked there). Ask for it baked if you want the cheese melted, but it can take 10 more minutes. You can also ask for \"No Sprinkles\". There is a lot of cheese per piece. All of the ingredients are thrown on cold. The green peppers and mushrooms are from a can. These are fresh cut: cheese, pepperoni, onions. Im sure I forgot some but theres a lot. No sausage.   The other foods are good. But dont waste your time. Just get the pizza.   They accept cash and credit cards.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FHvYn-5AO46mXSDR5haGng"
  },
  "w_8LIZmm3dpwIIRdkXBCIw": {
    "date": "7/3/2013",
    "text": "I echo that you will love or hate Beto's, depending on what you think of the cold cheese on the pizza. I recommend at least trying it. It's only $1.30 per slice, so what do you have to lose? I also love the curly fries with cheese. It is definitely an affordable and tasty meal.   I haven't seen any reviews about the annoying signs ALL OVER the cash register/ counter area.  There are signs telling you not to talk on your cell phone; not to eat in the dining room if you have a takeout order; not to refill  your drink with a courtesy cup; to be prepared to wait if you want your cheese cooked.  I don't like to be yelled at as a customer, and find it very off-putting.  The staff is just pretty surly in general. Otherwise, I'd give them another star.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dgFgbADDBISslOczGFllJA"
  },
  "qgoUoh77n6x7vo1oBNqvMw": {
    "date": "2/11/2013",
    "text": "I don't get it. Cold cheese and cold pepperoni on my pizza? Why does Pittsburgh have to be so weird? I just got accustomed to fries and coleslaw on my sandwiches but a guy has to draw the line somewhere. And what's with everyone bagging up their extra cheese and taking it home?   My gut tells me this would be an awesome pizza if only they'd cook it.",
    "rating": 2,
    "rated": {
      "funny": 8,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "iqhra1MRbjLWxrTkw4yqkA"
  },
  "-bnn-meL6MdjXdzcNhgBuQ": {
    "date": "4/4/2017",
    "text": "So hit or miss tonight big miss.  Ordered 3 cuts no corners a tray consists of 36 cuts so shouldn't be a problem.  I get home not only do I have a corner the cuts are tiny and crust is so thick it's not even cooked. The inconsistency is a problem.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ggqHZ3Woqjk1HYzfQ1j9fw"
  },
  "NtkUlG2sgsdM1pZk1V5_YA": {
    "date": "3/6/2017",
    "text": "Waited wayyy to long to dine in for some cuts of pizza. It took over 40 minutes. Never again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nckRlaTPa_i3uKe2De0lfA"
  },
  "1FbJGFKfScOmq6APkd0KJQ": {
    "date": "6/16/2015",
    "text": "Where else can one go to enjoy a meal that is just as good today as it was 5 years ago, as it was 25 or 30 years ago...that's Beto's Pizza. Two cuts with extra cheese and a half an Italian hoagie. That's my standing order. My family doesn't get it...but they don't cook the pizza with the extra cheese on it?!?! No they don't. That's what makes it unique, special and oh so delicious. Their loss!   Yesterday I had' eaten since lunch, a meeting had lasted until 9pm. Heated up leftovers at home or cut down from Greentree Road to Beto's for two it's with extra cheese and a half an Italian...hmmmm. It should be a snap, 9:30 on a Monday night. What was I thinking? The dining room was packed and four people in front of me in line. Took 15 minutes. I didn't complain. I took it to go. I had the first piece in the parking lot. The crust hard. The perfect \"plate\" for that great sauce, with pieces of tomatoes, delicious. And, if you eat a cut right away, you can just about get all that cheese and pizza in your mouth and you get to eat about 8 oz of cheese that surrounds the cut. I had the second piece when I got home. By then all the cheese had melted into the pizza creating a blanket of cheese. Heavenly. Which is better, a cut with melted or unmelted extra cheese? I don't know. I think I'll need another 40 years of sampling Beto's to know for sure. One thing I'm sure of already, their hoagie is the absolute best in Pittsburgh. 5++++++",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l1n_55QxX5p8XLeykbCJxA"
  },
  "VNfxNKE-bTRMymmlL6XH9g": {
    "date": "10/19/2013",
    "text": "I had not been to Betos in many many years.  Boy has the place grown up.  Still the same pizza that you will either love or hate.  The Pizza here has the chesse and topings put on after they cook it so it melts some while you eat it.  Tastes really good.    I also has the apetizer sampler which was a lot of food for two people.  Was not to crowded, but full Saturday at lunch.  Highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B7aR8VlLMGzaJ7NHC-jeMQ"
  },
  "YlugVFJrPJ7KypwzZXF1DQ": {
    "date": "3/21/2014",
    "text": "Odd.... I'd say it's not bad, but it's not good either. Super sloppy and there's far better pizza elsewhere. The dining room atmosphere is weird... It's like where Sugar Bear took June on their date to the cafeteria but without fluorescent lights. Plastic forks, plastic knives, and paper plates with crying kids and no beer.  I'll pass next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Gps4mGeuePM9JBf3FjWwLA",
        "caption": "Photo of Beto's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Gps4mGeuePM9JBf3FjWwLA/o.jpg"
      }
    ],
    "user_id": "CJlaL4UUeXlbc70z9qT0Dw"
  },
  "E1p39ELIHeCmVycvTidM-Q": {
    "date": "9/20/2015",
    "text": "Awesome pizza. Wish I had known about this place years ago! But glad I heard about it and tried it out. One of my absolute favorites now.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FL17sG6mYmFMnX2rWdgvEw"
  },
  "3CNcR4kBCtemro4pwKIv1A": {
    "date": "1/11/2016",
    "text": "If you want quick and delicious pizza by the slice that has the best cheese and a chunky sauce this is your place. They don't melt the cheese onto the pizza which I love so much! I usually eat all the cheese off first and then eat the crust and sauce. It is so good and so quick!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vsf8y-4ePuifJUVEmmnE4g"
  }
}