{
  "AJ4d4nSFiw2Z9Dzmj3mPSw": {
    "date": "1/22/2012",
    "text": "First rate food.Presentations were especially well done.My swordfish was very fresh with light tomato sauce accompanying. I only wish there were more restaurants like this one in my home town of Houston. Bring a bottle of wine and enjoy Cafe du Jour.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Em9f_4wjVPJMEk8KUxhn3A"
  },
  "QqQUrogRIC5LwA5M8ulyQg": {
    "date": "5/9/2012",
    "text": "By far my favorite spot in Pittsburgh. Great food. BYOB is a plus. Beautiful outside sitting area in the back where you will be seated unless it rains. Perfect for a date. Cash only!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SVlKC1f4VQeyvvHJb4-M1w"
  },
  "VM8OPOG1031lPoJQn5A_nQ": {
    "date": "12/23/2009",
    "text": "I'm convinced that I probably did not have the proper experience at Cafe du Jour the time I went.  But given my experience at the time, this restaurant only deserves 3 stars.   This restaurant is small, so make sure to call beforehand for reservations.  I went with a party of 6 people which seemed like a crowd for the size of the restaurant.  The restaurant looks cute and quaint from the outside.   We ordered the asiago spinach dip and the meatballs as appetizers. Both were very delicious.  I really enjoyed the fresh baked bread that compliments the dip, and the meatballs had an interesting asian kick to it.    For my entree I ordered the pan-seared scallops and I was kind of disappointed, because it was only okay and overpriced for its quantity. I don't know if I am appreciating it the right way or if French cuisine is supposed to be extremely heavy in flavor, but my scallops were definitely WAY too salty and the couscous in the middle was even worse. As proof: my friends who ordered the fish (I think it was the trout, but unfortunately I can't exactly remember) were complaining about how salty their dishes were. But then they tried my scallops and said that my dish was even worse!   Also, take note that if you sit inside the restaurant gets kind of smokey, and you leave smelling like the kitchen, which is a minus. The service seemed kind of slow that day as well.  I saw this man from the other table flailing his arms at the waiters for their attention. And I didn't like how they only took cash, it was inconvenient.  From reading all the other reviews I think I just might try it again sometime and maybe give it a better rating.  Perhaps I will go for lunch or sometime during the day, enjoy the patio and turtles in the back, and order the stuffed chicken pass on the scallops.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "psSJdH2V1fNlwfuAk4D7KQ"
  },
  "gtxmHhnUfDlGdGNThKzggQ": {
    "date": "10/16/2009",
    "text": "Twas on the south side to run errands at lunch yesterday and thought I would try this place out.  3.5 stars.  A nice reprieve amidst crappy Pittsburgh fall weather, I chose the small table by itself in the back facing the patio.  Service was friendly although again there was only one for the whole place and she was quite busy.  I had the sundried tomato mozz sandwich with genoa salami.  came with a lovely pasta salad on top of a crisp piece of romaine.  the sandwich itself was well assembled and tasty, but wasn't fully heated and the middle was lukewarm to cold.  given the texture of the sandwich this was a bit of a turnoff.  give me a cold or hot sandwich but not in between.  on second thought I should have just sent it back to be broiled longer but I was hungry and am fairly non-confrontational by nature.  anyhow, at $7 it was a good deal.  I will definitely be back and hope to be able to re-rate at 4 or 5 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ME1-IwMQMHkowOxffKUx7w"
  },
  "f7KnPfsI_7ec6blW0mGVuw": {
    "date": "8/14/2009",
    "text": "Excellent restaurant! I came here for dinner with a group of 10 and we were seated on the back patio.  I had the pork chop, which was tender, juicy, and delicious. We brought bottles of wine to share.   Great, small, quiet place on the South Side!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jZKFzkYs7VQShjOQ4JDHiA"
  },
  "8rJwP7FVZrkqjCBzZNLSLQ": {
    "date": "3/29/2012",
    "text": "Loved it!!! It is very easy to miss this small little place n E Carson St.  Highly recommend their chicken crepe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JsK6QCEk3il9P2O8PsMOHw"
  },
  "CqXH2fnjfJ0MqJU_Vux9DA": {
    "date": "12/18/2010",
    "text": "absolutely love this place.  the food is excellent, the patio has a great ambience, and it's byob!  for appetizers, i'd recommend the lamb crepes, spinach and asigo dip, and glazed meatballs.  for entrees, i've had the strip steak with gorgonzola and the pork chop with baked polenta.  both were cooked to perfection and soooo yummy.  i've heard great things about trout and eggplant entrees as well.    another bonus -- one time i was there, they brought out complimentary appetizers that they were thinking about adding to the menu (they change/add things to their menu every so often)...which were also amazing!!  definitely recommend reservations, as the place is small.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hx9kNcrl_z2R8adn2ssrHw"
  },
  "vAiGVOteZQrryZNwy9RxGQ": {
    "date": "12/8/2011",
    "text": "This place is great! I went here for a nice dinner with my girlfriend. Never having been I didn't know exactly what to expect, but the whole experience could not have been much better. They are cash only and BYOB which they kindly remind you of when you make the reservation.  On that note, you will definitely want a reservation, especially in the winter. The whole place can seat about 2 dozen people, and it has a small open kitchen not much bigger than a home kitchen, but with much better food! Every dish was a revelation and the service was great and friendly. A small compliment how great the food was also earned us a bonus dish courtesy of the chef :) . I nearly never write reviews, but this is my new favorite place in Pittsburgh, I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "13mGXNyc2kiDmsE89w_RCA"
  },
  "nvjh0dqXn81Cn5KaiBS-sA": {
    "date": "10/20/2013",
    "text": "What a great place. Went there for my daughter Jackie's birthday. Her boyfriend made the reservation weeks ago, and you definitely need one as it is small. You need to bring your own wine, but that's fun! We all 5 had a great meal and they even gave Jackie a piece of cake with a candle and the whole restaurant sang to her. It is a lovely place, very friendly with great service. I will go back for sure. We had a wonderful celebration with family, good service and great food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6kE5r6CyQj-CBP0AFvP3gQ"
  },
  "O12epPYNlNvam0kWCCZg_A": {
    "date": "4/28/2012",
    "text": "Cafe De Jour has some of the least pretentious, most home made French food (and waiters) I've ever encountered.  It managed to be hearty and full flavored while still very light.  The heavy creme and butter filled fare served at most snooty French Restaurants was no where to be found.  This was what your French grandmother might whip up for a special family dinner.  While the entrees are mostly in the 20-30 range, the salads and appetizers were just 5-10, so we got a ton to try everything.  Our total for dinner including 5 appetizers/soups/salads an incredible dessert, and complementary glasses of pinot noir was under $50..  The service was EXTREMELY friendly.  French Waiters are often guilty of either grovelling at your feet, or going the other way and treating you like you don't deserve to be there.  Our waiter was not seem snooty or fake.  He really took pride in the quality of their food, and made sure we had a great experience. Compared to the food, the decor is sparse, but there are interesting blown up newspaper articles of Pittsburgh's history on the wall including Sports victories and Frick sending in strike breakers.  I'm a style head, and I would have liked to see a little more attention to decor and atmosphere, but I'll pick a hole in the wall with great food over an elegant but mediocre place any day.  If you're looking for fancy french dining keep looking.  If you want light, gourmet french food, immaculately prepared in a casual but friendly environment (with casual but friendly prices to match) come to Cafe De Jour!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "MDeA-Gx8NScCyAdziq7IeA"
  },
  "CWoKMNUCWmFTpOJRHv54Og": {
    "date": "9/26/2013",
    "text": "Absolutely delicious food. In the summer you can sit on the terrace in the back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wuEi0xfiXlmy1wdPSIAyAA"
  },
  "96sDRck5sq6bd95RR6LtNw": {
    "date": "12/17/2010",
    "text": "I was pleasantly surprised! The food was excellent, service was good and the atmosphere was relaxing. The price was very reasonable as well. No negatives so far. I will definitely be back soon. I highly recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R0IHuYajFA7_P9rRw6mzjg"
  },
  "H-dkI0ZGl1YhhKgrutB-Hw": {
    "date": "2/10/2011",
    "text": "Best food in Pittsburgh. Hands down. Go there in the summer when you can sit in the courtyard.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jm_rOB-P3w1_EOhvE2yQtg"
  },
  "w-wG2eaCXEBD6CwJUuf94g": {
    "date": "6/21/2013",
    "text": "A friend recommended this place, it was great! Small but very enjoyable atmosphere. The small plates all sounded great. It was tempting to skip entrees and just get all the small plates!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lIZ4eKN8yAiorkGnJ8fVwQ"
  },
  "IvumTKFuH0rAUTmwRolhGQ": {
    "date": "3/16/2011",
    "text": "I love this place.  I cannot wait until summer weather so we can enjoy the back patio!  Great food and very friendly staff.  Always a pleasure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6T1diLeP7RGhia47zlGTCw"
  },
  "dM3gubv6OWiOhOX-LYUFcA": {
    "date": "6/21/2006",
    "text": "Cozy, hidden place. French flavor, but not pretentious in the least. Front part of the restaurant feels like you have stumbled into a small deli/cafe in southern France. In the back there is a small patio/garden with wrought iron seating, very atmospheric. Feels like you are hanging out in a friend's back yard... in France. Food can be amazing! Don't forget to bring your own wine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "s9m1lSJyedtZRJSuQBE5HA"
  },
  "1tSOe0CE_OSWsyO835IOjg": {
    "date": "1/7/2009",
    "text": "This place is the best for Saturday lunch and private dinners.  The food is so fresh and made with such love.  The kitchen is part of the dining room, so you can smell all of the delicious food cooking.  You can also bring your own wine, which makes it a bargain.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vuiEiVLs9cgpKwIU-HJ5TA"
  },
  "h1nsExf70TRWMfiiTwAuhQ": {
    "date": "2/16/2008",
    "text": "Cafe Du Jour is a delightful, unpretentious little deli restaurant seemingly set away from the craziness of East Carson Street. I went to lunch here with a few friends on a weekday, and it was totally empty. The menu is simple, mostly soups and sandwiches, but the herb-roasted pesto chicken sandwich I had was absolutely delicious (and only $6.50!) My friend gets the baked brie, apples and raspberry honey every time she comes here, and she graciously let me have some - it was quite tasty. I can't wait for the snow to melt, because the outdoor enclosed patio in the back looks sublime.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PhA1ulUsy1CkMzBIDjGKpQ"
  },
  "XxF7Cml3DDjTNPmSTFE8qA": {
    "date": "7/9/2009",
    "text": "Had what I wanted to be a quick lunch here today but because it was a full house and there was only one poor server taking care of about ten tables...it wasn't exactly speedy.   Oh well.  I could have stayed out there in the garden all day had it not been for my fair skin being burned by the gorgeous sun.  What a delightful patio...I even saw some turtles in the little decorative fountain!  So cute and quaint. I could tell just by one whiff upon entering the building that the food would be amazing and it was.  I had the spinach dip to start which was truly the best I've ever had.  I wish I could have eaten all of it!  But even the small order was a hearty portion.  I also had the sun-dried tomato &    mozzarella sandwich with genovese salami and it too was fabulous.  The only thing that could have made my meal any better was a glass of wine...but unfortunately I forgot it was BYOB.   Overall....incredible food, delightful atmosphere and super affordable.  I'll definitely be back for dinner with a bottle of wine!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KtPznbYZOm_6LlHf5PduZg"
  },
  "0ZheKO1vg2qDzNJnRubYXw": {
    "date": "7/7/2011",
    "text": "Last Wednesday night my husband and I had the pleasure to dine at Cafe du Jour to celebrate our 10 yr anniversary.  My husband and I both believe it was one of the best meals we have EVER had.  From start to finish, we were completely impressed with the food and the service. We brought our own bottle of pinot noir, which went well with so many of our choices even though we had not seen a menu or been to Cafe du Jour before. Every plate that was brought out was beautiful and tasted absolutely amazing.  We started with the mushroom consomme with shitake, oyster porcini and portobello mushrooms.  Next, we had the spinach and peccorini dip with grape tomatoes and basil. The baguette that came with it was perfectly crunchy and the perfect amount. My husband had the house salad and the sprouted lentils and roasted pumpkin seeds were an unusually crunchy treat. I had the romaine hearts with smoked salmon, arugula and lemon pepper dill dressing which was excellent and plated beautifully. I could only eat 2 of the three hearts on the plate because the server had also brought out 2 sample plates.  One was a crostini with bubbly brie and cool apple butter and the other was a salad of sour apple, fennel, cilantro, walnuts and a lime dressing of some sort.  Sooo great I tried to make it, and was not entirely successful, but I will try again. For our entrees my husband had the porcini-dusted NY strip with a gorgonzola compound butter, red skinned potatoes and sauteed broccoli with a romesco.  He said it was by far the best tasting steak he'd ever had and I agreed after the taste I had!  I had the pan seared scallops with a tomato basil emulsion and champagne wilted tomatoes served with a fantastic couscous pilaf. I love scallops, they are one of my favorite fish and these were the best I've had.  I did ask for fresh lemon, but I just like that extra lemon taste. We barely had room for dessert, but loved the ginger creme brule since it was just so creamy and soo unique.  To sum up our entire meal,  it was just amazing.  While I usually am very price conscious and like to get a good deal, every plate that we had could have easily cost $5 more and it still would have been worth it.  I would have expected our meal to cost way more than the $100 we paid.  We did leave an excellent tip in addition to that for our great night.  I would completely, positively, 100% recommend Cafe du Jour!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-pt7sxpNQtDNOMddv0tNRg"
  },
  "E_znxmFL0Oz2G3HAi05skA": {
    "date": "4/25/2012",
    "text": "In one word.... YUM!  A friend had suggested we all go to Cafe Du Jour for dinner this past week, and we said yes since we had never been there.  What a great experience this place ended up providing us!  AMAZING!   When you walk in, you have no idea about what you are going to experience in this quaint little spot.  It is very intimate, not too many tables, you are not sitting on top of one another either so you can actually communicate.  The service was great, Corkage was reasonable (if I recall it was just $2 or $3 per glass, and who doesn't love BYOB).    If you've never been here, I highly recommend it.  Reservations are suggested.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLVq7VSJBHZwqurwWoCmpg"
  },
  "Sn0Mn29T1yOGWS7NYPCbRA": {
    "date": "1/16/2016",
    "text": "The food is good, the place cute, a romantic setting for a date night and yes, have the spinach dip.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hnBzgVoRoqLrGVSxO0ilg"
  },
  "e6CERU26iFFf5tFWig629g": {
    "date": "10/22/2013",
    "text": "I stopped by here this past Friday night with my fiance and 2 other couples for a later dinner.  We had made reservations for 8 and whenever we walked in at 5 minutes past 8, the other two couples from our party were already seated.  The inside of this place is fairly small and I imagine that they could maybe fit 30 people inside if they tried really hard?  Whenever you first walk in there is an open kitchen on the left where they cook the food and then all of the seating is straight ahead.  Beyond that there is not much decoration that I noticed other than a couple of ledges full of empty wine bottles.  I found them to be interesting and I am sure that it plays into the fact that they are BYOB at $2 a stem.  Our group decided to start off the evening by ordering the pork crostini and a meatball like dish as appetizers to share for the table .  The waiter informed us that only 4 came with the pork crostinis and so he asked would we like an order a half which we readily agreed to.  Of the two I think that I enjoyed the crostinis more as the pork had some good flavor to it.  For dinner I ordered the porcini dusted new york strip steak cooked medium which came with a Gorgonzola compound butter on top of it and a quartered zuchinni on the side.  My steak ended up being pretty lean and was cooked perfectly which gave it some good flavor.  The real star of the show was the gorgonzola compound butter though as the blue cheese really came through in the taste and yet it was very easily spreadable.  My zucchini was just ok as it was a thick piece and the while the top and bottom seemed to be cooked through the very middle was quite a bit harder.  It was seasoned well though.   My fiance ended up ordering the salmon for her dinner entree and really enjoyed it.  The bottom line for me is that I would head back here again in the future.  While the restaurant itself seemed small and tight I ended up enjoying my food and the atmosphere here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "QsrC5pZf85888amG0ra_vA": {
    "date": "8/7/2015",
    "text": "The food is outstanding, I have to ask myself \"Am I in Pittsburgh?\" The food is as good as I've had on the island of St. Maarten / St. Martin which is the restaurant capital of the Caribbean. It is exceptionally good, affordable and I loved that it is a BYOB. Paul is an excellent Chef. Kudos to Paul. If you've not been, make a reservation and try it. Reservations are necessary. I look forward to returning again and again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Nf5nDUjTm1y0bYV3vPfRaQ"
  },
  "vI4M9OW9zKyWfq3Fpooi6Q": {
    "date": "3/14/2017",
    "text": "I can't believe we've never found this place before. Nice, small, byob, small plates, soups, salads, and a few entrees. Tomato bisque was excellent. Smoked salmon salad, great. And the bread pudding dessert took away any guilt.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XeOwD5NpSu0R02RoPogVSQ"
  },
  "uUqF9qGy4TJ5axwdM2UONw": {
    "date": "11/27/2015",
    "text": "Great food. Intimate environment. My only complaint is that they should expand. Too many overlook this gem because of the size.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jk0AcqPCVMfc_DTWO3SzwA"
  },
  "IZOOMiXkDEo4qzHqlrx_xA": {
    "date": "2/20/2016",
    "text": "I just had a wonderful dinner here last night with some old dear friends. I used to come here twice a year but have not been for a couple of years. I'm reminded that this is one of the best kept secrets in Pittsburgh. It's as close to getting a little bit of Europe's small proprietor owned/run bistros charm/flavor in Pittsburgh. Bring your favorite wine and enjoy a wonderful evening.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fipuJC-zlS2rvqdLPSnzSA",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fipuJC-zlS2rvqdLPSnzSA/o.jpg"
      },
      {
        "img_id": "F1KX91r3fXaTYIbKArfapg",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F1KX91r3fXaTYIbKArfapg/o.jpg"
      },
      {
        "img_id": "ic-he-gSaaOEtis7ZsMnxQ",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ic-he-gSaaOEtis7ZsMnxQ/o.jpg"
      }
    ],
    "user_id": "R5bL5uquRKRfWyLPmgWY0w"
  },
  "-ZCdmOLRLQK50GfbRv0sXw": {
    "date": "1/11/2013",
    "text": "This is definitely my go-to for best restaurant in Pittsburgh.  It is always super high quality ingredients and great specials.  We went in on New Year's Eve which was a great idea with their BYOB policy.  We brought beer, wine and champagne and settled in for a fantastic meal.   J&B started with the infamous spinach dip.  Served with a whole loaf of their bread, it oozed gooiness.  J&I started with the special - lamb crepes.  Unbelieveable.  This should become a staple of the menu.  We also split a bowl of crab soup.  Spicy and filled with crab - delicious!  J had the scallops as his main course and was blown away by both the quality of the scallops as well as the extremely fresh veggies.  I had the salmon which is one of my favorites.  It's one of the few meals where you will feel completely full afterwards, but also very healthy.  J had the eggplant parm which is not normal eggplant parm, but is a much healthier, yet delicious alternative.  B had the steak which I believe is the best thing on the menu.  An awesome piece of meat covered with blue cheese butter.  Heaven.    We ordered the chocolate flourless cake and the raspberry brown butter tort.  To say that these were good would be an understatement.  J&I ordered 3 desserts - 3.  We could have ordered more.  The raspberry tort was insane - buttery and sweet and mouth-watering.    Go!  Go now!   You won't be disappointed!  Oh, also cash only!  Be aware!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "2JjI8DCyrpabtg36iL5lrw"
  },
  "llzdnIBJHr43kWBQr4t2ZA": {
    "date": "1/15/2013",
    "text": "If you aren't looking for Cafe du Jour, you just might miss this hidden gem of a restaurant located on East Carson Street in Southside.  I'm always surprised by how many of my friends who frequent the Southside have never heard of this place.  In my opinion, Cafe du Jour is one of the most outstanding restaurants in Pittsburgh.  I've dined here several times throughout the past year, and the food is consistently fantastic.  Admittedly, I've always ordered the same thing...the roasted eggplant rolled with fresh mozzarella and topped with creamy pesto.  Always delicious, always prepared with fresh, high-quality ingredients.  The appetizer crepes are wonderful as well.    When I dined here for my birthday last year, I finished my meal with a piece of the flourless chocolate cake...it was beautifully presented and even came with a birthday candle!  Perfect ending to a wonderful meal.  I would recommend this restaurant for a romantic evening or special occasion dinner.  Keep in mind that the place is BYOB and cash only.  Reservations are also highly recommended, as the dining room is very small and intimate.  In the summertime, they have an outdoor patio/garden area that is very pleasant to dine in.  If you're looking to try somewhere new for dinner in the Southside, put this at the top of your list...you won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "7umN7cY8FaZ_HXqA4LKBuQ"
  },
  "LASuf1TljAH3Zitat5kyBg": {
    "date": "4/24/2015",
    "text": "For the April Dine & Dish dinner club, we went to Cafe Du Jour. Everything from start to finish was wonderful! We will definitely be back in the summer when we can enjoy the patio. The best part was the BYOB at 2 bucks a stem.     They accommodated our bottles of wines with ease. The atmosphere was so cozy and the service was welcoming and \"on it\". I would definitely recommend this place. No complaints!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9VBTIOO66O7G3f0aCcE_7A"
  },
  "APiAyKjkNJXSVnm4vkMSug": {
    "date": "3/22/2017",
    "text": "Amazing. Season, rotating menu, great service, great location. Cool BYOB with nice outdoor patio. Definitely make a reservation or call ahead as it only sits a few groups.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W6xW1BsKMCENklerKJBpxQ"
  },
  "yT4B5DPPmO0zqju41EVCxQ": {
    "date": "8/4/2015",
    "text": "Excellent! We went here for our second wedding anniversary and we loved it. It's small so you should make a reservation. There were only 3 people working there which included the chef. We sat outside and it was the perfect setting. The food was outstanding and BYOB made it even better!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VOcow13vQ-AZiz3CejY1Gg"
  },
  "VdG8aOD3Qus_QpWqrkBr9g": {
    "date": "7/1/2013",
    "text": "A small intimate restaurant in South Side. They have an open kitchen where you can see the chef cooking everything and a delightful patio where you can enjoy the summer. The roasted eggplant with fresh mozzarella and creamy pesto was delicious. All ingredients seem very fresh. BYOB and cash only. Recommended!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sUiTglfH7QEp6cMBaDhK4Q",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Roasted Eggplant. Salad with grilled chicken.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sUiTglfH7QEp6cMBaDhK4Q/o.jpg"
      }
    ],
    "user_id": "Q0HFvKrL_fiYSxQ6XvnKhg"
  },
  "pfl8oKTUt43jTLqtRRMXmA": {
    "date": "7/16/2015",
    "text": "We had a wonderful dinner here last night! The food was some of the best I've had in Pittsburgh. The seasonings, sauces, presentation, portions, everything was great. But my favorite was their back patio where we ate surrounded by gardens and beauty. It was a great atmosphere for us to catch up with, and impress, our in-laws.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JbqgKAPx15zb9lW7t30LOQ"
  },
  "_Bkchnrke5DaRE4fMs7OYw": {
    "date": "2/19/2013",
    "text": "I went here on a first date, I was not that excited about my date except for that he knew of this superb little spot.   Seating is limited but I love smaller spaces, they block out yacker types who cannot sit down in peace and enjoy sans cell phones.   If it is warm out the back patio is lovely, but inside looks nice as well. The whole menu looks fab from lunch to dinner but I had the pan seared pork chop with polenta and kale.  Make reservations!  Lovely just mouth watering perflect marriage of flavors, I ate the left over as soon as I got home lovely.   Its BYOB which is a plus :)   The server was attentive and paced things well, which was good because I had to keep the conversation going with my date.   I must miss France because a little taste of the food here brought it all flooding back.   Kudos to my date for agreeing with me that the third hunger games book stunk and knowing of this place. He was not my match but the food here made up for it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bwa7MWEM88FtiNLaXWCkww"
  },
  "UEZVs2dTqOvk37pL_8U_ew": {
    "date": "3/30/2013",
    "text": "Bam!  That's how excited I am to write this review.  I've had Cafe Du Jour bookmarked \"To Try\" for over a year, and I'm angry I haven't come sooner.  We had one of our best dinners in the 'burgh the past two years.    It was sold to me as a French Bistro - but it's really not.  None of the items are classic French comfort food, such as a coq au vin, duck confit, pate, or other type of items.  I think it falls in the New American cuisine.  Correction, it is delicious New American cuisine.  Soy-glazed meatballs ($10), pork, apple butter and brie crostini ($10), fennel rubbed pork chop with crispy kale($24), chicken breast stuffed with feta and spinach ($24), are some of the items that I can recall.  There isn't a website, and the menu you can find on allmenus seems to be a lunch menu, and outdated.  I wouldn't let that deter you at all - you just have to trust your fellow Yelpers who rave about this place.  I do disagree on the $$ designation.  Two people with 2 apps, 2 entrees, 1 desert, and a cork fee was $86 (and $100 adding tip).  Now, it is small, or at least while the patio is closed.  8 tables or so, and only 4 staff it seemed.  One host/waiter/runner, one chef, one sous chef, and an extra hand.  The pace between our courses was a bit longer than usual, but it didn't really bother me like it usually does.  The staff is working hard, and you can see it, and the food is so good I didn't really care.  And as mentioned elsewhere, BYOB with $2/stem.  This restaurant needs to be the next place you go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9DAJCpeKdzS6WuMvWOX4w"
  },
  "w9vZlpXZ7EjQx_y15_ebwA": {
    "date": "9/10/2012",
    "text": "My wife and I went here for an anniversary dinner, as we could not get in our first choice.  What a very pleasant surprise.  The pork dinner I had was absolutely amazing, the atmosphere outside was quaint, surprisingly quiet, and the service was brilliant.  The cost was exceptional as well and will become a frequent customer of this amazing establishment.  P.S. The pistachio desert we had was incredible.  I think if anyone watched us eat this thing they would have thought we had 30 seconds to live and this food would save us from impending disaster; it was that GOOD!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TGc2nbuvk8VjO3XK2JdQFg"
  },
  "ZEewt6hDvMeyxZ5bXKezjw": {
    "date": "9/12/2016",
    "text": "One of my favorite restaurants anywhere.  I've been coming here for the past four years while my daughter has been going to Pitt.   Everything is super fresh and I've never been disappointed.  Service always great and friendly.   Be sure to call early for reservations or you'll end up eating late.  BYO.  My only suggestion is that they invest in a better ventilation system because it can get smokey in there sometimes.  Other than that, I think Cafe Du Jour is a foodie's dream spot and my favorite Pittsburgh restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x18ljuTOGNdIjxgYP-PEyQ"
  },
  "XzPU-uGaUTQ0mfr3cEyjdw": {
    "date": "2/9/2014",
    "text": "I cannot wait until the weather warms up again so that I can sit in their outdoor patio. I love that they are BYOB. The spinach and pecorino dip with french baguette is to die for. Make sure to order the large as you will definitely want more! I had the scallops with mango habanero sauce and wild rice along with charred tomatoes. I could have eaten another plate of this -so good! I'm sure that I will be back before the weather warms up for the patio, it is just that good!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 6
    },
    "photos": [],
    "user_id": "D0_EDhZvO5z3UEPszmxiYg"
  },
  "9En7ErUObyAlRWYjBkwTSg": {
    "date": "4/11/2014",
    "text": "absolutely fantastic little spot. innovative, unpretentious.  ricotta crepe with raisins over a spiced vegetable ragout was a highlight. hope to return call ahead on a weeknight, sometimes they close early. d",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "oHmphRumxX4yXYJSEs75gg"
  },
  "utH9qHhV0d0Zm7BaJ3O-hw": {
    "date": "2/10/2017",
    "text": "This place is top 3 on my list so far.  I had the squash and eggplant and both were amazing. Great server great staff",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C4E_nKRJu28bsF98lvsUIw"
  },
  "2Btdkq-mUT9Jtgm3iygZGQ": {
    "date": "1/24/2013",
    "text": "My boyfriend and I made reservations here for dinner before heading over to watch the Pens. Let me tell you...the food was to die for!! A cute, little 6-table joint that looks like an old deli in a previous life. It has a small staff that provided great service with the chef within view cooking your food. Everything is VERY fresh.  We started out with the spinach dip which was served with steaming hot bread. The dip was the BEST we've ever had. Really. It was so creamy and smooth, and you could taste every single flavor. I would have licked the dish clean if it wouldn't have made a scene...  Then we shared this spicy Thai soup. The first spoonful was \"different\", but then you were hooked by the second. It was really delicious - a green curry broth with chunks of meat and fresh veggies. Full of flavor.  Then the chef sent out a plate of Brie on toasted bread covered in fresh, homemade apple butter. It was a perfect combination and exceptional. Wish we had a whole tray of it.  For the entrees, I had the scallops and couscous, which was really, really good. My only complaint was for the price, I only got three scallops. My boyfriend had the salmon. He loved it. I tried a bite and have to say I think I liked it more than the scallops (and that's not knocking the scallops either) . The sauce that topped the salmon added a really creamy, delicious flavor.  We didn't have time for dessert, unfortunately. :( They probably thought it was the first time we've tasted food by watching us. But each course was more yummy goodness than the previous. We definitely recommend to everyone!!  Tip:  We found out that BYOB extends to pop as well. They only serve water.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "II-hKLs3S23M6Kiew-pIIA",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. The salmon... Amazing. Had a really tasty cream sauce on top.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/II-hKLs3S23M6Kiew-pIIA/o.jpg"
      },
      {
        "img_id": "w6B6i_bMHVpiiE5te9Te3Q",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Scallops...very good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/w6B6i_bMHVpiiE5te9Te3Q/o.jpg"
      },
      {
        "img_id": "7EodgSEW2iC7DEnBXDblpw",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Brie with fresh apple butter on toasted bread. Devine!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7EodgSEW2iC7DEnBXDblpw/o.jpg"
      }
    ],
    "user_id": "yYKqlqVHOSUU_TjtcxLnvg"
  },
  "6s13wDBNnIAm8If-I4BJgA": {
    "date": "8/25/2016",
    "text": "Tonight was our first visit to Cafe Du Jour and it for sure won't be the last. We sat in the beautiful back patio with a bubbling pond and candlelight. The service was attentive but not annoyingly so. My fiance and I both enjoyed everything we ordered and were very satisfied with our bill as well. I highly recommend the chorizo stuffed bacon wrapped date appetizer. The dates are huge and a little sweet which goes so nicely with the chorizo and spicy tomato sauce. The chef here is a True artist!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s53lg6FLUHubh2WQAStz6w"
  },
  "7wXNDjdGb8UvORNIBzEGXA": {
    "date": "7/11/2016",
    "text": "One of the most, if not the most, romantic little place on Carson street! The garden takes you out of Pittsburgh and puts you in a quiet little cafe in another place. The food is excellent and there were plenty of vegetarian options. It was really refreshing to find a relaxing restaurant with great food and drinks on Carson. After our meal the chef didn't mind chatting with us which is something I appreciate it. A personal touch and shows that they do care. Even though the garden area is small it didn't feel like we were cramped. Lovely place, hope to come back soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qIossUhtsJ55_ciRTEqiPQ"
  },
  "drYx0TeAQHYM9XbF5didqQ": {
    "date": "2/4/2015",
    "text": "We visit this restaurant on Friday last week and we were pleasantly surprised!! Food was delicious very original and in few words worth the trip for us.  The home made bread was delicious and the spinach deep best thing I have ever had!!  The dessert was to really die for, we ordered one kind of bread pudding and loved it.  As you hear overall we were very well pleased. We hope they keep their success and grow!! Great chef!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PcAz9Zqm4HaGP8jnbHnDvg"
  },
  "OSB6HAyHaexDvZ99n0yc7A": {
    "date": "11/29/2012",
    "text": "Really loved the cozy kitchen feeling of the this place.  I've been meaning to get to Cafe Du Jour for over a year now and I'm so happy I finally made it.   The room was warm and  tiny, maybe 6- 8 tables total and smelled awesome.  We had an 8pm reservation and maybe that was kind of late for Wednesday because there was only one other table occupied.  It ended up feeling like we were having a special meal cooked and served by a private chef, especially since they let me mix and match with the very tiny menu and it was BYOB so we had our favorite cab.  We probably got a littte lucky on that front, but the meal was all talent and quality.    The baked brie served with apples and baguette was a classic, but perfectly done and exactly what we wanted for an app and really enhanced \"the eating in your favorite cook's kitchen\" feeling.    My scallops in a tomato basil emulsion with champagne sauce were so good, the flavors were so intense that I really didn't mind that they weren't as perfectly cooked as the polenta squares, which weren't typically served with that dish, but I thought sounded more fun than rice pilaf.    The rice pilaf turned out to be pretty great though because my Dad subbed out the couscous for that with his salmon and zucchini  which were perfectly cooked and scrumptious.   The flourless chocolate cake at the end was sinful and a perfect compliment to help us finish the wine.  They even put a little candle in it since it was my birthday.  I'll for sure be back, probably before it's even nice enough to sit on what looked to be a fantastic patio.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VdeFxh-CDp-h7kz4EHf69w",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Baked brie, scallops in tomato basil emulsion and salmon with rice pilaf and zucchini.  Tres impressif.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VdeFxh-CDp-h7kz4EHf69w/o.jpg"
      }
    ],
    "user_id": "lnJrAr7VQqwp5TqIqqqjmA"
  },
  "eVm_okFcuM6disZLuiBTPg": {
    "date": "7/20/2017",
    "text": "I really wanted to make sure that I left a review for this place because they really deserve a lot of positive attention. The food was superb and the service was excellent! The best part is the Brie and apple butter appetizer. I'm still craving it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "deHgmqaKc2HctB9uTJsvDA"
  },
  "flBbMH58X2Vd5WIOzHa81Q": {
    "date": "7/30/2015",
    "text": "It's Bring your own booze. And it fits perfectly with the atmosphere you will have.   I recommend going to this restaurant when is it a beautiful day and/or night. I would request the table right by the fountain. When you have your wine, and your significant other. It removes any nonsense from your life. The only thing that matters is the person in front of you. Or the people all around you at one table.  I enjoyed their small menu because it shows that they care about the quality of the food. And ladies and gentlemen, the food is da boomb!! I recommend the small plate of meatballs. It will change your life. The complimentary bread they serve is exceptional.   My one tiny grip is it's missing some nice piano music.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f7UwuxWQ_I7W314AJGIvSg"
  },
  "2LtBAETaTJ1ewhHhObizbg": {
    "date": "10/16/2014",
    "text": "I guess I am going to be one of those that does not agree with the review...or maybe I just caught them on an off day. Either way I was underwhelmed by the experience as was my other half that used to come to cafe Du Jour all the time when he was still living in Pittsburgh. When we got there we were the only ones there, and I still think    the only ones when we left. I ordered a tomato tart of sorts, and my other half ordered the steak they have on the menu. My tart was dry, and not that exciting. Other half had the steak which was a very good portion, but had no flavor what so ever. The blue cheese they did put on it was scant. Overall it just missed the mark. On the plus side it does seem like a nice relaxing spot. Nothing pretentious about, but again nothing to exciting either.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bI24msZS0Bqrvp1RUqW7hA"
  },
  "oI2YiSDvbOuw4jMJLOFixQ": {
    "date": "10/6/2017",
    "text": "Great atmosphere, excellent rotating menu. Outdoor seating is a plus. BYOB is a double plus. Perfect hidden gem for a date night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d1iEVdrwuibBg4x1OS5hYg"
  },
  "JGRHGwsSH1C_xjNKI2qftg": {
    "date": "4/13/2012",
    "text": "I rarely walk away from a restaurant and feel the sense of overwhelming satisfaction with the entire experience that Cafe Du Jour provided.  The service was excellent, and the food was absolutely amazing. It's such a small, unassuming place, but the flavors coming out of the tiny open kitchen are top-notch.   Combine the great, cozy atmosphere, beautiful patio (although it wasn't open when we were there), phenomenal food and service, and a chef that thanks you as you walk out the door past the open kitchen, and you're looking a perfect dining experience. I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "JiPMk9WmbJu-VfTRAKpZpw"
  },
  "PzVV5Igjfr23NUAI5bhFqA": {
    "date": "2/26/2014",
    "text": "There has never been a time, I think, when I was seated at the only table in an amazing restaurant on a Thursday night but that's what I did last Thursday and it. Was. Good.   The surprising part is that with that kind of volume, one might be inclined to think the quality of food might suffer, but no, everything we ordered was tasty and correctly textured.  The short ribs were insanely delicious and the simple roasted cauliflower that comes on the side was also super yummy. And super simple. I think there's the thing Cafe Du Jour does best: simple, slow, unpretentious food that is seasoned correctly and correctly seasonal. The apple chutney on the pork was spiced and wintery, the arugula was peppery and fresh, and we already discussed my cauliflower. I would be curious to come back in the summer and see what their menu is like then.   Also Ned said there was a patio out back which we didn't go to see but is apparently a thing in Pittsburgh and apparently adorable. Unsurprising.   OMIGOD I forgot to say that this place is a BYOB and I super LOVE BYOB restaurants. They all get a point just for that.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "MxC6vFBs6NGuN1j236413w"
  },
  "jkWTaUUqWGXBvkZYYoMVVQ": {
    "date": "6/9/2016",
    "text": "This place is such a rare gem. I've been blown away by Paul's food many times over the years! Matt is one of the best servers I've ever encountered as well. We've held both my birthday and bachelorette dinner at their restaurant and I couldn't be more pleased with the outcome! Thanks for always taking such great care of us! See you soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QR7xIvkcxKJqa_URw3NSVA"
  },
  "5Y9wwUfaU2IcSro8hh1cpw": {
    "date": "3/17/2017",
    "text": "Ones of the best places to dine in the City,  hands down! I have never heard a bad meal there.  I like going anytime of the year but my favorite is in the summer when we can sit outside.  It's romantic and cozy, BYOB and cash only so come prepared.  Plus the owner is super nice!!!  Love to support local business :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YpY1ZKQJos-wnzDhyaue4A"
  },
  "3VqyViNMd4DAww7s5OX-gg": {
    "date": "6/9/2016",
    "text": "I have heard great things about this place for years, and I finally had to opportunity to learn what the hype was about!  The back patio is so quaint and cute, and a great romantic spot.  We ordered several small plates, and the food was incredible!  The server was excellent- very professional, yet fun and friendly.  One of the great perks is that it is byob, so you can have a high quality meal for such a reasonable price, since you aren't overpaying for alcohol.  I cannot wait to return next time I am in town!  Heads up that is it cash only- but worth the trip to the ATM (which I have never said before!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-vnRyvWDfokLlm_b-79C8g"
  },
  "r4Y_PSEGWTDy6L8YAi4Brg": {
    "date": "8/6/2016",
    "text": "My husband and I love this place. Food is consistently delicious, service is very good as well, very nice ambiance, the tiny garden in the back is very pretty and relaxing. One thing to keep in mind: make reservations ahead.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XZFlH0CO2Txp2OVynS0Zag"
  },
  "ZHZY2hMq5JTpDehyqoMuww": {
    "date": "12/22/2013",
    "text": "Wasn't sure what to expect of Cafe Du Jour when some coworkers, my wife and I decided to get together for dinner there on a Saturday night.  Unsuspecting exterior (sans the deliciously good smells wafting from the open front door), very small space (less than 10 tables total), and a rather compact open kitchen all in the same room.  We had been meaning to try it for awhile on a count of the Yelp reviews, and overall, I can see where it gets the positive vibe.  All of our appetizers were great (mushroom and pork crostini, meatballs, etc.) and the BYOB made the environment enjoyable from the start.  Everyone at the table seemed to at least like their appetizers, although the pork chop my one coworker and I got was way overdone (rather tough and dry everywhere but the center).  Service was decent and the staff were definitely friendly.  Judging by they appetizers versus the entrees, I can definitely see this being a better lunch spot than a dinner joint (not necessarily a problem!).  I'd imagine their sandwiches are definitely good.  Overall, we enjoyed our experience.  Not exactly sure we'd seek it out again, but then again, we very rarely frequent one place more than once every year or two (we like our variety!).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "7aaA3Z0i7_XmjQWkamPlmQ"
  },
  "vlpEsOzRFsDYTpsxRNi31A": {
    "date": "3/23/2016",
    "text": "I loved this place - the food was excellent, the portions were good, and the service was also very good.  I do have to reiterate something that some one else said - the ventilation over the range/cooking area is very poor.  The kitchen is totally open to the small dining room, and I turned around at one point to see a cloud of smoke.  Nothing was burning - it was just slowly accumulating.  There is a very cute outdoor area, and I think that this would be a great place to eat outside in warmer temperatures - but I went in the winter.  When we got home, we reeked of the restaurant - but that is really the only disappointment to the whole dinner.  In a nutshell: BYOB, cash only, plan to eat outside.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ia2dQGFt3djNAw_QbCj9gg"
  },
  "kEhHVJ9n0vixAwVzzF0JTQ": {
    "date": "12/18/2015",
    "text": "I was very excited to try a new place out in Southside and if you blink you could miss it.  Very small and cozy instead and I recommend making a reservation.  We went with a larger party of 8 on a Thursday night and were only 1 of 2 tables the entire night. It was pretty nice to have the whole place almost to ourselves.  It is BYOB and they are up front about charging $2 per person which I think is very reasonable.  We started off with 2 orders of the spinach and artichoke dip served with warm bread which was delicious. The only issue was it did not come with enough bread and it took a very long time to get more bread after asking.  For my entree I went with the pork that came with a honey glaze and mustard.  It was served with a twice baked potatoes and salad with cucumbers, onion and blue cheese.  The dish looked beautiful and tasted just as good. Others in my party ordered the salmon and eggplant entrees which all got rave reviews.  If you order the chicken you get enough to serve an entire family!  The staff was very nice but it was a little slow service.  My only other complaint is the kitchen is in the main room as the seating area and it got so smoky instead while they were cooking.  Overall we had a nice meal and enjoyed numerous bottles of wine!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bu1mtWwxuayzV6b3VScWLw"
  },
  "e9y5CxlJPZQHm-seoD41xg": {
    "date": "10/7/2013",
    "text": "Great tiny place in Southside. Great food. BYOB. Delicious steak. Friend's pork thing was delicious as well. Other friend is a vegan. They made her a fantastic looking off-the-menu eggplant thing when she asked about vegan options.  Food is a five. Great atmosphere. A bit pricey though.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UZbPyHJPpxJwoS8790hPpw"
  },
  "bRZdw3wxRATQDJSylZOTAg": {
    "date": "7/24/2015",
    "text": "Our group of 6 had a fantastic, relaxing meal last night. Apps were all excellent. Seriously the best piece of chicken I've ever eaten -- juicy with Moroccan style rub under perfectly crispy skin. Great and friendly service. A watermelon salad with all sort of unexpected additions, including a spicy \"sauce/dressing,\" that just nailed it. That patio is an absolutely comforting place to eat. Knocked off a half star because my wife's NY Strip was a bit overdone, much closer to medium than the medium rare that she ordered. One of most underrated spots in the city. Go there, very soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3TA2RDi9QiBn0eqCYRdfzw"
  },
  "k-3RSMJn-QUHh_S5Pl_Ddg": {
    "date": "9/24/2009",
    "text": "I returned to Cafe Du Jour for dinner last night after a great lunch last Friday and even though it's hard to believe, it got even better.  We started with a spinach and asiago dip that came with piping hot bread.  The bread wasn't spectacular but it served its purpose of being a vessel of transferring the creamy cheesy dip to our mouths.  Words cannot describe the feeling of bliss I experienced after my first bite.  It's easily the best appetizer I've had in months.  I also tried their soup du jour, which was a hearty tomato base soup with vegetables and white beans topped with just a small kiss of cheese.  The cheese melted fantastically into the soup and each creamy spoonful of love filled my body with a feeling of fulfillment.  For entrees I ordered their pan-seared scallops which came with a couscous.  I've realized whenever I order an entree where scallops are the main player, they always come out underwhelming in quantity.  My dish came with four beautiful seared sea scallops and a small mound of couscous in the middle.  The scallops were delicious, but if I hadn't had an appetizer and soup beforehand, my stomach would have been left unsatisfied.  One incredible dish I will order next time is their Chevre stuffed roast chicken, which comes with a cauliflower puree.  The waiter recommended it and noted that the description of the dish on the menu doesn't do it justice.  Tips/Hints: 1. Sit in the backyard patio.  It is beautiful and quiet and definitely a good date spot. 2. It is BYOB, so take advantage of it. 3. Cash only!  So make sure you hit the ATM beforehand. 4. You can order off the lunch menu if you want their sandwiches for dinner. 5. Go in a smaller party.  I'd say no more than 4.  It's a small place and the kitchen isn't that big. 5. You can and should call ahead for reservations.  They'll know to expect you.  (I've never had to wait, but it's better to be safe right?) 6. You MUST order their Spinach and Asiago Dip.  Cheers!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 2
    },
    "photos": [],
    "user_id": "sWo7bAIUY_XBe33LKmNK9w"
  },
  "AVLOK7ozZbhc3ka9DO_-kA": {
    "date": "4/9/2010",
    "text": "It's a cute little place with great food! I wish I had gone one a sunny day so I could sit the in patio in the back.   Friends and I got the following: Wild Mushroom Consumme, Apricot-Dijon Glazed Roasted Pork Flatbread Sandwich, Roasted Turkey, Apple & Smoked Gouda Flatbread, and the House Salad. We cleaned off our plates.  For the Roasted Pork Sandwich, the flavors fit really well together and the ingredients tasted fresh.   I will definitely return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "s3safihVeRV_3YOvzDoy3g"
  },
  "9i74FonOAA_WPsZqEq-zHA": {
    "date": "3/3/2012",
    "text": "It is a nice cute place.  The feel of a small, family owned, traditional restaurant is certainly a plus.  However, the food was nothing very special (even though it was not bad as well).  A negative thing is that it took quiet some time to get our food after the order.  Bottom line, I would go back but not with my own initiative.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SfRlZcoYPw76lNsw7TEO7w"
  },
  "KSTpYeQQg1PSj4ibqeIaEA": {
    "date": "8/9/2012",
    "text": "There are not many options for dinner in the South Side, but if you want to eat a well prepared, fresh dinner this is your place. This is the perfect place to take your old-school-Pittsburgh-lifer-parents if you live in the South Side.  It's more French-lite, than real French; it won't scare anyone that rarely leaves Western Pennsylvania.  All the food was delicious and I had no complaints.  The place itself is small, but not confining.  I'm not sure if I would go back though, as I like my food a bit more adventurous. Then again, I could definitely see me bringing my mom here on her birthday.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xT5Rp0Jx6FrOfbVzixECvA"
  },
  "jg0SkHoiLvM9PZ5hePCZAg": {
    "date": "7/21/2010",
    "text": "In spirit, this place reminds me of many village bistros in France, having lived in Provence for two years.  The garden setting is a good example of this cafe's charm.    The cooking is original.  I loved the wild mushroom soup and my wife rated the pork sandwich as excellent.  Reasonable prices too.  Our bill was $36 for two starters, two luncheon entrees and iced tea.    Tip. No liquor license. So BYO.  This makes the place a truly excellent value.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xnFDA8Ps2mb2lKc65m5CHg"
  },
  "TmnZvL2EQ8QxS-f1Iz5n-Q": {
    "date": "5/2/2009",
    "text": "Classy and Classic without any arrogance.  Just eat here. Bring a good bottle of wine, and sit out on their amazing little quirky patio.  Love the owners and staff; good people doing honest business, they deserve your money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "SNKK5eiIjMYiPqU5BcAfJg"
  },
  "gUlIKFJunergUQwIaKnfJw": {
    "date": "9/17/2012",
    "text": "Overpriced hole-in-the-wall with an inventive menu. The menu changes which is nice but they do not accept cash and do not have a liquor license. I found the food to be hit or miss but it's nice to have an alternative place to go even if the prices do not justify it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zaNUeZZ-Xm21o3fZ0CUbXA"
  },
  "UkYxvnw8bvg2ClR9eC6w5g": {
    "date": "1/10/2013",
    "text": "We went here to celebrate my mother-in-law's birthday, who said she wanted to go to a French restaurant.  I think there are few French restaurants in Pittsburgh, so this is one of the closest things/places we could find.  Overall, we enjoyed our meals.  The atmosphere was fairly basic.   Service was good. They should take credit cards, for their own good, and their customers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BvJWAsUbuGAjAbEzqtJtYw"
  },
  "4VD_BZiEA8MYhZ1DMbQSDQ": {
    "date": "10/19/2014",
    "text": "Absolutely amazing, this place is a gem, perfect place for a date or a night out with friends. Byob, excellent service and phenomenal food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZIJo91JsUfXDWkroqcdYAA"
  },
  "00tvg4tIo6RSAhD94noHsA": {
    "date": "10/20/2011",
    "text": "I really enjoyed this restaurant.  The outdoor area is nicely planted, like eating in a garden.  The menu seems pricey at first glance, but the \"small\" plates have a decent sized portion if you're not a big eater (don't expect to have leftovers though!).  My friend and I had a cup of mushroom soup each, and shared two \"small\" plates -- the shrimp and the crepes.  The soup was delicious!  The shrimp was definitely the better of the small plates, but the crepes were not bad either.  Total was $30 for everything -- not a bad deal for quality food, and they seemed to be cool with us not ordering any regular entrees.  Remember to bring cash!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8heSpevri02f06W9VeNz0g"
  },
  "T-k72F2g1KiCzSDFk7R55g": {
    "date": "1/20/2015",
    "text": "I've lived in Pittsburgh for 34 years and this was the best meal I've ever had. We took family from out of town to dinner on a Tuesday night. Food wise, we started with the crostini with pork, brie and apple jam, which was toasted to perfection and was the most delicious combination of flavors. My MIL had the mushroom consomme, which combined 4 or 5 different mushrooms and \"was the best she ever had.\" She and my FIL shared the zucchini salad with beets, pickled green beans, with crispy pork in a light lemony pepper dressing. I ordered the pork tenderloin with crispy potatoes and an apple arugula side salad. It was, by far, the most perfectly cooked pork and by far the best meal tonight, and the best meal I've ever had. My SO ordered the short rib, with arugula and watercress side salad, and polenta square. My MIL ordered the olive oil salmon with chili aioli, side salad with mandarin oranges and kalamata olives, with a small scoop of red rice. FIL ordered the New York Strip steak with Gorgonzola, roasted potatoes and roasted zucchini.  Because the meals were so good, we had to inquire about dessert. They offered two: a flourless chocolate torte with white chocolate ganache and raspberry coulis, and a slice of warm pecan pie with cinnamon whipped cream and caramel drizzle. We ordered and shared both and as we found with dinner, both desserts were outstanding.  The service was excellent, the food was out of this world. I can't say enough good things about our experience -it truly is a diamond in the rough. Kudos to the chef!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_HWtxuD2dyDA0bXlIS-CVw"
  },
  "F0K32MjZEzueuNhljFgyCQ": {
    "date": "1/21/2011",
    "text": "I moved to Boston this fall and am missing Cafe Du Jour.  Cafe Du Jour was our favorite place in Pittsburgh.  Cozy, awesome food, good service and BYOB.  In the summer, the outdoor patio is wonderful.  It's not right on the street (like Majorca) and you will feel like you were transported to a European cafe garden.  Such a great feeling (especially on Carson Street.)  The food is amazing.  The jalepeno key lime cheese cake is a great way to finish any meal.  The steak is cooked perfectly and a reasonable portion.  I was also a fan of the mushroom soup (broth based with sliced mushrooms) and the watermelon soup.    About two years ago, I convinced my boss at UPMC South Side to take his management team to Cafe Du Jour for a holiday lunch.  CDJ opened just for us (there were about 15-20 people) and we had an awesome time.    Yes, it's cash only.  But who cares?  BYOB is a bonus...  I'll miss you Cafe Du Jour...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5elE9aOg6edaKyakD7zqLg"
  },
  "AAECAoG1KoCNW644AdPGJQ": {
    "date": "5/19/2011",
    "text": "Food is fresh, excellent atmosphere, sometimes hard to get a table and have strange hours but they don't get knocked for that because the food is incredible. outdoor patio is tranquil, even with the busy southside right out the other door. even something as simple as a sandwich there is made to perfection",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "kYhjtKfDTBuzu0bAAE39TA"
  },
  "IagoOKTxQNebOOG9eLKmAg": {
    "date": "5/8/2012",
    "text": "We came to visit family in Pittsburgh. I really wanted to go to the South side and try a place. I found Cafe Du Jour on Yelp. I was skeptical because i couldn't find a website. My husband is not a fan of french food and without being able to view a menu I was nervous. We were pleasantly surprised. The food wasn't the French type food I've had in the past. Everything was recognizable simple and elegant. I was atonished at what the chef could do with such a small kitchen.  I was surprised with the corkage fee. Where we are from theres tons of BYOB's and none charge corkage fees. That was the one negative but since it seems BYOB's are in short supply in this area I guess they can do as they want. It was minimal but it seemed petty to me.  I thought the decor was nice some reviews bashed the place a little for that. The patio seemed charming although it was too cold for us to sit there. Other than that the food was fantastic we would definatley go back. My husband was also very happy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wEndaNuesEJzlm6JkQKSzw"
  },
  "hmTYzV0h7LxsHukvSdSmkQ": {
    "date": "5/28/2011",
    "text": "The place is a gem-  I am sad they they no longer serve lunch.  Paul the owner chef grows some of the produce along with his sou chef Laura.  I have never had anything that I did not love- and ussually I put my meal in the hands of the chef. The cheese/spinach app and the puff pastry are both great.  I also love the seeds they add to the salads.  I keep wine there so I don't need to bring but it is BYOB.  The garden is very romantic-",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UetOIhAdPBkGjm_o-mSC3Q"
  },
  "OLzd1lzqhmbgv4thFTtQaQ": {
    "date": "11/20/2013",
    "text": "Simply put, this is my favorite restaurant in Pittsburgh. I have been many times and eaten most things on the menu. There are two things I love about this place: value and quality. It's not often that I eat out and say \"wow, that place was amazing, worth every penny.\" I am often satisfied, but never amazed. Here I am always amazed. I always get out of here for under 100 bucks for two, and it's the best food in Pittsburgh in my opinion, that's what makes this place amazing. It's BYOB, which I also love. I get the a better quality meal here than I get at Ruth's Chris spending $250 for two. Ultimately, it's not about the price that I rave, but the food quality. I had the salmon the first few times I ate here because it was the best salmon dish i had ever had. My girlfriend did the same with the eggplant, both of us afraid to change because, honestly, how could it get any better?! I eventually took the plunge and switched it up. Now every dish I order I believe to be my new favorite. The bottom line, everything here is awesome, and that's comforting when you want to go out and have a great meal. Close your eyes and point to anything on the menu and you are bound to be impressed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-W2RgRrC2TlSY958H3OdvA"
  },
  "1G8ax0dXwK0l5leWpVlfHw": {
    "date": "11/25/2008",
    "text": "K, so this is review #4 for Du Jour. And I must say, very impressed. It was a snowy windy nasty day (actually, nothing out of the ordinary for late November! :)    And Cafe Du Jour, from the moment I saw its welcoming, stenciled storefront, and was then greeted by smiley hosts, I knew this was going to be a respite from the rawness of impending winter.  Upon entry, however, I began to have my doubts--transfixed by the chalkboard of 'daily specials,' i was informed by one of the guys there that 'don't get yourself too attached to the specials board, because, that's like, last weeks' board, man.'--ha, in a strange way, i found this frankness strangely reassuring upon reconsideration.... ok, i digress...  now, the place has a great patio in the back, complete with heat lamps, wrought iron tables and chairs, enclosed in an intimate garden. yet, the ravages of winter were no match--it was closed (and who the hell would wanna eat out there in this weather anyway). clearly, it's a chill relaxing experience from april or may-sept-oct, i guess.  This intimate and friendly cafe has great service, very friendly and attentive. the food is above average, the wild mushroom consomme soup was pretty decent, though a bit too salty and thymy (if that's a word).  the baked brie/sliced apple with honey  and prosciutto with baguette was definitely more satisfying than the soup, as was the roasted tomato, goat cheese, basil, and red onion jam tart. rounded out with an excellent house side salad with feta, this was just the right formula for an excellent lunch.  even the coffee (an improvised pseudo-iced mocha) was well done.  too bad i live almost 2500 miles away, or this would be my monthly chill hang for a european siesta. and it's more than reasonable on price for what you get.  oh, and don't forget, it's BYOB so pls bring VINO!!!!  done. quatres etoiles yo!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NPYpeD0kKKuDm-TtmwxhHg"
  },
  "A7kz25nFqRgXtqdmpOmtDg": {
    "date": "5/7/2012",
    "text": "My husband took me here for our 1st anniversary.  It was SO romantic and the food was amazing!  The servers were also extremely nice.  I have absolutely no complaints about the place.  YOU MUST GO!  It had such a romantic ambience, which is surprising for where it is located.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ZUK7GDdW82BIeYxY8o4tw"
  },
  "4tzmD2iblN7wxM5d9IzhpA": {
    "date": "9/1/2010",
    "text": "Lovely fresh French-American bistro food in an intimate setting. Small menu means well-thought out dishes and good care put into the meal.  They do a lovely salmon. It's esp. good if you're out with friends who are a mix of vegetarian and meat-eaters since everyone is happy with the selection.  BYOB a plus.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8yeDg_CWs5OnnRcXxi7rWw"
  },
  "MCFgq0nBc0ZM8HU2SGpG4g": {
    "date": "1/6/2016",
    "text": "Quite honestly I was disappointed with Cafe Du Jour.  The space is uneventful with no real charm or distinct decoration.  The kitchen is in the front of the house so you can watch them cooking, however, there is little to no ventilation so once the chef gets on a roll the place is full of smoke and grill smell.  Myself and two people I was dining with actually had to leave for a bit just to catch some fresh air.  My contacts were killing me and my clothes definitely absorbed everything. It's obvious the chef here has had some real training.  The food came out slowly but was presented beautifully.  I only ordered an appetizer and it was fine.  Our group shared some spinach dip that was tasty.   Cafe Du Jour is BYOB and the corking fee is $2/person.  I'd like to come back when the weather is nice and sit outside and give this place another shot because I think it has real potential.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYTpi63Tv_UTjsaTMCZUvg"
  },
  "3bdtoTYftPPIChhnyQjXDA": {
    "date": "7/15/2016",
    "text": "Came here last night after months of saying we should.  We were hoping to sit in the garden, but it was pouring down rain.  Our server informed us that once the rain passed, he would be happy to move us into the garden after drying a table off.  I loved the ambiance inside the cafe.  Reminded me of the hole-in-the-wall gems back in NYC and Seattle.  Loved the music and the SMELL of that amazing food.  Cafe Du Jour is BYOB and only charges $2 a stem, instead of some exorbitant corkage fee.    We started with the spinach dip with fresh baguette.  The quality of the bread was wonderful- it was warm and crusty and fresh.  The dip was rich but not too salty.  Nice appetizer for two.  We couldn't say no to having a cup of soup.  My boyfriend got the soup du jour which was a carne chili.  He said it was the best soup he ever had.  I had the mushroom soup- again, very high quality mushrooms used here.  A nice, light soup.  My boyfriend ordered the salmon.  Let me tell you- I am from Seattle and I am VERY picky about my salmon.  I have a hard time ordering it in Pittsburgh because it just never tastes right.  I tried the salmon here and can tell you it is one of the best cooked salmons I have ever tried.  The skin was crispy and the meat cooked to the perfect pink.  Very impressed.  I had the eggplant rolls.  Incredibly tasteful vegetarian dish that didn't rest on cheese as the only flavor.  The side of broccoli was changed to mushrooms that were spiced just right.  The potato was just enough.  We split the chocolate cake for dessert.  Decadent and creamy.  We even got to move out into the garden!  Definitely love this place and will be coming back.  The grand total for our bill with an appetizer, two cups of soup, two entrees, a dessert, and two stems was $75.  Can't beat that.  And can't be the charm.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "K-nJvlZKQOHp1R5CkHh0Eg"
  },
  "uaW7aZ_-HXxua1Es6AtVrw": {
    "date": "6/7/2018",
    "text": "Came here for a nice quiet lunch on the patio. Beautiful location with turtles in the little pond! The food was delicious, the price points are really great, and the server was very nice. The menu is really interesting as well. Looking forward to eating here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a0NgnJLcl8NBiU4Xj98wyg"
  },
  "dgQWfovnNe1X44aQ_eHTPQ": {
    "date": "11/18/2017",
    "text": "Best food in Pittsburgh. Creative, perfectly prepared, good service. Amazing salmon. Acorn squash soup with pumpkin and toasted almonds. Perfection!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Rw_2JfczKu4vKPzT3WD5w"
  },
  "LntMI-kEXt2dH8-WqCaf3Q": {
    "date": "9/23/2016",
    "text": "Went to Cafe Dujour for the first time last night with friends. It did not disappoint! We had a large party for a birthday dinner and pre-ordered our courses and everything was served family-style.  For appetizers, we had the spinach dip, crepes filled with spinach and goat cheese (my fave) and baked Brie. Both were phenomenal. We had our choice of soup or salad---most of us opted for the salad. The balsamic dressing was amazing--I think it was homemade. On to the entrees---stuffed eggplant, pasta in a vodka sauce (pasta was cooked perfectly) and the most amazing chicken and mushroom dish I've ever had! It was incredible--with a cream sauce that was out of this world. I can't wait to tell friends and family about this gem in the South Side!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c571SO1iUw-W_C2GtGKBog",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/c571SO1iUw-W_C2GtGKBog/o.jpg"
      },
      {
        "img_id": "UHT2f6fqQggbHA7aKfi2PQ",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Wonderful birthday celebration at Cafe Dujour! The food was amazing!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UHT2f6fqQggbHA7aKfi2PQ/o.jpg"
      }
    ],
    "user_id": "KMK-jvUNxZ5UmhTacNu34A"
  },
  "Cq5QLmronR62q7OgNgQITQ": {
    "date": "6/11/2014",
    "text": "Things I look forward to when dining out on a warm summer evening, in alphabetical order (or order of importance, my lists are versatile):  1. BYOB 2. Fresh ingredients 3. Good-for-sharing, generous portions that satiate, not over-fill 4. Interesting food and flavor combinations that I wouldn't normally think of 5. Outdoor seating 6. Quiet, quaint, intimate atmosphere  Cafe du Jour certainly exceeds my expectations. I walked in and got lucky (celebrating a birthday with a good friend and our first choice was closed), but you might want to make a reservation for this gem. They have an outdoor seating with a gorgeous garden and fountain that seems to tuck you away from the boisterous South Side. We had a few small plates (all delicious, try the meatballs), a cup of soup (fresh mushrooms are a joy), and all of the food was perfectly cooked and neatly presented. The waitress was friendly and even put a candle on the dessert we ordered.  If you're looking for an easy meal, come to Cafe du Jour and relax a bit. Bring a bottle, a friend (or two), and a big wad o' cash from the ATM next door. What a perfect escape for an affordable price.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "xhVlmdU1sPVH6GBJw6AZtQ"
  },
  "JSogMsJ6kyF4AKHoz0LqEQ": {
    "date": "6/8/2017",
    "text": "My boyfriend and I visited this restaurant while visiting from out of town for a Pens game. We sat on the back patio which was super cute and picturesque. I ordered the daily special, a split pea veggie burger topped with kimchi and leek crema. It was delicious. The reason I have given this restaurant 3 stars is for 2 reasons: 1) the restaurant does not have a website and do not post their menu  on social media. My boyfriend is gluten free and when we arrived, there was not much that was gluten free. Even items you think could be were not due to flour being used as filler, thickener, etc. After inquiring on the gluten free items, the only thing he ordered was a tiny side of Brussels sprout salad. The server asked if he was sure that was all he wanted rather than checking with the chef to see if there was anything else that could be randomly prepared gluten free. If they were with current times and posted their menu somewhere online, we may have planned differently or called ahead to make accommodations. 2) my boyfriends salad had a hair in it. Gross. When we left, we noticed the chef had longer hair. A hair in food can happen, I suppose. But maybe a chef with longer hair could wear his hair in a ponytail to try to prevent this from happening.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e32aURMgn5E_Qg2YDRkh-Q",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/e32aURMgn5E_Qg2YDRkh-Q/o.jpg"
      }
    ],
    "user_id": "XzwlmdEnPb2GO-6kTiaV5A"
  },
  "KFnm7ZNUbumwSjWCcRx7rQ": {
    "date": "2/22/2016",
    "text": "Amazing little BYOB restaurant tucked away near the BP on East Carson Street. I have been here multiple times with groups as large as 20 and they are so consistent, every time I leave wondering how soon I can come back. They do amazing appetizers, my favorites being the crostini with pork (I order mine without), Brie, spiced apple butter, and arugula, and the spinach and pecorino dip with marinated tomatoes and basil served pipping hot with steaming hot baguette...unbelievable. The spinach dip is so creamy, warm and delicious, it could be eaten by the spoonful. All their entrees are so fabulous.  Being as I'm a vegetarian I've had a select few entrees, but the rolled eggplant filled with fresh mozzarella, sundried tomatoes and a pester cream sauce is divine! Entrees are served with soup or salad. They have a light but delicious vegetarian mushroom soup loaded with wild mushrooms and a great homemade poppy seed dressing served with their house salads. I have never eaten one bad thing here. Love this restaurant and continuously recommend it to friends and family. Be aware it is cash only. Oh and the corkage fee is only $2 per person, can't beat that!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8Ub-uwXKY62G-d_s3Y1Ftw",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Crostini with brie, spiced apple butter, and arugula. The one on the left has roasted pork. $10",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8Ub-uwXKY62G-d_s3Y1Ftw/o.jpg"
      },
      {
        "img_id": "KTbV0UijsVQBnkhSUjOGzw",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Spinach and pecorino dip with marinated tomatoes and basil, served with fresh baguette.  Grande, $9.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KTbV0UijsVQBnkhSUjOGzw/o.jpg"
      },
      {
        "img_id": "P1gRcQNSBslomz6_OBgPRA",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Special of the day: roasted chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P1gRcQNSBslomz6_OBgPRA/o.jpg"
      }
    ],
    "user_id": "HdEM0xeldw4QAweECyOwcQ"
  },
  "f76uFbP8eZ5jJXbcHQ6KLg": {
    "date": "3/10/2018",
    "text": "I recently had a corporate dinner at Cafe du Jour.  I had some international business colleagues from Germany visiting Pittsburgh, along with other local co-workers, and wanted to find a special place to have a group celebratory dinner.  I worked with the owner and chef, Paul, to choose the perfectly served family style dinner.  From the appetizers (baked brie with walnut glaze, shrimp cocktail with Thai chili sauce and goat cheese crepes) to the wonderfully prepared dinner (glazed salmon, porcini dusted chicken breast over truffled burrata, and the delicious eggplant rollatini) were all amazing.  Also, the wait staff was very attentive to our every need, including serving sparkling water.  The evening was phenomenal and my German colleagues raved to me the next day about the evening and the delectable food.  I was so happy to choose this wonderful restaurant and the BYOB aspect gave me chance to bring some great wine pairings.  I would highly recommend dining at this establishment.  Kudos to Paul and his staff for making it a memorable evening.  They will see more of me when looking for a place to eat in the Southside! Try Cafe du Jour and I am sure you love it as much as I!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KGRMbLuM9rm6VCHbf-bJMA"
  },
  "qeGOi2KKW_TTtEVCLlLWzg": {
    "date": "1/20/2018",
    "text": "Honestly this is like my 6th review ever but this place is SO good and amazing I had to write. Some of the best dishes I've ever had. Everything impeccable and well prepared. Go! You'll love it! The salmon is absurd! That's a whole f*cking fish!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n_Wddc4gqRDHPNTS-sibWg"
  },
  "xiExOLQ8Y-qc-SmHDuM5GA": {
    "date": "9/1/2013",
    "text": "Cafe Du Jour is hands down one of my favorite restaurants in Pittsburgh.  I recommend it to all my friends and any visitors to the area.   The place is tiny and so is the menu, but you will have an amazing dining experience if you follow the following recommendations:  First, always make a reservation, especially in the winter.  In the warmer months, the best place to sit is outside, where they have several tables set up in a beautiful garden. There is a lovely fountain and pond in the back, where a few turtles play. I like turtles.  In the winter, indoor seating is limited to a handful of tables.    Second, I recommend eating earlier in the evening.  Due to their galley-size kitchen, Du Jour sometimes runs out of ingredients for some of their dishes by late night.   Third, bring plenty of cash and your choice of beer or wine. Did you know the former comes in pints? There's a $2 stem charge for each person in your party.   Lastly, bring a wizard with you when dining on the patio.  I know, I know.  Long have you desired to look upon the kings of old.  But you never travel through Argonath without some protection from orcs.  (Lost? See my picture). In all seriousness, make sure the waitstaff lights the candles because at some of the outdoor tables, bugs can be a nuisance.   Now to the food.   Du Jour has the best spinach dip in town.  If the place wasn't so tiny, I would go just to eat the dip.  It is served with freshly baked bread, so give it a minute to cool down before you tuck in or else you'll end up with burnt tastebuds.    All of their standard entrees are excellent, especially the strip steak, salmon, and eggplant rolls.  But do try the daily specials!  If you and your fellow diners can't decide what to order, I recommend getting a few different entrees and splitting them up.  There's more than enough to share.    Don't leave without hearing their dessert offerings.  The flourless chocolate cake is especially good.   Cafe Du Jour is open Tuesday-Saturday 5pm-10pm.  They used to offer lunch a few years back, but alas, not anymore.  No more elevensies for me.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "myF32Uh_5OdTOcpFgzsptw",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Isildur hiding in the back of Cafe Du Jour&amp;#39;s garden.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/myF32Uh_5OdTOcpFgzsptw/o.jpg"
      }
    ],
    "user_id": "tu5AwWOh6QlSvpi5CXalQg"
  },
  "-4AEcJo3o7Z6am5QUCCGDQ": {
    "date": "2/22/2018",
    "text": "I haven't been in quite some time, but have had no less than 3 special occasions here at Cafe du Jour. Service and food have all been amazing and seeing it here on Yelp has reminded me that I need to return immediately.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5BrZNQHJuDdj_UzaArdOBg"
  },
  "SPHd6nNoZ72BBUcbsgNyng": {
    "date": "12/29/2013",
    "text": "This place was just great. The food was fantastic, the atmosphere was cozy and comfortable and the service was professional.   As already mentioned,  the food was just delicious - especially if you like mushrooms, lots of options for great mushroom dishes; wild mushroom consumme, mushroom and brie crostini, spinach salad  - add mushrooms,  a stuffed chicken with mushrooms entree...clearly, I'm a fan of mushrooms.  BYOB - fabulous. Corkage fee was only two dollars a glass. I love a good BYOB, these restaurants aren't concerned with the profit of alcohol - they are in it to make really, really good food. That's awesome.   The space is small, probably only five or six tables - though in the summer I hear they have a gorgeous back patio - and there is an open kitchen. The service was...leisurely - due to the small kitchen. It was fine for our evening - girls night out with holiday grab bag gifts, a bottle of Prosecco (where we had asked them for champagne glasses which they washed and gave to us) and two bottles of wine. The place is made for dining, not for a quick dinner.   Could have been a little cleaner , waitress could have been a little friendlier -  she was professional, but just a hint cold. Ultimately though, very satisfied. A must go for foodies in Pittsburgh.  Be sure to make a reservation!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "e-6TWa4O4-kD0tZdg4jjnA",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Wild mushroom consumme to start and a BYOB - key to my heart",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/e-6TWa4O4-kD0tZdg4jjnA/o.jpg"
      },
      {
        "img_id": "oKnYQz0bhs2d6DEr_yBPmA",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. This place was as fantastic as the four girls I dined with - that says a lot!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oKnYQz0bhs2d6DEr_yBPmA/o.jpg"
      }
    ],
    "user_id": "40V3xrH5xCtw0jBHLFBMyQ"
  },
  "-0KKL6hNVP-tScoPOERQSA": {
    "date": "2/7/2016",
    "text": "Well, for once? I have to agree with PGH reviews. This place is really awesome.  I have actually been to places in Paris that were very similar to this.  The food was great. The service was awesome.  Just a couple things, we tried three times to eat here. The first time? We made a reservation at at like 5 and then tried to find wine for dinner.Pennsylvania's sh**ty liquor laws  forced us to cancel. Who wants French food without wine.  Get out of the dark ages PA.  Anyway, we made this reservation by leaving a message confirmed but when we arrived? No resie. That's not cool.  Also, vegetariens? Watch for the hidden meat in some of the dishes.  Otherwise, we will be eating here a lot more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GHP0zVzInzoxUm_5nPK6KQ"
  },
  "05MI_q7klf73Q3fQUSj6bA": {
    "date": "2/1/2018",
    "text": "The small plates were fantastic. We enjoyed every bite. We can't wait to go back when the garden is open.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hOk-tB2MWh8CGRsWC6ax8w"
  },
  "tyrLO-ncfkgKIaf1u9Q5NQ": {
    "date": "6/2/2017",
    "text": "This is such a charming, intimate restaurant...a real jewel. The food is not only absolutely delicious but beautifully plated. The waiter was very friendly and helped create the warm and inviting atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hT4PL27n7N1L4KXY8TOjxQ"
  },
  "0g5ZdnHPh4aH-LBz0M2F8Q": {
    "date": "4/24/2013",
    "text": "I am so in love with this place. After reading the Yelp reviews I decided we had to go. We called on a Saturday afternoon to make a reservation and thank god we did. We wanted to get there at 6 but had to settle for 5:30; apparently they were totally booked for the night by the time we arrived (they were turning away walk-ins they had so many reservations). So glad we made a reservation, we never do.  Anyway. We brought a few beers/cider since its' BYOB and it was no problem (there's a $2 stem fee for each person). We ordered the spinach dip and LET ME TELL YOU it was absolutely divine. I could have bathed in it. The bread was fresh and warm, and the dip was absolutely to die for. Get it. You will. Not. Be. Sorry. Have I gotten that point across well enough yet?  For my entree, I had the NY Strip Steak. Also definitely not a mistake ordering this baby. It was tender, juicy, tasty, and delightful. The butter on top was good, the veggies it came with were good... Absolutely yummy. The BF had the pork chop and wasn't totally wow-ed with it like I was my steak, but as he said, it's hard to do a pork chop well. I wouldn't know, since I can barely cook Velveeta shells and cheese, but what are you gonna do? The crispy kale was really interesting, anyway. Not something you get every day.  This place was intimate, the food is cooked pretty much right in your face (it seems like an old deli counter turned open air kitchen), and they have a delightful little patio I'd love to sit on in better summer weather. Our waiter was attentive and friendly and I will so be back to Cafe du Jour.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zkcTDekztrzk6jDS_4YN7Q",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Their menu as of 4/13/13",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zkcTDekztrzk6jDS_4YN7Q/o.jpg"
      },
      {
        "img_id": "GygWsobLWa7UX6xRx7h9lA",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Their menu as of 4/13/13",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GygWsobLWa7UX6xRx7h9lA/o.jpg"
      }
    ],
    "user_id": "mT-sJNwB2Vt3DYcwF7w74w"
  },
  "L6kb00lIy0IrleHdWvIT9w": {
    "date": "6/9/2013",
    "text": "We've been twice...in 2 weeks.  That's how good it is! We visited for the first time on a Thursday night and then returned a week later on a Saturday for my father's birthday. On both visits, we were able to sit outside, and both occasions our service was fantastic. Both servers were friendly and hospitable, very knowledgable about what they were serving and very accommodating to any special requests.   On our first visit, we had the spinach dip with fresh, hot french baguette, the rosemary skewered shrimp, the house salad with roasted garlic vinaigrette, and we shared the pork chop. More than enough food for two people to share, the shrimp was divine, perfectly cooked, not at all gummy, and the accompanying sauce was fantastic. LOVED the hot, rosemary seasoned bread with it. The spinach dip was a perfect combination of the bright, fresh basil and creamy cheese with ripe tomatoes and delicious spinach. Again, the hot bread was perfect. Salad was delicious, and the pork chop was divine. This place has a fantastic chef who knows how to cook meats and seafood perfectly. It was juicy and not a trace of pink. Awesome.  We returned as a group of 4 and had the rosemary shrimp, the spinach dip, the house salad, the smoked salmon salad, the watermelon gazpacho, the scallops special, and the New York strip. The watermelon gazpacho was actually recommended by a different couple at another table! Just imagine, enjoying something so much that you recommend it to other people in the restaurant that you don't know! Yeah it was that good. Chris loved it. He also very much enjoyed the smoked salmon salad, just be forewarned, the dill in the dressing sneaks up on you and if you aren't a fan of dill, well I'd recommend a different dressing for sure. The scallops were melt in your mouth perfection. If they have scallops as a special when you visit, I highly recommend them. Amazing. The only disappointment of the night was the new york strip. Earl said it was a bit \"tough\". I didn't try it, but as he loves a good new york strip, I'd definitely take his word for it. Not a big deal, he enjoyed it, but not nearly as much as the rest of us enjoyed our meals. A bummer, and something to consider if you are a big steak person.   All in all, we will definitely return! The garden is a delightful little respite in the business of the south side, and we really enjoyed watching the two turtles swim about.   I priced it at moderate because the ability to BYOB saves a TON! On our first visit, our meal was $50 (for 2 people), our second visit $150 (for 4 people). So I'd say it falls in between the moderate and spendy categories depending on your group and what you order. Make reservations as seating is limited and who wants to be stuck in the dining room staring at all the people enjoying the gorgeous garden?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FlAwqsOkhmmMGN8PLsaMcg",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Rosemary shrimp with tomato and kalamata olives! Delicious doesn&amp;#39;t even begin to cover it!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FlAwqsOkhmmMGN8PLsaMcg/o.jpg"
      },
      {
        "img_id": "-sq3yMEM6QdgrXc401udAA",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Spinach and ricotta dip with steaming hot French baguette",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-sq3yMEM6QdgrXc401udAA/o.jpg"
      }
    ],
    "user_id": "tmvYYqXiz3I235x-SSOeTw"
  },
  "etBy63vKaoZhmQBadcDlwA": {
    "date": "9/20/2015",
    "text": "I proposed to my fiance here and they did a great job. Gave us a prime spot by the fountain, brought us some special plates throughout the meal and even helped with the actual proposal.   The food and service were phenomenal. The spinach dip starter was delicious and I'm not usually a fan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vR0XClu34W9f2XOaJyYFgQ"
  },
  "dDK1r7dctvtQRogoJ3ldcQ": {
    "date": "4/4/2015",
    "text": "I've been to Cafe du Jour a few times - always in the summer where you can sit on the adorable back patio. But last night was my first visit when it was too cold to sit outside.   Let me start off by saying that the food and the service here was terrific. But I'm giving this only three stars because it was unbearably smokey. It's an open kitchen, which is normally great, but without the proper ventilation it felt like I had spent the night in a smokey casino. It actually ruined the meal.   I'll be back, but only when I can sit outside.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "URH7mgjWmZ6chyJudA_6aA"
  },
  "I2YWMb7NuBu52ZyubRbxZw": {
    "date": "11/11/2018",
    "text": "Terrific food in a cozy space with an open kitchen.  It's a marvel all the amazing food that comes out of the little kitchen.  In the summer, there is a nice garden in the back.  I brought a group here and we had a family-style meal.  The food was carefully and deliciously prepared, even for a large party.  I highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ASOJSBvDEN97TJWJz-4gug"
  },
  "Jrsw8CammnIUhgv8xgrMJg": {
    "date": "3/6/2019",
    "text": "I am among the many who have driven past this place 1 million times and I always thought I'd stop. Finally brought two friends for lunch today. Amazing! We ended up ordering for lunch entrees, a daily special salad, and the soup of the day.... fresh tomato with Romano cheese. Everything was absolutely delicious, the prices were very reasonable, and the service was impeccable. Will definitely be back! Waiting to eat in their back garden. (I love the fact that it's BYO and only a two dollar stem fee!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "njp-VIKNIAnoUT1oqjJgHw"
  },
  "jXtpBE-Hb6cYHmWQu2josQ": {
    "date": "2/27/2018",
    "text": "The flavors at Cafe Du Jour were as delightful as the service at the quaint European-inspired lunch and dinner spot in Pittsburgh's Southside. Thanks to Paul and his team for an incredible lunch of coconut green curry soup du jour, Korean beef on baguette and potato pancakes with roasted pork loin, brie and apple butter. Already looking forward to returning with friends and a bottle of wine when it's warm enough to enjoy the courtyard and turtle pond.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GPJihpqR51GC1JvyzBHOMw",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GPJihpqR51GC1JvyzBHOMw/o.jpg"
      }
    ],
    "user_id": "f0GGP6FbClG3PNFLEz_-Gg"
  },
  "GyOdgz7VIeS9NAnaVpjiRQ": {
    "date": "6/29/2018",
    "text": "This is one of the best restaurants in Pittsburgh. The food is fantastic, and the outdoor seating area is to die for. It's BYOB so it's a little easier on your wallet. I have gone here many times and everything has been delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C-Fnl8F3CoxrDqAEkVpOoA"
  },
  "rdIIoG7ZNpwSStnqzOtCWA": {
    "date": "12/31/2017",
    "text": "My husband came across this spot in an article that identified Pittsburgh restaurants that have \"stood the rest of time\", and I can see why. The food was amazing, space intimate and staff very friendly. The spinach dip was the best dip I have probably ever had & my entree of salmon was delicious. We will absolutely be back. It is BYOB and cash only.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dnPLSqmgw6S0B_CL6KAVug",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dnPLSqmgw6S0B_CL6KAVug/o.jpg"
      },
      {
        "img_id": "FcTaDNAqleMpdLcKmOWlAg",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FcTaDNAqleMpdLcKmOWlAg/o.jpg"
      }
    ],
    "user_id": "Y3tM5oIHTh-vCVyT4NFTjA"
  },
  "WrLkCpTMub5H8EprTpXc0Q": {
    "date": "9/2/2018",
    "text": "I was there on Friday the 31 for my anniversary \"dinner\". The appetizers were amazing. The soup was great. Unfortunately I made a 530 reservation, with an 8pm theater show, in Hope's that I could enjoy a leisurely meal and still make my show time. After our soup 25-30 min passed and our entrees still haven't came, that's when the waiter/manager said he forgot to put them in! Unfortunately we didn't have any time to wait for our dinner, so we got a free dessert and had to go. This was looking like our best meal in Pittsburgh, but turned out to be a disappointing \"special\" night!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r1cyCuVKpeIZmgyStohXqA"
  },
  "s9w5QoHXxdxuP0lNN-4Ylg": {
    "date": "6/16/2018",
    "text": "It is a very small but cute restaurant with great food. Matt is very good with pacing your meal. The cheese dip was very good with a toasted baguette. Meatballs were delicious and plenty for 2. I loved the chicken breast. Just delicious. My wife liked her pork chop but not as much as I liked the chicken. Its byob and reservations are a smart idea. Very small inside but the outdoor patio has more room and is very nice with a fountain with turtles. Would highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rk9yeFK8QwZd1lHefWTyQg"
  },
  "hTUSa-0yjsYRrHA0jy4AKA": {
    "date": "6/21/2018",
    "text": "Excellent. The small plates were not small servings but fig meatballs and mushroom plates were delicious. The steak was prepared correctly, spiced and paired with the right garnishes. My partner's dish vegi dish was a little too sweat but still good. Service was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nqCuE26cEEqmyA46hynMeA"
  },
  "MkwJz9c_7ul3ZTkBKROodA": {
    "date": "1/22/2019",
    "text": "Love love love this place!  The food was outstanding, the service-Casey was so enthusiastic about the selections AND, she was spot on!  A tucked away gem. Merci!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nppQfOutsiNs9ocE1PUILw"
  },
  "Imzbkvv73PsN3ZO7IOVTqg": {
    "date": "12/9/2017",
    "text": "Awesome!!!! Loved this place. We had the potato pancake with pork loin. Amazing and the owner is so nice",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bQXXn-qYbUKnZutyfYNU2A",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bQXXn-qYbUKnZutyfYNU2A/o.jpg"
      }
    ],
    "user_id": "rsA5EFhepNqUIW2xL5eeUA"
  },
  "FbAnvpU-PsTqqxSj3yqWpA": {
    "date": "7/22/2015",
    "text": "The courtyard is a wonderful lovely venue for outdoor dining.  It is small and quaint for one of our good-weather days this summer.  On this particular Tuesday evening we had a 6:15pm reservation for four and it was not crowded inside or out so I'm feeling very lucky.  Our server was gracious and helpful and not intrusive.  The menu selections offered a nice variety for carnivores and vegetarians with some of the options being salmon, chicken, pork chop, and eggplant.  This evening, one of the special salads had watermelon, tomatoes, and avocado as ingredients and I ordered that along with the pork chop.  The salad was so refreshing and both the salad and pork chop had an eye-appealing presentation.  My pork chop was thick, succulent, and moist.    This is an excellent choice for an intimate dining experience.  The only downside is that it is BYOB and it is cash only.  Thank goodness our friends joining us tipped us off to those facts in advance.  Thus, the 4 star review instead of 5.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "SK1bMWT1JlnRmKc661ewKQ",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Special salad with watermelon.  Quite tasty.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SK1bMWT1JlnRmKc661ewKQ/o.jpg"
      },
      {
        "img_id": "nApVGcZOY_JUR6HItPWrIg",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Juicy, succulent pork chop",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nApVGcZOY_JUR6HItPWrIg/o.jpg"
      },
      {
        "img_id": "sUJdcRFvlBzsJ5ExJujMkA",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sUJdcRFvlBzsJ5ExJujMkA/o.jpg"
      }
    ],
    "user_id": "GMKoemATfrXg1deaXxt2jA"
  },
  "jhm4tJqtwsVc3hU4Xz51mw": {
    "date": "6/12/2018",
    "text": "Not only is this a very charming spot but the food is a culinary treat. You can go to other restaurants for lunch (yum, yum & back to work ,) but you come here for an eating experience. Take your time and enjoy every morsel. The best!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "on2Zua7M1mNcSDHs2-M3Dg"
  },
  "99EU7VxNsDKxt4EpflNKwQ": {
    "date": "5/30/2015",
    "text": "SETTING: Small establishment with inside seating by an open kitchen or seating in their quaint garden area in the back. Mostly for parties of two.  FOOD:   Started with the spinach dip, which came with a warm french baguette. Never have I had a dip with such light and creamy consistency. I can't explain it, but I always get crazy shivers when I dip into something that is way too chunky...like mud, or, in this case, the spinach dip. Excellent texture and not overpowering in taste at all. Basically, give me anything edible and I'd happily dip it. Merci beaucoup.  For the entree, I ordered the salmon, and it was probably one of the best salmon I have ever had! On top of it being a healthy portion of salmon fillet, it was also very tender and flavorful. I'm not sure what was in the dollop of creamy sauce that came with the salmon, but it gave the dish an extra kick. The sides of rice and fresh greens were simple, yet a perfect accompaniment to round out the dish. It was so memorable that for that week whenever I thought about fish, I immediately pictured the salmon from Cafe Du Jour.    SERVICE: Patient and professional. Gave us enough space, but also came by to check up on us every now and then.    IMPRESSIONS:  I'm not sure I would categorize this place as French because it doesn't serve traditional French cuisine. No matter, Du Jour is mi amour and deserves high praise. Definitely sit in the garden area if possible. There's a water fountain/pond and greenery everywhere. Enjoying fantastic food in the \"secret garden\" just makes the dining experience even more special.   *Cash only",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "N1J6UX0sixnbTRLFX40cZQ",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. salmon with garden in the back",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/N1J6UX0sixnbTRLFX40cZQ/o.jpg"
      }
    ],
    "user_id": "e8uzNcSC5tQMD22GNAQEQA"
  },
  "ri-FMbm933TlGWVebR3AxQ": {
    "date": "6/16/2017",
    "text": "I've eaten here probably a half a dozen times, but finally felt compelled to submit a review after my visit last weekend.  This is one of of my favorite restaurants in Pittsburgh, and for some reason, I've noticed that Cafe du Jour goes unnoticed/underappreciated when it comes to Pittsburgh's dining scene.  The menu changes slightly, with a few mainstay entrees (egglplant, pork chop) that seem to be available year-round.  Everything I've had from here was phenomenal, as this is one of those places that you honestly couldn't go wrong with any option.    Cafe du Jour is BYOB, I believe $2.00 per glass.  Also make sure to take advantage of the outdoor seating, complete with a small pond and turtles!  The beautiful outdoor seating area is on par with Pusadee's Garden in terms of awesomeness.  That this beautiful garden area is two store fronts down from Jack's is something that I'm still trying to wrap my head around.   And do yourselves a favor and order the baked bread with spinach tomato dip.  It's a simple dish you see at graduation parties and chain restaurants, but I can guarantee that you've never had one like this before.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2E_ENuIwbwYq-MK3j0kxJg"
  },
  "u7xkIb6-TxORKpai-ft5lQ": {
    "date": "11/23/2018",
    "text": "Excellent food with a lovely space in the back garden for private parties. It's near all the bars on the South Side, but this restaurant has a lovely, cozy vibe. It's also within walking distance to a parking lot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XWf6BfVZp5XJX4iJC19gSw"
  },
  "k1WG1sL0BdgMsRpjukFpTw": {
    "date": "4/22/2018",
    "text": "Nice food with surprising but enjoyable layers of natural flavors from different ingredients. Good place for regular brunches.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yXWwjYel3txtCVRzRWTMRw",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yXWwjYel3txtCVRzRWTMRw/o.jpg"
      }
    ],
    "user_id": "zVqo55oH2VzqfKoGjjoOag"
  },
  "GWrW0vqa-JbucLPA_jI1mQ": {
    "date": "11/5/2018",
    "text": "We attended a private luncheon and I haven't enough superlatives to describe the incredibly delicious food and perfect service! Every single item we were served was beyond wonderful. We raved about every single bite and were astounded that each was more delicious than the last. This is a True gem and I can't wait to go back. Do yourself a favor and give them a try. I promise it really is as good as it gets!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v357fDmYN8DLzpNh_NUYKQ"
  },
  "_OKVoc-BMPOzYSASWwTUvA": {
    "date": "9/30/2018",
    "text": "Intimate, quaint.  Excellent and sophisticated cuisine. Great service. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LoM85q0PBKR9XvCG6fQKvg"
  },
  "W5i6SwGNG-U0Ah18__fJsg": {
    "date": "7/18/2017",
    "text": "Excellent hidden gem on the Southside. Walked there with a colleague from the Holiday Inn Express and the meal was fantastic. Although it was BYOB and cash only (which we didn't know prior) there's an ATM across the street and we were able to find a bottle of wine regardless. Crostini small plate with roast pork, Brie and apple butter was phenomenal, as was the fennel sausage meatball small plate. My colleague got the salmon entree and a salad and both of them looked outstanding. Outside seating near the pond with water feature was great! I'd love to return here another day to enjoy girls night with friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fjfsHMpZH9txzXYJcXrnEA",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Sausage fennel meatball small plate",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fjfsHMpZH9txzXYJcXrnEA/o.jpg"
      },
      {
        "img_id": "GG7lSi6RlEUtNOXgByExsQ",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Crostini with roast pork, Brie and apple butter small plate",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GG7lSi6RlEUtNOXgByExsQ/o.jpg"
      },
      {
        "img_id": "M9AqF3PpFql2EmFVI_9PBQ",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Salmon entree that my colleague enjoyed",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/M9AqF3PpFql2EmFVI_9PBQ/o.jpg"
      }
    ],
    "user_id": "8nnznYwYq9zNi3GSZ8nuEg"
  },
  "NQxD4KaA9_EIwcAfLtjzIg": {
    "date": "9/27/2013",
    "text": "This place is super cute! During the nice summer days, my fiance and I were looking for a nice place to catch a bite on the patio and after doing a search on Yelp, Cafe Du Jour came up as one of our options. We read about it being cash only, went to the ATM and made a reservation.  We arrive and the seating area is tiny as others have pointed out. It was also really hot and didn't seem to have A/C and we found most people on the patio.  Entering the patio, we saw what everyone was raving out. It was gorgeous! It had a flower baskets, garden and a fountain. Inside the fountain, I spotted a little turtle! It was a majestic place to soak in the atmosphere, fine food...and we saw pretty much every table bring a bottle of wine as well (BYOB!).  I ordered the Salmon with Wild Rice, while my fiance ordered the Eggplant dish which was served with some potatoes and a creamy flavorful sauce. Our food was delicious, the service great. Our bill came to around $50 for two people (we had an appetizer as well, but I forget what we ordered..). Lovely place for a nice date.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 10,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "hzRDBXkazN7_H7ey2J-wQQ",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Eggplant dish",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hzRDBXkazN7_H7ey2J-wQQ/o.jpg"
      },
      {
        "img_id": "Ut4uB53sMplwjhC_MYbAhA",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Salmon dish with wild rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ut4uB53sMplwjhC_MYbAhA/o.jpg"
      }
    ],
    "user_id": "NNL1zLTP2J_SOputgoPYeQ"
  },
  "RtzCzKfZZ4Mz8Oe4fnhm1g": {
    "date": "5/2/2019",
    "text": "We just left a fantastic meal at Cafe Du Jour.   We gathered with family and had a great time. It's such a hidden awesome place in the middle of south side. They have a gorgeous courtyard to enjoy your meal. It's a quiet and intimate setting.   The service was friendly, attentive, accommodating and helpful.  The food was absolutely incredible.   The 2 vegans of our group were prepared a 3 course meal that was as pretty as delicious. The rest of us enjoyed various entrees, salads, soups and starters.   We all shared the spinach dip and I could have easily gotten another order of that and been very happy.   You can tell the pride they take in preparing each and every dish. Everything was flavorful, fresh and incredibly well presented.   I had forgotten about Cafe Du Jour and am so happy that my aunt reminded me of it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEaYdTrF2JVebGbPVe5K6Q"
  },
  "6N3GvaPf7mgd9EKEXrkt5A": {
    "date": "9/21/2019",
    "text": "This cute little hole in the wall was the most charming dinner spot ! The food was delicious and the outside courtyard was so beautiful! I loved the staff and it's BYOB :) I would definitely come back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "57xKwDtfj-WoVJ-UQEwKZg"
  },
  "YnATiFxVliy0agxVJsj1QQ": {
    "date": "7/23/2019",
    "text": "Great hidden gem in the South Side! We came for lunch and sat outside in the back garden area next to the turtle pond. The server even gave us turtle food to feed them. The soup du jour was roasted carrot and goat cheese bisque and it was honestly one of the best soups I've ever had. It was creamy and flavorful and I could not get enough! I also had the chicken thigh confit. The chicken was cooked perfectly and the berry compote was amazing! I found myself spreading the berry compote all over the greens too just to make sure I got every drop. The slow roasted spiced beef sandwich was similar to a banh mi, and the crisp coleslaw went well with the meat. Overall, I loved lunch at this place, and especially cannot rate that roasted carrot and goat cheese soup highly enough!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3vgmdG7nC5PbcG5Z39YKRg",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Slow roasted spiced beef",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3vgmdG7nC5PbcG5Z39YKRg/o.jpg"
      },
      {
        "img_id": "7YOtxrONKfvRNZoJJOB83Q",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Chicken thigh confit",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7YOtxrONKfvRNZoJJOB83Q/o.jpg"
      },
      {
        "img_id": "Vz4GBO5mdaDwhFdPeS6jHw",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Turtle pond in the back garden area",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Vz4GBO5mdaDwhFdPeS6jHw/o.jpg"
      }
    ],
    "user_id": "Zw_V_Hd-2bDCymvfII-8uQ"
  },
  "6_jje_4v0zYCldOaeq-CiA": {
    "date": "9/14/2019",
    "text": "What a gem in the middle of the South Side! We enjoyed a lovely evening celebrating my father in laws birthday. We had a delicious mushroom, burrata, crostini appetizer, the mushroom consume, and the short rib entree. The desserts were delicious too! Love a BYOB place too! We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X9j1vp19fhPnaZjzldsafw"
  },
  "Qsl9di46CNxEMWAbAI5SyA": {
    "date": "8/28/2019",
    "text": "Delicious. Mr friend and I split the crustini with roast pork and brie as well as the eggplant entree. I'm so full. Atmosphere on the patio is lovely. We were seated next to the fountain. We brought our own wine. Cork fee was $3/stern. The menu is pricey, but Delicious and a nice treat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vrzp3SgBM7dvyuyXRqt2sg"
  },
  "y8MXsBhcBmwufTdGQ-xA3w": {
    "date": "12/29/2018",
    "text": "I've been meaning to eat at Cafe Du Jour for years. Finally, in September, I came here for dinner to celebrate an anniversary. It was worth the wait.   We made a reservation in advance, so we could be seated in the adorable back patio. We were seated directly next to the little pond in the back, which was very picturesque and adorable. One thing to note about Cafe Du Jour is they are BYOB- they charge for glasses, so just ensure to tell your server how many in your party will be drinking. We brought a bottle of wine, which only I enjoyed, but it was really nice to be able to bring one from home. For food, we started off with their spinach dip. It was served piping hot with fresh tomatoes, basil, and a french baguette. It was absolutely incredible. Easily the best spinach dip I have ever had. The small portion was perfect for 2 people and was only $8. For dinner, I went with the roasted eggplant rolls with fresh mozzarella, sun-dried tomatoes and onion jam. It was $20 and was served with pesto cream, roasted smashed potatoes, char-roasted broccoli and romesco. It was DIVINE. I loved each and every bite. The flavors went well together perfectly and the eggplant was cooked to perfection. Brendan ordered the porcini dusted new york strip steak ($33) which was served with gorgonzola compound butter, roasted smashed potato, char-roasted broccoli and romesco as well. He loved it and was in flavor heaven. The server we had was fantastic as well. I loved it here and cannot wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "B1YhHw_BWTADaeU1zzp5jg",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B1YhHw_BWTADaeU1zzp5jg/o.jpg"
      },
      {
        "img_id": "bJbMrsWmDAf5H-pLgGlWNA",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bJbMrsWmDAf5H-pLgGlWNA/o.jpg"
      },
      {
        "img_id": "wBEVdGuGglwGPU_EHs0hkQ",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wBEVdGuGglwGPU_EHs0hkQ/o.jpg"
      }
    ],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "PGs3gLz2k5OfDFu646yfKg": {
    "date": "8/17/2019",
    "text": "This was our first time there and what an amazing dinner and atmosphere!  The presentation and quality of our foods was worth battling the rain to get there. Our server made sure once the rain stopped that we were moved to the outside courtyard patio to eat. We felt as though we were in France! The fact that is is a byob made it all the better! Highly recommend trying this unobtrusive but totally cozy place! Pat B",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lIxV4hh2rR_UJPrLYUmJgQ"
  },
  "Jr0vAK3x-zLoImTo5sBYxQ": {
    "date": "3/14/2019",
    "text": "I returned to Cafe Du Jour last weekend for the first time in three years and am happy to report that not much has changed. The food, atmosphere, and BYOB are still awesome. The entire place has a feel of eating in the back of a restaurant in the chef's kitchen (in the type of way that you surprise your girlfriend with, not because you got a bad table). It's cozy and unpretentious, and the meal is guaranteed to be delicious. I would write about the items we ordered (mushroom soup, salmon, strip steak, pecan pie), but it doesn't matter because no matter what you pick the menu will please you. Although, if you like pork chops, I'd get the pork chop.  They have made one important change -  credit cards now accepted!  4-stars: Go tomorrow, or whenever you can get reservations ------ Ratings: 5: Go today 4: Go tomorrow 3: Go if you're in the neighborhood 2: Go if you're desperate 1: Go somewhere else",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UlkgKy_L0elAomAznMVmCw"
  },
  "LxeNz02ZXxNesyKyFpuEhw": {
    "date": "6/6/2018",
    "text": "I'm embarrassed to tell you how many times I drove past this place without stopping. But now that I've stopped here I will stop here again and again. My lunch today was a shrimp Po boy sandwich which is fantastic and mushroom soup. My wife chose potato pancakes with pulled pork and brie cheese. Amazing!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eZYnoGHM11CISpoUvpzl6A",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eZYnoGHM11CISpoUvpzl6A/o.jpg"
      },
      {
        "img_id": "t6NIB3k_gzTOuEKuK39Iqg",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t6NIB3k_gzTOuEKuK39Iqg/o.jpg"
      }
    ],
    "user_id": "Ivaiwkm8UOm7EHyH8trQ7g"
  },
  "tGmh7E1Yy87Igfwap6JOgQ": {
    "date": "4/19/2018",
    "text": "Can't believe I've never come here before! I suppose I just didn't have faith in a French-sounding restaurant to have vegetarian options.   We came as a large (20 person) group on a Tuesday. According to our host, who made the reservation, he had already selected the menu for us ahead of time.  They started with a large plate of hummus with roasted cauliflower and an herby cucumber salad, with pita chips. The hummus could have used more lemon, but the cauliflower and salad were perfect.  We were then each given a choice of a house salad and the wild mushroom consomme - I went for the consomme and really enjoyed it - it's vegan!  After that came a series of large plates, family style. We had a roasted acorn squash with blue cheese, roasted mushrooms with vegetable ragu, and eggplant roll-ups with cheese and pesto. I was so happy at the variety and quality of the vegetarian options. They also brought out meat dishes which the omnivores at the table raved about.  For dessert, we chose between flourless chocolate cake and pecan pie. I went for the pecan pie, and it was perfection.  I did not pay (it was a party), but looking at the regular menu, I think the price point is quite reasonable. The staff was very attentive, and even though there was another large group, the setting felt quite cozy and intimate. Would definitely return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "xSiaSnRfXBVZstO9LBNRaA"
  },
  "JQe0otnf2RBdPXqPi0LEpg": {
    "date": "8/15/2018",
    "text": "This Cafe is very welcoming and the outdoor patio is super nice to sit and enjoy good food by the pond! I admired the flowers and seating out back. It was quaint; I felt fancy!   The food was delicious! I never had something with such unique flavors that work so well together. I ordered freshly brewed ice tea with lemon and the small portion of Herbed Potato Pankcakes. This looks small on a plate, but trust me it will fill you up! The food tasted fresh and the presentation was lovely. I suggest coming here during a time of day that may not be too busy, like for lunch at 12:30 pm or so.   A late dinner would be really romantic and fun here as well! I would like to return here and try something new with coffee. :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ec2lEbFB-eV1QXFwK6lpRQ",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Yummy lunch outside by the pond: ~ Herbed Potato Pancakes ~ - roasted pork loin, brie, apple butter, and arugula",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ec2lEbFB-eV1QXFwK6lpRQ/o.jpg"
      }
    ],
    "user_id": "aFFUxXFayGnkxVJKzGrltw"
  },
  "7icSEnxjnzl9g1tCWQMe2g": {
    "date": "5/16/2018",
    "text": "This was my second night back to Cafe Du Jour.  I had to go back after having one of the greatest meals I have ever had. My first night was the meatballs and Tomato bisque! It was the best soup I have ever had! I am not exaggerating.  The atmosphere is laid back and the folks who helped us were so nice and the service was great!  Paul Krawiec who owns the place runs a smooth operation and is an amazingly nice person!  The food speaks for itself but the folks who make it and serve it make it special!  This Texan will be back when I am back in town!! Cheers!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j8hL5Q3SEdox2lkw_r8BXQ",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. The worlds best spinach and pecorino dip! You must get this no matter what!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j8hL5Q3SEdox2lkw_r8BXQ/o.jpg"
      },
      {
        "img_id": "gzc0k_BWEo8eN8mxOuFWBw",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. This was my Tuesday night small, the fennel sausage meatball with San Marzano tomato sauce. Fantastic!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gzc0k_BWEo8eN8mxOuFWBw/o.jpg"
      },
      {
        "img_id": "nldh9SYd35YTGxw1NpoVDg",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. The tomato bisque with peppers. I have had this two nights in a row. The best bisque I have ever had!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nldh9SYd35YTGxw1NpoVDg/o.jpg"
      }
    ],
    "user_id": "GLfpyrvUIYkQPKCblEFNzw"
  },
  "6MT77r1nN9v0IPLwNI8bog": {
    "date": "4/27/2019",
    "text": "Love the food here. Salmon, and ribs are the favorite! The yard is really cute, for a nice day. The only uncomfy thing for me is the smell. Since it is open kitchen, and the coat hanger is close to the kitchen. Sometimes, after dinner, my coat, hair, all get the smokey smell...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9rpL5q52tb3NpDMgB7y70Q"
  },
  "UPWHlmTSIvQNhqyll9Wsog": {
    "date": "6/13/2017",
    "text": "Got the pork belly entree which was being substituted by pork shoulder. This was probably the best execution of pork shoulder I've ever had. The meat was perfectly fall apart. The fat was deeply flavorful. The dish was slightly sweet. The kale and carrots in the dish were excellent in execution.   I thought there were too many flavors in the dish. The beans were slightly undercooked. The olives were an odd note of saltiness.   Because the meat was so well executed, I will ascribe my highest score. The chef here knows what they're doing.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sMwEJ5ZFTmf_zB61011-cA",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Pork Shoulder Main Course",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sMwEJ5ZFTmf_zB61011-cA/o.jpg"
      }
    ],
    "user_id": "EOajY1L3ole3gLTCZ2xw1g"
  },
  "TkjTAQ2WeInJYUv3SwZ9tA": {
    "date": "4/18/2019",
    "text": "We really enjoyed our meal at Cafe du Jour. The entrees were delicious and we loved sitting out on patio.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PuRnfTBDMGYGXP3-EhmcJQ"
  },
  "Xf-6U4Q1mujJJYF6qPQtew": {
    "date": "8/12/2018",
    "text": "This place is always super. It's a very unique & quaint restaurant. During the summer, it's fantastic to sit outside. They have a little pond with 3 turtles in it. They are cute & very entertaining to watch. We had the perfect table for 2 to watch them. We sat right beside the pond. The food here is always very good. We have been going here for years. The chef always does a fantastic job. The spinach deep & the baguette is off the chain. The service is very friendly & efficient. Please go give it a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qQDNeoXtnQrvN_eH4cCXFw",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Here are the turtles who kept us company",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qQDNeoXtnQrvN_eH4cCXFw/o.jpg"
      }
    ],
    "user_id": "8hMl3otCQKe8n7d7VmVwNg"
  },
  "UsloNjmImnL5qPBUHya7Ag": {
    "date": "12/2/2017",
    "text": "Cafe du jour is such a great hidden gem! I've been here a few times and have never been disappointed. We came here last night for dinner. Definitely get recommendations because the restaurant is very small - only about 20 seats or so. However, I think it makes it feel much more intimate, especially since the kitchen is right there in the same room as well.   BYOB is great and only a few bucks a stem. We started out with the spinach dip and crostini with pork and Brie and apple. Both were amazing! The spinach dip especially is probably my favorite thing on their menu. Although I've gotten the pork chop the last few times I went (delicious!) I decided to try the salmon. I was not disappointed - it was one of the best salmons I've had from a restaurant. Perfectly cooked and the flavors were amazing. My boyfriend had the steak, which was good but it didn't blow me away. Overall, delicious food and this is a great place for a date night!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gafuj636BfhUvUNTb0B3AQ",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gafuj636BfhUvUNTb0B3AQ/o.jpg"
      },
      {
        "img_id": "WkZu_nuTNbkR4AdFeeZ_vg",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WkZu_nuTNbkR4AdFeeZ_vg/o.jpg"
      },
      {
        "img_id": "iYFf9TWGlfj7qdJragF7Jg",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iYFf9TWGlfj7qdJragF7Jg/o.jpg"
      }
    ],
    "user_id": "wgTvhNy5-Q1razSWHhWs9w"
  },
  "HgAOlBsuiX7KQeFuNCp6og": {
    "date": "5/17/2018",
    "text": "I recently hosted my daughter's bridal shower at Cafe Du Jour and I couldn't have been happier!  While their lunch and dinner menus are creative and delicious, their catering menu is even better! It's much more extensive and even more creative.  And the quality of the food was noted not just by me but many of my guests who raves about the beautiful presentation, the accommodating service and the \"best chicken breast I've ever had\".  This is a farm to table restaurant and it is obvious in the quality and taste of the food. And then there's the magical preparation that chef Paul uses to make ordinary ingredients like chicken breast and couscous taste amazing.  Additionally, the staff were all professional delightful to deal with.  Finally, this is a BYOB place so the pricing was very reasonable for creative delicious good quality food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0pfF4Awcs1Rv2XSh2gWLjw"
  },
  "rDyEAR1KlC8HCWKoTkpT0Q": {
    "date": "4/13/2018",
    "text": "Loved the ambiance of the back patio with the fountain. Came for dessert, a flourless chocolate torte with raspberry sauce and cream which was delicious. Perused the menu which looks yummy, but maybe not as many things as I'd be interested in trying. Casual attire so that was nice, and different from the business of Carson Street. Non Appetite!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dLp1f6Cax2LBOO3hPTDqSQ"
  },
  "1ytmVM0OmW-eUg8ut_DoEw": {
    "date": "6/13/2016",
    "text": "What a cute find!   I've probably driven past this place 500 times and never noticed it. A friend of ours had told us about it and we decided to go this past weekend. I think what I like is that there are open tables because the chef really only seats the amount of people he can handle cooking for. It felt very personal in a way. The back patio is adorable and everything was quaint and peaceful.   Food: everything was really good. We started with a cheese dish that was served hot with apples and brown sugar and love. It was delicious. We also had the Steak and the stuffed eggplant. The eggplant was great!!!!! Steak (cooked medium rare as requested) was a tad bit too chewy but still had great flavors.   My biggest gripe would be the cash only. I totally understand cash only when checks are under the $50 range but it's pretty easy to spend around $100 here and to me that's a lot of cash to ask someone to bring. But since I love the personal level I can't complain too much.  ALSO BYOB $2 PER PERSON SO BRING A BOTTLE OR THREE!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m2x6EoNDPrmJfkm0Gl_sgA",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Steak (far) stuffed eggplant (close)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/m2x6EoNDPrmJfkm0Gl_sgA/o.jpg"
      }
    ],
    "user_id": "tJiWkQtxSmr4UdfEp-EYHA"
  },
  "H_mW8lrbL8yFo6QKNjX4qQ": {
    "date": "1/6/2009",
    "text": "Love this little place. I adore the lunch that they serve there. good salads and sandwiches. soups are basic but very good for such a small place. outside patio is very cute. although i did not enjoy my dinner experiences there. i always do come back for lunch and the flat bread gouda and turkey and the poppyseed salad dressing. pretty good place in pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8YwZ2FCPA7nf8WngszF_Kg"
  },
  "Rgj6k6OxjcDzsTceGPKReA": {
    "date": "2/7/2012",
    "text": "Flavorful food...just a bit noisy, but tons of energy...love the service and the BYOB element. Never felt rushed, just a great night all around with good friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GxyCi9bjjShjp_Wd5ze_EQ"
  },
  "h_lmrff6DQ-CI0bMGzZAfA": {
    "date": "7/16/2009",
    "text": "I went here for a nice evening and was blown away.  We were sat next to a small pond with two turtles we fed fish to all night. The food was moderately priced but extremely delicious and very fresh. The waitstaff was lovely and helpful. I could have stayed all night and will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tgDlohw-TUTse0uh6LHK6w"
  },
  "ajrBFCU6Wfp2enUwi1KtSQ": {
    "date": "2/9/2010",
    "text": "Great food here.  Not some place that you would wander into, but well worth going.  Nice patio out back when the weather is nice.  Bring your own bottle and enjoy!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yF10vq1_dKk3mQUf1UIZaw"
  },
  "OMZvbnpWeef4oj1KDOXPkA": {
    "date": "7/28/2010",
    "text": "Absolutely delicious. We went recently on a weeknight. It was pouring rain, so didn't get to experience the patio but we were so focused on the food it didn't matter. Fabulous squash blossom appetizer. Both the eggplant and pork entrees were exceptional.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ntES6Vpd9F_6LOtqYHRQXw"
  },
  "czQ1bvvc8EjfH5pIYCrO6Q": {
    "date": "3/21/2010",
    "text": "Four of us \"foodies\" ate here last night.  We were all blown away with our meals.  The asiago cheese/spinach dip app. was excellent.  It was served with a baquette of warm delicious bread.  We each tried a different entree.  The cassoulet with rabbit sausage & duck pate was divine.  The braised spareribs over gnochi, the pork chop over polenta and the scallops all were absolutely delicious.  We finished the evening splitting the lemon tart & chocolate desserts, which also were just delicious.  The portions were sized just right.  Plus, it is a byob.  Definitely, we will be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "itu63HDjHELc7z7d41kHnA"
  },
  "ZXX6a5c9CP39NcN2X0B1eA": {
    "date": "6/2/2009",
    "text": "Quaint little bistro.  Food is fantastic, very fresh ingredients..service is also good.  Love the byob, helps to save on the bill.  Have been for lunch and dinner.  Both have been equally great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n1UqLQcG2EPsKEAt7ee_kg"
  },
  "9przXEGjOzWfJpXmt_JbRA": {
    "date": "10/26/2013",
    "text": "SO SO SO Good. I often find myself thinking about their flour-less choc cake desert.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uy6dw6-sBxpxuZvHpPb8iA"
  },
  "XsAjz313L8MMn9tiXwMEgA": {
    "date": "1/7/2012",
    "text": "As you walk into Cafe Du Jour, you feel like you're entering someone's kitchen. It's a warm and kind of homey feeling. Since it was summertime, we were seated outdoors. The atmosphere was relaxed but still good for a casual romantic date. A large extended family were seated behind us and some graduate students with their advisor to our right.   My date and I started off with the Spinach & Asiago Dip which was not only superb but generously sized. The baguette itself was delicious.   As for entrees, my date ended up getting the chicken and I got the salmon. My salmon entree was satisfying with its layers of flavors.   All in all service was good. We left full and appreciative of the quaint little spot tucked away on Carson Street..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xd3CSVj30NCx990uZcjzcA"
  },
  "UzNJfVUVQggOCAB9dajxcw": {
    "date": "1/29/2014",
    "text": "This place might be nice in the warmer weather but the restaurant was freezing and we had our coats on the whole meal. They also left the door open a crack to get the steam out from the kitchen. The service was slow the server was unpleasant and she didn't get us out on time for our show (which we mentioned several times including when we made our reservation). The food wasn't bad but a little overpriced.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tpmTbOXSFs_RYVxLnW--Sw"
  },
  "iwSTnQTA4l4oD-9bJ3S-3g": {
    "date": "10/31/2013",
    "text": "I have been here twice now, the food is great & the atmosphere is charming. Remember your bottle of wine and treat yourself to an enjoyable evening @ Cafe Du Jour.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c2JSmksY7l0Rq4X3WDiZLw"
  },
  "PQzxrUhUH2g8kVvS2UvqMA": {
    "date": "2/2/2011",
    "text": "Love this little gem of a restaurant! Come here for the ambiance and enjoy a special dining experience. The food is excellent. BYOB places are the best. Just bring cash and an empty tummy. Take a look at the pics to imagine what you could be savoring! Yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wXPQP1AIkzYvJgvKg7bYFA",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. New years eve dining",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wXPQP1AIkzYvJgvKg7bYFA/o.jpg"
      },
      {
        "img_id": "HNmSmRsO1SI69xJPmzjEhw",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HNmSmRsO1SI69xJPmzjEhw/o.jpg"
      },
      {
        "img_id": "B7u_pjy-BElpt8C0cgXa7A",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Short ribs special",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B7u_pjy-BElpt8C0cgXa7A/o.jpg"
      }
    ],
    "user_id": "CbmNBkKa9QKNxPiN_whFUw"
  },
  "cet0l1mQ3ChfkG-bXxHwew": {
    "date": "8/30/2013",
    "text": "Great food and amazing atmosphere! A little pricey not somewhere to go every week but definitely worth it a few times a year! Love it! And beautiful summer back courtyard!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SPPieDvwnkvQoI7lj5vFYg"
  },
  "t3BipAg1GIYZzczqbw5DJA": {
    "date": "3/6/2013",
    "text": "I can't believe I lived in South Side for 7 months and haven't noticed this place before! This is a cute little BYOB place with AMAZING food!! I can't wait to go again, especially in summer when they open their patio! We started with several appetizers that were the specials of the night, and I ordered the New York Strip Steak as an entree and it was to die for! My friend had the Roasted Eggplant with Mozzarella and it was also very good! The service was very attentive and friendly and the place was just cute! It's a great spot of a date or a smaller group.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "W_QmmtOEBdFTKyDLyfvIZQ"
  },
  "ydv6IQte78RLtbuqDCPJRw": {
    "date": "12/2/2011",
    "text": "My wife and I went here on our anniversary and had a great time. The food was awesome, it's a BYOB (which I love), and the service was great.  The restaurant is pretty tiny inside, but I didn't feel crammed. I noticed they had a really nice looking outdoor patio area, but it was too cold for us to sit out there. In the summer time, I'm sure the patio is jumping.  Our waiter was nice, and the chef really seemed to appreciate our business. He even sent over a delicious bruschetta he made for us on the house!  One important thing to note, the place is cash only, so make sure you've got some greenbacks with you.  I love to support local businesses, and this place is definitely a gem. Check it out if you're in the mood for some delicious food in a friendly, local atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EO_ZcN4UHwbrAS3tNUS0Kw"
  },
  "cKi6_DyYtfppBTjf9P7wCA": {
    "date": "4/12/2012",
    "text": "Great food.  Awesome service.  Charming atmosphere. No gimmicks.  Check it out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aAypfNUdOyM2rLkRSRNI5g"
  },
  "c2LY-NGTCdBvnSRkqd7UgA": {
    "date": "6/28/2012",
    "text": "A city restaurant without a website - how quaint! I don't think I would have ever discovered it without Yelp. I first sought it out based on reviews a few years ago and I remember thoroughly enjoying a salad on the patio on a fine summer's day. Then, earlier this spring my partner and I stopped by to read the menu - my partner noted the sorta high prices and I noted the total lack of vegan options. Someone from inside popped out to let us know that they weren't yet open for dinner (it was b/w lunch and dinner time) and asked if we'd like to make a reservation for later, all in a very kind and inviting manner. I mentioned that I was hoping to find something vegan and she assured me that the chef could make something. We passed that time (due to cheap partner), but I knew I would return for some al fresco joy, and earlier this week, I did. I called ahead to make a reservation and to make sure they were really ok with making a vegan entree. When we arrived, the vegan thing was acknowledged by our server and we were seated in the best spot on the patio, next to the cute and oddly gregarious turtles! We were handed some well used paper menus and our cheap sparkling wines were properly chilled/corked/stored. From then on, things got awkward. My dining companion, who kept baby talking to the turtles throughout the meal and even feeding them, coerced me into drinking her recently deceased grandmother's favorite cheap sparkling wine (Asti) and we made a toast to this woman I never had the pleasure of meeting. And we were left with crusty menus that which had no apparent vegan selections and waited for the server to, um, maybe, uh mention what they could do. Instead she came to take our order. And I had to explain that since nothing is really vegan on the menu, I needed her to describe what could be made vegan. Uhhhh, the mushroom consomme annnnd a salad...ummm...let me go ask the chef. The chef had an excellent answer, it is a mystery to me as to why he was not consulted earlier. I did try the mushroom consomme to start, which was alright (I would not order it again), and ordered the chef's special with was described as a zucchini stuffed with spiced cous cous. Sounded boring. But as presented, it had a lot going on, I almost feared it had too much going on - tomato sauce, capers, walnuts, basil, golden raisins, cinnamon, bread crumbs...whoa! Was it going to be as clumsy as our service? No! It was well composed and very satisfying to my palate which was maybe only slightly deteriorated from drinking Asti. The chef also sent out some complimentary small bites before our entrees, I imagine because the special dish was expected to take longer than a usual menu item, though it didn't seem like an especially long wait. Awesome gesture, as it proved someone was on their toes. At the end of the meal we had our second most painful conversation with the server, regarding coffee. It should have been a pretty simple exchange, really. I ordered espresso and my friend asked if the coffee was french pressed. Instead of just saying \"no,\" we got some bumbling convoluted answer that left us confused - I was able to gather that no, it was not french press coffee and that either the coffee or espresso (or both?) were from some sort of pod - like maybe a machine that sort of presses a pod...My friend, bewildered, just ordered an espresso, but I had to ask, soooo is the espresso from a pod thingy? Yep...ok, I am sorry but I don't want the espresso, and I joked about drawing the line at imitation \"champagne.\" No fun. I tried to be really kind and easy going to make up for being such a damn snob, an inconvenience at every turn, for trying to understand what was being offered. As I watched our server describe the specials to an arriving table, counting the two of them on her fingers as if she was twisting each special off of a finger and squeezing it into her palm, I felt sorry for those others who came to endure her writhing translations. As much as I appreciated my special dish, and service aside, I probably would not put them through the trouble of having me dine again. I don't believe the menu changes very often, definitely not every day as the name suggests, as it didn't seem particularly seasonal (for example, one of their two desserts featured pumpkin which, even though it's none of my business, I thought was weird for late June), nor much, if at all, different from my previous visits, and certainly not freshly printed.   Nonplussed? + Cash only (+ as in bring it)  + Very pleasant patio for those rare perfect days + ^ With friendly turtles, until turtle soup season (maybe next year) + BYOB + Capable and accommodating kitchen to make up for non-communicative server = Worth trying, especially if you don't have dietary restrictions, you have expendable cash, it's a nice day to spend with turtles and you want to provide your own Asti.  Hrm, the nonplussed point system might be my new method of expressing cynical optimism.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "b4ZbEEDbCPT6pVT4ImJU4w"
  },
  "ocmlI-ZUud6KUBGlMhtX9w": {
    "date": "1/26/2013",
    "text": "One of the best restaurant meals I've ever had. No kidding. If you visit Pittsburgh, you can't miss this unassuming but charming little place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sE1P9WDPQHqvwD_uEqubkA"
  },
  "9Za-14DSGYmXA-yymCBZ3w": {
    "date": "7/26/2010",
    "text": "4.5 star review. -.5 stars for service, decor, and cash only (boo)  The inside lacks charm and it was far too hot for my bf and me to make use of their lovely garden out back. Also, our waitress was not the friendliest...a little reserved, but to her credit, still attentive.  Now, with the bad stuff out of the way we can focus on the incredible food! We started with the potatoes with brie, mushrooms, and spinach. WOW. So rich and flavorful!  I had the roasted turkey flatbread for my meal. The turkey could have had a bit more flavor but the bread was delicious as was the cranberry mayo inside. Yum!  My bf got the salmon and raved about it.  Such a great stop for lunch, filling and satisfying!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "IXO16QdZK4WMvAxnuQ7CGQ"
  },
  "acEW-q-8FfOKn_CrdqlQTw": {
    "date": "8/19/2015",
    "text": "The BF and I were in Pittsburgh for a weekend getaway.  We wanted a nice Saturday night dinner, a bit off the beaten path (I wanted romantic).  We were immediately intrigued by the cash only, BYOB.  We felt confident the food would be good based on the reviews.  I called from the road trip to make the reservation (left a voice mail message).  The gentleman who called me back within an hour, was able to find a time for us.  Seating was outside in the most darling patio garden ever. So intimate. Remarkably, no bugs!  The food was really terrific. The service was outstanding.  Would absolutely go back here when we're back in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v0QQdOcKQeifc73Jxai5NQ"
  },
  "RbR5OKEtpWyORzGMcttMXQ": {
    "date": "6/25/2015",
    "text": "Dreaming of a delicious, fresh dinner on a romantic, candlelit outdoor patio?  This is the place for you.  I needed peace after a rough day at work and found this on Yelp. (Thanks to others for providing the photo of the patio.)  I adored the spinach appetizer.  The chef provided delicious, gratuitous roasted carrots with goat cheese that were wonderful.  The salmon dish was very good.  The accompanying salad had a special oak flavor that was wonderful.  I like oak in my wines, now I'll look for it in my salads.  BYOB and cash and you have yourself a special evening.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FR185HMzy8teOFnnQd1Y1w"
  },
  "jcDCGQ2XkovR4_AREYD9Fg": {
    "date": "11/8/2010",
    "text": "Highly suggested.   If you enjoy dining out, this is certainly a place you have to check out, if you haven't done so already. Nice ambiance, excellent plate presentations, and of course, the food is very well done too. Good service as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P2puXA9a2RB7gAKsY6yUqw"
  },
  "svmsWJ_j1hobQBYDBAJJBg": {
    "date": "6/29/2010",
    "text": "This place is adorable, with consistently very good food.  I've never had a bad meal here, unless you factor in terrible gnawing envy....I always desperately want to try everything on the menu that night.  It all looks and smells so good, and so unbelievably fresh.  This is delicious food made from good ingredients and without pretensions.  It's just about the best you can get in Pittsburgh, and truly reflects the local culture and atmosphere.  On two occasions the owner served as the waiter for my table.  Definitely can't beat that for care and quality.  My only two wishes for the place are this: one, that it were a tad larger (tough to get a seat some nights), and two, that there were better parking around.  It's impossible to find parking on the weekend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xqqrx0b1JNILmgwSwEy_bQ"
  },
  "vlfBhK3NujnH8BECjS2jSw": {
    "date": "11/3/2013",
    "text": "Had a fantastic dinner there. The meatball appetizer was amazingly flavorful and the San Marzano tomato sauce to top it off was the perfect compliment. The main course eggplant dish was served hot and was spiced perfectly. It was enough to split between the two of us.  It was our second visit. Loved it both times. BYOB can't be beat. My ONLY downside to the place is the ventilation. It doesn't exist. Be prepared that whatever you wear to the restaurant, you will be smelling on your clothes until they are laundered. In spite of all that.......a must go !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D0i-xf0HnoCTV7qfXXE9vQ"
  },
  "q15DEQvp0XFkqmI6ZqJPvg": {
    "date": "7/28/2015",
    "text": "Amazing food . Salmon was the best we had. Place was so good . Good place for a date and excellent food .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AEfM853JKk3-5gwY4tkWuQ"
  },
  "ptuqYqndwmGCUWYaWgS8pQ": {
    "date": "3/4/2013",
    "text": "Seriously? The crostini was a burnt hamburger bun that I could have topped myself with dry pork, Brie cheese and apple butter from the jar. Also... Not a whole lotta ventilation so I recommend going during the warm seasons so they can open the door and you can avoid having smoke in your eyes all night.... Just sayin'",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iXsNomUr1g1_TDd6boQmsg"
  },
  "-SGdIGUs6dO-2To49BEQNg": {
    "date": "7/24/2013",
    "text": "Best kept secret in Pittsburgh!  BYOB/cash only.  Tucked in the edge of Southside this open kitchen restaurant is quaint & intriguing.  Outside dining available.  Fabulous chicken,  pork & steak entrees. Must try spinach & peccornio dip- it's amaze! You won't be disappointed or go home hungry. Make a reservation!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RVEHv-qz44bIQPxR952EGg"
  },
  "iCaKTYtNrjVaR9dZLgpzsg": {
    "date": "2/15/2012",
    "text": "So much to say about this tiny little place!  First thing when you walk in, the kitchen is right next to you and smells AMAZING! You automatically know that your food will be fantastic. The next thing that happens is that you realize how freaking small the place is, but it doesn't feel too tight.  Our service was the perfect level of attentiveness, yet not overbearing. Our waitress was nice, but didn't intrude too much. She let us enjoy our Vday dinner together and gave great, polite service. I also honestly felt that the pace of the food was perfect. Sometimes you feel rushed because your entree comes out too quickly and you can't finish your starters, but not here! Hence, this is a nice place to sit and enjoy rather than gorge and get out.  So back to the main event: the food! I had some of the BEST spinach dip of my life. And they warmed the bread that came with it which was such a nice touch. The mushroom consume was enjoyable to both my boyfriend (who loves mushrooms) and me (who hates mushrooms) - figure that! Then, the waitress brought out two little crostinis with brie, baked apple stuff, and arugula on top - compliments of the chef :) I ordered the steak with gorgonzola butter on top and it was huge! The potatoes that came with it were average and the zucchini was weird, but then again, I'm not much of a zucchini fan anyway. My boyfriend's goat cheese stuffed chicken was sooo good and had plenty of cheese in it. Both dishes came with a side of perfectly heated fresh spinach - not cooked, just warm. So delightful!  Of course, the $2/stem fee and BYOB was awesome! Great price and so delightful to not get overcharged on wine!  The ONLY reason they didn't get that last star was for the ambience. If I'm paying $23/entree, I want the place to look a little cuter and not as much like a pittsburgh diner. Also, they should have at least changed the music to something more romantic on Valentine's Day than the alt. rock they were playing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "V0pP_PQnWdtyKpF-pifiaw"
  },
  "Z_QKGd_AAKcMInvibWJyPQ": {
    "date": "3/16/2014",
    "text": "One of the best dining experiences I have had in Pittsburgh!   The restaurant is very small, maybe 6 tables.  You definitely should make a reservation.  It is BYOB, so pick out some wine and head over! We went with another couple, which was great because we shared a few different things to start.  The spinach dip is out of this world!  The Camembert was also amazing.  Both came with a delicious loaf of warm bread.  We ordered a crepe that was filled with some cheese mixture and was amazing!  We didn't get a salad, but did see the table next to us ordered one and it looked great too!   Everyone also ordered a main dish and there was no food left on anyone's plate!  I had the eggplant, YUM!  (which still had the skin on it.  Not my favorite way to have eggplant, but I just cut the skin off and ate the rest.  Excellent!)   The only negative thing I have to say about this amazing little restaurant is that the forks were three prong forks.....which I cannot stand.  Just a preference.  We will definitely be going back in the spring/summer when we can sit outside on the patio! Looks romantic!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "qQRmnbKI84Up4a2MBFfaFg"
  },
  "Hag_MsMciN_s0_QYZrczJw": {
    "date": "9/23/2014",
    "text": "What a hidden gem in the South Side! Wonderful back patio area makes you feel like you've been whisked off to Italy. The eggplant rolls were beyond amazing. Sweet, personal service. Note: Cash only and BYOB.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qI9Cs3qi0EX8Ilv7RRySwQ"
  },
  "ky2T74-P8nHiMwlQlPCbIw": {
    "date": "5/31/2015",
    "text": "I was looking for a lovely dining experience without cutting a huge hole in pocket...and Cafe Du Jour gave me just that...the server was polite and very helpful with the menu...he seated is outside and on few occasions when it rained was prompt and kind enough to switch our tables back and forth...the food was delicious...lot of flavor and very well cooked and beautifully presented...it was a memorable night and I certainly see myself coming back to this place again and again...!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x5QkLyXya3hte1fhyRuDjQ"
  },
  "blLYQ7TrH-GYblFHlTC75A": {
    "date": "3/4/2012",
    "text": "I've been here multiple times since my review a few years ago, and I am reviewing to reaffirm my commitment to 5 stars.  I've brought several friends through here over the years, and it's quickly become one of their favorite hidden gems in the city.  It's also cash only, and BYOB, so plan accordingly.    CdJ is small in the summer, and tiny in the winter...maybe 15 tables in the whole place.  The back patio reminds me of a dining spot in Paris; if you make reservations, and you definitely should on the weekends, request the back patio if you can.  You will love it, I promise.  I haven't had a bad meal here yet.  I truthfully haven't had anything that completely knocked my socks off, but everything is really good, really well executed, and the menu changes often.  If you haven't been here yet, I implore you to check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "-dV2GaHNJHhDYbrmu48ZDQ"
  },
  "HSx3onKBqALiTV0OhNK2Ng": {
    "date": "8/9/2014",
    "text": "Fantastic birthday candlelight dinner at Cafe du Jour. The appetizers were just as good if not better than the entree. My boyfriend claims they're the best appetizers in Pittsburgh. It's a very low-key restaurant that sticks to the basics and focuses on the quality of food. That's what it should be about.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ipz7qG_Pihbbi41XHd15Bw"
  },
  "juPB3evi5Mb-MDzgkoC6pA": {
    "date": "6/8/2014",
    "text": "Absolutely fantastic and the setting to support such an experience.  My gf and I sat outside on the back patio for dinner on a beautiful saturday night and enjoyed a fresh and extremely reasonable french restaurant.  The spinach dip with warm french baguette was such a homerun, the best spinach dip ive ever had and a warm toasted baguette to go with it.  Mushroom Consumme was a great light soup to have before entree and then I had a Brown Sugar and Mustard glazed Pork Chop.  This was just perfect, not to sweet, but extremely flavorful.  Girlfriend had their salmon which was very well seasoned and fresh.  We will be back sooner than later, BYOB is also great at $2 per person.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xOFo9YVXgOb4QBRJsyKQwA"
  },
  "itNsCP2fx35bnYw1wOXDgA": {
    "date": "10/25/2013",
    "text": "Although I have been to Cafe du Jour before, it has been awhile. So, while looking for a BYOB to celebrate a recent engagement within our close group of friends we decided to go with CdJ. Immediately upon arrival, I remembered my previous issue with this restaurant. Ventilation. My eyes are very sensitive and water/burn when there is smoke in the air. The front door was opened so, the smoke wasn't bad today. However, it did become more smokey as the night went on.  Our party of 6 sat at one of about 5 tables in the restaurant. As I was in the middle of my toast to congratulate the happy couple, our waiter came over, interrupted and told us the soup of the day. He really ruined the mood and the flow of my toast which I had worked on for days. We were off to a bad start. Then we waited and waited for him to come back and take our order. In the mean time, I tried to make eye contact to let him know we were waiting. When I looked around the room, I saw him take a cigarette out of his apron and walk outside. So, we waited longer. After he came back in the restaurant, smoke still being exhaled out of his lungs, he came right over to take our order. Not much for hygiene I suppose. Oh well, we were starving by that time. We ordered two appetizers for the table- pork crustini and the meatballs. The crustini was interesting. I loved how the smoothness of the brie was accented by the apple jam/chutney on top. I would have loved a little more of the jam. The meatballs were also a big hit.  For my entree, I went with the glazed pork with roasted potatoes and a slaw of veggies with a yogurt dressing. The pork was cooked to perfection. Juicy, tender and tasty. Why can't I get pork to taste like this? I guess that's why I don't have my own restaurant (among other reasons). The potatoes were delicious but, the raw veggies did not pair well for me. I would have preferred a cooked vegetable, something green with a little bitterness to it. Overall, we all had a good time and thoroughly enjoyed the food. The reason for four stars was the issue we had with the service and ventilation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ftUrNSpxUr8eWCyOlsZVgg"
  },
  "4LSkmNOg-XleED-gweGVjg": {
    "date": "5/17/2012",
    "text": "I had been wanting to go her for quite a while, and was extremely pleased.  It is definitely one of the best places to eat in the Southside.  I sat outside in a group of 5, and the atmosphere was quaint and enjoyable.  The wait staff was very friendly as well as the chefs, and did a great job of making us feel comfortable.  Sitting outside on a nice evening in the summer can't be beat, so the small patio here was perfect for our meal.  I ordered the special for an entree, and I highly recommend the crostini appetizer - definitely unique as far as crostini goes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WpttB8iiCRjWNmkFa9LF0Q"
  },
  "Hr-HN2tSiAe_6JL8saft2g": {
    "date": "2/20/2016",
    "text": "Very exceptional food & service at affordable prices in a quirky & cozy environment. Def need better ventilation inside but it's manageable. Can't wait for warmer weather to eat here again outside.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nubi2Lci2UD_BDyduIbJew"
  },
  "IRJWzhOklb1_LVGRAkvgOQ": {
    "date": "10/1/2011",
    "text": "I feel bad about giving this place 3 stars, and it's probably closer to a 3.5 (damn you Yelp for not allowing me to provide more nuanced ratings!).  But the reality is, it's a place that I thought was fine, would be happy to go back to, but probably not go out of my way to go back to and probably would not be somewhere I personally would propose.  That is, I would go there if someone else suggested it, but I probably wouldn't suggest it myself.  Service here is very nice - they aren't stuffy and it seems more like a neighborhood place than an outright restaurant.  Closest comparison point might be Girasole in Shadyside in terms of ambiance.  Alas, also in terms of noise level - this place can get loud, even when it's not particularly full.  It's also definitely got a neighborhood feel - when I walked in, there was a group of older women who were congregating for some sort of get together, and a family with a young child.  That is to say, other than the kid, my friend and I were probably the youngest people there for a long while.  I think the young professionals didn't start showing up until around 8:30ish.  I don't mean to say this in a evaluative way - it's just information for you to get a sense of who goes there and when.  The food was somewhat hit or miss.  The spinach and cheese dip was delicious, and I will say that the shrimp small plate was divine.  Perfectly cooked shrimp on rosemary skewers in a tomato based sauce with buttered crusty bread... absolutely awesome.  But the pork crostini with brie was not my favorite - the pork was tasteless and somewhat dry.  My friend had the mushroom soup and a house salad, neither of which seemed particularly inspired.  Perhaps we went wrong by not ordering one of the main entrees.  So, I grant you that perhaps we should give it another try.  But, given my aversion to the South Side, a place has to be pretty amazing for me to brave the traffic and craziness of Carson St., and this didn't cut it.  But, I don't regret having tried it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ckMFtaljrmXWaSiQqk9ZWA"
  },
  "3pJ_3ZGn1OCtcMsS4Z0jgw": {
    "date": "8/16/2011",
    "text": "This is my favorite restaurant in all of Pittsburgh. I love Cafe du Jour because it is the perfect mix of well done and rough around the edges. The restaurant itself is very tiny seating maybe 20 people. The first things to great you as you walk in the door are the aromas coming from the kitchen which is located in the front corner of the restaurant and open to the whole dining room. I think this may be my favorite thing about the restaurant.  As the chefs masterfully create meals in the open kitchen the restaurant slightly fills with smoke and aromas, and the hum of the dining room mixes with the mixes with the commotion of the kitchen to give the entire place an energy. The food has always been spot on, my favorite dish being the clams in tomato sauce appetizer (one of the best things I've eaten.)   The restaurant is BYOB and cash only. Generally a dinner for two with corkage fee, a starter, and two entres runs me about $60-70 plus tip. I recommend making reservations as the restaurant is tiny and fills up fast. They are not open on Monday.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "DOajn8AtMjNtCZ87YoIlwA"
  },
  "EKJgGiqmI5BcZqxF_PDDmA": {
    "date": "4/21/2010",
    "text": "The bright and shiny spot of Pittsburgh dining.   Wide range of inventive sandwiches, salads, light entrees and espresso. Cozy interior and a back patio reminiscent of the French Quarter. Friendly and intimate.   We ordered:  House salad with sprouted lentils - generous portion and the sprouted legumes made life a little less ordinary.  Soup du jour of beef and vegetable served with herbed aioli - my companion couldn't believe how much the aioli enhanced the broth and there were big chunks of beef in the soup.  Roast pork sandwich served on flatbread with apricot chutney, chili slaw, tomatoes and red onions - I really can't describe how good this sandwich was. It was sweet, it was spicy, it was perfect. I could eat another one right now. The meat was thin and perfectly cooked. I'm not a fan of macaroni salad, but the sandwich also came with an upscale version that had lentils and capers in it.   Eat here. Get the pork sandwich. Use the bathroom (quaint and papered in twall - sorry boys, you'll have to ask a lady friend about that one...) And watch out for pidgin poop if sitting outside, but that's the price of a little fresh air, wee?",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mqu5HagAkSFFHMKp7UbttQ",
        "caption": "Photo of Cafe Du Jour - Pittsburgh, PA, United States. Roast pork sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mqu5HagAkSFFHMKp7UbttQ/o.jpg"
      }
    ],
    "user_id": "s0RVo61WRbxpPAAGl3zSzg"
  },
  "kpwwyhG-4BmPCFrBshRjkA": {
    "date": "5/1/2011",
    "text": "There needs to be more BYOB's in Pittsburgh, just saying! There is something about going out for a long dinner with friends and finishing (3 big) bottles of wine that warms my antioxidant rich heart!   I have tried to go here a couple times before but couldn't get a reservation.  There are soo many quaint restaurants like this in Philly and I miss them in the burgh (there is even an interactive BYOB map with the closest liquor stores listed).   I went with a man-friend, and the waiter (Matt) was really patient with us because we were taking forever to order.  The menu was interesting but not too over the top so simple palettes aren't overwhelmed.   Friendly, Cute, French, Cozy. Perfect.   We started which the spinach dip. Delish. I ordered the scallops which was a smaller portion but hit the spot! My friend ordered the salmon which was also delicious. I had a bite of that and I might get that next time!   I am going to be honest, We might have drank a huge bottle of wine during the meal and stayed to close.  We left smiling (with purple stained teeth) and full.   Pro: Cozy, Outdoor seating (although it was closed), BYOB! BYOB! Delicious food, friendly service, good noise level, BYOB, open kitchen  Con: Can be tough to get a res (but thats because its awesome), limited indoor seating, stem charge, cash only  Overall: Check it out! Great date spot!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "IKnLl7SbuP0u6HS34jwHhw"
  },
  "y826FyNeLbHDez39Rra1DA": {
    "date": "9/11/2014",
    "text": "Noted this and a couple others on this funky but great street in (uptown?...South side?) Pittsburgh.  Decided on this one based on quiet atmosphere and good menu.  Very nice owner and great selections - sit on the back patio!  Had smoked salmon salad and a gazpacho with smoked pepper spiciness to it.  Just enough kick.  My wife had a mushroom soup as we split the salad.  Enjoyed it all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rwm2S_R5kUjbao2w_0cq_A"
  },
  "YP8K_GhiE4IBg5zpg88jqQ": {
    "date": "1/26/2014",
    "text": "This place is awesome!! The food is fantastic. It's also great because it's a high end restaurant with BYOB (aka you don't spend a fortune on wine). The eggplant dish is a MUST. My only complaint would be that the tables are pretty close together cuz it's a small place. But I'm definitely going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BUfIaj-LF6s2mdNl3ER-XQ"
  },
  "yxlV7B9fq2HPF9n8gNPv9Q": {
    "date": "2/19/2013",
    "text": "Sadly, when I think Southside, I'm like the masses who think of a bunch of drunk college kids puking their guts out at 2AM.  What I don't think about is a small little restaurant with upscale food and a laid-back vibe.  This place totally flies under the radar, and it definitely this aspect that makes me like this place so much.  Everything you'll enjoy about this place is completely unexpected (or maybe less so now that I'm telling you!).    When you walk in, you'll notice a small cafe vibe with this surprisingly European like feel: 10 or so small tables are located in the back.  The decoration is somewhat nondescript (we sat next to a refrigerator proudly displaying the \"Coke\" logo).  What is cool is the fact that the food is literally prepared next to you behind this counter.   The service is among the best I have experienced in this city.  The hallmark of a good waiter is one who anticipates your needs.  For instance, on Valentine's day when I went, I ordered a small cup of soup, and the server was insightful enough to bring out two spoons.  I know, a little detail, but one that matters and makes my experience that much better.  Speaking of the food: out of this world.  The menu options are somewhat limited, but I can tell they must change, as do their specials.  There will be a vegetarian option waiting for you.  We started our meal out with bruschetta that came with creamy cheese-spinach sauce with plenty of cubed-seasoned tomatoes: so rich, so creamy, so so good.  The bruchetta was also crisp and warm-simply perfect.  The mushroom soup we shared was full of 4 different types of musrhooms: oyster, shitake, portobello and porcini.  My entree was the eggplant dish: baked eggplant with this sweet pepper sauce, some cheese and...really, I don't know what else but other than the fact it left this little ting in my mouth which when combined with the sweetness of the sauce made for an incredible experience.  My girlfriend enjoyed her salmon dish.  We capped off the meal with chocolate mousse which was simply decadent.    Several other things to note prior to dining here.  1.) Make reservations and make them in advance.  2.) Don't come here expecting full privacy.  Tables are jam packed next to each other.  We definitely had a neighboring couple interrupt us in our conversation since they over-heard something we were talking about that must have appealed them.  Luckily for us, this interaction proved to be quite pleasant and added to our experience, but just a heads up for the rest of you..3.) Cash only, so go to the ATM.  3 course meal for 2 will run you around $80, which certainly isn't bad given the high quality of the food and 4.) BYOB so definitely bring something to complement the fantastic flavor of the food that you are about to enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "32M_2x0IzeIxcJucQp6BOw"
  },
  "1xom4Z3m-8DArkLD3UXkzg": {
    "date": "1/6/2011",
    "text": "This is the cutest, quaintest restaurant in Pittsburgh! A must for a romantic evening. It's incredibly small so you will always need a reservation. In the summer they have a beautiful outdoor seating area that's filled with greenery and a fountain. Along with the great atmosphere comes great food! They change their menu often but have a variety of French inspired dishes to choose from. The eggplant is fabulous, so try that if you have the option..",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "FevUjV3uh6_f52aWOSEvKg": {
    "date": "7/7/2013",
    "text": "I have been going to this restaurant since the beginning.  The chef/owner Paul Krawiecw, makes some of the best food in the city.  When you factor in that his prices are far lower than some of the fancy restaurants, it is a no-brainer.   This guy gets it done.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "R5L0WF6_P1sq1RADTS0fnw"
  },
  "zhCYjFpSEBZ4yslaxnaMYg": {
    "date": "7/17/2014",
    "text": "Food is awesome - some real talent ... kind of small seating area - cute but sometimes tough to get a seat - make reservations!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V7GWxLXa8Iqc4Qu2dJn1XA"
  }
}