{
  "vRsAVxSdj3CJyNHMfmXOCw": {
    "date": "11/25/2013",
    "text": "I was hesitant to go back to this place as I had been years ago and it was your typical dive bar. Well I was pleasantly surprised as Redbeards has def. been upgraded. The dining area was really nice and we were seated in an outside tent that was heated in fact our table was right next to the fireplace.  The had a great variety of draft and bottled beers. I went with the Wild Blue (blueberry ale) and  Sunset Wheat.  The menu had a nice variety from burgers to wraps and flatbreads. My date ordered a burger which was huge and looked tasty. I went with the buffalo chicken wrap and it was one of the best I have had. We both had the homemade chips as our side but the fries looked good. The service was quick too. Great place to go to watch a game.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bu1mtWwxuayzV6b3VScWLw"
  },
  "5bFhAOm592JM3_PdxGukeg": {
    "date": "4/12/2013",
    "text": "Redbeards was a brief stop for us in an overall brief trip to Pittsburgh. We were in the mood for a quick bite, nothing too fancy on our way to a show. We weren't in a hurry per se, but we did arrive with about an hour and a half to dine, so maybe Redbeards wasn't the best choice. Our waitress was scatter brained. Normally I would just think it was an off night, but due to the way another waitress kept coming to our table to make sure we were helped, I think that this is an overall state of mind for her. She was nice, don't get me wrong, but it was a little laughable.  Food was really good. We went with two salads, the firecracker shrimp and fried pickles. Being out of town is the only excuse for so much fried food in one weekend. The fried pickles were pickle spears, which I've never had before but I liked them that way! The more pickle the better for me. The shrimp were decent too but were nothing more than shrimp fried with buffalo sauce and some ranch on the side.   Overall the experience was pretty good and this would be the kinda bar I would hang out at home: pretty low key setting with lots of booze flowing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3wDRFdjpeq36Es97Zj2iVw"
  },
  "6Pcng3FtS6VjCOtKUhFJNg": {
    "date": "3/4/2015",
    "text": "We absolutely LOVE the wings at Redbeards! They are quick, hot, and fresh every time. And, the wait staff are friendly and wonderful. This is a great place to watch a game or enjoy a night out with friends. Check it out next time you are on Mt. Washington.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "KAsmY6WCUWRYQXE_50AkQA"
  },
  "idXfhnALjXFzP7oj-ypYtA": {
    "date": "1/9/2015",
    "text": "There is something about this place. It has numerous specials on a daily basis. They have great wings. If you are going to see the Pens play then this is a spot. They have a great staff.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xyoHoT8K8TGkPG8-RQGgng"
  },
  "oMtMNdmkUkE9t9xUSfHj1A": {
    "date": "11/2/2015",
    "text": "The bf lives in Mt Washington so we end up being regulars here. Especially for their all you can eat wing night on Wednesday. I'm a bigger fan of the bottomless chips than the wings, but the bf will order their dry rub ranch pretty much every time we go. They definitely make a great burger, and i enjoy them even more now they come on plates instead of baskets. Even the fish choices are surprisingly good for the bar ambiance: the fish and chips are a good staple, and I'd also recommend the crab cakes. The buffalo chicken dip with warm pita we just ordered, and I'll definitely be ordering that as often as possible in future. The inside is a little loud and close quarters for me on busy days; I'd much rather sit in their outside area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3KyEWPR377EO5Gfyi3uz0A"
  },
  "Ot47xTecX2lR5QrSq983Ag": {
    "date": "12/21/2015",
    "text": "Really good fish and chips,decent service,and some good beers on tap. I also enjoyed the environment as well, will definitely go here again next time I'm in Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "31ibdOJRa3JS_Nv22Ic_YA"
  },
  "uoL0HBaPDNl-aS18QDovBQ": {
    "date": "8/27/2015",
    "text": "Great bartender/servers.  Very clean environment.   Nice decor.   Welcoming and fast paced lunch.   I had a grilled chicken sandwich.   Very good.  Nice big piece of chicken.  Not processed.  Like grandma would make for you.  Good fries.   All around decent experience.  Would recommend to friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qqgTHckDe8FPsnDKgIZaBQ"
  },
  "Efro3RNLaLmPikfdO_N2BA": {
    "date": "11/4/2014",
    "text": "Redbeard's is a solid bar/restaurant on Mt. Washington. It offers up consistently good American bar food and is usually packed for any Pittsburgh sports game. They have unbeatable weeknight specials on drinks and food and the atmosphere is friendly and fun. The outdoor seating is wonderful for the summer, so if you want a laid back atmosphere, make sure you check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "I_oxL1fLfT-tf2UMhh4ZYg"
  },
  "0yH1A4f7zKsC2wyOZba8yg": {
    "date": "8/6/2015",
    "text": "We came here for my birthday! We were greeted respectfully, and the manager even shook my hand. Courtesy and kindness two thumbs up. We will all be back for your specials during the week. I can't wait! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SeWLddwE5dnMcUqjG1JmiQ"
  },
  "0Yr1-yPYA010wDaUz4yBkw": {
    "date": "7/13/2012",
    "text": "After riding up the incline and taking some pictures of the beautiful Pittsburgh skyline, I walked over to Redbeard's to grab some grub. I wasn't overly hungry, but when I noticed the deep-fried dill pickles on the menu, I knew I had to try them. I've eaten various appetizers like this before, but they were always sliced pickles. Not here. You're getting the whole spear, which I thought was much better. Add a couple of pints of Dogfish 60 min IPA, the NL beating up on the AL in the All-Star game and baseball debate with gentlemen at the bar and I had myself a very enjoyable evening.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8FYKcHg03UU3djGO-ei92g",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Deep-fried pickles",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8FYKcHg03UU3djGO-ei92g/o.jpg"
      }
    ],
    "user_id": "t2LoCqGXkr5mPtu2a336SA"
  },
  "r7EoY2VmVlikhRYnW_iZcA": {
    "date": "9/14/2015",
    "text": "Love coming to Redbeards! One of my favorite appetizers  is the seared tuna. Crab Mac n cheese is awesome also. Pat the bartender makes my drink perfect and Chris the server is always a pleasure to have for a server. The patio is awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-GMLsazYLquHRMIGeOy5jA"
  },
  "8f-_DP3-SgEq8nvMJ6jZ5Q": {
    "date": "8/30/2014",
    "text": "I used to come here all the time when I lived in Mt Washington and almost everything I've had was great--this was also a few years ago. I hadn't been there in about two years but my boyfriend and I stopped in last Tuesday for dinner and a beer. We sat outside, they recently redid their patio and it's great. They now have a bar outside and almost every table is shaded by an umbrella which is great. I got a para dish called something along the lines of bruschetta chicken pasta, it was amazing. And the portion was huge. I had plenty of leftovers for the next day. The boyfriend had his usual cheeseburger, with onion straws on it and some type of wing sauce and he said it was awesome too. The service was great as well and our food came out quickly. I had a pumpkin beer complete with the cinnamon sugar rim and Drew had a dog fish head 60 minute. They also have a decent list of mixed drinks that sounded pretty tempting as well. Go here!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8kBunIhXZckr8RworTuK-g",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8kBunIhXZckr8RworTuK-g/o.jpg"
      },
      {
        "img_id": "koLjOSKUpj9QSaNuIbE50A",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/koLjOSKUpj9QSaNuIbE50A/o.jpg"
      }
    ],
    "user_id": "P-liOdEt4GuKWzB8zPEIEg"
  },
  "K6TuB1LkyJqAIeaqWZ9KDQ": {
    "date": "5/16/2012",
    "text": "Redbeards is the best bar in Mount Washington. It is modern, clean, and has fantastic food specials each day of the week.  They have a good selection of beers and reasonable well drinks.  Their interior is relatively spacious and they have a nice patio allowing customers to wine and dine outside.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "MZuvl0oUK3QSv7faGx9i5w"
  },
  "HYVl7ItvW1wbHbW80nWrbw": {
    "date": "3/19/2016",
    "text": "The sandwiches are very tasty and delicious but at the same time my friend ordered a house salad and out came brown lettuce, one tomato, one cucumber, and the smallest pepper.  When my friend asked about the salad and asked about more vegetables, our waitress walked in the back and got the manager.  The manager came out and his response to the sad salad was \"that's our portion size.\"  He didn't offer to bring more vegetables, didn't offer to correct the situation.  All of our drinks were poorly made and very little alcohol.  We were highly advised to come to this place since we are out of towners and were instantly disappointed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wQMAPG46OC1sPM5cPcQyBA"
  },
  "XMtty7135DJlXITCKGZFdA": {
    "date": "10/11/2010",
    "text": "Cool little Pittsburgh spot at the top of Mt. Washington.  Park your car, walk along Grandview enjoying the view, and stop here for a cold one (alternately, to watch the game).   Decent food, great service, and great prices.   A friend who is a born and bred Yinzer (spelling?) says to me, \"this is actually classy for Pittsburgh.\"   I have nothing to compare it to -- but I had a great time and I think you will too.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ylnlAS9bCbxEcPRfxuhJCQ"
  },
  "43KOL3FfYGeUGM8VWP7MOA": {
    "date": "8/2/2015",
    "text": "Super good food and lots s of tv's. More importantly they have lots of beers on tap. Overall success!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QAu8AKKP3IePBFfPmHXdIg"
  },
  "bzOMOJAu81rP0DjfXXjo2g": {
    "date": "4/2/2015",
    "text": "I've been here a number of times, and each time the food and service have both been great. I really enjoy their wings in particular, and they have some excellent Pittsburgh sports-themed drinks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fqYMho4PNOEabQJApWmQXw"
  },
  "Fgcp-ITD86vDZGXs66ol_w": {
    "date": "9/1/2013",
    "text": "If this place could manage to NOT overcook shrimp, it's an easy 5 star. We go for the crablegs and you totally should too. They are cooked PERFECTLY EVERY TIME and piping hot. They don't slouch either, they keep 'em coming. We went for the all you can eat shrimp once, and every single piece was overcooked and chewy. Bummer. But hey, we ate them anyway; we were drunk, and hungry.   We've gone back for other food many times and ordered the shrimp appetizer twice now, and it's always overcooked too. Whatever. Now I know what not to order. That's the only bad thing I can say about this place.  The staff is friendly, the crablegs are awesome, the crablegs are good, and did I mention the crablegs? Would I come here just to drink...no. Too pricey just to sit and get bombed, but I will order a drink or two with dinner. They make a mean bloody mary and a damn good white russian. The appetizers are delicious (not the shrimp) and the desserts are pretty bangin' too. You can't go wrong with AYCE crablegs, and they never seem to be too busy on those days...I don't know why, but hey, more for me!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "8aqeLmE0nS7BFrxTm5B4GA"
  },
  "VxBKETwAdFIN4CdNkdf8YQ": {
    "date": "6/5/2012",
    "text": "Anyone who has ever been to Redbeard's knows that it will never be a five star gourmet eatery.   Nor does it pretend to be.   Instead, Redbeard's seems to bridge a weird divide of modern style and the unrepentant proletariat with something bordering on the urbane. It's barely perceptible, but it's there.  And it seems to work.  The menu here seems to be a compendium of all the items from every other bar you've ever entered, all congealed into one convenient list of options. Standard bar fare, True, but there's such a variety available it seems to somehow enhance the perception of its quality. And for a busy place, the service is commendable.  So, come here for a late night jaunt, a kickass burger or maybe just because your cardiologist hasn't seen you in awhile.   But whatever you do, give this place a go.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TwqV39eXyRrOtzEwdcCuVA"
  },
  "GqMDFuLvUMBjP74PynzQ0g": {
    "date": "11/22/2014",
    "text": "Great food and Service.  Ride up to the restaurant was incredible. Must go!! The all you can eat wings were great! The wait staff was very helpful in selecting great sauces.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjBEmdQghUeY4qh_VyG5fw"
  },
  "_MD7N3HIO86L7Lb3JOo9cw": {
    "date": "9/17/2016",
    "text": "I've been here a few times and never wrote a review! Decent hometown bar/restaurant. Every time I've eaten here the food and service was great! Tonight we had two friends with us from out of town. Our bartender was Amanda according to our receipt. She was very friendly and on top of everything. There was another guy bartender, shaved head, we've seen him there before. They were both very attentive and always keeping busy cleaning or stocking if they weren't refilling drinks or tending to service well. Kudos fellow bartenders! They, as well as the manager were also sure that there was always a game or something on TV. The DJ was great! I wasn't expecting him to be so good! I was always really impressed that the manager offered to put my leftovers, that weren't even from there, on ice! Very thoughtful! Get it red beards!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xb9-sVUs7gDjDrnRNPSyag"
  },
  "OCmmY4JAf2QqzYCfjedUjQ": {
    "date": "10/2/2016",
    "text": "I love their food! The chicken fingers are awesome.  The French fries remind me of potato patch French fries. If it's nice out- eat outside! The porch seating is so nice at night!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BDggI8qMnjuY-9IUFMT6Bw"
  },
  "xlO8VYf-dQzv1nn1lPih7A": {
    "date": "10/14/2017",
    "text": "Food is pretty good, definitely overpriced for what you get. A Ruben and sweet potato fries was $15 and they give you like 8 fries. Definitely recommend going to Bigham Tavern or Twelve if you're in the mood for American food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QOUUYwHua3us3exZLOtRRw"
  },
  "pY4tnc7W0yz1R3E9AIRD8w": {
    "date": "11/4/2017",
    "text": "Great food, but Kristina could take a hike.   We are paying customers and we're treated like trash.   I won't let her bring down the whole place though... if you don't like where you are, leave.   All my best, Will Belsterling.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P_oQZ2zAWCGk12wUtS7MIg"
  },
  "nyBO4BU8_EWDNnG4njTVBw": {
    "date": "5/26/2016",
    "text": "I've been to Redbeards a few times and the food has always been pretty good. We've had different servers, some have been excellent, some average.     I have dealt with the management on 2 occasions and they have been a nightmare. After the most recent experience, we will not be returning. There were 6 in our party and we were offered a booth that would typically seat 4. We asked for a bigger table as there were several open larger tables and were seated at a 4 top. When we asked the server to be seated at one of the open larger tables we were told that they were saving those tables in case people came in to watch the Hockey game, Which didn't start for 2 hours. We told the waitress that unless we were given an appropriately sized table we would be leaving and she got the manager. He was very rude and reluctantly sat us at a larger table. We ordered and the food was decent and arrived in an appropriate amount of time. Also, none of the larger tables had been occupied yet when we were leaving.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KBHwzZlGw0PV8Uhm7AKKuQ"
  },
  "_ozh_VVz5ceQdV0KEmNNYQ": {
    "date": "10/22/2016",
    "text": "Have to ask for Penguins game in a Pittsburgh \"sports bar \"!!!!!!! Have asked game is going on and we are watching 9 screens of college football. Wow just put it on 2 screens in corners of the bar !!  Already missed the first goal. A sports bar give me a break ????",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HeOM2aMIMSqg836ZH8tDug"
  },
  "Z5fEsbpz_5ElRuG468UbnA": {
    "date": "5/27/2012",
    "text": "Kay was craving BBQ, but I couldn't find a BBQ place in the South Hills we hadn't been to yet that was open this past Sunday evening. We came very close to going to Shiloh Grill, but at the last minute, we decided on Redbeard's.   Alas, Redbeard's doesn't have much of that sort of thing on their menu aside from a pulled pork sandwich that Kay ordered. Nonetheless, after a sweaty day of housework, we sat down in this boisterous bar and grill for some so-so eats.  The Shrimp Jammers were our chosen starter. Filled with Monterery Jack cheese somehow, the shrimp is then encased in breading and deep-fried. Each one was so ooey-gooey that the cheese overtook the flavor and texture of the shrimp. While not terrible, the Shrimp Jammers certainly wouldn't warrant a repeat order on my end.  If I had just ordered a cup of the chili and the french fries, Redbeard's would get an easy 4 stars. The chili came very close to being as good as my beloved mom's own, which still stands as my personal favorite. I barely detected beans; a positive trait to my tastes. The ground meat was abundant. The broth itself was thick and had just enough sting to it. Our meal was nearly redeemed by this and the golden, crisp, above average french fries.   The medium-rare burger was dry, came off more like a well-done, and the numerous fixings did little to improve on it. This wasn't an abysmal burger but merely a step above edible.   No desserts were on tap. The nearby ice cream parlor got our dollars instead. A review will be up soon.   Service-wise, things were off-kilter. Our waitress kept forgetting to bring Kay a straw for her iced tea and seemed \"inconvenienced\" by our presence and requests. She also didn't remember to bring Kay's salad to the table until the main course was ready. Thus she became the rare recipient of a tip from me that was below 20%.  Ya think we shoulda hit my first choice in Shiloh Grill? I'm thinking so.",
    "rating": 3,
    "rated": {
      "funny": 7,
      "useful": 14,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "_w8qWDX0UIGB7qlwdjTnyg",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Interiors",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_w8qWDX0UIGB7qlwdjTnyg/o.jpg"
      },
      {
        "img_id": "bxclQKMXhsb_oGZUPPciQw",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Shrimp jammers",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bxclQKMXhsb_oGZUPPciQw/o.jpg"
      },
      {
        "img_id": "Qwb0Kqs95HfRrgMB-cdaIw",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Damn good chili.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Qwb0Kqs95HfRrgMB-cdaIw/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "7eyml6oKAi8ccc2F0-V5Zw": {
    "date": "11/28/2015",
    "text": "As a local that is here a lot because it's within walking distance, I'm never disappointed. Great food, drinks and staff!  Always a recommendation!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FLrnqi48Rn_bnywMkWMR9Q"
  },
  "xsGc2fA83blFzxCu1jy93A": {
    "date": "3/19/2014",
    "text": "Why do I hate Redbear's? Let me count the ways. If you aren't a pretty lady, the bartenders aren't interested. Not for small talk, a menu  not for info on the food, not for info on a drink or beer, or for that matter, I couldn't even get the bartender's attention to pay my bill. But you can bet I had his attention when I left him 17 cents for a tip. My bar bill was $9.83 and I gave him a two fives, and I looked at him and said keep the change. If looks could kill I'd be down the street at Slater's Funeral Home.   The food? Meh, I've had better, why this place does such a rockin business I'll never know. Stay out after say dinner service is finished as the clientele becomes, shall I just say....shady. There are much better places to spend your hard earned money.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "UsmTxWbobLsI6WR1Db0W7A"
  },
  "_DgZS8i6mPO2e6G60JsGSA": {
    "date": "7/27/2015",
    "text": "Great atmosphere, excellent service, plenty of parking across the street. Variety selection of alcoholic beverages and Food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TY7Q3ZPY2HCNX_FPAn9ebw",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. A twist with Asian flavor&amp;#39;s",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TY7Q3ZPY2HCNX_FPAn9ebw/o.jpg"
      },
      {
        "img_id": "899W4e_5j00tHqWHbHZbzQ",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Wings were probably done with a homemade Ranch -",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/899W4e_5j00tHqWHbHZbzQ/o.jpg"
      }
    ],
    "user_id": "BZimiECHmnjTwaSvo08Meg"
  },
  "J9bzkzF_Ih-gA3a6ZU8bJw": {
    "date": "3/14/2017",
    "text": "WORST EVER!!! Not only was the bartender the most rude and ignorant person I've ever encountered in a business. She literally steals my phone from my hand and erases my video recording of her insults and poor attitude and customer service. My proof of how I was being treated! She was throwing verbal insults to me and 2 other people. I was confused and hurt by the level of ignorance that I pulled out my phone to record. Next thing I remember, the female bartender comes from behind the bar and literally smacks the phone out of my hand, steals it and deletes the video I recorded!!! Some man posing as a security guard steps in guarding her & I from grabbing my phone back! She's hiding behind him with my phone in hand so I don't get to her while she's erasing! I finally get my phone back, looks in my phone to see video gone! She then she proceeds to call me names and kicks me and 2 others out! I'm outside, the same bartender and the guard was basically taunting me through the window, sticking out their tongue, dabbing. It was the upmost ridiculous and disrespectful situation I've ever encountered from a business. I'd never want anyone to be treated this way! Find somewhere else to go.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9FQtArVxqU3gn-izK1NOA"
  },
  "av8F-Sv46OGj362vhpcIRw": {
    "date": "9/8/2017",
    "text": "This is one of my regular/favorite spots to go. It's always a great crowd. Plus, their customer service is great! The only thing that disappoints me about this place is they cancelled the all you can eat crab legs on Mondays. :(",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rjhe_wNOFb9pU2Yi7kGiNQ"
  },
  "67s2R4B19F8vlx1ABdfqng": {
    "date": "2/20/2016",
    "text": "So bad!!!!  I went with my wife and she ordered the meat well done. It came bleeding! She asked the boy to change it and he said we would have to pay the whole hamburger again to have it \"well done\"!   He was rude to us just because we are not from the country, I noticed that look since we asked for a table. He was not pleased with us...but had no excuse to kick us out. They have to learn how to treat tourists and foreigners in a better way, our money is as valuable as pittsburghers money.   Very bad service, worse management!  I would not recommend it and of course: I am not going back there in my whole life!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "khpGpT0IYj7NVhCeJ7om5w"
  },
  "SuK6jrMDhojxakpdAmUD0g": {
    "date": "8/27/2017",
    "text": "The atmosphere is excellent as are the waitresses. The sandwiches were delicious, especially the tuscan chicken.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FVa4x7nYVXNFpes9q053iQ"
  },
  "W11MvQAZUvI-wf0Z_y-KLw": {
    "date": "2/13/2017",
    "text": "Terrible service and terrible food.  Expensive and an african american female at the bar with a horrible attitude.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rujQNKyR7OdgW15wtshNcg"
  },
  "LdwY7QaQ5qZhNNPDWpPEjg": {
    "date": "8/9/2016",
    "text": "I was visiting from San Diego and staying around the corner for 3 nights and went to Redbeard's with my family and relatives every day. Nice atmosphere, great service, cool sports memorabilia, good food and drinks. The manager was super nice and the staff dealt with our party of 12+ like pros. I would give it a 5 but the music was just too loud to relax at times but I am 40 something, so no surprise. Sit in the back room if you want a more quiet place to relax.  Yinz are doin a great job!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pT_2yxjkWj4VbPncnZGoxA"
  },
  "ORxqY85buCbJ_t_62ZXqbg": {
    "date": "7/2/2014",
    "text": "Been here 3 or 4 times. Great little local bar to watch the game and have a beer. The outdoor seating is great in the summertime. It can be overpriced at times though. The food is pretty good too from what i remember.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K4SmcbJsC0Fhq6OTZXNrfQ"
  },
  "tbBy1KYW6g7llUU9ABB-zg": {
    "date": "5/17/2013",
    "text": "Redbeard's made my bad night even worse.  I know when I sit down at a bar  I don't scream dollar signs but yet and still I expect to be treated with some kind of decadency since I am a paying customer.  This was a truly crummy experience. Going to the bar alone is risky case in point with this review, I am use to being over looked but not treated rudely.   I ordered a Carona and when I asked for a lime the bartender let out an audible sigh and then shoved a lime wedge at me on a napkin.  I know my way around a bottle of beer and Carona's are served with a lime wedge stuffed into the bottle...but for whatever reason it was too much of a hassle.   Also on my visit the bartender introduced himself and asked the names of the ladies who sat down next to me, even though they came in a full 20 minutes after I already been sitting there. He never once gave me his name or asked for mine that hurt my feelings.  I want to add that I ordered 3 tacos and all of my taco shells were burned and the tacos had no salsa or sauce of any kind.  I have burned many a taco shell and I know it would have only taken the cook a measly 30 seconds to reheat more shells but they served them to me in burned shells anyway.    I have plenty of disposable income and I don't mind sharing it, but tonight I had to tip my bartender 2 centers and trust me it hurt me more than it hurt him.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 9,
      "cool": 4
    },
    "photos": [],
    "user_id": "V7uS5US4oTf-S9u36HJQCQ"
  },
  "B-K5agcYCjZvn1BNlI0J_w": {
    "date": "5/3/2015",
    "text": "I remember having a great experience at Redbeard's with a group of friends, one of whom resides right around the corner on Grandview Avenue, back when I was first moving to Pittsburgh in late-2010. We dined indoors for dinner. The service was prompt, and our food was delicious.  Today we decided we wanted to dine al fresco for lunch on Mt. Washington. It was the day of the Pittsburgh Marathon, so we knew there would be post-running crowds arriving in the early-afternoon, so we arrived around 11:45 AM. We initially were seated at Shiloh Grill until we were told that only a buffet-styled brunch was available (we wanted full-menu service for lunch and were irked there wasn't a sign indicating this at their entrance). We left and tried Redbeard's after finding some things that looked promising on their posted menu. We were promptly seated at the last available table on their patio and thought \"Gee, what great luck!\"  A few other tables adjacent to us were empty, but we overheard staff members telling other prospective patrons that those tables were \"reserved\". It turns out a group of frat boy-like restaurant employees (who oddly didn't know their server based upon a conversation we overheard?) was meeting there for lunch, and then they decided they didn't need one of the two-seater tables after all about five minutes after the restaurant turned away two women who were interested in dining on the patio to save it for them. I thought that was very unprofessional to begin with..  We received our cocktails promptly. Both were good, albeit on the weak side. Throughout our dining experience we had three different servers, and none of the three seemed to be able to coordinate very well to determine who did what at what table. We waited patiently 45 minutes for our two wraps, and while the servers were apologetic their excuse of \"it's taking so long today because we have to hand-write your orders shorthand for the kitchen because the computers are down\" was questionable to me. Just be honest with us. It was apparent you were short-staffed (management's fault---certainly not yours) for what was going to be an above-average Sunday with a ton of tourists in town who'd saunter up to Mt. Washington and want to eat at the scant selection of eateries available along Shiloh. I'd actually have preferred to have heard an excuse of \"some of our cooks weren't able to get here because of the road closures...\" rather than it taking 25-30 minutes longer to receive two wraps than at comparable restaurants \"cuz that's how long it takes to hand-write two wraps on a piece of paper\". You were short-staffed due to management oversight. Admit it and move on.  My sweet potato waffle fries were overdone, but my partner's steak fries were cooked perfectly. Our wraps turned out to be above-average in terms of taste and quality and worth the wait. When coupled with the entire experience, though, it wasn't worth $45 (including tip) for two wraps and two drinks. I did tip 20% because I felt it was unfair to penalize a server for something beyond their control.  Ambiance? Trashy, to say the least. When my partner got up first to grab something out of my car and then a second time to use the restroom I had to keep shooing surrounding tables from trying to take his chair like vultures thinking I was some loser dining alone after being abandoned by his dining partner prematurely. The employee group dining near us was polite and took an unused chair when we were both seated after asking. Another party next to us waited all of 30 seconds after my partner arose to ask to take both remaining chairs. I indicated my partner was going to be returning to a chair I pointed at soon, but they could have the other chair. The guy proceeded to take his chair (the one I pointed to as being HIS chair), and I had to scold him to take the other chair instead. When our check finally arrived (after another above-average wait) no sooner had I put my credit card into the sleeve did a man come over and ask \"Are you leaving?\" I replied yes, and he asked \"when\"? We both stood up to leave, and another family ignored the \"Please Wait to be Seated\" sign and bullied their way past us to self-claim the table before we could escape the narrow patio exit.   Such a shame overall because the wraps were delicious, but given the short-sighted understaffing and rude surrounding patrons who took to fixing their own seating issues because they also couldn't be served timely we had a miserable time and won't be back. I'm only giving them two stars instead of one because the wraps WERE good and the servers DID legitimately seem stressed and apologetic. We'll try Shiloh Grill instead at some point when they're not \"doing buffet brunch only...\" We know they're the sister location of Harris Grill in Shadyside and have always had reliably good service and good there for roughly the same price.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "moINbO61fGW-rB9XjyEltA"
  },
  "5vIcE1XG-skxl0ikoNcyYQ": {
    "date": "9/11/2016",
    "text": "The service is.. lacking... I ordered a taco salad to go. I've gotten it before and its usually good. Today I called at 10:50am to place my order. The woman who answered the phone said \"well the kitchen doesnt open until 11 so its going to be a while, maybe 40min\" I thought to brown some meat and throw it on some lettuce? When I finally picked it up it had tomato even tho i specified no tomato, the tortilla bowl was soggy and it didnt have sour cream and salsa like its supposed to. When I called to complain (i was polite in doing so) she said \"ok what would u like us to do about it.\" I couldn't believe it. I hope this was just a bad day because Mount has very few spots like this.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "80a_Mtv9FcyySIlnIq5EAQ"
  },
  "P_oBKXtK6POLGvsTRkRqNg": {
    "date": "6/16/2018",
    "text": "Meh....overpriced and sort of trashy. Food is usually just ok. Filled with idiots wearing their baseball caps backwards.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "njp-VIKNIAnoUT1oqjJgHw"
  },
  "DlM4qTpS62KOPeHsAIgwTA": {
    "date": "7/11/2016",
    "text": "Disclaimer: this was a day I was breaking my diet and having a cheat day. So the emotions were a little heighten. Service was very slow.  I dont know how cooks can screw up an order of nachos. I'm thinking its fail proof. Not at Redbeards. Here's why: sparse on the cheese, which was the main part of the dish. The toppings consisted of thinly shredded lettuce which wilted by the time I had my first  bite, olives (wtf), No Guacamole, no beans. And the chips that were store bought were burnt. Yummy right? Then came the burgers and steak fries. The burger came with onion straws, bacon, cheese and burger patty. The onion straws were terrible their sauce was too sweet like a jelly. The bacon was good and the bun was good. So basically go home outdo the cooks at Redbeards and make a BLT. It'll probably  be made better.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5dmdEKyzEsZx8TT4xKJPgg"
  },
  "egzwpaT271j_-_K3A3RqJQ": {
    "date": "11/8/2017",
    "text": "Wings were good, got the signature red beard sauce. Choices are limited on top of the mountain, but if your taking the trip up it's a good choice for lunch. Service was good. We sat outside and enjoyed the scenery.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4hHvdPrnDLJAnoN5pxT_UA"
  },
  "_LEawFQ3iDtYiat6u_gtqg": {
    "date": "9/28/2017",
    "text": "Love the outdoor seating and lighting at Redbeard's. The perfect place to grab a few drinks outside with a plentiful menu as well if you want a bite to eat. A much larger area and quieter scene than across the street at The Summit, but that's sometimes what you're looking for. Parking directly on Shiloh is typically tough, but there is a garage at the end of the street. I would return next time I'm up on the mount!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-sv8-a09Psq5CMzmg6E4OQ"
  },
  "U5TwU2Hv1Ic_3HJurcbKXQ": {
    "date": "8/5/2017",
    "text": "Growing on me but no specials ( that are good or cheap) food is ok but not great and it's priced too high. Outdoor bar and seating is nice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J9An8BT-KlKSZdiyKoRWUA"
  },
  "X7MyUENRg5VmAJAkV_3YHg": {
    "date": "5/28/2017",
    "text": "Hosted a 60th Birthday here for my dad and I have nothing but praise for this business, service and food. I worked with Michelle to make a large reservation for our group. She was so helpful and quick to respond to any of my questions as I was planning from out of state and have never physically seen the venue, even though the location holds a lot of significance for our family. (My great grandfather opened his bar, Tambellini's, in the building in the 1940s and my grandparents lived above the bar as newlyweds!) The food was delicious and  pricing was very reasonable. Nikki, our server was attentive and friendly with other staff members and management coming by to wish my dad a happy birthday throughout the meal. We couldn't have been more pleased with our afternoon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8PQcIxydcity-EOVjvPNyQ"
  },
  "SheRR69ras2Hwzigb4PlbQ": {
    "date": "9/26/2017",
    "text": "I liked this place.  Good beer, and very good food.  I had wings, and the Taco Tuesday special.  Not bad at all!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5fXj0q8Q6iXWX1v4G7chaw"
  },
  "9XQjYZiVXns7uEVMqZDSKA": {
    "date": "5/28/2017",
    "text": "Ended up having to get our stuff to go...it was over 40mins to get cheese fries, quesadilla & taco salad...they weren't busy...so it must've just been a bad day for the cook...because it never takes this long of what I'm told.  My first experience was mediocre...but Nikki, our waitress, was awesome! ...I'll be back Red Beard's...I'll be back!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0PQU9qRJ-kJKzuU7tbW2ig"
  },
  "rBAlcEX4_Nr0cM3boAv-8g": {
    "date": "9/3/2017",
    "text": "Although a few mistakes with our order and all of our food not coming out at tve same time, we were pretty satisfied with this place. The manager treated us to a round of drinks and also remade a meal tha was not to our satisfication.I had the tuscan chicken sandwich which was extremely tasty. I  will be back again based on the customer service. The manager was competent and aware of her customer's  needs.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x0OHE8EuYWtUyCtLSN7-pg"
  },
  "IhFwyWNa1uv9fDBtdTHyYA": {
    "date": "7/24/2017",
    "text": "This place isn't as good as it once was.  We were here recently for all you can eat crab night.  It took 20-30 minutes for us to get seated, which was expected.  What wasn't expected was waiting 20-30 minutes between orders of crab.  We were here until 11:00pm and things were slow even when there were minimal customers.  Additionally, some crab came out hot, some cold and still frozen.  I don't know if it's the management or the staff, but the place could use a good overhaul.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3_lXZmCkafRHM8jOUrlJEA"
  },
  "D-Q0daX6VFfU7kRLISenhw": {
    "date": "6/25/2016",
    "text": "Pros: Great service & atmosphere (The outdoor seating in summer is awesome!)   Cons: Food is just subpar (buffalo wings were pretty puny and my side salad had iceberg lettuce, a few cucumber slices, and one cherry tomato. I chuckled inside when I found the one tomato hidden. When I ordered Leinenkugel Seasonal (which was on draft) they were out. Not a deal breaker, but just left me feeling bummed, like the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LX4QDVNWnlBtahW5UwEF7g"
  },
  "tCbVQh-s1eAoP8m-BbEBNQ": {
    "date": "5/22/2017",
    "text": "Kristina is great and always offers amazing recommendations. Terrific sports bar on Shiloh Street  in Mount Washington. Definitely worth the trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kQaJ3DweniL-OV5T5JjEuw"
  },
  "gZPbjj04DNHiP8_eEgTHKA": {
    "date": "9/10/2015",
    "text": "I never ever ever give one star. It takes a truly horrifying experience for me to do this so here goes.   First of all, I love the downtown Redbeards so please go there often!!   Now for the Mt. Washington location. I was given wings that were pink and bleeding. When I talked to the server, I was told that I was not the first person to complain about uncooked wings tonight. The server sent over the manager that told me the wings were cooked the entire way through and if I wanted them a different way, I should have said extra crispy. I have never sent food back a day in my life. I have two people at the table with me and they challenged the manager with me by saying the food was totally uncooked and bleeding.  It wasn't like I ate 10 of the 12 wings, it was the first drumstick that I encountered and I was nervous about the flat wings as they sat half-eaten on my table.  Just sharing what happened. :-(  I was only here to watch the Steelers game, I will never be returning again.  #shouldvestayeddowntown",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "5ETvIplFINUqNJ3jgVkItg"
  },
  "dSX5kqtA7KvFtLaRUeVkYQ": {
    "date": "12/11/2016",
    "text": "I have been to Redbeard's on Mt. Washington on several occasions due to its close proximity.  It is a place that is literally \"just good enough\" for me to return.  The food is actually pretty solid overall, although a bit expensive.  Redbeard's used to be a much more popular establishment and I believe they raised prices when business was \"boomin\".  Popularity has decreased which is would speculate is from the poor and slow service.    The bar staff is not the most friendly or quick but are sufficient. The one thing about this place that really bothers me is that they advertise on the radio about how they are the only sports bar on Mt. Washington with NHL Center Ice and NFL Sunday Ticket, HOWEVER, if the Pens or Steelers are playing they will not change ANY of the 20+ TVs to another game. Why have those packages then ????  The bar staff is very rude when you even make the request.  Don't allow the advertising to lead you to believe you can go in there and watch any game you want, because you CAN'T.   Overall you could do worse then dining or taking in a game at Redbeard's but you could do better also.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aG42hudwQChiOwU6mfCR4Q"
  },
  "ShAkQX4cVrpnv80a5EzSyg": {
    "date": "9/8/2015",
    "text": "So I've never been a fan. I'd been to the downtown location a few times and was generally unimpressed, both my the food and the service. One night I ended up at the one in Mt. Washington because the wait at all the surrounding restaurants was insane. It was honestly one of the worst dining experiences of my life.  First of all, the service was awful from beginning to end. We were left waiting for long periods of time, and when our server finally showed up, she was useless. She did not know the answers to any of our questions, and rather than finding out, she would just tell us, \"more or less\", and we would find out later that she was totally wrong. Our food was wrong, it tasted horrible, and the whole dining experience took HOURS - and that's no appetizers, and we ordered right when she came up. Tables around us got food before us... It had no redeeming qualities. I will never be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "_oNthTV94Evx9qGkJOTXLQ"
  },
  "5XYBEZ3njqENBRN14TjlQA": {
    "date": "5/2/2016",
    "text": "We decided to try the all you can eat crab leg night and it was delicious definitely not disappointing.  The service was amazing and on point and the quality of the crab legs was very good! Will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a6Ek7cmFGqOImEjnzTFpYg",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. All you can eat crab legs.  Yum!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a6Ek7cmFGqOImEjnzTFpYg/o.jpg"
      }
    ],
    "user_id": "kNMtMMIKtiyx1eBnizH3cQ"
  },
  "hVOTnFca2hU1E-_quSr8MQ": {
    "date": "9/28/2015",
    "text": "Relatively new to the Mt. Washington neighborhood of Pittsburgh and made the right decision to check out this gem. Immediately upon entering, staff greeted me with a smile and hello. Upon choosing to sit at the bar, the barkeep made multiple suggestions regarding the seasonal choices on tap and in regards to food, as well.   The food and libations were excellently cooked and crafted, and tasted fresh.  This is one place that I will be definitely coming back to during sporting seasons in part to the food I had eaten, the people I encountered, and the overall comraddery that I experienced. Keep it up, Redbeard's on the Mount! Customer for life!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pKRu_hYiZgmuZY2_yBXLVQ"
  },
  "wKGB3OUNgZSYE0XP-QZ5Kg": {
    "date": "2/9/2011",
    "text": "Can I just point out that the ORIGINAL name is Redbeards Mountain Resort and Yacht club. As far as I saw there were no yachts to be found but I'd back up the resort part! Minus any palm trees but maybe a fruity drink or two!   Love this place! I'm sure it's because this is my neighborhood watering/beering hole. Great bar food, especially the mozzarella log, I kid you not on the name!) and delicious wings (hmmmm honey bbq!) I can't even describe the way the loaded fries taste, especially after midnight....  You know how bars surprise you and have some rando food item that's delish? They have awesome and I do mean AWESOME german potato salad that I have tried to replicate at home without ANY success! I also enjoy any bar that has Blue Moon on tap, because I feel like those can be few and far between.   I can't say much for the inside but they have remodeled the outside area quite extensively. It's a great place to sit in the summer and in the winter they have a tent set up with heat lamps. AND, they just recently added a fake fireplace for True ambiance. It's right next to the huge flat screen TV. Romantic....   So maybe the waitresses are a little grumpy at times, I can deal for the food and beer. And let me tell you, places don't do well in Pittsburgh if you can't get a special on SOMETHING! They have a special every single night of the week, niiccce! I'm into that!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "VuaW4RNfd25LDZ9I2Keb-g",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VuaW4RNfd25LDZ9I2Keb-g/o.jpg"
      },
      {
        "img_id": "FBEfinU9tLA_mz_8JKsLnQ",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FBEfinU9tLA_mz_8JKsLnQ/o.jpg"
      }
    ],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "BOzbwbeflK1x_TzbmnQ09g": {
    "date": "11/7/2015",
    "text": "I haven't been here in a little while but every time I used to go there it was pretty good. Nothing spectacular but it gets the job done.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "91koVXu54Y6tIiZKKxVmrw"
  },
  "x2ORBKOl8XL6mshIQNLdhw": {
    "date": "5/1/2016",
    "text": "My friend ordered the pierogies with cheese and potatoes.. They came out as pieorgies with sauerkraut and potatoes. The server was awesome and sent them back for us. However, the same pierogies with sauerkraut came back out. I had pretzel sticks, which were basic, but no complaints.   Server/bartender was so so so great!!! Loved her. Hope she's there any time I go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hBtP8lFpm-VYB7XV3mhIg"
  },
  "G4XRtfRukfryGPMhZgMJ7Q": {
    "date": "11/13/2016",
    "text": "The food was suprisingly good for a sports bar. They have a wide variety of beers, and the attention of the servers was excellent.  We had the potato and cheddar pigiori as appetizer, which were really good. They came with grilled onions that tasted like caramelized onions, and the mix was very very good.  The tuscany chicken grilled was good, but a little too dry. I think they forgot the dressing, but I really like red peppers in sandwiches. The burger was juicy.  The taco salad was huge, and came with buffalo dessing on the side. The tortilla bowl was very crispy.   The inside out sandwich was my favorite! It was super cheesy!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "83IDKHS3NIp8JaT7YOzR9g",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Tuscany Chicken sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/83IDKHS3NIp8JaT7YOzR9g/o.jpg"
      },
      {
        "img_id": "ZMjr_fwVljxpuOe23-sKsQ",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Taco Salas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZMjr_fwVljxpuOe23-sKsQ/o.jpg"
      },
      {
        "img_id": "UVX5jogw9wVmEEwU82Em5Q",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Inside put grilled cheese sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UVX5jogw9wVmEEwU82Em5Q/o.jpg"
      }
    ],
    "user_id": "kS6Hb5DunhaG1NiRXRwb6Q"
  },
  "siswjtOw9KwiAvbkw8PC4Q": {
    "date": "7/21/2018",
    "text": "The wings are here are decent but I got the honey barbecue and it was legit just straight honey. Bread platter was quite appetizing. Cole slaw was bland and flavorless. Decent service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sSFxYWfTk7PzfXyvfQ5GwQ",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Honey bbq and cole slaw",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sSFxYWfTk7PzfXyvfQ5GwQ/o.jpg"
      }
    ],
    "user_id": "m94Zh9LT-aGqWGfHjRsrRQ"
  },
  "gBeclm7pNgiZEn8B6AQTkA": {
    "date": "9/16/2018",
    "text": "We had a party of 10 last night on 9-15-18 for mine and my brothers birthday party. We waited 15 min for our first round of drinks. Mind you we where the only customers sitting down inside the restaurant.  A quesadilla that my sister ordered was never put in. Our food came out so spaced out that no one got to start eating at the same time. It took 10 min from the time the first plate came till the last plate for entrees. Our table ordered 2 orders of traditional wings. Both where sent back for being under cooked. Than when they where brought back to the table those sets where too undercooked... 9 our of the 10 of us work in the restaurant industry. Including a general manager for noon two primantis.  When the manager came out she was rude and looked like she was insulted because our wings where under cooked. Like it was our fault. I wouldn't call last night good customer service and I would suggest getting a friendlier manager. She wasn't a people person and was very rude. Considering we where a nice size party and ran big checks I would have thought my visit would have been better.  Your downtown location is much better in my opinion after my visit.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KK_6mjlGpxGpmePJ5br_Aw"
  },
  "ztkJfSyeBLG9zIWnsq6EkQ": {
    "date": "4/7/2017",
    "text": "We have been patrons of this establishment for 10+ years, less frequently visit now because we moved and not as convenient for us. Over the years they have made good improvements both inside and outside, as well as a change with their menu.  The service is pretty typical for a bar/restaurant. Seating can be a hit or miss during game nights. They have a wing special, but it isn't the cheapest you will find, BUT they do offer more wing flavors then most places in these parts! The \"great balls of Fire\" is something I recommend ordering on the side because it really is spicy (and I know my spicy)! Other items on their menu, such as their sandwiches are very good as well. The servings are very good with every plate. They do offer private parties for the outside area with a booking and meal options for guests. We had a reserved party a few years back and they did very well.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "o-mwZGJDcJ4hQHe1EbNYTg",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Side of fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o-mwZGJDcJ4hQHe1EbNYTg/o.jpg"
      },
      {
        "img_id": "OL14HcDzPeyAxA_b2sy10w",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Fried pickles",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OL14HcDzPeyAxA_b2sy10w/o.jpg"
      },
      {
        "img_id": "V12bn5KByA4PCsMvMIKrow",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Fried Oreos... very very good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V12bn5KByA4PCsMvMIKrow/o.jpg"
      }
    ],
    "user_id": "nzl2KyGKLtV7j8QEfOhC-w"
  },
  "IH_0_XiZtU6PrAc9BUvzGg": {
    "date": "12/16/2018",
    "text": "Our server was extremely rude and very eager to get our plates out of the way even though we were still actively picking at them. I thought my crab cakes tasted like the sea... when I say sea I mean bacteria, saltwater, etc.   I told her I wanted something else, and the manager comes up and says \"so what's the problem here?\" I told her I didn't like my crab cakes; instead of her being a manager and offering to get me something else, she offered a box and sounded confused about what she was gonna do about the situation and continued to ask me questions which included \"so were they bad\"? And scoured my plate as if I ate too much of it.. I work as a server and my manager doesn't care if you eat the whole plate, he will ALWAYS offer something else.   She literally made it sound like the restaurant couldn't spare $25 for the plate she was trying to make us pay for even though me and my party each tried like 3 bites. Not great food, the worst tequila (tastes like a car tire) and rude service. Once again I'm a waitress and I've worked at bars and such and I would just never treat my customers the way we were at this restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FxpSqYhp5ABKTa4J9rnj7g"
  },
  "HBu5Th39xlGL6L_skrhaAA": {
    "date": "2/13/2018",
    "text": "Great place to have breakfast lunch or dinner. Breakfast menu is small but the bottomless mimosas are so worth the trip up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7KKKimQHBb8BVCN249SZIg"
  },
  "Nifg-cdpso1_5tW6IO-c-w": {
    "date": "4/7/2019",
    "text": "This was the worst experience I have ever had at a bar/restaurant. The waitress forgot to put part of our order in and took forever to bring us our food. The manager was also very unprofessional when handing a customer issue. She was actually arguing with a customer which is not how a manager should act. Very disappointed with the whole experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YudsIPdr52YGGVF29hJMAg"
  },
  "CbaTTiCP9rPl91BfoEBCvA": {
    "date": "1/9/2017",
    "text": "I have been here a few times for drinks.     I always have fun.   The bartenders are engaging when they are not slammed.    Here is my summary:  1. The drinks are good (great pours).   2. The place is clean (in my opinion) 3.  Great service 4.  Food looks good 5.  There is a good number of regulars (old and young).   This usually validates that it is a good bar.    The only downside is parking.   It is Mt. Washington.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "JgOcyMF1lTwSVCarSZrrrA"
  },
  "T0hGEDFQTMknDDi46kTCEg": {
    "date": "8/31/2018",
    "text": "amazing best place ever. great jams! great beer. great beer. great company. had some bomb ass pirogies. would 100% recommend. go there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5BvvcOED2lQL634N1Xtv3Q",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5BvvcOED2lQL634N1Xtv3Q/o.jpg"
      },
      {
        "img_id": "Q0hBpg6jf0oHl5FxR8rkGw",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Q0hBpg6jf0oHl5FxR8rkGw/o.jpg"
      }
    ],
    "user_id": "Q0mnUBp-Wkz8aopOY7QDAw"
  },
  "jsycSTjwXRJNN_qiIJYMPA": {
    "date": "9/28/2017",
    "text": "I came here on a whim. I was desperately hungry and decided to order the special. Advertised as \"coconut shrimp, rice, and pineapple salsa\". I should have asked upon ordering what the portions were like BEFORE ordering. The meal came with 5 pieces of shrimp, hard rice, and a small bowl of salsa. I guess I was expecting bar food sized portions. After a busy day with no meals I was looking forward to delicious bar food but instead was greeted with mediocre food and lengthy service. I would definitely come here for drinks and the sports bar atmosphere but I don't I'd purchase food from here again. Perhaps I'll give it another chance and go for wings or a burger.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5LJp22-a7dfTIzVHbgH7DA",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5LJp22-a7dfTIzVHbgH7DA/o.jpg"
      }
    ],
    "user_id": "fKAxmycMFwO9qWVUAOQzOw"
  },
  "an26YOYgdkpu9ezYxHSNzA": {
    "date": "12/16/2018",
    "text": "The manager during the Steelers game sucked! First time here and wouldn't come back based on her condescending comments about our actions during the game. She needs to gain a personality and management skills. Til then, bye Felicia because you suck. Don't tell people what to do when they weren't even doing what you suggested. WORST MANAGEMENT OF ANY BAR IN MOUNT WASHINGTON!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e7GNdujt_DwE5o9LJCvUJw"
  },
  "FeHlO1hjn02FoFqduRAc8Q": {
    "date": "7/31/2017",
    "text": "Stopped the all you can eat crablegs on Monday nights after 10 yrs.  Was here last Monday and nothing was said  about discontinuing all you can eat crab legs .smdh.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7lwaDpTsuGNUTUNi-R20zw",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Really? After 10 years of loyal customers.  No wonder no one is here tonight. Not a smart business  move IMHO.  Not a happy customer. Smdh",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7lwaDpTsuGNUTUNi-R20zw/o.jpg"
      }
    ],
    "user_id": "1jRU23dY68u1WWcIFWFviQ"
  },
  "eTbG4Nh9k5MSFdz7FaXkPw": {
    "date": "5/2/2017",
    "text": "I've swung through here a few times now when I've been up on Mt. Washington and like what I've seen. It's in a good location with street parking or a pay lot just down the street. I like the look of the place too. From the outside it looks kind of like a dive and to be honest, the inside does to a little bit. The beauty of this is that they embrace this and put a bit of an upscale twist on their menu. Sure it's mostly bar food but it's bar food done right and they don't shy away from it. From creative burger names like \"The Early Tee Time\" (Burger with Bacon and Egg) or the \"Easy Out\" (Plain burger you can add to) to Nashville Hot Chicken and a ton of deep fried starters. Everything tastes and has the appearance of something just a step above what you'd find at the corner bar.  I've enjoyed the Early Tee Time and Pita Crisps with Buffalo Chicken Dip.  I'd gladly order them again but plan on exploring the menu more next time. The draft list wasn't bad but nothing out of the norm. Same for the bottle selections. The service here was excellent on my visits. No complaints in that department.  If you do swing by, there are a lot of other local spots to check out as well within walking distance. Highly suggest you give it a go!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "rg3lGbuzMiyoymfqkXUc9Q",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Pita Crisps were so good I forgot to take a photo until it was almost gone!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rg3lGbuzMiyoymfqkXUc9Q/o.jpg"
      }
    ],
    "user_id": "wzItnkHTHKNqJESMSTEYJg"
  },
  "Fs9ARz9dpOMYfFXFDvxHWQ": {
    "date": "7/26/2017",
    "text": "Love this place!  In town for a few days with my wife and kid and looking for a place to eat and grab a drink late near where we're staying and we stumbled across this place a couple miles away.  The service was excellent... especially Jenny and Amanda!  We went here our first night in town at midnight and Jenny was our waitress. We're visiting from San Diego and it turns out she moved here a year ago from near where we live (I always love coincidences like that... 3000 miles away and we run into a HomeTown girl).  She gave us good recommendations for food and drinks and was genuinely friendly.  Second night here, we got Jenny again, (who remembered our drinks from the night before) but she was off soon, so she introduced us to the next shift... Amanda, who was just as great... recommendations and all.   Now for what you truly want to know... the FOOD!  Awesome... never had perogies before, but the 2 different ones we ordered were delicious.  Except for the fish sandwich, (which was great) we mostly got appetizers and all were delicious.  The chicken wings were so good, we ordered extra just for the fridge the next morning.    Good drinks, great beer... what else could you ask for when on vacation!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sVgJ4CB3PuDAVAwlEz_7Rw"
  },
  "BdVH2noWM4m48xAWOYwqtQ": {
    "date": "5/7/2018",
    "text": "Worst place ever. The management sucks. I never got a call for being treated poorly when I visited this establishment. Don't go here",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4F2x1aRlfk6mnhbccpMkuw"
  },
  "CI3DRY4pT3fqFSpt5ADJSA": {
    "date": "4/3/2017",
    "text": "I remember at one time the food being pretty delish and the service even better. But I don't get that vibe much lately. The food is just ok; typical neighborhood bar fare. Service is still good but not exceptional as it once was.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "zUocfr6aVzaRx_h9tMaFFg": {
    "date": "2/20/2016",
    "text": "The food is nice, but the service OMG! But the service is HORRIBLE! The \"waiter\" laughed at me since the first moment I asked for a virgin daikiry. He appeared in my table with TAP WATER... I wanted something without alcohol coz I cannot drink. I told him this was not what I asked for and his answer was (pointing the entrance door)  \"SECURITY IS RIGHT THERE\" Couldn't believe my eyes. WILL NEVER BE BACK HERE. RACIST STAFF!!!!!   Bad bad bad bad bad! If you are not white American, please stay home!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "LgtMYCRirx-_E4AOhwKvpQ"
  },
  "xv27zZsv1W1kLj6qhB6dLg": {
    "date": "1/4/2016",
    "text": "I actually feel really bad about writing this review, but as yelp states for 2 stars---- i've experienced better.   We were in the mood to celebrate Taco Tuesday. I searched online and found that Redbeards had a nice tuesday special---- $1 hard tacos, $2 soft tacos, $3 fajitas (plus specials on Coronas). We were in route in no time!   I cannot remember our servers name, but she was very nice. We ordered our drinks then tacos later. We each ordered 2 fajitas and 2 soft tacos. A few moments later, we heard our server greeting the other table and without them questioning, she gave them the run down of their taco special... only she added that you can get all 3 (soft, hard & fajita + chips/salsa for $8) I really really really wish she would've gave us that special... what an awesome deal.   As for the food, it was honestly below average.. even for a special. First, the fajita only comes with steak and peppers. ANY and everything else is extra... even cheese! We literally paid $3 just to add cheese to all of our fajitas. So much for a special..... The fajitas were honestly tasty even though they were tiny and hardly had a grilled shell. The deal breaker were the tacos. We love tacos, but Redbeards used wayyyyyy too much taco seasoning. I admit, i use those little packets too and my tacos are still edible. We tried to eat them but they were just bad. We each took 2 bites and left the rest there. salty salty taco meat. What a fail :\\  I'm gonna add in this review that the place itself and menu looked great. I noticed someone with a chicken wrap and it was huge. I have no problem trying out Redbeards again. I plan on updating and hopefully giving them more stars after our next visit.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "XGK5Q5MKCp-6G7ThTG12GA": {
    "date": "10/22/2017",
    "text": "First time visiting Pittsburgh and discovered this place with a co worker . Took awhile to get greeted as the steelers game was on but they weren't that packed ,that's okay! Finally get a table outside ,ordered fried pickles as our entree few beers and wings. Simple right? First of all let me say the customer service is great ! However,manager came by 30 minutes later and mentioned the pickles aren't quality (her words) and she didn't want to serve us. Ok! Fair thanks for telling us ,got a beer on the house. Another 30 minutes later we received our wings and our server forgot the fries,little things like that is why I gave 3 stars. Wings weren't the best but the sweet potatoes fries are sooooo good!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dVrJeT6fFkfKIVtASjGPIQ"
  },
  "8jFC-CigCcBTkIyTNnIR5g": {
    "date": "10/30/2017",
    "text": "Absolute worst experience I've ever had at a bar.  The manager/head bartender was rude and disconcerting to myself and my girlfriend.  She refused to serve any alcohol to my girlfriend because I knocked a drink out of her hand and insisted my girlfriend was too drunk to drink.  She then actually called the police.  It was an awful experience by a woman had the hospitality and customer service skills of a dictator in North Korea.  I would rather drink behind a liquor store with homeless people than go here again.  Stay away.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KFIiQrZBdNNfaLKRt6PMfw"
  },
  "8YQf6NxOKDy_9DGjdGcSqA": {
    "date": "9/13/2019",
    "text": "Stopped in to get a quick drink and potentially something to eat on a later Thursday evening. I have never been here and not super familiar with mt wash. I was treated right away by the bartender she was super nice quick and personable. As I was sitting here on my second drink I was thinking that wow this girl has probably been the most genuine sincere bartender feel I've ever had in all Pittsburgh area. Especially since mt wash isn't my area I had no clue what to expect. It was very refreshing to have a bartender who doesn't make it seem like you're a chore and that they are happy to see you sit down. The bartender checked back in a few times, got my food order, also poured my cider into a cold glass for me which is always appreciated. So as I pull up my yelp a group of gentlemen walk in so I quickly put my phone away since I will always think being on your phone is rude. But one of the gentleman Jeff (thank you For the drink) comes over and says \"Amanda is the best I hope you write a good review\" and I thanked him because I didn't know her name as I was already going to write this review!  Miss Amanda, thank you SO much for being so pleasant personable and genuine. I have worked and dined from the finest places in the city to the most divey dive bars. Anyone can make drinks, anyone can be knowledgeable but it takes a special person be be sincere and genuine. I know personally bartender & working in a restaurant can SUCK!  So thank you SO much for very pleasurable experience and I will return with friends to see you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZB2nfK_i8-1qa4qhDuiSGg"
  },
  "A9zx8erK1D2UPDKFvYMalw": {
    "date": "7/20/2019",
    "text": "Swung by Red Beards after a ride up to Duquesne incline. Walked to the other incline to go down. Before that we stopped by Red Beards for a quick meal and a few beers.  I have been here before and enjoyed it. This time it seemed like we were \"outsiders\". Never really made small talk and only checked on us once. The burger I had was good. My girlfriend had the grilled cheese and she was a bit disappointed. Her bread was burnt through giving the cheese an aftertaste.   I would give this place another shot but being out of towners, we felt that the regular local customers got much more attention.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y7ZPo3Pok9dGYJoWHniXAA"
  },
  "yvuB4v39CrS3lGoKRR8u6A": {
    "date": "1/23/2019",
    "text": "Red beards is a nice spot on Mount Washington. I feel as if the place is constantly steady and has great atmosphere. It is a great place to kickback and chill with your brotein shakes (woman are my bros as well). Most of the time I go here on Wednesday for wing night. They have a great selection on wings. If i had to compare it to something I would say it is what hinge is for dating apps. Tinder has too much going on and too many different people. Coffee and Bagel doesnt have enough peope and it has a weird atmosphere for an app. I would say Hinge is a very tasteful selection between the two. And that is what red beard's wing selection is like. I have no complaints on all the different flavors I tried. I really like the Giddy up wins with the horsey sauce, and I like the Red Beards Signature... i was kinda expecting an autograph on the wing with the red beards signature, but it's fine.   Staff is always excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4rS9EJ1XJF0lT0fV23r7NA",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4rS9EJ1XJF0lT0fV23r7NA/o.jpg"
      },
      {
        "img_id": "2t8lmT1sRxoz7fyejsGs3Q",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2t8lmT1sRxoz7fyejsGs3Q/o.jpg"
      }
    ],
    "user_id": "Nnzn3dwE_GQhxdzTFH3DNg"
  },
  "G94CscHLIpZhTg_bRYY9bg": {
    "date": "7/29/2018",
    "text": "We came here for brunch today. They had a very limited menu, not surprising considering it's a sports bar. I got French toast with blueberries on it and sausage on the side. The French toast was on good thick bread, it was a little eggy but Was still decent. The sausage was okay, tasted like a sweet Italian sausage in patty form. The food was good but nothing special.   I've been here a few times before for happy hours or dinner and it was always really good. If I didn't have many other options I would come back for brunch but I will probably stick to happy hours and lunch/dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "suGyAnfEjZo52DxaKbDD7Q"
  },
  "hWw9DChKQFDGQrHq0Z_OKg": {
    "date": "11/14/2018",
    "text": "Redbeard's has the best pub food on Mt. Washington for sure! Good wings are hard to find around here, but Redbeard's are pretty damn great. Wednesday is wing night and they offer some awesome specials. They are always cooked perfectly and offer so many flavors. Last time I was at Redbeard's, I ordered the honey habanero, and let me tell you they were HOT. can't go wrong with classic buffalo. Their wing sauce makes a dope buffalo chicken wrap too!  Service is always great and there's always a good crowd. I always feel safe and I always have fun!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "royL3mfw4TOy76BRJDj8qg"
  },
  "cE5ciC-HoUG25b8fmq7Dbg": {
    "date": "8/2/2019",
    "text": "Enjoyed a fun night out here last night. We wandered over when the bar down the street was too loud, and I'm glad we found this place! The food wasn't remarkable but it was all delicious. My wings were a little overdone but flavorful; my cocktail wasn't balanced but the wine was good; the chicken fingers were simple and tasty. The fries were probably my favorite, along with the atmosphere - we sat on the little outdoor patio and had a great time. Our server was on top of her game. She was busy but kept a good eye on us. Overall, a fun hang in Mt. Washington.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8iEl9zcomnvTwyr90r7vxA"
  },
  "xG33pXmAy-saD07lT9Kzpg": {
    "date": "9/7/2019",
    "text": "The service is Terrible out side.  We tried to sit at a table and were told that we were sitting in a table that was in the way of the server and we had to move.  Well we didn't put the table where it was.  The server then told us not to move it to either.  Wtf unfortunately I will never go back after years of hanging out on the mount.   I have had many great time there but I feel service is no longer a priority.  3 time my table had to ask for waters before they came.  Well there are other bars on that street and I will ask my service industry friend to go to a cheaper more attentive option.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3qNifvQkbU9BTCuiuaFGzA"
  },
  "g30o96BwuqGykSCxzi8X7Q": {
    "date": "7/16/2019",
    "text": "Every time I go here I feel like there is a list of rules of things I CANT do. Once I asked to add chicken to a side salad and they said I wasn't allowed to do that. This lady time I went it was (boneless) wing night and I was told that all ranch or blue cheese is $1. They won't even give 1 complimentary ranch on a WING NIGHT. What place do you know that has a wing night that doesn't at least give you 1 ranch or blue cheese and even the extras complimentary....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kvw9Zj6IAYzOvSTq_nKadw"
  },
  "Kn574O4W6xl-hyDDbnrYwQ": {
    "date": "7/14/2019",
    "text": "Went there today for a late lunch. As soon as the menus hit the table the waitress quickly asked what we want to drink. I said to her give me a minute while I look at the drink menu.  3-4 minutes pass and she's there again wanting to know what we want to drink.  Finally after the 3rd visit I pretty much said the hell with it and settled for water. In between the repetitive visits for drinks she kept coming back for our order. Damn I felt rushed. I then ordered 6 wings with the Redbeard special sauce and an order for Pierogi. Well the waitress came back after 10 minutes later with fried cheese sticks. The waitress came to the table and my daughter told her that I didn't order cheese sticks. The waitress took them away.  Well apparently when the waitress came back she whispered to my wife that I did order cheese sticks. My wife thought it was best to not tell me until after we left the bar. .. cheese sticks would be the absolute last thing I would ever order. Now to the meal. My wings were Luke warm at best and were on the verge of not being cooked enough. I also ordered an appetizer size of Pierogies. These as well were Luke warm. With all the restaurants on the south side of Pittsburgh I will not waste money eating here again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xOvrVhDtRWN_8RMvK9KUFg",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Pierogies and chicken wings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xOvrVhDtRWN_8RMvK9KUFg/o.jpg"
      }
    ],
    "user_id": "DaVxns8-qn7otZ-EJocFpA"
  },
  "0e-T83JTNph4bCr2hQBrQg": {
    "date": "7/25/2019",
    "text": "Hot ranch wings are amazing! Ordered on uber eats. Big portion and big wings. The only thing I wish is that I would like a way to add a cup of ranch to your order. Didn't see that option online.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Qolpvh_9b_NcrSyjQhA0Q"
  },
  "kc5oqs6G_69ayy2nW-fZhQ": {
    "date": "12/29/2018",
    "text": "Surprise,  surprise, to find good Nashville Hot Chicken in Da Burgh!  Really great meal and cozy ambiance.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5zMUXqa7_5gfK9SqBd65Fw",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5zMUXqa7_5gfK9SqBd65Fw/o.jpg"
      },
      {
        "img_id": "LlDXbGlpjYRTT8KzaouaNQ",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LlDXbGlpjYRTT8KzaouaNQ/o.jpg"
      },
      {
        "img_id": "tY_A56I03xKc7H372LbSNQ",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tY_A56I03xKc7H372LbSNQ/o.jpg"
      }
    ],
    "user_id": "ffh_91g2oYBa_y3XjBZSbA"
  },
  "MklErNytfuEhSD-QtyJyEw": {
    "date": "6/23/2019",
    "text": "This unfortunately a locals bar, and not every bartender treats people with respect.  I came in, ordered my food right away, and just kept to myself.  The bartender provided horrible service.  Didn't come back for 5 minutes after I didn't know what I wanted to drink.  Then when it came to getting a doggy bag, it was crazy.  \"Do you want containers for everything?\" Then she says \"let me go get you a bag.\" Never comes back with a bag.  \"Oh I thought you didn't want one, usually people are fine without it.\"  She comeback and says, \"Have a BETTER day!\" When I confronted her, \"well you been rude to me the entire time.\"  I'm the customer, I don't need to be friendly, I can sit say as little as I want.  Not that I was rude, I was just keeping to myself.  I spoke to the manager and she brushed it off like it wasn't a big deal.  \"She never has done anything like this before.\" So what she gets a free pass and I must be wrong?  \"I don't think she meant anything by it.\" She literally justified her actions to me.  Seriously, worst service of my life, and I eat out a lot. You don't know me, don't comment on how I'm feeling.  So judgemental, dismissive just plan bad customer service.  If you're debating on where to go, go to Shiloh Bar or Summit.  I've lived here for 3 years, and those bars are lovely.  Nikos if you don't mind smoking. The only reason I ever go to Redbeard's if I was in the mood for a quesadilla, but I think that will change.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QMf-uity7_ox85hjLNmb2A"
  },
  "rZLSUVTaWOldW6oZPJbYKw": {
    "date": "4/7/2018",
    "text": "I'm a fan of redbeards. I've eaten here many many times over the last 6 years and have never had a bad experience. The menu is more of a \"bar food\" selection, but they do have some great choices. The salads are HUGE & every time I eat here, the fried pickles are a must. You also can't go wrong with one of their wraps. Wednesday is wing night & they always have daily drink specials.  During the summer, they have a patio on the side, which is gated in. I always enjoy sitting out there. Wait staff is always friendly and the service is pretty quick. Sometimes I dislike eating inside though bc there aren't many windows, so it's dark. I prefer the Mt. Washington location over downtown. Quick walk to the overlook and parking usually isn't too hard to find, although you must remember to pay the meter. If you haven't tried Redbeards, give it a shot! A Mt. Washington classic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "chbCROaKWm2pj5uUT-ruGw"
  },
  "IJ1eH2FrjdQuWUw7GNuGhA": {
    "date": "6/5/2019",
    "text": "Somebody should remind the short blond waitress working the high top tables in the bar tonight at 6:30 that she is in service industry. Three of us were sitting down at a table waiting for our fourth to arrive. She kept asking us if we were ready to order and we said no and that we were waiting for our fourth. We were signing some paperwork and then says \"you can't just come in here and order water.\"  So we left and went to Bingham Street Tavern, a place that actually values its customers and trains it's waitresses.   Skip Redbeards. There are so many better options on Mount Washington now.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mAsFzV5j4nco-9denmfIiA"
  },
  "Te24XOxQpkboDKuXvuDoMw": {
    "date": "11/7/2018",
    "text": "Ok so the atmosphere here can be a little rowdy. BUT their food is so good for some reason. It was very unexpected because I was just really assuming it'd be mediocre bar food quality. The fried pickles were so good and I'm craving them right now actually! It's not expensive either, so check it out if you're in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LC1N1SFW-MaLWiq6Du1oCQ"
  },
  "pLpGVzROckq7DgyE5hdlXA": {
    "date": "3/19/2018",
    "text": "This is not my first time here and won't be my last. It's a good atmosphere for drinks and higher quality than average bar food. I have had the mushroom burger, the French onion soup, and most recently, the fried chicken. All has been good. The fried chicken had good flavor and came out with two good size pieces. It was moist inside, but I was a bit disappointed that it didn't come with some kind of dipping sauce. Brown gravy or bbq sauce would have been a good addition. The fried batter was also crispy, but flaked off easily. An easy way to tell a high quality batter is how easily it flakes apart and some of the batter was falling off the chicken. That being said, it was still good and met expectations. The restaurant/bar is a staple on Mt. Washington and continues to be popular for a reason.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DCTWK8Q86Ju2hcuKVKcCwg",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DCTWK8Q86Ju2hcuKVKcCwg/o.jpg"
      }
    ],
    "user_id": "rVLTC95ZV7yCmbQbSVdX1w"
  },
  "TfN-glSVWgnWVeIe5cvVHg": {
    "date": "11/25/2018",
    "text": "Would have been five stars but we had a rather nasty bartender. First, we got there and asked for water. We were not greeted well and told there have been too many waters poured this weekend. Fortunately we eventually got a water. The food was delivered incorrectly but the kind woman bartender fixed everything for us promptly.   TL;DR TEAM Bridget not Patrick.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v_EW41972_6xJhd3cN97jQ"
  },
  "kEVY7fwmggyo7_nBB5Dqxw": {
    "date": "7/1/2018",
    "text": "We stopped in here on a whim while wandering around on Shiloh Street on a Saturday afternoon and I'm glad we did!  Had a really fun time.  Our bartender was awesome.  Try the Capri Fun Bags!  It's like a capri sun with vodka.  Tasted like a snow cone.  We also purchased some Cheese Logs which were much tastier than expected.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "SHz-bcHZe3m9pmd3CF5SJw",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Capri fun bag.  Yummy!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SHz-bcHZe3m9pmd3CF5SJw/o.jpg"
      }
    ],
    "user_id": "MIi2PNYphDofbTR8ySka9A"
  },
  "TdWbE_V_Ch_ON_eygsB0JA": {
    "date": "1/28/2018",
    "text": "Stopped here for a few drinks, an appetizer, and watch the Pro Bowl Game. There were plenty of tvs to watch the game, we found a table for the 3 of us with no issue, and a waiter came over right away to take our drink order. Fun place to hangout and spend time with friends. Food and drinks are reasonably priced. We got the loaded nachos and they were good. I would have liked them with a little more ingredients, but I still enjoyed them and it was the perfect size for 3 people. On my second visit I ordered the Big Game burger, it was cooked well and had bacon and cheese, but didn't have a ton of flavor. In my opinion, it was typical bar food, which isnt neceasarily a bad thing, just dont expect to be blown away by the food. I can see myself coming back here for happy hours in the future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cqyNFAUvgXcSdwir8MThzw",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Big Game Burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cqyNFAUvgXcSdwir8MThzw/o.jpg"
      },
      {
        "img_id": "oY7SvLZN7J5OIYCvKeBw6A",
        "caption": "Photo of Redbeard's Sports Bar &amp; Grill - Pittsburgh, PA, United States. Loaded Nachos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oY7SvLZN7J5OIYCvKeBw6A/o.jpg"
      }
    ],
    "user_id": "KKblXUNxSGCewpDxiiSRQA"
  },
  "TktgYRLQuxESlbGdCYphWw": {
    "date": "7/14/2018",
    "text": "We needed something to eat on a Wednesday so we saw wing night on the door and went it. It's all you can eat for like 13 bucks as long as you buy a drink. We just got the beer special with the wings. You have you buy 10 first then orders of 5 after that. Our server was great and very attentive. We ordered habanero bbq which is our fav honestly. It's hot and sweet. We got fire cracker and garlic parm as well but the hab bbq is by far our favorite. The only drawback for me is I don't eat enough wings to really make it worth it. My boyfriend had over 20 wings. I only had about 13, so to me, it's not really worth it. I like the per cent wings so if I only want a few, I can get it. We had fun and it was good but I don't know if we will actually do it again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AKMRMIIPSHzp4KD76Z9Tgw"
  },
  "YMR4WEh-NcY-WkqQkeGwIw": {
    "date": "1/28/2012",
    "text": "FRIED PICKLES FRIED PICKLES FRIED PICKLES...get it?! Love their fried pickles. Its truly about the only reason I ever go, is when I can't fight the urge of holding back from those fried pickles. All the other food is nothing but better than the average bar food. Good beer, average service, terrible fried mozzarella logs..yuck! But its the place to go on the mountain for those damn pickles.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nbgjz4S8-OCGkVn7-9R5Ow"
  },
  "WaW-dmG2MBwoNCqiPSX2Ng": {
    "date": "4/11/2015",
    "text": "I've only been there for all you can eat crab legs on Mondays.. Probably 5 times.. Super good legs.. And the price is reasonable.. The fries you get are fillers.. But really good.. Definitely worth a shot if you love crab legs..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LV8Oau7xYp38FrIFx4JqXA"
  },
  "KLkFkCojdIJwUPLj0GG76g": {
    "date": "10/23/2009",
    "text": "Well for starters I want to say I have no idea why the title says Red Beards Mountain Resort and Yacht Club because really the place is just called Red Beards. However, the address is correct.   So, I love the food at Red Beards. Its a good place to go and eat, listen to music, play darts with your friends, have a beer, and even make some new friends just as long as their not the thugs from the bad part of mount washington. I frequent this place occasionally and I have fun. I especially go there when I have the munchies haha. The service is usually good and prompt. I never leave disappointed.  I was there last night with a friend. This time around I was disappointed. We sat at the bar and the lady approached us. It was immediately noticeable that she was not in a good mood. I am not a beer drinker I am a wine person. Well note to anyone who orders wine never get it at redbeards. The merlot which is my favorite tasted like shit or better yet I should say really cheap merlot. Whatever, I let that slide. I mean really what did I expect.  Anywhom, we asked her several times for our menu and finally she brought them. I ordered buffalo tenders with blue cheese a side of fries with cheese dip. My girlfriend ordered grilled chicken with broccli and mashed potatoes with a side salad and blue cheese. Once we gave her our orders she asked us for a card. I said we are paying with cash. She sighed loudly as if she was annoyed. Walked away and we never saw her again.   15 minutes later another lady brought our food. My girlfriend got her salad with her food and my tenders came with no blue cheese. That was fine we just told her and she apologized. So then all was well. We enjoyed our food with our cheap ass wine and listened to some music off the jukebox. Finally we get our checks. I notice I am charged 50 cents for my blue cheese which should've came with my tenders. Whatever, no biggie just take off the 50 cent. The new server goes to tell the old server about it and she looks at me like im a bitch. Its not my fault you fucked up but w/e.  The new server comes back with my check. She apologizes. I ask her how the tips work and she tells me it will be split between her and the other server. I explained to her what happened and she tells me that the old server is actually the manager. Thats when I inform her that her manager is a bitch. I give her $4 and the tell her to give the manager a dollar.   Basically Redbeards is still good for a cheap eat, apparently cheap wine, and a nice cold yuengling. I still say go there and eat. You'll have a good time. I just didnt appreciate last night and the service, but no big deal. I'll be back.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "j5gVSq-dBGL7zFHh15rZ2g"
  },
  "y8Y90XSSBp8PAEWaLhj9sA": {
    "date": "2/25/2013",
    "text": "The pot pie special sucks.  It's underdone and the crust was gooey not crisp.  Our server knew there was a problem and avoided our table. In fact he went out of his way not to serve us.  Not a good experience.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "_rwpvCKhjg-bpeFBzxSG4A"
  },
  "kOSXWXaZV8Q-l7JfrM-mDA": {
    "date": "9/12/2014",
    "text": "Was traveling to Pittsburgh and decided to grab a bite before the baseball game. The menu claimed that they had crab cakes that were better than anything found in Baltimore including the Ravens. Pretty bold statement especially when everyone knows that blue crab is king around the Chesapeake Bay. I decided to try them just to see if they could back up their statement. Well, they really sucked, and apparently the Steelers do too seeing how they go whipped by the Ravens last night. Stick to what you know Pittsburgh. I'm sure your perogies are the best in the US.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "chtroKXDIhri6csdoyKHNw"
  },
  "zrWvFa_y3D3egEQyv5Oyng": {
    "date": "3/6/2008",
    "text": "I was here most often when I lived in Mt. Washington.  The scene is pretty twisted.  You've got some local thugs that may be visiting from Allentown and you'll also have just  your regular types like me and other older locals. Sometimes you'll see a few folks in suits.   The bartenders are pretty good most of the time.  They used to have one guy named Dustin who had a pretty good record with beating the spread in football games.  The food is surprisingly good bar food.  I think their mozzarella sticks are the best i've had, and super healthy for you.  And, by healthy I mean not physically but mentally.  One last thing, it's neither a resort or a yacht club.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1TkFY3Z_g62uZ6xNhAhXoQ"
  },
  "VFC8_Kw0om_98eJhpUfIMw": {
    "date": "10/3/2011",
    "text": "Another place that my friend Justin always takes me to. The food is pretty average, and the beer isn't cheap. It's a bar, and the staff is ok for what it is I guess. I just don't get it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Pj91NFPtXWeIDaLp2kuyw"
  },
  "9wRf1qYceNFAlc7l1VmPCg": {
    "date": "6/19/2013",
    "text": "Wow, where to begin. I've been to Redbeards plenty of times, and although the waitresses were never the best, my last trip was putrid. My friend was personally insulted by a waitress after he took 30 seconds to pull out his I.D. She claimed he had an \"attitude\". I've come across this erratic behavior from staff at Redbeards before, I usually could deal with because of the convience of redbeards being a quick walk from my home. BUT ENOUGH IS ENOUGH. I will never patronize this establishment again. Also, the owner is a total snob. Doesn't seem to like having anyone their who likes to have a good time. This is a young area, embrace it and you would probably do better with that nice hunk of real estate. AMF.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fbece5HrPcgypXl2etE4gA"
  },
  "pjpDZsichsmVG5kXmwH3Sw": {
    "date": "4/25/2013",
    "text": "Went from never having a meal there that wasn't excellent to wanting my money back. New menu, and perhaps new cook?? Sorry to see it tank.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M2RHC0ivIcB7-dxVsO7PFA"
  },
  "CezNIADlk8yss2Gg87qOpA": {
    "date": "9/23/2010",
    "text": "I like Redbeards.  The patio is nice and provides a fun ambiance for Shiloh Street...  Happy Hour specials are good.  I've had their mozzarella sticks which are massive but good.  I haven't gone here on a weekend night.  Bartenders are nice and so are the waitresses.  Only downfall:  they need a website.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g3V76Ja0XgWS1rqx0gxL_A"
  },
  "Ljy1mgRqKJ2R2EBw9nXHsA": {
    "date": "2/8/2012",
    "text": "Great bar food and atmosphere. I usually get the grilled buffalo chicken wrap. They have good beer specials and a unique crowd. Only problem I have is with the salad options.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OBtqOF_cBMjMa_8UozOO0g"
  },
  "CBHOLsAD95-yYuE8e1ouGw": {
    "date": "10/5/2008",
    "text": "Awesome location, acceptable beer selection, very good pub food. Clean and spacious inside, patio heaters make the outside seating area really comfortable. And it's about a block from one of the greatest city views in America! I'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oNi9SaxYjKtwbdg9yMv54Q"
  },
  "Id5hKXiuDuy9VMwO_l3_MQ": {
    "date": "2/17/2014",
    "text": "There are a few bars to choose from in Mt. Washington, I work up here so I go have a beer or two with lunch every day.  I go to Redbeard's because the staff is friendly (Bridget and Pat. the bartenders during lunch time, are the best.), the food isn't expensive and it's really good!  I leave there full and satisfied every time.  I recommend the burgers, if you want a good burger in Mt. Washington don't go to Packs & Dogs.  Redbeard's will give you a real burger not a little girl burger lol.  Good selection of beer too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "diq97ZN5hG_HVsbopHE92Q"
  },
  "uB75KWQX4vEWKFzSXNbdnA": {
    "date": "7/12/2014",
    "text": "All the food that my group had at Redbeard's was sub-par. It wasn't downright gross, but it was just your typical greasy bar fare. No one finished their meal. The service was good enough, but they give you a hard time about substitutions. For example, I wanted sweet potato fries as a side and was fine paying an upcharge for them, but they told me I had to order the entire appetizer and they wouldn't do a side, even for an extra fee. They offer outdoor seating, which is a plus.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lLZxjm_7eDxUCDNVaE1fcA"
  },
  "Szd2h1yHBoto8MACC-05vw": {
    "date": "10/15/2013",
    "text": "I don't give 5 Stars unless a place is perfect.  I go to wing nights a lot; it's kind of a thing. This place did not disappoint. The wings were cooked brilliantly, the flavors were very unique (some better than other's but that's clearly a personal taste), and the over all vibe of this place was very welcoming.  The only downfall to their wing night is that you must order 10 wings at a time. 10 wings is too much; a more acceptable number would be around 6. Most places I've visited do 5 to 6 wings per order; it's worked for Quaker Steak, hasn't it?  So other than that odd down fall that shatter's my OCD like it was dipped in liquid nitrogen and smashed with a hammer, I was impressed by this place.  Get the \"Giddy Up\" wings and \" *something* Chili\" wings. They are by far the most unique and the best in my opinion.  See you around, Redbeard's; I thoroughly enjoyed going to your establishment.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "PNDh-BG7to5x9HG2_W3miA"
  },
  "Q6h51o6pzmu_RI20zDVEmw": {
    "date": "11/20/2014",
    "text": "Fantastic! Not from around here yet felt right at home! Great wings and cold beer for awesome prices! This bar has such a cool balance of old local heads and a young crowd - it was so much fun! A must visit especially because you take that mountain cable-car incline thing up the hill to get there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kxxqUuTNMBIqtNef9-9qng"
  },
  "oJ2xkSUmWYglcT7wFcvjXA": {
    "date": "9/19/2014",
    "text": "The fish is pretty good not the best in the area. Hit Piper's Pub for that. My boyfriend does not recommend the rest of the food, it's mediocre. The service is odd. We wanted a booth in back and they said they couldn't sit us there because it was a five top so we had to sit at a table in the middle of the room. Been there many times, now that we live in beechview and not mt washington we won't be going back",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jK-PfH3Jwvb7k-7Ge-s00Q"
  },
  "6N4ZGbzG6oZJ3jp6jr6hfg": {
    "date": "7/27/2011",
    "text": "Ah Redbeards.  I sorta kinda pretended like I lived on Mt. Wash when I was in college (pretty much spent the night at my friend's apt. there every night).  Redbeards was always a staple.  I can't remember if they're still on the menu, but the buffalo onion rings? PERFECTION.  I am an extreme lover of buffalo anything, and onion rings, so this was the best thing someone could put on a menu, for realz.  You have to love a bar where you can get stuffed hot peppers as an appetizer.  So very Pittsburgh, so very awesome.  Great atmosphere for grabbing some old ones and watching the [insert awesome Pittsburgh sports team name here] game, too.  I can totally envision the high-fiving and chest bumping strangers-that-are-now-friends under the common banner of sports teams after we score a [touchdown, goal, homerun].  So to all the current Mount Washingtonians I say this - if you haven't taken a stroll over to Redbeards yet, DO IT NOW.  You'll miss it if you're ever gone.  *sheds a tear* *searches online for a place to get Iron City beer in Charlotte, NC* *googles a recipe for buffalo onion rings*",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "8Sx-NgLzyCBBWT-IKBt9Fw"
  },
  "86gjeUa1Bn1HXCvfwRz9FA": {
    "date": "6/20/2011",
    "text": "Oh, Pittsburgh - you may as well be in Iowa with the selection of late nite eats available. This is how we ended up at Redbeard's. *sigh*  The menu is pretty extensive - so I got pretty excited at first. I wasn't in the mood for 'typical bar food'. I did enjoy the fried pickles - the pickle was nice and crunchy and not some slimy mush inside a fried shell.   I ordered the grilled chicken kabobs. Simple and easy, right? The chicken was not grilled...at least not initially. What I deduce is that the chicken was pre-cooked (poached!) and then pulled out of the fridge, added to a skewer with raw veggies and thrown on a grill for 2 minues. The veggies were still raw when they were served to me. Onions, zuchhini, and green peppers - all veggies that are fine raw, but not in this case. The chicken was pale and rather grotesque looking as well. The rice pilaf was probably Uncle Bens 90-second rice pouch as it was bland and had that 'pre-processed' flavor.   Unfortunately, I wasn't drunk enough to think the food was good. The late night bites quest in Pittsburgh continues.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0Tkq4VV8dD6t8NbBxvBPA"
  },
  "vGVICqTJ7c65IO8cHKAv8A": {
    "date": "4/23/2016",
    "text": "Great balls of fire wings were fairly hot and tasty. Taco salad as great; fresh and lots of flavor.  Ruben sandwich was real good and they held the thousand island like I asked.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "isFqBh-Jg92UAizzHM0-mw"
  },
  "67OpxQ3rvaN3FnQxCgqjfg": {
    "date": "9/18/2016",
    "text": "Ok let's start off by saying first of all that it is steeler Sunday we walking into this place that we have visited many many times and truthfully with the poor quality of food I really can't explained why we stopped. Well we walked in and boom table open at the door but not a good view of the game because the Huge tv in front of us had the patriots game on , I guess to make one table of two chodes happy. Anyway we waited 10 mins no waitress, so went to the bar and after waving the bartender down I said I would like to open a tab and told her we are sitting at the table , thinking she would say I'll get you folks a waitress . No she said that's fine, lol well at that point I said before I get my drinks can you turn the steeler game on so we could watch it and she said \"oh no those 2 guys next to you want to watch the patriot game! Lol she said we could move to the corner cove in window and she would put the game on there!!!  Lol really needless to say I will never be back to this very very very poorly managed with no direction place ever again and urge everyone else never stop!!!  Sooooooooo pathetic!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eveGjNAsPcBOaaHDWgPY3w"
  },
  "KBX9deBBw8ZaMAIl5SK6lQ": {
    "date": "6/18/2015",
    "text": "Awful experience. Mushy wings. Incredibly slow service. Took 1 hour and 10 minutes to get our second round of wings on all you can eat wing night. Funny tasting beers. The waitress had 10 tables from the back of the restaurant all the way to the front of the bar. She was running like crazy but did the best she could with the situation. It seems like the restaurant is terribly managed now. It used to be a great place for wings. I'm not sure what happened but I'll never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "K-_shinh6HwZRpNtVgzRuw"
  },
  "s8Km4NTY5pPYweID8OFedQ": {
    "date": "4/4/2016",
    "text": "was told by a local to go there.  It was fine...bar food.  Waitress was really good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sZ91zrHmJMYt6RVuQn13jg"
  },
  "e-6tkXjW-rQXwmv-9sTQGw": {
    "date": "7/10/2014",
    "text": "First time here, and the food is excellent. Our bartender, albeit sweet and very friendly, seemed rushed and took a long time to get to us even though she only had about 8 guests. Plus, we waited almost half an hour for a salad. Will try again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tjO5BcdIYgaUcSswH9lZLQ"
  },
  "gOmP3nRj7M86OTON064VFw": {
    "date": "5/23/2015",
    "text": "Food.was average at best.   But the worst part of the nightnwas the server experience.   Waitress misplaced the order and didn't get it in for over 45 mins. 30 minutes later the food arrived but it was tough to palette since our table of four was fuming, watching tables.all around us get theor food earlier than us, even after they sat ling after we did.  Waitress and manager didn't seem to care at all nor tried to make things right.  Would never return here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "06C8B7CJlw3PuKcq4ne4zw"
  },
  "I41jxWZZx1O3cE9ZdvDjwg": {
    "date": "11/21/2010",
    "text": "Resort? Yacht Club? If this is what you are looking for you are definitely going to be disappointed (PS you are in Pittsburgh on a Mountain so I hope you aren't expecting this).   I have never eaten here but the menu looks like typical bar food.   I have drank her 4 times in 4 different parts of the restaurant (dining room, patio, bar and table in the bar).   Service: Surprisingly service was good everywhere but the bar. We sat for 15 minutes before we got our drinks refilled at the bar. The male bartenders were the only ones to ask if we needed another drink.  When I sat at a table the service was always fast.   Drinks: Average prices. Decent Selection but nothing to off the wall.   Atmosphere: This place is loud but not too loud (still can have a convo).  Bright but not too bright.   Normally a decent crowd not too tool-y.  The patio has a fireplace with was clutch on chilly fall nights.   I have always had fun here.  Most of that has to do with my company (dates and friends) but some was definitely due to the bar.   Solid Causal Bar",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "IKnLl7SbuP0u6HS34jwHhw"
  },
  "QKLLqz4k_B333TOlXhdB4A": {
    "date": "8/21/2013",
    "text": "Excellent service and very attentive. Had the loaded fries and grilled chicken sandwich, which were both good. Solid bar food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N5t7wxTxKPLng8NIrr1S7Q"
  },
  "t2yu4kQSjfVXehL5vP7tQw": {
    "date": "5/30/2012",
    "text": "I disagree with Darren a little. The shrimp jammers were very good and I liked my Pulled Pork sammich. The service wasn't that great, though, but that would be my only complaint.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "7AGLlj5YzqdBfCPiZCa1mQ"
  },
  "fUi_V1YneErAJXTFyNV2CQ": {
    "date": "3/28/2013",
    "text": "Excellent food, expensive beer... $6 for a southern tier dipa",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "syOzbS33JeEkoJim2L3Vxg"
  },
  "qzT3q-f--F66Mws2UwWZFQ": {
    "date": "10/4/2016",
    "text": "If I could give a negative amount of stars for this place I would. I decided to stop for food with a friend last night here. I usually go to the restaurant in downtown on 6th, where the service is great. This particular Red Beard's on Mt. Washington I can't say the same. My friend notified the manager she didn't like her drink, her cup still completely full and the manager, Michelle, responded by saying \"well you didnt tell the waitress (Christine) you did not want it\". My friend told her that Christine did not ask. And Michelle said that asking how your drink is was not something waitresses usually did. (are you serious??) Also, I told the waitress I wasn't finished with my plate and she looked at me and still took it away. She ignored us and never once were we asked how our experience so far there. Long story short, the manager as well as the waitress had awful skills in hospitality and I told Michelle about the way my friend and I were treated while dining at the restaurant and she did not even apologize. NEVER WILL I EVEN CONSIDER THIS PLACE AGAIN. Terrible service. I would recommend any other place on Mt. Washington, except there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zq2POe8PUHAbUMLUD8e9Kw"
  },
  "-tIyQ61Y-Qay1Hwm8W3Tjw": {
    "date": "5/23/2015",
    "text": "Food was okay... Typical bar fare. Solid beer selection. Patio is nice on a pleasant night. Service was poor. Food took over an hour. Manager wouldn't even comp the apps. Not a repeat visit.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WW-1ExT7pPbdqg03CDx0vg"
  },
  "zavN5SUoYBAQ018lJn4QUQ": {
    "date": "11/22/2010",
    "text": "Our party of 4 stopped here while in Mt. Washington area. Overall Summary:  Open late if you are in the mood for appetizers and drinks.   Food / Drinks:  Classic fried food; a few vegan selections; grilled kabobs was interesting but nothing stellar.  Drinks were slamming; go for that.    Service:  Staff members are attentive.  A little slow during game time, but that is to be expected.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S5s3KeVRVX4XrTw4y8XcCw"
  }
}