{
  "_BBQwl0jCrNILvraGgEBiA": {
    "date": "7/6/2012",
    "text": "Waited FOREVER for our food; pizza was alright, pasta wasn't fully cooked and the meat and marinara sauce tasted store-bought at best. Atmosphere was non-existent. Bathroom was hot and NASTY. Waitress was nice.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HpNlSgf8qTCuVhxLz8lE2Q"
  },
  "R5vY3bP5fEY9mlAsyOmB5Q": {
    "date": "2/21/2010",
    "text": "We went here on a recommendation from several random people we ran into while in Pitt.  The pizza was mediocre (crust was plentiful but bland).  The service, however, was terrible.  It took forever for them to take our order, forever to get our food, and (you guessed it) forever to get our check.  I'd pass on this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "on-Qrl1jinXhI0MNMo8MvQ"
  },
  "v18lPUYJr_Mpdde3BJSRiw": {
    "date": "4/22/2016",
    "text": "Four stars for the pizza!  We had planned on eating at Lidia's after touring the Heinz Museum.  We left the museum at 4:00 p.m. and Lidia's bar was open, but the restaurant didn't open until 5:00.  We were famished and aren't drinkers, so we decided to walk into the business part of the Strip.  It was a Monday, so Luke Wholey's was closed and we were getting desperate.  We spotted Bella Notte and I remembered seeing people dining outside on pizzas that looked wonderful in past years.  One of our group of three ordered a pizza with mushrooms and green peppers.  Two of us ordered pasta dishes.  The pasta dishes were average.  They were drowning in sauce.  I had the ravioli and they weren't bad themselves, but too much sauce and it needed some sugar and spices to cut the sharp tomato taste.  The pizza, however, lived up to our expectations (he kindly shared with us as he ordered the smallest size of 14 inches and it was bigger than we thought it would be.  Their crust is delicious.  Some parts are blackened which is the way it is supposed to be, people!  Those parts were the best.  I honestly never was a huge crust eater, but I could have devoured the entire crust with no sauce.  The service was good.  We just had ice teas which were good.  (sometimes they stink at other restaurants).  I will definitely be returning just to get a pizza and maybe a hard drink.  The restrooms were clean, which is very important to me when dining out.  This is a basic bar type atmosphere and has tables out on the sidewalk.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DECA9Z79xdPfJAuU2Hgseg"
  },
  "DRofTLBCyo1wV1sxLXevDw": {
    "date": "4/1/2015",
    "text": "My family and I were headed to Pittsburgh on March 29 for the Penguins game. My dad decided to leave a few hours earlier (two hour trip), so we could go walk the Strip because  none of us had never gotten the chance to walk it. My dad had been mentioning how much he was craving pizza on the way down. I'd mentioned Bella Notte because I'd seen good reviews on it. So we decided to go in. Mom and Dad ordered a Grande, half pepperoni and mushroom and half hot pepper and pepperoni. We all had some. It was absolutely delicious. I'm not much for overly saucy pizza but I didn't mind it here because the sauce was so yummy. The crust was without a doubt the best part of the pizza. It was the perfect texture and flavor for my taste and taste of the family also. We all came to the conclusion the pizza was among the best we've ever had. Brother ordered pepperoni rolls. They were also delectable and unlike any other pepperoni rolls I've ever had, so crisp, spicy and oh-so-good. I hate to end this review on a semi-negative note, but I must mention it. I ordered a grilled chicken salad with light Italian dressing. The salad and dressing overall was good, but nothing special. The chicken was very dry and disappointing. Overall I will totally return next time I'm at the Strip, but instead of the salad, I'll skip right to the delicious pizza and pepperoni rolls.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ezFB5R5Eb096L1S0_TxE0g"
  },
  "9RBPOiDWM5GhwTtkEKq_Vg": {
    "date": "1/7/2013",
    "text": "Came to Pittsburgh to visit and read a few good reviews on this restaurant.  It definitely produced.  Some of the best pizza I have ever eaten.  We will definitely visit this establishment on our next trip back to Pittsburgh.  I loved the ground up pepperoni on the pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rXYhwEL6BaIlacVAL1IOLA"
  },
  "InSiikPJTxnxeWBVjQqonQ": {
    "date": "5/30/2012",
    "text": "The pizza was not that <a href=\"/redir?url=http%3A%2F%2Fremarkable.it&s=c5d7edb76dedac6baa2d2d0860619e5f552aa5c834b3e8e1244f84256da255b1\" target=\"_blank\" rel=\"nofollow\">remarkable.it</a> came barely warm. One person in our party ordered a chicken wrap and as the rest of us finished our pizza the wrap still had not been served. We eventually cancelled it . The staff was apologetic .",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnOYHo9kqF65sO9ne1L8HA"
  },
  "MgeHEqCC1zE5PI77mdpXcg": {
    "date": "10/21/2009",
    "text": "This is a good lunch spot in the Strip, Pittsburgh, PA.  Smaller menu that includes some 4-5 Subs, 3-4 Salads, Pizza (Custom or by the slice) and 1-2 Pasta dishes.  Everything is easily under $10 per person.  I've had the Italian Sausage sub, it was quite tasty and a lot of food on top of a serious Italian Roll.  Go for the wrap option if you are more interested in the meat.  Salads are by far the highlight for me.  They really pile on the veggies for $5!  Add chicken or steak for another $3, (good, but pretty obvious they had been strips in the freezer earlier that day).  Decor leaves something to be desired, service is friendly enough.  Overally, fairly solid but nothing that really gets me excited.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ME1-IwMQMHkowOxffKUx7w"
  },
  "Uj6elHtaPJ-d5DtaZDpxTQ": {
    "date": "3/28/2014",
    "text": "Waiters are attentive and friendly. Although the kitchen is kinda weird, there's no seperation between the dining room and kitchen. But good food. The pizza took a little longer than we had planned. And the dough in the middle was a little under done but it was great. Thanks!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OGTq7wHzJHueyEpqJi7zTQ"
  },
  "vOCysplFVBHl2CiV56tmxA": {
    "date": "10/14/2011",
    "text": "Absolutely one of the best pizzas in Pittsburgh. Great food. Great service and great people watching  on the strip!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QXXqp9SplGzmtRYFyYZx7w"
  },
  "TtG3FQtgIh45quENtkYzdw": {
    "date": "3/14/2011",
    "text": "This place seems like a tourist trap. The food was not great. Wish we had gone somewhere else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEkzheCAccuhO2WyAQdUdQ"
  },
  "38J6dQ1YwPyOwHuwgfyYXw": {
    "date": "6/3/2012",
    "text": "Went here the other day. From reading the other reviews it looks like we should've gotten the pizza. My boyfriend and i both got wraps and they were not that great. The service was horrible. The waitress was not attentive at all and half the time we sat there wondering \"where is the waitress?\" or \"can we at least get the check?\"",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TkMIiRX-C6HHeViXv0fuug"
  },
  "KZdzIjL7isvPL-oM-eQpBQ": {
    "date": "11/24/2010",
    "text": "We were trying to get into Primanti Bros for a sub but were over taken by 2 bus fulls of high school students. Instead we hit Bella Notte as I was craving a spicey sausage sub.....OH BOY....this bread it came on was off the hook. Crunchy, chewy, and never got soggy with all the sauce. The sausage was perfect too will all the peppers and onions. YUMMY! My buddy got the Italian Satallion......that sandwich was total money!!! He said I shouldnt try Primanti Bros after this or I might be unimpressed. I am sticking to Bella Notte!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7aZmHa4tSUSw2jF1I6F9pw"
  },
  "5nbSwL8P4cf9nO4cTztIog": {
    "date": "8/20/2011",
    "text": "We loved this place.  Great pizza! ( We orginally were heading to Primati Brothers down the street, however the line was wrapped around the block and employees were yelling at customers about line control)!  Bella Notte made our frustrating experience turn into a great delicious lunch!  Love the strip district!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-vZxsDD8khuG4VlFYuhz4w"
  },
  "sDNceEBgxvlMPOGmIfd_3w": {
    "date": "3/29/2010",
    "text": "This place is NEVER Open! It has good pizza, but they need to understand how to follow hours of operation!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OQlG-3AofQr9hsAUHnn1Dg"
  },
  "nL6M1_1giR7xKoLb5Qc3KQ": {
    "date": "2/19/2012",
    "text": "RUDE AND FILTHY.  We had a decent pizza but everything els was thumbs down.  The waitresses were rude and condescending.  We were shocked at the filth, absolute filth, in the kitchen.  We unfortunately were sat near the kitchen so we saw too much.   The food handling mixed with cleaning a dirty floor and clearing dirty dishes...YUK.  We saw dirty debris swept under a serving table.  We saw a server clean part of a floor with a cloth used to clean tables.  The restrooms were suspect too.  My toilet stall had 2 large industrial plungers laying on the floor.  Gross.  We'll never return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "U-edrlSQgiXT0fiHlIbkhQ"
  },
  "f9-XXSpNdhD6WmeRz8XvRQ": {
    "date": "6/6/2010",
    "text": "We can't vouch for their entire menu, but when visiting The Strip in Pittsburgh, this is our \"go to\" place to eat -- love their pizza (sausage, pepperoni, mushrooms, green peppers and onions) and a pitcher of IC Light!  Looking forward to going there on our next trip back East.  We've never had a problem with the service -- it's always been friendly and efficient.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FKznxrjdpTwSNQzQv71EtQ"
  },
  "GuE5ZT-bBg1WECY0LrSHMw": {
    "date": "1/29/2012",
    "text": "The pizza is very good. Very reasonable priced. Lots of toppings. Greek Salad and Ceasar Salads were good. I wasn't impressed with there side salad. They are only opened to 7 on weekdays and 9 on Fridays and Saturdays. They do take cash and credit cards. Quick service. Friendly",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lW5PHOBH7Tr7KqBiWO7sgw"
  },
  "S1L7cbKqHnWOO528JrSC2g": {
    "date": "10/16/2016",
    "text": "We wandered around looking for a good value dinner with great taste.  To be honest the outside of Bella is not super appealing with the fluorescent lighting but after asking a few customers who said it was really good we decided to try it  We ordered the ranch steak pizza (substituting green peppers with olives) and the taste was fabulous - seasoning of meat was perfect cheese/meat on top was browned and the crust was crispy/chewy goodness all rolled in one - price of pizza less the $15 (16\" pie) fed the two of us with left overs for lunch   They had a great beer selection (boast 44 beers on tap) since we r not from the area we were interested In local beers which they had about 6/7 on tap  Staff was friendly enough  - definitely not as impressive as the food and not bad enough that it should impact the rating   Overall great pizza at a great price - would highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dTYeaRwHlFCvDyV0bI3IGw"
  },
  "3WVPo4wRw5xEU6kMSP4I-w": {
    "date": "6/18/2017",
    "text": "I stopped by today an hour before stated closing time and uninterested waiter told me that they are \"done seating\". Tables were filthy, trash from prior diners were all over the floor and the one party who was seated seemed to have something on their plate resembling a frozen dinner. Recommend avoiding simply due to service mentality. Or lack thereof.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UHtDEJPUof6iRS5-RT_Qrw"
  },
  "EgYO0NAs46-hW6cDxiHIVA": {
    "date": "6/28/2016",
    "text": "Hands down the BEST pizza I have ever eaten!!!! This is a place that you must stop at when you visit the Strip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EoW1ShVgJOR3_3VQQ8UGEQ",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. AMAZING pizza!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EoW1ShVgJOR3_3VQQ8UGEQ/o.jpg"
      }
    ],
    "user_id": "f3oory4mHWojDzjcDwl4Ew"
  },
  "eVJTbwVbaJUhuUZeyMRmUA": {
    "date": "1/18/2014",
    "text": "I need the 3.5 star option.  Bella Notte has a pizza on special every day!  The day we went, the special was a 8 slice mushroom pizza for $12.  It was a steal!  This isn't really authentic Italian pizza, which they seem to be trying to market it as that.  It's very greasy and cheesey.  I enjoyed it very much, though!  The greens and beans were A-Ok.  Nothing to write home about, but a fun way to eat some green veggies, as always.  The ambiance and service lacks.  We wanted to sit outside, and the tables are right on the road.  Just pray no one fails at parallel parking!  Our server literally only brought our food out.  She never checked on us.  Not once.  We had to get another server to run our credit cards.  And when it started to drizzle?  No one to offer a seat inside.  Mmm.... Not good.  Would I come back for the food?  You bet!  If you just go in to hang with friends and eat some good pizza, it's worth it!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "Ic6-gs1_FjrWGx6JIr95Mw"
  },
  "D9JU4Q1rMFNq0x5oOekO6A": {
    "date": "9/25/2017",
    "text": "Been going here for years. Avoid busy times for take out. Takes longer than quoted. Once my pizza was undercooked. Ugh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JojRk591y3O3BJ-Bkm-jSw"
  },
  "ugk8qL7Nu1ew768O0sv-JQ": {
    "date": "12/12/2016",
    "text": "This might be some of the best pizza in Pittsburgh hands down.. I recently moved to the strip district.. I didn't feel like driving far to get pizza. So I looked a place up near me, and I must say, this is some of the best pizza I've had here in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s7wWnBE_L3mOICGxkfOKJQ"
  },
  "Go_ZY_jEcCnl1mVE4FVIFQ": {
    "date": "2/12/2017",
    "text": "Had the Italian Stallion sub, it was amazing and huge! Great place for pizza, subs and salads.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kICnr23Zj6TzFDJUd9bbHQ"
  },
  "Ub-iqoA2ayKqdXt_tFfDsQ": {
    "date": "1/11/2018",
    "text": "Still awesome - but now we have branched out a bit in the menu.  It just keeps getting better and better!! I almost hate to give it such a good review - I'd like to get a table whenever I go down.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v2R5o1anrhp_BvI9tVLEew"
  },
  "l5Tw2HwDu-3PcSlTBXTgqg": {
    "date": "12/28/2015",
    "text": "We needed a place for breakfast/lunch with outdoor seating on a beautiful morning for \"Angus the Great\" Dane, and this filled the bill nicely.    The pizza on other diners' tables looked amazing, but we opted for Beans and Greens (the only gluten-free item besides salad) and a hoagie.  The Beans and Greens - soupy collards, kidney beans, sausage, and potato - was a generous portion and very tasty.  The hoagie looked fantastic, topped with a load of what looked like pizza cheese and sauce.  We also tried their Bloody Mary, and were pleasantly intrigued by its salty olive-y flavor...  It could've been enough by itself.    Service was a little on the slow side, likely since we were seated outside.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VBUP5bL7th8spEyONbcTjQ"
  },
  "qdAHqtS-6bFjph1_P9seYQ": {
    "date": "1/21/2017",
    "text": "This is probably one of my favorite places to go. Lots of beers on tap, and the pizza is FANTASTIC. One piece is all you need bachata it's as big as your face. Summer outdoor seating is a nice option in the strip too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HjwEYl5KZx8Qz5KIKD3Wuw"
  },
  "vj6LHKQiwOr-xCaqWu7dYw": {
    "date": "7/8/2015",
    "text": "The best pizza in the burgh, the staff is great. I look forward to eat here when I'm at the strip",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DuXv-CAyk-rKnVHgaTaK7g",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. I been looking forward to their calzone all day",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DuXv-CAyk-rKnVHgaTaK7g/o.jpg"
      }
    ],
    "user_id": "voyChD-aoglG2mWMySA6Ow"
  },
  "iWhIbhF5j6_RF0DDI4iZLw": {
    "date": "8/8/2016",
    "text": "Great pizza. Sometimes when I order a slice for lunch it's slightly burnt, but that doesn't stop me from coming back. This has never been a problem when ordering a whole pie. I highly recommend stopping here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LzZPZDlXiEv9adPzdN4gzw"
  },
  "F_6uo1ZWsf6FEhXngDVaww": {
    "date": "12/2/2015",
    "text": "After getting lost in time and location around the Downtown area and later around the Strip district, my girlfriend and I were starving. We then stumbled upon this pizza joint. And, man, was it good!  We had a four cheese pizza. It was delicious at a fair price for the quantity and quality of it. This definitely went to the top of our go-to pizza places list around the area.   Looking for awesome pizza, at a great location? You've found it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X4BNhZAVZ7B2y5I1VCDHuw"
  },
  "NazKP4uGlpWbw4weaZZQ9A": {
    "date": "1/16/2017",
    "text": "Great pepperoni pizza.  Large slice, small price.  Attentive service, love the smell of the ovens !  Doesn't get much better in the burgh.  Been there alone, or with friends or family. Predictably good every time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dVq0qgeo3F3nmzGjDYElEw"
  },
  "0bRwwUmZ09xlTTk6YNI05g": {
    "date": "9/6/2012",
    "text": "This place is a straight up joke, after my first bite of the \"greens and beans\" I half expected Ashton Kutcher to come out yelling punked.   Wow how bad can Italian food get in the Burgh?   I sent my greens and beans back. The greens were burned and the inside of the dish was cold while the outside was hot. The place was smelly, like moldy rag water and the food was disgusting. The greens and beans were noticeably microwaved and who knows how long ago they had been prepared.   The IC Light was on special for $2.00 drafts. That was Bella Notte's only saving grace.  More amusing then the pitiful food was the fact that Maury was being played over the bar on a 52in flat screen.  Every 5 minutes are so the signal would get lost on the tv.  That place is fairly trashy.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tL3shE1Jn8_Viw2Di2wIwg",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Cheese Pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tL3shE1Jn8_Viw2Di2wIwg/o.jpg"
      },
      {
        "img_id": "ya2Lmqs9iZ05ZntJ8ICBuw",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Green and beans with potatoes and Italian sausage",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ya2Lmqs9iZ05ZntJ8ICBuw/o.jpg"
      },
      {
        "img_id": "SKReATkuhAk_rowjvpCyqA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Bella Notte signage",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SKReATkuhAk_rowjvpCyqA/o.jpg"
      }
    ],
    "user_id": "V7uS5US4oTf-S9u36HJQCQ"
  },
  "ZSoH6UZkrv87FNGoPVXqQQ": {
    "date": "3/30/2016",
    "text": "Stopped in briefly on a Saturday while shopping. They had awesome mimosas at $5! I was really impressed with the service (attentive and speedy). We weren't very hungry, so we didn't order any food, but I did get the strawberry banana gelato.  It tasted delicious and was a decent portion! Would definitely come back to try the pizza and have some drinks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y4PuxA3yRL-j02kDMhy1zQ"
  },
  "D0FbrULOap6aJrAiqPGjPw": {
    "date": "10/5/2012",
    "text": "Great pizza though my personal favorite is the cheesy garlic bread (forget the restaurant's name for it).  HUGE PORTIONS!!!! One slice is enough to satisfy a healthy man's appetite. The calzones are more like large pizzas folded in half. Don't order a salad and expect gourmet... they are very straightforward -- lettuce in a wooden bowl with some powdered parm cheese, a couple croutons, and a packet of dressing. Order the pizza, people!  Service could be better but the food is yummy and cheesy :).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wh7yz5cZKi-nMhyLhUIM0Q"
  },
  "CE-IiVrE-qeKvAvhUVwSGA": {
    "date": "8/17/2014",
    "text": "I have not been too thrilled with the many pizza places I've tried around the city, but Bella Notte was a great change!  They have a prime location in the middle of the strip with plenty of covered outdoor seating, an indoor dining room and then a bar room.  Our server, Colleen, was an absolute sweetheart! She took very good care of us and I was very impressed with her service.   For our party of 5, we split a margherita pizza as well as a meatball/red pepper calzone. Both were crusty and flavorful! I loved the giant pieces of tomato and basil they used on the pizza! It hit the spot and was just what we needed. I would definitely stop there again sometime to try one of their sandwiches or specialty pizzas!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5IaHGddT0RLq1-S5LbP1iw"
  },
  "3rzZnJRH8-Tzhl3RFHF8iA": {
    "date": "11/13/2016",
    "text": "stopped at the Polish deli to eat, but we were too late. Glad we were! Food was fantastic here, service was great-waitress was super friendly and funny. We were told there'd be a 15 minute wait on our table, we were seated in about 5. 3 of us got the monster pizza slice and one got the chicken parm sandwhich, and we ordered the garlic bread Italian style. The marinara sauce served with the bread I could of eaten with a spoon, it was fantastic! The monster pizza slice was equal to 2 normal pizza slices and they pile on the toppings. We came from Ohio, and I'd definitely drive the hour and half just to eat here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D5nADfqdVAhZkgS_oB6Hcw",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D5nADfqdVAhZkgS_oB6Hcw/o.jpg"
      },
      {
        "img_id": "C8N5usRlaOF4ZGg6mMWCrA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/C8N5usRlaOF4ZGg6mMWCrA/o.jpg"
      }
    ],
    "user_id": "_NYcKGHR0yyAWE0aUvEQKA"
  },
  "KW2Ny1P340pNRalOFgYk-A": {
    "date": "10/28/2016",
    "text": "Always enjoy our meals here. No matter what we get it's always great! Friendly prompt service and casual atmosphere, perfect stop while at the strip",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TbKX6nPzv3_Ys0dGNWsiog"
  },
  "_bvZuTpTXXYCnjFFfBtVZg": {
    "date": "12/19/2014",
    "text": "Fine place to eat when visiting the Strip. It's not fancy so if that's what you want, this is not for you. Decor is old fashioned but the place seems clean. Service was friendly and we got out pizzas very fast.   I thought the white pizza was good but kind of bland. My husband likes the Greek pizza better. Prices reasonable. Large portions.   I would come back if craving Italian when I'm at the strip, but would be interested on trying something other than pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xKWCgI1gxdnARCkbzwTohg",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. White pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xKWCgI1gxdnARCkbzwTohg/o.jpg"
      }
    ],
    "user_id": "mm9WYrFhiNqvHCyhQKw3Mg"
  },
  "xImW2w25MvUZ6tRSJ7tFGg": {
    "date": "6/15/2016",
    "text": "Sipping $6 Bloody Mary's and $5 Mimosa's outside on a sunny Tuesday at 10:30 in the morning in Pittsburgh.   Can't get much better than that.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8-0RZ_xxq_RHO5KrQ8BIvw",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8-0RZ_xxq_RHO5KrQ8BIvw/o.jpg"
      }
    ],
    "user_id": "mAqj8WY-uHncPpCn3ahCiA"
  },
  "fTEANZqmdA_qnYiM3JKg2w": {
    "date": "3/21/2018",
    "text": "We stopped by on St. Patty's day and the margarita pizza was so good! Our server was really sweet & attentive!  Great lunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1KXZZIMpqaCmPSVvzcGl4Q"
  },
  "XZP03PBj9xsIPdBabRB3zA": {
    "date": "3/10/2018",
    "text": "Food was decent but not great. The noise is really loud form people but there wasn't even a large crowd. Our service was really slow, took a long time for anyone to even get to our table. Would not particularly recommend to anyone unless you have a large group who only want pizza.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DmniLKyRqXiCpJWD5KorWw"
  },
  "9CTvowxVobCEJK8LTN4frQ": {
    "date": "2/18/2017",
    "text": "Saturday afternoon was crowded but worth the wait.  Medium pizza was huge, could have done with a small and it would still be to much. But oh how good it was, yummy.  We saw a meatball sub go by and thought would have been nice also.  People having a really good time while enjoying the great food.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8Pzo1SzMU4ZQKPnfkoxItQ",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8Pzo1SzMU4ZQKPnfkoxItQ/o.jpg"
      }
    ],
    "user_id": "Z_9jxWmFDNkLQg2fZJ7ILg"
  },
  "_HDRP0f4A-w79zz_i8_Ccg": {
    "date": "8/16/2016",
    "text": "Being an avid traveller I found myself wandering through Pittsburgh yesterday. On the recommendation of a local, I decided to try Bella Notte although usually I try to avoid pizzerias for their normal simplicity. I must say that I was beyond impressed. Not only did I try their specialty for the day (which was seasoned perfectly, cooked evenly and absolutely divine) but I also tried a local beer, and had the chance to talk to the staff. I learned that Bella Notte also provides breads for surrounding businesses and donates all their left over products at the end of the day - allowing them to maintain their fresh menu, as well as giving back to the community. The staff was knowledgeable and the beer selection notable. Next time I am in town I will certainly be coming back through. Thank you for a slice above the rest!   Additionally I was shocked that my beer and giant slice of pizza were only $9 together!! Great value!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lKLCijnplgxQHRrYoddmAg",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Absolutely fantastic!! Delicious food, great atmosphere, welcoming staff!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lKLCijnplgxQHRrYoddmAg/o.jpg"
      }
    ],
    "user_id": "KITUzn13cY-oIDevIZuwAw"
  },
  "cJZOAlA2AQJIyw32VYGDyA": {
    "date": "6/11/2016",
    "text": "Been here for Pizza several times. Today, calzone - wow! Spicy sausage was spicy and so good. It was huge. We will be back!   Our waitress was friendly, fast and efficient.   Places to sit on the sidewalk if you want to watch the crowds on the Strip.   Staff all seemed to enjoy working there.     Oh - and got a cool glass with my beer of the month selection and for only $5!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "faZ-cV_k6_QJDzgmZwtiCA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/faZ-cV_k6_QJDzgmZwtiCA/o.jpg"
      }
    ],
    "user_id": "Cmeyk9lZDsdWoxIW_rKQ9Q"
  },
  "eO_971IU1iVj2thuAHHOwA": {
    "date": "1/15/2016",
    "text": "Pretty good pizza. My husband was in the mood for pizza so we decided to give this place a try after many many times of walking past and seeing the displays of cold pizza and the many people dining outside with pizzas and bloody mary's. There's nothing fancy about this place; it's your typical pizza joint, really. For some reason, my husband (who was craving pizza) decided to order the chicken parm sandwich and I ordered a plain pizza. The sandwich was average but the pizza was the star (duh). The crust was crispy and not too salty, the sauce was sweet and the cheese was thick. They do not skimp on the cheese here. It was a little bit too much cheese for my liking so I would order extra sauce next time. However, for cheese lovers out there, this is the place for you. To sum it up, this is one of my favorite pizzas in Pittsburgh, next to Fiori's in the South Hills.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xQTGEB6Q-RcBlvbGA1gOkA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Plain pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xQTGEB6Q-RcBlvbGA1gOkA/o.jpg"
      }
    ],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "I3FLu-QI2n-8rCEhIEfhUw": {
    "date": "12/3/2016",
    "text": "I'll preface by saying that I'm from the pizza capital of the world (New Jersey), however I went into this with an open mind... and I was mind-blown. The pepperoni roll was an excellent appetizer, and my buddy and I got a 16-inch pepperoni and sausage pizza. The crust was some of the best I ever had. Wish the pepperoni was a little more prominent, but overall it was some great pizza. Loved the environment, also. Spacious and had a bar. Highly recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H4z5--bmXuAoMC9zqIlKRA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/H4z5--bmXuAoMC9zqIlKRA/o.jpg"
      }
    ],
    "user_id": "8ays-41mqyHVAR1NHNcRtw"
  },
  "3l_mwnba87a7EHTXEyUVsg": {
    "date": "11/14/2016",
    "text": "Without a doubt the best pizza I've ever eaten!! Came here on a Monday around 2 o'clock, not too busy. I ordered the buffalo chicken pizza and it came out hot and sooooo delicious within 10-15 minutes. My waitress, Bre, gave great service and kept my drink filled as well as the other 5 tables that I could see. This restaurant is one I'll definitely remember!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u4UM3qUDxi9qA9-5eE2Nsw",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. BEST PIZZA EVER!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u4UM3qUDxi9qA9-5eE2Nsw/o.jpg"
      },
      {
        "img_id": "3Woa1pu47NLdu6uL3kUjZQ",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3Woa1pu47NLdu6uL3kUjZQ/o.jpg"
      }
    ],
    "user_id": "Nipm-nMomUoXT6qgozP8ww"
  },
  "OfNlGCmFUWMOcYZ1sNMmiw": {
    "date": "12/17/2017",
    "text": "Had to get that breakfast pizza on a Steelers game Sunday! The meat option is topped with a nicely spicy sausage, bacon, and ham--yum! Cheddar cheese just like you'd get in your omelette, no sauce so you'll have to order the bloody Mary to get your tomato flavor fix. Be prepared for a pretty salty spicy cocktail, though. My friend got the mango mimosa and said it was tasty!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-QfpQQAC_h1JqiNx_jKXhA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-QfpQQAC_h1JqiNx_jKXhA/o.jpg"
      }
    ],
    "user_id": "ltoJ_wWgGCqZrdMqzxenOw"
  },
  "qOvYPb5T1nrS1zQlcTzMrw": {
    "date": "10/16/2016",
    "text": "We just ate here with a group of six. We're from out of town and had no idea that the restaurant was closing in 20 minutes.  We we're seated on the sidewalk tables. And our waitress (her name was Amanda) didn't tell us about a last call then was very rude when our party asked to order more drinks. Amanda even went as far as lying to us saying that she told us there was a last call. She neglected to stop by our table often enough for refills and brought us our 2 pizzas but didn't show up with plates for us to eat off of for 5+ minutes. Amanda might be better off working as a greeter at Walmart.   The margarita pizza was a bit soggy, but the barbecue pizza was pretty good. They also serve lemonade in flimsy plastic cups...",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MpyqGRvSVgIVtxRP1jhV7w"
  },
  "SHZbgbwK0bKwhEz8rMUwYw": {
    "date": "8/1/2017",
    "text": "Great location for a hearty Calzone, amazing pizza, HUGE hoagies, craft beers, and delicious salads. This place handles it all. Highly recommend stopping here for dinner OR lunch. It's delicious. The prices are reasonable and the beer selection is very choice. Good place for take out (they can handle small or BIG orders) and a great location to stop, sit outside or in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "B3piSjG93U2zRxxXGFcvPQ"
  },
  "nwknT1gffeWv5-yAvFs1Nw": {
    "date": "10/22/2017",
    "text": "Awesome pizza, probably the best pizza sauce I have ever had.  Had the medium margarita and it was so big we took almost half home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ajhGMJ9xZFL7xrHr7NfOw"
  },
  "eb_iEr9gXICb9J_LBDfxug": {
    "date": "7/15/2017",
    "text": "Th white pizza is delicious, cheesy, and the tomatoes are the perfect sweetness underneath. The Pittsburgh cheese steak is as large as a coal barge and loaded with the usual on toasty, light Italian bread. Coupled with a brew and people watching, it's worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o_70R0Kd5ZArpup6YsvFKA"
  },
  "zorjhd7jo6KOMeWvcQOjcw": {
    "date": "4/23/2017",
    "text": "Our party of three waited in line for 15 minutes.  A couple who came in after us got seated first at a table for four.  We left.  Ask the fat guy and his wife with the awful 80s hairdo if the food is any good.  All I can tell you is the service sucks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XVknB-Ex5TgbCQkAnwBKXg"
  },
  "P2XJbQZmf1zvWp9L_THdjQ": {
    "date": "9/1/2014",
    "text": "Deja-vu Time: I recently had myself an Italian \"Stallion\" hoagie from Greentree's Other Place. Prior to a concert at Altar Bar (I might as well get a loft nearby), I had Bella Notte's Italian Stallion and was duly impressed.   While almost as large as Other Place's, which utilizes a whole loaf of Mancini's bread, Bella Notte's is a hefty foot long of toasted bread in its own right and contains mortadella (!), genoa salami, capicola, pepperoni, provolone, and the usual l-t-o. Punctuated by an equally pungent housemade vinaigrette, I'd say Bella Notte's and The Other Place's grinders would fight to a 12 round stalemate.  P.S. The service was fine, and no drunken mole-men were encountered this time.  P.P.S. I'm still baffled over Bella Notte's average 3-star rating. Give 'em a chance, people!",
    "rating": 5,
    "rated": {
      "funny": 9,
      "useful": 12,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "tiAOBNzhu5kCMZM_QyMQVw",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Italian Stallion hoagie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tiAOBNzhu5kCMZM_QyMQVw/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "jI5hf_kocNImRNfXQen5pQ": {
    "date": "5/17/2015",
    "text": "Outstanding.. mouthwatering  meatball calzone !! I have had it several times and its better each time.  Hoagies are fresh and delicious.. and the bruschetta.. well one word.. Bravo",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "SadavIWfYc2uDaITEndbfA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. bruschetta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SadavIWfYc2uDaITEndbfA/o.jpg"
      },
      {
        "img_id": "HfkhP0QAkHZVcLVmgy4jmQ",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. meatball calazone",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HfkhP0QAkHZVcLVmgy4jmQ/o.jpg"
      }
    ],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "iE0ns5JWM60h-dMwKBjEPA": {
    "date": "5/10/2017",
    "text": "This is our \"go to\" pizza place when our group wants to get out of the office  and take a stroll down to the strip.  Their monster slices are huge!  Great pizza though and today I had a Caesar Chicken Wrap and it was quite delicious as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "d9PdhaDzpXUg6MRqZ_1Dvw"
  },
  "g4VSgeqh4bnLHYGGF6DgOA": {
    "date": "8/22/2016",
    "text": "Pizza was excellent. Very fresh and simplistic. Dough was perfect. The margarita pizza was my favorite! Prices are very reasonable. It is a great place for lunch.  I sat outside - the inside needs a little update.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "szptHakZyO_89FTvraCwXQ",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/szptHakZyO_89FTvraCwXQ/o.jpg"
      }
    ],
    "user_id": "6xfUgjxHs7XZGwmwbb-jVw"
  },
  "ZjBmeIMfEfH6tAHWf-L9-g": {
    "date": "12/14/2013",
    "text": "44 taps of beer!!Say what!!?? I give this place a 5 stars for the beer alone. Redds apple ale on tap is so sipping good and my husband had a manly mad Elf beer. Didn't try the food. Bar atmosphere was nice and not a creepy hole in the wall.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TyLGnt454LvVYKOdVFsWbA"
  },
  "UkIrldoOx65kUNw7Z9B13Q": {
    "date": "11/9/2015",
    "text": "Great pizza.  Definitely has it's hat in the ring for best in the city.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ccfpvkm3EbknRoftH10wKA"
  },
  "0Wz1hOXt7ytTw34_Qikuxg": {
    "date": "5/13/2011",
    "text": "EDIT: They really did change the service up since I last posted this.  Horrible service.  Used to be my favorite pizza in the city (at a reasonable price), but I'm rethinking that. We just had an altercation with a server who refused to split a check when we were paying with cash. He then proceeded to disrespect the party at the table, telling us to 'not give him attitude about it.'  Sorry Bella Notte, but we're not children. I don't care if you're working hard - it doesn't give you any excuse to disrespect your paying customers like that.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "OJ0dSpMOOfhkBFKt9oPkJA"
  },
  "uaQjCmQ9BuMtoujSIDBIXQ": {
    "date": "11/18/2013",
    "text": "Wonderful pizza! Very rich crust with a good helping of cheese. My wife and I wanted a good pizza for dinner and this surpassed our expectations. The peppers and onions they used were obviously freshly chopped and were the perfect consistency. I called ahead for take out so I cannot speak for the service. I would definitely recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_AfdZYgKa7LRdczwOfmiMw"
  },
  "5scLAftB3O-hK20PlK6aPg": {
    "date": "7/16/2011",
    "text": "I wish it would stay open later on the weekdays.  It's a great pizza spot.  The single slices are gi-normous.  The bar area is fun for a beer and watching a game.  Tonight, i ordered a medium pepperoni and mushroom to go and like usual it was a great pizza.  Fresh mushrooms and full pieces of crispy pepperoni along with little bits of pepperoni tasted great!  The sauce here is on the sweet side, crust is good.  Better than average pizza in burgh and it's home style restaurant are a win in my book.  oh and tonight I noticed the hot oven grinders looked really good!  Will try soon....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gmqnSps9DJndFQ32JJwDxQ"
  },
  "ggyOSRWGwo17M58zmaJIag": {
    "date": "2/18/2013",
    "text": "BY FAR THE WORST PLACE I EVER WAS IN   Girlfriend ordered soup which was cold. Her friend and myself ordered salad which after 15 mins we had to remind our waitress to bring out to us.Told waitress to cancel the order of bread sticks because they it was over 20 mins since we put the order in for them, she insisted to bring them to us and CHARGE us for them..and  the bread sticks where a day old loaf of bread cut into sections...",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TFS1DBeW2ZWDhyoSQ-wTnQ"
  },
  "UP3Ru0YeD-pRZQAeHHuSPg": {
    "date": "8/10/2014",
    "text": "Fabulous fabulous fabulous!!!!  This place treated us wonderfully and the Bloody Mary's are to die for!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o6AUIqIlMW0YNYZhWLTjyw",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o6AUIqIlMW0YNYZhWLTjyw/o.jpg"
      }
    ],
    "user_id": "ag1LgS-WEawPHDeLwwFFGA"
  },
  "kGlFQjbYwAFoRSDbs4jvhA": {
    "date": "11/3/2013",
    "text": "Service was agonizingly slow... I think it was because they are understaffed. I ordered the pasta of the day- rigatoni, and my husband ordered mini ravioli with meatballs. He seemed to like his ravioli, but my rigatoni was lacking flavor.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dKa12_fEaqYSKnIYwOCYiw"
  },
  "8iHcmM6XEkGLVGHrDT6zxg": {
    "date": "12/26/2013",
    "text": "After being treated very bad at their neighbor we came in to get some food and drinks. Service was pretty good and nice. The food was really good. The bread of the sandwiches and the pizza were great. Would definitely come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JqJs0ck7MsTnF833pB8aZw"
  },
  "XZt4rx6M06PLXJbgYQ0mCA": {
    "date": "12/17/2012",
    "text": "Bar tender tried to charge double for drinks during happy hour. He knew my group was from out of town and tried to pull a fast one. After we pointed out the mistake and showed the staff their advertisement on THEIR MENUS, they still refused to honor the deal. AVOID THESE SCAM ARTISTS!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gn-KC2iLFR8Z0CtbcNl7Aw"
  },
  "mpBc4fe9DPo2dcNrJXPvug": {
    "date": "2/25/2013",
    "text": "Every time I go to the Strip and do not eat at Primanti's I feel like I'm cheating on my significant other.  Still, in the name of trying new things, we tried a brunch with friends at Bella Notte a few Sundays ago.  They do make a decent bloody mary, which is a good start.  I ordered a couple slices of pizza with various toppings and my date ordered a calzone.  My pizza came out cold and her calzone was piping hot from the oven.  Like some other reviewers have noted, if you order things that take different cooking times, you can expect some things to be cold.  Their kitchen can't seem to get it together enough to present all the food at a reasonable temperature.  If I go back, I'll try order something that takes a long time to cook like a calzone.  Or I'll just go to Primanti's.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QtOUK5LFF23nl0UM7pncbg"
  },
  "ebm6nihj5zXA-1bWJHc5AA": {
    "date": "11/23/2013",
    "text": "Pizza is delicious. Didn't try anything else, but if you crave some delicious pie, this is the place to go. One time they had a new chef and he screwed up our order. However, we got a new pizza for free and we got to keep the one we didn't order! Servings are really big, too and price is great (you will pay as much as you would for a large pizza anywhere else, but size and quality are far better).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FoF7XUy8fQ-B5eo3uGEeYg"
  },
  "A5iMhlUVXQ187YcDMlVquQ": {
    "date": "11/9/2013",
    "text": "Yay me!!! Stopped here today.  What a great day to take a break from eating your way through the Strip District... by EATING EVEN MORE!!!   Always good service and fantastic pizza!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pLwY1xjiGAR5rSBfz_plmw"
  },
  "7El_JVZs6GBDSDA7ZJ8YvQ": {
    "date": "4/18/2014",
    "text": "Excellent pizza! Excellent service! The best part was the beer flights! 44 beers to choose from, what's not to love!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "azcoPf-bp3vl2YdfFnoNFg"
  },
  "bNqR5O79u_RDoPpZDhyVbg": {
    "date": "9/19/2012",
    "text": "We ordered 2 slices of pizza and an Italian hoagie. The waitress asked if we wanted all of our food together and we said yes. This was a big mistake. When the food came out, the hoagie was hot like it was just made but the pizza was cold as ice. We had to send it back. We also noticed the table next us received their pizza but never received the other food dishes they ordered. Apparently it's not possible to order 2 different menu items here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "LWzRKrxsZ4_c6hw2ej8uiQ"
  },
  "GidVUdVeLGVcBvvGTu3dlQ": {
    "date": "6/23/2013",
    "text": "I should not have to wait 10 minutes to have the waiter bus an outside table where I am sitting. There was trash all over it from the last person, and the waiter said he'd be right back to clean the table. Ten minutes isn't \"right back\". Then after he cleaned the table, he took another 10 minutes before getting our drink order. The outside tables were pretty fool but I checked inside and there were very few people there, so the busyness was not an issue. this is just an altogether fail. We ended up only doing drinks because we were disgusted with the place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X0X3hiKv5CigUec1XYi_pg"
  },
  "r0bST-_TNLSBwWrbJ6MGgw": {
    "date": "8/1/2015",
    "text": "Apathetic young staff, decent pizza.  Host was about 22 years old. Never smiled. Could care less that we had arrived to spend our cash. Server-same thing: explained nothing regarding the menu. Our experience was that everyone was on auto pilot and bored/bothered. If you want to be treated special it's not here. On a positive note, the pizza by the slice was good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6fiMjjPwx6JLeuwjZE69tA"
  },
  "U7y3PeIvmA8CYHeGO4NT9Q": {
    "date": "2/19/2013",
    "text": "The sign that said \"44 beers on tap\" outside got us!  We sat at the bar and the bartender was so awesome, helped us get the right beer and taste the ones we might potentially like!  Pizza smelled amazing, but we just ate but we'll definitely have to try it.  Everyone who had it seemed happy and there didn't seem to be much for leftovers on their plates!  We'll be back here for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vDLvp1OMYAoI_LWrFGhqXw"
  },
  "xSo1D_07ZR_RA4kxdusWew": {
    "date": "8/23/2013",
    "text": "Pizza is my favorite food so it's no surprise that I've eaten here. Their crust is chewy and delicious without being too thick. Also they really pile on the cheese to make it extra yummy. The sauce is very good. In addition the staff are friendly. They have outdoor seating which is nice on a spring or summer day for people watching in the strip.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LWmK9KI02P5z9T35m9X9pQ"
  },
  "fBT-E5JF5l_jAEEMEGUyxQ": {
    "date": "7/8/2012",
    "text": "Stopped here today for lunch.  Ordered pizza by the slice.  1 hour later our pizza came, without an apology of the delay of the pizza.  It was not crowded at all at the restaurant.  A family came in after us, we received their bread sticks, they took it off our table and handed it to their table.  Is that even sanitary?  They also received their full pizza before we got ours.    Pizza was greasy and tasted like jar sauce.  crust was good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rV2cXnAOpdK35RgS4pqU4Q"
  },
  "d5narLxv35Krbwj8_TRaqw": {
    "date": "11/4/2018",
    "text": "Helen Keller could've made a better pizza and I'm pretty sure you can't make pizza with your hips.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DX0_xFkGtyFc8HB1ofGbow"
  },
  "dJh_ME3DIL2ic44P5-CZ5w": {
    "date": "3/23/2019",
    "text": "Stopped here for an afternoon snack after walking around in The Strip. The pepperoni rolls were a great snack for the occasion! Definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z9KJazWrZeRPdnKdJzLU4g"
  },
  "JZmsyHG_ZiAr-t2mVg5KUQ": {
    "date": "1/1/2018",
    "text": "We stopped in to get one of their Bloody Mary's, which did not disappoint. It was kind of a different taste than I have had before, but still good.  It had hint of a horseradish undertone. I didn't think it was particularly spicy, but a few people around us asked for tomato juice to tame it down. The bartender was really friendly and attentive. The pizza was a thicker style crust with a lot of diced up pepperoni on top. It was really good and definitely filling. All of the food that came past us looked wonderful. This is a great place to just grab a drink or to sit and have lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EeWYibAhNZD1g82_BaFveg"
  },
  "UqaPFFa7il2oKJJ3Cmvdzg": {
    "date": "8/17/2018",
    "text": "Yummmm!  My husband and I shared a Caesar salad and a BBQ chicken pizza (medium size but it was HUGE!) and everything was delicious!  Definitely worth a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "edOtw1A5-ByvKkVMqKSssg"
  },
  "rj1NnpvV0Ig8V-n108V5_A": {
    "date": "2/3/2019",
    "text": "Excellent pizza and sandwiches.  Quick friendly service and nice atmosphere. Large portions, excellent value for the amount of food they give you! We could have shared a hoagie and the monster slice was huge. Enjoyed our dining experience while on our day trip to the Strip District.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6m28rotdpvokiKuQCzxong"
  },
  "3Nr2Y0u8QARpvf1yvQWuvA": {
    "date": "7/14/2018",
    "text": "We only tried their pizza but it was incredible!! Their frozen cocktails were out of this world as well, and nice & strong!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lt0xzQ8qmWEGyOxE3vsobg"
  },
  "PaYFSUeC29Nl1-DL8kQVNg": {
    "date": "6/26/2016",
    "text": "I stopped by here 2 Saturdays ago with my wife for lunch.  It was a nice day outside and while this wasn't our first choice in a restaurant, it did provide the immediate outdoor seating that we were looking for.  I have probably been past Bella Notte hundreds of times while walking through the Strip District.  While I have thought that the pizza and drinks have always looked good, for some reason I have never stopped.  My wife and I arrived at Bella Notte right around 1 o'clock and were immediately seated at the empty outdoor table.  Due to that I didn't really didn't get to see much of the inside.  The outside seating section of the restaurant consisted of a number of tables right along Penn Avenue with room inbetween them and the restaurant for people to walk on the sidewalk.  Since it was a sunny Saturday, this provided ample people watching for the entire time that we were there.  For lunch both my wife and myself got a beer each (reasonably priced too in my opinion) and then we ordered the bbq pizza to split.  The BBQ pizza consisted of bbq sauce instead of the normal pizza sauce and then had chicken and pineapple as toppings.  Since I am normally able to eat a large pizza all by myself I wondered if I was going to leave slightly hungry.  However that fear proved the unfounded as my wife and I ended up leaving and even taking a piece with us because we were so stuffed.  The pizza itself was quite good.  I really enjoyed the BBQ sauce as the pizza sauce since it had a little sweetness to it.  That made it pair quite well with both the chicken and pineapple.  The real star of the pizza though was the cheese.  There was so much of it on the pie that even without the toppings it would have been quite filling and tasty.  The bottom line for me is that I would head back here again in the future.  Honestly I am not sure why I have never stopped here before but I enjoyed their pizza and thought my wife and I had a nice lunch for a good price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "XKRmtMQToQ_GozUI31cdbQ": {
    "date": "11/3/2016",
    "text": "Big portions, very accommodating staff & good food. We had the meatball parmigiana sandwich, shaved steak salad and small pizza. All good, but the pizza tastes similar to Dominos, just a little thicker.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QHOv2ie0GsBEL9Dr3v43gw"
  },
  "p5WHK7TuLpAleZzIJLkPCQ": {
    "date": "6/30/2018",
    "text": "This has to be by far one of the best pizza places in the city of Pittsburgh. The service is prompt and very friendly. Our waitress Jen was out of world incredible she guided us through our menu selections and helped us decide on the perfect piece of pizza. We will definitely be coming back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_tuY9YuseUHp8WCPG_96bQ"
  },
  "_zaX-8if-B4Z0jbSWqTRLw": {
    "date": "12/30/2017",
    "text": "Ok I won The Best Pizza in the Burgh goes to Bella Notte,My hubby THOUGHT it was Fiori's ! The Mrs. always knows best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RNByQD9SwiHs1SvjOO__VQ",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Yelp",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RNByQD9SwiHs1SvjOO__VQ/o.jpg"
      },
      {
        "img_id": "XRsREJV8oCRIBqd8sGJUSA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Best pizza in the Strip",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XRsREJV8oCRIBqd8sGJUSA/o.jpg"
      }
    ],
    "user_id": "8r2b5Ym68mnhRjVdGgO3sg"
  },
  "5iJHonaE69odfy6McsxBHA": {
    "date": "4/24/2018",
    "text": "Really good and lots of food!  Stopped on a Sunday afternoon while doing some shopping.  We had pizza, hoagies and a salad.  All of the portions were huge.  No one left hungry.  Only downfall was that the drinks on the bill were incorrect and had to get that fixed.  But, we would recommend it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t_8MxbsX71PI_2rIbzDAWg"
  },
  "JOm_kpMxOSUsJOtXO5wUSg": {
    "date": "5/8/2017",
    "text": "If you are in the area this place is a must try. 44 beers on tap, beers on special. and best of all killer pizza!!!   I ordered a few pints of the Voodoo Ranger IPA as well as a monster slice of pizza. When they say monster they aren't joking. It was like a quarter of a giant pie. Pepperonis did that curly thing; I'm no Bobbly flay, but I think that's a sign of quality ingredients.  All in all a bang for you buck joint with great atmosphere, fantastic service, and plenty of good brew. It's that's your scene give it a go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PEOlSt79IZwKOz6Cf0BaSg"
  },
  "qhBVSIK3cdG3JC_uSLxn2A": {
    "date": "3/31/2018",
    "text": "I had the Italian. It came out quickly and was delicious. Service was also great. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rTXh5wS9gmMJFFSySPgt9g"
  },
  "a-n2SYZ1uDA_Q77s-Xqpuw": {
    "date": "8/14/2016",
    "text": "What a cute little pizza place. I would have loved to have a $5 mimosa, but since we had my stepson,  I decided not to get one.  All of us got a monster slice.....holy cow they were big! They were certainly tasty though!   Service was good.  They weren't busy yet,  so it was pretty quiet.  Prices were great,  especially for the product.   I will be back here,  hopefully for some booze & pizza next time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gMyodl47BRW0nNvB4QMD8g",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. $3 monster slice with pepperoni &amp;amp; olives.... Yummy!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gMyodl47BRW0nNvB4QMD8g/o.jpg"
      }
    ],
    "user_id": "_O5ajREINPG9zeyhW5Dmqg"
  },
  "vAGzovlHQJuJysxjpIjXlQ": {
    "date": "1/26/2018",
    "text": "They gave us a specialty pizza on regular bread instead of tomato basil,  charged the same price,  as well as it being black burnt on the bottom.  Disappointed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_xumbIVF6RYnIUFbSJ3bCg"
  },
  "56S1k19pmXG6bOhGpbqXMQ": {
    "date": "4/19/2018",
    "text": "I ordered a grilled chicken salad without onions. The salad was given to me with onions, the bowl was too small for the salad and it would be impossible to stir the dressing into it, and the chicken was cold and not grilled. It was very disappointing. When the waitress checked back my boyfriend mentioned the onions and he told her he would take the salad home (because he's a very nice guy). She didn't ask if I would like to order something else and it didn't seem to bother her that I was sitting there without lunch while everyone else ate.   In addition, we ordered a pizza to go when we placed the order and she forgot to put it in.  Our waitress was taking our orders without writing them down and maybe she she reconsider her way of doing things.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zulTV-0jCX6lBqhkZWCQ4w"
  },
  "BZohfUjPz2MdZB6OhLhTtA": {
    "date": "4/14/2018",
    "text": "Deceptive advertising on their promotional material. Beer of the the month promotion is bait and switch Service was acceptable, limited menu, food was adequate. Don't be a sheep and follow the crowd",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mql2pXQIuLCfIPys9MbMMA"
  },
  "LcaWGJCWFo7zgK-9cAJoXg": {
    "date": "12/15/2017",
    "text": "Bella Notte has a decent selection of pies and other fares, as well as a great beer list. Portions of everything are huge; and, it all comes out super fresh and piping hot. I will say that service was quite slow during the lunch hour. Overall, worth stopping in for a quick slice but you might want to reconsider a full, sit-down meal if you're short on time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YNkbvkPhLMFlOFYH2PLMwA"
  },
  "8qwUJffBcOMNT1wfppxpTA": {
    "date": "10/10/2017",
    "text": "2nd time in 3 days. Worth the trip to the strip district.  Buffalo wrap, bruchetta and of course pepperoni rolls.  Cold beer,  good bloody marys  and nice casual atmosphere",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mEzhfJUuEGJIvRQwNaBO1g",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mEzhfJUuEGJIvRQwNaBO1g/o.jpg"
      },
      {
        "img_id": "zQzyVRa01-WMSAMIYZkIhA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zQzyVRa01-WMSAMIYZkIhA/o.jpg"
      }
    ],
    "user_id": "oayFeRc_udCDmYeWfvGo8w"
  },
  "A3ctwwwChu-kh4s0bahRPQ": {
    "date": "9/30/2018",
    "text": "The server is very mean. When we confronted the server about saying Jesus Christ because I went to the table to get salt. She came back and told us she smacked her face off another server there wasn't any other person in sight. I had to ask for sliver wear. Bree was here name. You should get ppl that enjoy working for your. Cause she sucks as server.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PmcOVQ52qTLIrS2tTf1ndw"
  },
  "KS_6RD9RMnF30SGbDp79Uw": {
    "date": "8/22/2019",
    "text": "This is probably the second best pizza I've ever had and I love pizza.  The staff was very friendly and attentive and the tables were neat and clean.  The crust on this pizza was probably the best I've ever had and there was a slight tang in the sauce (? not sure) that was wonderful.  The pepperoni was mouth watering and the sauce was delicious.  For my taste it needed more sauce and it had way too much cheese on it.  I like to taste everything and you could but the cheese overwhelmed the other great flavors.  I will absolutely return but will ask for more sauce and less cheese",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zq98BYVjGKb0uzH6043jLQ"
  },
  "x8Jkx8RAJ7lichQj-SP2ww": {
    "date": "6/17/2019",
    "text": "Holy moly, how big was the pizza, and tasteeee, first off all it wasnt greasy. cheese and tpooing was amazing, and huge portion for only 20$. we was amazed. dough was fresh and chewy. Nice experience in pittsburg. Live it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UH8usJBEGPbUrblGGz6gZA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UH8usJBEGPbUrblGGz6gZA/o.jpg"
      },
      {
        "img_id": "N32zoXJBBX02AruT6aqRnQ",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. pizza mediterian",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/N32zoXJBBX02AruT6aqRnQ/o.jpg"
      }
    ],
    "user_id": "A8Mi1IPKViEFBRbOCsEaug"
  },
  "BteuCpaTWFGOC7SCKu09mg": {
    "date": "8/15/2017",
    "text": "This place is great! I almost feel guilty for not reviewing it before. The monster pizza slices are definitely big enough to curb ones appetite. They use good pepperoni and are liberal with the amount that goes on each slice.   There are two bars in case you walk in and see the one is full, walk around the other side and there will likely be a seat. They also have outdoor seating on nice days. The staff are friendly and happy to answer and questions you have about the menu.   The beer selection is great! If you are walking down in the strip district treat yourself to a monster slice at Bella Notte",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DeGMqHM5UqUtFmCtkeoBKg",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Pep slice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DeGMqHM5UqUtFmCtkeoBKg/o.jpg"
      },
      {
        "img_id": "ev-S2OearhgQZoTXiaBtHw",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ev-S2OearhgQZoTXiaBtHw/o.jpg"
      },
      {
        "img_id": "JtMl1Lomlt5VRfzC70TavA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Pepperoni slice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JtMl1Lomlt5VRfzC70TavA/o.jpg"
      }
    ],
    "user_id": "Mrudkq5duCOoiuhL61ZBcQ"
  },
  "yFcursupPFQpSzAj_WFm8Q": {
    "date": "9/24/2018",
    "text": "This is one of my favorite restaurants in the strip! Great spot for lunch. I've been here many times and keep coming back because it's always good. If you're in the strip and are looking for pizza or a hoagie, look no further! Prices are reasonable and portions are huge! Seriously the Italian and meatball hoagies are huge and also SO delicious. A hoagie will run you about $10 but that's at least 2 meals! If you don't want to get a whole pizza they offer monster slices. They are def big enough to curb your appetite, 1 slice is plenty. The wedding soup is a little on the salty side, not the best I've ever had. The side salad comes in a small bowl so it's hard to cut and toss...that's really the only thing that annoys me here. Huge beer selection...I think 44 beers on tap! The service is always good and quick. They have tables outside on the sidewalk and if weather permits I recommend sitting there...the strip is great for people watching! I recommend if you're in the strip.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UgWxS_rP1euqsus7NJjNYg",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UgWxS_rP1euqsus7NJjNYg/o.jpg"
      },
      {
        "img_id": "wnBVMidII9jZjM18boGxAA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Monster slice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wnBVMidII9jZjM18boGxAA/o.jpg"
      },
      {
        "img_id": "po89SW7MyPMjcaYmufFucA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Side salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/po89SW7MyPMjcaYmufFucA/o.jpg"
      }
    ],
    "user_id": "mu-GFiSWKmtqj2CduZP5wg"
  },
  "LgLre4FqesjS-HwziulYbg": {
    "date": "5/8/2019",
    "text": "Unique menu, decent prices, great tasting food. Stuffed pepper wrap and hoagies were amazing. Great beer tasting options.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fb5-Dws_QelrVe26WWKNZA"
  },
  "hvM3JsnGbJmGaZv-9YG58Q": {
    "date": "4/27/2019",
    "text": "The pizza here is amazing, thin crust and a lot of flavor, Bloody Mary is the plus and the environment it's so confortable. We spend a very good dinner time here. The girls at the front were very kind and helpful. We're coming back for more pizza and beer for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f9pZa8lepbZZwHzIH5yNJw"
  },
  "SwdUK11E3fwqydsF5pdq9A": {
    "date": "10/7/2018",
    "text": "We had a party of over 20 and both the pizza and service were excellent! It may sound cheesey, but I can't say enough great things about our waitress Makayla! On the day of my daughters wedding, we pepper'ed her with orders and yet she handled them with ease.  There was not mushroom for improvement. 10/10 would recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IGEmOxN0YyfUC_TLVbhUZw",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IGEmOxN0YyfUC_TLVbhUZw/o.jpg"
      }
    ],
    "user_id": "LP5aJHw0eXKiW7YW6ik7lQ"
  },
  "rY0NzllAp39c9tzDZGDiKQ": {
    "date": "4/7/2019",
    "text": "This pizza was terrible. 6 slices for $16. Too much cheese and the sauce was sweet. And they put a food tax which PA doesn't have. Just gross.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ef8Cv4yQOlS1bieFOnhkIg"
  },
  "lKs3tulbGlqmd0rk5wDQgA": {
    "date": "8/18/2018",
    "text": "Fantastic pizza - WHEN THEY DON'T BURN IT! We come all the way from Akron, and love this pizza, but this seems to happen from time to time. I have politely reminded them sometimes in the past to make sure it doesn't burn. Rule number one in cooking - BE ATTENTIVE!  A second Pizza came out with wrong toppings, but the manger fixed it. Mistakes happen, but customer service is all about how it's resolved! GREAT PIZZA & CUSTOMER SERVICE!  #ChubbyChristopher",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y4ZI_bVvwQHAvQ1njkZEKw"
  },
  "RGJo6Cr-wbVXvkqSIXdU0g": {
    "date": "1/21/2018",
    "text": "There are many arguments about the best pizza in The 'Burgh. However I will tell you that this place is easily one of THE best.  We live in The Strip so I may be a bit biased, but Bella Notte definitely delivers great flavors, crispy crust, and a favorable amount of cheese. The staff is super friendly and the beer list is substantial.  If you want to eat there on a weekend, be prepared to wait for a table because like everywhere in The Strip, weekends are their busiest time.  However if you're willing to venture out on a week night you're almost guaranteed to get a seat right away.  We love this place and are regular customers.  For me, pizza doesn't get much better than Bella Notte.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7J6tPUjl4iJWBd8rPH3-Xg"
  },
  "HSizDcovbinhUDcHPvGjpQ": {
    "date": "10/4/2017",
    "text": "I LOVE Bella Notte! One of my absolute favorite Pittsburgh pizza places! When I came back to town after being away for a few months, this was one of my first stops. Huge portion sizes and an absolutely delicious pizza make this a Strip District staple for me. Don't expect any frills - Bella Notte is traditional, simple, and delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "fVZnpjvy-M5cYxiiuWWUYw",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Mushroom and garlic pizza!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fVZnpjvy-M5cYxiiuWWUYw/o.jpg"
      }
    ],
    "user_id": "mAOD3ynoKuxI6gqLP8k7qw"
  },
  "I880TfbvqHZ-3OLXRaJKdw": {
    "date": "10/28/2016",
    "text": "Come for the Bloody Mary stay for the pizza.  When stomping around the Strip on a Sunday afternoon it's great to turn it into a Sunday Funday with a Bloody and slice here. The Bloody Mary has just the right amount of spice and it always hits the spot. Pizza has a nice crust that's never over cooked. It does get pretty busy but service is always fast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "672B0cyZ5oBbxshjS25dQA": {
    "date": "1/19/2019",
    "text": "Best pizza in the Burg! A must go to place for anyone visiting the Strip. The service is great and the managers are attentive to everyone and very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D9j84OjlOHOlhYn5GnvF1g"
  },
  "EmKQamv1yf_bGMigatbqXg": {
    "date": "3/12/2018",
    "text": "Hands down the best pizza you'll ever have. I never have craved a pizza more than the Margherita pizza at bella Notte. I also highly recommend getting the greens and beans! The mimosas are also amazing. If I could give this place more than 5 stars I would.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "reOpmyRS0ViF4EPQJNdCzw"
  },
  "N_S9ZciRsEKhhMSkWksUAA": {
    "date": "7/24/2016",
    "text": "Surprisingly good pizza. Certainly not the best, but it sure hits the spot when I find myself on a pizza craving. The restaurant is right in the heart of the Strip, so convenient location but parking hell on weekends. Inside, it's a very simple, no-frills type of pizza joint. I was not impressed with the level of cleanliness, but I guess I've seen worse.   Bella Notte offers a good variety of hoagies, wraps, and salads, but I'm not one to pass up an opportunity to chow down on some pizza. My boyfriend ordered a 16\" Ranch Steak pizza (all to himself). Very good size and clearly meant to be shared. Being the more reasonable one, I ordered the Build Your Own Monster Slice with onions. These are pre-made and reheated, so you don't get that \"fresh out of the oven\" experience, but a good size for a single serving. Way too much cheese for my preference, but other than that, it was very tasty. The crust (my favorite part) was full and crispy, just how it should be. A little cup of ranch comes with an extra $0.50 charge...I should have brought my bottle of Hidden Valley. Each slice is $3 and $0.75 per topping, so overall, it was a cheap meal.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Q_z48EYklUYfc4e4Rv34EA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. 16&amp;#34; Ranch Steak Pizza and a Build Your Own Monster Slice with Onions",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q_z48EYklUYfc4e4Rv34EA/o.jpg"
      }
    ],
    "user_id": "6KUA3-IfHoAhQ3FL2djQoQ"
  },
  "hoC-73EoHTS5rY8W4MOADw": {
    "date": "3/2/2018",
    "text": "This The BEST pizza I have ever had in my life!! It is the BBQ Chicken!!! OMG! Better than New York!!!To die for!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_CttHW6lBx7lw9fYvjaq1Q",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. This is THE BEST pizza I have ever tasted!!  Omg yummy?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_CttHW6lBx7lw9fYvjaq1Q/o.jpg"
      }
    ],
    "user_id": "tC7MoM-Hes2cKl-s_4JIMg"
  },
  "YrL0fhF9_homp00Sv5JRFQ": {
    "date": "9/22/2017",
    "text": "My husband won't stop talking how great the pizzas are here. He comes here for lunch every Friday for the pepperoni special. I have to say the pizza here is great! One of the best kind. They don't have any modern pizza, simple/traditional would fit their selections. Be ware of the portion, one slice might equal to 2-3 slices of regular pizza. It has a gelato stand at the door, so it is prefect to grab a bowl of gelato after the pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WRVtYakugTUxH2NBwi9FPg",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WRVtYakugTUxH2NBwi9FPg/o.jpg"
      },
      {
        "img_id": "HsVC4iclxJYYOpHN-gKq5A",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HsVC4iclxJYYOpHN-gKq5A/o.jpg"
      },
      {
        "img_id": "kuedyo9Ym69ZuUkq3fz9SA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kuedyo9Ym69ZuUkq3fz9SA/o.jpg"
      }
    ],
    "user_id": "pW_XkS9BfbnAQ_JMxNA-8w"
  },
  "DIkweEXEkK5WXYLVEIN_GQ": {
    "date": "4/22/2019",
    "text": "This was a pleasant surprise!! The beer selection amazing! The service was great shout out to, Rhett our bartender! The margarita pizza was so delicious   and he had many recommendations!!! It was so great! This will now be on our rotation!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aPZspgYGsDYrKo7i2ds2Yg"
  },
  "9a6XxMwtM2MnaYTGNWce4g": {
    "date": "8/26/2017",
    "text": "We stopped in for lunch on Saturday while exploring the Strip District. We were hopeful because we had seen some of their delicious looking pizza at tables on the sidewalk. It was a pretty cool day with a rainstorm coming but inside the restaurant it was hotter. We wanted to start with drinks but there was no drink menu and our server seemed extremely put out to tell us what they had to offer. We ordered the white sauce mushroom pizza and it was really good. Our server disappeared though and we had to walk around the restaurant to find someone to bring us our check.   The food was great but the service really needed to be improved.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "3HxKt_S6-XpHJ0omlBiuOA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Portobello mushroom pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3HxKt_S6-XpHJ0omlBiuOA/o.jpg"
      }
    ],
    "user_id": "sz6dAdplZGzQ23_FL0GANw"
  },
  "hjpZFdAZcMtMNk8zlVdpaQ": {
    "date": "8/25/2017",
    "text": "My experience at Bella Notte was just to grab a quick drink - but turned into a trip for some gelato! While the gelato was a pleasant surprise, the service was quite the opposite. Our hostess/waitress was very rude and short with us, and didn't seem interested in serving us at all. Additionally, during the week, they close at 7, which is very disappointing. Although the pizza smelled wonderful, I won't be in a hurry to go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yLMks_gtZmgAcdIGm3kl4Q",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Chocolate peanut butter gelato",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yLMks_gtZmgAcdIGm3kl4Q/o.jpg"
      }
    ],
    "user_id": "LaiylSIbrA3aPvOYtl-J4A"
  },
  "iAyqUjKFoBUHdTDcT45EsQ": {
    "date": "8/22/2019",
    "text": "Super fun restaurant with patio and outdoor seating right on the Strip!   I came with family at about noon on a Tuesday and it was already starting to get busy. For the 5 of us we placed orders for 3 calzones and everyone was filled on less than 1.5. These things are monsters and they come out piping hot and absolutely tasty. I think my favorite was the tomato and fresh basil, but they have a ton of toppings to choose from so you can make it your own.   Unless you're starving I would plan on sharing or expecting leftovers.   Would definitely come again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tMFHEzgiFozueB4sWbZ63Q",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Tomato &amp;amp; Basil Calzone",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tMFHEzgiFozueB4sWbZ63Q/o.jpg"
      },
      {
        "img_id": "03ra7gk8d5i4t95BYJY6lQ",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Meatball &amp;amp; Pepperoni Calzone",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/03ra7gk8d5i4t95BYJY6lQ/o.jpg"
      }
    ],
    "user_id": "Iicg8bnAevUC20LlXRNv8A"
  },
  "n1M5ZgxOGD7jK_MJD21FQQ": {
    "date": "8/16/2019",
    "text": "We stopped by while in the Strip District for lunch. We'd hoped to be seated outside, but that was a very popular idea in mid-August. We ended up in the dining room by the kitchen, so it was a lot of noise. If you're hoping for quiet conversation with your dining partner or family, maybe request a table somewhere else. Also, hearing a server by the kitchen complaining about a large party wanting to split a check was disappointing.   The drink special was Rhinegiest Bubbles--a rose cider--for $3. They were crisp and off dry (as this cider usually is) as well as cold and refreshing. We received them quickly after the ice waters that we'd requested.   Our server took our order for a pepperoni, mushroom, and onion pizza promptly. The wait staff was always hustling, which was good to see. Our pizza was out quickly, and our server checked the accuracy and quality of our order within 90 seconds.   The pizza crust was crispy and slightly bready, but dry. I'm a crust fan, but the edges weren't a tempting snack--too dry for me. The sauce was a nice middle ground between sweet and spicy--more towards sweet though. The cheese amount was good--not a thick layer like famous Mineo's--but enough to enjoy. Pepperoni are the small ones that curl up.   Overall, a 3 star experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rdrYyoCDSPxLxm-KHKOqxw",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Pepperoni, mushroom, and onion pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rdrYyoCDSPxLxm-KHKOqxw/o.jpg"
      },
      {
        "img_id": "2or2RG-NBDAsNQ9vwyWt1Q",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Daily pizza specials ($4.50 per slice or $15.95 for a whole pie).",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2or2RG-NBDAsNQ9vwyWt1Q/o.jpg"
      },
      {
        "img_id": "qPNhUqnLXKA5bPf0aKSAQg",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Drink menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qPNhUqnLXKA5bPf0aKSAQg/o.jpg"
      }
    ],
    "user_id": "HOt4dV5lPrug5WwhK7OpQg"
  },
  "9pJ7svn0kiarnOk7BU_9Sg": {
    "date": "8/12/2019",
    "text": "I'm not sure where to start. Let's start with the food itself.  We ordered an Italian Stallion hoagie, garlic bread with cheese and a chicken parm wrap. The garlic bread was soaked in butter and cheese grease. The Italian sandwich and the wrap were mediocre but not positively bad by any means.  But here's the kicker. We all got violent diarrhea as an acute result. I also got stomach pains and nausea as a reward for eating there. Going to the bathroom all night made for a \"beautiful night\" indeed.  Then there was the service. Long story short, everything took forever. It got so bad that in order to get our check we had to all get up and start walking to the entrance. This place is a dump.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LfY3rnaAPBjk2s7byu3_lA"
  },
  "pLrAr8oGt6hxm6qNEPxeWA": {
    "date": "7/11/2019",
    "text": "I'm revising my four star review after having two bad experiences recently with Bella Notte. I still love their food and will likely go back, but I couldn't leave my review as it stood.  The first experience was several weeks back on (I believe) a Saturday. My wife and I headed down to grab dinner and were told there was a comedy show scheduled that evening. We'd be required to pay the cover charge despite the show's start time being an hour or more away. It wasn't a two dollar cover either - I want to say it was something like $10 a person. The restaurant was barely full and all we wanted was some tasty pizza - we had no intention of sticking around for the comedy show. Whatever, we left and I dismissed it as a one-off incident - I noticed after the fact that they are horrible with updating any online presence (Facebook, etc.) as I searched for any mention of an event scheduled that night and came up short.   The second incident occurred this past week we hurried down after work to try and get pizza again from Bella Notte. Now, we are aware they close at 7p weeknights, but we arrived no later than 6:35-6:40. The hostess made a huge deal of us being there so close to close and initially refused to even seat us. After my wife requested to speak to a manager, the manager must have said to seat us because we were seated. Still, no one was nice about us being there and they clearly didn't want our business or the tips we would surely have left. We ended up leaving a second time without having had any food again.  If you're going to Bella Notte during a peak time, you'll probably have a good experience and good food. We never had bad service the many times we've been there in the past, but they need to change some things and FAST. Closing at 7p doesn't mean you stop seating guests at 6:30p. Scheduling a closed event (yes, I consider a cover charge at a restaurant basically the same thing) without advertising it anywhere on the internet is also unacceptable in 2019! We may be back, but not until these two experience are long gone from our memories...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Egji_XwjS4dykCjk8qoZWw"
  },
  "6GYuiOIweIH7ygDuppUTJQ": {
    "date": "9/14/2019",
    "text": "Excellent cocktail and wine menu.  Belle Notte never disappoints.  Shout out to Paige, our server, and to the scallops over linguine special which is my favorite dish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lxTnmCw0COhlg--VnEfHhg",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. My pretty Italian cocktaill- proseco, Castle&amp;amp;Key gin and muddled blueberries.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lxTnmCw0COhlg--VnEfHhg/o.jpg"
      }
    ],
    "user_id": "3LB1YEstLIkhs0mk9BZjTg"
  },
  "7WQfV7Qqdmn3VPdMvzzbCw": {
    "date": "1/7/2019",
    "text": "Stop by this place on our last day in Pittsburgh,it's on the strip district right on the corner. We wanted to have a drink before we headed out to the airport and so glad we stopped by here. It was nothing fancy, a simple restaurant with a bar and a cool vibe.   The bartender was amazing. I wish I could remember his name but he was very friendly made some beer recommendations. We definitely enjoyed our time here. We got to try Pittsburgh local beer which was pretty good.   We didn't try any food but the pizza looked and smelled good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "eFdLkEIicx_HlSppyWPVng",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Bar Area",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eFdLkEIicx_HlSppyWPVng/o.jpg"
      },
      {
        "img_id": "fQ_k5Sg5R3CUWLWEcNwcsA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Flight of beers",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fQ_k5Sg5R3CUWLWEcNwcsA/o.jpg"
      }
    ],
    "user_id": "nbup582T2-ec6KJQSSa1dw"
  },
  "DIg2mMZW1fvGeAeR-KZmhg": {
    "date": "5/29/2019",
    "text": "Visited on Memorial Day, ordered the pizza of the day (margarita) and it was priced special to $15.95. Also got the Italian hoagie to split.   Overall, good was good, pizza was hand tossed crust that was still a little chewy (depends on what you like, this was great for me)  Would gladly visit again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3OIheSDSxLVbHxRJgUKJCA"
  },
  "XqsyxjyLscsG5nL006AXLg": {
    "date": "9/1/2019",
    "text": "I love this place! It's a cool restaurant with an old school vibe, not fancy, just a casual place with great pizza. The margarita pizza is my favorite by far! No one I've eaten here with has had a bad meal, I highly recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t3ga_YmOJfl5wZwbAzp_Dg"
  },
  "_VMKmWUMPK-fZajQ6caUNQ": {
    "date": "4/7/2019",
    "text": "I really like this place!  The pizza has always been pretty delicious to me!  Service is good.  Great drinks and beer selection is awesome.  Nice chill atmosphere.  On a nice day they open up the front which makes it perfect.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1v_c0WfKyzS1Nj_euOZ3zQ",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Pepperoni, bacon, and olive",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1v_c0WfKyzS1Nj_euOZ3zQ/o.jpg"
      }
    ],
    "user_id": "FjncB5o6IBsWJ8XygyCUyQ"
  },
  "dyRUYeBNok-vWqemKp-Gdg": {
    "date": "9/2/2019",
    "text": "We went to Bella Norte as a back up to another restaurant nearby. It was Labor Day morning so we didn't have many options nearby. That being said, the service was slower than we would have liked. Their servers were not very attentive and did not check on us often despite having some wait time. Other people who ordered 10-15 minutes after us received their food before us and when our calzone to share came out, it was a little darker than we would have preferred. That being said, the price is decently reasonable and it is a pretty cheap option on the strip district. The food itself was okay, typical of a pizza joint.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iFk5t_o90lp2k_yMFGaQ-A"
  },
  "uLfXAbpeHd8yP4uhKJZ82w": {
    "date": "8/13/2019",
    "text": "Spectacular frozen drinks, great service and delicious food! This was the perfect start to our staycation this weekend. I had the buffalo chicken wrap and hubby had the chicken Parmesan sandwich. We both enjoyed them thoroughly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BtdFmitt4ViN5lbdcJ1cfw"
  },
  "OYagyciM1bOzgb2pXEp2Ig": {
    "date": "3/24/2019",
    "text": "I felt like the pizza was a bit overpriced and a little underwhelming. I had a slice of their margherita pizza. If you like cheese on your pizza, this is not the best option. The pepperoni/sausage slice looked much better but we could have gotten a whole (really good) pizza elsewhere for the price of 2 slices here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ulQ8Nyj7jCUR8M83SUMoRQ"
  },
  "zbt_cc5Xo5cGi4iqqwG9yg": {
    "date": "8/28/2019",
    "text": "Great pizza and great people The beer selection is one of the best in the city with, with 44beers on tap!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4yX6Y79LH-jkZ7yh1_8QfA"
  },
  "kLpa_m8KVxtEYw8sgocr9w": {
    "date": "3/4/2019",
    "text": "I come here every time I visit the strip when I'm in town! I've tried a variety of items including the meatball hoagie and calzone! The hoagie is without a doubt my favorite and the bread is usually fresh from a bakery down the street (according to my waitress). In addition, the serving sizes are massive and I rarely ever finish the entire thing so I have leftovers to snack on later in the day. It is also just a great place to stop for a beer while walking around the strip.   The service is a bit slow so if you're in a rush, this either isn't the place for you or you need to make sure you put your order in quickly. I've only ever come here though when I want to sit, relax, and enjoy a drink.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z5SMn_JVZGtvgF7As2sNCg"
  },
  "RJoEP3eA_TynGfHoebBiMg": {
    "date": "11/7/2018",
    "text": "This place is big and has a pretty vast menu of bar food.  They also have lots of beers.  They will serve you a DRIED UP old slice of pizza.  I've not tried ordering a full, made-to-order pizza.  But by the slice, be warned.  Service is slow.  The servers (server?) are hustling, but must have too many tables.  They seem to avoid eye contact as they speed by my table, forcing me to go \"excuse me,\" and wave vigorously just so I can close out.  I tried a hoagie once, and it was huge, but about 3-stars in taste/quality.  Maybe they favor serving size over taste.    So overall, I say it's not worth another visit.  If you've visited them, please post a review.  Yelp On!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yVMvS4Q7JTxHALm8CTwSZQ"
  },
  "vdbjLtNjsA7peOHPRsoAYQ": {
    "date": "8/3/2019",
    "text": "Great Food - Better Service  I recently moved to the Strip District area of downtown Pittsburgh. I fell in love with this place the first week I moved here. Fantastic menu with plenty of options, awesome beer along with  full bar selection, and the best part is the service. You will ALWAYS see the managers working and helping there team, which means a lot to me. I have worked for Marriott and Hilton over the last 16 years and can't tell you how much I appreciate seeing the engagement of the leadership team of Bella Notta with not only there patrons but there team members. Even the staff members like Brea have so much personal touch with the customers.   In an earlier review Nora B. went out of her way to bring down one of the best managers at this GREAT spot, Daniel. Daniel has not only been courteous in all of my families iterations with him, but he has always gone the extra mile for his team and customers. So please take this review into consideration before listening to people like Nora B.  Rick the General Manager is simply one of a kind. He hustles with an old school mentality but acts with heart. I actually witnessed him pick up a check for a mother in need, whom was unable to take care of her son's meal. I don't care who you are - THAT'S HOSPITALITY",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uayUnb6DhERb_YbQ9TkhNg"
  },
  "xZx5lef2rk7pFo8uxVERNA": {
    "date": "11/24/2018",
    "text": "We stopped here for brunch on a Saturday morning. We arrived before the rush. They had a Bloody Mary and mimosas special that we took full advantage of. It was $5 for each and they had a mango mimosa but I didn't try it. The Bloody Mary was spicy btw. We ordered lunch pizzas and picked out toppings. A friend of ours ordered a slice of the breakfast pizza and it was huge. She didn't eat it all but it was good. The Italian hoagie sandwich was orders and it was very big as well. Everything was very good and came out very fast.  Our sever was pretty attentive and kept checking on us when we needed her. Overall great meal at a good restaurant!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AKMRMIIPSHzp4KD76Z9Tgw"
  },
  "D7Zz9I7-xaBHGoY2WqC_UA": {
    "date": "6/30/2019",
    "text": "The worst manager ever.  Daniel was truly the epitomise of horrendous customer service",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "724peOv6f3nxUFDLtgWsGg"
  },
  "cqMgnU4A-BgF5iUQwv0Kug": {
    "date": "10/27/2018",
    "text": "Pizza was good, the environment is somewhat of a sports bar. They've got TVs and a bar, more of chill place, not too serious. Good pizza too. If you want just a quick bite to eat in a run of the mill place, it's worth a stop. But I wouldn't say you must go here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MYOTlqZ_-c0wIwzEKQQ-iQ",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Large pepperoni pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MYOTlqZ_-c0wIwzEKQQ-iQ/o.jpg"
      }
    ],
    "user_id": "Vu-fAw0y6rENi29QUjwZaA"
  },
  "pC8MpA26EUyVcv6hooprdA": {
    "date": "7/27/2019",
    "text": "Best Bloody Mary in Da burgh and the best Italian sausage ever! If you like spice you must come here and the drinks are great! Great ownership also",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tesMd6Mh14uTGpvZWi9PuQ"
  },
  "m0ZsCL37bhSHjNDuTJhALg": {
    "date": "1/21/2015",
    "text": "Best pizza in the 'Burg.  Hand tossed crust, perfectly cut toppings with a nice sauce and just the right amount of cheese. The Italian Stallion hoagie and stuffed hot peppers are also very good. Enjoy wIth your choice of 42 draft beers.  In addition to the wait staff, Nino, Bethany and Rick always make us feel like family and we enjoy every visit.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GUiJ6uObUjEwSlnayE0Zdg"
  },
  "yWA9ljajwb-oyqV348uirg": {
    "date": "11/16/2015",
    "text": "I was so hungry and wanting green veggies so I ordered some. They were way over cooked and tasted like crap.I loved the ambiance of this place and love Pittsburgh but I was so disappointed in the food quality.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7fVjUi2xxTgstVr8_IhsIQ"
  },
  "-50OMETLmBaSDJPEd3KyGg": {
    "date": "4/11/2013",
    "text": "While shopping in the Strip, we wanted to grab a quick bite for a late lunch. We stopped in and I got two slices of pepperoni pizza. The slices were enormous, covered in pepperoni and piping hot. I'm normally more of a thick crust fan, but the crispy thin crust here was on point. I scarfed down my two slices, which were probably more like four slices of normal sized pizza, and headed back out the door.   Will definitely be back for another slice, or three.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "q-CDZ2ZHgB5nCYfE4x-JYg"
  },
  "Q-9I_dTazLt12ufL-NIm5w": {
    "date": "10/7/2013",
    "text": "Looks are deceiving. The pizza was great the hot peppers were nice and hot   The sausage was spicy and infused with a gentle fennel flavour. One of the better pizza joints I've been to.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tDH6dzBnvFt41ZbEg7QVAA"
  },
  "zjndi72O8YCcZOAGdLgCFA": {
    "date": "11/1/2014",
    "text": "Bomb pizza, so good fork and knife kinda pizza so delicious almost ate the whole pizza. We got a small had two monster pieces left almost cried when I forgot the leftover box at the table when we left :( came back tonight with our littles because the wait was 3 hrs for the cheese cake factory. Pregnant and I really love the pizza its a fail safe for any night out. I LOVE PIZZA!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "W_fGJUDxsYUHiS_E-Ct9Fw"
  },
  "TcxOQmCK0ErMy2RiNUoFrg": {
    "date": "12/22/2016",
    "text": "Worst food in the strip! Got a calazone and it was burnt on the bottom, it had exploded and split completely open losing  the contents inside! Also got a bowl of spaghetti and you can open a jar of generic sauce and a box of store bought pasta and you have the same meal. Service was well, missing. Not visible and barely came to our table. Would not recommend, ever go back, not for anything! One star because it wouldn't let me do 0 stars.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AdmqLXhiY4LOfmixnnYvLw"
  },
  "pMnFl0XNLgw31Wus_3KJFQ": {
    "date": "12/1/2013",
    "text": "The pizza is always excellent here - high quality cheese, crust, and toppings.  The individual slices are very generous and they put on tons of pepperoni.  Prices are reasonable.  They usually have a few drink specials, too.  A great place to get a slice to go while shopping in the Strip District.  Service, however, leaves a lot to be desired.  I had to wait a long time for service (greeting, orders, and check ins) and I had very little interaction with my server.  The place was not even remotely busy at the time.  I don't know if they are understaffed or if my server just didn't care to deal with us.  We have had the lack of service problem on 2 out of our 3 most recent visits, so I don't think it was just bad luck.  Overall, I would recommend sticking to either sitting at the bar or getting food to take out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "drTEOiPtYslndkUdlYeMUw"
  },
  "BrnVhRji9-G1SyvT2Ahj2w": {
    "date": "10/1/2014",
    "text": "This place is the stuff. Great beer selection, wonderful food, and in a great location. The staff is not only good looking but also really down to earth. This is definitely a must do solo or with the fam when you're in the strip in Pitt. Check it out, o and they have $4 huge slice specials m-f. Just do it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SDwI2MZYrLkgyVssFcKXng"
  },
  "IJS8gKG3Hd09zNsx1I2jtQ": {
    "date": "9/29/2015",
    "text": "Really terrible service, pizza was just ok, bloody marys are good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TX_DuoUjwk72vYeBPJoOCA"
  },
  "Pk3Y3M8-MA20BHJYbbMB_g": {
    "date": "11/14/2015",
    "text": "This pizza crust is in the \"Goldie-locks\" zone:  Crispy and chewy at the same time. The place is a little divey, but so is everyplace in The Strip. Great pizza. Reasonable price. Good service. A go-to for pizza when the craving hits.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kneey6lq_XsBoM6yN7IeHg"
  },
  "1yTFEpNVPwdQYD-3QK2Fvg": {
    "date": "4/3/2015",
    "text": "Tasty, thick crust pizza in the strip district.  Decent wine/beer selection.  Definitely feels 'real' and not pretentious.  Plenty of TVs w/ hockey on. I could see being a regular if I move to the Burgh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CJqgUQeWhdgbDyLAFy7xvQ"
  },
  "f_TelO5pEY9dOwB8sbjYhw": {
    "date": "3/1/2015",
    "text": "I've been to this place 3 times. It has it's ups and downs. The ups are the sauce...it's not overly seasoned and tastes pretty fresh..also, the sausage is very good! They do serve a pretty great Bloody Mary as well. Ok....so...the downs: the servers are never NOT on their cell phones...we watched three servers leaning on the counter in front of other employees who were actually working. The entire time they were leaning on the counters, they were on their phones texting. That's just in poor taste...I mean this was literally 3 feet from customers. Also, the walls are lined with mirrors - which is cool, yes - but it allows customers to see the inner workings of the pizza kitchen. This would be a good thing if we didn't have to witness all of the unsanitary shortcuts that they made. We watched one employee actually put the pizza in the oven with the paddle, and subsequently place the paddle on the ground (pizza end down) which was definitely gross. After this, we witnessed another pizza cook bring out the pizza and place her bare hands on it to move it around - this is just unacceptable since she had just been completing other tasks with her hands and had not washed them in between. Ew. Other than the sanitation, this place is ok....the Pizza has much to be desired - which is odd for a place that serves mainly pizza. I'll probably walk past Bella Notte and go somewhere else next time I'm in the strip.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0FY7Iocg9FZsDuBB3_Y_Hw"
  },
  "DVuc09QRclS1wNhM-hRtRA": {
    "date": "1/6/2016",
    "text": "Pizza is very, very good.  They use fresh ingredients and great cheese.  However, there are some food handling problems - we have been there numerous times and this last time were seated near the pizza prep area where we saw servers who were handling money also handle pizza to move it from tray to serving plates and also sweeping up and handling the dustpan before resuming food service.  I didn't need to see this!!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JZjKguUq6juKGHZNBsBBqg"
  },
  "81SIqxfd0CTfMA7RtQ1dhA": {
    "date": "1/20/2015",
    "text": "Just got done enjoying a huge slice of pizza (pepperoni & sausage). Perfect balance of flavorful sauce and cheese.  Comfortable atmosphere and pleasent waitstaff. Will definitely be back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cUqU7UfSaamDg0L5TIJPRg"
  },
  "igj6KH0aCw19GROmDe8_lQ": {
    "date": "7/12/2016",
    "text": "We stopped by and had some calzones. The food was delicious (calzones are huge!) and our server was very attentive even though she was busy! We'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jx0XinQ9SuEHoanzsY9lkQ"
  },
  "Syuq7wxPlRMv6Tfxqb3xow": {
    "date": "8/18/2013",
    "text": "Pizza is fantastic and very reasonably priced. I had the White pizza and it was cooked perfectly. I found myself craving the leftovers the next day. The outdoor seating area makes for a nice relaxing evening enjoying the scenery of the strip district.  Bella Notte had a huge variety of draft selections and some very nice specials.   The only drawback to Bella Notte was the weekend hours of operation. We were there on a Friday night and the place closed at 9pm. With a fully stocked bar, you would think that they would at least push the 11 o'clock hour.  Disappointed when we got the hint to leave.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DXQy8I81FxXPyxPR0fiKAg"
  },
  "p5ZMxurh2fRrA7cLHNNlcA": {
    "date": "5/1/2012",
    "text": "-2 stars for having to wait to be served (wondering if we were forgotten) and for not seating people well at tables which increases the wait time before you sit  +6 stars for some of the best authentic, delicious, hearty, amazing pizza I've had in a while. While my family was bummed that we didn't get a \"real brunch\" since Delucca's and Pamela's were ridiculously long wait times, the awesomeness of this pizza (Mediterranean style).  =4 stars!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V0pP_PQnWdtyKpF-pifiaw"
  },
  "9tOE-aATeAhEVeHsT81cyA": {
    "date": "11/16/2014",
    "text": "My wife and I have love this place for the last 10 years. When we lived in Pittsburgh and her kids were little we would always make a special trip to either pepperoni pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Jh8LQH3dWQHWXrm7-WcDg"
  },
  "teDseZgk_ubDAh6XKio7Yw": {
    "date": "2/28/2015",
    "text": "We order banana pepper wraps because the menu didn't say anything about containing meat. They looked delicious and were stuffed with sausage. The staff were great and so understanding of us not eating meat for lent! We ending up getting some pasta and a tomato wrap instead! Both were delicious!! They also had a special where if you bought a sam Adams draft you got a free glass. Great people, good food, and lots of beer opinions. Can't wait to comeback after lent and try some of their other food!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dwG0x3sUePizL6cwNBZe-A"
  },
  "zdpFQPT1QYrcxH1Vu7TSfA": {
    "date": "8/30/2014",
    "text": "Love this place. They always seem to have a beer u can buy that includes a free mug. This time it was Sierra Nevada.  Last time was a  Curious Traveler.  I love the mugs. Need to try the food tho! I'll be back here In late dec!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gTaAtODHLOo5max1hnaPTQ"
  },
  "KqU3KmxjS_CGUq8vniRLww": {
    "date": "9/29/2014",
    "text": "If I had to choose one thing to eat for the rest of my life it would probably be pizza. But I'm not just talking about any pizza- it has to be good pizza!  As an Italian, I would say that I have had (and made) my fair share of pizza and won't settle for any slice. It has to be crunchy and chewy with the perfect blend of sauce and cheese.  I am very happy I came upon Bella Notte a few years ago since it has become one of my go-to places for pizza in the city.   There are three main things that I want and look for in a pizza- First and foremost, the dough has to be cooked thoroughly. I typically will order my pizza \"well done\" since I don't like it when the dough is mushy and not cooked all the way through (the middle part of the pizza seems to be where this problem happens).  I don't have to say anything when ordering at Bella Notte since they cook it nice and evenly. I must admit that there was a time when their pizza was not cooked all the way through (they were training someone new in the kitchen) and they were more than happy to make a new one for me.  Next, comes the toppings. A good pizza has a nice cheese to toppings ratio which Bella Notte seems to have a good understanding of. With that being said, I am a big fan of their portobello pizza!! Last but not least, the crust should be the perfect mix of crunchy and chewy, which Bella Notte also seems to nail.  All in all, Bella Notte I would say is a good place to get Pizza in Pittsburgh. I am not saying that Bella Notte is perfect but they will definitely do their best to make their pizza perfect for you every time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xc5kDgd59yJ3sxdS4_Ufsg"
  },
  "t4efYU2IVPFKK-YgkbVAEA": {
    "date": "5/20/2014",
    "text": "We ordered a dozen pizzas for work and I thought I died and went to heaven eating the white pizza with 4 cheeses and artichokes and spinach (I think).   Having left the Burgh for ft Lauderdale years ago and now living in Raleigh the past 2 years I would kill for pizza as good as this at home.   I highly recommend it and will be going back next trip.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0_pGJ73xZ8nYl6SE1VwZ3g"
  },
  "BMzOgNRBVyuE1Tf9MTf8Qg": {
    "date": "7/23/2016",
    "text": "Great pizza and cold beer.  Pleasant and friendly wait staff and good service. We choose the 12\" pie- plenty for two people.  Very reasonably priced. We enjoyed it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5ah30tDyw1s3DcwXtj6OEA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5ah30tDyw1s3DcwXtj6OEA/o.jpg"
      },
      {
        "img_id": "ybIxPQB6ZWYp5yrpu3esWw",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ybIxPQB6ZWYp5yrpu3esWw/o.jpg"
      }
    ],
    "user_id": "oTbDSTd-agN2Yd8l05KnGQ"
  },
  "Lt82WFpalce5GGnGRtHwAQ": {
    "date": "4/20/2015",
    "text": "Very good pizza. We got the barbecue chicken with pineapple. We got only half with pineapple because we were worried we might not like it. Glad we tried it, it was good! The signature Bloody Mary was a little spicy, but it was like a meal in itself. Craft beers are expensive, but I've been to more expensive places. I will return!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1xl3CyZ6xUY6OmO9c7DWuA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1xl3CyZ6xUY6OmO9c7DWuA/o.jpg"
      },
      {
        "img_id": "2pcagn2v8-Z36O4eM4Yu1A",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. Barbecue chicken pizza with pineapple on half.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2pcagn2v8-Z36O4eM4Yu1A/o.jpg"
      },
      {
        "img_id": "woRPpy-Ewo3NvgufYn6Rng",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/woRPpy-Ewo3NvgufYn6Rng/o.jpg"
      }
    ],
    "user_id": "tzE3QhxkHRwFry5nBn8F8g"
  },
  "fmCIRSRexsHCF2u6i8iLAg": {
    "date": "12/7/2015",
    "text": "Stopped in here looking for a place to get out of the Christmas-time rush at the Strip and rest our feet.  We would have done better to eat virtually anywhere else.  Service was competent, but extremely rushed (I don't think real words were exchanged - just points and grunts).  Inexplicably, the pizza crust was overcooked, while the rest of the slice was doughy.  We had the Greek pizza, complete with an almost inedibly salty garlic sauce.  Each slice came with one huge tomato, and when it fell off (as it inevitably did), the dough beneath was practically raw.  At least it was better than our friends' margherita pizza, which had virtually no toppings at all. The beer selection was decent, but my husband's draft was flat.  There are a million great food options in the Strip - this is not one of them.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "YzvlFHl6Q3SiaE3as0rrdw"
  },
  "UPvsiiinkuHszOuuUp0x6w": {
    "date": "12/26/2013",
    "text": "Really, EXTREMELY disappointing experience!  I took my Mom here because I'd been years ago and had some very good pizza.  Granted it was two days before Christmas (we were doing our manic holiday food shopping extravaganza), so it was of course extremely crowded.  Once we were seated and our order taken (which, not surprisingly due to the crowd, took a while), our food came out relatively quickly.    Let me be clear, this review is negative for one reason and one reason only.  Our pizza was burnt, charred, and the crust was almost entirely inedible (see pic).  The bottom of the pizza and crust were dark brown/black.  And, when I asked our waiter if this was normal, he said yes.  He asked if we wanted to send it back and have another pizza made for us, but considering how much shopping we had to do and only a few hours to do it in, that was simply not feasible.  What should have happened is that our pizza should have been comped, or we should have been offered a credit or something!  But, instead of anything being offered or any apology for an obviously overcooked pie, he \"apologized\" by saying \"I'm sorry that you did not like the pizza\".  Not \"I'm sorry that your pizza was burned beyond the point of consumption, here's what I can do for you...\". I did see a look of panic - he obviously realized that it was a botched pizza.  For the life of me, I simply cannot understand why the waiter insisted that the pizza was supposed to be burned. If I was waiting, I wouldn't have let that pie get to the table in the first place. I looked at all of the other tables, and no one else's pizza was burnt or even overly brown.  There was a mistake in the kitchen and it was our waiter's job to send it back or offer to do something about it.  In the end, my Mom and I had to eat something, so we pretty much just scraped the topping off of our pizza and left the crust and most of the bottom. Also, three of the pieces were completely inedible, so we didn't even touch them.   I rarely leave a one star review, and we still tipped the waiter 20%.  Although, I usually leave 30%-40% around the holidays, so he missed out.  But, this was simply a horrible experience.  And, considering the amount of great restaurants in the Strip, I think I can safely say that I will not be back and not be recommending Bella Notte anytime soon.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1j-VUGGwoZxtyuzMf1WqeQ",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. The topping was good, but the crust was inedible.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1j-VUGGwoZxtyuzMf1WqeQ/o.jpg"
      }
    ],
    "user_id": "V4Yx_l2ksyVVs1qm_STstQ"
  },
  "k3ME5UqsYM1Po6eY6hoL9A": {
    "date": "7/2/2017",
    "text": "We loved the pizza and the service! We had a large pepperoni pizza and a medium olive and sausage pizza, they are huge! We also had a buffalo chicken sandwich it was as big as two sandwiches! There where 8 of us and we have a whole other meal left. We also, shared a \"sex on the beach\", they did not skimp on the booze! I would eat here the next time I am on the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MHz5jPyuL6q43iCyeOvZGA"
  },
  "pAe3HZp_bh3MW3a43yMYCw": {
    "date": "11/23/2014",
    "text": "Good for a quick pizza if that is what you are looking for. We tried the Greek pizza and white pizza. The white pizza was bland and I wouldn't get it again. The Greek pizza would be suffering from the same bland taste but fortunately the greek olives and feta cheese toppings added some good flavor.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_2k63Cw7h3_6iU-GSoxoKQ",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. White and Greek pizzas",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_2k63Cw7h3_6iU-GSoxoKQ/o.jpg"
      }
    ],
    "user_id": "XWEbLpANMuEajGXWZ3_CEQ"
  },
  "s_Wl2Ulpi3qcRK1L0xdjlw": {
    "date": "7/11/2014",
    "text": "Ordered a white pizza which was flavorless.just bread topped with <a href=\"/redir?url=http%3A%2F%2Fcheese.it&s=6dfa391eb64397345daf162f7576b5379f450ba96852d043a359291515aaf07d\" target=\"_blank\" rel=\"nofollow\">cheese.it</a> does not take much to add a little flavor punch to a pizza..not to mention the burnt crust which took away the lil taste there was. Also ordered a bleu cheese apple walnut salad-for $9 its such a fraud..literally 20 spinach leaves topped with chewy gummy mozzarella...spinach leaves were not fresh,clearly rotting at the edges. Our silverware had old old rock hard cheese sticking on them..yuck!! Have to say our server was noce though. Not coming back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BKhXvO9A1-3HTzPsV4wBXg"
  },
  "piC8XgMLvdmKtIgfseJtqg": {
    "date": "10/17/2011",
    "text": "I'm the jerk who goes to the pizza place and gets a meatball sub.  But I had food jealousy and I had to!!  I saw a waitress with a tray full of them and then I watched this guy bite into it and it was done, I had to have it!    Was it worth it?  HECK YEAH IT WAS!  There's nothing like a thick Italian bread bun with 4 heaping balls of meat, enough marinara sauce to satisfy my sauce obsession and melted moz cheese.  Does that talk you outta a pizza now?  It was REALLY good and worth every bite.  I did not get food jealousy over my friends pizza.    Will I go back and order the Pizza next time?  Maybe, unless I see a Meatball Sub go by again, then all bets are off!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 5,
      "cool": 6
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "hI2k0zG0gfDDFo9piA86iA": {
    "date": "7/16/2016",
    "text": "Best calzones ever!  They're huge and jam packed with the freshest ingredients. Their service is great as well.. Oh, and\" leave the gun, take the cannolis\". They're so good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_bHE75f4FNKvBhPBfEipgw"
  },
  "DY_TcgBzn35JXA7r0G24Ug": {
    "date": "9/1/2013",
    "text": "We stopped in while stocking up on spices at Penn Mac. Here's the run down:  1. Service:  My husband asked our server what beers were on tap. She referred to the menu, but could not tell him a single one. Nor did she offer to find out. 2. Hygiene: Outside table was filthy. Literally. Nasty. Cleaned it with a baby wipe. 3. Service: Food took a really, really long time. Mediocre at best. And that is being fairly generous. 4. Food: Ordered an Italian sausage hoagie ($9). Sausage was bland, roll was enormous, and very little in the way of toppings. Came with Ruffle chips. Husband ordered the 16\" Greek pizza ($12.50) but no meat came on it. And there was no gyro meat, so he added Italian sausage for $2. 5. Hygiene again: Restrooms- yuck. Don't do it. 6. Pluses: Bloody Mary was ok. Diet Coke was good. Pizza crust was good.  Bottom line: seems to be a tourist trap that spent all its money on prime location and thus has to scrimp on everything else. Bummed we went there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "voTmwjTzaKSq3a9Eiwy3DQ"
  },
  "hrYfdu80v__RTYQR4zZ2QA": {
    "date": "4/28/2017",
    "text": "Oh,man! This place has perfect pizza! Whenever we're in Pittsburgh, we try one or two places we've never been to. One of them has to be a pizza joint. One particular visit a few years back, we already had pizza at a place downtown and thought it was the best we've had in Pittsburgh, but then we came to Bella Notte later in the day. MM MM . . . Pizza Heaven!  First, I ordered a beer. I love porter or stout and asked what they had on tap. Was recommended the Edmund Fitzgerald. Loved it! Found a new favorite. Next, we ordered a couple different pizzas. Mine was mostly peppers, onions, olives. My niece's was pepperoni and sausage.  My pizza was very good, but when I took a bite out of the pepperoni/sausage slice, it was perfection. The pizza was nice and hot. When the bottom of the crust slightly snapped on the first bite, it was like a pizza dream come to life. The pepperoni and sausage were not cheap quality. Very tasty. Another reviewer on here said the flavor was close to Domino's.  GTFOH! Domino's is junk. Not even CLOSE! That person must be a smoker who can't taste anything, or they were drunk.   After that fateful day, every year when we come to see the Steelers play (several times each season), or we're here to visit family and hang out, Bella Notte is on the list. In fact, I'll be in town at the end of May and my sister will be with me. She's gluten intolerant and can't eat the pizza. But, that's not my problem. I'm getting some of this for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N5hKPK1DWOTCViFiBbFeiA"
  },
  "2cv2rga5MJD8gd9Qo3T0AQ": {
    "date": "4/17/2016",
    "text": "At this places Founders night for PCBW we went to find them with two founders beers on taps and a private event booking the entire restaurant. We were told we could sit outside on the dingy patio furniture but decided to go elsewhere. Poor planning and False advertising = 1 star.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CnlxPu4hFgmu5HZzJ-PdLw"
  },
  "BC0pbtMq7mNRZo2N7zGkJg": {
    "date": "6/14/2011",
    "text": "Customer service (2/5): \"hello... is anybody there?!?\" It took a couple of minutes for someone to take our to-go order. The staff wasn't rude but they wasn't friendly either. They look like they were watching the clock and couldn't wait to get off work. Bella Notte seemed like the last place they wanted to be.   Food (3/5) : It taste extremely average! If I was blindfolded and was given three different pizzas to try, definitely wouldn't be able to notice anything distinct besides the thickness of the crush. I only eat cheese pizza so the main part of the pizza for me is the bread and the sauce. The sauce was very regular but I loved the thick crush! I got a half cheese and half pepperoni (my husband ate the other side). That was the first time I saw a restaurant cut up the pepperoni into thin slices... kinda odd but I guess that is their signature. I husband didn't really like it that much.  I would give this restaurant 2 stars but since they made such a thick crust, that deserved another star.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "n8ApkMzCTExXRJ5rI6jRCQ",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. My uncle and my husband split a pepperoni",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n8ApkMzCTExXRJ5rI6jRCQ/o.jpg"
      },
      {
        "img_id": "A0Zh7F5Zi1kek8vmcyzMBw",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A0Zh7F5Zi1kek8vmcyzMBw/o.jpg"
      },
      {
        "img_id": "Sm_O7xC_IB7Upovsq0Nseg",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Sm_O7xC_IB7Upovsq0Nseg/o.jpg"
      }
    ],
    "user_id": "EFM7rmwvSEUbEGMWSNCnhQ"
  },
  "fJFjtd2DCtP96XGOoZo8PA": {
    "date": "6/25/2014",
    "text": "Excellent pizza, crunchy crust with fab flavor. Single slice was only four bucks. Unreal beer selection, rail bender had a nice close. Service was friendly and fast. Hogie italian stallion was off the hook. Casual atmosphere and great food/ beer. Price for all this was under about $20 for 2.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6Uf2Gv-m0L58RvaUsZhprA",
        "caption": "Photo of Bella Notte - Pittsburgh, PA, United States. 44 beers! :-)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6Uf2Gv-m0L58RvaUsZhprA/o.jpg"
      }
    ],
    "user_id": "AFsJSIM5TrQq21xhVTaPTA"
  },
  "8-sp7mHU6VBstbLr3NAaRA": {
    "date": "9/26/2015",
    "text": "Wondering for the first time in the Strip. Food smells made me remember it was lunch. So I popped in here. Good beer selection. Surprised to see Great Lakes beer being offered. Yes instead of bloody mary. Pizza that was coming out of kitchen looked good. So I had mom and dad meet here for some good pizza. It did no disappoint. Sure the order was pepperoni and sausage but we got sausage and pepperoncini. I still enjoyed the pie. Hate to say. East Coast pizza is just a little better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aBFRYTkVbkA7wiB4q0OBbw"
  },
  "_iXeJksSWoIgjhfq4xZmPA": {
    "date": "4/25/2016",
    "text": "My Wife, Daughter and I made the 150 mile round trip to shop the Strip District. We have done this many times before, but always on a Saturday.Today, we managed to all be off on a Monday so off we went. One thing that was on the list was to have lunch at this restaurant.  We went in just after Noon and were immediately greeted and seated. A couple of minutes later, the waitress took our drink orders and just a few minutes after that, our food orders. Now, we are only at about 12:15. The ladies ordered the speciality pizza of the day and I ordered a sandwich.  12:45 and we were still waiting for our orders. just before 12:50, we were served our food. The pizza was very good and did seem to have been served hot and fresh. The sandwich, on the other hand, had an issue. It felt as though it had been holding under a heat lamp for a while. The bottom of the bun was no problem but, the top was so hot, I could not touch it for more than 5 minutes.  All in all, we ended up being here for right around an hour. The wait time was wholly unacceptable considering that there seemed to be ample personnel for a place that was only half full, or less. The waitress was very nice, but, never once gave us any information on why our order was taking so long to prepare.  In summary, the food was good, tasty and hot. The waitress was friendly but lacking just a little in the customer service end. Really no complaint about her since it wasn't her fault that it took so long to get the order prepared.  With all of the choices in this area, it really isn't likely that we would return to Bella Notte.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CfCPCcplhyOzwibnqzRI3w"
  },
  "hgefBNMpUV6Uc1YOF1Oo5g": {
    "date": "1/24/2016",
    "text": "Love coming here for pizza and beer. Never had a bad pizza. Service is attentive and location is great. I've gotten the buffalo chicken pizza in the past which was incredible but today got pizza with sausage ricotta and onion, crust is perfect and the sausage is crumbled not slices which in my opinion is the way to go, sauce isn't too sweet like some other pizzas I've gotten in pgh. Ricotta is so fresh and the onion was cooked perfectly. It can get pretty busy around peak strip shopping times but I tend to come at off peak to avoid the wait. Tons of beers on tap that my husband loves but I keep it simple. Can't say enough good things about this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2L5b8rGwqQzmQuqDsNOfkg"
  },
  "yKdnB1pb6C716st7CU0sVg": {
    "date": "1/16/2015",
    "text": "This pizza is really close to being a Digiornio pizza just with better cheese.  I ordered a medium, which they call an 8 cut...because they think number of slices somehow equals a size, which it doesn't.  I don't understand why so many Pittsburgh pizza shops use this standard of listing the number of slices as the size when it doesn't mean anything and you can cut any size pizza into any amount of slices that you want.  Chalk it up to yinzer IQ I guess.    The crust of this pizza looks and tastes just like a frozen Digiornio crust.  They cook the pie directly on the deck of the oven, which this time was VERY dirty and the bottom of my pizza ended up with a whole bunch of nasty burned black remains from other peoples pizza because the pizzaman was too lazy to just clean the oven as he used it.  Despite cooking directly on the brick this pizza is far from crunchy.  They use corn meal on the bottom of their pies which wouldn't be too bad if they weren't using way too much of it...so you end up with a dusty dirty pizza bottom in general. The pizza itself was way too thick and most of the dough did not cook at all.  The top of the dough and the bottom of the pie both LOOKED to be cooked enough, but the taste would beg to dffer.  The actual flavor of the dough is pretty good, I taste some decent yeasty fermented goodness with a fairly nice bready taste.  If it were a better consistency and it weren't so ungodly thick than it may taste good.  To my delight hey use a pretty healthy portion of sauce, unfortunately the sauce tastes obnoxious and cheap.  It is pretty obvious they are using the lowest quality tomatoes they can get and then adding a ton of sugar and garlic powder to try to cover it up.  The consistency is a medium thickness and slightly on the watery side, definitely no signs of actual chunks of tomatoes.  It tastes like the kind of pizza sauce that you would expect from skating rink pizza.  Once again the name Digiornio comes to mind.    The cheese is a mid grade cheese, it melts fairly well but doesn't have all that much flavor.  They are using a bit more of it than I would like but not so much that it ruins the pie.  The cheese was applied somewhat lazily and a lot of it ended up in the middle of the pie as opposed to distributed across the whole pie.    In general this is just another pretty bad pizza, mostly because of the sauce and doughy dough.   I give it a 4 out of 10.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "fUFU_BJS9I4ik1mmdS1JXQ"
  }
}