{
  "6r9YeEUru4-_VJdpPTvG1Q": {
    "date": "12/12/2015",
    "text": "Another incredible breakfast. I look forward to hitting fresh watch after my workouts on the weekend. The restaurant never lets me done. Great healthy food & great service.   I do however miss the seasonal guacamole toast and eggs!!! I could eat this every day of the week when in season!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VtHDRf7q4rKThNybX_W8KQ"
  },
  "zrqM_RRrxEM39V2ukNL1EA": {
    "date": "11/10/2013",
    "text": "Excellent meal, quality food. Definitely one of the better breakfast joints in the Burgh.  The wait was about 20-30 minutes on a sunday morning, which should be expected. The food came out quickly, and the server greeted us with coffee in hand.   Will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wAY-eV77GV3WK-iusIw6Kg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wAY-eV77GV3WK-iusIw6Kg/o.jpg"
      }
    ],
    "user_id": "LWnN50-raliixFsAbUJOeg"
  },
  "C5BmXreHbqXfiDugxH65xQ": {
    "date": "3/23/2017",
    "text": "I really love how fresh their food is! When I went, I had avocado and eggs and a fresh fruit cup. My only complaint is that they have the cup for coffee on the table (which made me think it was included with my meal and it actually isn't.) It's also pretty expensive for just one person to eat - for just me, it was $17 before tip! I couldn't believe it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j_XUyKHWIaTJwxRFqNgsxg"
  },
  "32S7ncdEX482w7KFJtDfwA": {
    "date": "6/14/2017",
    "text": "They have really good food, but their service is extremely slow. Definitely not a place that you could go during lunch break. The last two times I went, I had to wait 30-40 minutes for a couple of scrambled eggs and toast. They took care of our check since we were waiting for so long, which was really nice of them, but I still probably won't go back because of the slow service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VvHBIoxvPcFjixxGb8afiA"
  },
  "zOnzZZL_V4Xt39FFgDMq-w": {
    "date": "10/9/2016",
    "text": "We met with former colleagues for breakfast. Service was not very attentive and slow. Food was ok.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YV8EtsGyWW6AGp42giXX4w"
  },
  "NLuCzbFcfmOrzQdK0XXNKw": {
    "date": "7/6/2015",
    "text": "Great filling breakfast, many choices, higher priced but yummy. Be sure to tell waitstaff any substitutions ahead of time or they give you guff. Fast service.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_V2kDiQEsL59RICWe8H4pA"
  },
  "r3plqpZGaKf1E33-MTWzmg": {
    "date": "9/14/2016",
    "text": "I love this place! I went there on Sunday.  Given, it was not busy, but the service was fast.  The food was fast. I guess the other reviewers were there at a busier time.  The food was great! I had a green juice and fruit/granola/yogurt bowl and my boyfriend had a roast beef sandwich.  He said it was one of the best roast beef sandwiches he's ever had. I am vegetarian and he is a meat eater, so it satisfies both of us.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f-VFuyiqWrd-hxi_zXBeNw"
  },
  "_jeZtyT6kflK7UkYI_4u1w": {
    "date": "5/3/2016",
    "text": "If you live near Robinson, or even if you dont. This place is a must try! Their breakfast food is amazing, and you dont feel terrible after you clean your place! I personally love the omelets and pancakes! Being a vegetarian, it is hard to find a breakfast place that serves more than just a typical veggie omelet- and there are SO many choices for me on this menu.  Get there early, they get busy!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "svrTLBHJ_6F-icnCJwoF1A"
  },
  "WMMUCRL9kiMUFoRrKNZxXw": {
    "date": "6/14/2016",
    "text": "No wait, very clean, courteous staff. I started off with a Day Glow juice. Very good!  Had the market veggie omelette. I love the fresh vegetables that are ruff cut so you know what you are eating and large enough to to taste and enjoy each flavor. Pan cooked omelette not flat see through sheet of egg. Which I like a fluffy whole eggs. Very accommodating to my allergy needs.  I love the healthy whole food theme. We need more of this type of cooking!! Thank you for keep things real and not processed.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OgFCWjVJnU0jH_LRLFD8Fw"
  },
  "-IL4JTU5XW2vNM0rsLaDqQ": {
    "date": "1/8/2017",
    "text": "The food is bland, boring and overpriced.  Looks better than it tastes. The open floor seating concept is unappealing",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NP1tR93MFAFrTy9-hCuRUA"
  },
  "bQtrKgjnQTozWqF7nlfiyw": {
    "date": "8/21/2016",
    "text": "I know plenty of people love this place but I will lay out the truth so it's out there. The food is fresh, I'll give it that, fresh toast, fruit, eggs not cooked in butter or lard, squeezed juice, but does that matter at all if the wait to get in is at minimum a half hour (at best), the wait staff is slow and barely awake and the lobby is so packed that if you sit in one of their chairs and there are only a dozen people there that someone is practically stepping on you? I had a meal here in hopes of it being good, place is always packed, and I review a lot of restaurants and live by \"packed is good\" but this is \"packed is okay\" and the rating is lower because of the experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B3piSjG93U2zRxxXGFcvPQ"
  },
  "PU7z6J-_aXevZs_c1WI0NQ": {
    "date": "5/21/2012",
    "text": "For a quick, reasonably priced breakfast, this place is pretty good. Sometimes my meal is better than other times, so I think it depends who is in the kitchen. But the service has always been pretty good. And the coffee is fresh.  My recommendation is to order what the daily special is. It's usually pretty good... and fresh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4iM8a9l87M_mRSSpv2XAAQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Free wifi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4iM8a9l87M_mRSSpv2XAAQ/o.jpg"
      }
    ],
    "user_id": "cEAxi6i58_PTGtxcC4_nEQ"
  },
  "-EJ1VVbb9o6hpRtmBCE5xA": {
    "date": "6/26/2014",
    "text": "I ate here a couple of times recently.   On both occasions I was acknowledged and seated quickly.  The menu was filled with other than usual fare for breakfast.    The service was very prompt.  The food was prepared and presented quickly. The flavor Of both meals orders was very tasty.    My only feedback was I was not asked what type of bread I wanted or if I did or didn't want home fries   I will definitely eat there again.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QOZbBkZ1yaxqRt9vFm5u4g"
  },
  "c9TgwYGosU-bISgJ_6fBLg": {
    "date": "7/15/2017",
    "text": "Great menu options! I got a breakfast sandwich! Life changing adding avocado to an egg sandwich!! The staff was super nice and the environment was very welcoming :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aaiRtZKThIehk25hP7ww0A"
  },
  "QHoc_N-fJlKfWLmZiKJbBw": {
    "date": "10/9/2015",
    "text": "Love the  breakfasts here. The staff is very friendly and even helped me when I had lost a piece of jewelry!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PsH5Qi8R69WAlhNv8mXWRA"
  },
  "dHuQEi788mVp-mJmJmll8A": {
    "date": "10/21/2015",
    "text": "Yum, yum, and yum! The only problem is what to order. I typically order the same one of two things at restaurants but can't find a \"go to\" dish at First Watch due to everything being fresh and flavorful. I enjoy how I never feel rushed to visit a friend during off hours and that they put the water pitcher and coffee carafe on the table, so there is plenty. My only wish is they would open earlier.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AJ0ipi8t4D0ZEeEDD7Wmvg"
  },
  "M5uGmO60lWpH_OxyjEsKmg": {
    "date": "6/16/2015",
    "text": "First watch is a great choice for breakfast and lunch!! I had a traditional meal this time dippy eggs, toast and potatoes and the portion are small which is good but they have so Many healthy options it's honestly great! Also you can sit outside as my friend and I did this morning and it was such a great lunch!! Our server was strange and perhaps he was nervous or maybe new but other than that fast service and great food! Highly recommend for someone that loves eatting on the healthier side or just wants a good meal.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "wvYpyy5uxB_b28bRc8PvPA"
  },
  "bKVtwsNHOTOzXQHo10SCvQ": {
    "date": "3/21/2015",
    "text": "Good for my kids who don't eat vegan but not I. This is from their company one year ago and still nothing. No non dairy milk options if ridiculous. So is not having a meat alternative. First Watch really needs to get with the times.  4/30/14 Your suggestions to add more options for vegetarians and dairy-free diners have been duly noted. I will pass this information on to our culinary team. We recognize the opportunity to provide more vegetarian and vegan options for our guests. .",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "DIKwEdl0Qt1d4yaZ_UfelQ"
  },
  "pWoh8ilt7u5jDuInVWk_wA": {
    "date": "2/18/2015",
    "text": "For a place that emphasizes quinoa, kale and freshly juiced veggie drinks, it is shocking how few choices there are for vegans.  I saw two options -- one was some sort of wrap (although I would have needed to ask the waitress to hold the cheese) and the other was the veggie burger.  I ended up choosing the veggie burger, but I would have preferred a nice, oil-free tofu scramble.  I've started making oil-free tofu scramble at home -- it is quite simple to prepare.  Why not offer tofu as protein to sub in for most of the egg dishes?  It'd be so simple, and I guarantee you'll end up selling alot more than you think.  The vegan population is exploding!!  Let me know when you start offering a tofu scramble, and I'll immediately upgrade my review.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "vCjD0RqN-ktDCAfS5a2F6g"
  },
  "MTVHPHdUfBAdsjErK6LeAA": {
    "date": "1/24/2015",
    "text": "Slow inattentive service. Poor quality food. This place is Eat N Park sans the folksy charm.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "qzxT8LECo3lGlSZbIDUH_A"
  },
  "zzKtQbcQYun9Ark40sV5hw": {
    "date": "1/23/2019",
    "text": "We have been here multiple times- never had a bad experience. Each server we have gotten has always been so pleasant. The food is incredible. It's just a really nice and satisfying atmosphere. I know people would probably say the place is small, but I'm sure they didn't expect to be so popular. It's a great breakfast and lunch spot. Portions are big, and prices are super reasonable!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UOe8J1mylWmWzNX3lP5x2w"
  },
  "wI8qDjdIOqFrcmxObAD4Sw": {
    "date": "7/7/2018",
    "text": "Exactly what I was looking for in terms of a fresh different take on breakfast. So glad we checked it out. Confirms that there are some great food establishments out there. I will be returning soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0yUYVkKiq5UfHq4GADeetQ"
  },
  "jOmNNr3M3Kul_rgWR9zLbw": {
    "date": "7/26/2017",
    "text": "Let's preface this review by saying that we eat breakfast at First Watch probably three Sunday's a month and have for maybe the past three years or so. I'm acutely aware of their product, what to expect service wise, food quality wise, etc.  I'm a creature of habit. Change throws me off and today 4/10/16 it really did. Their menu has changed dramatically. Items removed, items added, names of items changed. What comes with items has changed. An omelet now comes standard with a mixed green salad, no longer with breakfast potatoes.   No longer is an English muffin provided, but whole grain toast. I get it, maybe it's a bit more healthy, but that's irrelevant when it's soaked in butter. Granted these items are still available and they can be asked for, but why?  They added some popular specials to the menu which are now standard items and that's great because they're enjoyed by many.   Also, I come here expecting strong coffee, today, it was terrible. Weak, watered down. The second carafe they provided was better.   Food quality was suffering today as well. We were told the breakfast potatoes were changed and are better now...they're not. There was nothing wrong with them previously. They were cut uniformly, cooked uniformly and seasoned uniformly. The new and improved potatoes are bland and tasteless. They're not better.  Today was a flop, and I've never said that in all of the time we've been eating here. Going to skip it for awhile and see if things improve down the line.   7/26/17 - Update  First Watch has long since fixed their issues and all is right again. Product quality is top tier.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "CtTgK-Crw3bKw3tEiRfINw"
  },
  "qJaZOdZCMDGr8H6DEyPkZA": {
    "date": "4/25/2016",
    "text": "Holy slow! Terrible service. It took nearly an hour and a half for us to get in and out of First Watch yesterday. We only saw our waitress when she sat us down and when she came to drop our check (someone else brought our orders to the table). We waited the entire meal for refills on our water and didn't get them until after we had finished our food. The food itself was nothing special, just okay. I ordered the Chikichanga... I was underwhelmed by the quality and size of the portions for the price. Didn't seem like fresh ingredients. It cost over $40 for 4 people to eat an average breakfast, and one person literally had a single pancake.  In the end, it's just a glorified alternative to Eat-n-Park, with a heftier price tag. I don't get the appeal or the high reviews. Besides location... it doesn't seem to have much going for it.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "s9cI2U6kyJj8yTFNvmfveg"
  },
  "buCy68Ehwt1_H3ctPjZtwQ": {
    "date": "11/25/2018",
    "text": "Had lunch yesterday. The food was average and the waiter was personable. Our order (salads and breakfast) took almost an hour. Other tables around us- those with large parties were served and left. I was told the kitchens was really busy... when checking out I brought it up again and was told 'it's been a rough day'. I said we had a rough time during our visit too...  no response- in fact, the cashier turned and started talking to another co worker while waiting for my receipt. I should've asked for a manager but thought the staff would've responded with more of a customer service focus. So, for $54 that's what I received. (Totally Unlike the first watch in Bridgeville - have had good service there in the past)",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-rFlz_F7jNliqMq6GP9ing"
  },
  "S4OqgCvPnczS-yeRBQDOkw": {
    "date": "5/8/2018",
    "text": "This is my favorite place to grab a healthy option for breakfast. The service is always good and I never had a dish that wasn't delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8rulkq_7haoaUy5YV2ijtg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8rulkq_7haoaUy5YV2ijtg/o.jpg"
      },
      {
        "img_id": "G3iwqGAd9ilAEQsp0hBqvg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Ancient Grain Protein Bowl",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G3iwqGAd9ilAEQsp0hBqvg/o.jpg"
      }
    ],
    "user_id": "aob5RIBYEnYbxMpK8gH5vQ"
  },
  "m20JPwSKU04ToALdCdKUaw": {
    "date": "6/18/2017",
    "text": "I wish my rating was based on their food & service.   Instead, it's based on the fact that we were never even seated. We went for brunch and were told it'd be an hour wait (which is understandable considering it was Father's Day, so no worries).  We gave our phone number and they said they'd send us a text when our table was ready (again, should have been an hour wait). After waiting for over an hour and a half, we left because we still hadn't been called in to be seated. Even after we left, we still never received a text. I understand if you're busy but you can't make people wait for no reason and waste their time. Obviously this isn't indicative of everyone's experience at First Watch, but it's a shame something like this happens to anyone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WRY-gsL2o_p2vPiroX50Lg"
  },
  "1B0d7xP4boJToXUwzy3T5w": {
    "date": "6/10/2017",
    "text": "Great wholesome breakfast!  Love the concept of First Watch especially unique considering they close at 2:30. Perfect balance for work home life. My favorite breakfast is the Avocado on Toast.  It's so fresh and filling without making you feel guilty for breakfast.   The lemon Ricotta pancakes are amazing as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RlOKH96V3LNIkWuhJ4VO8g"
  },
  "30gAELPbZ8q4gosdUI369A": {
    "date": "8/22/2017",
    "text": "This is the second time at this location.  The first was, well, the first strike.  This second trip is heading down the path to being a second strike too.  The saving grace to my last trip was the wait-staff.    First trip:  1.  Water bottle at the table had food debris floating in it. 2.  The glass was visibly dirty 3.  The breakfast tacos were WAY over cooked to the point the corn tortillas were crispy (not fried, just dry) and the egg and meat was crusted and dry. 4. The tacos were sent back and French toast was brought as a replacement...absolutely nothing worth writing home about, but the meal was comped on account of the crunchy breakfast tacos.  Second trip:  1. Wait staff was again stellar.   2. Water at the table again had floating food (I hope) particles. 3.  Ordered the trifecta, chose waffle and over light eggs.   Waffle was awesome!  Eggs were over medium/hard.  Overall, after two trips and having the 'dirty' water both times and the less than awesome food, and having great experiences with the staff, I rated my experiences 3 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JDy5BHs270SgmohpwUoDHQ"
  },
  "ljzFbJjmpOS57zOHPPdPmQ": {
    "date": "10/4/2018",
    "text": "Had a lovely late brunch. There were 3 in our party. We were at the register paying our bill when a manager arrived and it appears he was cashing out a server for the day. The service was extraordinary and we even had a great chat with our waitress and the manager about another local business. It's small moments like these, great food, and warm service the will always produce repeat customers. See you again soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cd3qlFpnUUtm7YlHAUzYnA"
  },
  "LB4N42YlXwP_3npfn2MGgw": {
    "date": "3/23/2019",
    "text": "Food and service typically very good.  However the wait list app is super buggy.  Several times it has shown no wait even after refreshing and we arrive ten minutes later and have a 30 minute wait.  This morning we knew we were headed there, the wait list app showed no wait so I called and asked if they were on a wait.  The lady on the phone said they were full but not on a wait.  I asked her to take our name so we would be on the list.  She said she couldn't and sent me to the manager.  He agreed to take our name and then started lecturing me about how this was an inconvenience and he wouldn't do it again.  During mid sentence he said well now we are on a wait so you need to use the app and hung up.  We attempted to use the app and it was bugged.  Kept giving us errors.  So we went elsewhere.  I don't plan on returning.  Rude and indifferent manager and buggy technology, unwillingness of staff to work out simple common sense solutions leaves me heading to different breakfast options.  Doesn't matter if your food is good if your management is rude and indifferent to customers.  Very disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ofeMwpedk8QHCNEeBSzUDQ"
  },
  "9o-9RN9LMvRvhnOCwtsHRQ": {
    "date": "9/19/2018",
    "text": "Food was good, had a chicken salad melt. The butternut squash bisque was fair, not the blend of squash, cream and fall spices that I am used to. However, what really brought the quality down were the fleas all over the back wall on their pictures. At first I thought it was dirt, but upon closer examination, they were bugs, and lots of them. When leaving, I looked at other walls and noticed the same thing. It was disgusting!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DFSJ13D11wiF37Wz12OlpQ"
  },
  "Z6ByodULt_GmfuAWZEd8zg": {
    "date": "12/14/2017",
    "text": "I called to place an order for pick up.  They have a veggie sandwich that's excellent...my problem is that I can't eat cheese and the bridgeville location allowed me to substitute avocado for cheese.  This one has RULES.. and the rule to make that BIG switch costs $1.50 + a new customer.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lT1K7uqkRnB9aND3UvUx5g"
  },
  "_VoJhKa51uPtVpubSw3p-w": {
    "date": "11/2/2015",
    "text": "Went here on Sunday for brunch and there was a 25 minute wait.  Recommend using NoWait - didn't realize they use that app or would've added our name to the line beforehand.  But the wait wasn't terrible - it may have been less than 25 minutes since tables were turning pretty quickly.  Ordered the Harvest Egg in a Hole and the menu description made it sound more fancier, trendier and yuppier than it actually appeared in reality.  I was expecting a rustic, thick-cut sour-dough bread with wilted kale sauteed with cremini mushrooms (aka fancy-schmancy mushrooms) and got what appeared to be white bread (I'm sure it was sour-dough but didn't really taste much of anything except the egg and sauce), with raw kale leaves that had some white mushrooms sauteed to a mush and probably three bacon bit crumbs.    The egg was runnier than I usually like but all in all it was an average meal.  The highlight of the meal was probably the juice.  I drank the Day Glow which has a gingery taste so if you don't like ginger don't get it.  And my husband had the Kale tonic.  I really liked both but drank more of the Day Glow since my husband doesn't like ginger.    I'd probably go back to try something else but not when it's so crowded on the weekend.  Overall, I thought they make the place seem trendier and tastier than it actually is.  Great job marketing!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5nsIq7FuDbh75uG7sN0V7Q",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Reasonably priced juices!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5nsIq7FuDbh75uG7sN0V7Q/o.jpg"
      }
    ],
    "user_id": "NnrCwpS1i5mZtkGGzmIk0g"
  },
  "XUJr64kOUSUXEFdKauB6-A": {
    "date": "9/16/2015",
    "text": "This would be my second time visiting the First Watch Cafe. The first time I stopped in real quick and had avocado toast, which was good albeit simple. The fresh squeezed orange juice was good and a pretty good value. The visit made me want to come back and try a few other things when I had more time.  So today was the day. I took a later lunch since I worked through the normal hours. I got here about 130pm and the place was pretty empty (the place is bigger than it looks from the outside). I was seated immediately and the waiter pounced with coffee ready. As he poured the coffee I ordered a juice called \"Surprise and Shine\" which is watermelon, cucumber, lime, carrot and beet. The waiter said it tastes like water melon with earthiness. Sure, why not .. who doesn't need dirt every now and then! Maybe it will be like when I was a kid and dropped my watermelon in the dirt but ate it anyways! Juice came in a few minutes and then I ordered up what I use as my yardstick for all breakfast places.. Eggs Benedict. Although they had the ham version with tomatoes, but I ordered without so it was more of the classic dish.  So here are my reviews of the items:  Coffee - I like my coffee like my women ... dark and bitter. The coffee passed that requirement and seemed above quality versus normal diner coffees. The waiter left a container of it on the table for quick refills.  Juice - I didn't really taste much of the watermelon. The beet flavor basically came out first with a hint of the cucumber and then the aftertaste was the earthiness ... or again dirt. I really am not sure if I liked it or not. The initial taste was great but then the dirty taste was off putting. I know some people love that taste (my wife for example) but it left me perplexed. Anyways, it was a good enough portion and I drank it all ... and it is good for me right?  Eggs Benedict - Instead of the Canadian bacon it had normal sammich meat ham, which still went well with the meal, but I thought I would mention that. The poached eggs were done perfectly to my liking, yolk nice and running and the egg firm, not hard or gooey. The Hollandaise sauce was very good. It had a nice buttery flavor, but it didn't make me feel as if my heart would stop. I only wish there would have been a bit more on top, but then maybe the meal wouldn't have been so light. The English muffin was a normal toasted English muffin. Nothing good or bad about that, and truthfully I would rather go with the classic then have them make something up ala Meat and Potatoes (which is still my least favorite restaurant ever.)  Side - The meal came with a side of potatoes. They were pretty simple, cubed, salt and pepper and a few onions and weren't soggy or crispy. They weren't my favorite potatoes, but they fit with the dish and didn't try to steal the show.  I would recommend this place, especially if you are into juices and lighter breakfast meals versus the local diners that try to give you a heart attack. Keep in mind they close at 230pm and only serve breakfast and lunch. Wait staff was friendly and efficient and the place was clean. The silverware was also nice ... you know heavier metal versus the flimsy stuff you get at some places.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "APwYHd2rpDtKgXBNFmCCjQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/APwYHd2rpDtKgXBNFmCCjQ/o.jpg"
      },
      {
        "img_id": "_v3_I-uqEsNMqNp9MCPXGg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Juice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_v3_I-uqEsNMqNp9MCPXGg/o.jpg"
      },
      {
        "img_id": "p578YcwuNvr4j8Pij2v5ow",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Eggs benedict",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p578YcwuNvr4j8Pij2v5ow/o.jpg"
      }
    ],
    "user_id": "SCw-r84DjPFdsMzN_rjftA"
  },
  "Kg_pVO88vxvEYyMW-BgRfg": {
    "date": "5/19/2018",
    "text": "This menu is so unique and special!  The service was superb and I love this place so much!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "okUpEzJgY65MUghHZe474g"
  },
  "pT3m8UOz7i-Wco56tH5rug": {
    "date": "10/9/2017",
    "text": "I had the pumpkin pancake breakfast and it was pretty good. I wasn't a fan of the chicken sausage, but maybe that just isn't my thing. The eggs were a little bland, but they were at least light and fluffy. The coffee was great! It was strong and flavorful. The service was amazing. Our waitress was very attentive and quick.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xx7cy3AkqeI_LQUwlLybrw"
  },
  "17qmRE4WlrClFhjykK0Tjw": {
    "date": "9/16/2017",
    "text": "Cold brew coffee is delicious, Morning meditation is awesome. Fruit, yogurt and granola bowl was delicious. The ambiance is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KrtJ5Dav7cgjcO2-qBcUyQ"
  },
  "_ZFB4E2iTJQykWokzm_ovg": {
    "date": "1/17/2016",
    "text": "A fantastic Sunday morning brunch unlike many places in the Pittsburgh area. I've been to Pamela's and other brunch locations, but most seem unappetizing after eating at First Watch.  Something I really liked was First Watch's use of NoWait, the app that let's you get in line before you get there. I wasn't aware of the feature when we went, so we killed 20 - 25 minutes in Barnes and Nobles while we waited. The NoWait feature could've been better advertised, like on their window for easier visibility.   The service was fantastic, our waitress was very attentive and friendly. The front desk staff was very friendly and accommodating. The food selection was incredible, it was healthy and didn't make you sigh like you typically do when healthy options are on the menu. The avocado toast, while $4 per half slice, is a must! I've never tasted something so wonderful on toast before. I got the turkey burger, which was extremely flavorful with it's sauces. My partner got the veggie burger with a fruit bowl which he said was excellent.   Their soups all contained dairy, something I was hoping to avoid. It would have been nice to have at least one side soup option that didn't have any dairy as I had to resort to getting \"greens\", which was a pile of dry spinach.   Overall it was a great experience. For the two of us it was around $33, which is typical for a nice Sunday brunch. Although it was just the two of us, it seemed like a great location to have a group of friends and bring your kids. We can't wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "QbdMp3irBF5u5Y9IOOC0iQ"
  },
  "6mwF6WnYqTADafN-MCgHYA": {
    "date": "2/19/2018",
    "text": "It's hit or miss.   Sometimes good sometimes bad. Chef inconsistent.  Long wait today for food. Food cold. Nothing worse than cold waffles and pancakes.   Staff nice though not quick on refills of drinks.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OjFZw3XQWFo9Qdsq1VMZnQ"
  },
  "djoCrC7QFkCrISQdh3jsxw": {
    "date": "5/28/2019",
    "text": "Not much for reviewing chains, but this one is consistently awesome.  Food quality, service, and always changing specials, make this a staple in our breakfast/lunch restaurant rotation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6aASDuw9SOejVBarYYe2eg"
  },
  "fVrT59W3s8XhewrheDyKJA": {
    "date": "2/16/2019",
    "text": "The food is always good and fresh, the service is usually really attentive (I've had a few so- so experiences which prevents the 5 star rating) and the vibe is always lively, weekend brunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ioOKyiEhLF1ez3VXoaumww"
  },
  "yqXPCx2ppSziBMPuqXsIQA": {
    "date": "7/21/2016",
    "text": "It's an improvement on Eat n Park.  They have some healthy food options, and their service is quite good.  There's outdoor seating, and the tables all have umbrellas.   I like that there are newspapers you can read and they are kept somewhat organized up front by the register.  The tables are clean, and they bring you a glass jar of water so you can refill your own glass when you like.  Unlike some other reviewers, I got very quick service, but that may due to the time of day.  There seem to be plenty of staff working, and the service was very good.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Q2sJqbtkCWY6Oy2tlpA-eA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Inspired Italian omelette",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Q2sJqbtkCWY6Oy2tlpA-eA/o.jpg"
      },
      {
        "img_id": "Q40ieXF-XrC1hiy8DGQYow",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Q40ieXF-XrC1hiy8DGQYow/o.jpg"
      },
      {
        "img_id": "Ecyzc9E4a7EZGRkR_9xAiA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ecyzc9E4a7EZGRkR_9xAiA/o.jpg"
      }
    ],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "R7vtkAWiN4a0z5elY8gziQ": {
    "date": "4/10/2018",
    "text": "I never have any complains with First Watch. The breakfast is always superb and the service is always good.  Even though it is a chain restaurant it never gives the feel that it actually is.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "91koVXu54Y6tIiZKKxVmrw"
  },
  "2VDIL4_d7j1hrrYy9uFGKA": {
    "date": "11/16/2018",
    "text": "Food was fresh and extremely good considering the price. Service was solid, will definitely visit again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8YlyL-21KYOdecDm1xUYcA"
  },
  "x4XVxLE41E6mRDWqMJtv9g": {
    "date": "4/22/2016",
    "text": "First Watch is serving up a breakfast that will keep you coming back!  I originally ventured to Settlers Ridge to meet a friend at Panera, but we ended up wandering over to First Watch instead. Upon arriving there was a line and I was a little discouraged, but I very quickly received a text that our table was ready!  Upon being seated our waitress gave us our own pot of coffee and water carafe, which I actually really enjoyed. I loved having coffee refills without trying to flag down the waitress on a busy Sunday morning.  Inside we ordered Lemon Ricotta Pancakes and the Healthy Turkey. I don't typically order juice at restaurants, but I also tacked on a Spring Hydrate juice because it sounded enticing with cucumber, pineapple, coconut water, and lemon. It was delightful and very refreshing. The Healthy Turkey was very good, but the Lemon Ricotta took the prize.  The inside of the restaurant is a little confusing because it is very plainly decorated and almost looks like a chain, but the menu itself is almost artisan!  For breakfast it was a great experience and I can't wait to go back! Highly recommend!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "D2bCEED_bCbKRI6BrKh3rA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Spring hydrate juice with pineapple, English cucumber, coconut water, and lemon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/D2bCEED_bCbKRI6BrKh3rA/o.jpg"
      },
      {
        "img_id": "Sb_kIK5-6x6tQuE35t0gdQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Healthy turkey",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Sb_kIK5-6x6tQuE35t0gdQ/o.jpg"
      },
      {
        "img_id": "yadyn3vcCSoQxVmL3VhX6A",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Ricotta lemon pancakes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yadyn3vcCSoQxVmL3VhX6A/o.jpg"
      }
    ],
    "user_id": "NxtYkOpXHSy7LWRKJf3z0w"
  },
  "KutZ1gYOLHDSmDyoDVvFXw": {
    "date": "7/17/2017",
    "text": "Quick service at opening.   Papers are available. Coffee keeps coming.   First Watch is an upscale EnP.   Order the Millionaires Bacon!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "r8jAojQ5RaubH810WLSVPg"
  },
  "5GJOoea-aQy-Hu5Fs3RJIg": {
    "date": "1/7/2018",
    "text": "This is the second First Watch location and I've been to and it didn't disappoint. A lot of healthier options and the food is very good! If you are an iced coffee lover, make sure to have one here - I'm not sure what they add to it, but it's served creamy and delicious. Be prepared to wait at breakfast/brunch time on the weekends, but it's well worth it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jsow7ZZWYkMaO96S-OiGxw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Biscuits and turkey sausage gravy",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jsow7ZZWYkMaO96S-OiGxw/o.jpg"
      },
      {
        "img_id": "mUoFRQot4uD3QKRMuzsktg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Biscuits and turkey sausage gravy",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mUoFRQot4uD3QKRMuzsktg/o.jpg"
      },
      {
        "img_id": "lO5B6gx1BSLcHnQ1y5xrRA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Iced coffee",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lO5B6gx1BSLcHnQ1y5xrRA/o.jpg"
      }
    ],
    "user_id": "-sv8-a09Psq5CMzmg6E4OQ"
  },
  "NV8SqGGi-xS9Pjp4mtRksw": {
    "date": "4/9/2019",
    "text": "The food is always good here, and the staff is always friendly. Very clean and looks very new. If you're going on a weekend make your reservations!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UaTkRik--v4oj3ychivLuQ"
  },
  "S_lFL_OqGymidLgULJiF_w": {
    "date": "8/6/2018",
    "text": "Outstanding. The food was bright and delicious.  It was a great way to start my day - especially while traveling to PGH.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "pkzvUiMhXdMG1V8TMVpYLQ"
  },
  "Qc8c4PHeHg_RgaEXpoowUA": {
    "date": "8/30/2018",
    "text": "Two words.. millionaire bacon!! Bacon lovers unite!! It was so good, bacony (spell check be damned), spicy and sweet. It was heavenly. Oh I also got a power wrap that was good too. Even better when I put the bacon on it!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e1fG2yC5mXsZWK7PopLJFg"
  },
  "CR8Aa61IN9LYs18zenoN_w": {
    "date": "5/1/2017",
    "text": "This location is so much better than the one in Bridgeville.  I have never had any problems here, and this was my third or fourth time at this location since it opened.  I took my mother here for brunch today (her first time here), and she had the Belgian Waffle with a side of berry compote, and I had the Lemon Ricotta Pancakes w/strawberries on top, and a side of potatoes.   Everything was good, except they tried to charge us twice for coffee.  They only brought out one pot, but there were two coffees on the bill, but it was corrected at the register after I mentioned it.  Service was very good, and unlike the Bridgeville location, where I always seem to have some negative issue arise with the food, today's meal had no problems with the quality or quantity.  I asked mom if she would ever like to come back, and she said yes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "WyE8dydmdmlhMGvuCtmtMQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Coffee &amp;amp; side of potatoes . . .",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WyE8dydmdmlhMGvuCtmtMQ/o.jpg"
      },
      {
        "img_id": "IMTmpboqEcZM1A2QgJbVGg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Lemon Ricotta Pancakes . . .",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IMTmpboqEcZM1A2QgJbVGg/o.jpg"
      },
      {
        "img_id": "hF6bZ3AkuhQb4J7NmbwmQQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Belgian Waffle . . .",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hF6bZ3AkuhQb4J7NmbwmQQ/o.jpg"
      }
    ],
    "user_id": "z_ueJdSU51z4RTU9Fg5Ikg"
  },
  "bpIuKCw6juEmxv7a1J7XNQ": {
    "date": "3/24/2019",
    "text": "I just waited for 45 min on a table and people just walked in after they cleaned the community table and the host offered 3 groups of people immediately to sit there. You could have offered to the people who have waited the entire time. Poor hostess.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MGLEbaB6vGCzOYWMfYzpxg"
  },
  "ezYub1HN-0JuX9hecm3I_Q": {
    "date": "5/7/2017",
    "text": "We love the healthy options at First Watch. They offer a farm to table concept and use fresh ingredients. For the coffee lovers they have flavored creamer which is rare for restaurants. They also have coffee available in their waiting area. Food was great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s0pNs1zwp3B-6i5YNG8t6A",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. A special for the day. Croque madam.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s0pNs1zwp3B-6i5YNG8t6A/o.jpg"
      },
      {
        "img_id": "zREWd92vfKG4kWk1NtlEgA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Traditional breakfast with turkey sausage. Strawberry jam is very good. Potatoes are seasoned nicely.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zREWd92vfKG4kWk1NtlEgA/o.jpg"
      }
    ],
    "user_id": "T_mcCDS5mfVfGkYX799aBw"
  },
  "hbz6bCZYg14Z_0apf0bGxg": {
    "date": "3/5/2019",
    "text": "I enjoy coming here for breakfast. The food is wonderful and fresh. I've had the avocado toast, Bacado and the sunrise granola bowl.  I can't say which is my favorite...they're all delicious. The waitstaff is very attentive and friendly. I really like being able to use the yelp app to get in line...it saves soooo much time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j_dK2S8ajYCYWsx29INSvg"
  },
  "geyUqDBkmbioITfIKhP2aw": {
    "date": "12/17/2017",
    "text": "Yes, chain. Yes, suburbs. But this place has actual, quality non-gimmicky basic ingredient breakfast that is well prepared. They do have your basic overrstuffed omelet or empty carb pancakes. But they also have a set of delicious healthy options that's aren't just Quaker oats.  I had their quinoa bowl, subbed sausage for avocado for sausage.  Came with basted eggs, fresh kale, and a hint of citrus. Yes, that's right: urbanist health food. Best breakfast out I've had in a long while. If you wanna go full-on hipster, they have avocado toast. On thick harvest bread.  How ironic would it be to eat avocado toast at a suburban chain in a strip mall??? You'd be hipster of the year!!!  (FWIW, I'm not knocking the ridiculous omelettes or empty carb pancakes. I do love that stuff. But there's so much more! And you're missing out on a whole different and growing market. I just don't want mu breakfast putting me in a coma for the rest of the day.)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8_ynsBLLXaxQ-2ge0wZSIg"
  },
  "1zUNrYk4he7uyh_6lp7hpg": {
    "date": "11/12/2017",
    "text": "If you like waffles, you have to try the cinnamon roll waffle!! This has to be one of the best ones I've ever tasted. Its drizzled with cream cheese frosting and comes with cinnamon syrup and pecans. Its on the seasonal menu but I wish they would put it on the main menu. It is sooooo delicious I went two times in one week so I could have this waffle. First Watch please add this waffle to the main menu!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Gz-10BWHD5ioaQWZnm3IDg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Gz-10BWHD5ioaQWZnm3IDg/o.jpg"
      },
      {
        "img_id": "q_KxrdJfomnbuLwgJxei0w",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q_KxrdJfomnbuLwgJxei0w/o.jpg"
      }
    ],
    "user_id": "H7XDDvuv9-0FjF2okn7QDg"
  },
  "WfZ9WftRrkId5DfujzoVqg": {
    "date": "9/27/2017",
    "text": "I've heard a lot of great things about this place from numerous different people so I was very excited I finally got to try it. I really liked the amount of options they had and also the fact that the options all looked very good. Most of the options were very healthy which was nice. Everything was reasonably priced and the portions were nice sized. While there was definitely nothing wrong with my experience, the food, or the service I just wasn't in awe. It felt a lot like a upgraded eat n park establishment. While I love that occasionally, there are so many amazing options in this food city so in comparison to everything else it just fell short of my expectations. I will definitely return again and give some other entrees a try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Y6tXYPYqeVy37-L5p0rMw"
  },
  "3Y-7HS1Lzmfj3jmaff-iqg": {
    "date": "11/5/2017",
    "text": "Excellent Breakfast spot! I ordered the chicken avocado chop salad. Delicious! I also got one banana granola crunch pancake! It was amazing. Bits granola and cranberries mixed into the batter and bananas pressed into the pancake while cooking! My girlfriend ordered the lemon ricotta pancakes with a side of eggs and bacon. No complaints service was awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NDWo82h6OJKjstPkjZOWiA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NDWo82h6OJKjstPkjZOWiA/o.jpg"
      },
      {
        "img_id": "kp20wlaEN7rWMCxOzgcP0g",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kp20wlaEN7rWMCxOzgcP0g/o.jpg"
      }
    ],
    "user_id": "EAepMn2I9CzkqLm9H2C4JA"
  },
  "C3-n7fDtrbV3eBVs3Bnahg": {
    "date": "7/4/2018",
    "text": "For breakfast, the lemon regatta pancakes are unbelievable!!! Give yourself time on the weekends, it's usually a 20 or 30 minute wait but still worth it. If you didn't have to wait, it wouldn't be worth waiting for!!! If you don't like to wait, I would recommend using your Yelp app and getting on the wait list before you arrive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c-9DFmzS11Fiz5xr-lb6Xw"
  },
  "IPPIMgXlnAY0rJ_5iF0hlw": {
    "date": "7/27/2019",
    "text": "I love every First Watch I've been to, but this one really surprised me today! It was super busy so I was afraid the service wouldn't be great. Our waiter Alexander was really efficient and super friendly! We also got in line with the First Watch app and were seated as soon as we got there. Not too long of a wait for food either :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nsNSAetCZ5czlO14cRUkDA"
  },
  "iccQc7ZIXJtqU9i4md-R8w": {
    "date": "10/15/2018",
    "text": "Stopped here for breakfast on our way to the airport.  Got there just before the \"church folks\" started to arrive.  Very nice waiter.  I ordered Floridian French Toast.  Barely needed any syrup.  Husband had scrambled eggs and bacon.  Only had two types of bread for toast. Sourdough and multigrain.  Need more selections.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UuGzbgX9Nj6jZ92SVKDcaQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Floridian French Toast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UuGzbgX9Nj6jZ92SVKDcaQ/o.jpg"
      }
    ],
    "user_id": "VblVPsnCGff5a9MF6HGouQ"
  },
  "Md-_qkjD46-7WAII50oJBg": {
    "date": "3/1/2019",
    "text": "Always solid!  Everything is fresh and delicious.  I've never had a bad meal.  The newly renovated space is AMAZING.  Way more room....may be a little crowded when full though.  A little bit of squeezing.  A little something for everyone .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DLigL1bWfN6S01SdwhfXzw"
  },
  "sPLwz-UPYljpkLIeKqpQeQ": {
    "date": "6/29/2019",
    "text": "Was visiting from out of town , stayed right across the street . What a nice home feeling in a busy commercial area. Very cozy , lots to choose from . Wish I had a place like this at home . Yum !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pli1m4I6zpnTK03tFGd3lQ"
  },
  "wXcAB5vjqEs5MoVOjNxhkA": {
    "date": "4/14/2019",
    "text": "The food was great, service wasnt horrible just a little slow due to how busy it was.Took about an hour to get a table because they were so busy. I got a bag of their coffee to take home and I was very disappointed to see that it has a best used by date of April 11th when the date today is the 14th. They should really check what they are giving customers or putting on their shelves.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "11EkPDvpeRT7e87ITc1yLw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/11EkPDvpeRT7e87ITc1yLw/o.jpg"
      },
      {
        "img_id": "A3dYSaF1duOQObPEh6Xn9g",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A3dYSaF1duOQObPEh6Xn9g/o.jpg"
      }
    ],
    "user_id": "BdFhze1yTNZmDa6uXeejPw"
  },
  "AOo--Jsu5fDd-Ar6tOGX-g": {
    "date": "8/14/2019",
    "text": "Never disappointed with this place.  The food is always great.  The service has always been wonderful, however since they are so busy it seems to take a long time to have tables cleared.  It's worth the wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGAzg3eD07AKbQLX_psfbQ"
  },
  "xoEzsxsBXSmtgO4dl3viWA": {
    "date": "12/16/2018",
    "text": "A bit of a wait time -about 30 minutes, but well worth it! Had the seasonal special, Hacienda Hash- which was tasty and beautiful! The Chikichanga has an amazing green sauce!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_by_jDwfpgwxos0ZuN1jqQ"
  },
  "VxBjwnjieYdXEdqiR9GwjQ": {
    "date": "1/12/2019",
    "text": "I used to LOVE First Watch, and I have to admit their food is still delicious. Also, the new layout is beautiful! The environment has changed completely. It seems like everything is a big rush. As soon as we sat down our waitress asked us if we were ready to order. When I said \"no\" she ran away and then came back asking if we wanted coffee. My fiance said yes and I asked her for tea as she walked away. She brought the coffee and tea back, but we did not get any water. When she came back I asked her for water and an English Breakfast tea back and she asked again if we were ready to order. I told her \"no\" once again. I was trying to ask her for honey for my tea, but she ran over and asked if we were ready to order AGAIN. By this point I was getting very frustrated. We were finally ready to order, and did so accordingly. Our waitress, Jenn, brought our food out and checked on us once other than when she set the check on the table. When we got up to leave, she started cleaning off our table before we even put our coats on!!! I have never felt more rushed in my life. I realized when we went to pay that she put \"fruit bowl\" on my bill instead of my potatoes. The people at the register fixed it, which was a $2 difference. As usual, it is a very long wait on the weekends. Way too expensive for the quality of service!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "un6IhBjdtm_xHgAqfJO7DQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/un6IhBjdtm_xHgAqfJO7DQ/o.jpg"
      }
    ],
    "user_id": "d-NXfH6E5dGcrN4eMg_1eA"
  },
  "ZlQYCU9Oen_cHnvGn8LutA": {
    "date": "6/13/2019",
    "text": "I really do like First Watch! I like the atmosphere and the choices of foods! I see that they are opening more & more locations! I was just in Atlanta & my nieces frequent First Watch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mk_dCcI-tbz11sGQXPuT0Q"
  },
  "4oGmOsBVzia3OuoC5cecdA": {
    "date": "4/29/2019",
    "text": "i love this place but be expected to wait on the weekend at breakfast/brunch time! Their Acai bowl is so good along with the almond butter toast!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "O5pZLvu_JropuOmSLSfK2g"
  },
  "8DwWD1BmZZHB8bvXaczVGg": {
    "date": "7/28/2019",
    "text": "I love coming here. I appreciate finding a place that offers healthy breakfast options. Not to mention the variety they offer on their regular menu as well as their specials. I highly recommend this place, especially if you're looking for an alternative to the pancakes and greasy diner food (no disrespect).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iGlcBSJlaDJ7wxysHir6Rg"
  },
  "xrcOcA72LBVli-_kyRP5GQ": {
    "date": "4/28/2018",
    "text": "Great food, great service, great fun! They told us it would be a 25-30 min wait and we seated in less time. Had the salmon frittata, power wrap, and acai squeeze. All very delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "R7TCPXrC9RhWm5J5H38Amw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/R7TCPXrC9RhWm5J5H38Amw/o.jpg"
      }
    ],
    "user_id": "1O7wcFf0uC6Rg1DjsYXdWQ"
  },
  "jZ2w5V_DP5Ywk227kfEPjA": {
    "date": "4/3/2019",
    "text": "This is my go-to breakfast spot! And while I always tell myself I'm going to try a new dish, I haven't been able to turn my back on the avocado toast -- it's my favorite! And it's a pretty fast turnover so don't stress if you show up and find yourself in a long line.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "18Om5oXo1R51VtgQBeUwFg"
  },
  "B3VIxdZNFClCuYMVgTPlvA": {
    "date": "9/6/2018",
    "text": "The food was delicious and our server was very attentive. The prices are a little bit higher than your typical breakfast but it was a good experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YWG9nZEbsDW67SAGoCvv8w",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Breakfast of champions",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YWG9nZEbsDW67SAGoCvv8w/o.jpg"
      }
    ],
    "user_id": "SL5-ILAdS4P9gO1NfMTy7g"
  },
  "FbNfzi7_P33wCFUfgf2NSQ": {
    "date": "4/13/2019",
    "text": "Not much to say other than that this place is the <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a> for what it is. It succeeds at everything it's trying to do and I love that. Haven't had a disappointing dish yet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cFCp6wvMok2BQlOkJwx3Ag"
  },
  "6JYs072zrx0VHeh68EMoTQ": {
    "date": "3/24/2019",
    "text": "The avocado toast is amazing! Every time I'm here the staff are always very kind and my meal is always delicious. This is a great breakfast/brunch/lunch spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V1CyhjIBDI_ZZdW7wu02Ig"
  },
  "8KHI935nGnv-Uaf4HJm4Uw": {
    "date": "10/16/2018",
    "text": "I had brunch here with my mother and great grandmother today. I was a little nervous to try the kale tonic, but it was by far the best juice I've ever had. It was so fresh and I could taste every fruit- the lemon, cucumber, and Fuji apple. I also ordered eggs Benedict, and it was absolutely delicious. My great grandmother said she really enjoyed her market veggie sandwich with the soup of the day- cheddar broccoli. And my mother loved the seasonal wild mushroom frittata. I can't wait to go back. I love the seasonal options, and I love the coffee and water jugs left on your table for you. The atmosphere was also very bright and comforting. Our waitress was very sweet and knowledgeable. It really is a great place for breakfast, lunch, or brunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uZ4GWy-41UeVokXu8LNhmQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uZ4GWy-41UeVokXu8LNhmQ/o.jpg"
      },
      {
        "img_id": "YLgUH22CTWpB25yy_eIeEw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YLgUH22CTWpB25yy_eIeEw/o.jpg"
      },
      {
        "img_id": "eyljp6RbmykFRWAJjSn1GQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eyljp6RbmykFRWAJjSn1GQ/o.jpg"
      }
    ],
    "user_id": "z9Fa7_RsEdc-OjtKE8F8Hw"
  },
  "ZV7cxECrk5fBrp8t8rbYsA": {
    "date": "12/18/2017",
    "text": "I too was skeptical bc, you know, chain, strip mall. But man! I'm so glad I came here!  Ambiance is cheerful and very clean. Service was efficient and just the right amount of friendly.  I ordered fresh oj, the elevated egg sandwich ( perfect) and an order of millionaire bacon to go (which I promptly ate most of bc it was SO good!  I don't live here but I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Rj_NxlynLkhDbUty30Aq0g",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Rj_NxlynLkhDbUty30Aq0g/o.jpg"
      }
    ],
    "user_id": "vku9CGqMIfihIaVRr6E_og"
  },
  "NMYTfH2xWgbuMXRNHa4u0g": {
    "date": "1/5/2019",
    "text": "Ummm the food had me flabbergasted, it was phenomal. I enjoyed the coffee the most, because it was hot and delicious. The only exception I had was the continuous crying of a baby next to us. Someone tell that that baby that I'm trying to enjoy my meal. And while I do cry when I don't get my food, I think he was being a bit dramatic. Overall, food was good, service was good and that jam was fantastic. Thank you",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pfyKOREW90BIsSc160skqQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Skillet hash deliciouso",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pfyKOREW90BIsSc160skqQ/o.jpg"
      }
    ],
    "user_id": "OTlKsm_MMxx34SNr8womWQ"
  },
  "7kO1ylfF52DyMDLJ01tpwg": {
    "date": "8/17/2018",
    "text": "We came here for brunch with my wife and mother in law. I ordered a Ham & Cheese Omelet with grits. (I ate grits everyday the entire 8 years I served in the military. Grits are hard to find up north.)  I sent my entire meal back. Horrible. The Omelet looked like chipped lunch meat ham and the grits were absolutely terrible. My wife made me instant grits in the microwave this week that tasted way better than the grits first watch wanted to serve me.  It is just breakfast I get it. However, If your specialty is Breakfast and you are charging a premium price for your food, then your food better be the best around. When I can say I had better food at a truck stop, that should tell you something.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HEQ9g4iwak6AIBFriZ8tFA"
  },
  "cDDmva2ai64t6khpSMVDsg": {
    "date": "9/2/2019",
    "text": "Traveling out of town and needing to kill some time before IKEA opened we turned to yelp for a breakfast recommendation and ended up at First Watch  I'm not usually a chain restaurant kind of gal but this was pleasantly surprising... crisp clean modern farmhouse vibe, great daily specials on offer made it feel more unique than a chain.  The service was outstanding - so attentive and friendly!  We tried the quinoa power bowl and the spicy chorizo omelet - both were excellent  The coffee was great too - and they leave you with a full thermal carafe at the table!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ufSnuojPOxgYmrfoOeKXzw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Omlete",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ufSnuojPOxgYmrfoOeKXzw/o.jpg"
      },
      {
        "img_id": "3L3vx6ViRBx-zO0-5_xs0A",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Quinoa power bowl",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3L3vx6ViRBx-zO0-5_xs0A/o.jpg"
      },
      {
        "img_id": "NQ3x0L8WWwadNqaH9-vLCQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Interior farmhouse chic",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NQ3x0L8WWwadNqaH9-vLCQ/o.jpg"
      }
    ],
    "user_id": "uso25qPkjj3cUFh2ld9bCQ"
  },
  "11Y1ux26xwfqG2vCwmpeuA": {
    "date": "9/14/2019",
    "text": "Gotta say, I loved going to this location for almost a year now. However, the MANAGER has been exceptionally rude to us twice. We usually get in line on the app. Twice, they were able to call our number early. We live 15 minutes away, so we showed up on time according to the original seating estimation. Twice, he's taken us off the list as a result of being 5 minutes past the new time. Wouldn't be a biggie, but he has huffed and raised his voice to scold us for showing up \"late\". Really disappointing to see a manager act like this. The staff is FANTASTIC otherwise! And the food is always great.   Seek out another location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ZBF0oH4zpxptMA--eSqyw"
  },
  "MnbYbsZmSSEZj2VwPRZ-LA": {
    "date": "7/28/2019",
    "text": "Pros: *Reasonable and tasty breakfast/lunch/brunch foods *Lots of \"healthy\" options but there's a caveat (see below) *Bright, cheery spaces with friendly staff *Coffee is pretty darn good and you get a whole pot for your table  Cons: *Pay close attention to calorie counts when considering \"healthy\" options - some of the counts are incredibly high despite seeming like a healthy option *Wait times can be long - on a recent visit on a Saturday for lunch, I reserved a spot in line via Yelp! with a 9-19 minute projected wait. When we got to the restaurant literally two minutes later - no one was in line. We've had other times when we've waited 45 minutes.  Good breakfast/brunch standby a la Eat 'n Park",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lGQy1Ssh4-aR9t4fkxv-Qw"
  },
  "mYGBi-iHp5hESL1tq_jxbg": {
    "date": "7/9/2019",
    "text": "I thought this place was good. One thing I wasn't super crazy about was the communal table we were seated at. My party of 5 had one other guy just awkwardly sitting with us. The menu is rather expansive and if you're in the mood for food that is on the healthier side, this is definitely a place for you. That being said, I didn't really go the healthy route. I had the Monterey Club which was okay, I probably would get something else next time. All of the breakfast I saw going by looked fantastic. Prices are reasonable and staff friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2bUBFr4wOoJimubs7e2-XQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Monterey Club",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2bUBFr4wOoJimubs7e2-XQ/o.jpg"
      }
    ],
    "user_id": "0KhRPd66BZGHCtsb9mGh_g"
  },
  "4K-qSOw4X-ktCqT3Od4Yqg": {
    "date": "8/17/2019",
    "text": "The food here was really good!  We had the French toast and the veggie scramble. They both had good flavor and the compite to go with the French toast was amazing. The ambience is welcoming and unique. Customer service was great too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xEH1HxLGzoa8hItyZ0vsIg"
  },
  "UEXHkgUbBudAAlnuAf_vEw": {
    "date": "9/1/2019",
    "text": "You didn't wait on us at 9:10 am today so we left. We were seated outside on the patio and we sat for 15 minutes outside. A waitress waited on the other tables on the patio but not come over to us. Luckily we were able to find a better breakfast place in the area that provided us with service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NDrix0CDaEhcfc-yp6FmSw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NDrix0CDaEhcfc-yp6FmSw/o.jpg"
      }
    ],
    "user_id": "Kty8DMlJryFzRUesr90WUA"
  },
  "SwqHWCJ-crRgLujeWe88Nw": {
    "date": "5/26/2019",
    "text": "A choice pick for breakfast and brunch. I've been to this local location most. Extensive menu with lots of options for many dietary preferences, healthy choices, less commonly available entrees. There are limited time specials and holiday menus (recently ordered from the Mother's Day menu). It's a popular spot so plan accordingly and take advantage of Yelps Join the Waitlist feature.  While you wait for your table they offer flavored water and coffee. They are set up to handle several groups of up to 7 adults in booths.  There is also a self-seating communal table.  In nice weather, there are a few tables with umbrellas outside.  The friendly staff is very efficient about service. I like the atmosphere with the farmhouse decor. And parking is not an issue as this location is located in the Settler's Ridge shopping plaza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MUR0uxgVOrp58s8SAX3hPw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Farmhouse Hash:  Two cage-free eggs, potatoes, bacon, avocado, house- roasted onions and tomatoes, Cheddar and Monterey Jack cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MUR0uxgVOrp58s8SAX3hPw/o.jpg"
      },
      {
        "img_id": "MYcUcwfifTahC6NfXPuVxg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Coffee and water while you wait after checking in on the Yelp Waitlist app",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MYcUcwfifTahC6NfXPuVxg/o.jpg"
      }
    ],
    "user_id": "kypiDVRIcY0Szjc-ZN6VJA"
  },
  "Reyp50Kv3lmA9C3Gtzk1fg": {
    "date": "1/7/2019",
    "text": "I rarely come to first watch because it's always jam packed, but over the past week I've visited twice, and both experiences were awesome. They were pretty busy but the wait was not super long, and we were seated relatively fast both times.   I ordered the farmhouse hash both times I went this week. It's always been one of my favorite things on the menu, and I was reminded that it still my favorite on the menu! I recommend getting it with over easy eggs on top so everything comes together nicely (I'm getting hungry just thinking about it). The meal comes with a piece of really thick, yummy multigrain bread, strawberry jam, and a teeny tiny cup of fruit.   I want to try out more on this menu because everything looks fresh and delicious. I just can't stop ordering the farmhouse hash! Anyways, the service is always nice and personable. The prices are a little up there for breakfast, but you're really getting what you pay for!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "opJqzi6PZgvfuv0D9dvtrQ",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Farmhouse hash",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/opJqzi6PZgvfuv0D9dvtrQ/o.jpg"
      }
    ],
    "user_id": "jhm1OR3WVUpk_hBTi4Fh3g"
  },
  "nsKRD-9NSBz_Xaly5Oza-w": {
    "date": "10/7/2018",
    "text": "Overall my meal was good, but wasn't anything special for how much money it cost. I got the classic eggs Benedict, the flavor was good and I enjoyed the bread it came on. I also tried the pumpkin pancake, it was delicious!! It had great flavor and was a good size and fluffy.   One thing that really bothered me was that when we sat down the waitress immediately said she'd get us coffee, which was nice but the way she talked about it and the fact that there was coffee sitting in the waiting area made it seem like the coffee was free. When our bill came we were both charged almost $3 for the coffee. Not a huge deal but we wouldn't have gotten it if we had known it wasn't free.   Our waitress was nice though. And when I didn't get the potatoes I had ordered she immediately went and got me some.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7uTekSrdWOOQtX0l0Hzj-Q",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7uTekSrdWOOQtX0l0Hzj-Q/o.jpg"
      }
    ],
    "user_id": "suGyAnfEjZo52DxaKbDD7Q"
  },
  "pSn0fn97dRDGwyLGEvPRlA": {
    "date": "3/31/2019",
    "text": "My favorite place to eat on a Sunday for brunch. Beware that the wait time on the weekend is usually 45 min to an hour, so I would highly recommend using the app to get your place in line before standing there for an hour.   My go to is their avocado toast with a side of bacon and a chocolate chip pancake to finish it off with a sweet treat. Anytime I come here I am not disappointed and always want to come back again. The service is great and everyone is friendly and helpful.   The waiting area is crammed and congested because it's where you pay your bill and also sit while waiting for your seat. This can get a little tight on a busy day ( on the weekdays there is hardly ever a wait)  The wait time on weekends and crammed waiting area is why I did not give them five stars- other than that I love First Watch!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wutZhuFa31lRajxk8Gl6qw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Chocolate chip pancake with extra chocolate chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wutZhuFa31lRajxk8Gl6qw/o.jpg"
      },
      {
        "img_id": "bLMtveQvR0liXMqRIx4JpA",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Inside seating area",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bLMtveQvR0liXMqRIx4JpA/o.jpg"
      },
      {
        "img_id": "gExrUcPiuZ3O7smSQSrLDg",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Avocado toast- eggs over easy",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gExrUcPiuZ3O7smSQSrLDg/o.jpg"
      }
    ],
    "user_id": "Jxa62HNYqSdqs_u2uEpOdQ"
  },
  "5jBTKLQ-ktyEzBF7A3BRsw": {
    "date": "2/23/2019",
    "text": "Love this place-- a ton of healthy options, along with a seasonal menu. The wait is typically long on weekends, so I definitely recommend using the waitlist. I always get some type of eggs benedict, most recently the BLT option with bacon, tomato, avocado and fresh arugula. Their seasoned potatoes are incredible, so I ordered those as my side instead of greens.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "is7L6RZEneAUFBr5gqOq5A",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. BLT eggs benedict-- perfect.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/is7L6RZEneAUFBr5gqOq5A/o.jpg"
      }
    ],
    "user_id": "8ASVoAduUtZW0YU0PklG8w"
  },
  "hhOC5oxLBS2RO2mkyIAB6w": {
    "date": "6/9/2019",
    "text": "Love this place! Always speedy and friendly service! Great options and fresh tasting food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4NopZyuV06yniq-iHlA_NA"
  },
  "RFnpWsGoExSRxYe7_FOSaw": {
    "date": "7/27/2019",
    "text": "I love this place! You have a menu that takes risks, good organic food, the orders are completed accurately, the staff just nails it! Great, great place! The only negative thing is that it's so good that translates into First Watch being very packed (plus they could be a little faster at turning over tables but not the worst thing in the world)!  So be ready for a wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ygbfGMCh-RQRc1cymbMFeA"
  },
  "BTteAauds7xeHulflkqvGw": {
    "date": "8/18/2019",
    "text": "We always ate excellent meals at this restaurant, however today it was less than pleasant. The noise level was so high due to the low ceiling and remodel. The tables are packed so close together that I could barely hear when spoken to. Even the staff weren't as friendly! My return date is up in the air.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UdbOTKDLLvQjFG1A4mlnfg"
  },
  "xXDDpJQt_5Id15oz25EFKg": {
    "date": "8/11/2019",
    "text": "Takeout must not be their thing as my cornbread carnitas bowl was missing half the ingredients and what was included was cold.  Missing avocado, cornbread, pico de Gallo, cheese, and cilantro. Looked like I received someone's leftovers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kBamY0T8FajpbGxO0AeeZw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States. Togo cornbread carnitas bowl",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kBamY0T8FajpbGxO0AeeZw/o.jpg"
      }
    ],
    "user_id": "khi-lN9XmOf-OsFzzr2FtQ"
  },
  "I5ouk43RcwTRU1w3FU7NNA": {
    "date": "8/7/2019",
    "text": "I love First Watch - all locations! I recently went back home to Pittsburgh, PA for a wedding and First Watch is even there! The only thing the Pgh location didn't have was oat milk (they had never heard of it).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oIWWJfIpx3jUBELPHT6EwA"
  },
  "AiL6UDEG0OOEY-5vom6Qxg": {
    "date": "11/13/2018",
    "text": "I had been hearing about how good First Watch was for a bit of time.  I just hadn't had the opportunity to get there.    But that all changed this past Monday. Someone else had said this was a step up from Eat N Park - I 100% agree.  This was a great step up.    My friend got 2 different types of pancakes and I got one of the egg Benedict options.  (I really need to learn to make poached eggs - as I'd likely never eat out again.)  We also got the million dollar bacon to share.    The eggs benedict were amazing!  I \"deconstruct\" my eggs benedict wherever i get them.  I had the choice of a side salad or potatoes.  I decided to get the salad - which was part of the reason this is not a 5 star review.  There was no dressing on the salad.  I mean none.  I mixed and tried to make sure it hadn't gone to the bottom - but it was no where to be found.  The other reason for the lack of five stars - our waitress forgot to bring my friend syrup for her pancakes!   We both kept trying to wave her down, and finally got syrup, but it took quite some time.  Overall, I will definitely go back.  I'll likely not get the million dollar bacon again, cause it was SO spicy (i'm a wimp)  but it was still great.  I look forward to going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WPI0YGOSA13eZ5eThfMFkQ"
  },
  "Ibd4z1eqzGTLQ3q_rJLUdg": {
    "date": "10/26/2018",
    "text": "The worst thing about First Watch is that there's often a wait and sometimes a really long one. In that specific area there also aren't many other places to go. I'm pretty close to five stars, but for a chain that claims to have local ingredients, they don't really say where exactly the ingredients are from. From what I've seen, all of the menus are the same and so are the specials. So how local are these ingredients?  That said, this is how a lot of local breakfast places should be. They don't go overboard and give you too much to eat, which is a thing at too many breakfast joints. Their prices are a bit high because of the 'local' ingredients, but that's okay when everything is delicious. I had the pumpkin pancake breakfast on my recent visit and while it was small, it was the perfect amount and the pancake was also great for a place that was extremely busy. And unlike other reviews, I got my coffee free while waiting for 30 minutes up front. So it's still unclear if it's free or not I guess.  First Watch is healthier and pricier, but sometimes that's worth it and with a huge menu with lots of options, I'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "20lQTJAyJOlWVkp5d42sLA"
  },
  "-a_Y8wkx4lb8x7VVDU6Uxg": {
    "date": "4/20/2019",
    "text": "First watch is our go to breakfast spot. They always have seasonal specials in addition to their great options. My husband is known to get the tri-athlete which is a healthy omelet, great for the keto and health conscious person.   I love the avocado blt eggs Benedict or trifecta with the chicken sausage and Belgian waffle for a delicious start to the day. One of the rare places with great iced coffee too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "D6VrCVIsV4lWD9R8ht1wuQ"
  },
  "9W0m3I6i9JeMO7beZ0AUAQ": {
    "date": "11/29/2018",
    "text": "Absolutely one of my favorite breakfast or lunch restaurants anywhere. The food selection is great with healthy options and anything you order is always fresh and tasty. The staff is very welcoming and friendly, lets you feel you're right at home or at a good friend's dining room ;) They just renovated and it looks even more home friendly. For the budget minded you may want to choose your fast food greasy drive thru but if you desire quality food at a fair value then this is it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z0a_y_vExtjTblNHtJsemw",
        "caption": "Photo of First Watch - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/z0a_y_vExtjTblNHtJsemw/o.jpg"
      }
    ],
    "user_id": "r5iu6xjD9UEwSlAIiTmaNQ"
  },
  "b0Kuo2iiM2UCFvSkxO48Bg": {
    "date": "3/5/2012",
    "text": "Nice calm atmosphere and very nice staff.  The fresh fruit crepes are some of the best I've tasted and the cup of Joe will get you hopin!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8OaMeCtMRrIaKegHbgZZQ"
  },
  "dY5nWYq2XQyO5QCHxrZANw": {
    "date": "5/5/2010",
    "text": "In search of a non-Panera lunch, we gave this place a try on a whim. From the looks of the plates all around me, First Watch does more business as a breakfast place, which might partially explain why our lunch orders were so-so. Or, in my case, came out wrong--a sandwich that was supposed to be turkey came out ham. (Our service, though, was otherwise good.)  The real reason we won't be returning: boredom. The interior of the restaurant is sterile and plain, and for $10 a person before tip, the lunch food is only a smidge up from food made more easily at home. And with the Market District cafe right across the street...you get the idea.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nzrZXZhGIk8Ze6pjfQVOWA"
  },
  "_j3J3-5lSnULqNOhI2Xd7g": {
    "date": "2/27/2012",
    "text": "Decent spot with reasonable prices for a quick breakfast, brunch or lunch. I tried the Power Wrap for lunch.  It was fresh and filling. Egg whites, turkey, spinach, mushrooms and Swiss cheese in a tortilla wrap.  Loved the fresh fruit on the side and fresh brewed coffee refills.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y7DLKy_D6CPqhzGswGXAZA"
  },
  "tBdvjFvItKv5wkse2vGQrw": {
    "date": "10/8/2012",
    "text": "So I should start by saying I love breakfast. It's my favorite meal and many times I just repeat breakfast foods for lunch and dinner so I have high standards.  The logo and the atmosphere definitely make it feel like you are in a health food shop, not that there are shelves of product I think it is just the khakis and healthy disposition; really cool that they can make a breakfast place feel like something else - hope I'm not just weird and no one else gets that feeling. We were pretty happy with the way they leave the coffee pot and water pitcher on the table.  We drink coffee pretty fast and usually spend more time waiting for a refill than drinking, not the case here.  I ordered the Tri-fecta with French toast and eggs over-easy and the boyfriend got the Tri-Athlete Omelete.  I was pretty excited when it came out and I got blueberry spread stuff on the side (I'm a dipper !!) with my French toast. Overall good food, nice enough environment - I'd go back.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "unnIZzjpZyuKYeje5gjPEw"
  },
  "s5OVEuipXYwhXezrIEuQFQ": {
    "date": "2/12/2012",
    "text": "Coffee is very good and they have a great healthy food selection.  service is good and prices are too!  would recomend this as a great breakfast place to try and return to!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2AhFmqwzlaW7QB0PbnJEcQ"
  },
  "sj4DdaXRSZrntE8qSswsmA": {
    "date": "3/29/2013",
    "text": "Very fresh tasting breakfast. Our server was phenomenal,the staff even took the time to explain the transit to us country bumpkins:) the only down side was that it is a little pricey as far as breakfast goes was around $40 for 3 of us.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_pyot6ep8hAO342Imc-YgQ"
  },
  "j6-hi2Mvl2RVWqrcmboCnA": {
    "date": "8/12/2012",
    "text": "Kind and familiar faces all around. Wonderful, wonderful food (thanks for the nutritional information). It's affordable and I love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yjpUfB4_nlpqoA1l7ww6xQ"
  },
  "dheR61TNovJKB37Y_w9tSQ": {
    "date": "1/19/2013",
    "text": "I enjoy going here for a healthy robust breakfast from time to time. I order one walnut oatmeal pancake with blueberries and an egg...you have to ask for the pure maple syrup though.  I really like that you can have decent coffee while you wait in line. The service is decent, just like the coffee. My 6 year old boy likes it too. Its kind of like a healthier, cleaned-up version of a west-coast IHOP :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QiAGUgpIH3hdwcqYB9Tufw"
  },
  "SYOMtGUQMsCPBYPtHI0BLw": {
    "date": "1/31/2013",
    "text": "Honestly, just go to eat n park. Nothing super healthy about this place and not worth the price. Multigrain pancakes? Is that what makes this place so special? Or that it has low fat organic yogurt? I found my eggs to be cold and waitress a bit rude.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VAbXWp5lSm8NPvm_SHOKzQ"
  },
  "T2cHc7e9CGqxZlkK_gIJ-g": {
    "date": "8/23/2010",
    "text": "Good food, attentive and friendly staff ... Only complaint, first watch potatoes are nothing fresh or flavorful.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cGJyNKvCNG6XKColBt486Q"
  },
  "W5eyNaeqinz3CLqcdUx5jA": {
    "date": "3/1/2014",
    "text": "This place was something I was pretty excited about trying given their seemingly healthy menu. However, three tables were served before us, our waitress was never anywhere to be found, and we stuck at a table next to a woman who was smacking her lips while on her phone the entire time.   Food was good though.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3MrVVplWgUdBWRANhNJ6Rg"
  },
  "LHj6sDumeHbmbBlsWItINw": {
    "date": "12/10/2016",
    "text": "One of our favorite choices for breakfast. Lots of healthy alternatives. Service is always spot on. Prices are reasonable.  My wife loves their power wrap while I tend to order something heartier.  The Trifecta is among my favorites. They do a great job adjusting orders for special needs. Everything is fresh. They take the No Wait App to save time in line.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3GLZbeJIOIhoZvjeziRv6A"
  },
  "7q70T4GGRVoisKVfUnWDxw": {
    "date": "2/24/2016",
    "text": "My hubby and I went there today for brunch.  He had the traditional sourdough french  toast and sausage and I had the multi grain pecan pancakes and turkey sausage.  The panckakes were delicious as was the sausage.  The menu and the server remind you the pancakes are huge. I did not mind, because I almost always take home half my meal at restaurants home to keep my portions reasonable.  Hubby enjoyed his meal too. They keep a jug of cold water and a pitcher of coffee on the table which is very convenient. Our server was great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bsK6HvHc0SvtLZgvPZCLgg"
  },
  "EpbVjm9XIIv8SiQEp_9cGA": {
    "date": "11/14/2016",
    "text": "This place is WOAH mismanaged! The last time I was here for lunch we waited like 15 minutes to try to get the waitress's attention for a check. Today I left my work quickly to pick food up, and it's terrible. Like shouldn't be served terrible. My avocado chopped salad had about 2oz of bad (like past it prime lettuce) and came without avocado or chicken!!! And the soup which they told me was chicken with wild rice is some sort of cream soup with no rice or chicken (from what I can tell maybe cream of mushroom?). Both were the skimpiest, most pathetic portions I've ever seen. And I'm a clinical nutritionist, so I know what proper portion sizes are. When I got back to my job and called to complain the manager did offer me free coupons, but I'm now stuck here at work starving. In theory this place is a great idea, but it's def not worth it. Also, I would like to post photos, but it's not letting me...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9z8jGHimbdno4SJGG_3esA"
  },
  "n0mRlg0JFf-XazI4SK-y_Q": {
    "date": "2/6/2015",
    "text": "Love this place!  If you want a nice healthy meal in the morning, I definitely recommend hitting this place up.  They have a friendly staff and a lot to choose from on the menu.  Only negative is be prepared to wait 20-30 minutes on the weekend for a table.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "z84jfOCoYFNN0N-pdLZohg"
  },
  "UChE_egoqo0PotTO39v7wg": {
    "date": "5/14/2012",
    "text": "I like First Watch. If you have the choice though... the Cranberry location is much better. It's a little smaller and we have found the food and staff are just a little more \"on the ball\". The food is good, but I have never walked out saying \"that or this was amazing!\" I have however had the same things at the Cranberry location and loved them! I think it all depends on who is cooking?  I recommend anyone of their specialty items though, you know, the ones with the little icon next to them on the menu! You can't go wrong.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "S4hj8UEPHlogMwlxKKPNFA"
  },
  "R4NBpXLxUxAEMZKm1_3CMA": {
    "date": "1/25/2016",
    "text": "Just returned from my first visit and will definitely return. We were greeted warmly at the door and shown to our table with menus immediately. I started with a Day Glow (a juice blend of carrot, orange, lemon and organic ginger). Delicious! Since I'm not an egg eater, I opted for a grilled ham, Gruyere and Dijon sandwich served with a mixed greens salad. Perfect! My husband couldn't decide which egg option he wanted, but settled on a turkey omelet, which he enjoyed. The omelets and frittatas sounded wonderful, and the breads are delicious. A great option from a traditional breakfast /brunch restaurant.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PBXYGUfeMRcFNGqjrNEGSg"
  },
  "rj9gjgAg3tEcSRqn0bUigQ": {
    "date": "12/29/2009",
    "text": "This place just opened recently after the first one opened in Cranberry Township. Now if you're a healthy eater, this place is for you. They have a lot to choose from, not just breakfast food.   FOOD: I chose the Tri-fecta, which is a Belgian waffle with 2 eggs and either bacon, turkey sausage, or sausage link. Of course I chose the bacon. What a great combination of sweet and salty! The waffle was lightly dusted with powder sugar and light to the taste, not heavy or thick tasting. The bacon was crispy and not fatty tasting. This meal was light but very filling. What a way to start the day!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "sv5K9wQ04MqxtvytKXORFw"
  },
  "5w9Q-DPRyc-aM7LzqFgfZw": {
    "date": "2/9/2012",
    "text": "We have been to  First  Watch in cranberry but this was our first trip to the Robinson location. Took the family for sunday brunch. As always there was a wait but our 15 minutes went by rather quickly. A mixed crowd dining at this restaurant, all ages well represented. The food arrives quickly after ordering. My husband likes that both a thermal carafe of coffee is left n the table as is a small jug of water.  The food is always fresh. Only downfall is that it is all a little bland.  My husband had the Acapulco express omelette, quite good. Probably the tastiest thing we ordered.  I had the avocado, bacon and tomato skillet. It was dry. I expected a gooey cheesy mixture. There was barely any avocado. My oldest eggs benedict. Okay but not very flavorful. Or youngest had wo chocolate chip pancakes with a side of bacon.. She loved it.    $50 for a family of four. Pricey.  Food is good but not spectacular. Good service, quick friendly and efficient.  Better than \"eat and park\" but would go to \"Pamela's\" if given the choice.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QXXqp9SplGzmtRYFyYZx7w"
  },
  "oAygwBJhAVEAGv1KlyP1DQ": {
    "date": "1/1/2016",
    "text": "Food and service great. Prices a little higher than a typical chain but food quality made up for that easily.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qZ_ue43Q0M-VthVXKp2anA"
  },
  "phaSq_1itV6jCU5DxCfo4Q": {
    "date": "10/4/2015",
    "text": "Took a friend to breakfast after church. It was busy, a good sign. Had the Acapulco (?) omelet. Very good! The pace of service is good and the hosts and wait staff were friendly. Will be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lx4qae4sfIovjT-MT57Axg"
  },
  "Vfg-puqLmxiT9-eiwe72iQ": {
    "date": "4/16/2013",
    "text": "The thing that impressed me the most was how un-greasy the breakfast was. Especially the potatoes. It was very refreshing to eat breakfast out and for once to not leave feeling disgusted for starting my day off that way. Despite the general lack of grease, the food still tasted very good and the atmosphere was pleasant and relaxed. They can get kind of crowded on Sunday morning, but it's still not as hectic as other restaurants in the area. Especially the undeserving-ly over-crowded and noisy Cadillac Ranch down the road (I hate you, Cadilla Ranch).",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "vuH41CWzOYlwKmMmZnjV7g"
  },
  "ttCsG9nkAd7LjK7VwSV65Q": {
    "date": "7/20/2015",
    "text": "Many delicious and healthy breakfasts. Just wish they were open with more reasonable hours. Hard for working people to get time to go there. Staff is always great.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1rOZvpsEGQA3hSBkVTpanw"
  },
  "AG2bwkLJaJLCqc6nfeFPmQ": {
    "date": "2/3/2011",
    "text": "The place was empty.  Stopped for late breakfast after early appointment.  Ordered the Acapulco omelette to go.  It was nice. Omelette had some chorizo sausage, avocado, onions in it.  Came with FW potatoes which are like home fries (which were OK) and some fresh fruit. Menu has some nice omelettes that a little different or you can create your own.  Menu has some heathy items on it.  Lunch menu looks nice.  While you can get some different omelettes, have had the similar food at better price at eat n park and it comes with fresh fruit also.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 17,
      "cool": 14
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "E1fGYIODUW89Hhe8oQLLjg": {
    "date": "3/2/2015",
    "text": "While staying at my Brother in-laws, I was looking for a healthy place to get take out on a Saturday early afternoon. My yelp app hit the nail on the head again when it directed me to First Watch. When I arrived, the restaurant was full with a few people waiting for tables, usually a good sign. The inside was plain, nothing particularly fancy or interesting but, everything was bright and clean. Just what I would hope to see at this type of establishment. I then looked over the menu. What an awesome selection of healthy breakfast and lunch options! It is rare that I find kale and quinoa on a restaurant menu in Pittsburgh, especially for breakfast and lunch. I opted to go with the fruit crepes which came topped with low fat strawberry yogurt, a side of granola and their muffin of the day. (Quite a lot of food!) I believe the muffin was lemon poppy seed but can't say for sure as hubs devoured it before I got a nibble in. The crepes were light and delicate. They were filled with strawberries and bananas but also topped with a few pieces of mellon, pineapple and grapes. I sprinkled the side of granola on top the strawberry yogurt and dug in. Yum, yum, yum. The crunch from the granola was the perfect added touch. Overall, a great value for a delicious meal. I hope to get the opportunity to return very soon.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ftUrNSpxUr8eWCyOlsZVgg"
  },
  "-jlU90ntwCLOLWJh7kp6Fw": {
    "date": "7/19/2015",
    "text": "I go here every Saturday to eat breakfast,  i love the same things i get ever week , this place makes me leave with a smile on my face and my stomach feeling   oh so good , there french toast and waffles make me come back over and over again , the people who work there are really friendly and i just love this place ...food is really great. .",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-41R30bbk4_rMDCZZSxRfw"
  },
  "bVAOrReZTO90FrrxiKW8GA": {
    "date": "5/6/2013",
    "text": "The service here is really great. I usually come to First Watch when family is in town visiting. My latest visit was right before y aunt and uncle had to catch a flight home. We let the waitress know that we were short on time and she got our order in and our food out quickly, even though the restaurant was packed. We were overall very happy with the service.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QHVqW4RhsG6LNLn7v12nJQ"
  },
  "dr_QkqVs_-suTjCMOAnRcA": {
    "date": "6/11/2011",
    "text": "Ther place was packed, though I can't understand why. I ordered the turkey and avocado eggs benedict. The eggs were way undercooked, the turkey was extremely salty and there were only two tiny pieces of avocado. Hubby ordered The Works omelet. He said it tasted like one if those frozen omelets that you heat in the microwave. The potatoes that came with both dishes were also salty and undercooked. The kicker? When they asked how the food was and we told them, the only response was \"oh...sign your receipt here.\" With so many good breakfast places in the city, I will never come back to this one.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "77ieFf56YZyfVWhGzcP2Tg"
  },
  "UF4B9oYt2xZ8SpM4Ah9jsw": {
    "date": "3/12/2015",
    "text": "Going up to 5 stars, just gets better every time we go.  Quick service, delicious food, the right amount for the price.  You won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hdz4kId9ydLGLONkWc826Q"
  },
  "S55UrSH-whMxlMP4mKeQ4g": {
    "date": "4/24/2012",
    "text": "No matter what part of the country, First Watch is a consistently great place to grab brunch.  Apparently Pittsburghers haven't caught on yet, because Sunday morning did not have a huge wait like most locations.  If you are looking for a greasy spoon, then go elsewhere.  This place has a clean, healthier, fresher outlook on brunch.  Sorry, no alcohol.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "H4EQn0rjFuGRgIm6c9NFLg"
  }
}