{
  "JFjlsmfTxQwUQu50aeJzvg": {
    "date": "5/26/2014",
    "text": "Delicious sandwiches, though not as good as the hype claims. I got the kielbasa sandwich, which was good, though the fries were soggy.  The service was superb, and though the place was mostly empty when we arrived, it was totally packed when we left.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4KNOhaUhegpmZ6sWwJtRTw"
  },
  "ytXCehDGW3dtgKSnATwgnA": {
    "date": "11/27/2011",
    "text": "Am I authoring YET ANOTHER  \"Pirmanti bros a Pittsburgh tradition blah blah blah yadda yadda yadda\"  type review ? Guess you'll have read on to find out, right ?  This was my first time visiting the harmarville location..  It was super busy; which probably has to do with the fact that primantis is relatively  close to the PA turnpike. We chose to visit on a Saturday night of a holiday weekend (xgiving)  And it just so happened that a   pens game was in progress.  Hockey games and bar traffic absolutely can't be taken for granted in western PA .     Our food arrived in a timely Manner. Despite the fact the fact the place was packed. 10 minute wait for seating.  I don't what make of our waitress telling us that certain menu items might take up to an hour to come out.. After mulling it over i guess I'll  err on the side of good customer service :) ( foolish is man who has mortons expectations on mcdonalds budget)   Anyway I ordered sweet sausage sandwich sans   the cheese of course. Kudos to my waitress for getting my \"no cheese\" request right the first time in an extremely loud and seemingly chaotic bar environment. Everything  Tasted great. My sandwich came with a ton of that  vinigear based slaw , and fries!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "JIGkB39I-ZvOrV9S3ZYUGA"
  },
  "hC4W2VLDiMuX0KvmD7MGjg": {
    "date": "11/13/2011",
    "text": "The Colossal Fish was decent sandwich.  not sure if i like a mound of fries in it though.  fish and bread were decent enough.  the Pitts Burgers Cheese Steak was really good.  cool place to watch a game or kick back with some friends.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sk9Hgl9sXG5rhOvFFmvQ9w"
  },
  "Z0APO4vODN17Yg5cU0RVgQ": {
    "date": "6/5/2014",
    "text": "Maybe I was expecting too much.  I was in the area for business and decided to give it a try.  I got the traditional sandwich but with turkey. Completely unimpressed.  Nearly tasteless sandwich of tasteless meat piled with tasteless fries and tastless slaw. So now I went there.  Won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sDast2S1SnCuUs7rm_ozug"
  },
  "AIGuGCsxR-n69ZIgA5d5rg": {
    "date": "1/7/2013",
    "text": "Ok so when I hear Pittsburgh, one thing comes to mind and it is NOT the Stillers(Steelers). I went to school about an hour north of Pittsburgh, so I listened to enough out of Steelers fans to last me a lifetime throughout my 5 years of college.   Primanti Bros might just be one of my favorite things about Pittsburgh. I've eaten at several of the locations, including the one on Forbes Avenue, however I have been to this location more than any other locations since it is on the way to a college buddy's house when I make it out to visit him. The place has always been clean, although the service at times has been slow. Even with the slow service on occasion, the service has been friendly enough and I am usually catching up with friends I haven't seen in awhile, so no big deal to me.  Primanti Bros sandwiches are something that you will probably wonder how in the heck it can taste good, when you first hear about them. The sandwiches are on some thick cut Italian bread with the meat, cheese, french fries, and cole slaw piled on. The first time I heard of this concoction, I was a little leary that it would taste good. One bite later, I am hooked for life! I know a lot of the Primanti Bros locations serve things other than the sandwiches, but trust me and get one of their \"almost famous\" sandwiches if you have never gotten one. The sandwich itself is typically enough for a meal without ordering any sides. This was actually the original selling point for Primanti Bros, as they were made to be a meal on the go for the many truck drivers in the Strip district.  Some of my favorites are the capicola and cheese, pastrami and cheese, and the cajun chicken sandwiches. If you feel the need to get a side, I would go with the chili. I have gotten this a few times and have not been disappointed.    Primanti Bros is one of those places I would say is a must visit if you have never been to Pittsburgh and are looking to grab a bit of local flavor!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "P3Q5q2D6390WqxgKE-GKLg"
  },
  "1tYjJ24y6rdxrfvYbtcX9g": {
    "date": "6/5/2013",
    "text": "Wish we had this sort of place in Asheville. Great sandwiches that I ate multiple times during my stay.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IvBMyL7qGEjIko24erJNUw"
  },
  "LBkMhONjwhfMhLEE9jq94w": {
    "date": "11/4/2015",
    "text": "Like many Pittsburgh expats, I eat at Primanti's everytime I come back to visit.  The Harmarville location is notably worse than the Strip District location.  My corned beef was bland, and the coleslaw dry and flavorless.  I hope the whole chain isn't going downhill.  Next time I'm going to the Strip for my Primanti's fix.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rUJRbZ8hC1pT0pcjUGbCAQ"
  },
  "iBqviXzWN6pG2LizZ0pr8g": {
    "date": "6/13/2015",
    "text": "Love Primanti Bros but this location is terrible. The service is absolutely awful. Waited 15 min after being seated without being served before I left. Not even drinks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eALENYp-__6ylUvOu-7JtQ"
  },
  "ioMU2Mb8tsw2OlFVLyD4Ig": {
    "date": "2/10/2013",
    "text": "This is a Pittsburgh area tradition apparently, so I decided to try it out while I was in the area for work.  I LOVE the concept of the fries and sweet and sour coleslaw piled on the sandwich, but the quality of the meat on the sandwich was horrible; a big mouthful of fat and gristle with each bite.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RyefjqZ3m0__6vgh1EfXTA"
  },
  "KLdNiw3qaZLK2Spk7TO5kQ": {
    "date": "11/28/2013",
    "text": "Stopped Friday evening for takeout.The place wasn't busy when I arrived. Placed order at bar. Waited over an hour and got no food. Had to ask bartender to have someone check on it, was told it would me one minute, 5 minutes later, still no food. Cancelled the takeout order, paid for drinks (you'd think they would have comped since I was waiting forever for food) and left. No apologies, no manager interaction, nothing but a woman in an apron who came running out of the kitchen as I was leaving telling me my food would be ready in another 5 minutes, I left and got a hoagie from Get-Go. I won't be back again - shame too, because their sandwiches are usually pretty good, the service was the problem here.  *Follow up* E-mailed Primanti's corporate regarding this experience. They requested additional information and followed up with the location. The Harmarville story took full responsibility and admitted there was confusion and they dropped the ball. Customer service sent a gift card based on my experience and advised training will be provided and the incident reviewed as a learning experience. I will give them another try and hope the next visit meets the expectation to which I am accustomed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6_T4lVXW6Uf_rOFI-NtkMQ"
  },
  "dEYkcf2eJUZ3gnFyvjx0JQ": {
    "date": "9/23/2015",
    "text": "No big deal. They seem to be living off the idea that nobody put French fries on a sandwich before. Not that great actually. Tried it twice....never go back. What does that tell you?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6gOGE-xNP7N9LKVLf70q2w"
  },
  "_2Fi5fHWJe8gXeWPxGxzOg": {
    "date": "3/22/2010",
    "text": "Got a dinner for Cappicola & Cheese ($6.29) it special sandwich with spicy ham, and fries + coleslaw in between the bread. Total include tap beer only less than $10 including tax. what a great DEAL!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pnGKcyKtfR7TWyXxScqvCQ"
  },
  "56wEqFa2uH1_6I4P_St_GA": {
    "date": "10/13/2012",
    "text": "Came to town on business, and everyone kept talking about this place. I looked it up on google and found out its pretty popular. Well my fellow yelpers, I'm a fan, great atmosphere, came in on football Saturday, order the colossal fish sandwich and it was excellent, if you're in the area it's worth checking out,",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rMLk0-AeKWJN1xnWiwLmmQ"
  },
  "-C-DodXKJ81xI3xEXw9eEg": {
    "date": "9/29/2013",
    "text": "Pittsburgh staple. Nothing beats a primantis sandwich or their pizza! Always great. Always quick.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bM55XIkbT7g43fcuE8ebJw"
  },
  "r7GNKW4wDFLH4W-daqxN2g": {
    "date": "12/27/2011",
    "text": "Food was good.  Location was clean.  Service was poor.  Given a choice, I would save my annual Primanti experience for the locations in downtown.  That being said, this is a great alternative to the Burger King Down the road...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9nmSm1zyL3YZ0NglxiS34A"
  },
  "cMItOmH_xyXNWt-FCh0rtw": {
    "date": "9/24/2012",
    "text": "Primanti brothers makes some of the best sandwiches in the world, if youre not too concerned with your health.  This particular location is the most resturant-like of all of them, totally worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hnzoXmnnCukQrHdgrSVDlQ"
  },
  "KT6X0g5AFTXbzQ_Ax3mpIw": {
    "date": "11/4/2011",
    "text": "A Pittsburgh tradition.  A must visit.  Capp n egg baby!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zQWvnR1FvW2C43JrMBgL5g"
  },
  "inZvxOJU7iv3eHHQPuq4Yw": {
    "date": "1/11/2012",
    "text": "Very similar and yet a bit different from the flagship Primanti Brothers in the strip.  The downside is that the signature sandwiches taste just a little different than at the original Primanti Bros. (or the others downtown or in Oakland).  I thought the bread was thinner and less fresh, and it's possible the fries and coleslaw had a slightly different flavor.  The upside is that the sandwiches are still pretty tasty, and there are a lot of positive differences.  The menu is much broader than at the original Primanti Bros., including all kinds of bar food, kid's choices, etc.  The ambiance doesn't have the gritty charm of the strip district, but it's roomier, easier to park, and still has a definitively Pittsburgh feel, with the Pens or Stillers always on the TVs, and plenty of sports memorobilia.  The final kicker, and it's a nice one, is the beer selection, including a Dogfish 60-minute IPA which you can get for a couple of bucks at happy hour.  Primanti Bros. Harmar is like life in the burbs: maybe less cool than dan-town, but pretty good living especially if you know what you're doing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yJbOEH8VlGWno5yTVkJ0uw"
  },
  "A9O3EggO2Hw2iSdnb1h9Vw": {
    "date": "9/8/2014",
    "text": "the service was friendly but SLOW .. went with my nephew's PeeWee hockey team for dinner b/4 a game at the nearby ice complex .. was assured by the waitress there was more than enough time (2 hours to kill) to fill individual orders from the menu w/so many people in our party despite asking if pizza for the group would be more efficient .. the sandwiches took nearly an hour to come out & most were cold after sitting while others were made .. the cook needs to know what SALT is .. my sandwich was tasteless until I added salt & even after that it was not much better .. most of the boys barely touched their meal which their parents had to pay full price for b/4 heading back to the rink .. if they cannot handle large parties they should not seat them .. never again .. too bad since we will be at that rink a lot .. will seek team meals elsewhere",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9PmUzfxz3vamMaTzGSesyg"
  },
  "Fl1kHbU2wYWFa9zjGFkKiw": {
    "date": "2/4/2012",
    "text": "Good Service, friendly staff, disgusting sandwich. I had a cheesesteak and it was collossal filled with dry shredded cabbage and flat squishy greasy french fries (?!). I heard they were \"Pittsburgh's Best!\" so I continued to eat giving this thing in front of me the benefit of doubt..well it sucked till I was finished. I ended up throwing most of it away. I guess if I was drunk and it was 3 am I would have enjoyed this disconnected greasy pile of dried cole slaw cabbage stuff and fat fries with the other crap but it was lunch. I wasnt expectinG THAT.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "563hfz-EY18-XHCxwT8nJA"
  },
  "WSAx4Ux7K3LCHlW22tcgBg": {
    "date": "12/7/2012",
    "text": "Arrived on busy Saturday needing a  table for 8. 20 min wait seemed about right.  Helpful staff. Great portions. Good place for hungry family.  Pizza, wings, chili, pastrami all solid in my book. Lots of TV's!!  Bonus.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FYo838vDhcMWb2_BKYjmNw",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Family Fun at Primantis.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FYo838vDhcMWb2_BKYjmNw/o.jpg"
      }
    ],
    "user_id": "SqWkVJ3mQKuVpTuhnv5Bfg"
  },
  "kWI2yLmUZ5-YSlNe1W7oIQ": {
    "date": "6/15/2016",
    "text": "I went with my boys, we were watching the NBA Finals Game, and the food was alright but the waiter served it soooo poorly!!! The waiter was rude and an incompetent!!! Don't get me wrong the food wasn't terrible, it was just very undercooked I had the Cajun chicken burger and a side of fries and the food was very raw and again undercooked! But back to the waiter, he practically threw the food, check, and drinks at us. And when I asked for a soda he got upset for some reason I don't know why! So if u go to this Primanti Bros. good luck!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7eOSc00lAs-yM4B8QMVjw"
  },
  "cBSnPu5sHhNY_fZyuVUH3g": {
    "date": "3/14/2015",
    "text": "I have eaten my whole life at primantis in the strip and in harmerville. If your from pittsburgh there is no reason for me to try and convince you that this is the best sandwich. If your not a yinzer your in for a shock.  Fries and coleslaw might scare you but welcome to the steel city.  If you get your egg on it then you deserve a firm hand shake accompanied by an ice cold yuingling. Not sure what to get?  Go with the pittsburger you will not be disappointed.  To prove how good these sandwiches are. . . I was downtown and on my way out I stopped in market square for a delicious pittsburgh. On my way home after eating the first one I pulled off in harmerville and slammed another one of those babies.  Best day of my life!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tJV2Ecr0QXy1fYGCQrslpQ"
  },
  "7qBp1eL0e1vHZ4fbaAE9Vg": {
    "date": "8/17/2017",
    "text": "If I could give a zero I would! Usually I love coming here but Tuesday night my husband and myself went and the bartender that was working was so rude. We waited forever for her to even acknowledge us and when she finally did she was just nasty. She had such a bad attitude that we didn't even stay we ended up giving the menus back and going elsewhere for dinner. Find a new job if you don't want to deal with people!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d1gNKrZnL4IB-kL6dLCrqw"
  },
  "HPgDn3v3aM3unEjJpH6vUw": {
    "date": "9/8/2014",
    "text": "I'm in town on business, so of course I had to try this place. I had the chicken gyro and a slice, which was still cheaper than what is pay for just a gyro back home in Cali. The food arrived fast, and it was pretty good.   The cucumber sauce is spot on, but the meat and veggies were a little thick cut and unseasoned compared to traditional gyros. The pizza was great however - I preferred the more tangy sauce compared to the sweeter stuff you get on the west coast. Atmosphere and service were great as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q0cEZ47n87Z4mifscoWhsw"
  },
  "lv-ADfxzQs4mLjrgJW6-sQ": {
    "date": "1/5/2014",
    "text": "Had to make a special stop on my road trip to DC here. Love their sandwiches, my top  2 are the corn beef and the Sirloin steak (my#1 favorite, the vinegar of the slaw goes perfect with the steak and fries). I wish i could of stayed long enough to have wings and beer. Big menu with something for everybody. Oh and if you can't handle the sight of the Steelers, don't even bother coming here, because it is all decked out in Steelers garb. Oh and they also have really good cheese fries here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Zu4BPDntg_52YmNwViyOA"
  },
  "ImDYJRUYF_nyuAamGieoqA": {
    "date": "5/20/2017",
    "text": "Primantis has there reputation and if you've been there before you know what you're going to get. A classic Pittsburgh sandwich. This particular location was pretty good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iilXZx4oKkUOTARshURjfA"
  },
  "eb2ZB0dHEwJAVqyj3H2msw": {
    "date": "12/24/2017",
    "text": "Primanti Bros - doesn't need an introduction....they were on Man vs. Food, Pitt and Penn State has easy access to it now. Once you eat there, you'll probably love it provided you are occasionally ok with a full meal pressed into a single sandwich.  If you are a first time visitor to Pittsburgh and you like food, then you must visit the Primanti Bros in the Strip District.  The Strip District location is a solid 5 stars.  The original Primanti Bros location is able to easily overbuild the sandwiches and whatever else you order to give the food that signature character that these type of special unique region restaurants are able to provide.  The character is almost impossible to replicate, even by the remote locations.  The satellite locations are 3 to 4 stars each. They are trained in how to build the sandwiches with the same ingredients, but they usually come off as not being overbuilt the way the Strip location can constantly produce.  The satellite locations though do pull off the same flavors, and they do assemble the sandwiches correctly, so they get a 3 to 4 stars.  I highly highly recommend Primanti' son the Strip, especially if you are visiting from out of town for work or for play!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OtAZ_kfzYPquP2oi_8OUOw"
  },
  "3WtFtOFyY57neU5ECsJfyg": {
    "date": "3/16/2011",
    "text": "My boyfriend grew up in Pittsburgh and always raves about Primanti Bros. So, of course, every time we visit it is one of our go-to places.   I had high expectations going there and I was not disappointed. The food is delicious! Each time we've gone I've gotten The \"Pitts-Burger Cheese Steak\". I really wanted one of the salads the first time I went, but I was quickly told that you \"can't go to Primantis and get a salad! You HAVE to get a sandwich\". Well, I'm glad I listened, because the sandwich ROCKED!   This location is the only one I've ever been to, but I love it! It's very spacious, clean, and the staff is great!   Mmmm now I want a sandwich with coleslaw and fries on it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ctdnfGftt3m-FxRC5OqEyw",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Sangria!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ctdnfGftt3m-FxRC5OqEyw/o.jpg"
      },
      {
        "img_id": "3wwl9ewHIedTmv0x0DWBBw",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Delicious sandwich!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3wwl9ewHIedTmv0x0DWBBw/o.jpg"
      }
    ],
    "user_id": "coNYmkLV-58yt-7RUugfkw"
  },
  "SiqZyzqQjXODeAI7Jc88MA": {
    "date": "11/11/2017",
    "text": "This review has nothing to do with the food or our server. It is all about the front of the house and the manager. Before I left the house with my family to go to the restaurant, I checked No Wait and the wait was 4-14 minutes for a party of 4. We live 10 minutes from the place so I decided to go \"in line\". I received the text confirmation at 7:21 that I was in line. We arrived at the restaurant 10 minutes later. I checked in at the hostess and she could not find us on No Wait. I should her the text confirmation and her response was \"Sorry, we sometimes lose connection to No Wait because of our WiFi connection and I will add you to the list.\" She also said that she will have the manager talk to us. Now, we are in line behind 6 other parties. I watched as those parties were seated and now it is 7:50 pm. The wait says that we are next in line and there are at least 10 open tables. I went to the hostess stand and she was busy helping out a take out order or something. Finally at 8 pm, I asked a server for the manager. The manager came out a couple of minutes later and I explained the situation since the hostess never went to the manager in the first place. The manager apologized and then sat us at one of the now 15 open tables. She did not offer to compensate us for having to wait an extra 30 minutes. Very disappointed in how this was handled. I guess that I needed to demand to see the manager right away instead of trusting that it will all work out.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DV5ENzDhkhHkvA4MGBRpnw"
  },
  "SEMMsdHA1k8S-aeQ_5W0Jw": {
    "date": "2/12/2016",
    "text": "Waited for half an hour before we waved down a waitress to get drinks, even then she had a rude attitude and walked AWAY while talking. Won't be coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6s0nHJZJk9gYcyRwlfcqUw"
  },
  "-xKDd1SVCuavAb4CXCJZMw": {
    "date": "10/31/2015",
    "text": "Absolutely love Primanti's, but this location is terrible. This location had below average service, boring atmosphere, and my sandwich being the worst Primanti's sandwich I've ever had. It came out cold, my steak was undercooked extremely to the point of it being like chewing gum. will definitely never go back to this location.. Sticking to the classics in the city of Pitt.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DMTN4HUpnhdLc3CHFmcUag"
  },
  "MsvaGE1DEtWqtIDzas_z5w": {
    "date": "6/2/2014",
    "text": "The food is unhealthy and mediocre. The ambiance is too loud to allow you relax and eat. Not wanting to lard up, I ordered a vegetable soup (meh), a side salad (meh), and a pickle (good). My friend ordered a Garden Patch Salad with Fries and they spoiled it by putting tasteless melted cheese on the fries. Bad music was playing at high volume (this was Sunday, 10pm). I guess this chain appeals to lovers of grease, cheese, and noise, but not me. The next time I need mere sustenance I'll make myself a peanut butter and jelly sandwich at home - it would be far more enjoyable than a return to Primanti Brothers.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "pHhnRlW6-q1uk4ZjLvu5Ew"
  },
  "Ef_oakWuBAsvigvj4HdqnA": {
    "date": "7/11/2016",
    "text": "I've been to this pb before and have had really good experiences but I have never written a review.   I usually done at the original in the strip weekly but occasionally I find myself at the Harmar location.   This review is about my most recent visit.   I planned on writing a review regardless if it was good or bad....tonight is somewhere in between.    Came in a little late off pa28 heading to airport.  Arrived about 930.   Got a table outside right away.   Food was friendly but really really.    R.   E.  A. L.  L. Y. Slow.  We waited for almost 25 min to get a check.   No check backs from the time we got food to really the time we left.  We had to have someone down each time.  It was Not busy.   No server.    Where'd she go?   Hmmm.   Men's room urinals walls and floors had so much urine built up on it that it looked like someone was cracking eggs in there.  I've made deliveries to farms that smelled better too.   Along the way I scoped out the server station. Really bad.  Maybe they were really slammed right before we got there but who knows...Hey, Anyone reading his seen my server?   Look.  Like I said.  This may be one of those times you just get the short straw and have a bad experience but I would come back and give them another shot.   This place is usually pretty decent.  But you can definitely tell there are issues with training and management tonight.  Lots of employees standing around and everything is a disaster.  Zero server attentiveness.   Atmosphere great.    I'd recommend it with an asterisk.    This experience was terrible.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qqgTHckDe8FPsnDKgIZaBQ"
  },
  "wxQwEbP7Jgt_jdZQhGF0dw": {
    "date": "4/25/2015",
    "text": "Great sandwiches, family friendly, sports TV, great prices. Start off with the batter fried spicy pickles.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_9OunrvkoTYp_uBBnpfbMg"
  },
  "AY_UD6dACmKThESfpp6elA": {
    "date": "7/20/2015",
    "text": "No matter what season, this Pittsburgh institution always satisfies.  If you are a fan of any other team than one based in Pittsburgh, don't be surprised by the fan fever.  Enough locations around the area to get a bite without the lines.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u7YnIqzWLdpxhvlGwpLIew"
  },
  "Q-q2EKaCmxaRSQPlS0SuVQ": {
    "date": "4/14/2015",
    "text": "Used to be Tuesday night regulars, then we got a couple raw pizzas and the service were downhill (if you get Crystal, good luck).  The last time was so bad I emailed the GM, but never got a response.   We went back tonight for the first time in months. It wasn't busy, which isn't a shock considering how our last couple experiences were. Stacy took care of us and was great. The service was much better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OHGLxqvYzaV1DapbSJZ_Kg"
  },
  "HShyzf767jW7bjh9VGlETw": {
    "date": "7/25/2015",
    "text": "This one is a little overrated, basically just a bar/restaurant place similar to Chili's or AppleBees, nothing special. Food is just ok.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0VkjmqY326SvUFofYmEYPA"
  },
  "Yg0QrdGVkpiG6oc-dizKBg": {
    "date": "3/11/2015",
    "text": "Service was almost none with me being alone. Slow & could never get a refill on ice tea. Sandwich was above average but I had to choke down the last of it dry without any refill on drink. Could never find the waitress??",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "70H1W5188ZxQyKjj4qgosQ"
  },
  "P_xItbk55G9XujzlftRXeg": {
    "date": "5/5/2016",
    "text": "A must in the area. Any sandwich is the way to go. Gyro especially good. Also Victory beer on tap.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VzS1CFvWqWRouBwzDqpZ9w"
  },
  "TXATBiGcyJc7kvs0qrgCNw": {
    "date": "3/11/2018",
    "text": "Was only okay... burger is the type of one you would expect when they don't ask for a temperature to cook-okay but not great. Sandwich needed some pizzazz...meat tasted great but got lost in all the layers of flavor suckers-fries, slaw, bun, etc. We loved the hometown feel but it was not the cleanest place-garbage cans overflowing, etc.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BXL1YC9ejNfo9vD2FCjWhA"
  },
  "zklCdZt6IXs63f06VNwG2Q": {
    "date": "12/27/2014",
    "text": "Usually 5 stars...sometimes the bartenders are overworked and completely ignore you when trying to place an order for a drink while you wait.    All that said - great food and waiter was awesome. We make it a point to stop at a Primanti Bros when in Pittsburgh area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GLsPuSJZgETEH3FgAAmIZQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. This is a salad believe it or not ...tasty!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GLsPuSJZgETEH3FgAAmIZQ/o.jpg"
      }
    ],
    "user_id": "PRRsfJYYqyJOKJOslp_S4Q"
  },
  "U5YBaRprP4i4CZUCruMZUA": {
    "date": "7/7/2014",
    "text": "Double egg and cheese (plus fries & coleslaw squished between two fresh pieces of italian bread) with a Diet Coke. YESSSSS.   Service was decent at this location. It seemed like they were understaffed, but our waitress was very sweet. Also, it was FREEZING. Like, tip of my nose was numb. I had to go outside after I was finished eating to thaw.   Moral of the story: bring a sweater and don't drink your Diet Coke too fast or you'll be waiting for a refill.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oZOTMQ9tpvTetPmmQp3Uvg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Double Egg &amp;amp; Cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oZOTMQ9tpvTetPmmQp3Uvg/o.jpg"
      }
    ],
    "user_id": "SeFpXAHjO5GgedJI-MFWNA"
  },
  "Z3Q7XNruTCm_e_hGacbQUg": {
    "date": "3/11/2014",
    "text": "This was my first visit to a primanti bros, I have seen it numerous shows about this place on the travel channel and food network and I must say this place didn't disappoint.  For those that don't know anything about primanti to bros they make sandwich with meat, vinegar based coleslaw, tomato and fries stuffed between two slices of Italian bread.  If for whatever reason this tasty sandwich doesn't tickle your fancy, this location does offer a variety of other choices such as pizza, wings, and burgers.   Enjoyed my experience at primanti bros and will be back next time I am in Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7J-EVZW_KOt7v9pLTfLJNg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Angus steak",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7J-EVZW_KOt7v9pLTfLJNg/o.jpg"
      }
    ],
    "user_id": "U33XCz-8HyXwZ6v5I3HFng"
  },
  "hr8GY-MUne-ApmHrXqsu3g": {
    "date": "6/20/2014",
    "text": "Primanti Bros is what much of the US knows culinary wise about Pittsburgh.  Sandwich with coleslaw & fries on it.  Simple, effective and gluttonous.  What else does one need?  Well I'll say this much, its something you should try at least once for the fact of saying you've had it.  Its one of the first things I tried in Pittsburgh.  You can go to this location or one of the others.  As for the sandwich itself, its ok.  Not a fan of the bread they use and would like to see more ingredient options: marinated steak, chicken cutlet, grilled eggplant.. to name a few.  The sandwich itself lacks that kick.  But again, its an institution so one must try it once.  As for this location and other options.  The pizza is decent.  The last time around I had the buffalo chicken salad it was good.  They have a large beer selection as well.  Plenty of TVs and seating to catch the game (although it does not seem that many football/soccer fans dine in).  Plenty of options for the rest of the group too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wFL_ALur5nfnG12QXAgSEQ"
  },
  "2xggeKvWwcjnMFpjcjCzBw": {
    "date": "6/16/2016",
    "text": "Another one of my go to places for lunch when I'm in Pittsburgh.  I had the corned beef sandwich with a raspberry lemonade.  Always a great experience. Friendly service in a friendly atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6Qeqog1o2Ljhk0hYP-9GTA",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Corned beef. I always hit this place up when I&amp;#39;m working in Pittsburgh.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6Qeqog1o2Ljhk0hYP-9GTA/o.jpg"
      }
    ],
    "user_id": "RpX-7U9VyVaLnz4We14c4g"
  },
  "F1X3p9HQhxPZYQpDq8mLLA": {
    "date": "4/27/2014",
    "text": "Not bad... I was in town for my son's football combine & decided to try it. It's been several years since eating here... Service was good... I ordered the Black Angus Steak Sandwich & it was huge... The french fries they put on the sandwich reminds me of Kennywood Fries (yummy)... I found out that they have $.48 wings all day on Sunday & ordered a few buffalo wings with ranch dipping sauce... The wings were a 10 on a scale of 1-10... The restroom was clean... I would have given them a 5 star, but the garbage cans outside the front door were overflowing from the day before...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nCFU72QC3-2aHJunA_jELg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Minus a star...",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nCFU72QC3-2aHJunA_jELg/o.jpg"
      },
      {
        "img_id": "Tb5ldHxkayVBXdejUKTNvQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Wings were a 10 on a scale of 1-10...",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Tb5ldHxkayVBXdejUKTNvQ/o.jpg"
      },
      {
        "img_id": "3OM2TYrM9YMqPq_KD7Uz3A",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. 1/2 way done...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3OM2TYrM9YMqPq_KD7Uz3A/o.jpg"
      }
    ],
    "user_id": "V1vTydFwCOxA4ltmEBgetw"
  },
  "qFgEKL3hxIs1Cy1TAkawYQ": {
    "date": "10/25/2015",
    "text": "Blah. I don't understand what the big deal is about this place (any of them). The food tastes like nothing. The fries taste like nothing, the sandwiches taste like nothing, everything is just flavorless. The price is ok, could be lower for the underwhelming food but it's not bad. The only reason I give this 2 starts instead of 1 is because the service is usually decent and, though it tastes like eating a sponge, you always leave full.  You can get getter sandwiches at Bob's... Or Subway.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gGCzjfy_WPznSNSBvRg-Fw"
  },
  "zXsidVDRKSXWVUZoEfXbWA": {
    "date": "5/12/2017",
    "text": "Um, wow... not a \"quality\" food place.  Bar food alert. Buffalo chicken and buffalo shrimp were almost inedible... gyro and club sandwich were great. Out of town WRs stopping in for late dinner so we won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "plKUmBvXKzARTuTvq4x4tg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/plKUmBvXKzARTuTvq4x4tg/o.jpg"
      },
      {
        "img_id": "JnBCwVW0isxRZ73ZSu3PEA",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JnBCwVW0isxRZ73ZSu3PEA/o.jpg"
      }
    ],
    "user_id": "zPq9z868N4g0Y5Lqz2BMLQ"
  },
  "HNo1uUhyEL56S69-0Gn5aQ": {
    "date": "1/28/2017",
    "text": "I love Primantis. I have never had a bad meal here and I highly recommend the \"Drunk Duck\", a delicious cocktail. Whether having a salad or a sandwich, a good place for good food at a reasonable price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v8VyBrpJaP8z4mQcSPeNWg"
  },
  "k85puzX2yX-RyIJJRIGF8g": {
    "date": "6/25/2015",
    "text": "A True pittsburgh classic.  Had a salami and cheese, stacked with fries and coleslaw snd hubby had the pittsburgher.  Both very good and hot.  Great cold beer and wine.  Pirates on all tv's and great service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WBWMffjF_VfWphSXtAh83g",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Salami and cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WBWMffjF_VfWphSXtAh83g/o.jpg"
      }
    ],
    "user_id": "Qsqal5zljlojn38bxNok1Q"
  },
  "d83ZCT_wWVzBqd2sPGmPJA": {
    "date": "1/31/2014",
    "text": "Atmosphere was good  Service was good However if you are looking for a Philly cheesesteak you're in for a surprise. It's nothing like. Keep an open mind and you might be pleasantly surprised. If you want a tradition untraditionally made ask for the Sicilian cheesesteak sandwich and again keep an open mind. I would go again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t2SnedmVytoESbGmv6kweg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t2SnedmVytoESbGmv6kweg/o.jpg"
      }
    ],
    "user_id": "gRZlkWEZnhSKomBfFwPO0Q"
  },
  "HJ0dSoECs7mkU99j1v1npg": {
    "date": "8/30/2016",
    "text": "The sandwiches definitely don't taste the same when you're not in the Strip District. And the service isn't the same either so don't expect piping hot food delivered nearly instantaneously. However, if you just want some Primanti's and you near this location, it will suffice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YNkbvkPhLMFlOFYH2PLMwA"
  },
  "ZdFWfnB5X_5ncba7KBAn_g": {
    "date": "9/14/2017",
    "text": "The wife and I usually come here several times a month, mostly for their happy hour. The food is very good and the drink specials can't be beat. Unfortunately there is one issue that management needs to address. One of the regular bartenders apparently BATHES in perfume. All of the bartenders, including this one, are very good but the overpowering perfume chases us out every time. Someone PLEASE ask her to tone it down, we really like the place but not when it smells like a bingo game at the local senior center.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nkJ5FvRVGHWjZHXU9Zw78w"
  },
  "RuI2EwLI1oQ6D3vnHf7YMA": {
    "date": "4/24/2016",
    "text": "These places are what you would say \"acquired tastes.\" Listen, I get it. I honestly get it. It's a burgh thing. Right. Ok, woohoo, high five n'at. But I'm not giving this more than a single star. I like bread. This is not what I call bread. It's weak. The slop of fries...  Ok. Stop right there. I'm having an issue with these fries. They are dark. They are grease soaked. They might even have iron filings in them (could be a steel city thing, not sure) but my expectation of fries derives from the old country. Like bread. Did I mention bread before? Can someone please explain to me why the bread is flimsy and the fries are brown and greasy and not white and crispy?!? These are basic things, but it's entirely possible that if this is the stuff you grew up with and have no other frame of reference then it's completely understandable that you 1) like this food and 2) expect someone to give it a positive review.  For me this IS a positive review. I'm positive that the bread is weak, lacks any sort of crunch and density and the fries are like oil-soaked, limp, polystyrene. To eat here again it would have to be a serious emergency, under the influence of copious amounts of beer, liquor, what have you, and nothing else would have to be open for business. Out of town guests that are taken in to these places are simply being nice by saying \"mmm, nice!\" So, no. No to the bland. No to the tasteless. No to the recycled oil-soaked thingy's. Just no.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "D3X7suGoZsF9MfkCxlIw6A",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Yes, Primantis can also make personal pizzas.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/D3X7suGoZsF9MfkCxlIw6A/o.jpg"
      },
      {
        "img_id": "EVuEOb5G-3VHFMXWdjBezw",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Bacon eg and cheese, and slaw, and fries, and...and...and...",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EVuEOb5G-3VHFMXWdjBezw/o.jpg"
      }
    ],
    "user_id": "3z1EttCePzDn9OZbudD5VA"
  },
  "wDAbSjdbWNyNQaICMcXCaQ": {
    "date": "9/21/2014",
    "text": "One of my very favorite places.   I get a roast beef with all the toppings and am never disappointed.  While this place is located in Harmarville (severe lack of character) this place really manages to capture some of the vibe of the original.  good food, friendly staff, great memories",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3BsMAsatkDDg5MxWpP-bdA"
  },
  "LZiRB7244XWjVwO31Qh7cw": {
    "date": "1/12/2015",
    "text": "If you have to get something other than the famous cheese steak with fries and coleslaw then order their pizza, it's under-rated.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fEaW4SOXfqp_cl_kWa2NIQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fEaW4SOXfqp_cl_kWa2NIQ/o.jpg"
      }
    ],
    "user_id": "rp007n5XVLGJwIOTh9U0-g"
  },
  "xbKpG2iXnqzsi_h3kZXBQQ": {
    "date": "11/3/2016",
    "text": "This place is busy... and it's a Thursday. Big bar, plenty of table seating and patio area.  Great selection of alcohol and a crazy menu variety. I thought I would have waited forever for my food with how busy it was. Well, I was wrong. It was literally done and in front of me in less than 6 minutes. And it was awesome. Great customer service and the food was delicious!  I will definitely be back to this place!  Thanks!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "loFGPgd8s0NSizdLadq_WQ"
  },
  "N9uxxViZs4n7OPBx3zzC9Q": {
    "date": "3/4/2016",
    "text": "My order didn't get started cooking till I came to pick it up and the hostess went to talk to the chef. I was made to STAND and wait by the front door while people walked in and out for at least 10 mins. I don't mind waiting for my food, but I ordered and paid online an hour in advance because I had places to be.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J1KHspM9R-cqprQJRFLFqg"
  },
  "LTksczqoXBF4NMBgpQ_30g": {
    "date": "4/25/2012",
    "text": "Great place to watch a game for the most part, but I do have some tidbits that I can offer management....  Your bartender this past Sunday- she was awesome, on top of things, friendly, attentive and just plain good... she was super busy and did not miss a beat IMO.  I would give her 5 stars if I could.    Your food runner this past Sunday- get someone who is not nasty and pi$$ed that they are a food runner.  She practically threw our food down at us and when a friend came and joined us, she did the same thing.  I do not care how miserable you are, try to be nice to your patrons when you are working... or get a new job if it makes you that miserable!  Even the bartender acknowledged her attitude and apologized.    Food was yummy, better than many other locations as I usually frequent the city locations and not the suburbs so the atmosphere is a tad different.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLVq7VSJBHZwqurwWoCmpg"
  },
  "IkwG_JZVpB8u4tUiTGKsZA": {
    "date": "4/19/2019",
    "text": "Came to Pittsburgh to watch a Pirates game. Having never been to Primanti bros we definitely wanted to try one of Pittsburghs staples. We were seated immediately at a table for 8 even though we had 9 people in our party. We pulled up another chair....not a big deal. We ordered a giant pretzel as an app and it was delicious! I ordered a Pitts-Burger. You can only have your burger cooked well done here. Food came out fairly quickly. It was OK. There was no flavor to the burger. Others at my table did not have as good of luck. My brother in-law couldn't even finish his Smoked BBQ wings because they were so bad. We did have a standard cheese pizza at the table as well and that was good! Maybe our standards were to high but it was kind of a let down after being so excited to try the famous Primanti Bros restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lovA7Ewh1Ue39nYox1U9IQ"
  },
  "BC8g0VkmZW1uYCEwNTcs_w": {
    "date": "1/3/2019",
    "text": "I was trying to show an out-of-towner a classic Pittsburgh staple sandwich and was left horribly disappointed. The fries on the sandwich were unseasoned, as was the bread. I don't know how you make meat, cheese, and fries taste so unbelievably bland but these were basically inedible. I had to wait till we got home and doctor them with a liberal application of kosher salt, cracked pepper and mayonnaise to salvage them.  If you have to come here, get pizza instead. If you can make the trip, head to the Greensburg Primanti's, they actually season their food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tBECw_nl5pHaFu-R4a8hFg"
  },
  "7CVGR2ERGMo_ruTOEUpPoQ": {
    "date": "7/31/2018",
    "text": "I am judging this on my Caribbean salad that I had, which might not be fair since they're known for other things, but y'know, if you have something on the menu, it should be high quality. This was basically little better than a cheap salad at a school cafeteria, a miserable salad with iceberg lettuce and chicken and a bland dressing of some sort. My friend got a sandwich with fries, a thing around the Pittsburgh area, and that looked considerably better. My other friend got an enormous plate of nachos, and while I didn't eat that, it had that godawful cheese from a can and tortilla strips that must have come from a bag and didn't really look all that great. He didn't like the nachos. The place was packed, so you know, there's clearly some people enjoying the food, but I wasn't one of them. Customer service was slow, didn't bring us our silverware until I had tracked them down, and seemed understaffed. I really don't get the hype of this place. There's some great food in Pennsylvania, but I never found any of it here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gxZvg_KCIkWMQ_Ii8jhupw"
  },
  "w0GfOa7FEDZB5zJ5IALnYg": {
    "date": "3/16/2018",
    "text": "Gone downhill so fast!    What happened??   Sandwiches completely suck.  No meat!! They've completely skimped.  Now, their pizza, which was once excellent and one of the best in the city, completely stinks!!! It's awful!!  They use much cheaper, salty, tasteless ingredients.  Their sauce, which was awesome, is non existent.  Crust is sooo thin!!   Whole family once loved the place.  Now it's someplace we avoid.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NiVNIj1RDO6gFhBKHJUA5w"
  },
  "hcj4ewzmBpK_uaf3UypJ1Q": {
    "date": "5/7/2018",
    "text": "My boyfriend loves it here because he's vegetarian but I wasn't impressed by the food :/ ta each is own I guess lol BUT!!! I did love the fact that they had a pool table for me to play!!!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XMS3Noj2RJcjCisgo8ZIHA"
  },
  "O7uAUj4WJeWyBqTid_oVpA": {
    "date": "8/11/2018",
    "text": "How can you even begin to go wrong with the original Pittsburg classic?  Defiantly an acquired taste but very excellent! They have great pizza and other items if you aren't into the Pittsburgh original but is a must try at least once.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hxCVyxiJrV3-rPHpd0wyKg"
  },
  "MKlY3B7ncgZni2CbJ2x0sQ": {
    "date": "4/14/2017",
    "text": "When I entered the area of Pittsburgh I was staying in I sought a place that would be showing the Washington Caps game. So here I  came.  Sports bar with lots of tv, most showing UFC,  none in the dining room showing the caps.   I was seated in a booth in the bar where they were showing hockey and there were other caps fans.   The staff ignored me for a good 15 minutes but once  a server woke up she was good.  Ordered the Philly burger.  I don't think it was a burger or food. It was suspect at best.  All in all perhaps it you are a drinker it's a great  place but if you're not it's not.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VSJqjI6AH4MCfyXYwZPdHw",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VSJqjI6AH4MCfyXYwZPdHw/o.jpg"
      },
      {
        "img_id": "-3VL7LCTBXzdtnzportQ7g",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Exterior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-3VL7LCTBXzdtnzportQ7g/o.jpg"
      },
      {
        "img_id": "Nb0fVzGtwmwji6MqiX_0CQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Exterior",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Nb0fVzGtwmwji6MqiX_0CQ/o.jpg"
      }
    ],
    "user_id": "YNqvlr8cB2cNO8QWa4aCLA"
  },
  "iFAkVGnJGxNVhefiBkuIQQ": {
    "date": "7/31/2018",
    "text": "Not impressed. We were from out of town and were told to check it out. We noticed several locations and the type of fare and thought it was western PA's Chickie and Pete's. Not even close.  The waitress recommended \"The Pit.\" Bread was nice and soft, but sandwiches were dry and seriously bland. No twist on the slaw or signature sauce to add some flavor. Service was slow and we sat with empty glasses for a while, it was almost a half hour after ordering before our sandwiches arrived.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QFuHKTR1beLs5UufRoAwrg"
  },
  "cnqWVXsdnUp2zjklqnUARg": {
    "date": "2/19/2018",
    "text": "Overrated.  Terribly overrated.  Had the pastrami and cheese.  Sloppily built, scrimped on meat, bread had Wonder Bread texture.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hXl2C2fwfV2BFO89MYfzrQ"
  },
  "4rJXa3AfnVE9UX8IPv4vXA": {
    "date": "5/29/2015",
    "text": "Oh Primanti's, I'm just going to lay it out there -- I think your signature sandwich is underwhelming. Sorry Pittsburgh, but I just don't get your obsession with fries and coleslaw on a sandwich. I know, I know...feel free to tar and feather me.  :)  But my feelings about a Primanti's-style sandwich are irrelevant to this review, because this is a suburban Primanti's -- as such, they offer a wider menu that goes beyond just the sandwiches. We happened to be in the area and my husband wanted to catch part of the Pens game, so we decided to stop by.  We were seated in a booth, and it wasn't very comfortable -- they are all wooden with low backs. The low back was particularly annoying because not only could I hear every single word of the conversation from the people in the booth behind us, but the woman sitting there had really long hair that she kept flipping over into my side of the booth. Gross.   To add to my already-kinda-sour mood due to the hair-flipper sitting behind me, we were ignored for 15 minutes after we were seated. I finally had to walk up to the hostess and ask if we even had a waitress. Finally one appeared (and to her credit, she was very apologetic for ignoring us).  During Pens games (and apparently Wednesday Pirates games too), this Primanti's has a limited menu of snacks/apps that are on special (along with a Miller Lite beer special). Wanting to save money, we opted to share a few things from the special menu -- a slice of cheese pizza, chicken wings, chips and queso, and mozzarella wedges.  The food was mixed. I was surprisingly impressed with the pizza -- it was made with a nice chewy dough, tangy red sauce, and plenty of cheese. The wings were pretty standard-issue chicken wings (nothing notable), although the sauce they were tossed in (honey buffalo) was tasty (an interesting combination of sweet, spicy, and vinegary). The mozzarella wedges were also fairly standard-issue. They were cooked well -- crispy on the outside and gooey on the inside, but otherwise pretty average. The biggest letdown was the chips and queso. The word \"queso\" to me implies a creamy blend of cheeses laced with spices. This queso, however, was more like glorified ballpark nacho cheese sauce -- really processed, overly salty, Velveeta-esque. Yuck!  Other than being ignored for the first 15 minutes, the service was decent. Although there was a server (not ours) who nearly wiped out after slipping on a greasy puddle on the floor near our table, and instead of cleaning it up, he just made sure to sidestep it the next time he went by. He's lucky a customer didn't slip like he did and hurt themselves. It seems really lazy and risky to just leave the puddle there, and that bugged me.  So overall, my first foray into the world of suburban Primantis was mediocre at best. I won't be rushing back here anytime soon.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fmfc5AIk4rGcjDnFNEqnLg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Wings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fmfc5AIk4rGcjDnFNEqnLg/o.jpg"
      },
      {
        "img_id": "3c2DrkrmnagCaKmo0Ytryw",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Cheese pizza slice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3c2DrkrmnagCaKmo0Ytryw/o.jpg"
      },
      {
        "img_id": "T87xgHyZE615N3C2tSgo4Q",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Mozzarella wedges",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/T87xgHyZE615N3C2tSgo4Q/o.jpg"
      }
    ],
    "user_id": "0EhPIlDozxGKpbbHRr6vZg"
  },
  "mIuvAYaxThhM2Y_5HIrJ5w": {
    "date": "9/29/2018",
    "text": "Awesome place for casual lunch or dinner. Massive sandwiches with all the sides piled on.  Caitlin was an awesome server too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hQI0dtUXWd3HFa1zq1lhmg"
  },
  "-0A_qpmI6Gt7VT_oUkcO8w": {
    "date": "5/26/2018",
    "text": "Went there during my first trip to PA. Had a buffalo chicken sandwich and tater tots. Was DAMN GOOD. Went there again and I had a pizza, wasn't impressed at all. They didn't charge us for the pizza of course, I was disappointed",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LZYEUpv9MtKDhQmJPIumCA"
  },
  "MHhoeCxxVHh17PXZIAx0Gw": {
    "date": "5/21/2016",
    "text": "I realize this is not the original Strip District location and might lack in charm somewhat.  However, when you live any place that does not have a Primanti Brothers nearby, charm takes a back seat to food.  And the food here is good.    They have pizza, salads, and more conventional sandwiches, if you wish. But why would you wish?  This is the place to order the prototypical Primanti Brothers sandwich: meat, cheese, cole slaw, and fries all between the two slices of excellent bread.   Be warned that the sandwiches are huge and thick, so it takes some effort to eat them.  Service is quite speedy.  The noise factor can be high - I had to ask if they could turn down the music a bit so that we could hear each other.  They complied, but the volume slowly crept up.  Not a deal breaker - I would eat here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pD_W9KOdAOGhAV2_9UsfqQ"
  },
  "D6NHiyD2Z9euQGJkY21uiw": {
    "date": "5/22/2017",
    "text": "This was so gross. I remember it being much better in the past but this sandwich was terrible. I'm a pittsburgh local, and this was aweful. But I can check it off my list and never eat there again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r6UC-kgRq1UQds52ByASGg"
  },
  "yxfaoyGdyxWsWbjNUyop4g": {
    "date": "8/10/2016",
    "text": "Stopped here for lunch with a group of friends on our way to Cedar Point in Ohio.  My boyfriend and I ordered a sandwich, loaded tots & wings to share. We got the corned beef and cheese sandwich with aa fried egg, which was just okay for me. They cut the sandwich in half for us, but I only got about 1/4 of the meat. The coleslaw tasted a little weird at windiest and the fries make the sandwich a bit starchy. The meet, cheese, and bread were good though. I'd probably order the coleslaw and fries on the side next time. We ordered the ranch BLT tots, which were good but it's literally drowned in ranch. Good thing we both like ranch. They give you forks to eat it with because you wouldn't be able to eat it otherwise. I didn't eat the wings, but my boyfriend said the hot ranch flavor was pretty good.   The service was good at this location. I know they have quite a few locations but this one was right off the highway we were on which was convenient. I was feeling a little off when we visited so I would definitely give this place another try in the future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ETYEgAtZZSznySQPMhWcVw",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Ranch BLT tots",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ETYEgAtZZSznySQPMhWcVw/o.jpg"
      },
      {
        "img_id": "TXDta3GmmrpYbAbta4ycCg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Corned beef and cheese sandwich with a fried egg",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TXDta3GmmrpYbAbta4ycCg/o.jpg"
      }
    ],
    "user_id": "XQpNApK6718McKpUow-74A"
  },
  "7F9TxvW8CDmnI-OHhgGWYQ": {
    "date": "3/3/2018",
    "text": "The hours are convenient, service was fast and friendly, it was right next to my hotel so that was nice. The food was okay, generous serving of fries, general bar food selection nothing special and bun was stale on my burger.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FRUIjdsGTAb_hf8GVG-uHQ"
  },
  "Njf6imxF5qIOG3PbNJluhg": {
    "date": "8/10/2018",
    "text": "Grew up on these Sandwiches and have eaten many many, but in last 6 months have noticed it going downhill. Right off the bat I felt the bread is not the same, and that is what used to be a big factor in the original great tasting sandwich.  Almost thought could it be me, as why would they have changed the bread, until I saw the other post that described the bread as common Wonder bread, Then it clicked, yes indeed the bread now is cheap and tasteless, and texture not even the same. Have not the rest of you noticed this?  The slaw did not seem as tasty, fries soggy and very noisy inside. Sadly the place has lost it's magic. It will be awhile till I return, maybe I will try the pizza when I do.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PFb8T4n9j5nVwcne6RKGnw"
  },
  "UJA8FYMhUGS-4qscvo1hqw": {
    "date": "4/4/2017",
    "text": "Pittsburgh original sandwiches, coleslaw and fries on the stack!! Can't go wrong with a Capicola, Cheese and fried egg on the sandwich.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 5
    },
    "photos": [],
    "user_id": "8shZ8VtGu4ui4pHU9Ha81Q"
  },
  "I_as8ZDGKpc6SW0ICSOyPQ": {
    "date": "5/26/2016",
    "text": "The location is in a good spot but the parking lot can be a bit of a mess when you depend on people to follow the rules of the road. The interior of the restaurant is normally clean and inviting lots of bright lights the bars right about TVs yada yada  now when it comes down to the thing that you came here for , which is the food at Primanti's it's questionable the number one sandwich is dry most of the time even if you add it with coleslaw and dumped it in my pocket of water. The cajun chicken is reheated on the grill then a kettle bell weight is placed on it to verify it will be dry when you get. The pizza is pretty good for a sandwich shop.   The bar is loaded with local men watching the games, and occasionally groups from nearby youth rink. You may see a new divorcees on a night but dont expect anything like Southside or strip.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r0Iwn4kBO9gWiK151XvOsA"
  },
  "wb2bd1fFBund6fhQ1EdD6w": {
    "date": "3/5/2016",
    "text": "Came to Primanti's after an amateur ice hockey game at Alpha Ice Complex.  The mood was great since we had a win, but the food unfortunately was a bit of disappointment.  I got the personal pizza, which while usually awesome, was under cooked and doughy.  I had no silverware, and when I asked for some the waitress replied \"I'll see if I can find some.\"  Ha ha whatever.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "QYKexxaOJQlseGWmc6soRg"
  },
  "Kxw3U9Z2h8RAL8HRo7cbUw": {
    "date": "3/29/2019",
    "text": "This restaurant is the signature flavor of Pittsburgh.  It has been featured in many different shows and it lives up to its reputation.  They have locations not just in Pittsburgh but throughout Indiana and even Maryland.  The restaurant has a pub feel to it.  It's open kitchen allow you to see the cooks at work.  It was recommended to me from a buddy to get the Colossal Fish and Cheese.  It was also suggested I got extra slaw.  Good call on both.  The way these sandwiches work is they pile everything straight on top.  The fish sandwich comes on a thick cut bread with a huge (and I do mean huge) cut if breaded cod.  It's topped with a sweet and sour slaw (more in that later) skin in fries and tomato.  It comes to the table on a pewter platter and a knife stuck through the middle.  The sandwich is so big the knife barely makes it through before running out of blade.  It's a beast!  Now, ordinarily, when eating a sandwich I get a side of something, but since the sides are on the sandwich there is no need for anything else, aside from a healthy appetite.  There is one thing I must warn you about though.  Since this monster of a sandwich is topped and surrounded by cooler items, be very careful not to burn your mouth on the fish which is scorching hot!  I got caught several times with a mouthful of sandwich and a lava hot piece of cod with nowhere to go.  So... either I am a huge pussy... or the folks of Pittsburgh are much tougher than I thought.  After finishing off my sandwich, which I used no utensils btw, there was literally no room for anything else.  It was a meal unto itself.  And for around $12 it was quite the bargain as well.  The staff was very friendly, the manager really nice as well.  There are just a couple of things I do want to point out though.  First off, the slaw is a very loose interpretation of slaw.  Honestly, I would call it a sweet and sour kraut.  It used white cabbage only (no purple cabbage or carrots here) and is soaked in the brine so it is translucent and flexible.  It really has a wonderful flavor, but, a flavor and texture closer to sauerkraut than coleslaw.  It is more of a vinegars slaw than a creamy slaw.  So, be advised.  The fries are not super hot nor super crispy.  They have the appearance of fresh cut white potatoes with the skin still on.  They are fresh and flavorful.  The bread is an issue.  While I applaud the thick cut bread, the issue is since it is not toasted or grilled at all, it really has a hard time standing up to the size and weight of the sandwich itself.  When you get towArd the end of the sandwich, the bread is a long forgotten friend and ally and is broken and beaten on your plate.  A little grilling would fix the disintegration of the bread itself.  The Arnold Palmer was very tasty.  They give you the option of sweet or unsweetened tea.  I went unsweetened since I really don't want to push my diabetes issues over a cliff like Thelma and Louise!  The server was sweet and attentive just like the entire staff.  Honestly, now that I think about it, I think this location was all women... good for them!  The bottom line.  When near Pittsburgh, check out any of the many locations.  The choices are superb, the prices fair and the portions generous.  Just don't wear your Sunday best or you might be wearing your Sunday meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PmRh7UearBFJZKYSX34QCg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PmRh7UearBFJZKYSX34QCg/o.jpg"
      },
      {
        "img_id": "9l8eyVDHLIi8inGKJ3yLGQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9l8eyVDHLIi8inGKJ3yLGQ/o.jpg"
      },
      {
        "img_id": "TzGm1WGWJZHbNvNgy94fgQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TzGm1WGWJZHbNvNgy94fgQ/o.jpg"
      }
    ],
    "user_id": "sU2qpgaSYFqJtJ0NjkSNFQ"
  },
  "NH5tnZ1aRqQCAvVHzLMP4g": {
    "date": "3/21/2019",
    "text": "Looking for a local Pittsburgh chain, check out Primanti Bros..  They've been serving them since 1933.  It's basically pub fare and pizza food menu, but I think you gotta try their special sandwiches once.   Reasonably priced under $9, their signature sandwiches are made with thick Italian bread includes a meat item, cheese, vinegar slaw and fries stuffed between the soft bread.  I had the Pitts-burger which was a sliced Salisbury steak with  provolone.  This was filling and tasty with a small side of beer mustard.  Next time I'd try another one of their other creations for a more unique sandwich.  Did also try a small order of boneless buffalo wings to start; liked their 'hot ranch' sauce, pretty tasty! And they have special price for wings on Sunday (bone-in) and Monday (boneless).  Ambience was casual with full bar and restaurant on each side.  Service was friendly and efficient.  If you haven't been here in Pittsburgh, you won't find it elsewhere.  But I'd say there are plenty of excellent food options around town.  Enjoy!",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "mI1brLD4TQ_47K1qRKcfAg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Classic Primanti sign",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mI1brLD4TQ_47K1qRKcfAg/o.jpg"
      },
      {
        "img_id": "PnfOO8rQkoUGLsWKA6fAtg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Boneless wings with Hot Ranch sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PnfOO8rQkoUGLsWKA6fAtg/o.jpg"
      },
      {
        "img_id": "FiXWBE6xTc5ydMd-T-8lsA",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Pitts-burger signature sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FiXWBE6xTc5ydMd-T-8lsA/o.jpg"
      }
    ],
    "user_id": "o9oREBM3WldaF7uPNUMPdQ"
  },
  "pL11m_kL0Wyl032yN9Uiig": {
    "date": "8/1/2019",
    "text": "I was surprised when I saw Primanti's averaging a flat 3/5.   I don't think it's the best restaurant ever but I was pleased each time I came there. I always had good service and the portions are well worth the money. I will admit that the fries and wings are terrible...But the sandwiches and pizza make up for it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PmGluGdkbD4-E--TYHJ3SQ"
  },
  "RHjLvJ49zlJ8gir-ztkNCQ": {
    "date": "6/25/2019",
    "text": "I have ordered from this location 3 previous times with door dash and my pretzels have been awesome. However, I ordered one tonight and I was shocked. The entire pretzel had about 20 pieces of salt on it and was nearly as hard as a sour dough pretzel.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jGJmlkapvrRdVtoFhUAvcQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Crunchy &amp;#34;Bavarian soft pretzel&amp;#34;",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jGJmlkapvrRdVtoFhUAvcQ/o.jpg"
      }
    ],
    "user_id": "RdSvM_pZ4LRehR8PX0dNFQ"
  },
  "ncpoG27gc5vk2lU8Bm572g": {
    "date": "6/6/2018",
    "text": "Genuinely confused why this place is famous. So there are coleslaw and fries inside the sandwich...cool. A few places have that concept for their sandwich shops these days. The food here though was not at all good. The lack of creativity in their menu was less than impressive, however, the overall lack of flavor was most disappointing. We ordered the hot fried pickles - disappointing, I had to concentrate on each chew to try and find flavor in what I was eating. We also ordered the Pit which is apparently their best selling sandwich. Again, genuinely confused. How is this the best selling sandwich on the menu? The meat had no flavor, the coleslaw was nothing, the fries were better outside the sandwich...I don't know. You would think that with so much going on, there was flavor somewhere in here...except there was none. So much going on and so little flavor.   The waitress was nice though, so one star for you cuz of her! Yay",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "md6DWaAGrMy1FUUqQo_MyQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Hot fried pickles - not recommended",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/md6DWaAGrMy1FUUqQo_MyQ/o.jpg"
      },
      {
        "img_id": "2U-Vk9NCvh_Tp2XmdLS3BA",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. The Pit - somehow managed to be flavorless",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2U-Vk9NCvh_Tp2XmdLS3BA/o.jpg"
      }
    ],
    "user_id": "frIiDayrnrLs0kZb3_kTAw"
  },
  "zfrzqfRM1zaKu3q5Ss-mBg": {
    "date": "7/28/2019",
    "text": "Has consistently gotten to go orders incorrect, but charges for \"extras\" that are never received.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ANp4tzzgohIGbsQQqH41_Q"
  },
  "DobsmWGAo-EJXd1t5qECRg": {
    "date": "7/2/2019",
    "text": "Just overpriced bar food and the beer selection is meh. Wish they would try harder.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gRKjg6y0W_yahKuI7c5YZg"
  },
  "oK8xXrb2UDcmlOvVa84YVQ": {
    "date": "7/4/2019",
    "text": "Had sandwiches at Original location ,Southside, airport and greensburg  and all where excellent",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "92EuhuNOQvC7E-C0EeRWsg"
  },
  "yjEbrKj2ulGaKheqQT1V7Q": {
    "date": "2/18/2019",
    "text": "When in Pittsburgh, I must get a Primanti's!!   Touristy? I don't care. I love it. The biggest, tallest sandwich I've ever seen. I got corned beef, and it was so good! Piled high with coleslaw and french fries. I usually pick the fries off and eat them separately, but the cole slaw so makes the sandwich amazing.   It is very filling, and good value. I hate hard, crusty bread- their bread is so soft & fresh! Good quality, so tasty.   Love Primanti's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k_j44i2gTME_bk8dDwTJDQ"
  },
  "3SATFDV127EovPPrzFxkFw": {
    "date": "6/10/2018",
    "text": "Pittsburgh Staples for $1000.   P-Bro's, as I like to call it, is always reliable with their food. This location is nothing different. Food, super fast, and always good.   Service last night was pretty good. The waitress greeted us almost as all as we sat down, and got our drink order quickly. My Polish Hill special, and Matt's fish sandwich were there in a jiffy. Our server was back shortly to check up. Everything was great. I like the new Polish Hill sandwich. Its Kielbasa, cooked slaw, and pierogis. It came with a beer mustard concoction, that was not to either of our liking. Fortunately, our server had asked me if I wanted it on the side, and I'm so glad she did. It was just weird.   Great place!   Happy Eating!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3mR28S5jJQS-SwvzOPGo5A"
  },
  "Xx21y2KbxcsX3ejKIC7_ig": {
    "date": "9/14/2018",
    "text": "Always a pretty consistent experience at Primanti Bros.  This one can be a standard stop on the way home from visiting my Mom.  Service was excellent, portion sizes were quite generous, the fries were perfectly cooked, and they have multiple TVs even in the dining room area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZlJCUJ7e8SHjgL-wRi2gOw"
  },
  "UPSI7AZ-uat7Q4KLMOrR_A": {
    "date": "9/25/2018",
    "text": "I had the big fish sandwich and the tator tot appetizer. The prices aren't to bad it was $9.99 for the fish and $5 for the appetizer. I like the sandwich is on fresh Italian bread but it was hard to taste the fish with the FF and coleslaw on top. It's a local favorite served that way so a lot of people must like it that way. They also have a bar and lots of TVS a great place to watch the games.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uJ_PcJBeLR1EMJXHE38N2A",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Tator tots",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uJ_PcJBeLR1EMJXHE38N2A/o.jpg"
      },
      {
        "img_id": "8EVDUzWkrq7sT8ACxZyu2A",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Huge fish sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8EVDUzWkrq7sT8ACxZyu2A/o.jpg"
      }
    ],
    "user_id": "3xBFFH866WoySDG7uuwBSQ"
  },
  "IwFV4Y6ySAQ-4eqUygjjyw": {
    "date": "3/21/2019",
    "text": "We were in Pittsburgh visiting family and so we had to try a local favorite. We were very pleased with the food and the portions. They were very accommodating with my wife's food allergies. My wife especially loved the fried pickle appetizer. She was able to custom make a 9 inch pizza that she said was very good. I had an Angus beef sandwich that was also very good. We enjoyed it but it was not a \"you have got to try this place\" kind of an experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VokEvO_wxV96hVOpBpwecw"
  },
  "bcCPpa1SdSp1mmVCaCgBOQ": {
    "date": "8/17/2018",
    "text": "The ultimate Yinzer experience. The pittsburgher is my favorite of the many unique sandwiches that they offer. The wings are very good at this location also and they offer many different flavors. The fries are great. Theres televisions everywhere that play sports channels. I have visited this location 10 times this summer, generally for the 59 cent wings on Monday for lunch, and I keep going back because I can't get enough. The beer deals are good also, they have a specific beer of the day so make sure you check that out if you are ordering beer there because that is definitely worth it. GO LERS.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9lDqS5-_vZYbZEzNYtvemw"
  },
  "trube5dFW4xk6kNnc7Wbsw": {
    "date": "12/24/2018",
    "text": "This was my wife, son, and my own  first visit back to The Burgh from Myrtle  Beach in a year and a half, which meant We must have dinner at Primantis.  On a busy Saturday evening we got the last parking spot in the lot. We were seated almost immediately in the packed house full of Penguins fans ready for the game, like me. I ordered the must have Sirloin Cheese Steak sandwich stuffed with Steak strips, Cheese, fries, coleslaw, tomatoes, and a Fried egg on nice and thick Italian Bread.  It stood 6\" tall. It went nice with the 24 oz Angry Orchard Draft Cider. Every bite I drizzled some Smoked Tabasco sauce which put my taste buds into nirvana. So dang good. My wife had the Buffalo Chicken sandwich which she stated that it was beautifully the right flavors and spices to tingle her mouth and lips in enjoyable ecstasy. I'm guessing that she liked it quite alot. Oh and then there's my 9 year  old son... Chicken fingers with honey mustard sauce... He didn't complain and ate them. So that's a win. I can not wait for our next return to the beloved PRIMANTIS... Our Return Is Eminent...!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WMvhIbmn7f_GiXMc0IFgpQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. My Awesome Sirloin Steak and Cheese Primantis.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WMvhIbmn7f_GiXMc0IFgpQ/o.jpg"
      },
      {
        "img_id": "SJ6fwW9PjtiYvCzDBKGSXA",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Finally back up in The Burgh after a year and a half down Myrtle Beach, and our first stop... PRIMANTIS...",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SJ6fwW9PjtiYvCzDBKGSXA/o.jpg"
      }
    ],
    "user_id": "_P386R-Czy5WDEq09ihaPA"
  },
  "UsantsbvurCoKIBGpG1TvQ": {
    "date": "12/18/2017",
    "text": "I was finally able to try a Primanti Bros. sandwich after hearing about them from TV for years. Although this was not the original location (there are about 10) around it was a cool place. I tried the steak and cheese sandwich which of course comes with french fries and slaw piled high on the sandwich. I enjoyed it, but was not blown away. I think it was a little on the dry side even with the slaw. Maybe i should have added mayo or oil etc. I think i may like it better if i choose a sandwich on the cold side like salami or bologna etc. Service was fast and friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clHhTrJX6PylXPXvjskGeQ"
  },
  "rwLxjP1ZY7f9Kz3Jw3MufQ": {
    "date": "12/16/2017",
    "text": "Ok. We were going to Indiana to visit kids. Normally take south route. But took northern route to stop by Primanti Bros. See photos. Pretty excited. Got the pastrami sammy. Most ordered. Darn good. I appreciate the slaw fries on it. However, I would skip the fries. Everything else PERFECT!!!  Got the terror tots.Cheesy sauce, japs, bacon, needed scallions. Tasty. Was finished about half way thru. See photo. Gagged rest down. So good. Got the t shirt cuz, well, you know.  All in all, go. Checked off a bucket list item. BTW Micheal at the bar was fabulous! Attentive, had some great comments about food. And beers! Not pushy and just what you need after  a four hour drive!  Thx Mike!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HAMaSVim8fhzkdv6Q9vKZg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HAMaSVim8fhzkdv6Q9vKZg/o.jpg"
      }
    ],
    "user_id": "Dy2FJJ-WhYHqS-HHo7T82Q"
  },
  "Ee2ldFbNGr3DyfO35xPL3g": {
    "date": "2/20/2019",
    "text": "Honestly food was really good! Service was so so but generally a great place to eat if you're a traveler! The Primantis in the strip district of Pittsburgh is way better than this one I'd have to say!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VzgdVnyJP0NlcJPolPWMpg"
  },
  "TkYd6USRx26ZqsklzQkQgg": {
    "date": "2/9/2019",
    "text": "Cool place. So many choices. You definitely get your money worth here. I'm new to the area but this has become our favorite hang out. This place is great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q24ZdvjIQEIs16VyOYirvA"
  },
  "Itcyr8-Tj_6j8CUfSzXkIQ": {
    "date": "5/1/2018",
    "text": "Disappointingly mediocre. Ordered to go with a party and ate at the hotel a block away. The famous hot sandwich was cold and bland. Cole slaw bland. Fries soggy and limp. Burger was uninspired. Similar reactions from others in our party.   Waited with two others in our party at the bar for 20 min at bar for a drink while we waited for our food before finally giving up. This is a franchise, so some may be better than others, but I'd definitely avoid this location in the future.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qQoJ_3_NM7sLggVO4d5hjw"
  }
}