{
  "WWjuH6Wgin7-FEVGJgXh-g": {
    "date": "1/2/2015",
    "text": "Our go to late night spot! Perfect after the bar or a long day. The servers are great and definitely have a sense of humor. I love the fact that I can get breakfast at all hours of the day along with a nice beer. The cheese fries are also a BONUS!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eZOhXydcq_Z4DONR8pUTuA"
  },
  "MRUkisOa27796z2cGjcdBQ": {
    "date": "4/7/2015",
    "text": "I almost passed by this diner in Dormont - very easy to miss. I went there around 9:30 on a Sunday, and had just passed by a packed Dor-Stop restaurant nearby. The service was very prompt and friendly, and the food was quite good. I had their one of their Hobo omelets, and homefries - quite good, and not too greasy. My friend had the cinnamon french toast, and it was served with a very nice cinnamon honey glaze, which she enjoyed very much, in addition to maple syrup. i also got a breakfast sandwich with toasted italian bread - hearty and tasty. We will definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ia2dQGFt3djNAw_QbCj9gg"
  },
  "ndX0-ik36rb9XcjdNVc_Zg": {
    "date": "7/22/2012",
    "text": "I've given this place enough 2nd chances and have had my last meal at this DIVE. Food is mediocre at best and you can't get any service because the  wait staff is always outside having a cigarette. Very unappetizing to watch them and the cook smoking then come back inside and NOT WASH THEIR HANDS. DISGUSTING !!!!!!!!!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hwa2aNFuZG7SdioDfMN8Jw"
  },
  "xTUGUl0Glth6atQ2XdWgMA": {
    "date": "12/25/2011",
    "text": "I know Tom's is a South Hills staple, but other than the convenience of it being open 24 hours a day, I'm not impressed. Even by greasy spoon standards this isn't great. The wait staff is hit and miss. Some are friendly and attentive (there's an awesome Greek lady there that I love), but just as often drinks sit unrefreshed for an entire meal and I can't get anyone's attention to prepare the check. The food is really bland (hard to make a boring grilled cheese, but they manage it) and priced pretty high for what it is. I've been there five or six times in an effort to find a reliably good menu item, but I've given up. It's just bad.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kPhhm_zcIsNYYtQthLX92g"
  },
  "uWckZXXWIZ295IGM8_gkpw": {
    "date": "11/10/2014",
    "text": "I came in and a waitress came to our table , took our order and then walked away. Another lady came to us and asked what we wanted , then the first girl came back and asked us again!!! The restaurant has 4 people. This is not good! Write it down you dumb blonde",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d1OLjvQWwCMa8INqojXIgQ"
  },
  "MwajZGfsMWwTySGfEF3aeQ": {
    "date": "9/13/2012",
    "text": "After living in Seattle and going to a number of amazing diners, I was thrilled to find Tom's. It tends to be a little greasy, but I love the food. I've been there at least 6-7 times, never a bad experience. DISLIKED that the bathroom is hard to find without asking. PERFECT hangover food.   I will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mMKRhFV1E1u-7Xvypnho_g"
  },
  "3_gwVfng5r-k7ZLsei5JKw": {
    "date": "9/8/2012",
    "text": "Open 24 hours is the key. Good food at any time. Gyros are their specialty and are very good. Remember it is a diner.  The decor is out dated.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7wmjkbq-iTG1_z62fgnvoQ"
  },
  "co6Qcxf-V96PHmUDFn02Jw": {
    "date": "10/14/2010",
    "text": "I've been a Tom's Diner fan for almost 20 years, and it's not like it used to be. Classic diner fare, with the diner look of retro booths, and counter area. The one major thing that seems to have changed is the consistency of the food. Some days the gyro is fully loaded, and some days a pb&j would've worked better. Home fries are a hit or miss breakfast item, and the omeletes are good, but have been better. Overall Tom's is a better pick than Eat N Park up the street, but it won't take long to grow weary of the selections. The service has always been great, I just wish they'd bring back more of the Greek type specialties.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "kKCWp4tDw76Q546wXwWuTg"
  },
  "WY6YJvscIxQcT8RBSyu6_w": {
    "date": "1/15/2011",
    "text": "The service here was outstanding with a very friendly staff. I could not believe the amount of food we got for $7 per plate. Great food. Great prices. A new Pittsburgh favorite of mine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tqn7emV6t6q24Pm4C3Ni7A"
  },
  "vKq05jBTxNC9oYEGIsfdjA": {
    "date": "11/2/2013",
    "text": "Ignore the negative reviews associated with this place on yelp.  I stopped here for breakfast when I was in Pitt for a game and the food and service was excellent. I got the cinnamon french toast which came with another plate full of sides.  Also got the Greek pastry dessert with some ice cream.  That was very tasty too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WMcGGQOMkwxU-EQWmWpTzA"
  },
  "OR6w-WQj5w8PZN00F8Jfwg": {
    "date": "8/7/2013",
    "text": "disgusting.  poor service, worse food - even when you're not expecting much because you went in for diner food....  cool retro decor that would be nice if it were clean.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zxL5c9syMuxOPtfnk0tXtQ"
  },
  "VA_A-2A8P_zSGmXIRZg72w": {
    "date": "10/21/2011",
    "text": "I can't comment on how it is for actual meals, but If you want food in the middle of the night, you can't really be picky and they get the job done.  At first I thought the price on the strawberry pancake breakfast meal was high (around $9), but it comes with lots of food (3 big pancakes plus sausage & potatoes).  Nothing special compared to other pancake places, but any stack of warm pancakes late at night is delicious to me.  The waitresses seemed nice and friendly, especially considering it was past 2 AM and they have to deal with all the drunk people coming in.  Overall, I liked it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8heSpevri02f06W9VeNz0g"
  },
  "cJv3VYb3ySAUGLs4EdRjdQ": {
    "date": "8/5/2010",
    "text": "Brought the family to Tom's last weekend, and was disappointed.  On the positive side, the prices were excellent, much better than the canonical breakfast spots in the strip.  However, the food was heavy, greasy, and made from mediocre ingredients.  I didn't care for the spinach  / feta omelet, the kids' pancakes were heavy, and the home fries were greasy.  True, the place felt 50s, but kind of worn out.   We won't go again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Caiq_DtgpoGJ-ZQzsgrTeg"
  },
  "ry1mUrVXhBxbm9AQSZLAlQ": {
    "date": "9/14/2015",
    "text": "I would only recommend if there is a power outage and everything other food establishment is closed within a 30 mile radius.   I love diners.  In fact, I'd say I've easily eaten at over a thousand diners in my time. They are great. You know what's not great?  Going to a diner and not being able to order a grilled cheese. That's right, Tom'a stops making them at 10pm, I'm assuming because the grilled cheese specialist's shift ended. Oh, but I can order a club sandwich, which, oddly enough has the same components as a grilled cheese.  Other highlights of my visit:  Initial state of confusion everyone seems to have when you first enter as there is no sign instructing you to seat yourself.  Wait, there is a chalkboard right in front, but it's blank.   Too few waitresses, who were outside smoking as much as possible.  I can't say I blame them, working here seems stressful!  Bathrooms are prison like, and shared with the bar in the basement.   Hole in the ceiling.  If there was a ladder I would've considered using it to escape.   The waitress rolled her eyes at me when I asked for a box.  Look lady, I did that because I came to the same conclusion as you: I do not want to be here.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "63DGhIAJsNOS83gcaj4-8g"
  },
  "ftU6sBVMg07scN-kg-0RjA": {
    "date": "1/12/2018",
    "text": "Very friendly staff!! Food is good. Bathrooms are a bit odd. You have to walk downstairs and around the corner but really great diner experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hyRWs0hlE2kSRNzx4nx4Q"
  },
  "kALpwekojbIrVeLKDw8wiQ": {
    "date": "12/29/2013",
    "text": "An institution in the south hills.  That said, it's still a diner at the end of the day. Considering how much steady business they get throughout the night, I'm surprised they don't have more than 2 swamped servers on the night shift. Needless to say service is spotted and curt, but not impolite.  The decor is cute, but the whole place does seem a bit old and run down. The bottle of hot sauce I got the other day had the consistency of watery jello. They could use a bit of touch up/restoration.  Food is average, cheap, and something on the extensive menu will hit the spot. Thank goodness for its existence. I highly prefer Tom's to any Eat n Park/ihop/whatever generic chain food served to me by angsty teenagers who act like they don't want me there. 3 stars overall.   The extra star is for the extensive selection of craft beers downstairs/next door. Apparently a lot of good stuff and good recommendations, according to my more knowledgeable friend. They don't keep a beer list, but go down and browse and find something yummy to go with your meal! I think this section closes around 1 or 2 am.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jXX-G_goCYZZrLSDY8qXdg"
  },
  "zKUyK9a7GRZrYqJaHNUsCA": {
    "date": "10/28/2016",
    "text": "I stopped in last week to get a quick meal cuz I was in the mood for a burger. I ordered this one burger that looked nice and greasy and cheesy and it came on this toast. So far so good. Waitress brought it over, finally, and I take a bite and theres this paper or something like paper on my burget I just took a bite out of! At first I was like WTF but then I was like Oh it must be the paper that keeps the cheese or meat from sticking together I showed the waitress but said that its okay mainly cuz I didnt have another 20 mins they didnt even take the drink off the bill. I took half of it home and I swear I made sure there were no foreign objects on it but sure enuff I heated it up took a bite PAPER",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sUmQiO8_EdoOgOag9DWgxQ"
  },
  "vbbIl4pNWnu42GHnS3cgkQ": {
    "date": "4/12/2015",
    "text": "Toms is good diner food. No frills here. If you want good diner breakfast this is the place. If you want out of the box or gourmet breakfast you have come to the wrong place. Will definitely return again and again go quick breakfast.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pMfgF49l1-dQpMr8W75W9w",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Breakfast burrito",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pMfgF49l1-dQpMr8W75W9w/o.jpg"
      }
    ],
    "user_id": "XWEbLpANMuEajGXWZ3_CEQ"
  },
  "UV2YK5r_RADnkl8_XOs8tg": {
    "date": "12/8/2012",
    "text": "Tom's Diner is one of those places I really, really want to like. You see it when driving down the street and it looks like a cool, retro place that got picked up from the past and dropped in the present next to the chain stores and abandoned buildings lining the rest of the street. If only the experience here matched the charming exterior.  I don't have a problem with the diner food, first of all; it's not great, but hey, for cheap eats, it's not bad. They make a mean French onion soup, I admit.   My problem is more with the maintenance of the place. The windows are dirty, seats are busted, tables aren't properly cleaned - those things really detract from the experience and make the place look run-down and a bit unwelcoming.  The biggest offense for me, though? The service. My waitress? It took her three trips to remember I had ordered an additional drink (yes, we reminded her), by which time I was almost done with my meal. Also: this diner does not have ketchup at its tables. This would be okay if the servers remembered to bring it out with all meals. They do not.   Seriously, guys: you operate in Pittsburgh. Ketchup is mandatory.  I may poke in for a quick bite again, but I'll be honest with my final opinion: considering how mediocre my experience was on a slow Saturday night, I suspect some fast food chains could knock Tom's out of the park on a busy day at this diner.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "UhlZwOdyCt758eTQlA6rwg": {
    "date": "10/10/2016",
    "text": "Classic dinner opened 24 hours and a nice bottle shop right next door. I recommend coming here after a night of drinking or early morning for a greasy breakfast. Keep in mind, this is a diner and you should be coming here for eggs made to order, potatoes and toast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B3piSjG93U2zRxxXGFcvPQ"
  },
  "I4h7RjFV15ZiMKH_HQH1SQ": {
    "date": "1/31/2015",
    "text": "Such a shame.   Hire and run enough staff on a Saturday night to take care of your customers.   2 servers at 8:30pm with 14 tables may be good for labor % but after 3 decades of making Tom's diner in Dormont a stop whenever I'm nearby,  this is the last time I will be here.   10 minutes to be acknowledged,  5 more to get the drinks (there were 2 of us), 30 minutes for the soup,  followed closely by our sandwiches. ... And I watch the other customers faces....all confused as I am as to what's going wrong in here...who is running the place?  Does anyone who owns the place actually care?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AhMY21nUZ13w_H4Glp1LOw"
  },
  "IlpdoueijDmEkiaqLC227g": {
    "date": "7/27/2012",
    "text": "Tom's Diner is a bit retro, a bit hole-in-the-wall and a bit of a good deal!  The wait staff is super friendly and on top of the service, the decor is retro and the booths are True diner style.   I ordered the breakfast burrito. It was pretty tasty and very filling. The salsa it came with wasn't anything phenomenal, but I'm ok with that.  The peppers and onions were well cooked, the sausage was tasty (it's sausage, not chorizo) and the breakfast potatoes on the side were just ok. They needed a little salt, which I understand and I think some ketchup would've done them well.    This wasn't the best burrito I've ever had but it was good and super filling. I ate it around 9 and wasn't hungry until 4pm! Well done!  Breakfast burrito breakdown The food: It was good. It was great, it wasn't bad, it was good. The value: That burrito was just under $6 and it was a monster! The experience: it's nice and quiet in the mornings! I bet it gets really crowded though. Would I return?: Hmmm, I don't think I need to. 3 stars?: It was good!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DqgIdcLJh90J2TKp5dRbvw",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Breakfast burrito",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DqgIdcLJh90J2TKp5dRbvw/o.jpg"
      }
    ],
    "user_id": "Dit9fxJlPB0EE-4uuh9lXQ"
  },
  "k7ozO648B67lgcRmBDAA8w": {
    "date": "5/25/2015",
    "text": "Don't fool yourself with those shiny billboards and overpriced food at those corporate food chain. Get a taste of real excellence at Tom's diner. We went there on Memorial weekend and was surprised to know that how much goodness a $7-8 can buy. We ordered gyro sandwich and cinnamon french toast special; both were delicious. The service was so nice and homely. We must vote and vouch for these mom n' pop's shop.  We have recommended this place to our friends and we hope you will do the same.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mJqadSyrhSlF-1tpW3uDhg"
  },
  "Ch0U9luLY3EDu0GrDnVLww": {
    "date": "5/19/2016",
    "text": "Our family doctor is literally across the street from this place so after a recent doctor's visit my sister Vi and I decided to give it a try. We were pleasantly surprised. Yes the decor is oldish but it gives you that authentic diner ambiance. The food was delicious. We ordered the meal that comes with 3 pancakes, 2 pieces of sausage, 3 pieces of bacon and home fries. It was only $7.75. We had to bring some of the food home we were so stuffed. You definitely get your dollar's value at Tom's Diner! We will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3_oOvKDxkASn51PBn2ZI_g"
  },
  "IR1PxRSZLbB2kNbP2Ms5VA": {
    "date": "1/8/2013",
    "text": "Any place where I can crack up, cut up, let my hair down and be loose is a place I love to be. It's a diner , kinda of self explanatory seeing as to how that's part of the name.  So they have your typical dinner fare, breakfast items, sandwichs CHICKEN TENDERS.  You get it, I don't need to explain a diner to you.    Don't judge me I'm usually wasted upon arrival to Tom's Diner it's not a place where I plan on ending up just a place that I manage to get lol.  Anyhow the pancakes are good and the wait staff is down to earth and very tolerant.  In my opinion it's not worth a trip across town, but with friends in Dormont it's a sure stop if I'm visiting over that way.   Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "V7uS5US4oTf-S9u36HJQCQ"
  },
  "Ymxms5Mi54LS6ohj3cJqVA": {
    "date": "10/10/2016",
    "text": "if u come here expecting anything other than a greasy spoon than ur a dum dum. congratulations u played urself",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rUKqUNuci158Gu5uyqhWag"
  },
  "t4drUw-nI7RhsXBlyX2hQA": {
    "date": "8/8/2013",
    "text": "I love how it's the only restaurant that is open 24 hours near Mt Lebanon  It's always good food, even after a night out at the bars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iy0a2R_uRPvZ4ZfhzpN5Qw"
  },
  "ESQmb3CxbAR4_biyjUlDYw": {
    "date": "12/5/2015",
    "text": "This once was a great place once! The mighty have fallen sad. The gyros there use to be amazing. Smh",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qBWiG2GK1FJan4ajG7vMFA"
  },
  "O_nd3doqdZSttjh4QnhncQ": {
    "date": "5/16/2016",
    "text": "Really good service.  I've been eating here for years.  One of my favorite meals is the Gyro omelette.  I love it  with hot sauce.  I like there new pretzel and cheese appetizer.  I would definitely recommend going there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xrfZZi2ja6aMwK4l9ApKlw"
  },
  "HfjK8-IvEpuvDk7g6n6nbQ": {
    "date": "7/24/2015",
    "text": "Went for breakfast on a Saturday, great food! Service was excellent as well. Only thing is maybe needs a few upgrades. A lot of the decor looks very worn out and overused.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "safQxvkAN4OCIMU7y2tUMg"
  },
  "3VwsWIkfCB2l0M0Esj8YOw": {
    "date": "7/30/2015",
    "text": "Very good food. However the establishment attracts people I wish to not be around. Dirty and needing to take a bath. And the wait it very very long. Even when it's not busy... But the food is very good!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UO_Rc101EfBGscf5IUlG-w"
  },
  "9t7bjSlPBzSOUjNqw22TzQ": {
    "date": "5/30/2012",
    "text": "Do you want a pancake breakfast, bacon cheddar fries, and a gyro platter at 2 am...?I know I do!!  Oh, and by the way, you're gonna be drunk, and you're gonna like it..  The worst part about eating Tom's diner is waking up the next morning and feeling like you ate chemical waste, and no, not the Alex Mack kind.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WC235EldJD3vxmh7VFnGpQ"
  },
  "rr_ui_3ErezAkffkAXhk9w": {
    "date": "1/2/2015",
    "text": "The food is ok and I like that they're 24 hours. One of the things that I don't like is that you sit yourself but you don't figure it out until a while. Waitress also take a while to take your order. Other than that is ok.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1EM_E8-2bt4fq43Bpnia0g"
  },
  "CWJ1eP_yOS_5pq2w1R8Cog": {
    "date": "11/18/2017",
    "text": "Nothing really stood out about Tom's Diner, good or bad. But sometimes that's not a bad thing. The food was ok, the prices were reasonable, and the service was friendly and quick. I ordered the feta and tomato omelet, and while it seemed kind of small, it was still pretty good. The fruit cups were a little on the small side too, but the Mancini toast made up for it. At the end of the day, it's a cool classic diner with a lot of menu options, and it won't break the bank.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KIr4N7skqmlalG1O5ga2hg",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KIr4N7skqmlalG1O5ga2hg/o.jpg"
      },
      {
        "img_id": "sdKsvj05iR4LWpOJ1Hf5kQ",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sdKsvj05iR4LWpOJ1Hf5kQ/o.jpg"
      },
      {
        "img_id": "fxsZDGRCI1Snpu5q-j0wsg",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fxsZDGRCI1Snpu5q-j0wsg/o.jpg"
      }
    ],
    "user_id": "nfP7jRgmR_wkM10_Gg0scg"
  },
  "S3J581x3BORarVhBddKW5Q": {
    "date": "2/13/2017",
    "text": "This charming diner was a refreshing change to the old eat n park standard type late night meal.   This diner closes at Midnight.  Not your typical greasy spoon.. burgers are\"tasty\" and the service was outstanding. The visit was in the later part of the evening . ..was just craving a burger but have a feeling that Tom's Diner serves a mean breakfast.. .. cant wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "cDabwoS-bMTbJ3Da9H-C8A": {
    "date": "2/13/2018",
    "text": "Stopped here for brunch last weekend. The place is seat yourself. There was one open booth when we walked in so we snagged it. A couple of other tables left after we sat down and placed our order and other groups of people sat down. We ordered the gyro fries for an app and my boyfriend got a veggie omelet and i got the country breakfast (pancakes, eggs, bacon and toast). It took a long time for our appetizer to come out. Our waitress said they were still making our food, but i would like to note that two tables who sat down after us got their food before we even got our app. One table had gyro meat and the other table had fries... which essentially made up our appetizer so I'm not sure why our food didn't come out first. I didn't get any pictures of our food because by the time it finally came out, i was starved. The food was alright. Typical diner food. If I'm in Dormont, i might try them again. Otherwise, i wouldn't go out of my way to get here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K515IDRsyrZskeKl0ydtYg"
  },
  "ScsDXCALdUsw1kzvsnQoYw": {
    "date": "10/14/2015",
    "text": "We stopped by Toms Diner yesterday for the first time. I always drove by it and I've heard nice things about it, but never made the trip. We were at the mall and decided to avoid mall food and just head here.  I ordered the Chicken Hickory which is a grilled chicken sandwich with cheese, bacon, grilled onions and possibly a little BBQ sauce. It came with fries. Bobby ordered a greek omelet with bacon (whaa?) which came with home fries & toast.   The 2 servers seemed a little busy at first.. a few tables came in at once plus multiple take out orders. The food made up for it despite the wait time for it.   The also have beer..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "ZjAd2xjkqxC4SFVHfG42DQ": {
    "date": "10/15/2017",
    "text": "Hate to say it, but my \"well done\" burger was not well done.  It was mostly pink, and since it was take out, I sliced it down the middle and cooked it the rest of the way at home.  I'm told that steak is safer to cook less because the surface area is the most likely to be contaminated.  With a burger, all the surface area of the original cut of meat is ground up and exists throughout the burger.  Hence, my request for well done.    Anyhow, I friggin' ate it and it tasted great.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "y-CmHwc4NvGfYUaCoow7DQ"
  },
  "dI4P9H6f3h6uZKeyPJdTnA": {
    "date": "5/17/2015",
    "text": "Tom's Diner is what you expect of diner food, cheap and filling.  The help isn't crazy fast but pleasant enough, and the kitchen is open.  They also have some unique selections, which makes them good in my book!  The day I came in, I just wanted an omelette.  I think it was $7 or so, and it came with toast and potatoes!  The omelette was packed full of peppers, meat, cheese, and tomatoes.  There were plenty of toast options as well.  I wouldn't go out of my way to come here, but it is delicious all the same.  There is a very small free parking lot behind the building for customers.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 10,
      "cool": 7
    },
    "photos": [],
    "user_id": "Ic6-gs1_FjrWGx6JIr95Mw"
  },
  "YnHOZobJQmuSUC6mmwBlBw": {
    "date": "11/26/2017",
    "text": "Tom's is very very standard diner food. It's not going to blow your mind but it also will not disappoint. To be honest, the only time I come here is if the wait is too long at the Dor-Stop. I guess the one thing that sets Tom's apart from other diners is that you can have a beer with your breakfast. I work nights and sometimes it's nice to have a cold one before bed. Other than that, I wouldn't go out of my way for Tom's.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bleyhN--91eJmPyJpXr9Mw"
  },
  "RZspTE6zlcMqgRtIbfS6Yg": {
    "date": "7/5/2018",
    "text": "This place was in walking distance from my apartment in Dormont. Gyro's are really good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ohSFvBvM6Q49Am3LiF-d_g"
  },
  "PNufqKNgK9eGM8VCpbEZzQ": {
    "date": "11/1/2017",
    "text": "This diner is top notch. The food is Greek/American and they have a good variety. The menu is not too healthy, so don't expect to count calories. The staff is friendly and the hours are great so if you go at an odd hour they will most likely be open. This is the atmosphere I crave in a diner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DmLJj7o2OZC6FqWelLv_Eg"
  },
  "Seg5My8IcSfIEg-XDcWEEA": {
    "date": "2/12/2017",
    "text": "Ordered takeout: Breakfast of Titans Three scrambled egg whites with fresh tomatoes and spinach, served with turkey sausage and loaded home fries... the food was hot and ready for pickup in 15 mins, it was very filling for less than $10... I would definitely order again, maybe eat in next time",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Woe_ZbjFH2VLck8WWsX-A"
  },
  "-0cDWIDjQFqMswSgSgdYgw": {
    "date": "9/4/2017",
    "text": "Grew up in dormont and have lived near by all my life and this place USED to be the best around for some diner food. Not anymore. The food has progressively gone down hill for past several years but I figured I could atleast still get a good gyro here. Well, I was wrong. The sauce used to be the best part and now it's just awful. Way too much garlic, and the pita has been stale the past two times. The shredded lettuce is definitely from a bag, and has that taste that all lettuce from a bag tastes like which is gross. Not sure why any restaurant would use that stuff instead of shredding  or chopping it themselves. What a shame that after 30 years I will not be going back",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xCjoVozCWX1i91rJweJeBQ"
  },
  "pQYvYFg38dOtsX3xyi-ZJg": {
    "date": "1/5/2015",
    "text": "I have to say I really loved this place.  I love the mesh of old and new.  I love a greasy spoon.  Most of all, I love the fact that I can visit here any time of the day.  I have heard of Tom's for a very long time.  I remember there being a Tom's in the South Side and visiting it many times, but this spot is so different.  There's a different vibe here, more laid back, less bustle.  Walking in here makes you feel as if you are entering a tiny road stop diner, you kind of forget that you are still within the Pittsburgh region, especially if you stop here in the wee hours of the morning.  I grabbed a booth to myself and within a minute the waitress was there to hand me a menu and ask me what I wanted to drink.  Looking over the menu took me some time seeing how this was my first visit here.  I ended up ordering a BLT with a side of loaded fries.  While waiting for my food to arrive I looked around the place and took it all in.  The colors, decor, and furniture definitely give you that diner vibe.  When I think of a diner I think of the shiny chrome, the bright white and red checkered pattern and bar stools at a counter.  All of that is here!  My food finally arrived and I started to dive into it.  The first thing that popped into my head was, \"why did I order a side of fries?\"  The BLT comes with a decent side portion of fries to begin with, I really didn't need more fries.  The BLT itself was perfect.  The bacon was greasy, yet crisp, the lettuce was refreshing and the tomato was just the right thickness.  Add a little mayo to the toasted bread and we are in business.  It was so good I wish I had just ordered two BLTs.  The loaded fries were pretty good as well.  Topped with cheese sauce and bacon (man, I just couldn't get enough of that bacon).  The waitress on duty was super polite and very attentive.  Even though it was very early in the morning, she did not miss a beat or sit around.  The only gripe I have about this place is the prices.  Some of them need to be readjusted, but other than that, it's a stellar place to get a meal.  **something to note: they do serve alcohol here.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 7
    },
    "photos": [],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "5NHbhiQIFYFrrWlN-r2H3w": {
    "date": "11/6/2015",
    "text": "I've given Tom's Diner plenty of tries, and I can't say I've ever left here completely satisfied with my meal. The biggest perk is basically that you can order a beer.  Breakfast is OK. Sandwiches are OK. Dessert is forgettable, and not homemade from what I can tell. Service is decent when they aren't busy.  If you want some quick and cheap diner food, it's acceptable... Otherwise, I'd look elsewhere in Dormont.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhQOA8-FdpA6D0hNhXEYIw"
  },
  "afK_y86IdFKzWsHPd6rMlg": {
    "date": "2/15/2017",
    "text": "Tom's Diner is a classic. The food is delicious, and the atmosphere is traditional diner.  The best gyros in town and a great place for breakfast. The gyro omelet special is probably the best breakfast anywhere. If you're in the mood for sweet, they have awesome French toast and pancakes, too.  If you're anywhere near Dormont, go there. There's metered street parking, a small lot in the back, and a metered lot across the street.  If you like a beer or mixed drink with your gyro, there's a full service bar as well.  .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q7G0ifGfc_gPSrhpeNemAQ"
  },
  "Uhm7QZcLhjHjmg20ACeatA": {
    "date": "4/28/2018",
    "text": "First experience with tom's diner was a huge win. The food was exactly what you could expect from any decent breakfast place, but everything else so far exceeded expectations that it warranted better than 5 stars if I could have given it. Our server who's name I didn't get unfortunately was beyond amazing, she was on top of every little thing before we even knew we needed it. She was friendly and funny as hell, said she only works Saturday there because she's mostly retired. Lastly and my lord was this exciting for a guy who works late nights, they serve beer during breakfast hours. Keep it up toms diner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lh2_E-K4O8ZxA36Q-i8lxA"
  },
  "5SLrPfiFBTv09NSuReEGCQ": {
    "date": "1/25/2018",
    "text": "I would give it 5 but they close now overnight. Too many guys in loose fitting steeler jerseys throwing punches.... But this place is great old school Pittsburgh Diner. Gyro breakfast platter is a killer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yw9FQfnpZlt_wBdDHarJ9Q"
  },
  "fax5yTvrZ-NYX4n2sFC3rg": {
    "date": "4/13/2014",
    "text": "I stopped by Tom's a couple of times last week. The first was after a concert with a buddy who hadn't been here in a good while. The second time was with Kay. Both visits were the epitome of all that is righteous about diners.   Visit #1 occurred unforgivably late on a weeknight. My pal is unemployed at the moment. I start work at 8:30. Immaterial of our schedules, we headed to Tom's and found that its red-n-white retro charm still stands. Spotless and far from a dive, Guy Fieri is overdue for a taping here, and with offerings such as the Mike and Tony's Vs. Primanti Brothers smash that is the Greek Goddess Hera sandwich, Tom's rules the eventide. Betwixt two buttery cuts of Texas Toast is placed a pile of fries and a pile of shaved gyro meat for your maximum, midnight-hour enjoyment.   Remember, I don't drink alcohol at all. Yet relished it, fervently, reverently.   A wedge of cheesecake-like Snickers Pie quelled sweet cravings that night much like its cousin, The Peanut Butter Pie did,  gallantly serving as a reward for defeating Tom's humongous Super Gyro decisively. It was as if a bounty had been placed on the giant sandwich, and I, the bail enforcer, had collected...  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DOHs3UygkXGc&s=0051a9770e5c8f5eeeaa65d607e928c132efa1b76bedce3f4b9ed52a5e6db891\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=OHs3...</a>  It seems fashionable to back-handedly compliment joints such as Tony's or ruthlessly deride them. Call me uncool or clueless for I have never had a negative experience here and am thankful I have such a 24/7 option so close to home. The service was exemplary and congenial both times (they gave us ketchup without asking and refilled drinks promptly), the restaurant itself was far from dingy (the tables were clean), and the food was just damn, damn good.",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 8,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "weK1GoGqqi3BBXw-INpscw",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Reese&amp;#39;s peanut butter pie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/weK1GoGqqi3BBXw-INpscw/o.jpg"
      },
      {
        "img_id": "UtB54mvE1d_xpw1je3h6NQ",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UtB54mvE1d_xpw1je3h6NQ/o.jpg"
      },
      {
        "img_id": "2-SWWgK_u0ZUXwG3WIvnFQ",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Super gyro",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2-SWWgK_u0ZUXwG3WIvnFQ/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "vWdCldE4LTwUhfY3pXGJtQ": {
    "date": "1/20/2016",
    "text": "you haven't had an omelette until you have experienced their Gyro omelette!  The absolute hands down bread and butter award winning product on their menu, if nothing else this culinary masterpiece is worth going here.  I mean, well...besides the fact that they are open 24 hours and if you think Eat n Park is a better option at 3:00 am you have a hole in your head.  The wait staff is friendly, the food is delicious, and the atmosphere is nostalgic.  Parking is plentiful with a lot behind the restaurant and next to it.  Prices are cheap, portions are large, desserts are enticing, and even though it's not \"gourmet\"....its exactly what you want from a neighborhood greasy spoon",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "rfCJYUTntqjo5Vq_vO3dJQ"
  },
  "B4Ur-XZhIyr87-zRPhfPAw": {
    "date": "7/15/2014",
    "text": "Located within a short walk of the hotel my girlfriend and I were staying at while visiting Pittsburgh, Tom's came up as one of the must visit options near us, especially for our pre-tourism breakfasts.  The restaurant has a very old school diner shtick with old, cracked vinyl booths, and a red and white motif. It was almost empty when we arrived for a relatively late breakfast, missing out on the commuter crowd. A friendly Greek lady who may have been one of the owners served us promptly and we were perusing the plentiful options before us.  I decided to go with the gyro breakfast burrito which comes with eggs, gyro meat, tomatoes, onions and mushrooms in a crisp griddled tortilla, and slices of fried potatoes on the side as well as gyro sauce, aka tzatziki. The meat in the burrito was crisp and gravitating towards the dry side of the moisture spectrum, but it had a really good flavour, quite similar to donairs here in Halifax. Although the crisp tortilla added a nice texture to the dish, I would have preferred a soft pita for the sake of being able to eat it with my hands.  The potatoes were OK at best. Some pieces had nice crisp edges, but their texture was inconsistent and a normal hashbrown or home fry would have been better.  If I was around for longer, I'd have definitely tried Tom's again, but alas, it'll always be Dor-Stop that holds a place in my heart.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GxAmhBE1YgtazxSjsRTHaQ",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Gyro burrito and homefries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GxAmhBE1YgtazxSjsRTHaQ/o.jpg"
      }
    ],
    "user_id": "zyaQNsI73cLOKttvGnj4bw"
  },
  "WKzIkXfPxXz4J8S02Riolw": {
    "date": "7/9/2017",
    "text": "I ordered the French onion soup and got a bowl of room temperature soup with 2 thinly sliced pieces of deli provolone cheese dropped in, not even close to being melted. For $5. Yeah it's a diner but I used to get the same thing when there was a Tom's Diner on East Carson and it was the real deal. My bacon cheeseburger was huge and looked and tasted great, but I could only eat half of it before a hair wound up in my mouth, and it wasn't mine. The French fries were good but I'm not happy I paid $17 for some fries and half a burger.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lmmn0kOvNNZlmk7odPLe4A",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. I pushed the cheese down hoping to melt it a bit more and wound up with this.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lmmn0kOvNNZlmk7odPLe4A/o.jpg"
      }
    ],
    "user_id": "8gr6eWhSXTcWfxk-GCOohw"
  },
  "N98IV-YmdzWHmimY94AKIg": {
    "date": "5/14/2019",
    "text": "Toms Diner seems to be a staple of Dormont, no question about it. It's an actual \"diner\" red booths, white and black checkered floors.. actual diner! They also have booze! Cool right?   Their menu is huge, and their selections are awesome. Plenty of vegetarian options but also tons of meat, including gyro!   Very large portions, and super sweet and attentive service.  Parking can be tricky, there is on street and a lot to the side so bring quarters.   I love Toms Diner and can't wait to come back f",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5yYUtS6qLlX9qylZMIjziA",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5yYUtS6qLlX9qylZMIjziA/o.jpg"
      },
      {
        "img_id": "lwFavim7cAjU3JFMPLsXvg",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Large menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lwFavim7cAjU3JFMPLsXvg/o.jpg"
      },
      {
        "img_id": "fI0ZyefeRF5j1Sty-DEerg",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Veggie omelette and gyro &amp;amp; eggs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fI0ZyefeRF5j1Sty-DEerg/o.jpg"
      }
    ],
    "user_id": "q7kb0GVCWOdORhOrRfkxbw"
  },
  "Uwe4tuJ6jK30cYQ_pl4h8A": {
    "date": "6/24/2019",
    "text": "Have been going to Tom's Diner for a while now and have witnessed many changes.  Pros: The best thing here is the spinach pie. Best spinach pie ever - crispy, creamy and ample spinach. Also, the gyro meat is very yummy. Highly recommend the gyro platter or gyro omelet. Also like the sandwiches, esp the Reuben. Most of the menu is served for less than 10$ which makes it one of the more affordable diners.  Cons: The various salads are less impressive because the salad portion is not good. The cheese has very little flavor and the lettuce is mostly ice berg and many times not fresh. Last time I came here some of the lettuce was slimy and brown which made the salad difficult to eat even after I carefully picked out the slimy portions. I informed the waitress (and even showed her evidence) but was offered no discount or any compensation. I would offer more stars if I did not have that experience.  Changes:  They aren't open 24/7 anymore and they do not sell the pies or fish sandwich that they once did :( Also, they improved their spinach pie by 100%.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5ceGc69gmoX1PZBXUwI7QQ",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Gyro salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5ceGc69gmoX1PZBXUwI7QQ/o.jpg"
      },
      {
        "img_id": "RlPLwp4t24FaF1y8lhO2NA",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Slimy parts of the salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RlPLwp4t24FaF1y8lhO2NA/o.jpg"
      },
      {
        "img_id": "HjABiXUoKArtJZ_mw3t0TA",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HjABiXUoKArtJZ_mw3t0TA/o.jpg"
      }
    ],
    "user_id": "cgecfJZ46npwKX2iOIbVWg"
  },
  "l6lrFbj708UFs0ssrr2RZg": {
    "date": "11/17/2018",
    "text": "I've been coming to Tom's for at least 10 years and I've always had consistently 4-Star or above experiences. It's a homey diner with plenty of seats, friendly staff, and solid food choices - definitely one of my favorite places. While they aren't open 24/7 anymore, their hours are good and you can always find something tasty to eat no matter what mood you're in.   Yesterday, for breakfast, I got the gyro omelette, which was large and delicious and came with potatoes and toast. My partner got the Greek Benedict and really enjoyed the feta. Aside from breakfast, Tom's is one of my favorite places for late night snacks - gyro fries and pizza sticks are always a good choice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tdGGgpsrwHuQPQEazls1qQ",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Greek Benedict",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tdGGgpsrwHuQPQEazls1qQ/o.jpg"
      },
      {
        "img_id": "oV1B7Qpq-ktlWKr2M3RVoQ",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Gyro omelette",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oV1B7Qpq-ktlWKr2M3RVoQ/o.jpg"
      }
    ],
    "user_id": "mAOD3ynoKuxI6gqLP8k7qw"
  },
  "QliMJ163tYBkgRjFpgHdsw": {
    "date": "9/9/2018",
    "text": "This quaint little diner takes you back in time to the '60s with its decor. It took a little longer than we expected for our breakfast to come out, but it was with the wait. The home fries are not heavily seasoned which made them delicious. I had the Greek Benedict and my brother had the Vegetarian Omelet with wheat toast. This was a great recommendation from our friend which we happened to have found beforehand!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-jHuvzOqDK_AwBVmwUIpQw"
  },
  "t_hwYYbIHtlCZ33LuXWFUg": {
    "date": "3/15/2019",
    "text": "Great spot for breakfast any time of the day. They have other food too but my favorite is the Greek burrito. It has gyro meat and tomato with egg and gyro sauce. It's so good!  Typical greasy spoon but with better food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "daVGGqJb8oJC_azW5Cx4XQ"
  },
  "beyGvTOnG1AelRoXe1W7rw": {
    "date": "7/11/2019",
    "text": "Great diner experience every time. Have even got take out and it's just as good as eating there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3TmHLa9V6jUgcj8hRoE4Rg"
  },
  "yGE9wSjlA2GFxZD_MwTjRg": {
    "date": "7/7/2019",
    "text": "Drove here from Moon because my little brother has been craving it. Hadn't been here in a while. The menu was tiny. No Greek options like there used to be and no \"Zeus sandwich\" we tried to order food then the waitress told us they were sold out of chicken and steak. Eliminating chicken made the menu options tiny. We left. There should have been a sign on the door. Not sure how you can sell out of chicken and not tell customers before they order.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9cRTZbnM1HjY6QEOfVFQ4A"
  },
  "WHgFIHvrSye_SsT_U4YpSQ": {
    "date": "7/3/2018",
    "text": "Got the first gyro available on the menu, and fried zucchini. Thought it was alright, your basic gyro. Nothing special. Overall what you would expect from an all night diner. The fried zucchini on the other hand was delicious, great appetizer, if I were to go there again I would get it.  Great service, cheap food, cheaper beer. Grease food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jL-ydf4xB43WMNE-G4hRKA"
  },
  "vff_Ze2wmbluBZ62yECuyw": {
    "date": "5/9/2018",
    "text": "I like it here at Tom's,  it's not to bad,  I had the steak and eggs and it was good,  better then the other places I tried in the area. Plus the service is great,  if you get Poppy or Krista who's been there forever they will take care of you for sure.  I definitely will be back. Keep up the good work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VcPR--hs9Un0oWHTe4BEzQ",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VcPR--hs9Un0oWHTe4BEzQ/o.jpg"
      }
    ],
    "user_id": "s0rJ5eoGcI-gyJCmybsMDg"
  },
  "bdaj2snq8UMNoOWMgrNlIw": {
    "date": "3/10/2018",
    "text": "I have been eating at Tom's for over 30 years. I get the gyros all the time and recommend them to everyone I know. I always get them to go. I even get my son and his girlfriend a veggie gyro because they are vegetarians, and never had an issue. Last week, I went into the diner with my son and his girlfriend because my son wanted the veggie gyro that he always gets and we decided to eat in.   He went to order the veggie gyro, and the waitress (older lady with shorter curly hair, glasses which I thought get was the owner because she is always there) said I don't know if we can do that. I said nicely we never had an issue before and we always order them like that. She said \"Well it depends on the cook\". So she leaves to ok it, and comes back and says ok.  So my son's girlfriend tried to order 2 different (vegetarian) apps and the waitress says \"oh nobody prepped them so we don't have them). So ok no biggie. Then she complained about not having steaks because they buy it in a big chunk and nobody cut it into small pieces. So she says ok, I'll have a gyro like his. And we hand her the menus. Then the waitress suggests a veggie omelet. My sons girlfriend says ok I'll have that.  So the food comes and there is feta all through the omelet. (Which my sons girlfriend doesn't like) She tried to pick around it, she felt really bad but said I can't eat this. I said ok, I'm sure they will make you a new one without it since you can't eat it.  So the waitress comes back asks if everything ok (20 min later) and I said she didn't know there was feta in it and she doesn't like feta. My sons girlfriend apologized to the waitress and said can I have it without.   The waitress said \"well we will have to charge you\". My sons girlfriend handed her the full plate that she isn't going to eat and said, that's ok never mind.  So the waitress did come back 10 minutes later and said he will make you a new one.  But then it's like too late. So this review is really for Toms and the waitress.  For say 3-4 eggs and a hand full of veggies. I will highball it. 1.19/12 eggs = 10 cents and egg 4 eggs x.10 = 40 cents plus say $1 for hand full of veggies  And I know Tom's shops at restaurant depot so probably a huge overestimate.  So for $1.40 TOPS. You lost 3 customers forever. And the story to all friends and whoever reads this.   I have served since I was 14 years. Never would I lose 3 customers /+ over a few eggs and vegetables.   I hope you read this and realize what you say to customers matters. Good service goes a long way!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "92otPncl6b8jrHZ_hhCDag"
  },
  "xi-h5GXHMQjiEQFT9kOdwg": {
    "date": "4/5/2019",
    "text": "Their gyro salad (and regular gyro) is awesome. Best homemade ranch I've ever had so that's a must. Totally underrated diner with parking in the back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0iGgSkCohsOknEiIZNI1dQ"
  },
  "FG4AkNYNcVShg1a3ZjAGOA": {
    "date": "3/28/2018",
    "text": "This is a review of the breakfast at this diner.   The breakfast I had at this diner was just fine, just what I expected for the price. I got two eggs with potatoes and sausage. This was $6.45 and coffee was $1.99. The potatoes were fine, not a hash brown patty but genuine fried potatoes. Sausage was pretty standard small links. The coffee was ok, a little weak.   The diner is comfortable with a lot of tables and a small counter. There was a television tuned into the local news and the audio was on, so you could watch and listen to the news if you liked.   The service was fine and the meal came out in a few minutes, but the restaurant wasn't crowded when I went.   The one thing I thought a little unusual was that they served beer, had a couple of taps and some bottled craft beers listed on a chalkboard.   This is just what you expect a diner to be, and I would like to come back to try their gyros.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dz8CFWEWuR_4S1zlZhWCMQ"
  },
  "MZWtWshTuQUO4kJMpjLeqw": {
    "date": "8/28/2018",
    "text": "I've only come in for breakfast. The Greek breakfast burrito is the way to go. The retro decoration makes you feel like you're jumping into the 50s, and the elderly Greek lady reminds me so much of my Greek grandmother it gives me a homey feel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2X6UcBt8oCcWF1l1LGY1Q"
  },
  "jc5DiGLev_0IgW7rHyLW2A": {
    "date": "2/19/2017",
    "text": "This place is so bad. I normally would not give 1 star, but I literally cannot think of one positive. I had came once before and disliked it- but my husband wanted to give it one more try since it is close to home.  My family came here for brunch. We all had something different and not a thing was good. I asked for no mayo on my sandwich, got mayo. My brothers wings came out 20 minutes after everyone else's food which is rude. They had zero flavor. The fries are definitely from a frozen bag. The breakfast potatoes tasted like straight butter. Even the mozzarella sticks tasted like plastic.  The food in general took forever. We were here for an hour and a half. Plus, it is not cheap. Basically threw $70 away because everyone left still hungry and annoyed. I could not wait to get out of here and will never go back.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "eY8pzn82zhVO95vBi-mzkQ"
  },
  "aDt_rHvEVBWG-m9RXwH8oQ": {
    "date": "9/7/2018",
    "text": "Terrible service. Asked for a medium burger. It was well done. No apology. It took 55 minutes with 4 other people in the restaurant to even get the terrible food. Don't recommend. Go to McDonald's!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xs_FneCIfNhTLkFzFUXBYA"
  },
  "mhRmGggtnL2TVrg3TDoF-A": {
    "date": "2/19/2017",
    "text": "I used to come here just for the gyro pizza which was incredible.  However, they have taken pizzas off the menu and the whole place seems to be falling apart.  I went with my family this past weekend and the experience was terrible from the start.  Our waitress was rude and unprofessional.  The service was very slow as well.  There were 5 of us and not one of us liked our meal.  I had the Buffalo chicken sandwich.  The chicken was burned and had no flavor.  My wife's club sandwich was soggy.  The wings had no flavor.  The cheesesteak and gyro were the only 2 edible things we ordered.  Very disappointing.  Will not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "uuf3kFQcG8q5Jb0d9mbrvQ": {
    "date": "3/10/2019",
    "text": "Horrible service. No acknowledgement that we were their and sat 10 minutes to get a menu. We needed a minute to order and it took another 10 minutes for her to come back.  Another family with more people came in and ordered at the same time as us. They got their food and eat before they brought out our food. It took at least an hour to get two eggs, pancakes, and bacon orders. We were too polite to walk out when the other family got their food.  When I paid I let the waitress know that it was frustrating that the other customers came in after us and eat and left before we got our food.  She just said \"we had a lot of orders to go.\"  She didn't even apologize for the horrible wait and service. We sat down at 4:30 and didn't get our food until about 5:00.  This is the last time I will ever eat at Tom's diner.  If you want good service go to the eat n park down the street.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZM5w3pVhE8cZZghAat-X3g"
  },
  "Z1jXA6HEp8E11dDAiaV3wQ": {
    "date": "1/25/2016",
    "text": "Good ol' Tom's Diner is the place to go around 3am. Greasy diner food that will soak up the alcohol when you've had one too many. Otherwise, the food won't really taste all that great when you're sober. Because Tom's Diner use to be dirt cheap, this was my go-to all throughout high school and college to hang out with my friends either on the weekends or after a night out since they're open 24 hours. Needless to say, I've had many items from the menu. Over the years, nothing has really changed aside from the price. The food is typical of diner food and nothing really stands out too much. Some of my \"usuals\" were the gyro with curly fries or cinnamon French toast. The food here tastes mostly like prepared frozen items, reheated on the grill or fryer, served out to you. Breakfast is ok but if you're in the area for breakfast/brunch, go to Dorstop instead.   Overall, typical diner with average/below average food. Greasy food, good for drunken nights. I would give my high school and college go-to hangout higher than 2 stars if the food here didn't make me sick every single time I eat here.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LhFmqWU34urCxjvJzmFuTw",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Gyro dinner",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LhFmqWU34urCxjvJzmFuTw/o.jpg"
      }
    ],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "_kM-d-NlpXlg5IHPJPhiQw": {
    "date": "7/12/2018",
    "text": "Not good :( really really not good. would not recommend. scary and gross honestly. bathrooms were straight out of a horror story, couldn't find anything on the menu I liked so I ordered a salad..... inedible",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wYQSGDIv6HJYp4ayxa9o0Q"
  },
  "zWNDBcm5ta28aro-ScPAPQ": {
    "date": "3/29/2015",
    "text": "Tom's is truly a diner as the name states. It has the old fashioned diner feel with diner food and prices. The interior is obviously old as some booths have holes in the seats so beware if this sort of thing bothers you. The food is not overly greasy as some diner food can be. Service was very fast and friendly.  You certainly can't beat the prices as 2 of us are for $15.00.   I highly recommend the cinnamon french toast which was delicious! I was thinking about french toast all morning and this choice did not disappoint. The meal comes with a big plate of home fries, bacon and sausage which was a little too much food for me. My husband had the breakfast burrito which he liked and said would have again.   Don't come here looking for a 5 star meal but if you take it for what it is and want an old fashioned diner experience and meal for cheap, you can get that here!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "zjk-OT-S-1O2GitEyENkdA",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Home fries, bacon, sausage",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zjk-OT-S-1O2GitEyENkdA/o.jpg"
      },
      {
        "img_id": "6-LMBD5lbelU25rDA_yV-Q",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Cinnamon French Toast! Yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6-LMBD5lbelU25rDA_yV-Q/o.jpg"
      },
      {
        "img_id": "_qjJPsEe61SYTn5E-OvqTQ",
        "caption": "Photo of Tom's Diner - Pittsburgh, PA, United States. Interior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_qjJPsEe61SYTn5E-OvqTQ/o.jpg"
      }
    ],
    "user_id": "mm9WYrFhiNqvHCyhQKw3Mg"
  }
}