{
  "aQcKXE5UoyEXOsMfzTB6kA": {
    "date": "1/16/2009",
    "text": "The food is good, the service is great, the parking is HORRIBLE! This place is always packed! Brunch, Lunch, or Dinner plan on hunting for a parking spot, waiting for a table, and enjoying yourself AFTER you are seated. They have a bar, and also serve drinks at the tables. The food is great (I love their salad), and the service couldn't be better.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qd0k2uoLj1OJjVmFl5mj0A"
  },
  "Ta5rQXBBs3GgjTx7kcGqpg": {
    "date": "3/4/2016",
    "text": "So amazing. After the Shrimp Alfredo, I couldn't resist the piccoli dolce. Two bites into my dessert, I felt my pupils dilate and started getting overheated. The food was so amazing I started having an ecstasy flash back. I was with my gram so I had to run to the bathroom and splash my face with water until the trip wore off. It didn't take long. I think the MDMA high came from the initial endorphin rush from the amazing food. Would highly recommend this restaurant to friends and family!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wj5OhZQvVu4XTyhbJ22Lfg"
  },
  "2Uw2NMpImb_8Mox7OePwyg": {
    "date": "1/29/2013",
    "text": "Avoid at all costs!  They diluted my wine with water, the food was mushy, they charged me $3.25 for marinara sauce from A CAN (without informing us beforehand this injustice would be taking place)!  Typical big corporation: cut costs down to last nickel and inflate the prices so the CEO can fly in his private jet (after landing, eat at a REAL Italian restaurant) and purchase a new Bentley each year.    Visit DeBlasio's Restaurant for twice the portions; it is MUCH CHEAPER, as well.  Worst experience at a restaurant... EVER!",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "UQl5EpV2UHL1juulvk407w"
  },
  "0M6yOxVmYtoEE2-DX6Ehvw": {
    "date": "3/9/2015",
    "text": "Been going here for years, but quality has dropped dramatically.  Went a few months ago to use a gift card, and it took an hour for our appetizers to come out, and then they had to remake our entrees (their call, not ours - they hadn't even come out yet.)  Manager was nice enough to comp our bill, which we appreciated.    This weekend, we went back, as we still had our gift card to use.  Our table and all of them around us had our entrees come out before even the bread sticks and soup arriving.  Server offered to \"wrap them in foil to keep them warm until we were ready.\"    After this trip, both my wife and I had...digestive issues, to put it nicely.  Doubtful that I will go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Nm9wlOuQg0Q6vMGhKuwhg"
  },
  "VzfNS3RJTsdfyr9qZoFxOw": {
    "date": "7/20/2012",
    "text": "Adjust my vibrational frequency for I must live in an alternate universe where Olive Garden's food is quite good.   We came to this OG franchise last weekend (Kay had a gift card and her parents were willing to take care of the difference), and aside from some faux pas from our server, whom I suspect was just new on the job (we were given a discount because of his mistakes), all of us rather enjoyed our respective meals.  Their salad dressing is magic. Is it a Caesar dressing combined with an Italian vinaigrette? I did take home a bottle of it and read the fine-print. Whatever it is, each helping of greens is always impeccably coated with it sans any excess.   And it there better calamari out there? Honestly, it is doubtful. Each morsel coated in cornmeal (?) rivals the best tempura seafood in the foodie sphere. Nothing rubbery or less-than-good could be found inside each golden jacket, the creamy peppercorn sauce merely making the fried squid all the more lavish.   The deep-fried ravioli is somewhat forgettable, admittedly.   Skipping that, if the Seafood Brodetta is merely shipped in frozen and nuked thereafter, Olive Garden is pulling off the scam of the century. The broth was savory, oceanic, inebriant. Within the dish's lake of ambrosia swam fall-apart tilapia, baby scallops, shrimp, spinach, and mushrooms all of breakable in texture. unbreakable in sapidity.   Call me Marilyn Hagerty 'cause I kinda feel inclined to agree with her assessment. It may be sad that Olive Garden defeats a shocking amount of mom-n-pop eateries, but my affinity for the bottom dogs will not cause me to lie; I liked my dinners at both this Olive Garden and its sister over in Robinson.   I may not feel like \"family\" at Olive Garden, but I have yet to leave unsatisfied. Jeer me if you must.   P.S. How could I forget the tiramisu? Again, if it's already prepared and thawed, I want to be able to buy it at the supermarket.  P.P.S. There is no corporate bribery afoot here. I genuinely think Olive Garden is pretty competent at what they do. If that's a problem for you, seek counseling instead of sending me snarky messages.",
    "rating": 4,
    "rated": {
      "funny": 18,
      "useful": 17,
      "cool": 14
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "N7RtWA1J_cAco5X7v-Ugbg": {
    "date": "9/25/2012",
    "text": "Yep, it's a chain. Yep it's the but of a lot of jokes by the \"In the know\" set.  Yep, it is kind of inexplicable how long the wait can be on weekends. Yep, I know it's more politically correct to eat at a  locally-owned family restaurant.     But you know what?    I've never once had a bad meal there.  I've never once had less than top-shelf service there.  I find Olive Garden restaurants have consistently higher quality not only compared to the other franchise stores in it's price range, but also notably better than some family owned Italian restaurants I could name.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "6uJbsF_YaXqnffQpLTW47A"
  },
  "YVLOrNM08sDPYPENkQy1og": {
    "date": "8/8/2015",
    "text": "I have always had nothing but good experiences at the olive garden. I know its not \"real\" Italian food but I don't care. I love it! I was at this location most recently and had beyond excellent service. Also the portions on the kids menu are huge! My son had enough left for an entire lunch the next day",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QpsSGanjf-BiBxlQFgUh4A"
  },
  "6dEGJWniCtOA09Q9LXR1JQ": {
    "date": "8/3/2015",
    "text": "Just went on Saturday Olive Garden isn't usually my first choice  but it was really close.  The food was  surprisingly good.  But sometimes the service can really make the experience so much better and that's what happened.  I find it hard to remember when we had a server that was this good. It made the whole experience just wonderful. Thank you  Anthony it was a great pleasure to have you as our waiter  I hope you will still be there next month when we are back in Pittsburgh.   Great job Anthony !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ch7fAV6CRRtGP4LN4J4Asg"
  },
  "1jgQG-jFIsaFErjp4MurKw": {
    "date": "12/31/2011",
    "text": "I normally don't like chain restaurants, but I do like eating at the Olive Garden in Greentree.  The food is pretty good here and the service is always excellent.  Although not my first choice, still quite okay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "qY76AAPSSw6xetDy3-F3gQ": {
    "date": "4/22/2016",
    "text": "Went here after finding out another restaurant was closed. Loved the ravioli de portabello.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2rvhyf_d7uGfTGPcySVBiA"
  },
  "vSYc8jlBckcLq8o3QbmCYQ": {
    "date": "3/1/2016",
    "text": "The food is excellent here. Everything that I order here is prepared very well. The food is always hot and fresh. Out of all the locations that I have been to, I would say this one is the best. The chicken scampi is absolutely delicious as well as the chicken Alfredo. The only problem that I have experienced is paying $4 for extra Alfredo sauce. I don't believe that's fair considering the amount on the pasta was nowhere near the usual amount.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m_DKr-SpW-5-XIDTInfq5w"
  },
  "IZjiWZeiqabK8ei5azcv8w": {
    "date": "11/22/2010",
    "text": "Yeah, yeah, yeah, I know.  Why go to the Olive Garden when Pittsburgh has so many great local Italian places?  Hey, it's convenient and the food is decent.  For lunch, Olive Garden ain't bad in a pinch!   I had business to go to near the airport and I stopped here out of necessity.  I had the basic spaghetti & meatballs in marinara sauce.  Not bad.  I wish they had cups of soup 'cos the Zuppa Toscana was mighty tempting.    Okay, so I admit I like the Olive Garden.  But my husband better not take me here on date night!",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "UtkjXTiMfGRz4R1zDF3Kxg"
  },
  "wHI4DxKiegJMxizr3757xA": {
    "date": "2/9/2016",
    "text": "So I gave it another chance during the Lunch shift. Completely different experience provided by Amanda the bartender. Excellent service and great personality. She was busy but kept all the plates in the air without missing a beat. Based on this experience I will be back! Great Job Amanda!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v5BvRAAne7_F0kjgOIideA"
  },
  "gY9YAAqFtduScK7ooeuozw": {
    "date": "1/2/2013",
    "text": "For a chain restaurant this place is as good as it gets. The food is always good and even if they slip up on service they have always made it up to us by buying part of our meal or giving us coupons for another visit. Everyone makes mistakes, it's good to know that this establishment acknowledges that and they do what they can to get the customers back in the door. For example one night we were there and the power went out, they bought our meal. Another time my husband waited 20 minutes past the time they told him for curbside pickup, coupons galore. Once our food took a little longer than normal to come out, and viola half our bill taken care of. The food is always good and the customer service is great, we'll keep going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i_j5ZGg5tFR9JeK9Rx55XQ"
  },
  "uyDZLBBXd--gutUSj-upMw": {
    "date": "2/12/2014",
    "text": "Ten minute wait and easily most tables are open!!! Surprise it's lunch time!!!! I just passed six tables empty and clean. Beyond me...",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "t-TcuG_3tNaAG0XESjpeXw"
  },
  "v-avz20n5N8naylUDhfGeg": {
    "date": "6/16/2014",
    "text": "Ordered stake and soup and, loved the soup for sure, stake wasn't really my favourite but it was just okay! Service was weird thou, the waitress was told us to order while she was serving the other table; so we basically yelled out our order.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5uYNGx7PKC0RBpq3vSp1cw"
  },
  "09YXIAxP67iVHgrr7kvoAA": {
    "date": "2/25/2015",
    "text": "I really like Olive Garden but the reason why I am giving this place (green tree next to Starbucks) is that the service is not consistent over time. One time the waitress was so rude that she was throwing the food on us and hubby got his coke with no ice. I understand that it can bee too busy at times but I have been to other Olive Gardens which they are equally busy if not busier! The food here is good but I would really recommend Olive Garden in Robinson instead.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UiGSGaxsQlgk8sSmzgBMgw"
  },
  "kccLL-ajPPBpxvm2U2ussw": {
    "date": "4/2/2011",
    "text": "I hate Olive Garden. It makes me laugh when they ask \"how is everything?\"  I wonder what goes through their minds when I say \"The microwave did an awesome job\". I'm in town for a few days, I'm hung over and don't know where else to eat. Olive Garden is just gourmet ChefBoyArDee. You won't find me at an Olive Garden back in New Jersey!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "0xb0hITzxvM0WuCfauU7vw"
  },
  "KnlZEGY8bzm9m639OTxIJQ": {
    "date": "7/5/2014",
    "text": "Moderate food, was not too impressed at all; i served better at other locations of olive garden, in other states!waited 50 minutes",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qo2SKcqJ8b17TSwM66ti-Q"
  },
  "OFaqbSdoJXh6oGugqPEPgQ": {
    "date": "9/25/2012",
    "text": "I love their unlimited soup, salad and breadstick for lunch special!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5uQ4cH3QvER-Z-nI0SbXVg"
  },
  "Wwyzzcir_l7BGIe5EzyvzQ": {
    "date": "6/15/2012",
    "text": "I ordered food that I believed was gluten free.  Within twenty minutes I started to have symptoms and was sick for two days.  I believe that my food may have been gluten free but that cross contamination caused my problem.  I had the same experience at another Pittsburgh Olive Garden restaurant and so am concluding that they may not be careful with cross contamination.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "e7PzAePo7m2snRqNY7mttA"
  },
  "iehact7lYtnpXVAdjSASzQ": {
    "date": "12/18/2018",
    "text": "My wife and called a head to Olive Garden for seating. We were told if you do that you wouldn't to wait. We get there and are told it would be 15 mins. Just like anybody that just walked in. WHY HAVE CALL AHEAD IF YOU JUST MAKE PEOPLE WAIT THE SAME AMOUNT OF TIME IF YOU JUST WALKED IN. We went to another restaurant! You want my business fix this!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "v56Nr3gh2ZY9AoCMJ5xy8Q"
  },
  "2LVLKW92-CxcO85bud0hPQ": {
    "date": "3/28/2018",
    "text": "My friends and I frequent this location for lunch, but the last 3 times we have visited the experience has been less than pleasant. The service has been awful. The waitresses we have been helped by have appeared annoyed at our requests, and as if we are bothering them. The food has been ok, except when my friend ordered chicken and shrimp due to her special diet. She was told that it would be an extra 5.00 for any portion of the salad, and the food she received was cold and late with no apology. Although we have been coming to this location a lot, based on the last 3 experiences we are unsure if we will return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "gKU45Tq9JJ9Z7HiZChu3ew"
  },
  "HY5OvPaCw8zVvlvS86VG1g": {
    "date": "12/4/2017",
    "text": "Restaurant was all right.  Soups and salads were very good.  We did need to ask the manager about using a gift card that the waitress said wasn't acceptable any longer.  The manager used it, thank you. And the suggested gratuity includes tax:  Tax should never be included in the gratuity.  This is a common error In restaurant calculations, we are finding. Use your own calculator when figuring gratuity.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8g_iMtfSiwikVnbP2etR0A"
  },
  "PEe1lKWA7j8E4mRj6zgG_Q": {
    "date": "6/11/2018",
    "text": "Always a good place and good food. Less waiting for a table here than were I am from. Waitress and crew very nice and helpful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gt3NKrEGZZz3RaQFi7v3Vg"
  },
  "Y2yPugC9qJ4BrC-SxEA72w": {
    "date": "5/30/2018",
    "text": "This is probably the one restaurant in Pittsburgh we have never had an issue with. We are always seated right away and the waitstaff is always excellent. The food is always good and what you expect from OG. This is the main location we visit but we have also been to other OGs in the area and the service and food is always good. I know some don't care for chain restaurants but I think OG is the best of this category. This location in particular is great. We never hesitate to go there. Highly recommend if you want good service and good food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ml4xy-ox_PCjfk39E07aMg"
  },
  "hRDC_tJHZMWjoid9DBqlDQ": {
    "date": "7/17/2018",
    "text": "My experience today was fantastic, I give 3 stars bc I often come here and anything outside the bar area is awful. The staff outside of the bar all act like they hate their jobs, it's so depressing. Also, first time sitting at the bar area I found out I could have a second soup because my server asked me if I wanted another without  charge. I understand things can be overwhelming and mistakes don't upset me, it's the attitude. 90% of the staff has bad attitudes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iob7ZbPf0miVLRmAtrDuIA"
  },
  "Uub3nurv8ngbm6252p34qw": {
    "date": "1/18/2014",
    "text": "Go during  week for specials. Place is normally crowded but takeout is available. Staff is friendly and will cater to your wishes. Food is usually good. Never had any problems.  Since this is a \"chain\" restaurant you will find one almost anywhere you go. It is great for groups as well as family. My favorite is the eggplant parmesan. They do give unlimited soup or salad with your meal. Be prepared to take food home with you.  Place is clean and kempt. It is one of my favorite places to eat when I get the opportunity.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "PmOJkC9ZoupLt0z6rT_jkg": {
    "date": "9/7/2017",
    "text": "Gross.  Yes I know what to expect with OG, not authentic, chain, etc.  However, it still used to be a reliable place to get a satisfying meal, and my kids like it.  I went last night and ordered the spaghetti and meatballs (I stick to the basics here; not ordering seafood or anything fancier).  The meatballs honestly had a chemical taste to them.  The marinara sauce was also not good.  The waitress brought us dipping sauce for the breadsticks at my daughter's request (and I don't think she charged us for it), and it was a different sauce than was on my spaghetti, but was also very odd-tasting.   The waitress was fine, but had a phony, sickly-sweet demeanor that was off-putting.   I overheard her return to a nearby table THREE times to tell them that what they ordered for dessert wasn't available (like, 3 different choices were unavailable).  I mean, they don't have a huge dessert menu; shouldn't they at least have everything?  It was a Wednesday evening, not a super-busy weekend. The salad is still good, as are the breadsticks, but they get dry and you really need something to dip them in. They were having the \"Buy One, Take One\" promotion last night. I asked the waitress about it, since I was ordering one of the \"eligible\" meals for it, and she said it was \"pretty much 70 cents more\" to get the BOTO.  Well, no, the spaghetti was $9.99, and the BOTO was $12.99.  Nevertheless, I ordered it, figuring I'd have lunch and dinner the following day for only $3.  The whole promotion sort of feels like one of those products that are advertised on TV (think Sham-wow), that they can't sell and start giving you one free each time you order one.  Like they're just shoveling bad food at you to get rid of it and at least get some revenue. The total cost for my daughter and me (two BOTO entrees, two sodas) was over $50, with tip.  Too pricey for this restaurant!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LkXtD65G6IPsjnrHOol-CQ"
  },
  "B4hxU6JxN-6OAbXsm7OAJQ": {
    "date": "5/17/2016",
    "text": "Watching my calories like crazy and I couldn't be happier to have the Olive Garden accommodate my low calorie lunch! Ordered the Chicken Piccato dinner for lunch. It's 530 calories and comes with two pieces of chicken as well as zucchini in a bread crumb and Parmesan crust. Oh. My. Goodness.  It was delicious. I couldn't believe the size of this meal. I was legitimately full after only eating half of the meal and a serving of Minestrone (110 calories).   I am very pleased with Olives Gardens calories for their light menu options. I look forward to returning. The service was excellent. It far exceeded what I previously expected from this restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Jk0AcqPCVMfc_DTWO3SzwA"
  },
  "BdDygRpclhC5sGW7P1MBeA": {
    "date": "10/2/2016",
    "text": "It tastes good, but it's not authentic Italian food. They are very professional: good service, big portions (you can repeat soup and salad), good bread as courtesy. I like their Fettuccine Alfredo and minestrone in special. We went there a lot of times and there was only once the server wasn't very nice. We like their food in general and the price is fair.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "omurcMm91c2y-c79OmSMiw"
  },
  "nPIvy-RIm2hbJsLosCVFEw": {
    "date": "10/23/2017",
    "text": "It's the typical chain Italian food restaurant, but received service and meals that were expected.  It's pricey for pasta but the salad and bread sticks make up for it. Entrees came out while still working on salad, but no big deal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PZ-VprErn8LpuSsh6JnYbg"
  },
  "xOsSl0hsTIbUUriyNAYx6w": {
    "date": "4/23/2017",
    "text": "This review is only for take out service, not the food. Poor service. Order suppose to be ready when I came in and waited 15 mins after waiting 15 mins the server tried helping someone else first. Very poor. And while she was busy, 4 of her co workers did nothing to help her and just stood and  talked about going home.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PzNcdJaz0ld6TaTD43S4cw"
  },
  "jSM5mLer9cn9r-gwOJNONw": {
    "date": "5/14/2017",
    "text": "We had to wait 30 minutes for <a href=\"/redir?url=http%3A%2F%2Ffood.My&s=c988a2f9654bcb941b7f6c01b67c9690e66e236ee3d1a18c8e76eb29d096bfa6\" target=\"_blank\" rel=\"nofollow\">food.My</a> Grandson didn't get his drink for 20 minutes. My wife's food had Bacon in it when she requested no bacon..the waitress got money for check and assumed that my 17 dollars change was a tip. We had to tell her where is my change and she had someone else bring it over 10 minutes later. My wife didn't eat at all didn't want to wait 20 more minutes to eat..horrible job on mothers day.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YB7dcmGBVlvmMZBpOA2v4Q"
  },
  "zFaD1NBQ5BgFbFyewdBeAw": {
    "date": "7/31/2017",
    "text": "This Olive Garden is consistently high quality food wise. I can't say I have ever had a bad meal here. And the staff is top notch. Have been to this location frequently and will continue to come.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XrGO5v7UekI-belOHLImdA"
  },
  "ylxdBmyQJ9CgAaJaAUDmvA": {
    "date": "3/7/2018",
    "text": "They kept people moving while waiting for a table which was great. Server was very nice. Food was a little slow getting out but the salad held us over. Overall this is a great location and runs smoothly",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qss6ruXoCLvj3OTyfxtIMQ"
  },
  "E8wKIj85G4UocpOutJd-EQ": {
    "date": "9/9/2015",
    "text": "Went to the Green Tree Olive Garden for their Buy One-Take One special.  Their Salads and breadsticks are the only real reason to go there anymore...!  All of their menu items are frozen, sitting in a freezer until you order them, then they're pulled out, microwaved and served.  I mean- if I wanted to eat microwaved food- I'd go to the freezer section of my grocery store and shop there.  Seriously- if you want good breadsticks & salad- go here... but that's the only reason.  I'd rather take the extra time & make real pasta at home, using my own sauce...",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "vD2HML4pseH8-0HH3CrWzA"
  },
  "t2U8AKASipSoLoaOOSSKQA": {
    "date": "1/21/2017",
    "text": "What I like about this location:  the staff is GREAT, VERY good service. The menu is standard as per the chain but always done well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hqCCI4v-2ozjyIUXNzFLKg"
  },
  "AJRvanw2P-2MPb6F9KHZ1g": {
    "date": "1/27/2014",
    "text": "Being born and raised into an all Italian family, I'm pretty darn picky about my pastas and gravy (tomato sauce for the unknowing). My great grandmother's sauce was the first I remember, she never opened a can to make her sauces, always using tomatoes she canned herself in mason jars. She simmered her sauces until every seed melted away. My mother's sauce was a bit more thicker, using puree and paste as a base, later adding whole peeled tomatoes, garlic and fresh basil. Her sauce cooks down to a velvety pasta sauce that should be jarred and sold on super market shelves.  Sorry on to my review of Olive Garden. seriously? Really? No! I will admit it's good in a fit of really, REALLY needing a pasta fix, or if you want to eat breadstick and salad. But the sauces are overly rich, and I don't mean the tomato sauces. I mean the sauces they put over the pasta with chicken, beef or fish. And, let me be real Italian here, pasta is NEVER the main meal in an Italian supper, Pasta is normally the first course and NEVER served with meat, including MEATBALLS. Thats as American as fortune cookies. after pasta, comes the protein, that includes meatballs, then finally salad.  Okay, I'm done being a snooty Italian who looks down upon Olive Garden, I got out all my frustrations on you, my readers. But seriously, if you want good Italian food, hit up a REALLY good neighborhood, family owned Italian restaurant. The service is better, it will be cheaper and it won't go to a big conglomerate who over charges on a plate of pasta, which is one of the cheapest food you can serve. Oh, two stars for a pretty good bowl of Pasta Fazoo (pasta and beans).",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "UsmTxWbobLsI6WR1Db0W7A"
  },
  "0_LrYW_p_I_HyC90gbD9Yg": {
    "date": "2/20/2015",
    "text": "The waitress is very nice and professional. The food tastes great and fresh. I went here before but today is better than my first time. My daughter likes the spaghetti with tomato sauce.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tfBWPgfOsSe0ti8AwKuMWg",
        "caption": "Photo of Olive Garden Italian Restaurant - Pittsburgh, PA, United States. Pappardelle pescatore",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tfBWPgfOsSe0ti8AwKuMWg/o.jpg"
      },
      {
        "img_id": "6rmzqQT6NbWUeMc2lOXFmA",
        "caption": "Photo of Olive Garden Italian Restaurant - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6rmzqQT6NbWUeMc2lOXFmA/o.jpg"
      }
    ],
    "user_id": "eCMNH1mNWlnHUCYb2jlgiQ"
  },
  "ko-PpGD_qDxL-TdJZBnGmA": {
    "date": "11/6/2014",
    "text": "well it's Olive Garden... nuf said!   Who doesn't love olive garden??? I think maybe once or twice in my life have I bothered to get an entree. I prefer just getting a drink and chowing down on salad and bread sticks.   I was so happy when this location opened up. It meant we didn't have to trek all the way to greentree.   Now i'm back in Spain... I could really use an Olive Garden here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h-Xe17qy0CRx4AZavazJiw"
  },
  "3JDucXIKkBm_O6nad1gblQ": {
    "date": "7/18/2019",
    "text": "If you've been to one Olive Garden, you've been to them all in my opinion. If you haven't been there, this is a chain restaurant which serves up many classic Italian dishes and more.   Each meal is served with soup or endless bowl of salad. I highly recommend the salad which has their signature Olive Garden dressing topped with onions, tomatoes, black olives, croutons and pepperoncini. I've enjoyed many dishes and haven't had one I hate, however, the eggplant Parmesan is greasy in my opinion and I've had better elsewhere. They have great lunch options too which are lighter making overeating less likely! While I typically prefer a mom and pop non-chain restaurant. Olive Garden is a reliable choice which you can find in many cities and get a decent meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OmE3avigUkcT45UtBTmREw",
        "caption": "Photo of Olive Garden Italian Restaurant - Pittsburgh, PA, United States. Lunch fettuccine Alfredo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OmE3avigUkcT45UtBTmREw/o.jpg"
      },
      {
        "img_id": "yvzza_fCpDOIwOuDjod2wQ",
        "caption": "Photo of Olive Garden Italian Restaurant - Pittsburgh, PA, United States. Salad!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yvzza_fCpDOIwOuDjod2wQ/o.jpg"
      },
      {
        "img_id": "Rz0EXM8TS2bBjKd0Y6vjBQ",
        "caption": "Photo of Olive Garden Italian Restaurant - Pittsburgh, PA, United States. Parmesan Zucchini and chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Rz0EXM8TS2bBjKd0Y6vjBQ/o.jpg"
      }
    ],
    "user_id": "mm9WYrFhiNqvHCyhQKw3Mg"
  },
  "WwaIHezM-pN6_pBMehHUHA": {
    "date": "6/21/2019",
    "text": "It saddens me to have to write this experience,  but this was one of the most horrible experiences I've had a Olive Garden.  We were celebrating my cousin's birthday, and he was so disappointed by the time we left.  We had a server, Tiffany, and she was not very attentive.  We had a party of 8, in which I didn't think it should have been as difficult as she made it.  The restaurant was not busy at all, and there were so many empty seats all around us.  When we were seated, our drink orders were taken and we decided to put in a few appetizers.  She wrote them down and came back 20 minutes later with only one drink!  Then she proceeded to take our dinner orders, and stated the drinks will be right up. 10 more minutes later she finally brought the other seven drinks.  We are sitting there hungry, waiting for soup/salad, apps or something, and then 20 minutes later she decided to bring our soups and salad.  It took almost an hour for soup and salad?!?  She never asked us for refills on the drinks, instead she brought a pitcher of pink lemonade, yet nobody ordered pink lemonade.  We just chalked it up and kept waiting.  So here we are, 1 hour 15 min later and finally the appetizers come out (only 3 lasagna frittas).  They were disappointing because they were not hot and the sauce started to settle and harden, which tells me they were done for a while sitting under a lamp, and then she finally decided to bring them to us.  So here we are 1 hour 40 minutes later and the entrees come out.  The mashed potatoes were cold, but the chicken was hot.  She brought another pitcher of pink lemonade, hence no drink refill order taken.  It was such a disappointing experience.  Finally, my family get their take home orders and they were were incorrect and overcharged, so she had to adjust the bill.  Finally  I think the worst is over and I'll avoid this place going forward, but I was wrong.  We split the check 3 ways among our party, and my card was charged twice.  I'm thinking my it just a hold and once it settles, it will fall off. -wrong.  First it was charged in the wrong amount (higher than what I signed for) and then it posted twice.  So now I'm out of almost $100 until the manager resolves this.  I called on Monday and it's now Friday and my money still has not returned.  Never again",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3_vA1a2QlK6jUcPsRkHdyg"
  },
  "rabOj7dEctBIk3QGlsGJ5g": {
    "date": "8/6/2019",
    "text": "Worst server ever. Never smiled, drinks took 40 minutes.  Very haphazard service.  Waited a long time for refills.  Food was good.  It was a family gathering of 7 but the restaurant wasn't busy, she just didn't seem to care.  Her nametag indicated Mich as her name.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yrCH4VrIt6EnicxJSCpRNw"
  },
  "kZTNgtQJwOuf7fu_2-nNKA": {
    "date": "8/5/2019",
    "text": "Terrible food, just don't go. Bar ok, service ok, food terrible!  Previously pretty good, managers are 12 year old lost in spaces",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5PUspNAwuz7fZqiEln2F5A"
  },
  "NCoR3ya8cuFmez9QLdzJ6w": {
    "date": "7/20/2019",
    "text": "I frickin love HERBY, the FOOD, the people!!  Yet, it is time after 20 years to upgrade your bathrooms. Every time I go in I slip on the floor of grossness (and No it was not just mopped). I almost want to report to ACHD. It is only a matter of days (hint) before I fall and....well you know",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfeZWFjuTqexbz1Z9sAdqQ"
  },
  "ap8DXtmNSPkiZ484powQWA": {
    "date": "10/10/2018",
    "text": "I went solo for lunch yesterday.  Right off the bat, I got a creepy vibe from my waitress.  She kept staring into my eyes without blinking as she talked.  It was weird, like she was waiting for me to answer some unasked question.  Of course, there were a few questions she did forget to ask when she stopped over to check on me.   \"Would you like some more iced tea?\" once or twice, would have been nice.  On to the food... Salad was absolutely drenched in dressing.  Wilted lettuce swimming at the bottom of the bowl...so sad. I ordered spaghetti and meatballs because I had a craving for Italian after checking out Alla Famiglia's menu.  Which I hope to get to next week.  The food Olive Garden was very disappointing.  The meatballs has some sort of crunch on the inside when I bit into them.  Not sure what that could be...maybe I don't want to know.  Also they were flavorless.  Spaghetti was just ok, but the marinara sauce was very watery and there wasn't enough of it.  Overall pretty disappointing experience at the OG.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-0Xu57zrI3Rxi8wGZsnWKQ"
  },
  "0E1UutXV6AbIM6KWPsIJcw": {
    "date": "6/25/2019",
    "text": "Had a great experience on fathers day. We had 6 adults and 9 grandkids. Olive garden is not one of my favorite places but my daughter's wanted to go there.We had seating for 15 . Our waittess was fantastic some of the best service I've had and I eat out a lot. Took drink orders arrived within 5 min . Very attentive refills extra bread sticks . Interactive with kids she was great.food ok.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IO43ecN1bWPLD12eaw3wcg"
  },
  "oYGYs0bULZD9SzprybQ5dQ": {
    "date": "10/6/2018",
    "text": "Typical Olive Garden good food Great service great location right off of 376  however we haven't been here in a while I feel like the prices are getting a little expensive for a chain restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hqscQv8mLiqlBg9BVCNHdA"
  },
  "aW0x3uqZ-FepXxDBlDrUzQ": {
    "date": "3/30/2017",
    "text": "I have to say The Greentree Olive Garden is one of the nicer versions of the chain in our area. Back in the day the one at Village Square was it for me. Menu is the same as all locations but service is miles better here.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "xtpO0QKahwatSs6LEn8BJg",
        "caption": "Photo of Olive Garden Italian Restaurant - Pittsburgh, PA, United States. Breadsticks.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xtpO0QKahwatSs6LEn8BJg/o.jpg"
      },
      {
        "img_id": "AK4VW5PgU8Li8LhfKrSesw",
        "caption": "Photo of Olive Garden Italian Restaurant - Pittsburgh, PA, United States. Chicken gnocchi soup.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AK4VW5PgU8Li8LhfKrSesw/o.jpg"
      },
      {
        "img_id": "AIcsnb-p5zyyxOgkcAaa0g",
        "caption": "Photo of Olive Garden Italian Restaurant - Pittsburgh, PA, United States. Salad.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AIcsnb-p5zyyxOgkcAaa0g/o.jpg"
      }
    ],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "hKQUTJa0Ys-QqCxaBfCknQ": {
    "date": "9/28/2018",
    "text": "Just an overall GREAT experience at the Greentree Olive Garden! Wonderful service! Excellent food!! Just out on a evening date with my sons!! We kept talking about how great everything was! Also a manager stopped by to check on us!! Superb!! Dayla G was our outstanding waitress!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mk_dCcI-tbz11sGQXPuT0Q"
  },
  "7Psjguz5UJ5pkyoASzA_BA": {
    "date": "12/30/2016",
    "text": "I love me some Olive Garden - always have. Yes, I'm very aware the food here is as American as apple pie and not authentic Italian in the least. It's not a secret, and I've always enjoyed Olive Garden for what it is and nothing more. I'm particularly fond of this location since it's usually a little less crowded than the one by the South Hills Village Mall. I say usually because the last time I was here the place was paaaaaaaaacked. Apparently Tuesday nights are the night for pasta in Pittsburgh now?  In case you didn't know, Olive Garden recently(ish) overhauled their menu and cooking styles, and I've really enjoyed eating at Olive Garden since then. The best addition for me has been the creation of lighter fare dishes, which are what I usually order now. The chicken and tilapia piccata dishes have become my go-to items - both are served with parmesan-crusted zucchini, and both are prepared in zesty sauces that compliment the protein and don't ruin your calorie counting efforts for a month.  But of course, the salad bowl and breadsticks are still a staple here, and they admittedly kind of ruin all my healthy eating efforts after I order those healthier main dishes. But I could never skip them - not when they're such a key part of a meal here! Once I add in those, it's more like I'm ruining my calorie count for the week at worst. And...that's admittedly not a terrible price to pay for those beloved breadsticks!  Consistently good service and tasty cocktails are the cherries on top of a place that I've always been fond of. One day, I'll be back ready to splurge on one of those pasta dishes - but until then, piccata dishes it is for this girl!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "JeQdjZhkxlVNtthVgKDASQ": {
    "date": "8/26/2017",
    "text": "I honestly come to Olive Garden because I know I am going to get pretty good meal here.   We ordered the create your own pasta ( angel hair, shrimp, alfredo)  and the chicken and shrimp carbonara. Both means we're very hot and pretty good. There was plenty of meat and lots of sauce. The Alfredo was a little bland but with some extra cheese was better.  We also had the unlimited salad and chicken gnocchi soup and they were both great.  The best part of the experience was our server Edwin. He was super nice and attentive. He was already there when we were looking for him. He did an exceptional job.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AKMRMIIPSHzp4KD76Z9Tgw"
  },
  "2MXLypJWJ0EaNmRwPgNUjg": {
    "date": "5/1/2018",
    "text": "4/30/18  I ordered yesterday.  I ordered an eggplant sandwich and a salad.  I was kinda disappointed that it came with fries:-(  An order taker who listens to your ordering a vegetable sandwich and salad should warn of the fries, but it didn't.  I was at least happy that they put ketchup on the side.  It came in a nice big compostable paper bag.  The salad was not the best.  I trashed the soggy tomatoes.  The black olives were good. What really messed up the salad were the rancid croutons.  5/1/18  The eggplant sandwich was good so I ordered it again today.  I asked for them not to put the garlic and salt on the top.  They did, BUT they also did NOT give a side of ketchup:-(  I am a ketchup lover so I came home and opened a new bottle of ketchup.  I had the sense not to order the salad.  I informed the ladies at the counters that the croutons were rancid.  Hopefully this will prevent you from getting the rancid croutons.  I got the Pasta Fagioli soup and it was WAY better than the salad.  The price of this light lunch is good. $7.48 all in.  You also get (2) breadsticks.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cSw5a_GcSiBR6xukfRuqGw"
  },
  "oeB1i77Xujk3R8ZBcMs2Nw": {
    "date": "3/17/2019",
    "text": "The food was good; however the seat was dirty and the service was terrible. The order never went in and we had to wait so long for our food. They left dirty dishes in the table way too long even though we had them stacked where they could easily get them out of the way. The server barely apologized for our almost two hour dinner or made it up to us in anyway. We were told the manager would be over and he/she never came. Disappointed with this location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XTQ6MXr8Xt0V6ssvclom9Q"
  },
  "hZ5KvkYs5d_yG1RpmQFfHQ": {
    "date": "2/24/2019",
    "text": "*Dirty seats *Smelly Water *No silverware  *Pay money for a plate?! For real!  This is probably the worst branch of Olive Garden I have ever been to. The person who took us to seating arrangement did not even clean the seating area before inviting us. There were food pieces on the seat and a crayon! I had to call that girl back from front-desk to get it cleaned. I took two of my friends for a farewell dinner. We ordered Chicken pasta and Shrimp Scampi each with a side of salad. The server lady arrived with 2 plates and a bowl of salad. When I asked for a 3rd plate, she said sorry maam, you have to add another salad if you want another plate. Are you kidding me?! We decided to ignore her stupidity and managed with plates provided for bread. Then came the smelly glasses of water. It was so smelly that we had to ask the sever to return it and replace with new water. A basic glass of water should not be that complicated. Second set of water arrived, still smelly. I guess they need to take a look at dish cleaning department.  Little annoyed with this event, when we decided to start on salad, there were no silverware served. My friend walked up to front desk to ask for silverware. Such poor service! These kind of blunder can be avoided by just placing silverware before placing the guests. Common sense!!! I still ended up paying a tip as she had to change those smelly glasses of water so many times, which the cleaning department should be blamed for. Never coming back to this place again!  Smelly water, no silverware and you have to pay money to get an extra plate. This place/staff needs training!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HS6geJLjaxo3hJABIbchhA"
  },
  "0SI4D7Zz9kTO2I6XjxlaSg": {
    "date": "2/6/2019",
    "text": "I'm writing my review as I sit here, having this train wreck of a meal. My server has absolutely no idea how to do her job. I don't say this lightly as I've worked in restaurants for the past 25 years. I wouldn't normally eat here, but my kiddo got to choose dinner tonight, so here we are.  1. Sat here staring at my food because I wasn't given silverware to eat it with.  2. Unable to wash the food down because our drinks were also forgotten (not refilled, didn't get them until after my entree arrived).  3. Forgot my child's entree. I was already finished with my plate (I took my time), before the server realized that she never brought my daughter her food.  4. Has no idea how the \"endless pasta\" thing works. Told me she didn't think that I could order something different than my first plate. Wrong again.  5. Forgot drink refills and soup.  6. Wears so much perfume I can literally taste it.  7. I was overcharged on my bill.   I'm sure I'll remember more after I leave, but I won't be back again. I would have expected a manager to have shown up by now either explaining this was her first day of her first serving job ever, or for Ashton Kusher to pop out telling me I've been Punked.  I'm still going to tip 20%, as this isn't really her fault. The blame falls on the manager for this one. He or she has put someone out on the floor that is obviously not ready, and isn't doing service audits to make sure they know their job.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "22CM050AamhkgpioDJscoA"
  },
  "s945pmzW4njxENLjIpGf0g": {
    "date": "1/9/2019",
    "text": "I would avoid coming here during the week around lunch. This place gets very crowded and the service has been slow on multiple occassions. Food is your typical OG food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "EY6WLcVqEnEX0Wb8f7DjzA": {
    "date": "4/4/2019",
    "text": "I get that it is a chain restaurant but they really need to make something in house. You can tell that everything is frozen from the soup to the dessert, the sodium wow. I gave them three stars because the service was good. If you like sodium then you like chain restaurants then this one won't disappoint.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fmvx4i1Q8ZGMlGxhgZytuw"
  },
  "aQ-uZeWTnfuQwl577ytPQQ": {
    "date": "11/20/2018",
    "text": "in the middle of eating my meal and there were just plates piling up next to me. multiple people walked around swerving in between the tables and the dirty plates and didn't do anything about it. a host sat 3 tables and two servers walked by without even acknowledging dirty meals next to my face. it was absolutely so disgusting and I was planning on giving this two stars because the food is always good, but there was a hair in it. on top of everything... the service was really bad and all of our soups were cold for something that was \"fresh out of the oven\"",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D-qsGDOAHAJOeEFXUKC7Vw",
        "caption": "Photo of Olive Garden Italian Restaurant - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D-qsGDOAHAJOeEFXUKC7Vw/o.jpg"
      },
      {
        "img_id": "sINl9i5iL7l_w39pmEHXbQ",
        "caption": "Photo of Olive Garden Italian Restaurant - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sINl9i5iL7l_w39pmEHXbQ/o.jpg"
      }
    ],
    "user_id": "gYexxWAO8lim61U31T6jpQ"
  },
  "jI1XCBk5I6s8IqD5OF9Msg": {
    "date": "12/21/2018",
    "text": "Haven't been here in a while and boy things have gone downhill food wise...  First why does this place smell so bad? Especially when you first walk in the door? You expect to smell Italian food smells, but it smells more like dirty mop water.  The service was not bad, but the food was horrible.  I don't remember ever having to beg and wait for a few olives on my salad. The soup was very salty and flavorless, and my sandwich was sad... barely anything between the bread.  I'd ordered the same lunch item in the past, but it was actually very good before...  It is very hard for them to make any changes or adjustments to items because, as I was told, everything is pre-made and frozen.  The sauces are flavorless and not even as good as what you get from a jar at the grocery store.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QoOGHG74rPY78IAw3Pk9dw"
  }
}