{
  "6DaNP72IXFHxxQizU_uvgg": {
    "date": "6/22/2017",
    "text": "The good: service was pretty quick and polite. The beer selection was respectable, and prices were reasonable. I really liked the onion rings.  The bad: food was completely mediocre. The sesame bun was definitely the best part of my burger, but I don't feel like that's something to be proud of. The beef was overcooked and no longer juicy, and while the toppings I chose were adequately spicy, nothing seemed to be all that flavorful.  The ugly: I ended up with a hair cooked into my burger. I can usually forgive something like that (accidents happen), but since the burger wasn't that great anyway, it just made the whole thing even more disappointing.  My verdict? You're better off walking up the street to Five Guys.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rP50hYXnPEfJFUb49_2BAw"
  },
  "ukFXCkEj68wQnXacLiBWlg": {
    "date": "3/18/2016",
    "text": "I've been here quite a few times and have tried something different each time. I have not had a bad experience or meal yet. Thus far, I've tried the chili (it's spicy!), burger, chicken wings, curly fries, and chicken tenders---all delicious and flavorful. The service is usually quick, and you can definitely find a game or popular event playing on multiple screens while you're there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7e4JJEe4vVxjeecor1lN6g",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Oreo Milkshake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7e4JJEe4vVxjeecor1lN6g/o.jpg"
      }
    ],
    "user_id": "UyXqGEKod-veD6m6Hq0EDw"
  },
  "twcmw4rcFl81loEnAdEqvg": {
    "date": "1/12/2018",
    "text": "Meh.. I guess it's just another mediocre burger place in Pittsburgh. Would probably give it a three star if I didn't get the terrible stomachache from their shakes.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EU5dSjk-UzILTp5kcg-dOQ"
  },
  "F7rGtThaDicZEh_qeeYhhw": {
    "date": "1/5/2017",
    "text": "While in Pittsburgh I was told to check out Fuel and Fuddle, which is next door. It sadly was closed. So Stacked worked instead.  They do a build your own burger with a big variety of options including a veggie patty. You check off you choices and they'll bring it all out. They also have a good variety of other choices, appetizers, sides and a good beer selection. Food was tasty and I was happy with the second choice. Service was good too, prices were reasonable.  That said ... We witnessed a small mouse wander across the dining room and nobody seemed very concerned. So I do hope that is not a regular occurrence.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8gYDk0qh586uzePzzU763g"
  },
  "32qlzVi_jNJi4MNVEQh6Og": {
    "date": "10/24/2016",
    "text": "Our service was fabulous! The food...was decent. However, to be honest, if I'm looking to build a burger (which is the primary part of Stack'd's menu), I'll probably to go back to Burgatory. While the offerings here are solid, the product wasn't a good as Burgatory's imo. That being said, it's a nice addition to the Oakland restaurant scene, especially for students who aren't likely to make it out of the area. If you do go, I highly recommend topping your creation with their Ghost Pepper Cheese. It is NO JOKE and I loved every scorching second!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "-ARdx8hOcEWlMDjzwLYZ_g"
  },
  "j-P6UC4nujjJWE1vo75Ipg": {
    "date": "5/3/2018",
    "text": "Had an AWFUL experience here. First off, my coworkers and I were looking forward to a happy hour here but by about 10 minutes into it, all of us were EXTREMELY upset. Food was decent for a fast food place in a college area. But the service here was atrocious. This event was back in September and I still cringe - and I don't think a single one of us went back since our \"happy\" hour. Waitress consistently rolling her eyes when she walked away from our table (don't think we can't see...), rarely came to check in on our table. Asked us for drinks ONCE - come on, lady we could have ordered way more from you but instead you decided to complain to the bartender in the back and curse about our huge group. Yes, we heard you while we were at that bar in the back, because you never came to ask if we wanted to order another drink. Please be a little more professional, especially when customers are closeby and can hear what you say. Yes, we were a larger than normal group but we were not rowdy by any means. We are all working professionals in our mid to late 20's and too exhausted from work to be causing trouble on a weekday. We did have something new to order each time you DID actually come, but isn't that the point? It's not like this one bad review is going to keep underaged college kids from coming back here and keeping this place in business, but I do NOT recommend",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M0YTvLhWhuUCa1BQ-v4-6g"
  },
  "iNArq7SNY_QqkKrsVaH_JA": {
    "date": "8/22/2018",
    "text": "Great place to watch football and hockey games. There are large TVs all around and the atmosphere is lively especially when school is in session. Very good happy hour and daily specials, although it is disappointing that the veggie burger isn't included in the half off burger night. The milkshakes are amazing, would love to see a dairy-free one in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QiKx7uHY4g4Xp0X2YmL73Q"
  },
  "pHgVTg3WG-o9TdlHcpiCJw": {
    "date": "9/18/2015",
    "text": "This restaurant opened literally 4 hours ago. Keeping that in mind, I know they will have their opening day kinks to work out.   We opted to sit at one of the tables that over looks Oakland Avenue. We quickly learned that this might not be such a good idea for the night time. The drunk college students walking to Forbes from the depths of South Oakland were pretty annoying as we were trying to eat.   My server is actually in one of my classes and she was pretty excited to be working at Stack'd. This made the experience a little bit better overall just because of the personal connection I had with her. In terms of service, 3 or 4 people were assisting our table which led to confusion in terms of if we had ordered, if we wanted a refill, the check, etc.   I ordered the buffalo parm chicken tenders and was pretty satisfied with the them overall. They were decently sized and coated in the sauce just how I like it. I would have liked a bigger cup of ranch.   Both me and friend created our own burgers from their extensive list of options. They were pretty big and tasty. I ordered a double stack, kaiser roll, ketchup, mayo, mustard, pickles, and fried mozzarella cheese sticks.   Not bad for their first night.   4 stars.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "-YKqjTg8cYIbj1vwyu_vtA",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Build your own burger with old bay fries.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-YKqjTg8cYIbj1vwyu_vtA/o.jpg"
      }
    ],
    "user_id": "Pe5eoZvuQYif9-jPfrFSTQ"
  },
  "mAqYtyRkHzr_5Ao0hdooWQ": {
    "date": "12/2/2015",
    "text": "I'm kind of disappointed.  The space Stack'd now occupies had been empty for about a year now and it is a prime location in Oakland.  This was a chance to really 'beef up' the Oakland culinary scene and I think they've fallen short.  Like all the new trendy burger (or brgr, BurGR, or whatever hipster name you want to give to a BURGER JOINT) Stack'd has the checklist of ingredients down to sauce and condiments and type of burger for you to custom order.  However, there is no wow factor.  I've been here twice now and have ordered slightly different versions of the [same] burger and I wasn't knocked off my stool.  Speaking of stools, I'm not overly happy with the set up.  There are a couple booths and tables but mostly high tops with bar stools, which, doesn't really make a comfortable lunch experience.  If I'm on a bar stool I want a beer in front of me, not my lunch.  I will be back because they are new, and my options are repetitive for lunch, so I am keeping my fingers crossed that a wow factor happens in the meantime.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYTpi63Tv_UTjsaTMCZUvg"
  },
  "eK7aEFFf_v7rmqjdkIfY2w": {
    "date": "12/4/2016",
    "text": "Solid place to grub. Did some build your own burgers, one veggie and one regular. The burger was solid, not greasy and flavored very nicely. I had the wheat bun which although was pretty dry it was a good choice. Veggie burger was better than most places I've tried, it's a good choice for a vegan or veg eater. Fries were good but salty. Tater tots were good. Shakes looked tasty. Pretty solid draft list. Would definitely return again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tpLWXsk3Uyx_qyxcN_tEA"
  },
  "nYjnlhxtqtBdAaBOa6Y9BA": {
    "date": "7/7/2016",
    "text": "This isn't a full review as I stopped in because a friend I was with was hungry. They are on a busy block close to a college. Service was nice and polite. Sports bar themed and there were some TV's all playing sports themed shows and games.  I only ordered the salad but you can basically build your own burger.  I will be back when I am in the area again.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 5,
      "cool": 6
    },
    "photos": [],
    "user_id": "l0MBP2olaZc5_SP5nWTCWg"
  },
  "qSLewVXhBw6lUCly5hwf6Q": {
    "date": "10/2/2015",
    "text": "I did not know that this is not a real \"new\" restaurant. They have another location in Shadyside, one that I have never been too. Still I love myself a good burger so we went. They have overtaken the old Joe Mama's aka Olio restaurant. The inside is super nice. Smaller than both of the old restaurants but still nice and new.    When we got there, a little after 12 pm it was packed! It felt that all of Oakland has been waiting for this place to open and they all were in line today. Good news, we got a table right away. The idea of the restaurant is that the piece of paper/menu took your order and you just filled it out and gave it to the waitress. That was fine. I think that the burger/topping selection was nice, but it was a little expensive for extras. You got four toppings for free---I picked the usual lettuce, tomatoes, onions, and pickles. Anything after that was a $1 charge. You are telling me that adding grilled peppers really would cost $1?? That seemed a little out there.   The service was lacking. We ordered some fried pickles and when they came out, no silverware or napkins. We dug in but had to wait until our actual order came to get the silverware/napkins. Also the fried pickles are not a large order. I thought for the price we would get enough for the three of us to share, it was sorely lacking. Seriously the pickles were good BUT the serving size was enough for maybe one person. Sad-face for sure because I love fried pickles.   The burger was huge when it came out. I should have NOT picked the 1/2 lb burger. I don't know what was wrong with me, it was two patties and it was super filling. I picked the ghost pepper cheese. IT WAS HOT but only when you could taste it. The burger was also done really well. I enjoyed my lunch for sure.  I also ordered the Cajun fries. Word of advice, don't bother. They were shoestring fries with a little bit of sprinkled on Cajun seasoning. The seasoning did not even cover all of the fries!! it was like dashed on a lot in some places bare most of the others. The fries were also super soggy. Yuck. My friends ordered the curly fries and they looked SOOO much better. Next time, that would be my choice.   Back to the service. When we got our burgers we were told by the waiter bring them out that he would get us more water and our napkins/silverware. We got the napkins/silverware but no water. I had to ask a waitress walking by if I could get a fill up on the water. Not good....  Growing pains for sure. The food was good and hopefully the next time I am there they will have things worked out.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hietrA8M58asfpyJkCyiA"
  },
  "jEDwck_QcSSNrujthc5PtA": {
    "date": "5/6/2018",
    "text": "Ordered takeout online and when I went to pick it up all the lights were shut off and doors were locked! They werent supposed to close for another hour!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WnSyjBl5USE5hRoR8Ge9iA"
  },
  "g0anKciPiqLAkvKXRogypA": {
    "date": "4/16/2018",
    "text": "My daughter took the college tour at Pitt. We asked the girl who worked in admissions where to eat that wasn't a chain, good and casual. She suggested StacK'd Burgers. It was the perfect choice. We really enjoyed our pick your topping burgers...my daughter picked mac and cheese to top hers! Good burger, glad we went.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cdXYuVcK4Be-Pu2QyflrMA"
  },
  "PKNrVI0m464LfvTdtJ4nHg": {
    "date": "10/1/2017",
    "text": "The is one of the few restaurants where I've never had a bad experience. The burgers are always delicious and properly prepared.  I'd highly recommend this place if your in the need of a tasty cheeseburger!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_0VV7cBRUo822hXRy6QIQg"
  },
  "6YybroghoLoYqVkPARkXxQ": {
    "date": "9/1/2017",
    "text": "This is a cool place to go for a fun burger. It's literally like ordering sushi but for burgers. They give you a sheet of paper and you make your own burger. You can stack even 6 1/4 pound patties 12 slices of cheese! It's their \"stacked challenge\" if you wish. There is lots of fun ingredients not just the basics. For example you can add fritto chips, potato chips, jelly, pesto aoli, peanut butter and so much more ! And if you are not in the mood for burgers they have other fun appetizers like fried ravioli or fried mac and cheese, soups, salads, milkshakes, etc. The service was super quick and friendly. I would definitely go back if I ever go back to Pittsburg in mood for a juicy burger.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q7mRnu5rdJM3v-QAppsbWw"
  },
  "FlDOKy2-89puNm-iNbMiQw": {
    "date": "4/25/2016",
    "text": "I recently watched the latest Pens game at the Oakland Stack'd location and was pleasantly surprised by a good experience overall. One would think on a beautiful Saturday during a playoff game that it would be impossible to find a table at what is basically a slightly cleaner than average sports bar, but it was maybe 60% full and we could hear ourselves talk the entire time. We had quick and attentive service and our orders arrived having been prepared correctly. Once again the food, atmosphere, and clientele of Stack'd never wows me, but it's a solid 3-star place and I'd definitely come back for a very reasonably priced meal during a hockey game if given the choice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zPwZQEVmFg9cbmsEwLpA6g"
  },
  "SdEUr6kP5G0umVfc-G1MLg": {
    "date": "5/5/2018",
    "text": "Poor interface with the ChowNow app. Over the phone the manager Michelle was particularly bad at dealing with complaints to her point where she hung up on me.  The one provided meal of two orders was fair. Can they count to two ?  Maybe not. Awaiting feedback from their central website. As an aside, the beer lines are foul. I don't think they are keeping up with their commercial obligations for line cleaning or possibly they don't get alot of throughput with the beers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kva91wxOeVh7Bcji8tILKw"
  },
  "A8mJSe0qv73MXfx1Ykfi-w": {
    "date": "2/6/2017",
    "text": "Stack'd is the exact type of place that I love to grab dinner and drinks with my friends. I have tried many items on the menu and I am never let down. My personal favorite appetizer is the pretzel twist and the fried perogies. For my main meal, I either get a burger or a chicken breast wrap and get to change it up with whatever toppings I can think of.. Plus the curly fries of course. Me and my friends have gone at 9pm for Half off Burgers on Tuesday often, and many of them never miss it. The food is always exactly how I asked for it and I have never been disappointed by any experience here, which is why I always come back. The atmosphere is awesome and the people are great.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "f9a95S1VRowU1Imyf3WOwA"
  },
  "G484-omkMVeogHjONcgRaA": {
    "date": "8/31/2017",
    "text": "These burgers are awesome! One of the Best burgers I've had. You build your own with a huge list of items to chose from .Service was great, restaurant was alive. Prices are great, would highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V4NqSDCbJV79eP1DlObnQg",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/V4NqSDCbJV79eP1DlObnQg/o.jpg"
      }
    ],
    "user_id": "9KSICHZ5XsZD3NU9FVsUlw"
  },
  "zCXfJLBY1X9Otm9FhixTZw": {
    "date": "2/16/2019",
    "text": "This was the best food i have ever injusted (and then digested). 10 out of ten reccommend to a friend and please go here if you want to get lucky later.  She will love you. Forever.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xGa5leEJRmAfVGfo4iTZtg"
  },
  "qrTRYf3EB_LyQznqiSuVoA": {
    "date": "12/28/2017",
    "text": "Very decent burgs and shakes for reasonable prices, plus friendly service!  Foodwise I think Burgatory is still better, but if you're in this area instead and looking for similar grub this is a solid choice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s_WbkW4PP4GaJD6XSZ0XTA"
  },
  "yrfd2LlC2ZNx8gJx4sl7UA": {
    "date": "9/12/2016",
    "text": "After spending a few hours at the Carnage Natural History museum I was in the mood for some bar food and a beer Stack'd hit the spot.  I enjoy being on college campuses, always good energy. This location is in the heart of U of Pitt. I ordered the 1/4 burger and then proceeded to use the nifty order card to build my burger. Lots of expected and unexpected topping and sauce options really made it a fun challenge to find a good balance of flavors. My burger was awesome. I tried the ghost sauce, banana peppers, potato chips, blue cheese...etc..it all worked. As well I got a picture of Lite beer from Miller for $7...sweeeeet. Service was very good and helpful in assisting with the burger build. The restaurant had the typical college feel (decor/smells/music/furnishings) that I feel a certain comfort in...some things thankfully never change.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "U_Tw9JsNkz01el0SYp6FLg",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/U_Tw9JsNkz01el0SYp6FLg/o.jpg"
      }
    ],
    "user_id": "AM2R1e_Vga6knU_ZdRmedA"
  },
  "edcqSXgdX_Krm8UABG4CGw": {
    "date": "6/15/2018",
    "text": "Been here twice and the food is very tasty! I truly love the customization ordering system that is much different from the traditional Five Guys or any other burger place. The burgers are tasty, fries are fresh, and prices a quite reasonable. Both times that I've come the place was super packed, but the service is always quick none the less which was awesome! I can't wait to come back the next time I am up at Pitt.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rhSWhXi2O0gSNJ9HmlmIvA"
  },
  "196IB7Q3PC2bP1Lhu4rcbw": {
    "date": "1/14/2019",
    "text": "I would recommend never eating here. Food poisoning! Presumably someone in the kitchen isn't washing their hands. I ordered a burger with bacon, avocado, pickles, and field greens. I received a burger with field greens, literally 2 pickle chips, no identifiable bacon, and it looked like an avocado had been wiped on my bottom bun as there was a slight green tinge, but no real avocado. The waitress didnt come back until I'd eaten 3/4 of it about 20 mins later, so no real need to complain at that point. Slow service, mediocre burgers with no topping you ordered, and food poisoning the next morning. Burgatory prices, but far from Burgatory quality. Truly disappointing on all fronts.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NPYPKTEeXNv-Epi-1T-3BA"
  },
  "eLrOCwzBWc4uUp3WDMQdkw": {
    "date": "8/12/2016",
    "text": "My friends and I came for lunch. I had the veggie burger with the Thai Chili sauce and a bunch of other toppings. I liked the concept, but the veggie burger was kind of gummy. I also couldn't taste the Thai Chili sauce, but I wonder if it was overpowered by the hot pepper relish I got. All of the ingredients tasted super fresh, and our server was very friendly. The food came out super fast, too, which was great, as my friend needed to get back for work. It was also super affordable! I had a good first Stack'd experience overall and look forward to trying other burger combos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "B21hklVb1ZH-swi-Patt4Q",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Veggie burger close-up",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B21hklVb1ZH-swi-Patt4Q/o.jpg"
      },
      {
        "img_id": "_u2fnJ5aeIxWZDTcopT0VA",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Veggie burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_u2fnJ5aeIxWZDTcopT0VA/o.jpg"
      }
    ],
    "user_id": "e7MEzEQMjqNPZfYthZKhwg"
  },
  "0NUYAEP6ff0VhiDIWQI8qA": {
    "date": "10/28/2017",
    "text": "I think the best thing this place has going for it is their beer selection. I've never been wow'ed by any of the food here. Everything is fairly average. They do have decent evening specials to draw in college students on a budget.  There are definitely better bars and better places to eat in Oakland (insert Fuel and Fuddle here)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z3f78GereM3pspS5Yqjlqg"
  },
  "TscLPC-jrNLMIS-jdo3Hmw": {
    "date": "1/9/2019",
    "text": "We were super disappointed with our burgers since this place has such great reviews. The menu looks amazing with tons of options for your burger but the burger is dry and flavorless, no seasoning at all. The buffalo potato skins ONLY tasted like hot sauce and both of our appetizers came out warm (if that). I'm just going to stick with BRGR, we had a much better experience there. I really thought I would like this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X1mqOgoOJ6dMNu00DUbJ6A"
  },
  "nRQ2sqJYScmlaTeNJfl4BA": {
    "date": "4/29/2018",
    "text": "Not sure what the big deal is with this place. I got a veggie burger with the fixings and sweet potato fries. The sweet potato fries were pretty good, and really the star of the meal. I'll pass on the burger.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IQsF3Rc6IgCzjVV9DE8KXg"
  },
  "vuayhVCfP1O6PJ7v1QCp7Q": {
    "date": "6/24/2018",
    "text": "Here in town for a visit to Pitt.  Place came recommended.  Decent burgers, reasonably priced.  A variety of draft beers and my son enjoyed his milkshake.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t4aPMC2Iaqo-z_vCyLI5rg"
  },
  "JgXOY1FsOGRfbHT6Q4c1Aw": {
    "date": "9/22/2017",
    "text": "First time I was in stacked. I really enjoyed it. It was a nice breezy evening so they had the windows pulled open so the atmosphere was nice. The music was club like since it was around 11pm on a college campus but it wasn't packed at all. I ordered a burger with garlic onion and mushrooms with pepper jack cheese on ciabatta bread with fries. The burger was cooked perfectly. I probably wouldn't order the ciabatta bread again since there was a lot of bread left over that the meat didn't touch. The salad I ordered as well was really good and for the price...it was excellent. Next time I am in the mood for a side salad I will come here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mA3tALTzmDunDRctGEu-wA"
  },
  "_kjcX9CxbBs6bwJfZgkzrw": {
    "date": "12/13/2018",
    "text": "You don't have a sophisticated palate if you don't think the burgers here are amazing. That is all that needs to be said. Check yo taste buds.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "imtN9fKt_77cvu7NbeFXfQ"
  },
  "SpChwzGjEf8JDKK0FM0W-Q": {
    "date": "12/11/2016",
    "text": "Me and boyfriend tried this place out after hearing so much about through friends. If you ever eaten or heard of Burgatory, this place is set up like that expect for its in a bar environment.  The waiter we had was great, very attentive and sweet. She was completely on top of things. The food and drinks we great as well. The best part is that the food is really inexpensive.  We both agreed we would definitely go back there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_mEO6YXCCgNe2WC5dmg3MQ",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Buried treasure a specialty drink for $7",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_mEO6YXCCgNe2WC5dmg3MQ/o.jpg"
      },
      {
        "img_id": "HKm3cX7Yb8L5tmNdRT8YRA",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Mozzarella sticks with marinara $7",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HKm3cX7Yb8L5tmNdRT8YRA/o.jpg"
      }
    ],
    "user_id": "eyvl9CohZK3FZB74OY_hYw"
  },
  "Zc3fxkT9ONOFZcMyUbLK8g": {
    "date": "5/27/2017",
    "text": "Build your own burger is the most ideal burger dining situation, especially for a vegetarian eating with meat lovers. The pic is a friend visiting from FL and his build-a-burger. (He conquered it.)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YiqNgQ_BA1dziR4sKYM2Qw",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YiqNgQ_BA1dziR4sKYM2Qw/o.jpg"
      },
      {
        "img_id": "-QxFNhPTcl5RWsVn6ypRvQ",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. He came. He saw. He created and dominated.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-QxFNhPTcl5RWsVn6ypRvQ/o.jpg"
      }
    ],
    "user_id": "YVSwljwOF00opGQzoJ6UCA"
  },
  "aZYLOpKQSNF5eUfXHXD7ZA": {
    "date": "5/5/2018",
    "text": "Burger was great and the wait time was pretty sure even during busy hours. The staff was quick to get my order and greet me. Everyone was super friendly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YSlyg715f11-BgPUXjC73g"
  },
  "DNFm0F4HNFU7sCm2t9Lazg": {
    "date": "1/28/2016",
    "text": "Some coworkers and I stopped in for lunch this past Wednesday. We arrived around 12:40pm and surprisingly, the place wasn't very busy. Our party of 5 was seated right away. Our server was awesome- very attentive, filled our waters quickly, all of the orders came out correctly and she separated our checks without an issue. The host on the other hand, was very odd. He never asked how many was in our party, never even said hello.. just started walking over to the table with napkins and menus. Just odd.   What's interesting about this place: the menu is also a card in which you check off what you want to order. One side consisted of salads, appetizers and quesadillas and the other side was \"burgatory style\" if you will, where you choose everything from your meat, bun, cheese, toppings, sauce, etc. I ordered a chicken sandwich with pepper jack ($1 just for the cheese- it was barely noticeable on the sandwich & therefore I would probably just skip it next time), wheat bun, field greens, BBQ sauce, caramelized onions, grilled mushrooms and hot pepper relish ($6 for the sandwich). I added tater tots for $2 more. The food came out quickly and everyone was happy. The portions were huge, the food was tasty.. we were full and happy by the end.   Overall, this place was really good. It reminded us of Burgatory except a LOT cheaper. We had a great experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "FqYQGZP1pK6mREWh1-th3w": {
    "date": "4/22/2018",
    "text": "Really nice customized burgers! Additionally, the milk shakes are pretty good, with crushed Graham crackers in them. The pricing is very reasonable, so I would recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GAk19r1r6jzlR7sM1HeDRQ",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. pretzel bun",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GAk19r1r6jzlR7sM1HeDRQ/o.jpg"
      },
      {
        "img_id": "VKD_8oOXx5lvZvEvsAWwQQ",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. strawberry cheesecake milkshake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VKD_8oOXx5lvZvEvsAWwQQ/o.jpg"
      }
    ],
    "user_id": "BZFnb8yf5gsyLEJKZlw84Q"
  },
  "HiQzEC1xAZD52fsNamDwrQ": {
    "date": "6/15/2017",
    "text": "Despite mediocre reviews, my husband and I ducked in here for an early dinner during a torrential downpour. And Stack'd fully met its mediocre expectations.   Pros: -Cheap beer! The house beer is only $3/pint and my husband liked it very much. My first choice was not available but $4 Blue Moon drafts will do when you're grumpy and hungry and wet.  -The onion rings are delicious. Best thing we got, hands down. Beer battered and cooked perfectly.  -The \"spicy beer cheese\" that comes with the soft pretzel  twist is definitely just nacho cheese, but it is still delicious. The mustard is just so-so.   Cons: -They have a hostess station but it is not staffed, which means we had to stand around while literally dripping wet until a waitress showed up to seat us.  -My \"Cajun turkey burger\" with \"Cajun aioli\" had no apparent Cajun seasoning. I piled it with stuff and it still tasted like unseasoned cooked ground turkey. -My husband's half pound beef burger was admittedly better, but came with a long hair cooked into the meat. -My tator tots were undercooked and totally unseasoned. My high school served better tots, which is an incredibly low bar to meet. -It was only 4:30, but it was so dark in there that I had to hold up my menu to the windows to read it. It was storming so the natural light was dim, but still. Guys, your cool light fixtures can take more than 15 watt bulbs...  In summary, the beer was cold and the burgers were edible (minus the hair) but *definitely* not worthy of taking home leftovers. When the Mexican hole-in-the-wall grocery store up the road serving taco meat out of an outdoor cart outcooks you, you can probably try harder.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HDryBEF4q9ykujvw6IZt1Q"
  },
  "Q0SWblaomSclkNg2awKibg": {
    "date": "5/15/2017",
    "text": "I was pleasantly surprised.  I went around 1 on a Friday and the place was relatively empty (students are out of school so I figure that's why).  I ordered a grilled chicken sandwich with toppings I chose and a side of fries.  The food was made relatively quickly and I really enjoyed it. I like the idea that you could come here and order whatever you want, however you want.  I thought the fries were also really good, not super greasy or salty - a nice in between.  I'd definitely go back as the price wasn't too crazy, it's a solid place for lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "agGWDhkVvIHaf8w16jLTng"
  },
  "ci5MKK1-lwPZ5WVNFcFM4A": {
    "date": "1/30/2017",
    "text": "My first visit here was great! I had the chicken fingers with mango habenero sauce, celery/carrots, and blue cheese dressing. The chicken tenders had an unusual breading which accompanied with the mango habenero sauce was like a sugary/spicy glaze. I really loved them. The tenders are not made in house, but the sauces are. I was here for a late lunch when the place was pretty dead. Despite this my service was great. It is not unusual (particularly in a college bar establishment) to receive shitty service when dead. This was not the case. Loved it. Will definitely be back. Wish the Panthers basketball team was doing better!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nDS68-Z9x21817kgKECNcQ"
  },
  "GlIEa_bXKFFdOB-5Rqcikw": {
    "date": "1/23/2017",
    "text": "A great place to grab a burger on Forbes. The burgers are customizable and fun to make. I am a fan of their cajun turkey burger. I usually get a kaiser roll, turkey burger, fritos, hot pepper relish, field greens, tomatoes, and spicy ranch. The first four toppings are free and I have found that is usually enough to make a satisfying burger. The fritos always add a crunch to any burger. The hot pepper relish also adds a nice kick to the burger.   I have also gotten their Stack'd 1/2 pound burger and its two fat patties. The patties don't have a lot of flavor and were a little too thick for my liking. Their veggie burger is also not bad, but more on the squishy side being made mainly from black beans.   Sides are not included, but I usually get the curly fries. Overall, a nice place to satisfy a burger craving. Be prepared to wait as the restaurant is pretty small.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "r4yJJ2FTfhnBFKlhzU_jVQ",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Turkey burger on kaiser with hot pepper relish, Fritos, field greens, and tomatoes with spicy ranch!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/r4yJJ2FTfhnBFKlhzU_jVQ/o.jpg"
      }
    ],
    "user_id": "gofnmwo5ptoEnQI47zCBYg"
  },
  "g_Ts1kzvzekGfZcGdpQMJg": {
    "date": "11/16/2017",
    "text": "No restaurant better deserves the 3 star rating than this one. I would say that Stack'd is unequivocally and perfectly average.   They do cheap, unexciting burgers and have all the usual suspects on tap. Sometimes they mess up your order, but you can't really expect better so you accept it and move on with your mediocre day.   Nevertheless, this is a bar that will always be there when you're not in the mood to try anything adventurous or to stoop down to fast-food. Stack'd always hits the spot, but nobody really gets excited about coming here.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zdpn-MrLT_QPhwJ5-KHKCA"
  },
  "M2ZgsWWbfYTc-bRapobtJQ": {
    "date": "9/2/2018",
    "text": "Had a really good experience here a couple of days ago. We ordered BYO burgers, which were cooked well and were quite tasty. I was very pleased with the blue cheese crumbles used on the burger that I ordered, and my companion was happy that all her toppings managed to stay in tact, even though they tend to end up extremely messy in other venues, though we were both disappointed by the fact that our sauces were barely detectable on our burgers. We also split a chocolate peanut butter milkshake, which, at first I was concerned that our waitress had forgotten, but in fact, it comes as a dessert, so that was alright. Flavor of it was fairly decent.  Our server was fairly attentive as well, and I was also pleased with the fact that during our visit, two Beatles songs played over the PA system. That always earns extra points from me. It's not the top place in Oakland for me to eat, but I couldn't complain about my experience here. Food and service were both very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ry4atEgXsi28sKFDGiVVw"
  },
  "aLe6Dj-41XxU3cjto3NNWQ": {
    "date": "6/26/2018",
    "text": "Stack'd is a pretty good place for food and drinks after work. Parking can be very difficult to find, but that's what you expect of Pitt's campus. I think their onion rings were the best food I've tried there so far.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ESnESVKHXkV3_EurRK1xpw",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Drinks!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ESnESVKHXkV3_EurRK1xpw/o.jpg"
      }
    ],
    "user_id": "HBt4GwewBIUSanmvaUHmGw"
  },
  "FIWWlQU9NB2RmrauEuIRZQ": {
    "date": "3/19/2019",
    "text": "Great place for burgers especially on Tuesday nights. Great value for money and tastes good unlike shake shack.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zcj2B3_rAi-zr8PN9teJ2A"
  },
  "0KK4j2bfqDbV43kcUrPYtA": {
    "date": "7/9/2018",
    "text": "We (4 adults and 2 kids) visited this place on a Monday night around 8:00 pm. We sat ourselves at the only table that was available and waited 20 minutes until my friend approached one of the servers and asked her if she could take care of us.   During the whole time we were completely ignored by the two female servers that were working. Granted it was busy, it is common courtesy to acknowledge the customer but  we even had to go get high chairs for the kids because apparently none of them wanted to take care of us. I suggested to leave as other people who were also ignored left, but it was already late and we decided to stay.   Funny part was that as long as 4 guys walked in the door, the server was right there on the spot!  The food took a bit long to come but it was good and it was expected as the place was busy but that's the only reason I'm giving two stars and not one.   Needless to say, service needs to be improved. My friend also said she had been there before, and because her daughter broke a glass by mistake, the server threw the bill on her and walked away when they wanted to order more stuff.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-VpVhPj9XcWJ6VigeRD-Bw"
  },
  "wnR2aL9wYjphI7ezW7P_qA": {
    "date": "9/24/2018",
    "text": "It was hard to find parking and it's not really big. They serve mostly burgers they do have a lot of options but I really wasn't impressed by the burger there a little high priced. They do have a bar and are right next to the hospital and college so if your a college student it's a nice place to hang out. It was also to crowded and noisy but to be fair I'm older.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3xBFFH866WoySDG7uuwBSQ"
  },
  "FPTZ8VcY-0oWafa31qVSlg": {
    "date": "8/10/2016",
    "text": "Stack'd is the newest business to take up the old Joe Mama's space in Oakland, and while I am no longer a Pitt student I do occasionally eat in the area. Per recommendations of a family member, I recently went to Stack'd. During my visit the place quickly struck me as the poor student's Burgatory. You sit down, you get to make a custom burger, you write your name at the top of the list of burger toppings that you requested...and they serve a few milkshakes to boot. The biggest difference between them and other custom burger joints is ultimately the drink menu. Whereas other burger places typically offer a menu with special shakes and cocktails, here you get to pick from a couple basic shakes and beer, beer, or beer.  Did I mention this place is located in a college town?  Anyway. I dined here with a friend, and we split an order of pierogies in addition to ordering our own burgers. Though slightly overcooked the pierogies tasted ok enough. The same could be said of the burger. Really, my favorite part about the meal was my side of fairly tasty curly fries - an item that many burger joints do not offer. Definitely a point in Stack'd's favor!  Overall my experience here can be summed up in one word: OK. Stack'd is clearly going to be more appealing to the diners who actually live in the Oakland area nine months out of the year versus general city goers - especially with their late night cheap burger deals. They understandably have to balance food quality with college area pricing, so the phrase \"you get what you pay for\" can definitely be applied to them. And for what I paid, I got a decent dinner - but as a non-college student, I'll admittedly be happy to splurge on more expensive burger places in the future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WumPU_ak5RHv8GhkSeHpLQ",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WumPU_ak5RHv8GhkSeHpLQ/o.jpg"
      },
      {
        "img_id": "pXkdfMr4dkAt8tPfY9_Q8Q",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pXkdfMr4dkAt8tPfY9_Q8Q/o.jpg"
      },
      {
        "img_id": "87FF64bGSPNKkEG2hlNUag",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. That drink menu screams college town!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/87FF64bGSPNKkEG2hlNUag/o.jpg"
      }
    ],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "nyu_Pjxr8y7bHvDbAR_a4w": {
    "date": "7/17/2017",
    "text": "Before I report my latest experience, I should say that I was here four times in the past and I had the Thai chilli flavored chicken tenders during those visits. Ofcourse, they were delicious and I went back multiple times for the same reason.   However, my latest experience was a disappointment. Food is average. Because of this, I am not giving a 5/5 rating. This time, I placed a to go order for mango habanero chicken tenders and Cajun flavored basket of fries. I had these items at stackd shadyside in the past and I loved it. But, I am utterly disappointed by the taste and quality of both the items at the stackd on Forbes avenue. The fries are bland and the chicken is very oily and at some point the smell of the tenders was overwhelming.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bmSuFvdMyF66PDUZr9VfoQ"
  },
  "Cf49FQAmdBp8JJ_BvI1RoQ": {
    "date": "12/15/2018",
    "text": "Really good restaurant! First time here decided to stop in before our trip to Phipps. Our waitress was really nice when we told her it was our first stop in she explained how we can build our own burgers. Really cool and interesting restaurant I will be back in !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q3kq8Tx9wdCUfOexGQtAEQ"
  },
  "7FpfJ4TwMjhj0EgD8USJQg": {
    "date": "5/29/2017",
    "text": "As a Pitt student, I frequent Stack'd fairly often. However, this particular visit was quite different - my friend took up the burger challenge. As you can imagine, it turned out to be a novel experience for us. Stack'd is normally generous with portion sizes, but nothing could have prepared us for this massive burger, plate of fries and milkshake that needed to be finished in 30 minutes. My friend conquered almost all of it except for a small portion of the milkshake, which was on the thicker side. That challenge required some serious skill! I would really recommend checking out this place if you're in Oakland, they have nice food and fairly light on the wallet. Their vegetarian options are also good - I normally end up with limited options in terms of burgers - but Stack'd build your own burger gives me room to switch it up a bit.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2ZGwaITTNu_0wCXpBJy1Tw",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2ZGwaITTNu_0wCXpBJy1Tw/o.jpg"
      }
    ],
    "user_id": "7sZr0UOvrL7xbv7XbQp-Lg"
  },
  "2sN602KY7V4zvGoRLQ4EeQ": {
    "date": "10/30/2018",
    "text": "This restaurant always gives excellent service, even when it's very busy. They always get my order right and the quality of the food is really good. They have gluten free bun options and they're actually good buns. 10/10 would recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q6VjAjGHu6I293bigWbJQA"
  },
  "VZwEH7-tikm8L9aciFv67A": {
    "date": "4/11/2017",
    "text": "Stack'd brings an active and fun vibe to eating popular American foods---burgers, fries and wings. The customisable burger menu is pretty cool, as you can literally mix and match anything. As a fan of spicy food, the wide selection of hot sauces and miscellaneous spicy toppings made me very happy. The wings are also really good, and if you're into something savory and dry, go for the jerk! For the burger, the meat was cooked very well, and the presentation was amazing. The burger was stacked nearly, as the restaurant name suggests, and all the toppings were put in masterfully. Nothing was noticeably spilling out and clearly forced between the buns. Overall, I had a fun time and hope to bring some more friends to hang out here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "E_Tn0sw7VITjyexDHs-EVg",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Mango habanero and Caribbean jerk! Loved the flavors",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E_Tn0sw7VITjyexDHs-EVg/o.jpg"
      },
      {
        "img_id": "W6X3NcvRJ1EhgbGwWBfucg",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Beautifully stack&amp;#39;d",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W6X3NcvRJ1EhgbGwWBfucg/o.jpg"
      }
    ],
    "user_id": "RTTMsplbxNb61fujtFz23g"
  },
  "R4FkfEh94iso6lKF_ifHLA": {
    "date": "11/20/2017",
    "text": "It was OK burger place. It was kind of nice that you can completely customize your burger. We got an order at the fries as a starter which are very nice and crispy. I asked for side of honey mustard I wish they just sent a little more mustard. Overall the experience was positive and the waitress was very nice. She put up with our indecisiveness. If you're in Pittsburgh need a quick bite for lunch I definitely say stop in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7gs_0hEHKgPjwJv5N9tPUQ"
  },
  "zXgKQiEqQ7OV97kwPzZZOA": {
    "date": "8/18/2018",
    "text": "Food is excellent, love the build your burger set up. Pleasant atmosphere and great service. Recommended AF.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x7LFSeStIBb3eHwbxFcsLA"
  },
  "j2foYPCNBusiTZgON_fiGQ": {
    "date": "9/23/2017",
    "text": "This is one of my favorite hangout place in Pittsburgh. The burgers can be customized and taste scrupulously amazing. They come with a side of various types of fries, Curly fries being my personal favorite. Another must-try are the loaded nachos. One of the best nachos in Pittsburgh after Hemingways and Houffbrauhaus. They have jaw dropping deals on beers and you have a huge variety to choose from. For me, this place has the perfect ambience and food that one needs after a loaded week, on an Friday evening! Love it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3y_1LuCjAGeV7SK6CgISwA",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Some accompaniments with the beer!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3y_1LuCjAGeV7SK6CgISwA/o.jpg"
      },
      {
        "img_id": "PsSjVShVY4LewqA4SxNfHQ",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Beer with my gang! :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PsSjVShVY4LewqA4SxNfHQ/o.jpg"
      }
    ],
    "user_id": "qCkn90NV1FjQDxLJvrOsVQ"
  },
  "Q2T3uRZ4Z20HHk0CLT6poA": {
    "date": "3/31/2016",
    "text": "Service was great & fun , food was pretty great, and a fun/chill atmosphere. A place I would recommend to check out.  It's not huge, so not tons of tables, but it's a decent size. I do like how one side has an open \"window\".  We ordered the buffalo quesadilla, bacon cheeseburger quesadilla, and buffalo garlic parm wings with a side of old bay fries.  Buffalo quesadilla - VERY good! Just the right amount of ingredients and not overly spicy. Great taste.  Bacon cheeseburger quesadilla - good but a little bland - Not too much flavor - I had to add salsa & sour cream to mix it up Garlic parm wings - YUMMY! Good size wings and the perfect amount of sauce. None of the flavors overpower eachother (the buffalo, garlic or Parmesan) and its served with a good size ranch (or bleu cheese).  Old bay fries - I liked the seasoning (I mean it's old bay!) but the fries seemed a bit overcooked - extra extra crispy.   *karaoke on Wednesday nights  *$4-5 menu item that differs each day of week (Wednesday is quesadilla and Thursday is wings)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I_7MW4KUE_dVQ4g2_tpn4w",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Buffalo garlic parm wings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/I_7MW4KUE_dVQ4g2_tpn4w/o.jpg"
      },
      {
        "img_id": "GtkIB-hTfkUKKUeJQT6Opg",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Buffalo chicken quesadilla",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GtkIB-hTfkUKKUeJQT6Opg/o.jpg"
      }
    ],
    "user_id": "G9P3h7ZGdbdc_Zt6IKC2vQ"
  },
  "x7uyAzxuF14mb6m78Sj5XA": {
    "date": "9/10/2017",
    "text": "One of the coolest Build your own burger places I've visited... The choice is extensive and you can actually really customise your burger to you're liking. So it's customised to your taste buds be it spicy or sweet sauce and also the cheese, bread and the patty.. I really liked it and you should definitely visit it if you like burgers !!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W2UzxPCIeUl7hxlvx0MXpg",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Contemplating what to put on your burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/W2UzxPCIeUl7hxlvx0MXpg/o.jpg"
      },
      {
        "img_id": "0JL5SCXIkVJG8IvnhqOQlg",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. When you get to build your burgers from scratch",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0JL5SCXIkVJG8IvnhqOQlg/o.jpg"
      },
      {
        "img_id": "-FKR7xSehnE2EQJm9M7BPw",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Choices for your burger simply beautiful",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-FKR7xSehnE2EQJm9M7BPw/o.jpg"
      }
    ],
    "user_id": "IiGaHGmbPMoC6SmRrMfDKQ"
  },
  "NMwHT2vXiltZnKmdJgyTUA": {
    "date": "11/17/2016",
    "text": "I'm not really sure what to write here??? We walked in, were seated, handed our order slip to a girl, ate our food, left. Like, that's it. I think we exchanged 5 words total with the staff members there. That approach probably works well for some but doesn't really fare well when it comes to review time if you're like me and enjoy engaging with all of the different personalities out there.   I really liked the variety of breads and sauces. My guest even got a burger wrap which he was pretty intrigued by the concept of.  Although I couldn't taste the pineapple mayo on my turkey burger. But it could have been muted by my other topping choices though?  The curly fries were delicious!   This place works well at it's current location but I'm not sure how great it would do outside of a college area. Food was good but nothing really to write home about. I would go back for some more curly fries though, that's for sure!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XYCIjBLP7VAJTIr5Ig0uwA"
  },
  "fwrJ0YUYYGT3QGg4WGHsQQ": {
    "date": "2/21/2016",
    "text": "This place is pretty cool! It's kind of like Burgatory but more college students.   The restaurant has a really nice feel and the staff was awesome! Each time I've been here I've built my own stack (BYOS.) I really like all the different choices and you can even pick what kind of fries you want! (I got tots of course.) The first time I came here I got an Oreo shake and it was delicious! The second time I went here I got the fried mac and cheese balls as an appetizer and they were really good!   The burgers are good, not fabulous but pretty good. My biggest complaint is that I wish you could pick how you wanted your burger cooked. All of the burgers at Stack'd are cooked to be mid well and personally I like mine medium with pink. If Stack'd changed this policy I feel like their burgers would be amazing.   Other than that, you can't beat the prices here and they have different events/specials every night! Come check them out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "68zREQ6qRXseCjsm_Grk4Q",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Fried Mac and Cheese Balls! They were so good!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/68zREQ6qRXseCjsm_Grk4Q/o.jpg"
      }
    ],
    "user_id": "Ib3uXHSWeBed2kK-BKLGSw"
  },
  "ROxaXGx3xZLARHnNl9XWOg": {
    "date": "6/24/2019",
    "text": "Whenever I'm in town and craving a good, juicy burger, I will always come to Stack'd! I love the service, the fun environment and how easy it is to build a burger based on your preference. You are given a list to fill out, which breaks into categories, so you have the opportunity to build your burger and personalize it to every degree! I love when it's nice out and the windows are open to experience the energetic Oakland vibe as well!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Es6hHf-XOm-8cGgorci-w"
  },
  "kUKLHj8LSbq-nW5SzUV88w": {
    "date": "8/24/2019",
    "text": "Great burger and service was fast and friendly--even though the place was packed on a Saturday evening.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qBxkW9Jjhc_g-sdHHSpjVw"
  },
  "12fHrUMekENZUcY5UBC7SQ": {
    "date": "10/27/2017",
    "text": "Me: \"omg this burger is huge!\" Friend: \"I guess you could say it's.. STACK'D!\" *ba dum tss* Me: \"umm...\"  STACK'D BURGER 1/2 lb ($7): After 9pm on Tuesday's they're half off ($3.5)! I got a sesame bun with OMFG sauce and ketchup, then field greens, red onion, green bell pepper, and banana peppers. I was pretty disappointed that there wasn't enough sauce :( it barely had any kick (when it usually does)!The onion and bell pepper were very good, and added a nice crunch and freshness to my burger. CURLY FRIES ($2 as a side): Delicious! I couldn't finish em because the burger totally filled me up so Stack'd gives you good portions for what you pay for. Good thing I didn't get a milkshake or else I'd explode..  SERVICE: Fast(ish). They seem to be on top of things for the most part however on another visit for their wing night (Thursday's), I had an awful experience with being charged the full price when I was promised the late night price although I sat down maybe 10 minutes before 9. Ahh.. it was cold outside and I was willing to wait longer but the girl said it was okay until the bill came out.   VIBES: Loud. Well it is right next to/on Pitt campus. Not the best place to have a heartfelt conversation, but a great spot to grab a meal and drinks with friends. This is a college hangout spot for decent food and drinks, with TVs showing sports like basketball or hockey at any given time.  Stack'd, my go-to when I'm craving burgers. Affordable, and you get what you pay for. There is also a Shadyside location that has similar late night specials.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vKOEICG6nAkYeFLSxIs5mw",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Curly fries!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vKOEICG6nAkYeFLSxIs5mw/o.jpg"
      }
    ],
    "user_id": "E1FJIPr-VRPotG8v6c2kaA"
  },
  "S1BH3623_8SOdrO5STFmYg": {
    "date": "5/26/2018",
    "text": "I enjoyed coming here a lot! I would always come with friends on half off days - usually for the half off burgers or veggie burgers! My go to was the veggie burger (with chips, blue cheese etc as toppings) and old bay fries.   It was usually packed at night so it was a nice way to relax before exams or when I just needed to catch up with a few friends over a meal.   Although the normal pricing isn't bad, I would try to go only during the half off periods.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mN3C0EmsbRXaTp-m3Ewhxw"
  },
  "QPdhAjGJ68y5CI5RjkOvPw": {
    "date": "12/4/2018",
    "text": "This is the second time I've been here. First time I had the most delicious wings. This time I decided on a build your own burger. I would say it's the best burger I've ever had! And you have to have the curly fries! The staff is always great and always greets you with a smile. If you're in Pittsburg in the Oakland area, you have to stop in, you won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2DFIvzAmJuOxVjJB7vtQlA",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2DFIvzAmJuOxVjJB7vtQlA/o.jpg"
      }
    ],
    "user_id": "-snf9MTG9j6OfXlyBKuyUQ"
  },
  "uelm8FUnHO-90NrCDEO5bQ": {
    "date": "9/16/2017",
    "text": "I never thought that a burger place could make me want to come back to a college campus. Seriously, we need one of these in Philly's University City because I pretty much died and came back to life after a bite or two of my burger. I got the \"stack'd burger\" (1/2 lb meat) with American cheese on a sesame seed bun, topped with lettuce, tomato, pickle, ketchup, and garlic aioli with a side of curly fries. Listen, I didn't even know I needed garlic aioli in my life. Yes, it's mostly just garlic and mayo, but it's delicious garlic and mayo.   On top of my 2 patties being slightly crispy at the edges, the pickles had a rich dill flavor. The only downfall to this meal that I'll point out is that the bun couldn't handle the juices from this burger. If they used a harder sesame bun (maybe Italian? or just toast it) it would do just fine, but I was fighting to keep my burger together until I just succumbed to using a fork. Curly fries are always good because they usually already come seasoned, so I did a good job on that.  Like I said earlier, I would 100% come back to Pittsburgh just to eat at this place again. I only spent around $10 for this plate, and for the quality, I will gladly take the hike.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "11mGJ5-X1k5n_MHSXkHpvw",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. The whole gang was carbed up",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/11mGJ5-X1k5n_MHSXkHpvw/o.jpg"
      },
      {
        "img_id": "f8ZQeaTWbdT08sL9QLnpIw",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Sesame seed bun, 2 patties, lettuce, tomato, pickle, garlic aioli, ketchup with curly fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f8ZQeaTWbdT08sL9QLnpIw/o.jpg"
      }
    ],
    "user_id": "VN3apynnuv00bFwNOnXqqg"
  },
  "L9yB_MpLxvG2ZvOlh1YiTA": {
    "date": "7/21/2017",
    "text": "Wife and I went are last night for dinner. The place was pretty crowded and we were still seated right away. I had a burger with cheese and bacon and pickles and fries. The waitress was very fast and very friendly. The hamburger was delicious maybe not the best I have ever had but really good. Prices where reasonable and fair. I would recommend Stack'd if you are in the area. My wife had one of the specialty shakes which was actually really good. I would definitely go back again.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "d0DohPFy7XTVXYGAmo4j8Q",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/d0DohPFy7XTVXYGAmo4j8Q/o.jpg"
      }
    ],
    "user_id": "hg71CGHy9bwpgY8cGVVg4w"
  },
  "xfDTaHSmWpIoz-3-yowGLg": {
    "date": "5/2/2019",
    "text": "First time here, definitely good food, burger for me personally could have used more of the sauce on it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Jfh0Vpw3P4lvyGcslMsKGQ",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Jfh0Vpw3P4lvyGcslMsKGQ/o.jpg"
      }
    ],
    "user_id": "InFDSXrwHqivawysuS-6Sg"
  },
  "USbYoBIeFg9IYgt7hSYMhA": {
    "date": "3/4/2018",
    "text": "This is a burger/bar located in the heart of the college area. It's conveniently located for people who are in a hurry (myself), perhaps looking for a late meal (myself) at an acceptable price range (definitely myself). Burgers can be customized, which is great, However, most of the time my patties come out pretty well-done. Fortunately, it all is very tasty especially with their sauces! My favorite is the honey siracha which they nicely accommodate by putting on the side.  They have a nice selection of drinks. I usually get milkshakes which are satisfying. I am not a fan of their chocolate milkshakes, which taste like chocolate syrup, but all of their other milkshakes are a solid \"yummy\" in my tummy.   Lastly, they often have specials on certain weeknights e.g. 1/2 wings or something of that nature. Their chicken wings are very good so I highly recommend checking that out!  Overall, a great place for late night and convenient meal (I almost always get take out) The ambiance can get very loud at times, of course this is located in a college area, but staff is also incredibly friendly and accommodating so that helps balance things out. My only concern is that a few times I've come for a late-night meal and their kitchen closed 1/2hr earlier than scheduled which is a bummer, but it's okay I just starved for those nights.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wRtDGmMriHBQSfqW15szJQ"
  },
  "cwe4si0HboXxYMlTI1VVEA": {
    "date": "4/3/2019",
    "text": "Food was fine, decent beer selection on draft, and cool concept for ordering.  Basically a piece of paper w/check the box options.  Pick and select what you want your custom burgers/sandwiches/apps to be, write your name on it and done.  Old Bay fries were something different but good, bit too much old bay on mine but definitely worth a try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ybxJbc71EvOufc_QoUQ7Q"
  },
  "lUsSwKZ-yqiLYwA0hcNc1A": {
    "date": "8/31/2018",
    "text": "On a positive note, the inside decor is beautiful and the wait was not too long for a Friday night. But, that was about all that was positive.   They appeared very short staffed, and we waited 10 minutes just to get water. I ordered a custom burger. The food took an average amount of time to be prepared. THEN, right when I got excited because my food had arrived, I was sorely disappointed with the burger. I asked for the mustard on the side because I don't like a lot of sauce on my burger. But, I could deal with that. I then processed to bite into the burger, and I quickly found out that instead of the roasted red peppers that I had ordered, there were spicy banana peppers on my burger. As my spice tolerance is not very high, my mouth immediately started burning to the point where I couldn't feel my tongue or lips. There were multiple of the hot banana peppers, so it definitely wasn't an accident. Plus, there weren't even roasted red peppers. Obviously, they need to train their staff better on the different peppers.  While this was a very individualized experience, I definitely think there are a ton of different AND BETTER places to eat in Oakland that I prefer. Stack'd will never be a top choice.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N32vgAet_7KYfWxF9duMQA"
  },
  "uvAL3KRBL-tV2O3Iewa4ig": {
    "date": "8/19/2018",
    "text": "Texas Toast with peanut butter is great!!!! Of course with steak! Hahahha so happy here. Lots of people and great location",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uTbygVO8FKgtd-SMU8OXoA",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uTbygVO8FKgtd-SMU8OXoA/o.jpg"
      },
      {
        "img_id": "Ym5NTiYDsGFrTjwmlRocXA",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ym5NTiYDsGFrTjwmlRocXA/o.jpg"
      },
      {
        "img_id": "ehOjen9ux6niqQXv75XmOA",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ehOjen9ux6niqQXv75XmOA/o.jpg"
      }
    ],
    "user_id": "KPESRvj4_Zmw4SZ0ITxK7g"
  },
  "leZIgHCyj0uJLbboppWciA": {
    "date": "10/24/2018",
    "text": "This place is amazing! Came in and got the fried ravioli as an appetizer, and it was beyond amazing. Got the chicken fingers with normal French fries and they were also delicious. Overall amazing meal!   The service was also great. Our waitress was really nice and overall amazing. Would 100% come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_-E9T54Et1grOlNGNlPgzg",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_-E9T54Et1grOlNGNlPgzg/o.jpg"
      },
      {
        "img_id": "AvtbNQGGSSK0vH954ic2Pw",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AvtbNQGGSSK0vH954ic2Pw/o.jpg"
      }
    ],
    "user_id": "HeyxlRj5oELbr41d4KKDQA"
  },
  "hGrITTqGDVQ7oQif02lsMA": {
    "date": "7/2/2019",
    "text": "The best turkey burger I've ever had! I loved the free add-on options. My son had the buffalo chicken quesadilla which was pretty good as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LjQx6Bl1pcMVazB7VZw_Qw"
  },
  "szjyp7daPf3rld0J6mh58g": {
    "date": "2/7/2018",
    "text": "Must get a milkshake if you go! Their half off burgers/quesadillas/wing special (after 9pm on different days of the week--check the online schedule) is a great deal. Their burgers and fries have never disappointed me and the service always seems to be pretty good. The TV's always have a game playing so it's a nice place to sit back and relax on campus.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3oKtLdAO138VHY8KTlpXuQ"
  },
  "aJKjc8OFMiUeOua7qpBkPA": {
    "date": "9/2/2018",
    "text": "I would rate this joint 3 stars if just discussing the burgers and service (which are both very average) ... BUT the wings! The wings here are delicious and some of my favorite I've ever had - particularly the Caribbean jerk spice dry rub wings! Unique, crispy, and oh so savory! But I don't recommend getting wings unless it's Thursday past 9pm, which is wing night when they are $7. (Once upon a time they were $5. :/ ) my roommate and I make a point to come here for wing night at least once every month!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aV3_VSE1ILtGsWeN74w6GQ"
  },
  "rG0ZVudvXlLo6QBkbM0ksA": {
    "date": "3/4/2018",
    "text": "Stack'd is a great addition to the Oakland food scene and easily the best place to grab food in the immediate area. Similar to Burgatory in the ordering style with the option of solid build-your-own burgers which come with a side of satisfying fries, I have no complaints! On the days you're feeling \"healthy,\" there's always the option of getting a filling salad with cajun chicken and fries (yes, in the salad) that make it perfect Pittsburgh and almost forget that you're depriving yourself of a burger.   It has plenty of seating (including outdoor in the summer) so you don't have to wait for long even on days where it's packed. And speaking of packed, it often is and in a good way! It's got a fun vibe and special deals depending on the day of the week, so always a good place to get dinner and catch up with friends!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lAf9Fx7BWwqRzpEoTYadJA"
  },
  "NMpB1_zeWr2ZzJl1wnEFiA": {
    "date": "1/30/2019",
    "text": "This place is good when i'm craving a burger on campus but it's nothing special. It's nice that you get to customize your burger (bun, meat, cheese, etc.) but it is a little expensive. For the size of the burger, especially if you want add on's, it can get pricy! It's your typical burger place and does the job!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eO2cNB2chfDMTZWafeOGHA"
  },
  "HSpnetP0FGC5rQaU-QcznA": {
    "date": "7/9/2019",
    "text": "Amazing food. Easy and fun ways to order and food comes out fast. Milkshakes are some of the best I've had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "COye2bLZbV7REdVQkWNT7A"
  },
  "XrydVo13nt2HJRsjz0CGdA": {
    "date": "7/20/2018",
    "text": "I had been craving a burger for days so my boyfriend brought me here. Loved the way you could customize your burger, and I thought some of the options were pretty unique. The waitress was quick and friendly. The establishment was clean, and we enjoyed sitting by the open window to people watch a little. There is also outdoor seating if you prefer. My boyfriend said he did their trivia night once too, and it was a blast. The only thing I thought a little odd was that they didn't ask me how I wanted my burger cooked, but regardless it was delicious. The tater tots were yummy too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CAkwE-R2P8eG8p7OUGNP_w",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CAkwE-R2P8eG8p7OUGNP_w/o.jpg"
      }
    ],
    "user_id": "jer_EtuiaNRHeCpelYXsng"
  },
  "5Ic_iQFICTfEO-J7DlzRIg": {
    "date": "9/20/2019",
    "text": "I meant up with a friend here before a doctor's appointment at 11:15 and we were sat right away. We said 2, but another friend might join us and they sat us at a small 2 top in the middle of the front part of the restaurant. We had to put our purses on the floor and when our friend did show, he pulled a chair up, thankfully he wasn't eating.   Now onto the good part:  I liked that I could pick what I wanted and check a box. I'm an introvert and I'm not crazy about ordering food... lol.   Our server was good and the food was good too. The burger was cooked just the way I liked it and I got tatar tots and they were good.   I'll definitely come back here. I think it's way better then Burgatory.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cHFsW_fyfwbU_75lfqhjsw"
  },
  "PheALH_YViwYhiw3ryFCrw": {
    "date": "9/19/2019",
    "text": "Fried pickles. Need I say more?   This is a cute little restaurant with a nice rooftop area (though I only discovered this when I got lost going to the bathroom. Which is downstairs. Helpful hint because there aren't any signs).   I ordered the fried pickles and a quesadilla for the appetizers. The spicy ranch that comes with the pickles was the key to this dish. Perfect compliment to the tang of the pickles. The quesadilla was a buffalo chicken. It was perfect, there's no other words for it. My entree was a build your own burger. I loved how many different options there were especially in sauces. You could eat here a hundred times and probably not try every combination.   I had a cherry lime drink. Nothing to write home about honestly.   I loved the food enough that I will continue to patronize but I wasn't a huge fan of service. Most of the servers looked bored, tired, and really unhappy.  Our server was pleasant enough but didn't seem thrilled to be there. The burgers took forever also but since appetizers were quick, I was willing to overlook that.   All in all, a fun dinner spot. Go during happy hour when apps are half off. Don't expect a happy server.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rTSv0QMJwHVxoa7sQxX7Ww",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Buffalo chicken quesadilla",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rTSv0QMJwHVxoa7sQxX7Ww/o.jpg"
      },
      {
        "img_id": "cjSVPQhFJGcspyjYAB5pJw",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Fried pickle app",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cjSVPQhFJGcspyjYAB5pJw/o.jpg"
      }
    ],
    "user_id": "jVUVcLZc8IuAldWJCH4qMA"
  },
  "jzqOuyFfKpv4KsUKZbytcQ": {
    "date": "8/25/2019",
    "text": "The atmosphere of this place is energetic and fun.  And if you happen to come on a warm day, you will see the garage type windows open, elevating the experience.  Or chose to sit on the second floor outdoor terrace.  A fun experience regardless of choice.  Now to the food.  I love the menu concept where you customize your entire burger experience ... from the number of patties, to the toppings, to the sides (I went for the tots).  And there are lots of cold beverages to choose from to wash it all down.  My only disappointment is that my burger was overcooked.  Not sure this was a one off or not.  I will need to give this place another try and report back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FfmyMdOOx8HGDTc1A0mUSQ"
  },
  "OWZzKvOmAML7LnLMGp8SMQ": {
    "date": "6/11/2019",
    "text": "Good place for burgers and even better place for appetizers!! I absolutely love the fried Mac N Cheese nuggets and the Pretzel Twist--they are the perfect late night snack and come with great dipping sauces.    The burgers are customizable and the sauces and toppings are pretty delicious.   It's a small space that's dimly lit--and be warned it can get very crowded, especially on trivia night and weekends. Overall, a good place to grab a burger and some apps in Oakland.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pV2sc2YpjiDIJteC-RjoMQ",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Pretzel Twist",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pV2sc2YpjiDIJteC-RjoMQ/o.jpg"
      },
      {
        "img_id": "RkuOxbkuKYcOP0Ix9rDwiQ",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Fried Mac N Cheese nuggets",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RkuOxbkuKYcOP0Ix9rDwiQ/o.jpg"
      }
    ],
    "user_id": "i1erqSCaenXvzeaswerWoQ"
  },
  "JMtpGrHw_SNQg08xTTRJqA": {
    "date": "4/17/2019",
    "text": "Stack'd is great for almost every type of eater. You can easily customize your burger and add a bunch of toppings, or just stick to the basics if that's your preference. Stack'd has a great veggie burger and a very large selection of toppings for no additional charge. The tater tots, onion rings, and sweet potato fries are all very good too! The milkshakes are also great. The cocktails, however, are overly sweet and slightly overpriced relative to the quality.   Service is great and you can mobile-order if you're stuck on campus studying or looking to eat in. They are very accommodating if mistakes are made on your order.   The atmosphere is perfect for a chill late-night dinner with your friends, and during the spring/summer, they keep the windows open so you can soak up the nice weather.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PFyO5M5FsehpWuugStGTgA",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Veggie burgers, curly fries, and tater tots",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PFyO5M5FsehpWuugStGTgA/o.jpg"
      }
    ],
    "user_id": "uEpfN2yQ2DMI8k6DW73GWg"
  },
  "FKOUfPdrSKdi5Z-vyTrp9Q": {
    "date": "5/13/2019",
    "text": "Wasn't sure what to expect. My first time in the city looking for a place to eat. Decided to go to a burger joint.  Atmosphere: Playing Top 40 music in the background. Seating: Table top for 4 and extended tables on the next tier.  Cost: Reasonable. Food: Prepared as requested and hot Ordered: mozzarella sticks, pretzel twist, 2 bugers made your way. Choice of single, double or triple patty. Flavor: Yes, the burgers were juicy and delish! The pretzel twist was tastee had cheese and spicy mustard - so good. Mozzarella Sticks were surprisingly bigger than expected! Server:  (Michelle) very friendly and walked us through the ordering process of build your own burger. First timer and all. Service: attentive and recieved our food quickly, less than 10 minutes from ordering.  Parking: Street, uses park mobil app, quick and easy. Time of day: early afternoon during weekday As a first time patron, we parked with 1 hour on the meter, walked a block, sat down to eat, looked over the menu for a good bit, ordered food and began eating, I had 15 minutes left on the park by the time we asked for the check.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "U0Plvyl9LzN2ygs8zaCNCQ",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Oh yeah! Build your own.The double patty, butter pickles, Big Mac Dauce, lettuce. Juicy!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U0Plvyl9LzN2ygs8zaCNCQ/o.jpg"
      },
      {
        "img_id": "G5qV3F0-aWupwNCermVR7Q",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Mozzarella Sticks",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G5qV3F0-aWupwNCermVR7Q/o.jpg"
      },
      {
        "img_id": "-bNB2nyjjYnH3BUOiRvRSQ",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Build your own single patty burger with side of fries (fries are extra)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-bNB2nyjjYnH3BUOiRvRSQ/o.jpg"
      }
    ],
    "user_id": "2---PbVlCJBr10V2tt-HwQ"
  },
  "a6OOuAijPX6CyZ8OG8LRUA": {
    "date": "9/14/2019",
    "text": "Went here with some friends around 8PM on a Friday and it was very packed but we got a table for four pretty quick. Didn't see any wait staff after probably 25 minutes of sitting and creating our burgers. Nonetheless, it was fun to sit and build our burgers with what we wanted, so the wait wasn't that horrible. I got bacon avocado and bbq sauce on my burger, but the amount of avocado was NOT worth the $1 since it was only two quarter-sized pieces. Other than that, the meat is clearly very fresh and well cooked and the atmosphere is enjoyable. It's pretty much what you'd expect for the area, but I could've gone without stopping here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xaMoO_2D569XJt0t8om2-g"
  },
  "eUXju_BU8p1I8V2Gp-c5Vw": {
    "date": "4/7/2019",
    "text": "Stack'd is a Pittsburgh staple and GO TO burger joint. Burgers are awesome and customizable and A for atmosphere. Looking to crack a cold one with the boys after a game? Stack'd. Here and hungry with the fam? Stack'd. Tired hungover and maybe braless? Stack'd. Roughy day or just pissed at Pat Gallagher? Stack'd. Cool vibes and fun specialty nights like trivia. Also we love aspiked milkshakeee",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jyeW8wpezHjOLslMldirCQ",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jyeW8wpezHjOLslMldirCQ/o.jpg"
      }
    ],
    "user_id": "GV9VhU2HFiMm3ynYk3Fc3A"
  },
  "hhi1yny6Ckyk3ugqmGaFEQ": {
    "date": "7/11/2019",
    "text": "By far one of my favorite restaurants to get a burger! Make sure to come hungry because your burger will be two patties stacked high. I love that you build your own burger with the toppings, bun, sauces, and cheese you want. They have the most options I've seen at any burger restaurant. My favorite topping is the Fritos, they add a great crunch and unique flavor to each bite. For the sauce, I got ketchup, mayo, and the house sauce. It was a great combo and they made sure to cover my whole burger so I could taste it with each bite. Ingredients are fresh and the meat patties are tender, cooked to medium well. Excellent flavor for your own creation! The appetizers are also delicious. We got the buffalo potato skins. They were large potato skins, enough to share, and covered in ingredients. Cheese, bacon, buffalo sauce and sour cream on top made for an amazing pre-entree dish. Highly recommend coming here if you're craving a delicious burger for a very reasonable price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "A3lQTjTIhqq2mMqn1VcyrA",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Build Your Own Stack Burger with Cajuin Fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A3lQTjTIhqq2mMqn1VcyrA/o.jpg"
      },
      {
        "img_id": "tk5ZbHSTJ0P-ZFO3qF_EGQ",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Buffalo Potato Skins",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tk5ZbHSTJ0P-ZFO3qF_EGQ/o.jpg"
      }
    ],
    "user_id": "KKblXUNxSGCewpDxiiSRQA"
  },
  "6GTbew1plO1pO6RNkVjr_w": {
    "date": "4/4/2019",
    "text": "Stack'd is a nice Build Your Own Burger joint in Oakland. With burgers comparable to that of Burgatory and BRGR (but not as expensive, in my opinion), its a nice little restaurant in the heart of Oakland. Their happy hour deals are OK, and they do a daily special food item.  We recently went to watch a hockey game and made our own burger. Seating can be a little tight when it's busy, but they do their best to make it work and make everyone relatively comfortable. We made our own burgers and also ordered curly fries with them and a chocolate milkshake for myself. I ended up not finishing my burger completely and took it home to enjoy for lunch later. Our food came out quickly and was nice and hot.   The only downside is (i'm assuming because it was busy), it was kind of hard to hear/ converse in there. Otherwise, great place to eat!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IlFVXFwX-VEf-c9m5AQs8g"
  },
  "WANQwiv-tLcgnyhhQKY67g": {
    "date": "9/4/2018",
    "text": "This was my first visit, the concept reminded me of other burger chains in the area. I liked the fact I could \"build your own stack\". I chose the grilled chicken sandwich with mayo, grilled mushrooms & onions on a wheat bun with a side of sweet potato fries.  I thought the meal was good. If I visit again I'd like to try the Cajun chips and a milkshake.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QXQEzEO3w8YVhvxBnVLdJg",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Chicken Burger and Sweet Potato Fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QXQEzEO3w8YVhvxBnVLdJg/o.jpg"
      }
    ],
    "user_id": "IzduPiQt4FiKpSTBDrDt5w"
  },
  "wtTQ88v1hLH2AvLlLrtVaw": {
    "date": "6/21/2019",
    "text": "My family and I are huge fans of Burgatory, so we weren't sure if this place would \"stack\" up .. haha.  I'm happy to report that it does.    We only had one appetizer and that was the fried mac-n-cheese nuggets. My daughter (the mac-n-cheese snob) wasn't overly impressed, but I thought they were very good .. which is probably why I ate the majority of them.   Three of us had custom burgers and they were all juicy and tasty. The buns are a little large for our preference, but that's a personal thing.  One of my daughters had a grilled cheese and tomato soup. I would definitely get again next time we go. The soup was homemade and yummy.   We are going back to Oakland to tour Pitt at the end of July, and I think we will definitely be making a return trip to Stack'd.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lb9cm7HTL9Sz31ZLCaS2Sg"
  },
  "T232gl5HOSafahg8crwLKg": {
    "date": "6/14/2019",
    "text": "When I came to Pitt in 2015, Stack'd was brand new. Ever since then, I've been saying Oakland needs more places like it because it is so good. Oakland definitely has more fast food/fast casual restaurants so when it comes to dine in restaurants in Oakland, Stack'd is at the top of my list.  The place is pretty small but creates a rather nice, intimate kind of setting. However, with limited seating it tends to create a little bit of wait. With a build your own menu similar to Burgatory, it's easy to find a meal that can please even the pickiest of eaters. I always try and experiment with something new but still find myself putting everything on the pretzel bun - it changed the burger game for me. The curly fries are great and it never hurts to top off the meal with a milkshake - they even had hard shakes for when you wanna have a little extra fun with your meal! I also think they're in the process of creating a rooftop bar so you better believe I'm gonna be first in line when that thing opens up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "COx2BIbrQoD9oRFFPrsVyg"
  },
  "Wz3PDvMWhnJ9OWVMkX1bAg": {
    "date": "8/15/2019",
    "text": "It was my first time trying Stack'd and I couldn't ask for a better meal for a better price. The waitress was amazing with giving advice on what is pretty common for people to order from there and she was super funny too! The music is pretty good and the environment is pretty much a bunch of college kids so it's super laid back. My burger was perfectly perfect. Not one flaw. The meat was cooked so well and not overdone and the cheese was melted on beautifully. Additionally, those mozzarella/cheese sticks are to DIE for. Absolutely loved them. And that's not even the best part, you get FREE REFILLS! I was so sad my stomach couldn't fit more lemonade. Overall a great experience and I'm for sure going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5UYwECNjT7p8brcZUS8_MA"
  },
  "-8QF4kSUxmQPpZN_k3s1Og": {
    "date": "7/25/2019",
    "text": "First of all, the bathroom is horrific. It is grimy, full of fruit flies and seems to be a home away from home for homeless. Reeks. Waited around for hostess, but nobody ever came to see why I was standing there... Thought then I would go eat at the bar. Staff sitting around talking. Nobody asked if they could help, nobody said 'have a seat.' Just not a good feel. Sure if you go to Pitt and want a burger and a beer it is probably fine, but know what it is before you go.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5iTdaHwTbms9D-Th3DNweQ"
  },
  "SPboCraAdhDMBd6Zor-i5A": {
    "date": "9/26/2018",
    "text": "For lunch, my friends and I decided to go here to grab something to eat and we all wanted burgers. Located in the middle of Pittsburgh campus, it is honestly a very cool place. If you've ever been to Wich Wich, it's basically that place but burgers instead. They serve other things such as quesadillas and wings but you have to get a burger. It is fairly priced unless you want to get many special toppings,like bacon, an egg, and jelly. Their fries are really good as I tried their Cajun fries and old boy fries. I personally like the Cajun ones better as they had a stronger flavor to them. If you want to get the most bang out of your buck, then you have to go on Tuesday nights as their burgers are half off. If you like burgers you have to try this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kSMtqwnnrxH2GSEyNaq5bQ"
  },
  "_P_enGooQHhQ0EXxFN6usg": {
    "date": "7/9/2019",
    "text": "I know some people really don't like it. But I have good experience with Stack'd. As one of the restaurants with cheap options, I often find the burgers I built myself taste more than what I paid.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "is3xlA9rJkHDiWpUZZDaoQ"
  },
  "lqc3JAiYU97gq32q_Lmv3w": {
    "date": "9/3/2018",
    "text": "This place had a fun concept for ordering food. The waitress hands you a long slip of paper with different selections for burgers, condiments and toppings and you check of what you want. I ended up getting an angus burger with with guacamole, pepperjack cheese, and a cajun aioli as the condiment. I also decided to pair my meal with curly fries and a chocolate peanut butter milkshake. The meal did not disappoint! The curly fries were perfectly crisp on the outside and the milkshake was thick and delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hS4QYiyhodNSE0g35SJ9_w",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States. Chocolate Peanut Butter Milkshake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hS4QYiyhodNSE0g35SJ9_w/o.jpg"
      },
      {
        "img_id": "4o465AgfrDUeEYYF4jECTA",
        "caption": "Photo of Stack'd Burgers &amp; Beer - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4o465AgfrDUeEYYF4jECTA/o.jpg"
      }
    ],
    "user_id": "dcaM83FOnpuqxGJt4EABZA"
  },
  "WBW4888Ezv0Wc8cIpIxUhw": {
    "date": "6/17/2019",
    "text": "I must say, some girls serving here definitely seem to have a temper or chip on their shoulders! Ordered a burger and I was half way through it with my mouth stuffed, when I was asked if I needed some thing else? Very soon I had the check and was outa there. The burgers are good, the cocktails not so much! Whatever it is, be nice guys- makes a whole lotta difference!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LzDSoSRGtxp35RpjbhC6Dg"
  },
  "_P3GLvo3d3bQaPX0UMhJbQ": {
    "date": "6/28/2019",
    "text": "Another neat venue. Stopped by for lunch during the week. I liked the order process. Checking off your order on the paper menus and handing to the waitress. We really enjoyed the cheese sticks great flavor and crispy! I had a stacked burger. It was average, not bad but not great. Tator tots were a nice change to fries. My daughter had the chicken Caesar Salad. She enjoyed it big chunks of chicken. Service was a tad slow, and seating was tight. Again not bad and we will be back, but nothing exceptional.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6O4_X8gnaZ_X8JsGOeEsFg"
  },
  "rxOu_M9uNMBXatWEYvXrmA": {
    "date": "3/2/2016",
    "text": "I'm updating this review and giving Stack'd in Oakland five stars due to my recent Sunday Brunch discovery! I went in last week on Sunday and found that they offer $2 mimosas and bloody marys from 11-2 on Sundays. Seriously!? You can't beat that. In addition to my veggie burger (which was yummy as always), I also ordered a mimosa and a bloody mary. The mimosa was great, definitely worth the $2 and although the bloody mary was good for the price, the bartender put a bit too much siracha in mine. Next time I will ask them to skip the siracha in my bloody, but I think I've found my new Sunday Brunch destination!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZRdeSie_ZV2Jc8hGJks8cg"
  },
  "wt_Tc5j5kQjMyH0vaw9fEQ": {
    "date": "10/20/2015",
    "text": "This is an alright burger joint; good for a quick burger and fries in a bar atmosphere. There is also an alright selection of beer. Overall, I would say that this is an above average lunch option if you want a quick cheeseburger.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LzZPZDlXiEv9adPzdN4gzw"
  },
  "mmV8slzqZaYX66sWicWHYg": {
    "date": "10/11/2015",
    "text": "Delicious food, friendly service, and a great selection of beers. I used to go to the shadyside location, but I really like this new location. The decor is modern and appealing, and it makes for a nice atmosphere when they open the garage door-style windows during nice weather. It's an awesome new option for good food in Oakland.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1bZi20a9yEi3FN2TU9G-Qg"
  },
  "55CrcLOjxlqlJxnKReiaHg": {
    "date": "11/8/2015",
    "text": "It's an average burger joint on a college campus. There isn't a huge variety in food selection, but they have a bar with friendly service and a solid amount of TVs if you're into whatever game is on.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LmDY8tqBquwMSJc0NMSvwA"
  },
  "OC8Irdn1Il2A7n_T-3S-9Q": {
    "date": "10/31/2015",
    "text": "I've only been here for lunch and had one burger, but I don't think Stack'd is worth having to sit down and pay tip for service for what I found to be an average burger. I was disappointed that they don't wrap burgers in lettuce and that the burger was small. Perhaps I'm biased, but I would rather go to Five Guys.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "czkMely189m-pyzs_j6VYA"
  },
  "QZOz3NLq2WK0jAWtzlSjsQ": {
    "date": "12/8/2015",
    "text": "Not bad, nothing special though. Tries to be Burgatory and isn't up to par. Burger was good, not great. Five Guys still rules as the best burger joint in Oakland.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zqbvuWh8hf0YSlSAkKOq0A"
  },
  "IQYtoubgVcVXyTYWzYO8Wg": {
    "date": "11/14/2015",
    "text": "Unless you like your burger practically burnt don't bother. How does a burger place not let you pick how you want your burger cooked?! The appetizers are good (fried mac n cheese!) so go during happy hour for half off. Service sucks. However I say skip the burger, totally not worth it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SAU8ANF44wlXdDCylFYDrA"
  },
  "KtC2YHfmvSMBtGm08KhcTA": {
    "date": "9/24/2015",
    "text": "Went to This place within the first week of it opening. Arrived around 6, seated in around 20 minutes. Ordering was intuitive and is priced lower than Burgatory. The big difference is that each 1/2 lb burger is two 1/4lb patties that are cooked mid-well and not to order. The toppings are made to be the star here and they did not disappoint. The fried mac and cheese bites were great, as were the onion rings and the blazin' barbecue sauce. The burgers themselves tasted under-seasoned and overcooked, but were passable. As I said, the toppings and sides shine here.  Onto the service. We waited about 45 minutes and our food didn't come. The owner checked in on us and knew we had been waiting awhile. He returned 5 minutes later and told us they had not put our orders in, but that our meal was comped. He handled it very professionally, and I understand that this is to be expected in the first week.  I will return, especially for 1/2 burgers Tuesday nights.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QCW9e0dehBOT0hfcjv266g"
  },
  "iCH89MXmJllpLpUt_IhMsg": {
    "date": "5/13/2016",
    "text": "Awesome burger at half off in Tuesday night. Friendly staff but be prepared to wait a bit as it's packed most of the times. Wide choice of toppings and sauce.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SLCqb0JNMpQiEu9ljIwqsA"
  },
  "peNZBm6_3h0jYSElCwmesQ": {
    "date": "10/21/2015",
    "text": "Great place to get a drink, servers are very friendly. Alice was my server, great service and good value.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a95qUjzz_QI9Q-nc_5FqPQ"
  },
  "7F3OcZLaL5603E1pur8DSg": {
    "date": "9/25/2015",
    "text": "This place just opened a few days ago so I'm going to give it a little bit of a break. However, neither me or my girlfriend got the burger that we ordered, our drinks took forever, and they didn't give us the fries that we wanted even though I told the waitress to her face that we wanted the old bay seasoning. The burgers were excellent though and, apart from the staffs' mistakes, I would rate them 5*. I hope that the management can sort these issues out soon so that I can give this place the 5* that it deserves.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lwFRrzmfQeCMLoPU8MXtoA"
  },
  "dZlLcBYmFhKYhDLW_H9U_w": {
    "date": "10/19/2015",
    "text": "This place was awesome!! Great staff, great environment, good specials! Burgers where to die for! Highly recommended!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4-CUz_7OmnB9jIq6rbin3A"
  },
  "LSIrDaBah1brEzQH8DS9sA": {
    "date": "10/18/2015",
    "text": "Very good food... but our server literally walked out on the job halfway through leaving the bartender to wait on our table. Hopefully better service next time, but still gets 4 stars",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wGsKEx29joIuqHXTZQuBhg"
  },
  "ZSjdJ-guptcdwhUlJuuRuQ": {
    "date": "6/22/2016",
    "text": "I went there with a group of people for the first time and it was ehh. It is kinda of a wanna be burgatory. The same build your own burger and such. The atmosphere was pleasant. The service was awful. They messed up my order twice and my friends order twice or three times I don't remember. I ordered the fried mac n cheese and chicken tenders. The chicken tenders where tasteless with a bunch of sauce slathered on them. It looked like it was microwaved or something. The fried mac n cheese was decent, but not good enough for me to go back. I asked the waitress to get my a box so I could pack up my food, she did. After i boxed my food I asked the waitress if I can have a bag to put the box in she said she was going to get it. 10 min later no bag and I stopped her and asked her again, she apologized and said she was getting it now. Another 10 min no waitress no bag, I went to the bar and asked the bartender who gladely gave me one and I left. I will not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Pk25bOBsvemFaWKDBVBzA"
  },
  "TZAD9HAFMCxxOvrAk8uAYg": {
    "date": "12/6/2015",
    "text": "It's crazy how great the Shadyside location is but how awful it is here in Oakland. I've been to both several times. However, my most recent visit to the Oakland location, I had 2 servers. The first one was amazing and is the reason why I'm giving the place 2 stars as opposed to 1. The other one was her first day so I won't comment about that. Usually, the servers are the reason why I still come out happy and find myself coming here again. The problem I have is the food or kitchen staff, whatever the reason may be. I ordered buffalo potato bites and they came out burnt. The cajun fries came out lacking flavor and on an empty Sunday afternoon, it took nearly 40 minutes for chicken fingers to come out. This time around I didn't get a burger, but they are okay but if I wanted a burger, I'd go to their sister restaurant, Tipsy Cow since their burgers are way better. I'm REALLY not picky when it comes to food and even when their food is burnt, I'll eat it and pay for it but their food has been sub-par every time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vaLlOKH-f_XNmtIcrYo6kA"
  },
  "CGCARY_1xZOX-shXXhzogw": {
    "date": "1/26/2016",
    "text": "This seems like an odd placement on this corner... it just kind of sticks out like a sore thumb to me. I remember enjoying the place that was here before this, but hadn't been there in 6 years, so who knows. ANYWAY.  I went here maybe a month after it opened, and I probably would not have gone back for food, had my friends not asked me to go. I had a burger (duh) and it just seemed bland and kind of dry. The bread was lackluster, and just fell apart.   Other than that, I suppose their beer selection is ok with about 16 drafts, some imports and crafts. The service has been really great when I've gone, and their milkshakes are delicious, so I would go back for that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "kR8PxLu2xEyq4PPPoKJ-Mg"
  },
  "1YR47_P8gaSej3G2xm5iYw": {
    "date": "8/7/2017",
    "text": "my family of 4 walked to this restaurant after walking thru the Carnegie Museums. Parking downtown is awful. simply awful. But the walk from the museums to Stack'd wasn't too far. we were seated immediately. We all chose the build your own burger. I will say that they don't put alot of each topping on your burger. Like my son had 4 fritos on his.That being said, the burgers were awesome. Filling, juicy, good seasoning. Service was good. prices fair. Tip: look at the menu online ahead of time to get an idea of the choice of toppings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DcFd084dJR4Ze4eCtTfb2w"
  },
  "fcQMivdvZskI-0zeyKHi5g": {
    "date": "4/10/2017",
    "text": "Oakland has its share of bars and dives, but this is probably the only place that really focuses on burgers that is not McD's or Five Guys. While it's not a fast-food, order-at-the-counter type of establishment, I still love how simple it is to order by picking what you want from a written menu. The number of bun and sauce options that they have is fantastic, as well as all the types of toppings that you can choose from (up to 4 for free sounds pretty decent to me). I usually don't get many of the add-on toppings, extra sauces, or sides. The burger by itself is already pretty hefty and very tasty. The patty is always cooked just right, between medium-rare and medium, while the bun and rest of the toppings are seasoned well. Overall a great and inexpensive option for \"fancy\" burgers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "XFdfC9rV6Prqhj9Z2wht4Q": {
    "date": "6/24/2017",
    "text": "Disgusting service. Not sure what the waitress's name was and I hate to be that guy but absolutely atrocious. Had to come out of my lurking phase on Yelp to write a review.   Waited for 15-20 minutes before our order was even taken (and this was after getting their attention). Could tell the waitress was miserable and didn't want to be at work. Asked for ketchup and she said \"really? Why didn't you ask earlier?\" I will NEVER come back to this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8htojUSKfCkLiR3hXSf4yA"
  },
  "19oomkv2nAXoKMdEMVgNTQ": {
    "date": "11/20/2016",
    "text": "I've been here around 4-5 times and decided to leave a review (to avoid doing my paper...) based on my dine-in and take-out experience with a separate section for the food itself.  DINE-IN: The service is always courteous and nice. They usually apologize to me if they were a bit late in taking our orders or checking if we needed drink refills, but I'm always in a deep conversation with a friend so I hardly notice their \"tardiness\" (sometimes I wish they were more \"tardy\" so I could talk to my friend more lol). They don't usually rush you if you're finished with your food and still around talking with your companion but I think that depends on how busy the place is.  TAKE-OUT: First and last time I took take-out was with a bunch of friends. They let us sit down as we wait and first gave us our smoothies (not sure how I felt about that, did they hope that would distract us from the long wait? And I personally would've enjoyed drinking my smoothie better with the rest of my food if I had them). When the rest of our order came in boxes, they sent us away without giving our receipts and we didn't think to ask for it because of the business of the place. Wish I remembered asking for my receipt because the rest of my order wasn't there when we reached back to a friend's place to eat (my fries!! D:) and one of my friends was missing her chips. I called to see if there was anything they could do but with a lack of receipt, they were wondering why I called them in the first place... Though they were courteous the entire time, I'm definitely avoiding take-out because of the lack of focus and attention on the orders.  FOOD: For dine-in, I always get the curly fries, frosty chocolate smoothie, and make my own DIY (they call it BYOS: Build Your Own Stack) sandwich. The curly fries are yummy and it fills up about half of the plate so I always share them with a friend. The frosty chocolate smoothie looks more like vanilla and has whip cream with a chocolate sauce drizzle on top but it does taste like chocolate. It melts pretty quickly in my standards so I try to drink it first with my sandwich (saving the fries for last). My sandwich is always accurate with its ingredients and it comes our warm and delicious so I'm never disappointed with it. The price is a bit expensive according to my cheap college standards but for the quality of the food and service from dine-in, I'm not complaining.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4KTxX77Wzw4j_o3P_PiVtg"
  },
  "qitEte8xa1cEgOiWGRCZDw": {
    "date": "4/15/2017",
    "text": "Michelle was awesome. Seriously best bartender I've ever had. She made our night for my sisters 21st birthday. Drinks were good and atmosphere was right. Definitely will come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "axqIzy3Gmv4epJqqja5qOg"
  },
  "j70ltQ_sU6SzDVTwMG_yYg": {
    "date": "3/27/2017",
    "text": "Best food I have tasted in a long time. My favorite is the veggie burger. Also very friendly waitresses. It is also a good place to go out to eat with family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ULcULHYSQonL58FfdRBMg"
  },
  "4Mr5NqOTa4t3b3H-I9kmuA": {
    "date": "11/2/2015",
    "text": "It's just okay.  Slow service, average food.   The fries were the best part of my meal. I had a turkey burger that was good, but I'm not about to run back there for it.   One plus is that the price was on point. I won't avoid stack'd but I won't be making a trip back specifically for this.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xx5nJJ-kBbrfgKT6CU09Mg"
  },
  "bGnNmkdCeo5nYSJyh06f3g": {
    "date": "1/9/2017",
    "text": "The burger was delicious! But... They messed up my order slightly and the restaurant was super cold. I would still recommend it but just make sure to clearly state what you want on your burger and dress warm :)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jlxw56ELY3PeO4CXbiNkYA"
  },
  "9S-oTvZdba9iTJJ4zI8iIQ": {
    "date": "12/14/2016",
    "text": "I had a good experience but it was very cold.  It didn't help that I was sitting right where vent was but was nerve racking was that it was blowing cold air when it was 30 degrees outside.   They did seem to turn up the heat but I was more than half way through my meal.  All n all good experience and a lot of choices to your burger.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MYxq4CBYiggx5aPyoiLYuw"
  },
  "0RfwGnplzd6X2Bg6d9FItQ": {
    "date": "8/29/2017",
    "text": "Stack'd had good food--I'll give it that much. The wings are well-cooked and the fries and onion rings are burger place standard. The two visits have yielded me good burgers, too. The four stars are for the food. The experience, however, is lacking. The waitresses and hostesses rush away, giving you no time to ask questions or ask for refills. The one blonde waitress with glasses was their saving grace. She was super friendly and helpful. I went for the 1/2 off Build Your Own Stack, but veggie burgers and burgers with more than one patty--part of the whole Stack'd theme--were not included and we were not told when we ordered. When I went to inquire as to why the one burger patty was, but not a vegetarian party, the hostess completely ignored me and even walked away while I was waiting for help. If you're looking for pretty good burger not cooked to order, stop by. If you're looking for a nice dining experience, look elsewhere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a15aQ82GLyY3not0yGzOfg"
  },
  "wJX9cM7-Y19QJ-B04wr4cA": {
    "date": "1/6/2016",
    "text": "Just average.   Not planning on any trips back to this place anytime soon especially on a Pitt Basketball game night.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCkfQORGHoRCLqlFom3WbA"
  },
  "q_5tC9lJTd9WVehpHWJoCA": {
    "date": "8/8/2016",
    "text": "I've been here probably 7 times so far during the summer. I absolutely love the food, the specials are great- especially for a college student budget- but as a server myself, I can't forgive the terrible service. The first time I went, the waitress was very pleasant, helped with recommendations when they were out of what I'd planned to order, and generally took good care of us. Everyone else I've had afterwards, though, has been atrocious. There were times our appetizers were never put in, our drinks are never refilled- probably because our servers never stopped to check on us in the first place beyond getting drinks at the beginning and dropping food off. It's almost impossible to find our server when we need them, and it's taken up to twenty minutes for us to pay our bill because our server never stopped by after dropping off the check- which we waited even longer for her to drop off in the first place. I would understand if they were busy, but even when it's fairly empty, I've still encountered the same problems. I do love the food here, but I really hope the service can step up their game.  Edit: I've visited more recently, and the service has certainly upped their game. I'm very glad to see the change, as I'm far more inclined to come in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0-NNxA617PfyM8MJw8XC6g"
  },
  "cBZOM60U1WoVTHKjuSGoIQ": {
    "date": "10/7/2015",
    "text": "I don't understand the obsession this country has with crappy burger joints that think they're all that just because they offer a butt-load of toppings. Quality over quantity. This place tries to be Burgatory (which isn't that great to begin with), and doesn't even get there.   I ordered the stack'd burger with pepperjack cheese, field greens, garlic aoli, and hot pepper relish on a sesame bun, plus a side of onion rings. When the burgers came out, the patties themselves looked grey and amorphous and lacked any sort of seasoning tasted like they were pan-fried rather than grilled. The pepper relish overwhelmed everything and was just about all I could taste (Shake Shack does something similar but they don't slather it liberally on the bun). There was nothing outstanding about the burger. The only saving grace was the onion rings which were a nice golden brown.  I don't understand why people are excited about this place. Probably will not be going back.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "6k9oN67RMNtzIziwNMIaIQ"
  },
  "7Uk_TD2ENkvmAOWGQDaH_A": {
    "date": "10/19/2015",
    "text": "There is no place for a BURGER joint that doesn't let you pick the temp of your burger. When I asked what temp they cook them to, they stated: \"Near well done\". That's like going to outback STEAKhouse and they tell you: \"Sorry, we only cook our steaks well done.\"  The toppings made it have some flavor but it's not a burger place, it's a high class McDonald's where you have to tip...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5jI8HYtK1-NCfOMpSCRvfw"
  },
  "0-xWImtxFaFklsXsxotgFA": {
    "date": "6/26/2017",
    "text": "Love it. Had a chicken sandwhich with ghost pepper cheese. Amazing. Pretzel bun was good too. Stayed for trivia. Had a blast. Staff was attentive and very friendly. 9/10 will go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3po2JvXO1PiXMgS-euS7PQ"
  },
  "hAKSQghxjV1DPJRTjy9i-g": {
    "date": "6/15/2017",
    "text": "Long drive to Pittsburgh. Night before a concert. Found this place. Great food, staff and beers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r4HjFkchMIz_j7Uv8e4ZcQ"
  },
  "F4Q2JpwWZeMzjzxnD_4_TA": {
    "date": "5/7/2016",
    "text": "Do not recommend. Easily the worst service I have received in a restaurant. Had to ask several times for a refill before the waitress finally brought it. 3 of the 4 burgers we ordered were incorrect, including one burger being received with an entire piece of paper on it from the cheese. Once we finally did receive the right things, it was nothing special.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vf2jkdaSE5EMz9NfRzt9Xg"
  },
  "rMOCGvgJQtyBK09WRhseAw": {
    "date": "6/28/2016",
    "text": "Love this place! Great atmosphere, friendly staff, really good food. Great location for drinks as well! The make-your-own burgers are awesome, but I really love the quesadillas. Highly recommend going when the weather is nice because they open up the garage doors.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p_DWikAPor3mqhibzVM-lA"
  },
  "T7glcjU0wkp9G1vs4ibrZw": {
    "date": "12/8/2015",
    "text": "The service was quick and efficient! Our waitress was very pleasant and helpful. The burger was very juicy and tasty. I would highly recommend the pierogies as an appetizer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R8IEJDtTJal2zBXBIa8RMg"
  }
}