{
  "4bGDachIH5oG1iE-F1JB-Q": {
    "date": "11/7/2012",
    "text": "Food tastes good, though it's just another less-than-authentic Chinese restaurant in Pittsburgh. Don't be dissapointed. I'm just comparing it with the restaurants in China. It's doing quite good compared with other Chinese restaurants in Pittsburgh. The biggest problem is that there were really few waiters. Perhaps we didn't arrive at the right time, about 2pm... Perhaps we should say we were lucky it was still open.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sPnWgwYsEYso3179dSViIA"
  },
  "SGLVk3wEqz4cRJBcXkho_Q": {
    "date": "9/23/2012",
    "text": "Miserable dinning experience.  Lousy service!  Don't want to know who is cooking your food!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xLfV4ggzOZ5LHP8PVZbsvg"
  },
  "BYX5bqnlIqh7r2WRH5HPjw": {
    "date": "8/17/2012",
    "text": "Yo! I love cheap chinese food! This place is pretty cheap and it's Chinese! It even tasted good! Unreal! General Tso, you my boy!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qu5jGZlh4n1r2-Fempkvvw"
  },
  "70gfcitEOyV8VU-I2-jGyA": {
    "date": "1/1/2009",
    "text": "I really do dig this place for its yummy food and its very close to my work, so it is pretty convenient.  I usually end up getting the General Tso's Chicken possibly because I'm white, but also possibly because it is just that good. I'm starting to think there is something in the sauce!  I've eaten a few other things that have all been good, and the lunch menu is pretty extensive, and inexpensive.  They keep the free tea coming, and the service has always been good.  The only thing that turns me off a little to this place is the atmosphere, it is a little bit run down in the entry way and the dining area.  I'll definitely be going back again, maybe for some more General Tsos, or maybe after reading these reviews for the salt and pepper squid.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "i7W9euiwSuCklfkJgpSIkA"
  },
  "e3v6Mtxcs1_0bmiV-Wzk9g": {
    "date": "3/12/2007",
    "text": "Known as \"OK\" back when I was at school in Pittsburgh, this restaurant was the best for large groups (10-12) to share a big round table and share a good Chinese meal. Our regular dishes included fresh vegetables (do miao, bakchoy, bai chai), salty pork chops, salty squid, general tso's chicken, mapo tofu, and other dishes we would miss from back home. Also try the California Roll - it's not typical and has a bit of a Cantonese twist to it. Maybe it's the rice, but I think it's yummy. This place reminds me of a restaurant you can find in Chinatown or Flushing, NY. The food is pretty good, and if you're craving Chinese food (not the take out kind) OK can hit the spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "qDgApqioN9qReeLiNytQqw"
  },
  "VZI-0F9QtQ7TLNOu58iU5g": {
    "date": "3/16/2008",
    "text": "They can make pretty good food. Too bad they don't always do that. The quality's gone down since the time Angela C was a student ;-) Even I'm a cpl of years removed from actually eating here.  They salt and pepper squid is still quite good, probably their best dish (though the portion is much smaller).   I've also heard the most horror stories in terms of service out of places that I know of. The owner isn't nice, but fortunately, you rarely see him. The lady (the wife?) is a little temperamental but reasonably friendly.  The nicer guy (the brother-in-law?) moved to Orient express when they started that branch.   Just a historical sidenote, OK used to be in the uber ghetto spot in Oakland that Korea Garden now occupies.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B0y3xh12x1OqEzP01va1ow"
  },
  "0epHg2OHdbYD5fwMemGP6w": {
    "date": "11/22/2012",
    "text": "the first problem was the women who took my order/she was very rude and unfriendly/i found her to be a horrible person/a total bitch/i was hungry and didnt have time to go somewhere else or i would have left/a terrible way to rep for this restaurant/she should be shown the door/the food was almost as bad as the service/the steamed dumplings were doughy and taste like paste just awful/the chiken lo mein was very soggy oily and the chicken was scarce and was awful / no flavor and tough/the waitress was the worst/im telling anybody who is thinking of going ther dont do it/i might give the food another chance but no way will i deal with that wicked miserable women /its the worst service ive had in pittsburgh and the food sucks to !!!!!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "RugpsLAAj85nD0xLcgSVsg"
  },
  "C7zN-t02MvxNaiKrwyJMMQ": {
    "date": "9/9/2009",
    "text": "One of the better Chinese food restaurants in Pittsburgh. The food is pretty authentic, and while they have your standard American Chinese food, they have some genuine-tasting Cantonese dishes too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sVkbaPMRWAVvmX5P922ODQ"
  },
  "5b58Sb-4Ou6U2nF8kcMv0g": {
    "date": "4/8/2007",
    "text": "salt and pepper clamari had some kick.  we had one bad experience where there was newspaper in the meal and the lady owner still charged us!!  we banned it for a while after that but i went back for the calamari eventually",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfHo9BPvVpeuzY8lnJjN-A"
  },
  "j3aOM0ABJrtctUWxEDmVQQ": {
    "date": "8/11/2011",
    "text": "I'm Asian and I've been here probably atleast twice a month. The food here is authentic Chinese food. So some people might not be able to eat some of the food on the menu. I ate at probably every Chinese restaurant in Pittsburgh besides takeout/delivery. When I eat here, I usually have a party of atleast 6 people. In my opinion the food is very good. The waitress is also the owner. She's a nice person but she has an attitude. So if your looking for good service I think your gonna be disappointed, but if your looking for authentic(real) Chinese food. I would recommend coming here. Even for American Chinese food it has the orient taste to it. They really have lack of service if you ask many times separatly. But are you there for food? Or for service? This is the most popular Chinese restaurant in Pittsburgh amongst Asian people. What I recommend as an entree is the steamed oysters, fried calamari, fried or steamed seabass, their fried vegetable(Asian greens), short ribs, any style crabs, seafood soup, general tso chicken(real Chinese style), ginger and scallion lobsters and black beans clams. There's many more but it's for you to decide. Like I mention if your looking for good authentic Chinese food then come here. I wouldnt recommend coming here if your trying to have a romantic dinner.  Hope this post helps you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xwqYz6hi1qCZGqQhTgOqsQ"
  },
  "Qc40ic3hCLGvLOxCqlVPJQ": {
    "date": "5/21/2010",
    "text": "A good place to go to for more authentic Chinese (Cantonese) food.  All of the staff are Cantonese, I believe.  This place is decently sized, and it has a drink menu and a sushi menu.  And thank goodness, there is a small parking lot, because we all know that parking is very, very sacred in the area around CMU/Pitt.   My favorite dish: Their Bok Choy (or bai cai) is amazing.  Seasoned just the right amount, neither too salty or too bland!  It's oily but not dripping with oil.  I love it, I could eat a whole plate of this.  The duck is pretty decent too, although it's a bit high on price - about $17 for half a duck, $22 for a whole duck!  But the taste may be well worth it because I haven't really gotten this style of duck anywhere else in Pittsburgh.  Some of the dishes are questionable - they look more like American Chinese style, dripping with strange orange/red/brown sauce but there aren't too many of these.  Recommended for people craving more authentic Chinese food in Pittsburgh, and we all know how hard that can be to find.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "taPq7IxYskEWH7Vfc261pQ"
  },
  "8eE2fZ9DBlIWpYUOYGRn9w": {
    "date": "2/27/2012",
    "text": "I've been here twice.  I can't say that there is anything particularly amazing that stands out about this place, but I've never been unhappy with it.  The food is good, and it's pretty awesome they have fresh seafood.  Last time, I took some sushi to-go and watched him make it at the front counter.  A small part of me was super happy when I saw him wash his hands first (I know, that's pretty standard, but you never know...).  I like it.  I'll go back.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BTKtAXjPHjH5B3xuT4uiIw"
  },
  "lB619DR-JMyl5iTF_PFmtw": {
    "date": "5/9/2011",
    "text": "I picked this place because the Yelp reviews were positive and it said they deliver. They don't.    While I'm not expecting the most amazing Chinese food ever to exist in Pittsburgh, this was a disappointment even by my low standards.  They forgot a soup, substituted one of the entrees for another which was apparently created only out of fried chicken skins (based on the texture, appearance, and flavor...says my husband, I was uninterested in trying it), and everything generally lacked flavor.  The search continues.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "vYONWOCfSWwy6k3uqXH4ag"
  },
  "BPcyBWx2ekxo8OeJMZ9NDQ": {
    "date": "1/29/2017",
    "text": "First I do not normally review but today was just the last straw for years of bad service overlooked due to decent food. My family and I have been going to Orient Kitchen since the early 90's back when they were located on Semple st. Next to Larry and Carols. All the other reviews about the nasty lady with the bad attitude is the owner Amei. Back during my college days at Pitt. I practically lived at this place. While I am no longer that close our family do still make the trip to celebrate holidays and birthdays. Today we ordered our usual dishes. The salt and pepper squid being our favorite we always order 2 plates for our large group. The squid was not edible. It was small squid pecies almost as if the scraps of what was left over in a regular order. Then it was deep fried much too long. The texture was hard to chew much less enjoy. When it came time for a meal check i mentioned this to our server. The young lady agreed that it looked overcooked. She took it back to the kitchen only for the owner Amei to come out and refuse any type of compromise. She told us that this was a subpar ingredient order from the supplier and that there was nothing she could do to improve the quality. Then she said she still manage to sell over 200lbs of the salt and pepper squid this week, Her regular customers all complained about the quality. To which I politely asked if this was a known issue why didn't she mention this when the order was placed? I also mentioned as a long time customer you could have said the quality may be off why not order just one plate first and see. At this point she went into her usual rant, said what can she do if she takes the dish back she will take a loss and have to toss it in the trash. It sad that all she cared about is her bottom line. The insult that bothers me is I never mentioned or hinted at a refund. I was mearly curious why today's order was the way it was.As a business owner you try to please your customers. Not here. Not with her. It does not matter if your new to the place or a long time regular like me. Why spend your money at a place that treats you with bad service along with a helping of back talk. Take a long hard look at all the other negative reviews. What's the common theme??? All bad service from the same person. FYI she tries to play off her sarcastic attitude as just her personality. Don't buy into the BS.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f8sULStaQuy80M__8nhmyA"
  },
  "i6LVrf12F-huTkJe7V051Q": {
    "date": "6/8/2011",
    "text": "This by far has been the best Chinese I have had in Pgh.  The service was great, the food was clearly fresh, and the restaurant was very clean.  Two thumbs up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLVq7VSJBHZwqurwWoCmpg"
  },
  "_8hhlW1U5k4yXAmoUvTsiw": {
    "date": "6/27/2011",
    "text": "I went here last week with my friends. We decided to go here because I hit the limit of wondering what the food tastes like at this restaurant after passing by this place for an year and in fact, I live 3 min away from here by walk. The reason I avoided this restaurant is all I heard about this place is that their food sucks. I love the food here and so do my friends. I guess everyone has different taste or ppl just chose the wrong menu.   We ordered General Tso's chicken, Twin flavored fried rice, and Half fried chicken in garlic sauce.   General Tso's chicken- this menu tastes slightly different in every Chinese restaurant. At Oriental kitchen, it tasted a little different but very delicious.   Twin flavored fried rice [half chicken & half shrimp]- I do not recall the exact name of the menu but it was sth like that... anyways... whatever it is called IT IS DELICIOUS! OH MY! It was just... it wasn't fried rice. It was more of sauce on the rice bed. It was moist and never-seen-before fried rice.   Chicken in garlic sauce- I don't recall the name of the dish exactly but this on was fabulous! The skin was slightly crisp and inside was tender with perfect sauce.   Overall, I had a whole new experience of Chinese food at this place. When I think of Chinese food, it's greasy, so I get sick of eating it a little after I start eating it and regret eating it after wards. However, that was not the case this time. It was so good couldn't stop eating and eventually finished all! yay!   The only downside was they close at 10pm or so and we went there for dinner and they wanted us to leave at like 9:45 but oh, well!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UFKm0aqCsjiRQhx8ilIa0A"
  },
  "xkg32mRQ60BWfUk_YfztbA": {
    "date": "4/14/2013",
    "text": "I have known the owners of this place since I was in middle school. The salt and pepper squid is my favorite dish there. People have said that they cannot find it anywhere else that that makes it the way they do. They might have the most authentic dishes in Pittsburgh. They are one of the very few places with live seafood in the store for customers to choose from. Prices a bit high especially if your a college student, but well worth it in my opinion.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RRj_5lJqDJ-R6ytrZaErxg"
  },
  "7qvngj9AORxuFmST5bWWMg": {
    "date": "1/23/2013",
    "text": "Food seemed very authentic compared to the grease filled Chinese options in Oakland. The steamed dumpling appetizers were chewy and delicious. I enjoyed the black peper-sauced ribs but the beef hot pot and cooked spinach dishes were a little bland but still good. Like others here have been saying, the waitress (owner?) had quite an attitude on her. Her tone is short and a little angry and her English is very poor. Based on food quality alone, I would return.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DvX2Cb2yxVuOfpmLEXI_Uw"
  },
  "PzKIov6zKLmQVJLzAtqD4Q": {
    "date": "10/11/2010",
    "text": "This place has been a staple in my life ever since I moved to the city. To the untrained eye, the menu looks fairly simple - standard chinese favorites, a basic sushi menu - no big deal, right?   Wrong. This is as close as you're going to get to authentic Chinese in the city. Fresh seafood (a rarity for Pburgh), traditional dishes on a rotating specials menu and amazing hot pots are what you can expect to find.   I recently tried the basil chicken with crispy milk, and I'm addicted. Sweet, slightly crunchy milk balls paired with a flavorful brown sauce and crunchy sauteed basil are an unexpected match made in heaven. It's not on their everyday menu, but it's always worth asking if they're able to make it. (this place is great for off the menu offerings if you know what you're asking for)  If you're a veggie lover (or even on the fence), the buddah wrapped vegetables are a must. An assortment of crunchy Chinese veggies are baked in tofu skin and doused with a rich dark sauce - its unlike anything I've had before. So good! And I kind of hate meatless dishes.   The hot pots are are always a sure bet. The pork, fish, and tofu with veggies may sound like a mismatched assortment of whatever, but they work their magic. Oh yes, they work their magic. It's my favorite, but that being said, you can't go wrong with any of their hot pot offerings. Shit is dope.  I could go on and on about all the amazing things Orient Kitchen has to offer, but they're open till 11 most nights, so you're better off figuring it out for yourself.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "W5VR9UTXq20oUrNkpF7O6Q"
  },
  "Usbxwma7618J-Rfe49ey9A": {
    "date": "4/25/2011",
    "text": "The food is pretty good Chinese food, though our waitress had a lot of attitude.    We came here for a postdoctoral fellow in my department leaving.  There were ten of us.  I ordered the sweet and sour chicken under the impression that we would eat food family style.  There was a Lazy Susan at our table for sharing too.  However, food on the lunch menu comes with rice on the place, and it is not very easy to share with.  The lunch items are $6.50 and come with salad.  My egg drop soup was very good, though the sweet and sour chicken is probably what you would expect of fried food.    When we came in, the waitress complained about how we had reserved a table for 12:30 PM, but showed up at 1:30 PM.  Our administrator said that she had reserved it for 1:30 PM.  \"It's never crowded here.  Only on the holidays.  Next time, don't call me.\"  As we ordered food, a few people needed some extra time and she rolled her eyes.  I thought she had to be the owner to have that kind of attitude, so I asked her if she was.  \"Do you have a problem.  I'm just a worker here.  I'm not the boss.\"  Wow.  I think her attitude got a little better after that, but still...  One of my colleagues said that his wife and he come here a lot, and that waitress always has an attitude.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H6KpNWM0nJwwjOOZv5WpfQ"
  },
  "tO7actKOLSatQSHRUG4vpw": {
    "date": "4/27/2010",
    "text": "I love the salt & pepper squid here.  Shrimp with mayo is good, but the portion is too small for the price.  I'm used to the way it's prepared in NY/NJ restaurants -- with almost twice as many jumbo shrimp, rather than with slightly smaller-than-jumbo shrimp.  Had 4 entrees and the crispy milk dessert between 4 people.  The flavors were all there, even in the tofu dish that's called Buddha's Delight or something or other.  The price worked out to exactly $15 per person, including tip and tax, which is OK but I think $12-13 would've been more appropriate.    I like coming here with Asian people so I can get tofu dishes without being met by uneasy faces.  It definitely made for a good dining experience and I'm willing to overlook the pricing since I get homesick for the traditional Chinese family-style dining experience with real Asian food and Orient Kitchen does a pretty damn good job of hitting the spot.  It probably won't be competitive if it was located in NY or NJ where the restaurants are more authentic Cantonese and have a larger menu, but it would put up a very good fight.  It suffices in Pittsburgh, though.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "BaOolK88qGBHZOQ8ZfdVLQ"
  },
  "MQwn9b8aciCxXLrsWU_oOA": {
    "date": "9/24/2011",
    "text": "Our lunch tasted great, the service was fast but Our waitress was obnoxious. The major issue I had was that my friend clearly and concisely stated that she was allergic to fish and had a seafood allergy. She ordered a benot box and was subsequently served crab and shrimp tempura. She told the waitress she would become ill, and the waitress started mumbling/complaining and just walked away. She came back a few minutes and asked how was everything, and my friend explained her allergy, the waitress started arguing saying she knows the menu and fish is not seafood. We were polite throughout and i just asked for the menu so my friend could order something else. Then she said i will change to vegetarian.   Entertaining but strange. Not to mention, prior to the strange fish incident, the waitress raised her voice and scolded a two year old for using chopsticks as drum sticks... At the time there weren't other patrons in the room... The noise was only mildly annoying and she only made the noise for about 20 seconds, I was re-directing when the waitress pretty much yelled at my child. That being said, unlike many moms, I sincerely encourage other adults to reprimand my child, so the reprimand would have been welcome, had it been either polite or professional. The booster seats hadn't been cleaned from prior use.   This was the first time in my life that I considered not tipping, but we decided to tip regardless of the obnoxious attitude. I really loved the Chinese broccoli at this place but I won't return after this embarrassing service. Also the food was brought back on the same plate, if my friend had a more serious allergy, the contamination could have made her sick. Luckily her throat doesn't close up, it just gets itchy when she has seafood.  The waitress kept calling us lady in a most obnoxious tone, it was a strange lunch. She was so unbelievably rude, it was entertaining. She was quite nice to the business men who came in when we were about to leave. I am not sure what her issue was, but I won't be back to find out!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 11,
      "cool": 1
    },
    "photos": [],
    "user_id": "CjXB45Sivv1seEKP7mKcsA"
  },
  "NrTMbS_tA6aYcFc7F4Ve2w": {
    "date": "5/27/2012",
    "text": "I've lived in Pittsburgh for 7 years, and I have been very dissapointed overall with the options for chinese food.  If you're looking for an authentic chinese food place that has all the options (chinese green veggies are my fav!), look no further.  Great place. My only complaint is that they stopped offering brown rice recently.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "djBsPtNelR1ZQBwKQhi7GA"
  },
  "wqm4-bNUbyChM28JsxMG_w": {
    "date": "1/1/2009",
    "text": "Orient Kitchen, known as \"OC\" among the college students (I'm not quite sure where the C comes from), is traditionally the place where students go for large group dinner celebrations, but I've been there for just dinner as well before.  Dishes are usually ordered family style, which is everyone sharing multiple dishes; the usual suspects include salt and pepper squid, shrimp w/ mayo, chinese watercress (kong xing cai) or baby pea sprouts (do miao), and crispy fried milk.  Sometimes I've ordered their Peking Duck, but its nothing spectacular, China Palace serves up better Peking Duck.  Also their Twice Cooked Pork is also lackluster.  OC has a decent liquor selection, and their drinks are relatively cheap at under 5 dollars each.  Prices for dishes are typically in the lower to mid teens; a typical check tends to run around 20ish for those with larger appetites, drinks not included.  OC is pretty good Canto food by Pittsburgh standards, but for people who are use to better options for Cantonese style Chinese food found in more Asian-populated cities, the food may leave more to be desired.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "sWo7bAIUY_XBe33LKmNK9w"
  },
  "7gkP8azqbtSmrx7TEi9-Ug": {
    "date": "5/22/2012",
    "text": "This place is probably one of the more authentic tasting Asian restaurants in Pittsburgh. Don't order your typical american-chinese dishes like General Tso or that sweet and sour bs. That is not real chinese food. Get the salted-squid, and stir-fried chinese brocilli, the razor clams, the seafood soup, etc. I basically ask for whatever popular dishes the chinese customers eat. Closest thing to china-town food in Pittsburgh.  The places isn't the nicest place though. But then again, most places that are fancy, do not have authentic chinese food. lol",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y1-u2W49HeM0ta2ZuwsaHw"
  },
  "ZIu-rkNIGWEdtmQqdxbNug": {
    "date": "2/20/2010",
    "text": "I admit that its nickname (\"OK\") made me smirk. Whoever christened it hit the nail right on the head.  This restaurant is above threshold, but only just.  Its menu is classic Cantonese. The food is, on the whole, competently prepared. It's a good compromise between American-Chinese takeout and some more authentic flavors (e.g., a fish steamed in its entirety, head and all).    The quality/quantity to price ratio is not super. For example, the \"fried duck with taro stuff\" [sic] came with more taro \"stuff\" than duck. The pieces are served atop a big mound of shredded cabbage to make the plate seem more plentiful than it actually was.  The taste is good, but I'm not sure if it's $15 good. The fried tofu and scallop balls had more tofu than scallops, and the scallops were not of the best quality.  The whole fish, though I like it, is too expensive for what it is ($24 for flounder; $30 for sea bass).   The service is prompt and, in its own way, friendly. There is no ambiance to speak of, though that's not what people come here for. I have some reservations about the cleanliness of the kitchen (it has the look of LA restaurants that get B or C on their hygiene grade cards[*]), but I'm not so worried as to not eat here.  Summary: Comparing \"OK\" with other nearby Chinese restaurants, I think I prefer Rose Tea and Ka Mei a smidgen more.  [*] <a href=\"/redir?url=http%3A%2F%2Fen.wikipedia.org%2Fwiki%2FRestaurant_rating%23Sanitation&s=97daae72dffca9ad78ad86e69e116829e35e3773bb58e9676667f55c7837c9bf\" target=\"_blank\" rel=\"nofollow\">en.wikipedia.org/wiki/Re...</a>.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tGx9-4LpdahotPuNuVfNVQ"
  },
  "MP8x_Fd5OU5WwQ-V6X6qAg": {
    "date": "1/17/2012",
    "text": "Quiet place, good sushi, not a great atmosphere, not crowded, suishi not rolled very tight, but I will go back.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gciGZsXZH1xZjt5Taq5lFQ"
  },
  "Yi3vQPP6Vnu1WgWkv5_sMg": {
    "date": "10/6/2013",
    "text": "We go for the good food, the green vegetables are wonderful, but we go for the theatre of abuse too, a bonus when we are up for it. We warned our guest how volatile the lady of the house is, and how delicate she should be in her questions. She wanted to be sure that the vegetable dishes had no meat stock or fish paste, so she asked if the lady of the house knew what was in the Chinese vegetables!  Like dropping a bomb - the madam launched into her invective about how long she'd been a chef and how she knew everything, and so on, and more, much of which slid by in the barely intelligible rant....The food was good, the theatre even better, what a deal!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LZI3cC4bDvxssbcpWRyoQg"
  },
  "MbYSruLJn7e-A5lJsCLsAg": {
    "date": "10/27/2013",
    "text": "Best service I've ever had in pittsburgh! Great ambience, great food, the fried tofu (appetizer) is my favorite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JTwqvWZ_qiOzxEmdGW3hbQ"
  },
  "N4uc2AYqB7zfoPcIwhssgg": {
    "date": "7/25/2010",
    "text": "I first went to Orient Kitchen in autumn of 1994. My college friend Bany showed me it. At the time they were still located on Semple St. in South Oakland. We often went there for the amazing lunch specials, back then for literally $3.00 or $3.50  you could get an awesome nice sized aluminum container filled with steamed rice, your lunch choice and covered with a plastic lid to keep it piping hot. And a can of pop for $0.50. My favorite selection was chicken with baby bok choy in a clear garlic sauce or shrimp with egg (the egg was broken over top the rice and shrimp and was cooked by the heat!); mmm such happy memories.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3_oOvKDxkASn51PBn2ZI_g"
  },
  "a5DJ8Aq8h5XSu8CZYG5Kbw": {
    "date": "6/2/2013",
    "text": "The lady who runs the service here is extremely rude. Pretty sure she's only not rude to people who speak Cantonese. For every little thing we asked her, she started scolding us in Mandarin.  I came here once with a large group and my friend and I were ordering for everyone. We were just discussing possible dishes to get and she wrote down everything we said even though we haven't actually ordered it. We didn't realize this until the food was brought out. We didn't want to argue with her so ended up paying for everything.  We also thought we ordered too much and just wanted to ask if we could take a dish off the order. She started yelling at us when we were only asking if it was possible. Extremely bad attitude and very obnoxious.  The food here is also not that great. A lot of the dishes we ordered was pretty flavorless. And I'm talking about their \"authentic\" dishes, not their Americanized ones. Their salt and pepper squid was good, though it's hard to mess that up. Can definitely get better authentic Chinese food elsewhere.  They also cater for large parties in their upstairs dining area. Do not do this. They overcharge for parties by serving subpar food and charge a certain price per person.",
    "rating": 2,
    "rated": {
      "funny": 5,
      "useful": 15,
      "cool": 4
    },
    "photos": [],
    "user_id": "DC1hfeeSaYr2E1xwiEL81A"
  },
  "9Z68LUY7W5solGcphRnzjQ": {
    "date": "10/10/2015",
    "text": "What an awesome spot! They've been making the same great food since I used to go there in college. I had a fantastic salted fried pork, which I always loved and scallion pancakes which aren't even on the menu!!! Try Orient Kitchen if you like Chinese. If you're a first timer, though, you may not appreciate it.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1n_M6LqnqmYULPTKLg9O-g",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. Salted fried pork!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1n_M6LqnqmYULPTKLg9O-g/o.jpg"
      }
    ],
    "user_id": "y0uSLHRKzTcLwhJIfIfolw"
  },
  "TOUqxR-bmEDx4FVUECxK4w": {
    "date": "4/27/2013",
    "text": "Oh my goodness... where to even begin.  I've been going to OK for years now, and I still go/love this place until today! Love love love.   The salt and pepper squids, steamed seabass and oysters & lobsters are seriously TOO delicious! No joke. Maybe I really like seafood but those dishes are the bomb dot com! Mmmm. My boyfriend and I been going here for so long, the owners just know what we gonna order. I know some people had bad first experience with the owners, but to us they're extremely friendly, nice, and outgoing.   I do agree that the price might be a bit high for some, but with the quality and quantity of their foods, especially here in Pgh, it's pretty darn yummy so we don't mind! Def a must try if you're in the area =)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Lo1sGG8kQROA7yApMQiSAw",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. Sweet and sour spare ribs. So good",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Lo1sGG8kQROA7yApMQiSAw/o.jpg"
      },
      {
        "img_id": "IBL-fmnLySXODF5i-it8ow",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. Veggies",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IBL-fmnLySXODF5i-it8ow/o.jpg"
      },
      {
        "img_id": "v6Ciau8PEdJ-bFBFJn-CeA",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. Yummy!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v6Ciau8PEdJ-bFBFJn-CeA/o.jpg"
      }
    ],
    "user_id": "MWKGiMZIe2ZjDe8VgGkWwQ"
  },
  "zwADIwvRJVCbwVkpB6mP3A": {
    "date": "8/1/2015",
    "text": "Had a nine course meal here today. Everything was delicious and I would order once again. Place could use some sprucing up, but as long as they continue to serve food like I had today I won't complain.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oXa-v1sMbW770s8Sj-ZUCg"
  },
  "fRqLH-EF9LyXy6eMhF37kg": {
    "date": "11/5/2012",
    "text": "Get the salt-baked fried octopus! This the the best dish there.  Avoid the short ribs in black pepper sauce; 'twas quite rubbery and bland.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "N7NnC6-q0O-Gq2n_7YJkNg"
  },
  "kUVrkqUoWNscpPPzfgfG4w": {
    "date": "9/24/2017",
    "text": "The food was alright, but their online menu said a price along 5.50 for shrimp fried rice, 5.50 for chicken lo mein, and 3 dollars for spring rolls. It ended up being 9 something for each platter, and 7 for the spring rolls. I should not have paid the difference.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mDK6zAnq-iRKgZviH2WLxg"
  },
  "xPiSkGfa92hDNHwDu0OpPA": {
    "date": "12/21/2015",
    "text": "After read many low rates of Orient kitchen located in 4808 Baum blvd. Pittsburgh PA 15213 kind of feel sorry for  the Restaurant. The owner should review of their Yelp to improve in good attitude improve their honest cooking of daily fresh foods to bring the restaurant lively, instead had his son in the picture to upgrades the business. There is no customer to give them the opportunity to take good pictures to get the good impression of Orient Kitchen Restaurant. Where are the value customers ? none. Once bitten twice shy will not return, but for only those not look up in yelp just walk in and hope the owner take this opportunity to keep up with changes have return walk in customers. Hope for the best learn their mistakes and valve the customers to serve healthy and greater foods.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "7CPMAIChOvaeKqX7_-aC6w"
  },
  "tDTfCtVMusoqrVuUuJzIyQ": {
    "date": "3/18/2014",
    "text": "This is the first time I'm writing a review because I want to save all the people who is deciding on trying out this place. They have such poor service. The old guy is very rude. I asked him for water and he told me that they only serve tea and no water. I asked for a dessert menu and he was very rude when he told me that they doesn't serve desserts.   For some reason, when I tried paying the check through my credit card, it didn't go through. He started shouting at me like I'm going to run away from that place without paying up. I completely lost it when this happened. I just bit my teeth, controlled myself and paid in cash and got out of that place.  I'd rather eat in a place with bad food if the servers and waiters are hospitable and kind.   WORST RESTAURANT I'VE EVER BEEN TO!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "XOzEdZQkkFQYXCsXvDUCgA"
  },
  "ndJgNrptxSSd81lJWG9FLA": {
    "date": "2/21/2015",
    "text": "This is the best Chinese food that I've had in Pittsburgh. Don't let the negative reviews scare you away. The service was just fine. Our server was helpful and friendly.  We had the salt and pepper squid that other reviews recommended. It was awesome. The Chinese greens were also great.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9GjKIoI5HAJHS0qGvFkLuQ"
  },
  "RTppmHJp4nq1t3_BU7mNUg": {
    "date": "9/26/2015",
    "text": "Very poor dining service. The waitress has attitude and gives different treatment to customers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 0
    },
    "photos": [],
    "user_id": "cWMX5wyT8EhHd3jZ9mjznw"
  },
  "dAFhdfhUBrpMTYjB_2eSKg": {
    "date": "5/25/2017",
    "text": "Absolutely devastated by the loss of their sushi chef!!! I guess not enough people ordered sushi, but I strictly went there for the California rolls and dumplings. I guess not anymore. The lady yelled at me when I came in asking for them saying they got rid of sushi 6 months ago and then turned around and left me standing there and never came back. And neither will I :(",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v61vZgzB8NcF20eubGq7dg"
  },
  "lMBO4Lt44a3-gmMINWt22w": {
    "date": "8/9/2013",
    "text": "As far as I know, the only decent place for Cantonese food in Pittsburgh. (As per the other more negative reviews, you will want to avoid the Americanized food and you'll be fine.) In my experience, I have found the lady in charge to be somewhat bipolar. It definitely helps if you can speak Cantonese yourself and hold a conversation with her. A couple times I communicated exclusively in Cantonese and she was quite happy to help us and recommend orders. Another time, I was talking with a friend in Mandarin and switched to Canto when ordering, though she kept replying coldly in Mandarin and didn't really pay much attention to us during our meal. Maybe she was just having a bad day.  Service aside, their food is quite good. It is somewhat pricey, but this is True of their authentic Chinese counterparts as well (think Rose Tea, Sichuan Gourmet, and Hunan Bar). You'll want to try some dishes not found in these other places; their Specials menu is a good place to start. We once had a pork ribs with purple leaves (sorry for the poor translation), and the pork was delicious, all cooked up to the right point before getting burnt. Other nice dishes include various Chinese vegetables such as pea shoots or Chinese spinach, and barbecued meats such as roast duck or the roast pork pot.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "rH5oxPKRwuTay6unnR_cHQ": {
    "date": "10/3/2015",
    "text": "The general tso's chicken is a good dish. I can't really speak for much else, but the seafood is fresh. They keep tanks full of fish and lobster on location. The owners aren't great with English; ordering carryout was a tiny hassle. But I'd recommend this place to anyone in Pittsburgh who wants good semi-authentic Chinese food.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PZNJFD35ex91hk7IPo1wmQ"
  },
  "BV8jGE3iSEACfSui6zY5nA": {
    "date": "4/9/2013",
    "text": "I can't remember the last time a hostess/server's demeanor was as poor as the lady's at Orient Kitchen. The food isn't bad, but that lady's attitude is TERRIBLE.  I went here for lunch today and was compelled by her obnoxiousness to post a review.    First it was the stare when I asked for a glass of water for my friend.  No acknowledgement of received request.  No response to \"thank you\" when she brought it.  When it came time to pay, my friend and I battled for the bill with credit cards, for all of 30 seconds.  The lady loudly sighed as she went to process the payment.    With basic courtesies like this on display, I'm amazed Orient Kitchen remains in business.  Their lunch special is reasonably priced at $6.50, but I'll gladly vote with my wallet and go elsewhere to eat.  I'd rather support a place that wants its customers to return, or at least pretends it does.  If you're thinking of going to Orient Kitchen, I suggest walking a few steps more.  Chipotle is right next door, their food is just as good, same price, and their counter servers are way friendlier (at least the 2 times I've been there).",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 10,
      "cool": 2
    },
    "photos": [],
    "user_id": "g92g46cU3-KBToJV_BtSxQ"
  },
  "oqJsfcebuQ4uq7IQEQZrsA": {
    "date": "7/9/2014",
    "text": "One of the most authentic places to get Chinese food in the city. I've heard of servers being rude but had no such experience, they were quite curt though.  Went with a friend. We ordered salt and pepper squid, spinach w/ garlic and crispy chicken with dry garlic oil.  The flavors were spot on, authentic Cantonese.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h7sSvnQ3DX_yTRPcahwXgA"
  },
  "jeR7ORn5o2gS8LmLt526VQ": {
    "date": "2/24/2015",
    "text": "So it's been years since I've been back.  I've tried to actively avoid this place but a friend was coming back and wanted to come here.  Service is still terrible.  The owner, the lady, was the only one waiting on the tables.  She motioned us to sit down ourselves then threw the menu on the table.    She didn't tend to our needs.  We didn't get water.  We had to wave her down several times and finally got water.  Our check took a long time to get done too.    Reason I gave three stars is because the food is still good.  Just terrible service should be expected.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "vy6bsyGB80NX24wddBb--g"
  },
  "DW6_awiVkqJFkUSgD8csQg": {
    "date": "9/7/2015",
    "text": "worst Service I have ever seen in my life. The manager told me to leave after i refuse to sit at a dirty <a href=\"/redir?url=http%3A%2F%2Ftable.it&s=54680ebb74c3367a3004d22d6be05a67766c3d65020545365ff24774e8670168\" target=\"_blank\" rel=\"nofollow\">table.it</a> was unbelievable! avoid this place at all cost!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f3GZ7zx5bfbGnYIFSWLp8Q"
  },
  "qDbbv1l_zT0iZh-6lFTj0w": {
    "date": "5/30/2012",
    "text": "The waitress/owner is the worst I have ever experienced.  Sure, her English is bad, but her attitude is worse. I went in with allergies/a cold after 3pm. yesterday evening, hoping to get a soup to comfort me.  She tossed the menus on the table remarking that she was doing me a favor by placing the lunch menu on the table, even when lunch was technically over. She went away and chatted in Chinese with the nearby table.   She came back to my table and I wasn't ready.  It took her 10 minutes to return.  She turned up her nose at me, and began chatting (loudly) with the sushi chef.  My body language showed I was ready, but she came over when she was good and ready.  I said that I wanted soup, and asked her for her recommendation, since I was feeling under the weather.  I guess she was disappointed in my order.  She refused to apply herself to the question, giving short, sharp answers, avoiding eye contact, and then stating, \"Everyone is different,\" so a recommendation was not possible.  She left again for an extended period of time.  I had time to look around at the dirty carpet.  She brought no tea or water.  I asked about the spring rolls; were they fried?  She tried to educate me on Chinese cuisine versus Thai with such attitude.  \"Excuse me?\" I thought to myself, \"Does Orient equate with Chinese?\"  I asked if she had ginger tea.  She said there was only one tea in a yelling tone, and I had better be okay with that!  Finally I ordered the Miso soup.  It came in a very small bowl and was not hot enough.  I asked for the tea twice, since it appeared she did not hear me.  She barked at me with the equivalent, \"Alright already.\"  She plopped it on the table.  Later, when I was finished with my soup, she put her fingers all over the tea nossle.  That was effective in making me leave promptly.  Again, my body language communicated, \"Check please!\" but she chatted with the sushi chef, never letting him get a word in edgewise.  I waited another agonizing 5 minutes for the check and left a 1cent tip.  I mumbled \"Never again!\" as I left, determined to never frequent this establishment, and to discourage all of my friends and family to steer clear.  As I drove around the back, the kitchen staff stared at me in an unwelcoming manner.  I had never had such an experience at a restaurant in my life before.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 13,
      "cool": 2
    },
    "photos": [],
    "user_id": "IHhzsGkjaKpQ8ehAhSDzlw"
  },
  "Z4MwRgXeID07nWksZtd_XQ": {
    "date": "11/2/2016",
    "text": "Ok every review is spot on about the customer service from the owners , it's gotten better with us lol but the food is so good we continue to go back lol I just ignore her",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vdd1Qs3SBvom3GMkps6_0A"
  },
  "ft8ju5WiTYFRO5Ho-UOytQ": {
    "date": "3/6/2014",
    "text": "Boycott until they learn some RESPECT!  Called to order crispy chicken in garlic sauce. These were their exact words (I kid you not).  Me: \"I will have the fried chicken in garlic sauce\"  Rude Chinese: \"Stir fry\"  Me: \"I would like the crispy fried chicken on your menu\"  Rude Chinese: \"look lady you want fried chicken wing go KFC this Chinese STIR FRY\"  Me: beep (censored)  I've had it. I'm tired of these filthy low budget Chinese restaurants taking peoples money and treating them this way. I will NEVER eat here.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 11,
      "cool": 1
    },
    "photos": [],
    "user_id": "Uv-ZTmLvDllMOlccrc9sBg"
  },
  "XgiuP0Y35ozL8SZaGNu5uA": {
    "date": "9/3/2018",
    "text": "TL/DR: Best Chinese Food in Pittsburgh  Orient Kitchen's carefully prepared dishes are full of authentic flavor so often lacking from dishes served by Pittsburgh's ethnic restaurants where everything has become lazy, bland, and sugar laden. Even dishes where sweet is the goal, Orient Kitchen serves them full of texture and with a welcome complexity and depth of flavor.   I recommend the General Tzo's chicken as a first go, then branch out. Their pork fried rice, hot and sour soup and ginger chicken are all quite good as well.   I'll be back and will recommend to friends and family.  Bonus points for value: the weekday lunch is just 7.95 for rice, a main dish, soup and hot tea!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "La7sjxL5OgWUBfjpaPBNtQ"
  },
  "MU9hkVEz7_40szuDzBthqQ": {
    "date": "1/1/2018",
    "text": "Not really sure why this place is rated at 3 stars.  Orient Kitchen is probably the only really decent authentic Chinese I have had here in the Pittsburgh area.  Below is a brief listing of what I tried:  Pan fried seafood noodles:  True to tradition, the edges of the egg noodles are delicate crispy and soft where the sauce meets the noodle.  Plenty of seafood toppings though I think there should be a few more shrimps.  Long clams (razor clams) - I really do not know any place that has this and it is a must have.  Cooked just right and not rubber and the right spices here.  Live lobster made your way!  Ginger and scallions or the salt and pepper method with a reasonable price based on size is also a must here.  Fresh steamed fish, also live from the tank!  Nothing beats fresh.  I totally recommend for a traditional Chinese feast. They have been in business here for a long, long time...",
    "rating": 4,
    "rated": {
      "funny": 39,
      "useful": 51,
      "cool": 56
    },
    "photos": [
      {
        "img_id": "wMcQR4w6EOqseYGkRSxbVQ",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. long clams",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wMcQR4w6EOqseYGkRSxbVQ/o.jpg"
      },
      {
        "img_id": "NTBcBvlIneA0TDuNf9nW1w",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. Pan fried noodles w seafood",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NTBcBvlIneA0TDuNf9nW1w/o.jpg"
      },
      {
        "img_id": "m38VjJP-okKXPScepFHUSA",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. Oysters yum",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m38VjJP-okKXPScepFHUSA/o.jpg"
      }
    ],
    "user_id": "6tbXpUIU6upoeqWNDo9k_A"
  },
  "9hHhJUjHrgL6-MN6PeFNiw": {
    "date": "4/10/2018",
    "text": "Ordered take out here today and I've been wanting to try this place for a while now! From all the reviews, seems like their food is great but they have terrible service, which is why I opted for take out.  So I got the General Tso's chicken lunch special and that comes with white or fried rice and your choice of a soup! For $7.95 before tax, that's not a horrible price and I think their portion sizes are pretty decent.  I did not really enjoy my General Tso's chicken. I don't know exactly what it was but it's waaaaay too sweet and also there's a weird fishy aftertaste. They probably used too much fish sauce in the sauce but the surprising fishy aftertaste made eating the food very unpleasant for me... but the chicken itself is fried very well and you get a lot of it! But I just don't enjoy the way they make their General Tso's chicken. The hot and sour soup was pretty good and had a good consistency, which is rare to find.  I interacted with a young woman for less than five minutes but she was really nice and polite to me. Not enough to form a full opinion, but I didn't have any issues with the brief service I received. I hope to stop by again and try some of the other food on their lunch menu since the general Tso's was a miss.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8Wx5pvRgh-0I8fFPJyBIOg",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8Wx5pvRgh-0I8fFPJyBIOg/o.jpg"
      },
      {
        "img_id": "RN5SRomFhe_NNlbnFkH52g",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RN5SRomFhe_NNlbnFkH52g/o.jpg"
      }
    ],
    "user_id": "pspJkQgUOap1OjTZVMbdsQ"
  },
  "pl1_a9hLZOL46QNeGaB30Q": {
    "date": "2/7/2019",
    "text": "Fast delivery! We ordered chow fun and shrimp with walnuts for a last minute Chinese New Year meal and were satisfied. I would order from here again. Portions are a good size and the food tasted authentic",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Ds0hzlQwZUukmOwnapaFg"
  },
  "0tZvfths6_pVd6Gg_WnZEA": {
    "date": "7/12/2016",
    "text": "My order is pretty much always the same here: salt & pepper squid, mayo shrimp, and water spinach. They are my faves and I can always count on Orient Kitchen to satisfy those cravings. Other things I've tried are the fried milk (sounds weird, but worth a try, although it might be on the sweeter side for some), pork chop, minced duck (which my boyfriend loves), steamed fish, and barbeque pork. (Sorry for listing generic items; I forget the exact names of some of the dishes.) Everything is average to good.   There are a lot of negative reviews about the service here and that's definitely understandable. But I doubt it's personal, so I don't think much of it now. I really just come here for the food because they serve some pretty authentic Chinese food and they usually bring it out fairly quickly too.    Taste | 4 Atmosphere | 3 Presentation | 3 Service | 2 OVERALL | 3.5",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 8,
      "cool": 6
    },
    "photos": [],
    "user_id": "HC5zLdut4caN1VPqxqRsMw"
  },
  "tLTYgnHBEeVSetOnrcmz8Q": {
    "date": "8/26/2017",
    "text": "The restaurant definitely isn't super classy... the chairs were ripped and I could even see the foam! The service was okay-the waiter/waitress didn't come to us immediately and the food wasn't served as quickly as past Chinese restaurants I've been to. Although the waiter who took our order was pretty impressive since he didn't write down our order and still remembered the 6 dishes we ordered. The food was overall pretty good. I ate chicken fried rice- in my opinion it was not flavored quite enough and there weren't many other ingredients (like vegetables).   I might go back, but I'd definitely only order take out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tDr5cFkE-9uJhB1VRnH4kA",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. Sign",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tDr5cFkE-9uJhB1VRnH4kA/o.jpg"
      },
      {
        "img_id": "ipYbXfnPq8KbD3ryIQMUqA",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ipYbXfnPq8KbD3ryIQMUqA/o.jpg"
      },
      {
        "img_id": "HaT5ZHyXf7Fn09Ksiyi9UA",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HaT5ZHyXf7Fn09Ksiyi9UA/o.jpg"
      }
    ],
    "user_id": "9MU6L4v83qo9jmutekcWMQ"
  },
  "wtn6iQIRqCzrcR7Lhk0U3A": {
    "date": "5/5/2017",
    "text": "I came here for the lunch special price ($7.95) and ordered the General Tso's chicken with egg drop soup. I was told that the General Tso's chicken was the best around Pittsburgh but in my opinion, it was too sweet and reminded me of Korean Fried Chicken. It only came with the chicken and white rice on the plate. But I wished there were some vegetables to balance out the sweetness. I liked the crunchiness of the chicken though. The service was nice and it wasn't too busy during lunch time.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wvT6kA-OKp63mdO__B8KCw",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. General Tso&amp;#39;s chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wvT6kA-OKp63mdO__B8KCw/o.jpg"
      }
    ],
    "user_id": "bryAPtwnnMYjbzoOWHzbWg"
  },
  "AGLgxIFcl4kqh5rwmA-DgA": {
    "date": "12/28/2017",
    "text": "Been coming here for years. Best salt baked squid and ma po tofu. Was sad to see sushi is off the menu as it was quite good. Service is quirky but that just adds to the experience. Food is fantastic. Love the fresh orange slices at the end of the meal.  The woman everyone is talking about is a little off putting at first but now I just find her endearing. One time when they first opened we had delicious sherbet for dessert and when we went back and tried to order she yelled at us and said they've never served dessert there. Just have to laugh it off. Now when my brother and I go she remembers us because probably have been coming here for 10 years.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RYtU3cDC-TfCw3biYvZmkA"
  },
  "3RTRE3CF9k51FWBeZV_jhA": {
    "date": "5/19/2017",
    "text": "I've dined here a couple times now, and Orient Kitchen will become one of my usual dining spots. In the evenings, there aren't many people so I feel like I'm guaranteed to get a table for dinner. The service is quick and very friendly. The food is great; not greasy. I personally think they have the best wonton soup in this area. The broth is full of strong flavor and the wonton is soft with tender pork on the inside. The shrimp fried rice is my go-to. I have a friend who really enjoys their general tso tofu so tofu is an option as well; he's also a fan of the egg drop soup. This place is good if you're looking for a chill night with good Chinese food. The menu is extensive so I don't want to get stuck in my favorites but explore more because I'm sure there are other delicious items on the menu!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "UyXqGEKod-veD6m6Hq0EDw"
  },
  "BUrJRtDk88VUMqghd-uXyQ": {
    "date": "1/29/2016",
    "text": "It is my recommendation that you never go to Orient Kitchen! While the food is on the pricier side for local Chinese restaurants, the large issue at hand is the horrible woman who runs the place. I have never experienced someone in the serving industry speak and treat customers so rudely!   Orient Kitchen is near to my apartment so I often go with friends. The aforementioned woman is usually pretty rude but whatever. Last visit, I went alone to pick up take out and I was upcharged simply because she thought she could take advantage me not knowing that I fully comprehend Chinese.   My friend politely asked her why that happened to me while we were ordering tonight and she proceeded to say that if we are so poor we shouldn't be eating in her restaurant. She went on to say that she's rich and has a big house and doesn't care if we are in her restaurant or not. She didn't leave it there, she went on to the next table to talk about us. Jokes on you lady! You just talked shit about me to my friends who also happened to be eating, haha!  Oh yeah lady, one more thing, careful when you talk about customers in front of their faces. Some of us white people can speak Chinese too. I know what you said about me. You've been warned.  1 star but should really be 0.0000000001 stars.",
    "rating": 1,
    "rated": {
      "funny": 7,
      "useful": 15,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9c-rAaFUOU_nwdItWK-8Sw",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. Sweet and sour chicken / 酸甜鸡",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9c-rAaFUOU_nwdItWK-8Sw/o.jpg"
      },
      {
        "img_id": "7SXQfJwrpvlXdMxmsikydQ",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. Spicy tofu / 麻婆豆腐",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7SXQfJwrpvlXdMxmsikydQ/o.jpg"
      },
      {
        "img_id": "S32EgRclp2GSPmT8QiXoLw",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. Sweet and sour fried bone / 酸甜排骨",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S32EgRclp2GSPmT8QiXoLw/o.jpg"
      }
    ],
    "user_id": "Pe5eoZvuQYif9-jPfrFSTQ"
  },
  "uRNHrGpUMZBWd2_yIAOKhA": {
    "date": "5/20/2017",
    "text": "Customer service wasn't the best and therefore I would give it 3 stars instead of 4. This is my second time going to Orient Kitchen for the lunch special and I would say the food is ok for the price but I've definitely tried better for a cheaper price. The general tso's is worth giving a try!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mCBskteapHTeYWXflcZfBw",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mCBskteapHTeYWXflcZfBw/o.jpg"
      }
    ],
    "user_id": "fZI7Cqj3QOnOfcBNGtLWlQ"
  },
  "epjD4VEnZTg9hmUGvX3LiQ": {
    "date": "5/8/2015",
    "text": "We were in the mood for some Cantonese food one night, and thought why not go back to Orient Kitchen since we had such a great meal last time. This time we ordered the shrimp with mayo, stir fried snow pea leaf, and fried bean curd with mushrooms. Aside from the shrimp with mayo, that was on par with typical Chinese take out restaurants, the two other dishes were pretty disappointing, at ~$10 each, they tasted like a home cooked meal that I could easily have prepared myself. No offense to Orient Kitchen, but we'll only be sticking to specialty dishes from now.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 0
    },
    "photos": [],
    "user_id": "SaYctOj-v2LNNkD4EXtZUA"
  },
  "IdUkHQYbFFkobSpbqiC_VQ": {
    "date": "7/31/2016",
    "text": "I will never go back to this place . I went to this restaurant so many time and every time this old fucking bitch give me the worst service attitude in the world. My friend work the restaurant, so I come a lot,I thought that the old woman's only joking to me when she said all those mean thing\" like you are gay\",\"you are fucking  stupid\",\"you are so poor I don't want you be here\",but this time she said to me \"go to hell\", and I don't even know why, she said this couple time so I get it she is being serious.  All my friend already refuse go back to this place! Cuz she said all the really really really bad thing to them.  So tonight I can't take it anymore I have to be mean to her\" fuck your mother\".  Well. I will never go back to this place , and I hope everyone who dinning there could have right service!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "eSB0EllEK9yXf1x8I-Tjpw",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. I strongly recommend that you never go to this restaurant",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eSB0EllEK9yXf1x8I-Tjpw/o.jpg"
      }
    ],
    "user_id": "eW5QgRMfEk-zEf5FID-VJg"
  },
  "5HkcMO8w5FU0C27-9pIK7w": {
    "date": "1/31/2016",
    "text": "Highlighted points: Nearby parking Terrible service by lady Racially privileged service Better food than the common Chinese restaurant Overpriced Careful of being cheated in cost  Overall decision: Not worth returning to again. Sorry.   I really wouldn't recommend this place to anyone unless they knew Chinese. That said, quality service is given to those who do speak Chinese and irritable service to everyone else. Not only that, but when they cheat you with the receipt (When the values on the receipt for match the values listed on the menu. OR when they give you rice without asking them charge you for it), at least Chinese speakers can argue the Chinese written receipt.   That said, service by the lady was terrible. A drop of spicy mayo was spilled while we poured it on the sushi, and she made a snark sound while making a face while standing at the table with us. She told US to move our plates and to \"Hurry up\" so she could put more food on the table. She rushed us the entire time and i never felt comfortable until we were finally eating. The only offset was the gentle man who helped with serving.   The ONLY reason i will give them a 2 star rather than a 1 star is because their food was better than the average Chinese restaurant.   I'd never thought I'd write a review, let alone a mean one. That said, this place really ticked me off and ruined my family's experience. 10/10 won't eat here again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xp6WAIOBn1_gp1g0aQumAw"
  },
  "xGGzwlaJhVdkZ674JVVx4g": {
    "date": "10/1/2017",
    "text": "One of the few Cantonese restaurant in Pittsburgh so I like it. They have a lot of authentic Cantonese dishes since the owner is from Hong Kong.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eJsdSZ7-IyatMVD2Us-lGg"
  },
  "Gn0ECAfP3yS2s73GHZp_mA": {
    "date": "2/1/2016",
    "text": "I will NEVER come back.  First time and LAST time! I honestly feel this place does not even deserve 1 star.   The lady who served us happens to be the owner. I've never met anyone that has been so disgustingly rude working in the food industry. We had to ASK for water. She rushed us to order our food. Told us to \"Hurry up\" clear the table. I had ordered squid with mixed vegetables. I couldn't even eat the vegetables why? Because they smelled and tasted like it was old and rotting. Reviewed our bill, prices on the menu clearly did not match up to what was on the bill. We were charged for RICE...omg, where they do that at??  I've never in my life been to a \"Chinese\" restaurant and was charged for rice lol. How absurd. Worst 92 dollars I have ever spent . They should be happy I even left a 20 dollar tip. Yuck!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "TCVU6tlrqMf2RAZ4ZlQtLQ"
  },
  "xtfpdYpZn_y2fdE3tMpyag": {
    "date": "5/14/2014",
    "text": "I would give 4 stars for food (if you are looking for Cantonese food, specially fish dishes.) They have  a lot of selections of seafood and most dishes here are served in a big portion. However, if you are not familiar with the menu and don't speak Cantonese, you are likely to get bad experience with their service. As many reviewers mentioned, the lady owner is likely to be rude. That's why the overall review stars goes down to only 3.   To avoid this bad experience, don't expect that you will be treated like a typical good restaurant should do. Think that the rudeness is her style (even it's not acceptable). Just ignore her bad service. Don't ask her too much about the menu, but a few questions are still ok. Don't rush her. If you are not in a good mood, don't go there. If you won't go with Chinese friends and want to explore some unfamiliar dishes, you should do some research or check out their menu first.  Some recommend dishes: Peking Duck Salted Baked Squid with Hot Pepper Salt Baked Pork Chop Seafood in bird's nest (Stir fried seafood with vegetable served in a deep fried taro basket) Shrimp with mayonnaise (deep fried shrimps  tossed in sweet mayonnaise) Half Boiled Chicken with Ginger Sauce (bone in) (tastes like you dip boiled chicken in a soy sauce mixed with ginger) Etc.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qQSmoYhgOOglhcDxyoZepA",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. Salt Baked Squid With Hot Pepper and Sautéed Tofu (mixed shrimp) Ball",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qQSmoYhgOOglhcDxyoZepA/o.jpg"
      }
    ],
    "user_id": "nH7IVeL3tSMpvzgE8hm4aw"
  },
  "LSyXMc2Hn7MqMGRfVlFRlw": {
    "date": "3/18/2018",
    "text": "Too much oil for my taste. Ordered salt and pepper squid and twice cooked pork. Both came with so much oil. The service is alright, but I probably won't come again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QAmBDDyoxAeguT5lSA-zyw"
  },
  "qSbaVc81rWEPl7LJf64LVg": {
    "date": "12/26/2017",
    "text": "This place has some of the best Chinese food I've ever had. Their salt baked squid melts in your mouth and has the perfect crunch -- I guarantee it is nothing like the fried variant you'd find at other restaurants.    Their short ribs, pan fried flounder, and spicy chicken with basil are all delicious. Those are my go-to dishes. Unlike the other clients, I've never had any issues with the service here. The food here is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOVd50v96rMKmODqSAN7Zw"
  },
  "41IYDohh2cpV-r_TvZCE6A": {
    "date": "4/16/2015",
    "text": "The reason why I'm giving Orient Kitchen 4 stars is for just one of the dishes I had there: Sauteed Shrimp with Crisp Milk. WOW, it was so delicious. Crisp milk is basically fried condensed milk and it is a crisp donut with condensed milk inside. You can also order just a plate of them. Surprisingly they're light, fluffy, creamy, and super crispy - the perfect custard donut. And since you can get it with shrimp, it's a savory and sweet dish that really entertains your taste buds.  Their other food is just okay, but I would go back just for the Crisp Milk.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5yc0CSEfjqkS1_DprhP2MA",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. Close up of crisp milk",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5yc0CSEfjqkS1_DprhP2MA/o.jpg"
      },
      {
        "img_id": "qIZF5hA_BgCJzQbg-QuShQ",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. Sautéed shrimp with crisp milk and mapo tofu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qIZF5hA_BgCJzQbg-QuShQ/o.jpg"
      },
      {
        "img_id": "Gtk0UCYdXub_JsINWuwRfQ",
        "caption": "Photo of Orient Kitchen - Pittsburgh, PA, United States. Shrimp with Crisp Milk (which are basically mini donuts with custard inside) - THE BEST!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Gtk0UCYdXub_JsINWuwRfQ/o.jpg"
      }
    ],
    "user_id": "0bGdYe-echFWlzvcmenasA"
  }
}