{
  "gBoD7bTw4mQ7D6nmOs2EPw": {
    "date": "7/3/2014",
    "text": "Good food. Excellent beer both on tap and bottled. Service excellent, and good live music, although less bands are being featured as of late.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sJedR6oSHr7_5EY6KYktnw"
  },
  "RLtJlIR7D3FTPFMlWdAo-w": {
    "date": "10/5/2015",
    "text": "Overall I felt the meal was ok, not spectacular, overpriced, and incomplete.  This is an Italian restaurant and you have to ask for and pay extra for a slice of Italian bread?  Are you serious? I ordered chicken parmesan and that is ALL I got;  a piece of chicken over a small bed of pasta.  Nothing else.  No bread & butter or olive oil to dip, no small salad, no veggies, nothing.  Had to ask for grated parmesan cheese to sprinkle on my chicken and I received a tiny little plastic portion cup 1/2 full.  My bill with tip was $25 and I left hungry.  The atmosphere and food were ok but I'm sorry to say there is no way I will go back.  The other two folks I was with share the exact same opinion.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Be6XTSCHZAxySdORM7IcCw"
  },
  "ixvgx8kLBbyss-opwXklMQ": {
    "date": "8/6/2015",
    "text": "While just outside the city limits, this place is truly a Pittsburgh dining gem. Firstly, the ambiance is top top notch including decor as well as in or outside dining options. The food is also excellent. While traveling extensively, I have never had better lobster bisque. The menu is diverse with both a variety of small plates as well classic entrees always with a tasty twist. Some places lose luster after 3 or 4 visits but Cafe Notte has always been ON POINT whether I've ordered lamb, beef, pasta, seafood or just appetizers. With that, There's no need to mention a favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LicYJJYhd0hPXyn3HBynQw"
  },
  "hOtukuc_MeQxuwn_GwAv5g": {
    "date": "2/17/2013",
    "text": "Food is excellent but attention to service leaves much to be desired. Ordered wine, tasted it and did not like but server never offered to take away or bring another bottle. Very awkward situation.  Then the kitchen was backed up even with several empty tables.Clearly need to better calibrate the kitchen staff against the demand.  Waited more than an hour for food and had to prompt the server to get our dinners.  No apology, no offer of service recovery. Spoke to the managers/owners and they offered to deduct the wine (that we didn't drink) but expressed very little empathy or care.  This is a nice spot, atmosphere, etc but need to dramatically ratchet up the service to become one of Pitt's top restaurants.    Will not return for the foreseeable future.  Many more attractive options.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OnUCi72LxXAirlN-Vn7LpQ"
  },
  "RcVLd-5jhJ9066gRdXkrbA": {
    "date": "1/17/2010",
    "text": "At long last, a great continental cuisine addition to Emsworth. Unlike nearby Willow and Andora (both decent but severely overpriced), Notte serves up smaller portions for reasonable prices - shrimp risottos, three kinds of fliet mignon, the best lobster bisque in town, and a collection of about 25 equally delicious dishes. The wine list is compact but well-vetted, and there's a full bar to boot.  There's a stone hearth and wood-burning fireplace in the center of the intimate dining room. There are only 6 tables, so be sure to arrive early if you want a seat. If you're going alone, there's bar and window seating as well, and in warmer months, there's outdoor seating.  Open early for breakfast and late into the night for drinks and dinner. Highly, highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sum_4DNiOAicZIGwW8xqJw"
  },
  "Jbc9g2BJXCTnHV7vlobybg": {
    "date": "12/28/2012",
    "text": "This place has always had great atmosphere but on our last visit they added the key to restaurant survival- good food! And a friendly staff. It's now a place where we enjoy going more often. The salmon is done perfectly and \"wine down Wednesdays\" help defray the cost by offering half price bottles of decent wine. Hats off to the owners for making the menu changes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oIvEhn319heqx6hhaXMNuA"
  },
  "AjCveQVPB4TAwlGExfa7mw": {
    "date": "9/19/2012",
    "text": "Wednesday night!  Half price wine!   Hewlett and Anderson  entertaining!  Our waiter, Michael was personable and efficient.  The salmon and risotto was done to perfection.  It got chilly, but not to worry, they offered a cozy blanket.  Can't wait to go back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7gLlQicy7ct7cfKlUX5mLg"
  },
  "ddMY_mwMwyyy1TAIXPepWQ": {
    "date": "8/20/2011",
    "text": "This is one of the worst places I've been to in the city.  We ordered the crab bruschetta as a starter, which tasted like canned tuna on dried toast.  It stuck in our throats it was so dry, and completely lacked seasoning.  The atmosphere was terrible - it's on a dumpy dirty street and the other patrons were incredibly off-putting.  We paid for our drinks and appetizer and left to finish our dinner elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "y81808aeGu5YuZSaDiFC8A"
  },
  "6O61W6cnsZ3z66tcs8517w": {
    "date": "10/26/2013",
    "text": "After our Sept visit to Cafe Notte, we decided to have my son and his wife's rehearsal dinner there.  Glad we did.  Owners Debbie and Jerry made us feel like we were at home.  Chef Eric came out to meet and check on us, our service was GREAT, and the food again was fantastic.  We're a tough crowd to please, but they found every way to do so.  Take time to stop by look check out the homey, living room environment of their party rooms, or stop by for dinner any day of the week.  You'll be glad you did.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "70fTwHhdbLqOYoPVBa811g"
  },
  "rEgk6xY3jaLBtsExfxuPUw": {
    "date": "6/7/2011",
    "text": "Love this place.  Nice to have a decent restaurant just a few blocks from the house.  The food is great, and the atmosphere surprisingly good considering its located in an old service station/motorcycle dealership.  One thing to remember, the food is tapas style, so the portions are smaller than what you get in most eateries, which is fine by me since I think most places give you way too much food.  Aside from the specials, all items are al a carte as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "PgW62VipRIzrauhQtGWt2g"
  },
  "2AGfp8h3drYXvaPn9g-vUw": {
    "date": "1/29/2012",
    "text": "This was my second visit to Cafe Notte, after having brunch there when they first opened a year or so ago. Two friends and I met there for drinks and dinner on a Thursday night, which is acoustic guitar night -- in the little room that is the Cafe Notte dining room, even quiet acoustic music is too loud, so needless to say, this drastically affected our ability to have any conversation.   There was one server for the room that night, and the restaurant was full, so service was on the slow side. We were offered a bread plate while we were reading over the menu, which we gladly accepted, only to find out when we got the check that we were charged $2 for the bread (generally a pet peeve of mine to be charged for bread!).   Two of us ordered mussels -- a bowl of probably 1.5 dozen mussels in a pretty tasty broth. I was a little nervous about ordering mussels here, but they were fine. The third ordered a risotto, which she considered just okay.   There was nothing wrong with our visit, but it just didn't wow me.  Our bill was $85 (bread, 3 appetizers, 4 glasses of wine & a dessert), which is average, but between the loud music, the poor service, and the general okay-ness of the meals, I think we were all underwhelmed, and probably won't return to Cafe Notte again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xLkUeam-obAxK7nwAl1pMQ"
  },
  "2bphH1hip1_1SxqQh7xMJQ": {
    "date": "6/13/2013",
    "text": "I went to a private event here and it was lovely. The room looked great and we had a very attentive staff helping us the entire way with setting up to helping us pack up our leftovers. The space itself was very cute and thoughtfully decorated. Our food was well prepared and we had a great time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KMinNwBquxsvvjeE91Mc2w"
  },
  "VS9vH878Byv9B58iNbV7uw": {
    "date": "1/23/2010",
    "text": "We hit Cafe Notte on Wednesday after a strong recommendation from Annie's sister, Lizzy.  Lizzy is an epicurean, so this obviously was a must visit.  Prior to visiting it was on my radar because I'm always looking for good spots that are convenient to Annie's home, besides \"Monterey Pub\" (which I love).  There was also a quick note about it from China Millman in the post and a more detailed review in the Trib.  The place is relatively busy for a Wednesday night.  Upon entering the restaurant I'm struck by the beautiful large wood burning fireplace, just glowing and adding much to the ambiance, quite romantic actually.  Then I look above and the ceiling is sparkling with these almost \"star\" like lights.  I ask how they did this and from the explanation seems like a rather time intensive touch.  There is not an empty seat at the bar when we arrive (around 7PM) and everyone at the bar seems to be having a good time.  The young bartender seems to be keeping the crowd well lubricated and properly entertained.  The bar is beautiful, polished and with plenty of wood, obligatory plasma and fully stocked bar.  There is also exposed brick and flattering lighting.  We end up seating at a \"hi top\" near the bar.  We were greeted initially by one of the owners, Debbie.  She walks us to our table and answers a couple quick questions I have about the place and Annie introduces herself as one of the famed \"Sweeney sisters\".  We sit and are quickly greeted by a very warm and professional server, Michael.  He gave us top notch, professional and friendly service all night.  He even gave me a good tip on ordering my favorite beverage...get to that in a minute.  The bread comes out warm and crusty with a great dipping sauce.  I believe they bake the bread in house.  In fact I'm guessing almost all of the dishes are made from scratch.  I start with a dirty martini, ketel one, rocks...Annie's driving so she orders a diet pop.  Unfortunately, they don't have ketel one so I settle on goose and then Michael gives me a good tip on ordering this drink.  I've been noticing at some places there is a $2 up charge for \"ice\".  He says that has to do with the new hardware, etc. at many restaurants and just to order \"kettle\" dirty, rocks and this will basically give me the same drink with more alcohol for $2 less.  I start with the scungilli salad which can be a disaster if not prepared properly.  This one is terrific.  It's thin shavings of conch, not tough at all served with the perfect amount of acidity.  This is a good start.  Annie has the cheese soup, which is good but not noteworthy.  This is a tapas style restaurant.  I wouldn't call it tapas in the traditional sense, but nevertheless small tasty plates.  Each costs $11.99 and you can add sides for around $5.  Annie gets the 6 oz filet cooked medium. It's good quality (not prime, but good) and cooked perfectly for a reasonable price.  I next have the Shrimp Mozambique.  There are four shrimp served over risotto with a beautiful looking reddish sauce.  The risotto is good.  It's cooked well and seasoned correctly.  The shrimp are a bit overcooked.  They aren't bad, but not great.  The sauce which I was really looking forward too is surprisingly bland.  I think if the chef would have let the sauce reduce for a while longer he would have achieved a much more complex flavor. Lastly, I order the Ahi Fan which is tuna crudo served with a wasabi sauce on the side with tomatoes and supposedly a citrus sauce.  The tuna is fantastic quality, however because of the lack of acidity the tuna can't quite shine until I ask for some soy sauce to enhance the flavor.  Once I got the soy added the dish was much better.  Overall, this is a good restaurant and a great new addition to the area.  I'm sure I'll be updating this review to four stars eventually once I sample more of the menu.  Overall, it's a pretty good value as well.  The total for all the food and a couple martinis' was around $60.  I'll be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2J3FVHKS3Iy_pzJJGfr2kw",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States. ahi fan",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2J3FVHKS3Iy_pzJJGfr2kw/o.jpg"
      }
    ],
    "user_id": "1TkFY3Z_g62uZ6xNhAhXoQ"
  },
  "CT4WW5k0LSyFWNNG602FBg": {
    "date": "2/17/2010",
    "text": "3.5 stars. Bonus for them fitting us in on a busy Valentine's weekend. Small place, fireplace adds a nice ambiance. Bar seating for about 10 people. Cozy, but loud due to the size of the space. Generous wine list with bottles ranging from $20 and up. By the glass as well for acceptable prices. Tapas-style food. Scallops had 2 to the order. The mango salsa was tasty. Bread and oil (1 buck) was a nice touch as well. My shrimp Mozambique had 4 pieces. Sauce on the shrimp drizzled down to the risotto, and while the shrimp was good, the risotto was soaked. It was just too much liquid and overwhelmed the perfectly cooked base of the dish. Service was ok, but not over the top nice, but it was a holiday-ish evening, so I'll give a pass on that. I liked the place, and would give it a second chance. See facebook for their menu and daily specials. No website up and running yet--- weird.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_kXetDQBO-4lPclvdGpQRA"
  },
  "2D8iNTwfo7xi91BYb8d4-A": {
    "date": "4/1/2015",
    "text": "Had drinks and some food with a couple of other moms after a PTO meeting. We sat outside to listen Bucky on the guitar. We were grateful for the heat lamps near our table and even blankets provided by our server.   My lobster bisque came out steaming however for $9 a bit more in my bowl would have been nice. Plus it didn't come with bread. That had to be purchased separately.  In the future I would choose Cafe Notte for a special occasion but not for an impromptu night out with the girls.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "wkokiWbTL9yf-NJUK6cb8Q"
  },
  "4PcWWzvGwUfSmf4IwbvuKw": {
    "date": "9/2/2016",
    "text": "Excellent service and atmosphere. Thursday's with Bucky the music man are so much fun with friends or family. Go say hi to Angie while you're there",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P3TXmwKJoX2PNGPcRUNdCQ"
  },
  "95htvcx5WSObA9hbHq_GBw": {
    "date": "9/17/2014",
    "text": "Not even going to write about my partner's meal as that's a whole other review. I have to say that the one star is for the nice waitress and the cozy decor. Other than that, I won't be going back. The $9 (ice stacked to the brim) cocktail I was served had half rotted mint leaves (no, it wasn't because it was muddled) and granular sugar, both of which added nothing to the drink aside from unwanted textures.  Looking at the meal itself: I laughed when I saw the \"vegetable medley\" on my plate as it looked and tasted like the kind you'd find in giant eagle's frozen food aisle. As for the meat...I had already eaten my duck shank medallions when I discovered that the remaining duck shank was definitely undercooked in the middle. If the pre-cut medallions weren't drowned in sauce, I would've noticed before I sliced into the remaining shank. The waitress was nice enough to bring it back to have it recooked but, even then, the middle was as undercooked as it was when I sent it back. I left it on my plate, paid, and left with my partner disappointed. Aside from all that, the disjointed flavor combinations and lacking presentation did not warrant the price tag. Oh. And the food poisoning. Really hated that side effect.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "zrfwKTHOmvNAHGWoRertig"
  },
  "jkAQe_sBTr3ieyDGogpIvw": {
    "date": "12/24/2016",
    "text": "We had the most amazing dinner date last night. We started with the white sangria, such a smooth flavor. Our meal was he sea bass and stuffed chicken. The flavor of the sea bass lived up to my expectations! we finished our meal with lemon cello dessert and coffee, which was fresh, and perfect lemon flavor. Would highly reccomend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zCEJzR8ur-3wVYOANxkZMQ"
  },
  "gHI8uYxeoX3K6sXiy98Ywg": {
    "date": "4/25/2013",
    "text": "Monday night is rib night! You get a half rack of ribs & fries for $11. The ribs are great and I always find myself comparing all ribs to here.  One night we stopped down and had some beers outside by the fire pit. There are a few chairs around it, & we sat next to a friendly older couple. We ended up chatting away with them for over an hour. Precious times   Their ciabatta bread with dipping sauce is great too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "H81AUen0M2dr6HQt4LoPog": {
    "date": "7/27/2016",
    "text": "They hit this one out of the ballpark,  My wife picked this restaurant for our anniversary dinner, and I could not have been more pleased. The service was superb and the meals were great. My wife had the Salmon over polenta, which she loved and I tried the Veal Bolognaise which was exceptional.  A great selection of wines and beers. Make it a point to get there for happy hour, 4:30-6:30.  One of the best cannoli I've been served in a restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oGIeUGutL2ilSRrecfnHKQ"
  },
  "jijiuj7EiCq0wMX8Kpfa7g": {
    "date": "5/27/2014",
    "text": "Highly recommend. Very cosy place. Had a small business dinner. 2 of us had Shrimp crusted Trout (excellent) the other steak (also excellent). Nice quiet place. Staff is friendly. Private owner whom was in house the night we dined. Waitress was very friendly and suggested choices. What a great dinning experience. Priced welled for the atmosphere and quality.  Nice beer and wine selections",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7HunCzkezjNCRPxcZzySlg",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States. Bar area",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7HunCzkezjNCRPxcZzySlg/o.jpg"
      }
    ],
    "user_id": "hpPQew4ZQeHlCFdcqvQRbw"
  },
  "iMg5u5fewiMCMPQHzw1Khw": {
    "date": "10/16/2016",
    "text": "For several yrs. I drove past Cafe Notte on my commute to work and thought I'd like to eat there it looks nice. Last night my husband and I had dinner there with friends.  As we entered, we noticed a wedding their banquet room.  I ordered the sea bass and my husband had the flat iron steak.  For the price, the entree was a very small portion.  The risotto was delicious and almost as good as risotto we enjoyed in Burano, Italy.  My husband thought the flat iron steak was perfect and cooked to his liking.  Now those were the highlights of our visit.  From charging for bread, to serving a 1/2 cup of coffee, we will never return.  Additionally our server was very assertive in offering various up charge items throughout our meal and this was quite annoying.  overall the service and experience was substandard and should not have been open while hosting a private event.  All in all - Cafe Notte hit a sour note on our visit.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Bnxl3GYdYI68nLT36Mh-Q"
  },
  "H67SVQ1iYZQugJlLwKdozw": {
    "date": "7/20/2015",
    "text": "I took a friend here for a birthday dinner recently. It's an interesting place. From the exterior, it doesn't look like there would be excellent food, but there is. The menu is very northern Italian, with apparently some Asian influence. I'm not sure if that's a recent trend with the chef, but this is my second time there and I stayed with the dishes they're known for (Northern Italian) We started off with the crab cake. Decent size and very little filler (I.e. panko or breadcrumbs) Taste was excellent. We also had the artisan cheese plate and the kalamata fillet. I enjoyed this one a lot. It has a red wine reduction drizzled on top of the rolled fillet mignon, goat cheese and kalamata olive. I ordered the Notte Burger for my entree. It was just a well done, very nice burger with quality cuts in there. It's fresh ground in house I was told. Overall, a very decent experience. I would definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "e3dtWb_6aL5-afvXM9f7qw"
  },
  "1j7SdFeRuoBEj9rkKFGw0w": {
    "date": "7/9/2014",
    "text": "The food was delicious and I loved the atmosphere. The music was fantastic! The wait staff and owner were very friendly. Fantastic food for a good price!  I would definitely recommend this to friends and family. I would also return again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2cZB37xOQMeHiCGTJ46PSw"
  },
  "akIEJIn35YRJoo8jvyswoQ": {
    "date": "9/12/2015",
    "text": "Very welcoming! The second you walk in the owners greet you like they are best friends with you. Our waiter, Angie, was very warm. Gave us a tour of the whole place. I loved the stuffed banana peppers! And my boyfriend said the steak was great (he is a picky eater) Thanks for a great experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WC9Kz1Gw8v9UxvEAJfSeQQ"
  },
  "FCbx7QulIzl4Ulo2HeUCAg": {
    "date": "1/21/2017",
    "text": "Amazing place to eat, someone tell the waitress Angie that she got her review on yelp lol",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "20UMqytRbBnILhwHmkx0oA"
  },
  "_cBt8-0dR4WqxIWLAjV88g": {
    "date": "11/9/2016",
    "text": "We love this place! From the food to the atmosphere to the service! The owners were present and are lovely! We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clG9QMlxocpgFighLNwlig"
  },
  "YudptqcGvF5cjsKtesnalw": {
    "date": "8/18/2012",
    "text": "A friend of ours told us that they were providing the musical entertainment on Wednesday nights at a place called Cafe Notte.  We had not heard of it, but we stopped in a few weeks ago on a Wednesday and boy were we surprised.  The restaurant is located right on the road and it does not look like the kind of place that delivers the dining experience that it does.  In the summer they have outdoor seating on a patio in the front of the restaurant and it provides a great atmosphere in which to just enjoy a drink and listen to some music or have a wonderful dinner.  Their Kobe burger with pancetta and a fried egg, served on a pretzel bun (yes, a bit excessive) is fantastic and a must try.  The salmon entree with crispy risotto cake as well as the lobster bisque were top notch. Well prepared and well presented.   We have been here twice and both times the owner has been either sitting at one of the tables outside or mingling among the guests.  He seems sincerely interested in the dinning experience you are having.    Don't let the location persuade you otherwise - give it a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "LEI0pv6JQX5ShE_wsT1klg"
  },
  "oTbQNR6aQApetequYGAqWw": {
    "date": "10/20/2012",
    "text": "I ate here this past Thursday night with my girlfriend.  We arrived just before 7 and the restaurant was full so we had to sit at the bar.  Since our bartender was nice we decided to have our meal there.  The inside of this place is pretty cozy only having about 8 tables or so.  They are expanding so it should be bigger soon.  There is also a fireplace in the dining room and the ceiling is painted black with lights acting as stars for a pretty cool effect.  They also seem to have a nice outdoor seating area but it was too cold to sit there the night we came here.  I decided to start off my meal with the soup of the day which was alligator soup.  It came out as a tomato based soup and although I couldn't taste the gator, it had a nice sweet flavor that I enjoyed.  We also went with a brie flambe for an appetizer which was set on fire in front of us and served with apple, nuts and some toasted  bread.  The brie was creamy and especially good where the flame had heated it up. For my entree I decided on the 14 oz ribeye while my girlfriend went with the chicken piccata.  Both of these came with salads beforehand and I went with a Caesar while my girlfriend had the house salad.  We were both surprised at the size and quality of them and I especially loved the homemade garlic croutons on mine.  When my meal came out it consisted of the ribeye in a sauce with a watercress salad and roasted fingerling potatoes.  Two salads with one meal was weird but I enjoy salad and went with it.  The watercress salad had a balsamic dressing on it which made it enjoyable.  My steak and potatoes were good but were only luke warm at best and so I imagine they were sitting for awhile.  My girlfriends chicken piccata came topped with capers and a lemon sauce with roasted fingerling potatoes and brussel sprouts on the side.  Her chicken was excellent with the capers providing the salty punch to the citrusy sweet sauce.  Her brussel sprouts were also good and sweet while her hot potatoes were much better than mine.  The bottom line for me is that I will definitely be back in the future.  I absolutely loved the ambience of the place and the food was good too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "Ri2goE00noQv5NANoDZjBg": {
    "date": "10/31/2015",
    "text": "For years, I've passed this restaurant and wondered, how good and what kind of restaurant would be in that location on very busy Rte. 65. Finally, my friend and I stopped for a quick dinner; a very pleasant surprise.. We liked the fireplace, the ceiling with the twinkle lights, nice decor. We were seating quickly, (but we were there @ 4:30.) The five star\" rating is for Jean; our waitress; great service; knowledgable, pleasant, cheerful, patient with all of our questions. I had a salad; average; my friend had the burger; she said it was \"a very good burger\". Surprised we had to pay for the bread and dipping oil? The bread was too dry; oil was tasteless. Our wine selection was excellent .  Definitely will return, and try other dishes. I am recommending this restaurant to my friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xujfq_qq0SD14fNNcoEN7A"
  },
  "bbR4p7UfPklo3XemLbMryw": {
    "date": "8/28/2014",
    "text": "I stopped mid week for dinner.  Had the Pork Porterhouse, it was very good would order it again. I'll be stopping in again soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zKpvPwWZRfys5l_wKAL74A"
  },
  "sAY0YPv0fgJcs5RHTtozmw": {
    "date": "5/1/2013",
    "text": "Cafe Notte is an absolute gem! I live in downtown Chicago and I dine at some of the best restaurants in the city (Publican, NEXT, etc.) and Cafe Notte is right up there! Chef Eric is a culinary genius and his ability to highlight flavor nuances is extremely impressive. Anytime I visit my parents in Pittsburgh, we visit Cafe Notte multiple times. One of the best things I've ever eaten (from any restaurant) was Chef Eric's peanut butter and jelly foie gras. OMG, I still have dreams about that dish! His lemon and artichoke fritto misto is perfectly light and airy and the duck confit melts in your mouth without being overly fatty or heavy. Most of the time I order off the specials menu because the dishes are sophisticated and inventive, so I definitely recommend doing that. In the rare occasion I don't want anything on the specials menu, the tempura green beans and Vietnamese shrimp crepe are stellar apps and the eggplant parmesan is easily the best version I've ever eaten. I could go on and on, but really, there's no need - the food is killer and (bonus!) the portions are real-sized, not fine dining tiny. Score!  As for ambiance, don't expect anything stuffy or formal. The relaxed and cozy atmosphere inside (twinkling ceiling lights, high top tables mixed with low tops, old wood bar, and fireplace) add to the charm, in my opinion. It's not overly modern or contemporary, but I love that. Sometimes fine food equates to a stuffy atmosphere, but Cafe Notte does not fall into this trap at all. I've gone in jeans and flip flops and I've gone in a cocktail dress and heels and have been comfortable either way.   The service is incredible and everyone is so nice. Derek is usually our server and I continue to be impressed with his knowledge and memory - even though there can be months in between visits, he remembers dishes I ordered and my wine preference. Heck, I don't get that kind of attention at my local Starbucks even though I'm there every day! Angie, another server, is a sweetie and very attentive. It's also fun being there when they have live music - nothing like eating fine food in jeans listening to Bucky play James Taylor on the guitar! They have a big outdoor area too, but since they allow smoking out there, I've never eaten outside. It'd be nice if there were a smoke-free section outside, but I may be in the minority on that one.   I think the prices are right on point - you certainly get a lot of amazing food for your money and I never leave hungry or unhappy. Even though I'm surrounded by delicious culinary choices in downtown Chicago, I keep going back to Cafe Notte and I miss it when I return to Chicago. I wonder if I can get on some kind of Cafe Notte peanut butter and jelly foie gras mailing list?",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "StvXxsrt5s0j6Io_glw1Rw"
  },
  "y9QACPcsGite5t7h2loHsQ": {
    "date": "5/12/2013",
    "text": "Finding a place that has something for everyone in my family isn't easy. When we do, the quality often varies greatly. Notte's menu slants to seafood, but my son had an amazing hamburger and my daughter chose pasta (also excellent). Salads were very good with a nice mix of greens. My diver scallops were cooked perfectly and the squid ink risotto was both intriguing and tasty.  The wine list isn't huge, but it covers all tastes and the prices are reasonable. Prices are definitely reasonable for the selection - $144 for 5, with a bottle of wine.   The owners and staff are incredibly attentive and friendly and there was a live jazz band.   The only knock on Notte is the decor. The area we sat is used for private parties and is equipped to be easily cleared. Makes sense, but it's so at odds with the menu that it's a bit disorienting. I've never commented on decor, but it's very apparent at Notte and it's the only thing holding them back from being one of the area's best.   I would still highly recommend Notte. The food, friendliness, prices and music make it well worth a visit",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "n9dpnpwxkc6CAuQVGF2-OQ"
  },
  "cK1VjhRcY1capvYYL7FHtQ": {
    "date": "1/28/2016",
    "text": "Went to dinner with 2 friends and was delighted with this restaurant. The cozy atmosphere with a wood burning fireplace was a nice setting for a cold night. The staff was friendly and efficient. The food was very good. I had chicken parmesan which consisted of a large very tender piece of chicken lightly breaded over pasta. We ordered a bottle of wine which was half price that evening. The only negative was we had to pay extra for bread. Not much but I think bread should just come with dinner. I plan to return soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kyTaLHRTqVYMRT-GHs4xVA"
  },
  "jryZ4sW18udu6nOUz73VOA": {
    "date": "5/25/2017",
    "text": "Thanks folks...  It's been 3 years since I have been to Cafe Notte. Now that I live back in the area, I decided to stop last Sat. night. Its as good as I remember, if not better. All the folks there were helpful and really enjoyed their job. The owner even came by to say hi and see how my food and drinks were.  Nice to have a tasty, friendly place 1 mile away... See ya soon !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6xKz8yEy19W0bZr4ZSfFkQ"
  },
  "N52W8cfONV2583VGBamq9A": {
    "date": "7/1/2017",
    "text": "A family's wedding reception was held here. the food and service were amazing. We set up our cookie table and they were very accommodating! And Angela, you made my son's night...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hA1JrE9fW-PgByigYYYF5g"
  },
  "JTYXZQyjR5iccQtAZzdarQ": {
    "date": "10/27/2017",
    "text": "My daughter and I had a wonderful meal at Cafe Notte!  I had the Braised Short Ribs and asked to have them over mashed potatoes.  Best meal I have had in quite awhile!  Paired with an excellent Malbec. Daughter had a filet that she cut with a butter knife. The service was also excellent.  We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rJhhU3vOpJyAJC2TQqkXEw"
  },
  "uLFEHvrFS-k2J4Uxu21s2Q": {
    "date": "5/20/2017",
    "text": "We have loved every meal that we have had there. When my daughter and son in law sought a venue for a party, they chose Cafe Notte.  It was excellent. The food was delicious, the service was outstanding. The private room was very warm and inviting!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R1lyckay7AXVSnXhD-qdrg"
  },
  "oNqnkHOZWm1p0G1H49eUmQ": {
    "date": "8/12/2017",
    "text": "Had our first dinner at Cafe Notte and we loved it. Ordered the bread appetizer and the scallop appetizer and were very impressed when our bread was refilled 3x without charge. Our waitress was spectacular and our food was on point. Will definitely return! Thank you for the wonderful experience! See u soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CPiEM45c2QVhPGRaGyxyPw",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States. Scallops! So delicious and I am expecting so I requested they cook them well done and they turned out perfect :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CPiEM45c2QVhPGRaGyxyPw/o.jpg"
      }
    ],
    "user_id": "9JuXlEol5mu0SN54MLgskw"
  },
  "eApWnCF6URavKlKVOr4JpQ": {
    "date": "7/21/2017",
    "text": "This place is great... food is delicious and is very affordable. Tuesday night spaghetti is the best deal in town. But let's talk about those napkins in the water glasses  .... ah, just kidding. I highly recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "w73qkHAVHjDN4ET6QX4hdg"
  },
  "IJlSosZ5O17JNpqqUxdr3g": {
    "date": "7/22/2017",
    "text": "My friend hosted her bridal shower here and I cannot say better things about this place. As your driving along 65N towards Sewickley from downtown Pittsburgh, there is a quaint almost inn-like building that you will see off to your right. Little did my friends and I know this place would be our destination. As you pull in, there is an enticing outdoor space to sit with cute umbrellas. Our event was off to the left when you entered, but they have a huge dining area and bar off the right! The manager and owner helped us get everything ready in under an hour and was overly accommodating in our decoration requests. They food was delightful as well. We had the salmon, beef, and potatoes for a buffet style shower. If this is any indication how good their food is, I cannot wait to try their dinner menu when I am back in town! Do yourself a favor and stop by if you're around this area. They have great happy hour prices and love hosting private events!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4iKv1gQVSjQWJ1AyseysZw"
  },
  "HRPEwUUyvknktaXqubju9Q": {
    "date": "11/13/2014",
    "text": "Hidden gem.  I've been many times and have had excellent drinks and food on every occasion. The ambiance of the twilight lit ceiling sounds cheesy, but it's really quite lovely.  Dim lights make it even more comfortable.    2 things that may be helpful/contribute to my great experiences: 1. I go either earlier in the day or later at night. 2. I most typically order from the appetizer menu, so I can sample a wider selection.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "rk3wVTj-FQZHT7RhqyPChg"
  },
  "jwbuc-ZKc0iojIbQG1Bf6A": {
    "date": "12/29/2016",
    "text": "Old motorcycle shop that has been transformed into a cozy little restaurant/bar. Atmosphere is a little more upscale than the average locale, but I didn't feel uncomfortable. Going along with that is higher drink prices, but that's to be expected in a nicer place. Visiting at happy hour is probably the way to go. Wait staff was very friendly and helpful during my visit and the stuffed banana peppers were just okay. My only critique would be the parking, which can be an issue. Check it out the next time you're driving down 65.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EOFsi1givKFlIFMQ23Ks7g",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EOFsi1givKFlIFMQ23Ks7g/o.jpg"
      },
      {
        "img_id": "1gAM8IQHltWX7jr41X7vwQ",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1gAM8IQHltWX7jr41X7vwQ/o.jpg"
      }
    ],
    "user_id": "7Vk4fkYYRc8AumWeolYvsQ"
  },
  "iiFobxXrgaqvTAlHpiFryA": {
    "date": "4/7/2016",
    "text": "Just had dinner here and really enjoyed it.  I called for a reservation and I could hear live music.  Angie assured me she could put me at a quiet table which she did.   First of all, let's talk Service.  Angie was Awesome!  Super friendly and on the ball. My entree arrived just as I finished chewing the last bite of my appetizer.  Perfect timing. The food: I started with the crab cake.  It was very good - nice and crispy on the outside.  And I'm pretty picky about crab cakes.  I LOVED my entree: Veal Bolognaise.  Also the cannoli was very good. Ways to improve: it was a cold and rainy night.  the room was for me too chilly.  I kept my coat on.  My entree got cold toward the end (but, I'm also a slow eater).  I will certainly go back when I'm back in town - especially if Angie is on duty!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "P09c9vmU6LHSyjPUvROq7A"
  },
  "JZAnnxuA7bXi5PCx_O7VtQ": {
    "date": "11/3/2016",
    "text": "Horrible food.    Tonight was our first night there. The fact that the place was empty should have been our first clue. I got \"rigatoni bolognese\". It was neither. The pasta was penne and the sauce had so much cream in it, it was pink. The sauce was a cross between cat vomit and dog food. I actually gagged. On top of that, the sauce had no salt so, the vomit tasted was bland.   My wife got garlic shrimp with asparagus and risotto. The asparagus was as thick as my thumb, unpeeled, under cooked and woody. The shrimp were nice but there was no hint of garlic and the risotto was a tasteless red mass.   Despite the lack of clientele, they managed to pump enough fryer grease odor into the dining room to leave us smelling like a bag of fish crisps. Not worth a second chance.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MjApusqMNLQXCA_QlZa1OA"
  },
  "XQIP-roKX_6I2yW7_Z97zQ": {
    "date": "6/1/2017",
    "text": "Delicious dinner last night with 6 of my friends from high school. We are planning the Avonworth Class of 1968 50th reunion. We had delicious dinners and  will be having it at Cafe Notte. I had the chicken Parmesan and it was delicious. I also had the best Caesar salad I have ever had. The service was excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TCh-F6NAJ0L51M2i8jHRjQ"
  },
  "QnaavKpR5srccY2aSkMATA": {
    "date": "2/7/2018",
    "text": "This reminds me of the 90s Italian joints in western pa.  If you like Chicken parm and calamari this is your type of place but it is not to my taste. 3 stars only because the staff is friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E8O44KAJI8wcfKxSH09fuA"
  },
  "kIENWNTgeXQJMdL_ZCntVg": {
    "date": "4/1/2017",
    "text": "Food was good, waitress was wonderful.  Very disturbing to see napkins in water glass and then be served water in that glass....YUCK!!!!!!  The owners sat next to us at another table, yet walked around us to talk with other customers, completely ignoring us.  It seemed obvious to us that owners were not interested in our experience.  We were very excited to eat here for the first time, but now will never return or recommend to others.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yxqa73jg8Ic5KxFdqrtNzw"
  },
  "Uvru1Oef-W7shNvaDi7pwQ": {
    "date": "7/20/2017",
    "text": "I know many people say the food is way to expensive at Cafe Notte, but honestly I cannot attest to that. I went in with the mindset to order the cheapest thing that would give me the most food for my money. And sure enough amidst the $35 seafood dishes there was $12 personal pizzas. The pizza was average, nothing special. But regardless the service was great and my visit proved that you can get plenty of good food at a decent price at Cafe Notte",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O7E71ZKES-UkvYDni1gqrw"
  },
  "3euP6ybbvxFvZJFEpq0GVw": {
    "date": "8/30/2015",
    "text": "I made reservations for my wife and I for a special evening out together.    After arriving we were greeted and seated promptly. The waitress was courteous and polite, and quick to get our drink order and tell us of the specials     The lobster bisque was excellent according to my wife and the chicken and dumplings were very good as it was their soup du jour.  My wife had ordered the eggplant parm and I had ordered the strawberry salad with grilled chicken.   This is where it came off the tracks a bit.  Our waitress sat my strawberry salad in front of me and my wife's eggplant parm in front of her.   She explained that they were out of strawberries for my strawberry salad.   She offered to bring something else or another fruit for my salad, but My wife's entree was already there and since they ready brought the salad ,  being politely frustrated, I asked for some mandarin oranges instead.     She brought 4-5 mandarin slices on a plate.  I guess they were almost out those too. The entrees tasted fine despite the lack of strawberries on mine.  Also there was no bread and butter offered either with the soup or my salad, which seemed odd.  Then the bill came.    I figured for the oversight they would discount my salad, comp the salad or offer a dessert to make up for the oversight.   Full price salad...    No deductions..  No discount.  I asked our waitress politely if there should have been at least a discount for the strawberry-less strawberry salad.   She seemed perplexed and said I brought you oranges..     Then she said she'd check with the manager.  They took about $4 off our $60 bill.  We will probably go back once more to give it it one more shot...    But I thought they would've done more to insure that.  We even told our waitress it was our first time there.    Oh well.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "fT0KNWzDjn6UK0Qdk8CQww"
  },
  "PhhXNZ568ulgyfzde0XsOg": {
    "date": "5/19/2017",
    "text": "My husband and I have enjoyed several excellent meals at Cafe Norte. A great selection of entrees and desserts. Not to mention great atmosphere and excellent service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_S1vy-B8xj1TEhGNsg3Ftw"
  },
  "3c3vVp0cb0lRaHaOofK50A": {
    "date": "11/21/2017",
    "text": "My wife and I held our reception here and it was nothing short of fantastic! Debbie was super accommodating and friendly! Everything was perfect. We had about 60 guests and everyone loved the food and set up. I wouldn't go anywhere else!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qh4s4cirOrG8MdaIbH6Udw"
  },
  "5h3Dqe-srLveXj4BAcgydg": {
    "date": "8/30/2015",
    "text": "I have gone to this lovely restaurant twice this month. The first time my husband and I shared a romantic dinner. It was delicious.  I enjoyed the surf and turf. It was cooked to perfection. The salad was amazing with their own dressing I loved. It was an early dinner and we were not rushed. The manager showed us the around the restaurant it being out first time there.   Upon our return visit we invited friends. All four of us enjoyed our apps and dinners and the ladies of the group shared an amazing cannoli. It was so fresh, it was heaven.   During both visits one crowed and one quit we had the same sever, Hope. She was delightful and attentive. I look forward to many more meals.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "e9gcBrC64HvCeBB-TuPFSw"
  },
  "qPobjmb-bb3ZXQKGTmwmhA": {
    "date": "9/20/2014",
    "text": "My wife and I have driven past Cafe Notte so many times.  We've vowed to give the restaurant a try.  Finally, on a date night that coincided with an errand a few doors down from this place, we gave it a shot for dinner.    Why did we ignore all the signs?  My wife called to make a reservation for dinner and was directed to their website.  The website reservation system wasn't working properly yesterday.  She called back and left a message - and that call was returned a whole day later confirming the dinner we (regrettably) already had the night before.  The website also advertised a happy hour that ran until 7pm.  When we tried to order drinks, we were told happy hour ended 30 minutes ago.  Our waitress had to prove to the bartender that their website was in error by toting my wife's iPhone over to the bar to settle the dispute (looks like the website has been fixed since last night).  The happy hour discount on my wife's glass of wine was probably the only win for us of the evening.  We sat outside with a picturesque view of Ohio River Boulevard.    The service was very good - but not good enough to make up for the food we were served.  This turned out to be a costly lesson in not ignoring your gut when it seems like you are walking into a restaurant that might not be all that well run.  Here's what we ordered:  Bowl of lobster bisque ($10) - lighter than you'd expect a bisque to be.  A trace amount of lobster in there - probably the minimum amount of lobster in order to call it a lobster bisque in good conscience.  Sadly, the best part of the meal.  Blackened salmon ($24) - my wife's entree. Seasoning was good.  But the salmon was more burnt to a crisp on the outside and it tasted vaguely watery in the middle.  My guess was that this piece of salmon was frozen, thawed in a room temp water bath and then thrown onto a hot grill.    Grilled ribeye ($28) - my entree. I ordered between medium-rare to medium.  It came out decent on the edges but absolutely raw in the middle.  I sent it back to the kitchen to get this less raw.  The entire plate came back steaming - almost as if it was microwaved.  I lost my appetite when the steak came back even worse the second time.  Moscato ($4) - our triumph for the evening getting this glass of wine at happy hour price.  Alamos Malbec ($8) - not bad, went well with the edges of my ribeye that managed to get cooked properly.    We skipped on dessert (we finally figured out we made a terrible mistake after the entrees) and got the check.  Total damage was $78.34 not including tip.  The next time we drive by Cafe Notte, we'll know to keep on driving.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 9,
      "cool": 2
    },
    "photos": [],
    "user_id": "oF8Efb3fBrwWZvmsl6e-pw"
  },
  "Y_opUQ4Sc1hc2XEc6fpANA": {
    "date": "9/12/2019",
    "text": "What a great venue, grandson's baptism celebration   there this past Sunday. Food was excellent, Debbie and her staff did a great job , service was excellent with the food. Bartenders did a great job also. We had 85 people there and everyone commented on how nice it was.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iQIw55BESU0Lcf9DWzCJgw"
  },
  "46NEegswXktqJUrKH_lmig": {
    "date": "5/6/2019",
    "text": "Great service.   The seared scallops over sauteed spinach were perfect. The Caesar salad was underwhelming and the short ribs were extremely salty.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GCWrVwsjG7xEj7XhfJ5DCw"
  },
  "ZeyRCDq5MY4TpBeQOaCJHg": {
    "date": "9/5/2019",
    "text": "Great food and great drinks- with Kenny Blake on the patio.  It doesn't get much better!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RAvdef6tX-4mAnMbf-Erkg"
  },
  "t5V8bLMrxwJUgximt7jedw": {
    "date": "1/3/2019",
    "text": "I wish I could write a better review.  A group of us (6) went to Cafe Notte for New Years Eve dinner this year.  We were looking forward to a great experience.  Unfortunately it  fell very short.  The atmosphere is lovely, but that is where the good stops and mediocre begins.  Knowing ahead of time that there would be a select holiday menu, we went with the expectation that the dinners chosen would highlight the restaurants bests.  Two of us had the scallops, which were excellent as you can read in other reviews.  One of us had the lemon chicken which was good.  Another had the duck which she said was just ordinary.  The sides (risotto and asparagus) were better than the duck.  The remaining two of us has the rib-eye steak.  It was a horrible cut of meat.  Very grisly.  Not marbled like  it should have been.  We left over half of it on the plate.  When asked by the waitress how the meals were, we told her about the steak and she did nothing.  Said nothing.  Didn't apologize,  Didn't offer to get something else.  Nothing.  Since we had to pay for it, we wrapped it and took it home for our dog.  He enjoyed our $40 steak dinner better than we did.  Service itself was slow, which you sometimes see on a holiday, but you would think they would have staffed appropriately.  I hope to try Cafe Notte again, when I can experience the regular menu and maybe on a not so busy night.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OSCpBGZ6O034E5L72eS-zQ"
  },
  "TBOAx5KXWDJMYl5MB5qAhA": {
    "date": "1/6/2019",
    "text": "We've been wanting to go to this place for several years but it has never worked out. Unfortunately it would have been better if it would have stayed that way.  This place should be Cafe NOT.    The best thing about this place is the cozy atmosphere with a real fireplace.  The calamari appetizer was good.  But the seafood lasagna special had no taste even though it looked good.  My husband had the veal wrapped in prosuitto.  It was supposed to be in small thin slices but came out like a steak.  Wasn't tender, hard to cut, could see veins in it, and seemed like some or most was still raw.  My husband kept spitting it out.  Told the server and he then ordered shrimp which he said was ok.   Milky Way martini was good.   Ladies room could use a remodel.  Get rid of the cheap artificial flowers on top of the mirror and the cheap artificial greens in a basket under the sink.  For the prices of the meals I would definitely expect more even with a bathroom.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ygG07eSC5Y9WhnsrRTV-HA",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ygG07eSC5Y9WhnsrRTV-HA/o.jpg"
      },
      {
        "img_id": "6rPQU3N-IfhZMFdr4TnHjQ",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6rPQU3N-IfhZMFdr4TnHjQ/o.jpg"
      },
      {
        "img_id": "aQ9x2ZrkJJSBOmuYUl68ug",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aQ9x2ZrkJJSBOmuYUl68ug/o.jpg"
      }
    ],
    "user_id": "m2uTGkOKcXqQJSmvsYvtMg"
  },
  "SAY03m_mNqgq_-V-fuS_0w": {
    "date": "4/9/2019",
    "text": "I have heard good things about Cafe Notte so I was excited when I was invited to a bridal shower here. The room for the shower was so cute. Such a unique space.  There were both round tables and some high top tables, a bar, a nice area for present and then the buffet was set up in the middle of the room.  The vegetables and cheese selection was awesome. We were then served a few different items which I would say was more of appetizers. Chicken skewer, meatballs, I think a small crab cake (I did not eat) and then pulled pork with rolls. All of what I ate was really good. Perfect temperature. If we needed anything the employees promptly got it for us without hesitation.  I also drank a mimosa which was great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "W8EAuJDTuy9foHWGvoyGxg"
  },
  "Q5IM-X5w2nexQguxGlqMKg": {
    "date": "3/24/2018",
    "text": "I've been wanting to try this restaurant for some time so a friend of mine made an early reservation for dinner.   We arrived,  it wasn't busy because it was early and we were seated promptly.  The hostess was very friendly and so was our server.    We tried the Gnocchi Appetizer,  and it was pretty good.  The sauce was a little thick for a marinara but nonetheless we both enjoyed it.  It was topped with a spicy Parmesan crisp that was delicious.    I ordered a special for my entree,  the fettuccine with a mushroom sauce with grilled chicken and meatballs. Yes,  if you think that sounds weird,  it kind of was.  The fettuccine and mushroom sauce was delicious,  however my chicken was very tough and difficult to chew,  I also was not a fan of the meatballs. I ended up pushing the proteins off to the side. It was a very expensive plate of pasta.    I ended with the Ricotta Cheesecake with Berries and it was very good.  My piece had a slight minty flavor that I don't believe was intentional,  it almost tasted like it was next to something in the fridge and absorbed the scent /flavor.   Overall,  it was a medicroe dinner.  I probably wouldn't go back.  I personally felt it was pricey for so-so food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mHtXGTxNmYEUA60KrrnB3g",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States. Ricotta cheesecake with Berries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mHtXGTxNmYEUA60KrrnB3g/o.jpg"
      },
      {
        "img_id": "tWdJWLxV5f2iwudjO6Vw1w",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States. Linguine with Mushroom Sauce,  chicken and meatballs  special",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tWdJWLxV5f2iwudjO6Vw1w/o.jpg"
      },
      {
        "img_id": "ZfDYe1axi8i89PgQjlASHg",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States. Gnocchi Appetizer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZfDYe1axi8i89PgQjlASHg/o.jpg"
      }
    ],
    "user_id": "6YT5nzXB-TNPKrmPuEOxKg"
  },
  "AxPuhdUsdh0ug_BLBYxXkA": {
    "date": "8/10/2019",
    "text": "A recent chef change has caused all portions to be 25% smaller. The food's pretty tasty but things have changed. The cheese tray used to be really nice, now it's underwhelming. Chicken parm is half the size it used to be. Note that the prices haven't changed. The beef burgundy was good  but the ceasar salad is pretty blah. Haven't decided if I'll return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X8lKpdXhFGq2PjFnJpXJlw"
  },
  "TYSqz5v9HrgoGyZiX4I57w": {
    "date": "9/4/2018",
    "text": "They went from 2 stars to 4. Thanks to Angie!   I've only ever stopped here before when the weather was horrible and it was awesome. Guess this will be my foul weather place, because I stopped tonight and the weather is great but the SERVICE is HORRIBLE. Took 10 minutes and then I finally had to ask for as beer as someone was zipping buy. After another 10 minutes, I had to mention to one of the staff that I had intended to do food but was having second thoughts. And one of the owners is actually HERE!! So, if you plan to stop here, come on a night when the weather is horrible.  Owner spots my nearly empty beer. Directs bartender to ask if I want another?!? NOOOO. Directs bartender to make her ( the owner ) another drink!!  New bartender/waitress Angie saved the night. She was so friendly, engaging, and apologetic for the wait and other issues. They should really hope they keep her. The food, as always, was awesome!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o4zeonJbekr3zmKkOX2ciw"
  },
  "_UBgpSf_ednAESZ3BRhwuQ": {
    "date": "7/18/2019",
    "text": "If you haven't tried Cafe Notte you are missing out. They have a wonderful menu for drinks and food and a surprisingly nice selection for gluten free. Food never disappoints and is always on point. They offer great happy hour specials and live music to entertain you. Have I mentioned the wonderful and comfortable outdoor sitting and dining space? If you are looking for a nice place for outdoor cocktails or a comfortable indoor dining experience you should enjoy what Notte has to offer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zc-Fze9pVQkIINppfHKcTg"
  },
  "EAJzuabfzH1bLxYFlAoOUQ": {
    "date": "12/13/2017",
    "text": "I've always seen Cafe Notte when I drive 65, which is not often and why I never remember to come here until I drive past again. I always thought it was a coffee shop, but when I looked it up, it turns out its a restaurant with a menu that looks amazing.  Recently a friend mentioned it and we decided to plan a visit. Upon arriving, I fell in love with the decor and the overall vibe of the place. It's exactly my style and I wanted to move in. Haha. The ceiling has these fun LED lights that look like stars in the sky. Everything about the appearance turned me on.  Until the food....  I asked about the lobster bisque and was told it's wonderful so being our first painfully cold and snowy day in Pgh, def wanted that in my belly. When it arrived at our table, the presentation was great and excited my mouth even more. Turns out, the soup is extremely thick with barely any lobster, but an abundance of shell. I picked shell out of my mouth no less than 4 times. Also, because the soup was so thick, literally glue-like, I had to keep washing my mouth with water. $9 for this glue soup is absolutely absurd.  For my entree I went eith a side salad and crab cake. I was told the \"homemade balsamic\" was unbelievable so of course I had to try it. Turns out, the \"balsamic\" dressing is 100% NOT balsamic, but rather appears to be a tomato based oily dressing that neither looks nor tastes anything like balsamic. In fact, it had barely any identifiable flavor.  As for the crab cake...what an epic disappointment.  It was a $12 crab cake patty  filled with breading, no chunks of crab, and literally looked like it came out of the freezer section of a grocery store. The red pepper remoulade was again, paste-like and 0.0 flavor.   The 2 stars are only bc I loved the appearance and our server handled our disappointment without question.   Cafe Notte should consider hiring a legit chef or skipping food and going with coffee shop, which would have been a much better experience.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Gn1iAYyRTqeq8lmB1GZSKg",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States. Lobster bisque....beautiful but was like eating glue",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Gn1iAYyRTqeq8lmB1GZSKg/o.jpg"
      },
      {
        "img_id": "BJ0xEbBPwXvv9_vpcbiTAw",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BJ0xEbBPwXvv9_vpcbiTAw/o.jpg"
      },
      {
        "img_id": "FyTYoaC-Gh-hy8qY03v8WA",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States. Crab cake....high ratio of breading to crab and quite bland...should be called a crab patty.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FyTYoaC-Gh-hy8qY03v8WA/o.jpg"
      }
    ],
    "user_id": "sswLzPBbKIIVwlbJRS2NPA"
  },
  "A2Jn1YNz5_yo7OCDRs0BWA": {
    "date": "4/19/2019",
    "text": "The food was absolutely top notch, I had the bronzino which was done perfectly with a delicious and crispy skin. The cocktail list is inventive and rotates, my honey bourbon martini cocktail was a delicious liquid dessert. The staff is very friendly, engaging and inviting. I even had the pleasure of meeting the owners and was given a tour of their space - which includes ample private dining areas for small or large parties (a huge plus in an area filled with more small capacity restaurant spaces) - and reassured that in the future (as I was dining solo this evening) that my family members' severe and specific food allergies can be accommodated with no issues by their chef and kitchen staff.  All in all, an absolutely A+ experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2cxQmG24t1CT1mvtChw-kA"
  },
  "Cr-M18rysj9e2fGMYjdx8A": {
    "date": "3/24/2018",
    "text": "My friend and I had an event and wanted to eat somewhere close by. I've always looked at this restaurant when driving on 65 to Pittsburgh. The outside reminds me of something in medieval times, the inside is more intimate. Our waitress was really nice, I believe her name was Jessica (I could be wrong on that). We got a gnocchi appetizer, which I thought was kind of weird being an appetizer, but it was pretty good. I read other reviews about this restaurant and they were mixed. One review said the crab cake was not good, but I love crab cakes and decided to try it for myself. I thought it was pretty good as well and the sauce was tasty. For dessert we got the raspberry ricotta cheesecake and that was also delicious. We definitely left with full stomachs. Entrees were a little pricey, but that comes with the atmosphere. I probably will not go back just because it's a bit of a drive, but if I lived closer there were a few more items on the menu I'd like to give a try. Maybe one day!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6t4k5GI6x8FOmrKyXGrz_g",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6t4k5GI6x8FOmrKyXGrz_g/o.jpg"
      },
      {
        "img_id": "s6jRTDblTcADnhduDLLClA",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/s6jRTDblTcADnhduDLLClA/o.jpg"
      },
      {
        "img_id": "CE4vYq1hhEwsNM2Ex4FIog",
        "caption": "Photo of Cafe Notte - Emsworth, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CE4vYq1hhEwsNM2Ex4FIog/o.jpg"
      }
    ],
    "user_id": "ECJm0pUrLzRrg-hDM3dA9w"
  },
  "9BOpKHZZB3B442WYO-wizA": {
    "date": "7/25/2018",
    "text": "I am new with Yelp, though I've written many Google Reviews, so bear with me in my first Yelp review :)  Let me preface this review with a few things: the food is great and the servers are wonderful. We frequent Cafe Notte for these reasons alone. There is just one large issue with Cafe Notte: the ownership.   If not for the decent food and extremely friendly servers, we would never return to Cafe Notte. What I am about to layout in this section of my review is a frequent occurrence. After several times of dining at Cafe Notte, we learned that it is owned by a husband and wife duo. The owners are also the managers from what I can tell. We have only ever met the owners, servers and the bartender - never a \"manager\" - so I think it is safe to assume the owners are the managers. I'm not going to harp about this, because I try to be positive and I hate when people just write reviews to be negative. There are several aspects that make the ownership just awful. Both my husband and I are working professionals, so we know what to expect from other professionals. Additionally, I worked in a nice restaurant for four years while in college, so I understand how managers/owners should conduct themselves properly. The first thing you will notice is that they are ALWAYS drinking. They take up one of their tables and drink their own inventory. And I'm not talking water and pop.... They always have wine, beer or cocktails in hand. Now, working in the restaurant business myself several years ago, I know that if you want a drink, you have water or pop and it has to stay in the back break room - you are to NEVER be seen drinking anything in front of guests (and that goes for all employees, especially the management)! I find it so unprofessional to be blatantly drinking in front of your guests that you are supposed to be serving. And this drinking is constant - almost every time we go.... It's also not at the end of the evening at the bar. It's at 5:00, 6:00 - all night at a main dining table, inside or out! (I want to note that it is just the owners, the husband and wife, that do the drinking... not the servers and so on). Moving on from the drinking... the husband seems nice enough. He has said hello to us a few times. We often see him \"do his rounds\" and greet guests, asking how their food is. This is a great thing to do - it shows the guests that more than just their server wants them to have an enjoyable dining experience. One rather funny aspect (at least I find it humorous), is that the husband seems to avoid checking in on younger couples! I can't figure out why this is - maybe he doesn't think they will spend a lot of money or not tip well? Who knows. This is something the wife does not do. I can't say that she never does it - I have just never seen her check in on a table while we were there dining. While we are on the husband (and again, he seems like a very nice man), there is another occurrence that just seems strange to us. I am not sure what line of work he is in besides his Cafe Notte business, but he appears to have a few employees from another line of business that go to Cafe Notte after their \"9 to 5\" job. They appear to be in construction, as they are rather dirty and certainly not dressed for a nicer dining experience. These guys are loud, the owner is buying them drinks, and worst of all... they smoke on the patio (or just a foot off of the patio) where guests are eating!! Don't get me wrong - if you want to smoke, fine, but do it away from where people are eating their food! Also, show some respect and go home, take a shower, and change before going to a restaurant. They shouldn't even go to an Eat-n'-Park dressed the way they are. Moving on from the husband to the wife. I cannot tell you how many times (and this is what bothers me the most) is that while the hostess is gathering menus to seat us, the wife will come over... not say hello to us or greet us... and ask if we made reservations (note that we do not and we have never been there and not been sat immediately - they are never full). So the wife comes to ask us/the hostess if we made reservations all the while we are already being sat. She will actually make faces when we say no, we did not make reservations - that we drove by and saw all the open tables! The OWNER rolls her eyes at guests!! And remember, she is sitting at a table herself drinking wine... so no... clearly Cafe Notte is not that busy and requires reservations. I even asked the hostess once if they normally get a lot of reservations. Her response was, no - only on holidays. Yeesh! I hate the idea of putting money in this couples hands but supporting their business, but Cafe Notte is close, the food is good, and the servers are great. So we think of it as helping out the servers for having to deal with the awful owners they work for and always tip well.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iMEdq4yEjlhKJJpklTH2wQ"
  },
  "7vfuUP7-lxAzYoI_yE9fTQ": {
    "date": "12/24/2016",
    "text": "My recent meal there was one of the best that I've had in quite some time. Everything was perfect from start to finish.   I highly recommend the pan fried chicken Parmesan",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "91koVXu54Y6tIiZKKxVmrw"
  },
  "dGpkYQfmdb38TRoCto7nKA": {
    "date": "11/4/2017",
    "text": "I've driven by for months and finally had a chance to stop in after work tonight.  Sat at the bar and David was the bartender on duty.  It's definitely a family business but everyone was very welcoming.  Had the Veal Bolognese which was pretty tasty.  Cocktails were good as well.    Overall, enjoyable visit and hope to visit again. Soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "18TEYYmI9ium69_PXo8BIw"
  },
  "fhPT6SzR9ByBe2yhCcF8dA": {
    "date": "10/27/2017",
    "text": "Ultimately there were so many inconsistencies with Cafe Notte, I am in no rush to go back. We were waited on promptly, but I couldn't help but feel so rushed through out our stay. We made reservations to celebrate our anniversary but were in and out in less than an hour. Typically I would enjoy this type of service but the service felt more like a diner than an intimate night out.   It was a Wednesday night, both my boyfriend and I ordered a glass of wine, it wasn't until after they were brought over did we overhear another server explain bottles were priced $10 off that evening. Very disappointed our server didn't make us aware of this, felt like a cheap way to get a larger tip on a higher bill assuming we'd order more than one glass (costing more than the bottle). I would assume most people are regulars but there's no reason not to express specials to each party in the restaurant, were we supposed to guess?   We ordered two appetizers, bread with oil and eggplant roll ups. Only four eggplants were served to the order and they were sliced so thin it was more so just a glob of cheese. Not terrible, just not what we imagined. Still wanting more I added a lobster bisque before my meal which was the highlight of my experience. One of the better lobster bisque you could find in Pittsburgh.  For dinner I ordered the chicken parmigiana and my boyfriend chose the veal. He was very impressed by the veal saying it was one of the best he's ever had. Unfortunately I can't say the same for the chicken parmigiana. The marinara was a bland, something I would compare to an Olive Garden rather than a specialty Italian restaurant.  We finished off with a cannoli just as a way to elongate our stay a little since it felt we were being rushed out the door. Now that I have a better idea of what's great (lobster bisque and meats) and what's not (appetizers and anything with marinara), another trip might make up for this but again I'm in no rush to go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3VSXGpollr0CAee0_BROtw"
  },
  "fj3jbiwgNIAhiPsXbYfI2w": {
    "date": "5/5/2016",
    "text": "This would have been a 5 star review if parking wasn't difficult.  Bring 1 car.  Former motorcycle dealership transformed into a small romantic rustic restaurant.  The lobster bisque was thin with a flavorful broth. My salmon with polenta was exceptional.  My date's chicken parm had a huge piece of meat with linguine and sauce.  We walked in to see a gruff guitar player ... and thought oh no.  Every Thursday Bucky plays at the restaurant.  He is very good.  He plays a lot of classics that add to the atmosphere.  I highly recommend and look forward to going back soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "rxw9BOhbTzVUP5rvd5Acdw"
  },
  "XzJxQuiR1lg8aDDz05n_XA": {
    "date": "12/13/2017",
    "text": "Cafe Notte, I wanted to love you so much.  You're absolutely charming and the service was perfect.  The outside patio area was so homey looking as well as the indoor decor.  I couldn't have been more happy with every thing.  I drove by this restaurant for years and wondered why I never went in.  Well... I should have kept driving.   The menu was so perfect and I wanted to try so many things.  But I figured let's start with the lobster bisque because I read all of the reviews and they were amazing.   So I had big expectations.   Alas.  A huge let down.  I did get a bowl of soup which looked beautiful.  When I went to eat it.  It had a sort of spice that was similar to chicken tortilla.  But had the consistency of a combination of quick sand, paper mache, and glue.  Which would have been fabulous if I was going to do a school project , but not for consumption.  It had barely any lobster in it.  Fast forward to today , the morning after I ate there ,   I woke up ready to die.  I had such stomach pains and felt like I had a stomach virus.  So I called my friend who ate the same soup and she was feeling equally as wretched.    First strike Cafe Notte.   I ordered the salmon salad with the homemade balsamic.  When I received my salad I was excited to eat it.  Then I did eat it.  One bite to be exact.  It was absolutely tasteless, small, and was the blandest thing I have eaten in a while.  The salad dressing was like liquified ketchup.  It was supposed to be a balsamic.  Key word is supposed to be.   Strike 2.   Finally last but not least my cocktail was the Neptune.  It should have stayed there and not came to earth.  What an excuse for a sugary mass of beverage.  The highlight of my drink was my lemon wedge on the side.  It didn't even taste like anything other than a melted popsicle without alcohol.   Strike 3.   I really wanted to love this place because of the charming Decor and nice staff.    But as they say in baseball.  You're out!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "uRrk4iuVNt5sqj2B1E2tFA"
  },
  "ZeWC6JN8uQtdTAuRmlHKyg": {
    "date": "10/16/2018",
    "text": "Outstanding! We hosted our wedding reception at Cafe Notte and the owners were amazing! Food was amazing, ambiance was great. They took care of everything so we could enjoy the day. Highly recommend for a private party or any meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2D7JQsTU6NIRl4W-bMwDw"
  }
}