{
  "l0DFy8zNsB0LG-Ckz5piWQ": {
    "date": "11/14/2015",
    "text": "Everything was delightful. Had no idea about this place, but wanted something good in the neighborhood for a night out. How nice to walk to a delicious meal in a cozy atmosphere. The restaurant was packed but we were able to sit at the bar. Bartender was friendly and charming.   We had the chicken liver mousse to start, which was SO good. Seriously, the I could eat it with a spoon... But luckily it comes with crispy toasted sourdough. :)   Entrees were great, too. I had the tagliatelle and my boyfriend had the pork loin.   We will definitely come back! Great place to take guests to the city who want something off the beaten path but as good as you'd get in any bigger city.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FINMBJhlbE3zdfzuMCRsrQ"
  },
  "PYt61yviRq8R4-D5BJLt5w": {
    "date": "2/25/2016",
    "text": "To be fair, this place comfortably deserves a full two stars. However, I feel the need to balance out the excessively inflated reviews. Some of these reviewers must have never eaten out before. Pretentious servers and hostesses, limited menu which is not impressive compared with the plethora of fine dining options in Pittsburgh, and a disjointed hipster ambiance which seems better suited for drinking than eating. Speaking of drinking, be prepared to spend $15/bottle in corkage fees if you're bringing your own wine. The waiter might mistakenly compliment your California Cabernet by saying \"you can't go wrong with South American.\" The daunting exposed power panel in the main dining room finishes off the experience.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "O7sI40vBXeO30t7u8J7blQ"
  },
  "GulqPDu2tP1cBZ32-qqMGg": {
    "date": "3/15/2016",
    "text": "I came here with my fiance for dinner on a Monday. I really loved the decor, thinking its hip and unique bringing back the old Pittsburgh train station feel. Food though, I don't think it can level to Meat & Potatoes standard...M&P feels more up-scale and more of a True gastropub to me. I ordered the Station Burger, not sure if the meat is the freshest and doesn't seem like they ground their own meat in house. But oh well, I have high foodie standards. Certainly not disappointed but not a wow either, critically speaking :)",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "8FO4taHTjBTJRXt0ZogIMA"
  },
  "GecHTUTvKNCkqaTK7oxaGw": {
    "date": "6/29/2016",
    "text": "A great new hidden gem in Bloomfield. Both of our meals (the tagliatelle and crispy chicken) were excellent in both taste and presentation. The cocktail selection is creative and good as well.  It is a very small space and I'm sure filled up fast on the weekends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "wyjJ0EhDWDBv7433FRDJYw"
  },
  "-UbI-p880FplI9dMViRsEg": {
    "date": "8/21/2016",
    "text": "Everything was wonderful, including great service. There is a new appetizer which is a corn custard and it was delicious. The liver mousse pate is always terrific. Save room for the popcorn panna cotta! Curtis is one of the best chefs in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bWlW8K0FqrRgQleph-4grA"
  },
  "zLV94bH8Rv7yT5RRrDlOHw": {
    "date": "3/4/2016",
    "text": "THE WINGS ARE AMAZINGLY DELICIOUS! the service was okay drinks expensive  food not much that appealed to me except the wings. tried a couple things very small plates neat new place to try, wish the wings were a bit cheaper",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "sPxxHafrQ6PxKZsbMk2L1A"
  },
  "AXhADgmGrNXY12ie3QdI5g": {
    "date": "12/21/2015",
    "text": "Waited for some time to eat there.  And boy, oh boy am I disappointed... Food: not too bad. Small menu, that's ok; but stuff is unbelievably rude. I mean: rude.  We had group of 6 people. We got table with stools, not chairs. That's ok too. BUT ......  One of my friends took a chair (with back )from another empty table so she can sit more comfortably since she has bad back. Holly Molly; the speed that hostess showed up demanding that chair back.  My friend asked if she can  find her another chair (and that was accompanied with a \" please \" too). Hostess said:\" NO, I need that one, I have reservation for that table\" (really?). Manager showed up, told hostess that she can get chair from somewhere else and she took off -WITH MY FRIEND'S  CHAIR. We waited 5 min for another chair!  I never had mediocre burger for $18. And I travel around the world. I don't mind paying for a  good food experience but this place is very disappointing to me.   But that's ok too, I will not be back because I love good service and this place is... Well, not even OK!!!!",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "_IOszC9vZ1NHwCsZd8GKag"
  },
  "Qn_6m_oNwMaHwD8LtfFX5A": {
    "date": "10/1/2016",
    "text": "Excellent food! Their dishes are consistently well thought with a ton of unique flavors. Good selection of beer wine and cocktails.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7yHOIvM2hEzFI28t-zM3JQ"
  },
  "2TvbKvzaXTrlYbkJEwxMKQ": {
    "date": "7/21/2017",
    "text": "Very good service ....wonderful! If I could bring them to Va beach with me I would eat there all the time . The presentation of the food is just fantastic. The taste was even better I have recommended this restraint to everyone who has asked me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IvrA9PXlCdPmc3C-VbSJnQ"
  },
  "Im-YWcZqQucYpIOm5Eqr3Q": {
    "date": "1/4/2016",
    "text": "Walked into an empty restaurant on a Tuesday night around 5:30 and the hostess immediately asked if we had a reservation.  No, we didn't.  Why not? Because it was Tuesday.. at 5:30.  She gave us some attitude and hesitated to seat us but a manager interceded and told her where to put us.  An hour and a half later, as we were preparing to leave, at least half the restaurant was still empty.    Aside from this, food was ok, overpriced (for sure).  A failed attempt at \"fancy\".  I don't recommend going here - many other places in the area that are way, way worth your time, including most of the restaurants up and down the street from this one.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "kcdMCsewzjClqbS72NksDA"
  },
  "QgSR6A4ovylBkpTQ1yS_nQ": {
    "date": "8/23/2017",
    "text": "We love Station. The food is unique and the drinks are amazing. The bar manager Jesse is the reason we keep coming back. He's so kind, makes amazing drinks, and always has the best service. Go for the food and fall in love with the drinks and service. Seriously love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KH34S0hnv54m0qYnihf4Yw"
  },
  "upkCm-0cQkelnq2FlKgSgA": {
    "date": "12/11/2015",
    "text": "I just paid $30 for a gristle-y skirt steak garnished with mayo and deep-fried cauliflower.  The staff were great, but the food was seriously underwhelming. Just go to Butcher in the Rye.  Maybe just come here for drinks.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Ad_tljJactehONNM3ADRuw"
  },
  "wGSL9CpGTd6k2gG96No2mQ": {
    "date": "2/14/2016",
    "text": "My fiance and I went to Station for the first time last night. Quick review: Appetizers were so good, dessert was awesome, drinks and entrees were okay. Longer review: We ordered the carrot salad and crispy wings. The carrot salad was delicious, it was seasoned perfectly with harissa and was pretty filling for being veggies. I think when you serve something called \"carrot salad\" you kind of have to hit out of the park, and Station does. The crispy wings were amazing, albeit a little greasy. They had a simple flavor (olive oil, parm, and chili flakes I think) but were done right. They had a foam-like white sauce drizzled on them that I could eat with a spoon. Our entrees were okay. I ordered the pork steak on the waitress' recommendation. It wasn't bad, just didn't wow me. The pork was cooked well and was served with some sort of mash and a few pieces of homemade pasta. I think the mash was the best part. My fiance ordered the tagliatelle, which we both agreed was good, except it needed salt. There wasn't any salt on the tables, which made us feel like we would be looked down on for asking for it. The panna cotta popcorn was super good, a great combination of sweet and salty, although for the price, the portion was scarce.   Also, to go along with a few other reviews, the staff was pretentious and did not impress me (although the bartender was fun). The two hostesses that were working acted like they couldn't be bothered with seating people (we waited 15 mins past our reservation, even though the table was open). Also, we attempted to put in our app order first because we were hungry but hadn't quite decided on entrees and our waitress told us that the chefs request we put in the order at once so that they can pace our meal. Um, what? I've worked in a kitchen and you can \"pace\" a meal without having the whole order if you know what you're doing. Pretty surprised by that comment.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3c2NzRlctya3s5UKxu9Mpg"
  },
  "oJ8ma_BlRvorOXPMOOMf3A": {
    "date": "4/11/2016",
    "text": "The food was amazing.  I don't care much for chicken and the crisp was flavorful and not greasy.  The \"cheeze whiz\" was a hearty touch to the pork shoulder.  The tots were questionable at first, but amazing with every bite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0vzz7DN8s487n6HGL7Olag"
  },
  "K6zxrKn5OXvC-AyVOtNh0A": {
    "date": "12/22/2016",
    "text": "Very overrated and over-priced. Ordered a standard cocktail that was watered down and tasteless. The fish we ordered that night was very under-flavored and dry. The appetizer was fussy and pretentious but was essentially a dressed up salad. The waiter seemed to be trying her best, but the quality of the food was very disappointing, especially for the price. Seems the price tag is for the buzz and the hype rather than the quality of the meal.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zgM93iYxmtsjpsjga7mPoA"
  },
  "oryOSNEo4XlqLesW5d6-ag": {
    "date": "8/27/2016",
    "text": "The main reason I'm giving 3 stars is the prices/value 15 dollars for a hamburger and fries and 11 dollars for about 5-6 wings left me feeling quite ripped off. They were definitely good but that's such a bad feeling, feeling like you're significantly over paying. And that is the reason I will not return. Also I ordered 3 cocktails from the menu and none were what I would consider strong, i.e. I felt I was paying for the \"accessories\" in the drink and not the alcohol - again the absolute thing you don't want to feel like you're paying for at a bar. I saw some negative reviews of the service, but I have to say that our server was absolutely excellent, but after a $100 bill I felt like not tipping 20%+ as I normally do for great service but then of course realizing the prices are not the server's fault did so. Point is I want to feel happy about leaving a $20 tip. So I will not return.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "BwbAj6h9Tx1m_cOx8Tm54Q"
  },
  "wYWtIaCUkkyKtD_VkJ3b7g": {
    "date": "2/28/2016",
    "text": "The restaurant has a very cozy environment. We sat at the bar and the bartender was very friendly. We had 2 small plates: chicken liver mousse and beef tongue, and an entree of steak - all are pretty decent, but I personally liked the beef tongue the best. :) The drinks are good as well. Would recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KwMePWExQo2M0D8b6DzBnQ"
  },
  "sS0CE5QW5bmaQxuszaPVsA": {
    "date": "8/17/2015",
    "text": "As soon as I finished my meal at Station, I was already planning my return visit. I have zero complaints. The service was friendly and attentive. The atmosphere is perfect for a date, a get together with friends, or a stop at the bar for 1. I ordered a martini (it was excellent), the heirloom tomato salad (I was sad when my plate was clean), and the crispy wings (some of the best wings I have ever had). Dessert was the caramel popcorn creme treat, and it was fantastic. I'm happy that Station has found its home in Bloomfield. I highly recommend a visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "W2M2cfpPukctcitkVvUZpg"
  },
  "xSOEBH0pXKeocaqFas00uQ": {
    "date": "4/5/2016",
    "text": "I love Station. Pittsburgh needed a restaurant of this caliber. The food, drinks, and service are great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a1YCt0edAK3BP1FRPuh2Jw"
  },
  "Zl7hVDb0KQavyAYTlj2tJw": {
    "date": "12/29/2015",
    "text": "I always look at Yelp but never review..but after tonight It was needed! Station was absolutely delicious and service was great. You would be doing yourself a disservice to not try",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-89_iWc632xzd0TOmKq3Zg"
  },
  "gZ4B2TU8dczDZQWtvU4yzw": {
    "date": "2/17/2018",
    "text": "Absolutely outstanding dinner!  Every dish we had was delicious:  the heirloom squash, the crispy wings, the scallops, the tagliatelle and the calamari bolognese.  Very innovative dishes with great sauces and flavor combinations.   I'd rate this restaurant right up there with the best of the Deshantz restaurants (I loved Tako, thought Pork and Beans was just ok, will be going to Meat and Potatoes tomorrow night).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TCHGrdulnPMQWEzxRbX9Zg"
  },
  "9iNJzaV3cv0OOELqos2RzA": {
    "date": "1/12/2016",
    "text": "Station was a pleasant surprise and since it had opened I was curious about whether or not it was worth it.  I got the crispy skin chicken breast & thigh and it blew my mind how tender the chicken was. I don't think I had anything close to how good it was. About anyone else's meal, I can't say, but my partner didn't like his burger but everyone else cleaned their plates.   Even if they don't have the best burger, they have the best chicken.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "BkMqpJikNc3r5itc-ui6ww"
  },
  "2PwV3YyDslJSFFvZWHyAEA": {
    "date": "2/12/2018",
    "text": "Good food, great service! Our breakfast was well done and made to order and service was quick and delightful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XP-gIio_calZ6Uyo5op2TQ"
  },
  "QtWHvsD_RXb2Otl_ThJIhQ": {
    "date": "11/10/2015",
    "text": "I came here for dessert. This will be my go to dessert for the entire city.  ...............Caramel popcorn panna cotta................. I don't think people understand how amazing this dessert is! The first time I had it was when the chef presented it at Dinner Lab. It blew everyone away. I'm so happy they are keeping it on the menu. Try it, I promise you will fall in love!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "ajvtJjaUcgukamiyCiwuYg"
  },
  "h0tR77nZ_JnmKQ-WzqtOWA": {
    "date": "1/10/2017",
    "text": "I came here for brunch with 2 of my lady friends, the third was unable to make it :-(. We wanted to booze, brunch, and bitch, as we do. We started with 2 bloody marys, and a michaleda. Their bloody marys are SPICY but not overly so, they're rimmed with some smokey spices, they come with a pickled pepper and a pickled beet (?). Both of which I ate. I'm a sucker for briny things. I love their bloody's. They're perfect. I tried the michaleda and really enjoyed it too. I followed up with a margarita. It was very good, not the best I've ever had but I'm really picky about my margaritas.  I ordered their steak and eggs. The steak was cooked perfectly. The \"bbq tots\" were incredible. I could seriously eat about 20 of them! The bearnaise sauce was really good, very creamy. I'm weird about eggs, I really truly am. These eggs were over easy (or as you 'burghers call it \"dippy\"). The bread that came with my meal was perfect for dipping and sopping up the warm yolky mess I managed to make.  I would definitely go back, and I quite look forward to having dinner there. I can only imagine it is equally as delish! It's a bit pricey, but I never really mind spending the money when the portions and the food is as perfectly balanced as their was!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EWkQxKg-KOzujC38Z_40wg"
  },
  "xaUDKZt6X1d_8QVAtsTynw": {
    "date": "7/29/2018",
    "text": "So exited our friends brought us to station! We had an incredible meal. The corn and tomato salad was like summer on a plate, fresh and absolutely delicious!  Our group had scallops, hanger steak, and the ribeye, everyone was very pleased with their meals. We also share the popcorn pana cotta...sounded a bit strange, but do not miss this, it's an amazing dessert!  The drinks from the bar are also amazing, super fresh ingredients and very delicious, the Avaition  was one of the best I've had.  Our server Nick was top notch, knowledgeable of the menu, attentive, and easy going with our rowdy group.  Thank Nick for making the night so enjoyable!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FT_ZbVif6xzeTksHJqWARQ"
  },
  "JOTn_8z95YRfSowOff4t9A": {
    "date": "10/24/2015",
    "text": "I had a preview of Station at a yelp event at the Children's museum. Out of all the restaurants that were there, Station stood out to me and all it took was a very tasty and earthy carrot salad. They let me know that they were scheduled to open in Bloomfield in July and I've had it on my list to visit.  Last night I had that opportunity and it was great. We were a large group and I called and made reservations ahead of time. They called me the day before to confirm. And when we arrived, we were promptly seated. The chicken wings were off-the-hook delicious. We got the carrot salad that was equally tasty. The Belgian endive salad was okay for me, but the others in my party loved it.  For my main, I had the pork tagliatelle with the farm poached egg. This dish did not disappoint. The pork delivered just the right amount of salt and had enough jus to soak up the pasta.  The restaurant filled up quickly on this Friday night. The noise level was moderate, but didn't interfere too much with normal conversation. Station seems like it would easily become my go-to bar. The only drawback is that I don't live too close to make frequent visits. I'll definitely be back though. Highly recommend this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-CgUc-IU9eOC_VT-epVPbg",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Pork Tagliatelle",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-CgUc-IU9eOC_VT-epVPbg/o.jpg"
      }
    ],
    "user_id": "N_LyFYrey_LuxJFkdFwRkw"
  },
  "ur4Ordg1ctQt7QZfnAKs_w": {
    "date": "11/9/2015",
    "text": "I found Station on Yelp and immediately added it to my Bucket-list. I didn't know exactly what to expect but talked my brother into trying it out. We entered into a charming little bar area with lots of seating options. It was around 5:15 on a Friday night... there were only a few patrons in the bar/restaurant. We were lead to the dining room which continued the industrial theme of the bar area. I love the industrial look and the low lightening made the place seem cozy and intimate.  They had a nice drink selection. I ordered the Riesling and my brother had the Belgium Snapshot Wheat. I scanned the menu, and realized I should have done some additional research. The menu was very limited. My brother settled for the safe choice of the Station Burger. This was a burger on a Brioche bun, topped with Asiago Fondue, Onion Ring and Onion Jam with a side of fries. ($16)... it was stacked high and took him no time to finish despite it's intimadating size. I opted for something out of my element. The Caramelized Cabbage and Taleggio Ravioli. The cheese ravioli was topped with brussels sprouts, pickled raisins, verjus, and bread crumbs ($22). Delectable! One of those dishes you keep thinking about how good it was the next day.   My advice is to read the menu on their website prior to eating here. If you aren't willing to try something a little different it could be difficult to choose a meal. If you are willing to try something new GO HERE! The atmosphere is perfection and the food is delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "s9cI2U6kyJj8yTFNvmfveg"
  },
  "U38PHKctwKtHkD7eruQwKQ": {
    "date": "7/23/2016",
    "text": "I stopped by here a couple of Sunday's ago with my wife for my birthday dinner with her.  This wasn't our original choice of restaurant but whenever the first one fell through we were happy to be able to quickly make reservations at Station.  Whenever we finally had made it to Bloomfield and entered the restaurant I was a little confused.  All that I saw was a bar area and a few other tables to sit at.  Whenever we checked in with the hostess she led us to a second room of the restaurant which had some diners and many more tables.  The inside of Station has an industrial feel and I find it rare in restaurants to find painted black walls like they have here.  I decided to start off the evening by having a cocktail and went with the paisley park.  It ended up being a good choice as the drink was flavorful and had a slight tartness to it which I really enjoyed.  Then for my entree I went with the tagliatelle with my wife went with the burger.  My entree consisted of smoked pork, soffrito, a 1 hr egg and some parmesan cheese but it was really my wife's burger that caught my eye.  It looked amazing and she confirmed that it was while allowing me a small taste.  My meal ended up being quite good.  The egg when broken open had a nice a runny yolk that helped to cover the pasta and give some more savoriness.  I also really enjoyed the sauce for the pasta.  It wasn't a flavor that I could properly identify but it was pleasing.  The pork on the pasta was also good since it was cooked properly and had a light smoky flavor to it.  Overall the flavors melded together to make a nice tasting dish.  The bottom line for me is that I would head back here again in the future.  My drink was good and while I enjoyed the food i ordered, I have to admit that I was jealous of my wife's burger.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 5
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "vI9GuYlmFPb1TW-nael1aw": {
    "date": "7/19/2018",
    "text": "I have been to Station a couple of times and came back for their great crispy chicken wings. My boyfriend and I also love Szechuan peppercorns and were really excited to try the grilled pork rib. Unfortunately, the ribs did not have even the slightly spice to them and there weren't any peppercorns on the plate. We were really disappointed in the flavor of this dish, but the ribs were cooked well and the yogurt sauce was unique.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EBA0oPoDF3bRxjFGILn5hA"
  },
  "j59obKY5d4PHbk2uTR-Eew": {
    "date": "7/31/2016",
    "text": "Well, I had HIGH hopes. The place looked cool when we walked in, the decor is modern and clean. The problem immediately was they did not have the air conditioning on and it was ridiculously hot. My table of 8 literally were sweating the entire meal and it was horrible. In addition to that, the waiter neglected our table all night. Forgetting to bring water, not coming back to take drink orders, messing up the bills. And the worst part? The gratuity was already taken out, so we couldn't even decide if the guy deserved a full tip.   The food was very good... the mixed drinks amazing, but because of all of the other issues, we will NOT be going back. What a shame!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "L2_5dUNYDI4USpGSCsH_2w"
  },
  "AOYSUkRwiruPmEb9rEdDmQ": {
    "date": "7/13/2016",
    "text": "It's hard for me to do this because of the effort they're making, but this place was extremely overpriced for the poor quality of the food, which doesn't measure up to the place's aesthetic and reputation.   Two drinks, three apps, and an entree ran about $100, and I'd say only two of the apps were something we wanted to finish. The drink orders (classic ones anyone should know to make) were both pretty bad, watery and in one case with the liquor I didn't want. A dish of greens and peas just didn't really gel together, and it was hard to imagine what kind of palate would enjoy it. Finally, the monkfish was undercooked to the point where it wasn't edible. By this point so much had gone wrong that it almost didn't feel worth saying anything. It's just negligence.   There was one standout dish, the wings. Among the best I've had. This sounds bad, but even with this unusually bad experience, I'd go back for those.  It could also be that this was a fluke. A friend mentioned loving the steak and wings there. Still, it's unusual for a restaurant to deliver that bad of an experience. I think there are better options.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "H_kTogXgz8rZTFSUUge8Rw"
  },
  "1SXtYzSt36pib_qPllL-sw": {
    "date": "2/14/2016",
    "text": "We've been following Justin and Curtis since they did pop ups around town and have been excited ever since they opened.   Honestly, one my favorite restaurants of the past few years (inclusive of moving from Los Angeles and trips around the country).   Always inventive and unique, seasonal dishes that are done perfectly.  Bar is fantastic as well.  Love just sitting there and having the bartender craft a cocktail based on taste.  My only knock (minor as it is) is the limited dessert menu.   But honestly the rest of the menu is so good I tend not to have room!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "50QeMDZtrxP-AM_734ym7A",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Charred carrot crispy tofu ramen. The broth was sooo good!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/50QeMDZtrxP-AM_734ym7A/o.jpg"
      },
      {
        "img_id": "mIOlDCKNxnYK6tVEi4fCNA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Crispy tofu bun - ramen night",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mIOlDCKNxnYK6tVEi4fCNA/o.jpg"
      },
      {
        "img_id": "77Gdm0F1lUt4BmlDWYAC4w",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Spare rib - ramen night",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/77Gdm0F1lUt4BmlDWYAC4w/o.jpg"
      }
    ],
    "user_id": "sxJpW5MbmEm-gFoFU4Cb6w"
  },
  "9iujIEwO4NwCT-v1nETFxA": {
    "date": "11/5/2016",
    "text": "My husband requested we finally go to Station for his birthday dinner. We made reservations a week in advance, but because we abide by an elderly dinner schedule (eat by 5:30 nightly) we wouldn't have had any issues getting a table anyways. We were pleasantly surprised by their new Saturday happy hour, and treated ourselves to $6 Moscow mules. Both my husband and I were torn between the tagliatelle and the Station burger, so we each ordered one and split it, and we were both incredibly satisfied! Combined with the casual-cool ambiance and fantastic service, I could not find a reason to give less than 5 stars. Love Station!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M-S9g2YX1cUgb3W5cos9tQ",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Tagliatelle and Station burger. Amazing!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/M-S9g2YX1cUgb3W5cos9tQ/o.jpg"
      },
      {
        "img_id": "MfreyRFX3d_AJdEk1cuikw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Moscow mules",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MfreyRFX3d_AJdEk1cuikw/o.jpg"
      }
    ],
    "user_id": "3B2J5ggqEbXTi7HOfZu12g"
  },
  "-oIbhUciEhaUcdqO6695XA": {
    "date": "12/24/2017",
    "text": "The quality of the ingredients is enough to earn five stars. Your taste buds will orgasm with each course. The service is delightful.   The Hanger Steak is one of the finest meals I've had in years, and we eat out often. This dish is the quintessential foodie meal...expertly prepared, perfectly balanced. Makes you want to literally lick the plate.  We will certainly be back, and with friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xj41P0XNCiMF0jazS70-zg"
  },
  "t40FrOhHF1CFNEj_mg11JA": {
    "date": "10/30/2016",
    "text": "FOOD:  Good food.  I wouldn't say its the best I have had.  Recently moved from Brooklyn, NY, and this place reminds me of Park Slope.  Tried the lamb, and was disappointed. The dishes look good, but the meat had a strong game taste.  The other dinner options did look good though.  Appearance of each dish is on point.   PRICE:  As expected for this quality of food.  Although would say it's a bit more than what you actually get.    ALCOHOL:  Drinks and beer selection are great.  Tried multiple and was not disappointed.  Prices made me feel like was right back in NYC though.   ATMOSPHERE:  Very Hip/Trendy venue. Clean.  Friendly staff.   Would return, only after trying other places first.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ThqckHwCH43Dv5iRtR0e0Q"
  },
  "bLiBB5pI7LxGEGHPm3opHg": {
    "date": "5/28/2016",
    "text": "Came here for the first time recently. I had asked around before coming but no one I knew had gone so I came with no expectations for the place!   AMBIENCE B+ On the scale of looking hip and trying too hard Station sits squarely in the middle. Why? Because if your seat happens to be facing outwardly from the restaurant interior, you'll be fine. Hip lighting. Hip Windows. Hip tables. If you are facing the interior you'll get an eyeful of other random things that someone thought of. Meh. It felt very sterile for how cookie cutter hip it was. Like someone googled 'how to be a hip restaurant' and then did some Pinterest crafts.  SERVICE A I don't actually remember the service much, but I think that's a good sign. Which means nothing went wrong, I had no complaints, and the matching aprons they all had were not too distracting!   DRINKS A- They were strong. For sure. I got the Son of a Witch which was good enough but felt a little overwrought. It was trying to be new but just tasted like a sweeter boulevardier. Actually now that I think about it I'm pretty sure it inspired me to make boulevardiers the following weekend.  APPETIZER A- We got the corned beef tongue and chicken liver mousse. Can't mess up chicken liver mousse, so that was lovely. Corned beef tongue was such a huge portion and such a dense amount of flavor I ate maybe half of a toast piece before giving up. It's supposed to be a small plate!   MAIN COURSE B+ I struggle with describing my main course. I ordered the Bavette steak medium rare and it definitely came out medium rare. The meat was cooked to perfection. The texture was perfect. Someone knows how to grill! But that's where they should have stopped. Instead it had two different sauce mixtures on it, plus quite a bit of salt. So much so I couldn't actually taste the meat anymore. It was such a weird sensation. My mouth knowing it's a perfectly cooked piece of meat from the texture but feeling like I'm eating pieces of salty garlic aioli. Step back from the sauce squeezer.  DESSERT Did not have dessert since my friend can't have corn and I'm allergic to lavender. And those were the only two options. I was also way too full by that point to have dessert. Those appetizers were the size of what I normally have for dinner.  A friend asked me how it went and all I could say was eh. I genuinely do not know if I enjoyed it or not, which is a weird thing to feel after three hours and a hundred dollars.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "zpkDPhrM1fCOBwuTbCDG6A"
  },
  "CJFjJiUgXmITRD3Gz2ltFA": {
    "date": "8/29/2015",
    "text": "My girlfriend and I decided to have a spontaneous date night. Station had been on our list, so we decided to try it out. This ended up being one of the best meals we've had in Pittsburgh.  The service was absolutely amazing. So we walked in without a reservation because we don't have much insight. We walked in and they told us that the wait would be about 45 minutes without a reservation. We accepted the fact that we were ill-prepared, so we told them that we would try again sometime during the week with a reservation. The host then asked us to wait a couple of seconds and the manager came out and arranged it so that we could sit down right away. Honestly, it was our fault that we weren't prepared and they still accommodated us with a smile. A great start to the night, we were consistently met with friendly service through the rest of the dining experience.  So enough about the service... the food was DELICIOUS. We both got the burger and shared a roasted carrot salad. The roasted carrot salad was absolutely amazing. Well spiced with multiple different textures (crispy fritters, tender carrots, fresh cheese), it was a great starter. Then the burgers came. Oh man... I love burgers. It's hard to find a good burger: fresh meat that is well seasoned and cooked. I've been looking for a great burger in Pittsburgh and this definitely delivered. The burger came medium rare as recommended: the meat was juicy and seasoned perfectly. It had sweet caramelized onion jam, cheese fondue sauce, and a crispy onion ring all between a brioche bun. On the side was double-fried french fries and spiced mayo. Best burger I have had in Pittsburgh (the only other place I can think of that would compare is Butterjoint's burger).  Fantastic food, great service. It didn't take very long to realize that this would be a 5-star Yelp review.  At the end of the meal, the manager came out and spoke with us for a bit. He spoke highly of his chefs and was genuinely excited about his work. This type of passion is rare. The perfect experience we had was due to the teamwork and chemistry the entire staff share. I will definitely come back soon... WITH a reservation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6IcMAj9LKnIA-enNHMBYUw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Roasted carrot salad. Absolutely amazing!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6IcMAj9LKnIA-enNHMBYUw/o.jpg"
      }
    ],
    "user_id": "Mjh9oYg5xLtjcBpTFcNiWw"
  },
  "vighmtcXWJdPl_nmL-fTeg": {
    "date": "8/26/2016",
    "text": "I came back to update a review that I wrote last year because we just had an amazing meal at Station.     There is a corn custard currently on the menu that is one of the best things I've eaten in recent memory.  It's incredibly fresh (due in no small part to the time of year) and flavorful.  When I go back, I may just have this as my meal.  I also had a angolotti of polenta and straciatelli that was also excellent.  I don't often eat meatless meals, but this one was exceptional.  The wine selection is well-edited and Craig the bartender is the best.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9IA3P3DxrZcoAl29IYOloA"
  },
  "ZbGu-Vn48Wztgzjxl9d-jg": {
    "date": "2/26/2017",
    "text": "A wonderful experience from start to finish!  Well worth the trip from Cranberry Twp.  From the Lion's Tail cocktail and Old Fashion with St Germaine our party loved the gourmet delicacies served promptly and pleasantly by the staff.The atmosphere is urban but comfortable.  We very much enjoyed the Chicken Liver Mousse, Crispy Chicken Wings and Tongue on Toast appetizers The party of four shared - The Braised Pork - Served in pork broth with the homemade-tagliatelle pasta  Grilled Bavette Steak served with fried Cauliflower, roasted mushroom, roasted onion, roasted garlic custard.  There were amply servings with leftovers the made our adult children happy.  A wonderful celebration for the Booher Family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZnmiVRE-VAjJjMo9r6AYiA"
  },
  "anvlCQZIY8ujeho7zyhwcw": {
    "date": "1/15/2017",
    "text": "We've been meaning to get to Station for some time, so I joined my wife and her friend as a third wheel on a Friday night. Reservations were easy enough and the restaurant was full for the entire evening. I wasn't exactly sure how to describe their menu... gastropub? Italian? Not quite sure.  I was pleasantly surprised with their affordable list of wines and tried both the Cabernet and Malbec, both of which I enjoyed. Pretty standard list of cocktails with a focus on bourbon from what I could tell, and a list of 8-10 drafts.  We decided to start with the chicken wings which were some of the most unique ones I've had in Pittsburgh and came from chickens on steroids from what I could tell (they were big, not implying anything else). Crispy/spicy and covered with an oil, cream, and pickled peppers.  For dinner I had a pasta dish with pork (which was ham, was expecting a different preparation but was gladly surprised) and a one hour egg. I had a hard time ordering, but this dish was a pleasant surprise.  We split the two desserts on the menu including the caramel corn panna cotta which was fine enough, and the lavender pound cake. Not overly aromatic, and a unique combination, but not my favorite by any means.  Overall an enjoyable experience!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhQOA8-FdpA6D0hNhXEYIw"
  },
  "vRQra84XnAAOZrFDxECB7g": {
    "date": "9/16/2017",
    "text": "Everything was delicious. We had a party of seven so there was some waiting for the food to arrive for each person and that was a bit of a downer. But everyone was so quiet during their entrees and that's always a good sign. I had the seasonal risotto and it was amazing. Couple of flaws, though...my bowl of risotto was $20. The main plates are just incredibly overpriced for Pittsburgh...even by downtown standards.  And multiple times the waiter forgot we had ordered drinks so we had to ask about them...keep people drinking and they'll be happy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "IQ6prQsF44Skp-lBQnBJGA"
  },
  "7lDSLOTO0rItWwi228WKnw": {
    "date": "12/6/2016",
    "text": "I went to meet a girlfriend the other night at Station! I can't believe I have never gone! While, I didn't get a chance to eat, the food that I witnessed smelled and looked (read cheesy pasta) amazing!!! The space is really cute inside and I would definitely love to go back for a date night or a ladies night out!   While I didn't have the opportunity to stuff my face with carbs, I did get to have cocktails (liquid diet for the holidays, ya know?). The gun street girl was really delicious and refreshing! Bourbon and rose water...how perfect! They also made a mean dirty martini!! Can't wait to return!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OWtzJMlqA7cY559O80nqQg"
  },
  "-pw1ZnwajCUXFg5_JD2lHg": {
    "date": "5/6/2016",
    "text": "I went on a Thursday night last week when there were about 5 other parties in total at the restaurant.  I ordered the monkfish and my boyfriend ordered the steak.  Even though they were not busy, it took one hour for our food to arrive.  My fish was room temperature just bearable enough to eat, but our server would not have known because he didn't stop back to ask how the food was until 20 minutes into the meal.  My fish was also not cooked completely through.  It was so tough to cut that a piece of fish ricocheted off of my plate to the floor.  The piece that did fall was about 20% of our meal given that the entrees don't include sides: just a few garnishes and sauce here and there.  After I paid my $100 bill, I concluded that I got the kind of service that suggested the folks here didn't want me to come back.  On the bright side the beer I got was pretty good.  They have a good selection of alcohol, but it's a little ridiculous that I was charged $1 for ice.  I'm sure the waiter didn't mention it because it's ridiculous.  Outside of the nice atmosphere of the place, this is a failed gastro pub. (I should have known by the vibe I got from the lack of patrons.) Entrees should not average $25 just to be meager and cold.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 2
    },
    "photos": [],
    "user_id": "JeERFBZyECRwzscG3dvKQQ"
  },
  "8d-J5lFxyejO38nvAq7Zew": {
    "date": "3/17/2018",
    "text": "Station is easily my favorite restaurant in Pittsburgh. I had some family come visit and when I made a list of dishes they had to try in Pittsburgh, Station was the only restaurant that had multiple-must try dishes. For starters, the crispy wings are to die for, and I am not typically a fan of bone in wings. The breeding, the cheese sauce, the extra kick...just try them. The burger is hands down the best burger I've ever had. I will crave the combination of asiago, bacon jam, and onion rings piled on my burger for years to come. Just make sure you come early, as they frequently run out of the burger!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rYWnTtL6Y5I_FQC91n9FcQ"
  },
  "wZ6tBtxzLanYIClPLrPMGA": {
    "date": "4/13/2018",
    "text": "Very mediocre experience... the salad was super salty and it was very very loud the day I went there. Friendly staff though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jOMbcoik7_mYaXzL01nmxQ"
  },
  "4xSM8EqD_Prhw_cmib89uA": {
    "date": "3/30/2017",
    "text": "After a meal with some friends, we were looking for a place to chill that wasn't very noisy to catch up. We wandered into Station and knew it was the perfect place!   Staff was friendly and the atmosphere was a exactly what we needed. I was actually surprised how laid back it was for a Saturday night in Bloomfield (me, two friends and Ankur three or four people at the bar). The place itself have a very modern and rustic look that you see a lot of these, but it makes the place more comforting and warm.   We didn't order food, just drinks. Glass of wine was around $8 which is average.   I would definitely recommend this place if you're looking to hang out for an hour or so without a crazy crowd and noise.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 6
    },
    "photos": [],
    "user_id": "pkpzIhX1mNzLLEEyj4syKQ"
  },
  "p8FyOyN7iKF1Qur6B39YHQ": {
    "date": "2/24/2016",
    "text": "This is a great addition to Pittsburgh's new American cuisine scene. They do what many other great local restaurants do (I'm talking Butcher and the Rye, Eleven, Meat & Potatoes), but they do it very well. I don't think you're going to have any serious revelations here, but you also aren't going to go home unhappy.  The night we visited, I had their specials. First, they offered a lovely sangria, which was a bit sweet for my taste, but which was very nice with the dinner. We shared their wings - nicely done, but a bit overpriced for wings at $11. My dinner partner got the miso-poached apple ($9), which was a TINY amount of very lovely apples, but was served on a giant plate, further emphasizing the ridiculously small portion.  Two of my dinner partners got the Grilled Bavette Steak ($28), which both of them absolutely loved. They were raving about how tasty and tender their meals were. Another friend got the cabbage and taleggio ravioli ($22), which was not the most beautiful dish presentation-wise (brown on brown on brown), but which he enjoyed. He said it was glorified cheese ravioli, but luckily he likes cheese ravioli. I ordered the special, which was monkfish served in squid ink ($28). This was probably the best white-fish I've ever had - it was presented like a ribeye, with the large central bone still in. The flesh was tender, tasty and a delight to eat. I would certainly return for the fish, though sadly this is not on the regular menu.  The wait for our main courses was very long, probably 45 minutes plus from ordering. Luckily my dinner partners and I like each other a lot, and the conversation flowed, but I was surprised that it took as long as it did. I would certainly not recommend coming here and expecting to eat quickly, but on the other hand, that was part of the charm. We did not feel rushed out or hurried.  We finished with the lavender pound cake ($8), which was a very nice pound cake, though I detected very little of the lavender. There was a nice pineapple component, though.  We all left very full, happy with our meal, and having had a very nice long dinner together. I would certainly come back - but! I would probably not order appetizers here. I'd likely steer directly towards the fish and steak options, and away from salads or pastas.  Looking forward to coming back and trying more menu options!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "xHvXI-rNuk52jehqnQS0eg"
  },
  "PgDf_HjiI_cvDHLN_fSJDQ": {
    "date": "2/28/2017",
    "text": "Before a concert on Saturday night, my husband, two of our friends, and I all snagged dinner together at Station at 6pm. Finding an available restaurant for Saturday night just a week in advance can be challenging, so I was happy to obtain a reservation here.  Hubby and I had previously been to Station for a Yelp event. We had a great time - food was great, drinks were great, conversation was great, staff was great, the Bulleit Bourbon rep was great. Because of this event - and all of the great reviews - Station has been on my to-return-to list.  The four of us were running about 10 minutes late but were seated immediately as soon as we arrived. I had spent the Yelp event on a cozy leather bench seat in the bar area and got to check out the dining room this time. The decor is trendy and cool, but the temperature was quite chilly (I almost wore my jacket during the meal) and the wood chairs became a bit uncomfortable throughout our hour and a half stay.  I ordered the Duck and White Bean Ravioli. I was expecting a rich, creamy dish, but got the exact opposite. The combination of arugula and a smoky onion broth gave a very bitter flavor to the dish. The ravioli seemed Asian-inspired with a thick pasta, and the duck filling was heavy. I did not enjoy the dish. My husband ordered the Roasted Venison Leg. Based on the description, I expected a large amount of meat with sweet potatoes and gnocchi on the side. Though the dish had nice flavors, the presentation and quantity fell far short of our expectations. A small dinner plate arrived only about one-quarter covered in food. A few ounces of venison sat on the plate with artistic dots (I'm assuming the sweet potato and gnocchi bits?) placed around the petite slices. It looked like a child's size quantity of food that just didn't deliver for the $29 price tag.  Based on the above, I would have given the experience three stars, but unfortunately, the waitress pulled the whole experience down to two. Now the pros... she did what was directly requested of her. The cons? Her energy was less than a zero, and she seemed to make no effort beyond specific requests to help us. The initial bottle of water was delivered, and even after our glasses were nearly empty and only a few ounces remained in the bottle, I had to request more to drink. We were interested in ordering more beers and cocktails but were never asked about it, even when the glasses were clearly empty. When we were asked how we were doing (the only time), she received one response and quickly scurried off again, ignoring the other three people at the table who also had a request. Our food was delivered without the \"need anything else right now\" check in and we were asked if we'd \"like to order dessert\" with no offer of a menu or the options. I could go on and on, but the entire meal just felt like the table was exerting effort while the waitress answered only direct commands.  After this recent experience, I am sorry to say that I am not interested in returning to Station at this time, even if that hard to find Saturday evening reservation is available again in the future.",
    "rating": 2,
    "rated": {
      "funny": 6,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "cCke3VtFLtqgzkgYSrSE2g"
  },
  "2X3gczMolzIwm9OsxD8BUQ": {
    "date": "5/5/2018",
    "text": "Had dinner here last night with my dad. I ordered the grilled octopus with sweet corn, pickled jalapeno, baby bok choy, and white bean fritters with a bernaise (?) sauce. It was amazing. I've never had octopus that good! My dad got a pork chop with pierogis, which was quite good, but not amazing (but it's also not something I would order, so take my opinion on it with a grain of salt). I also had a Champs Elysees cocktail, which was awesome! It came in a cute little glass and had these amazing layers of flavor. A bit expensive but worth it for the quality of ingredients, skilled preparation and unusual combination of flavors. Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tfKeDywe7zlzp-mmTTIDWQ"
  },
  "3mKtrJvIUMhSUsz8y1DsvQ": {
    "date": "1/16/2017",
    "text": "I finally got a chance to try this place and it is one of my favorite of the new Pittsburgh restaurants this year.  I love the cozy atmosphere and ambiance that is made to look like an old train station, with nice details like the tin roof.  The menu has some interesting options and it was hard to make a decision.  We started with the wings which we shared, and they were so juicy and full of flavor let crunch on the outside--some of the best wings I've ever had.  For my entree I had a pasta dish, the Tagliattelle, which was amazing. You could tell that all the ingredients were very fresh, the pasta was homemade, and the egg on top was perfectly cooked. In addition to some of the fancier entrees they also have a nice range of regular bar food like burgers and sandwiches. All of their portions were generous and I felt the prices were reasonable for the amount and quality of the food.  They also have a decent beer draft list and a nice cocktail menu.  I tried one of their cocktails which was excellent. Their brunch menu also looks really good and I want to go back there sometime to try it. This is a great addition to the Bloomfield neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 9,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "yOFp8bsxdF0lQK01Nvm1FQ",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yOFp8bsxdF0lQK01Nvm1FQ/o.jpg"
      },
      {
        "img_id": "3mGpBuE1rocSc3vWFJPhUg",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3mGpBuE1rocSc3vWFJPhUg/o.jpg"
      }
    ],
    "user_id": "3bo1FXvQnxw2hmO0CHH4Nw"
  },
  "7YodIQWwNXSjAXxnTYG-yA": {
    "date": "11/13/2017",
    "text": "Stopped in for a drink and dinner.  Service was OK but a little disinterested.  My dinner of Medium Rate Short Ribs was very tasty but some of the meat was very tough and so ended up with so much grizzle that had to put it on the plate.  Not sure what happened but most of the meat was really subpar.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 14,
      "cool": 14
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "LBvBmOmn5WC7U5MgSj0EIQ": {
    "date": "3/7/2016",
    "text": "Came here for dinner with a large group last Tuesday night, and had the place to ourselves. Love the decor and the general vibe. Our waiter was really helpful in listing the vegetarian options for me (note: they also have an off-menu vegan option).  Cocktail selection is fun and interesting: I tried the white negroni, which was a nice twist, especially for a gin lover like me. They also do great classic cocktails - my second drink was a fantastic corpse reviver.  There were a few vegetarian starters, but I chose the miso poached apple since I love miso and it sounded interesting. The dish was beautifully presented, but fell a little flat for me. I didn't get any miso flavor coming through at all. I think perhaps a miso-cashew butter would have been better than just miso in the poaching liquid.  For my main course, I had the cabbage and taleggio ravioli, which were really nicely done. The combo of sauerkraut-esque cabbage with buttery taleggio was perfect for me. Definitely ends up on the sour side, which I personally like.  Station is a little pricey for me to come regularly, but I would come back for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "xSiaSnRfXBVZstO9LBNRaA"
  },
  "JeMJM96RROuFYVskEJjIvA": {
    "date": "9/22/2018",
    "text": "This restaurant is one of the best farm to table places I have ever been too and one to make point to dine at when in Pittsburgh.  Curtis, the chef and owner, has a wonderful sense and ability to pair foods that bring to life flavors you would not think possible.  We will be back every time we visit Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HVx5ErYc70XuHXp-NuLLMQ"
  },
  "8oSsfmyz64g80Srwagtseg": {
    "date": "12/31/2017",
    "text": "One of the best meals I've had in a long time. A lot of skill in the kitchen. I had a flank steak with fried cauliflower. The steak was amazing but the cauliflower was one of the best sides I've ever had in my life. Great ambiance, good music, friendly staff. Great place to go to celebrate something. Will be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dUozAkhg4-u06zwE29hUDw"
  },
  "gfViiMWb9XulBBCV1XkP7w": {
    "date": "4/2/2017",
    "text": "Meh. My meal was fine. I had the pheasant breast and sausage and the beet and plum salad. Perfectly agreeable. The portions are quite small. I sampled other dishes at the table. The chickpea fritters (need salt). The carrot salad (meh). The pork shank pasta (meat was almost minced). It's all fine, just not great. I give credit for creativity, but there just wasn't a ton of flavor in what should have been really rich dishes. I probably won't return because I think there's better places to spend $30 on an entree and be satisfied.   It's also very loud. I had a hard time hearing people at my table because the acoustics amplify ambient noise.   Not a great experience, but I did leave after eating everything on my plates. It just didn't take long.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6nOoTMZljIuuCEUuB-PINQ"
  },
  "ez-HQlvjZR_16GD3WwtxNA": {
    "date": "3/4/2016",
    "text": "Went there for the first time about a month ago.  Was floored when I walked into the space and saw the transformation of what was a rather typical Bloomfield bar into a really cool space.  Food was excellent.  I ordered a steak and my friend got the skate.  I liked my meal but loved hers.  We split an excellent dessert and left with happy bellies.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "viMEMVXQExcexc7ctpRdCA"
  },
  "FSmeAet3ciNtzlUikW2U8w": {
    "date": "5/11/2016",
    "text": "The fact that I live within walking distance from Station is a plus. The cocktail menu is outstanding and if there's a drink you want with an ingredient you aren't fond of, the mixologists will curtail it to your liking. Cameron is the guy to see when you're there. Never disappointed with my drinks or service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "TAtwM9G1kk2O2CZdqPrwvw": {
    "date": "1/28/2016",
    "text": "Very cool place. Like the space and layout. When you walk in the bar area is inviting and not hipster. Tables are great for people watching here.   Dining area on other side is quaint seating. Not a fan of the barstool chairs when trying to have a relaxing dinner. I can see if the restaurant wanted to turn table quickly as this is one way to do it. Very uncomfortable for dinner but they did have chair with backs at other tables. We had a large party of 5 and the other tables didn't accommodate more than 4.   Only had 2 dinners, others drank. Apps didn't strike our fancy. I'm gluten free and no butter, which a lot of the food had in it. But, I will say that the chef compensated butter for me on the Skate. Which is my favorite. So kudos. But portion for protein was a bit small. I'd say 4 Oz over the norm 6 to 8 oz..  Pork Tenderloin was a bit pink, but, not undercooked.  The dish wasn't plentiful, only 3 pieces of the pork, underweight for sure .    Drinks were great. We liked the infused drinks and drink menu. Some great red wines were on the menu that I haven't had, so score!   I will be back for more menu tastings.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "64k5BV2dDeyJuixBFT9qrg",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Skate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/64k5BV2dDeyJuixBFT9qrg/o.jpg"
      },
      {
        "img_id": "CMGWUY7FwXyY07wd0yaTdg",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Pork Tenderloin",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CMGWUY7FwXyY07wd0yaTdg/o.jpg"
      }
    ],
    "user_id": "mtrwciirsnKJGleYFfXYCQ"
  },
  "9Kd4bQUyl-J9iq5njlIDEw": {
    "date": "10/22/2015",
    "text": "I had a preview of Station at a Yelp event close to a year ago and let me tell you this: I have been DREAMING of that roasted carrot salad since. Thrilled to finally have dinner here.  Atmosphere. Understated and simple. Warm lighting and rustic mixed with industrial makes you just feel hip when you walk in.   Cocktails classic with a twist. I had their version of a Manhattan. Served up with quality ingredients in a Marie Antoinette glass, imbibing could be dangerous. So smooth!! This can also be served on ice. Next I ordered an Old Fashioned. Just as beautiful. Cocktails are a bit in the pricier side, but worth the quality.   I did not order the carrot salad. I know, I had been drooling in my dreams over it, but I was thwarted by the chicken liver mousse. Why, oh why?? I could have ordered all of the small plates. The mousse was divine. Beautifully smooth and ample in portion. I ate it all. ALL. Served with crusty oiled bread and pickled ramps. Friends had the carrot salad, wings confit and beef tongue. Nothing left on our plates.   Next dilemma....entree. I love that there are few items on the menu, but can you put on something I WON'T like? OMG. The struggle was real to decide. I opted with the Tagliatelle. Divine! Which came first? The pork or the egg? I don't care. Their marriage is one that should last forever. Tried a bite of the cod and the look of the burger was mouth watering, too. Pork belly...I'm coming for you!  Dessert. Yeah. I did it, so?!??! Popcorn Panna Cotta. It is a decadent and whimsical as it sounds. Sadly, if I could have got my head in that mason jar like a dog, I would have.   Will I be back to Station? (Don't tell anyone, but I'm camped out here now.)",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "7orw_PEDOH4oOsM1EeOBUA",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7orw_PEDOH4oOsM1EeOBUA/o.jpg"
      },
      {
        "img_id": "v-CM_i0gvFElEv0_8qwejA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Chicken liver mousse. A must.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v-CM_i0gvFElEv0_8qwejA/o.jpg"
      },
      {
        "img_id": "862zjfWIL3YPnO_K0sqIUg",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Poached cod.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/862zjfWIL3YPnO_K0sqIUg/o.jpg"
      }
    ],
    "user_id": "UBUV0ElEvm8kgxZvcdDo2Q"
  },
  "7WE42DMayzUQbyH7F60HJw": {
    "date": "8/14/2015",
    "text": "Happy bartender = happy drinks! Great food and hip crowd. I kept thinking ... Are we really in Pittsburgh? But yes. The heirloom tomato salad was great and the crispy chicken with savory Brad pudding were standouts. All the cocktails we tried were tasty. I'll be coming back.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Rfq4Td-AioYV-xCE93Zc0w",
        "caption": "Photo of Station - Pittsburgh, PA, United States. This bar has history",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Rfq4Td-AioYV-xCE93Zc0w/o.jpg"
      }
    ],
    "user_id": "s9m1lSJyedtZRJSuQBE5HA"
  },
  "cAuaz6TIdn5rwM5GT5HOYw": {
    "date": "9/28/2015",
    "text": "This restaurant is amazing!! We've only eaten here once, but will be back for date nights. It's the perfect spot- beautiful bar, casual laid back atmosphere, friendly staff and great music. Now let's talk about the food... It. Is. Incredible! My husband ordered the wings which he loved. I had the poached apple salad and highly recommend it! As a vegetarian, I end up eating the same sorts of things all the time- lots of veggies, lots of salads. It's rare for me to get to eat something so special with such an impressive combination of flavors. My gratitude to the chef :) If you go, you absolutely must try the lavender pound cake, but order one per person because you're not going to want to share it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QH4IdLdjX88xTNQVJJwtbA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Justin, one of the owners.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QH4IdLdjX88xTNQVJJwtbA/o.jpg"
      },
      {
        "img_id": "l1iVg8J26p4AglY8mr-D4w",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l1iVg8J26p4AglY8mr-D4w/o.jpg"
      },
      {
        "img_id": "UnqWWBnbPeH90ZZ73AkH3Q",
        "caption": "Photo of Station - Pittsburgh, PA, United States. The poached apple salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UnqWWBnbPeH90ZZ73AkH3Q/o.jpg"
      }
    ],
    "user_id": "56vDpX4eE9r8rzcNvLkmiA"
  },
  "QpPgY_n7z6_8SVDeNpOGSw": {
    "date": "12/11/2015",
    "text": "Going in I was expecting some good quality food and left having some of the best bites to eat in a while.  Makes we wish I visited Pittsburgh more often.      Nice beer selection with different varieties. Great to see its not the standard taps you see in every bar.   Beef tongue dish was probably the best thing I had in a while.   From start to finish it was perfect.   I could see myself stopping in for this and a beer and be happy.   Wings were great especially with the cheese foam  Pork tag dish was solid and a good comfort food dish to return to.   Had both deserts.   I could have the pana cota anytime, although enjoyed having something I would never order with the lavender pound cake.      Outside of the food and drinks, nice quiet crowd, great service and don't be afraid to ask for further details of how the dishes are made.   Makes it feel like an episode of top chef.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4aUsVMxHEilaQYn6EUF5Og"
  },
  "JG0OAiYC23CeVNsxymNv2w": {
    "date": "8/14/2015",
    "text": "My boyfriend and I have been waiting for Station to open for a few weeks now, and we're both blown away at the quality and the care put into the drinks and food here. We had the best duck liver mousse of our lives and the cocktails were to die for. The atmosphere is classy yet casual and perfect for a date night. We're relatively new to the neighborhood and we just might have finally found our go-to bar!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8iAnugDt7nn5ALFBwOEElw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. The zihuatanejo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8iAnugDt7nn5ALFBwOEElw/o.jpg"
      }
    ],
    "user_id": "t41CLyZ83iFM3m2YMBISSA"
  },
  "x2NFEsjvQb_fYgC-3BMl0g": {
    "date": "9/14/2015",
    "text": "I originally started with a three star opinion but I'm hopeful about this place enough for a bonus point. Three stars on a clearly popular and well done spot seems harsh.  But here's the deal.. A cocktail menu at a restaurant needs to have drinks I can sip on with my meal. I ended up ordering the Ruby Queen--beets and vodka, mostly--and I have no idea why I thought that would work out well.  It was super vinegary; I was not prepared for an entire rocks glass of that (although of course I still drank all of it eventually). The cocktail menu is rough on Station for me. Most of it is creative, but includes negroni, manhattan, things that shouldn't take up space on the six or seven option menu.. Especially when there are some expectations from Grit & Grace's super extensive (and delicious) list. Yikes.  I've been eating small basket tastings from Station for the past year at every local function and was always a fan. That has not changed, but I get less excited as the night goes on here. +1 and I spilt the heirloom tomato salad.  It was complete with the super acidic earthy vibe (AND ALL THE DILL!) I've had at each preview but with a pretty little presentation. It was enough to buffer as our food took a little extra time. My crispy chicken was good.. Cooked well. Tender. But I'm a gal for seasoning and wished I had some Trader Joe's 21 Salute on me. That's a little disappointing. Luckily, the lil' dirty bread pudding had enough flavor in a gooey little square for the whole plate. +1 had a burger that he was waaay too into. What else is new. The fries which I stole all of were great though (like, really really great).  I'm definitely coming back to the bar (one of my fav 'tenders is now here!) to give the menu another swing--I'm sure it changes often enough--but might give the food some time before trying again before taking another Gamble (get it, get it). I'm sure this is going to grow to a favorite.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cUq1UjPVSJxTZgVFe9raUA"
  },
  "GVjNcD2DKG3yIjmfACfH5A": {
    "date": "3/1/2016",
    "text": "I had the best meal that I've had in a long time here last night.  Pro-tip, ask the waiter what the more adventurous items on the menu are.  I almost got a rather basic dish but was encouraged to try more.  So glad I did!  My pork dish was a deconstruction on an old classic- perfectly cooked with a cannelloni that had some sort of mashed potato esque filling, and a molasses shatter on top that was reminiscent of applesauce just kicked up to 11.  The drinks were perfect!  Don't let the rather been-done decor or branding fool you, this place is legit.  Hoping someone sees this review and hires a better decorator and brand manager, the chef deserves better!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ojkyhBPZYbXNs7UF88qmvA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Pork with cannelloni and molasses shatter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ojkyhBPZYbXNs7UF88qmvA/o.jpg"
      }
    ],
    "user_id": "NEp4I34aj3FRbBxx23nj0w"
  },
  "y15139ueF64ckQJyKpCK5w": {
    "date": "9/4/2015",
    "text": "Station is a great addition to Bloomfield. Station is now in what used to be the old D'Amico's restaurant. The interior is just beautiful and there are two rooms-one when you first walk in and the second right next door through a hallway. We started with the heirloom tomato salad. The old bay seasoning in this salad was the perfect touch. The tomatoes and corn were so fresh. For drinks, I had the rodeo cowboy which reminded me of a negroni. Cocktails are around $10-which are about the same at most restaurants in the area. For dinner, that hangar steak was like butter! The potatoes and sauce that came with it were delicious too. My partner in crime had the chicken and he ate every last bit of it! So take that as a good sign!  For desert, we had the popcorn panna cotta. It was decent, but I wish I would have tried the lavender pound cake instead. We paid around $100 for two people with drinks, appetizer, two entrees and desert. I cannot wait to go back as I hear their menu will change with the seasons.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "HIXsLyrmCe1hfk5IhTSf8Q",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Heirloom tomato salad, simply outstanding!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HIXsLyrmCe1hfk5IhTSf8Q/o.jpg"
      },
      {
        "img_id": "fVKrXJksT9NIaNmmtj6vvg",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Rodeo Cowboy cocktail",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fVKrXJksT9NIaNmmtj6vvg/o.jpg"
      }
    ],
    "user_id": "D0_EDhZvO5z3UEPszmxiYg"
  },
  "OZLjYhz2G58AtmC98Naa7g": {
    "date": "10/22/2015",
    "text": "\"It's no Cracker Barrel,\" I said to my wife as she suggested we eat at the newest, soon to be hot spot simply because it's good and everyone will eventually know.  \"... And they may be so green that the staff isn't developed, and FOH personalities don't yet exist. Surely we should wait until they're established until we go there.\"  \"Don't call me Shirley!\" And she was right.   Her name isn't Shirley.   It was ok to eat here, even if today WAS my yearly lap completion day. I FORCED myself to try all four of the signature cocktails, mostly because they weren't just special, but I didn't have anybody sign ANYTHING, not even once on my visit.   Anyhow, the food was good, the service was nominal. And if you think I didn't love every minute of it, you need to reread this review over and over again until you understand sarcasm, or Citizen Kane, whichever comes first.   But seriously. Everything about this spot, right in my neighborhood, is fantastic. I genuinely believe that if you've found your way to these Yelp reviews, and you're not looking for bud light-well done naked burghers-house vodka red bulls-wine from a jug,   You'll like it here.  The beef tongue was unique. The poached apples w/pickled grapes, frisee, and cashews was fantastic. The chicken liver mousse was melt in your mouth good, if a little bit salty-a good thing. The pork tenderloin/pork belly was exactly what it should have been, the lentil salad paired perfectly, and I actually loved the carrots. Lastly the coutlotte, which of course we ordered rare knowing what the cut of meat is, was delicious. As someone who isn't a fan of cauliflower, I found the roasted version served with the meat amazingly delicious. Even though the wife and I drink our dessert, we ordered the lavender pound cake-what a well balanced dessert! As if it was crafted to have flavor profiles and not just attack a sweet tooth. If you want a boring sweet, buy a candy bar, this pound cake has me craving a return visit. Which I hear won't be the same since they exist in the rotational/seasonal availability world. Can't wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EnqdZHpshV1zNI5AFJFh3w",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Hidden tv&amp;#39;s. Love it!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EnqdZHpshV1zNI5AFJFh3w/o.jpg"
      },
      {
        "img_id": "9uX02gb297omBKvxIpMDDA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. They hide their tv&amp;#39;s. Love it!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9uX02gb297omBKvxIpMDDA/o.jpg"
      },
      {
        "img_id": "qcn9TFYFyJvC93HbQVwCqQ",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Great selection here... If you want to let the bartenders play...",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qcn9TFYFyJvC93HbQVwCqQ/o.jpg"
      }
    ],
    "user_id": "e2goTuVddLIT9Yz_6X6hCg"
  },
  "A-BHPk6ZvuXaxWRJ_zA6tg": {
    "date": "8/15/2015",
    "text": "Glad to be able try Station so soon after it opened. Met my wife and another couple for dinner.  In regards to the cocktails. Between the four of us 2e tried the Manhattan, the Negroni and a cocktail of bourbon, lemon and an ipa. The Negronis were top not. I enjoyed my Manhattan, though I do hope they expand their cocktail menu on our next visit.  For appetizers we shared the heirloom tomato salad and the wings. Highly recommend both. I really enjoyed the cream on the wings.  In regards to entrees we tried the pork belly and roasted pork, chicken with savory bread pudding, hanger steak, and pork shank with pasta. I would say all the meals were good but nothing amazing. We each liked parts of our meals but felt other parts were lacking. I had the pork belly and roasted pork. The pork belly and roasted carrots were great. I felt the roasted pork, while done properly, was a bit over salted.   None of us had room for dessert, but the couple next to us both said the popcorn and the loaf cake were very good (they both looked very tasty).  Highly recommended. Glad to have new type of restaurant in the Bloomfield area. Will definitely head back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rF-MrPztxHEm6KJe0JUJIQ"
  },
  "Z_V0XVv5vVqD08cAWeeL8A": {
    "date": "7/26/2016",
    "text": "First off, Station is like nothing that is around it in Bloomfield. As a resident I am THRILLED that it exists. I would go here every day if I could. I've gone for dinner, for drinks, for brunch,  I've taken friends, new and old, and convinced them that they HAVE to try the chicken wings, but if there's chicken on the menu, its most likely incredible. Brunch is the last thing I've tried here, and I had food envy of every single person at the table while I ate the best chicken brunch plate ever. Christian the bartender is a large part of the reason we kept going back (and sitting at the bar) - he really knows his stuff and makes great drinks. The very few times I've veered from the El Chapo, my favorite drink in existence here, he's led me to a great one.   Just reading through the reviews, I would say that some of the prices are a bit steep for dinner entrees, but we can still walk out after eating a burger, chicken wings and a round of drinks for about $50. The happy hour prices are lower.   I think its great to have a place in Bloomfield where we can walk in for just a casual quick drink, bring friends for a great dinner or head there for brunch on the weekends and I hope it stays around because I love walking to a place that has great quality food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "BX3GdsENMCCnWvK7QeTZhg"
  },
  "l14yNdhaFs8Zuzz7g0X59Q": {
    "date": "9/28/2016",
    "text": "This place is a solid B and a good addition to Bloomfield, however food is not anything to gush over. I had the agnolotti which was more or less four ravioli doused in breadcrumbs. While it's not that exciting, the burger and fries are a pretty solid choice that anyone would be satisfied with.  Craig, the Bartender, was great and made custom \"Craig's Special\" whiskey drinks that our table enjoyed. One recommendation would be to add more of a wine selection to the menu, it's one choice for each type of red/white and they weren't the greatest options.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PwcS4rk4jebq8an5B7t1nQ"
  },
  "UphlcCvp-UUFydz-gbPWGw": {
    "date": "11/26/2017",
    "text": "It's Saturday night of Thanksgiving weekend and you've got a group of 11 people for dinner...good luck, right? Well, Station hooked us up! We got the reservation, and then had 2 additions to our party, which they accommodated graciously when we called to update. Seated us right on time, maybe even a little early. Great service - attentive, friendly, timely, which isn't always the case with a large group. Food was spectacular. Some of the samplings we had that we all enjoyed: Crispy wings (so crispy and flavorful!), chicken liver mousse (the toasted sourdough was what made it for me), Roasted Octopus (just YUM!), Short Rib (tender & perfectly cooked), and the tagliatelle (perfection). Both desserts were delicious, but the popcorn panna cotta takes it to a whole other level. The only thing keeping me from 5 stars is that they were out of apparently every lettuce they had so no salads available. But hey, it was Saturday night of Thanksgiving weekend after all. I'll be back, no doubt!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ARj5-tNsDlyfnHrEGrkRiw"
  },
  "y0ihYISOoZ5jYHyyEfsNeA": {
    "date": "10/12/2016",
    "text": "I ate here last night with my partner and a friend. While the menu is very limited, the corn custard small plate and the angolotti large plate were excellent. The initial old fashioned that I ordered was so good that I needed a second one. My only misgiving was that the waiter reached over us to take the bill while we were still finishing our drinks. I have never been a waiter, but I feel that it's tacky to take a bill before the patrons leave.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pf7MN9-UyT8jdpaclF1QbA"
  },
  "Cr2GleJrTDtj_YSP-FWy3A": {
    "date": "6/7/2016",
    "text": "With NACL closed, this would be a close second of choice. Great flavors and great ambience. Came here late with friends one night for drinks and food. We ordered the wings, chicken liver mousse and carrots as starters. The wings were crispy on the outside and juicy on the inside, just the way I like them. Definitely come with friends and order the tagliatelle pasta, crispy skin chicken breast & leg, bavette steak, and agnolotti.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RaSq7WPbxH7Dm5yfVBAgYw"
  },
  "y8MS91b-EV-2ba49IJfuZw": {
    "date": "6/28/2016",
    "text": "I had the monk fish and my girlfriend had the \"off-menu\" vegan option, a pasta and vegetable dish. My dinner was great from the first bite to the last but the real standout was her dish. I always try what she gets when we go out to eat and this was one of the best vegan options I've had. It was great to taste that she got something that was just as good as what I got and not an afterthought.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "isoloLYzMwopi1ZlP2yOhQ"
  },
  "91Uh_wMQmYxB_fJC3mnJwQ": {
    "date": "10/29/2016",
    "text": "Great experience start to finish.  Interesting menu, great execution.  Enjoyed every bit of it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G1b22DpKfrjY7Z_XWYSKTA"
  },
  "NCux3rPdnv8ep2JhnpLZWw": {
    "date": "7/25/2016",
    "text": "I wish Yelp had 4.5 starts because that is what I would really give Station.    GF and I went for the first time on Friday night and it was wonderful.  It's a great space, and might even be good for larger groups with reservations.  The drink menu was creative and the cocktails we had were well above average.  The food was also very well done.    I also liked the atmosphere, I was in shorts and a polo and I did not feel under dressed, but you should show up in a tie and not feel out of place either.    There are some places that we've tried that are good, but we're not dying to go back to  (Avenue B, Spoon, Bakersfield, Eleven) but Station could become part of the regular rotation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "K71LbP52gxMjTSd_GDN5qQ"
  },
  "bI-b5vOraUORQNXBMH73mg": {
    "date": "3/19/2016",
    "text": "I've read all the reviews on here, after a friend made a reservation at Station for 5 of us. I started with a Friends & Foes cocktail - Rum, Amaro, Vanilla, Date, Pineapple & Lime. It was pleasantly fruity, not overly alcoholic by any means, and I liked the subtle nuances of the date and vanilla, though the Amaro was hard to detect. We started with a few small plates: the Roasted Carrot, Chicken Liver Mousse and Crispy Wings. The Carrots had a nice spice from the harissa, though $9 for maybe 1 carrot sliced and a few greens seems a bit much. The Mousse was quite good, especially with the buttery sourdough that accompanied it. The Wings were nice and crispy, and done just right - meaty and freshly cooked - but they could have used more flavor. I had the Station Burger, the only under $20 Large Plate, just because I was feeling burger. It came on a nicely textured brioche bun with perfectly crisped fries and a delicious onion jam. The huge onion ring on top was actually redundant, and just made the towering burger harder to eat. It was cooked exactly as I ordered, but the beef didn't have any distinct flavor, and I've had better burgers for half the price. Two others in my party had the Tagliatelle, which they both seemed to like, and the Crispy Skin Chicken, which I think was given a thumbs up. Everyone but me shared the Popcorn Panna Cotta and Lavender Pound Cake for dessert, so I can't talk to that, but they looked fine and I think both were polished off.  We sat in the main large dining room up against a corrugated metal wall, and it was VERY loud. Of course the guy with the obnoxiously loud creep-show laugh at the next table didn't help, but it wasn't just him, but his shrieks did stand out in the OVERLY LOUD space. I realized that I took to reading the lips of my friends to make out what they were saying.  The menu is limited and expensive, and nothing about it would make me want to go back. The food was adequate - no real wow factor for me.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "IOYbJgL67pkodqDGr1rIXg"
  },
  "lmzL7gsH5fVwPFJS-ywiHg": {
    "date": "11/22/2015",
    "text": "Love this bar! knowledgeable bar staff, great cocktails. I had the make-believe tea it was amazing. Definitely check this place out if your in Bloomfield. I only wish the kitchen was open later so I could try the food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2B0Wi1KEPgSxOueYvtTHQw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Such a quaint Bar!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2B0Wi1KEPgSxOueYvtTHQw/o.jpg"
      }
    ],
    "user_id": "SKZiaiUA3vFFLea0q9t5NQ"
  },
  "NIX9leFaLmk22aBfGH1DyA": {
    "date": "3/7/2016",
    "text": "Yes, everyone and their brother is blowing up Station with good reason- the food is fantastic.  However, the prices are absolutely absurd, especially for Pittsburgh.  Similarly situated restaurants who use equally local/organic ingredients charge half of what Station does.  Every dish is great, but be prepared to break the bank to eat here.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "20LFIXB7fEKPZaEJ443F2A"
  },
  "y21KfFebCsobjD-mLDJtZQ": {
    "date": "8/5/2017",
    "text": "I dined here with my family for my birthday earlier this year, and the dinner left us utterly delighted. This lovely restaurant is sort of divided into two sections, with a beautiful bar area and some seating on one side and a proper dining area on the other. Literally the only negative thing I can say about the space is that the chairs aren't the most comfortable ones I've ever sat in, but that wasn't a deal breaker by any means.  My family and I shared an array of appetizers and entrees, which included: chicken liver mousse, corned beef tongue, a salad, duck and bean ravioli, a crispy skin chicken dinner, and a sizzling steak. With a side of cocktails, of course. (Disclaimer: I believe Station's menu changes on a regular basis, so I can't promise that the items we ordered are still there.) And we were watched over by a very helpful and attentive waiter who did a great job answering everyone's questions and providing information as we narrowed down the entire menu - which all looked amazing! - into a handful of orders.  All of the items that we ordered were as amazing as they sounded. I knew the mousse was good due to a tasting event I had attended the year prior, although I also knew it was strong enough in flavor that I wouldn't want an entire serving of it to myself. I definitely recommend sharing this dish, at least during a first visit. Everything else that we ordered, I was trying for the first time.   The corned beef tongue surprised me the most, as it was far tastier than I expected. This dish was served with toast and toppings as well, so the overall combination of crunchy bread and tender meat was delightful. Between the liver mousse and the corned beef tongue, we were feeling pretty good and surprisingly filling up before our main courses arrived.  The main dinners were so tasty that we pretty much kept on going and stuffed ourselves on the delicious food. Just as memorable as the appetizers was the chicken dinner (that may not be available currently according to the website), which primarily featured melt-in-your-mouth, beautifully seasoned cuts of chicken. I personally had ordered the duck and bean ravioli, which were - for lack of a better word - unique. I haven't seen many other restaurants combine duck and beans, let alone serve them together inside a ravioli. The flavor profile of these ingredients was very tasty, though. A fresh salad and a tender steak were also brought to our table, and all four orders were shared and sampled by my very happy family.  If you're looking for a new place to try, I definitely recommend Station, which has some of the best dishes and greatest flavor profiles I've come across in the city so far. The fantastic food and lovely waitstaff in a charming atmosphere meant that everyone in my family had a wonderful night out for my birthday. Thanks for having us, Station - I hope I have a chance to eat here again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "O_LcgehliJW1THI38d19_g": {
    "date": "5/22/2019",
    "text": "Excellent. Went for Sunday brunch. The coffee is fantastic. I had the beet salad and the chicken frittata. I recommend. I would opt for no drink and a slightly lower price, I thought it was a little pricey but delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m9ZvC38SyVOL7theD3_rcA"
  },
  "ufE4-8RO6ub3ClnOw0MYFg": {
    "date": "12/31/2018",
    "text": "Decided to explore Pittsburgh on foot and walked from the CMU area back to our hotel in downtown.  Along the way we ducked into this bar.  The cocktails were well mixed, and they had an interesting selection of alcohol, including some more obscure brands.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5l5f3Kln_Vw3nsTajelHqQ"
  },
  "dfHEGIlBANXVj4szUqmBBA": {
    "date": "10/24/2018",
    "text": "Wow!  Great meal with attentive service.  I had the romain salad -- delicious with home made croutons.  A few too many for me but sooo tasty. For my entree I had the scallops with quinoa and grilled carrots.  Fantastic!  Scallops cooked to perfection.  Couldn't resist dessert so tried the caramel salted pana cotta.  Heaven in a dish!!!  I will definitely return when back in Pittsburgh.  Well worth the visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HhnbGScnM4RbL4d3qDNzEA"
  },
  "XdA8HQjc4l5QrF75UQ8T_g": {
    "date": "5/4/2019",
    "text": "Amazing! Loved the chicken liver mousse, scallops and popcorn dessert!  Drinks and service were great!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gUs-z6gyj05k6IUTQku2VQ"
  },
  "0naBW98bi_3VeyX0BlsOlQ": {
    "date": "3/28/2018",
    "text": "My wife and I had dinner here on a Saturday evening.  Reservations:  We made reservations for 7PM via Opentable.  As we approached 7, we realized that we were going to be late.  We called and the hostess was able to push our reservation back by 30 minutes.  She was incredibly pleasant and professional.  Arriving at the Restaurant:  This is going to sound nit-picky but the front door is a bit bizarre.  When you come through the door the hostess is immediately on the left, which promotes some congestion.  As we stood waiting, another couple came to the door.  Because the door opens inward, it was a bit awkward as we were blocking their entrance.  The dark paint and industrial feel is inviting, and there is a long bar is set-up on the left.  The bar seemed comfortable and the spirits are displayed nicely.  I noticed a nice selection of brown-liquor.  Waitress: Nice, pleasant, explained the menu items and cocktails well.  Cocktails:  Excellent.  I had the Oaxaca Manhattan which was made with mezcal, super good and the smoky flavor of the mezcal worked well with the drink.  My wife had the Maple Sazerac which was also very good.  I was afraid that it was going to be overly sweet, but not the case.   Appetizers:  One Excellent, One slightly missed the mark.   Carrot salad: The carrot salad was probably one of the best salads I've had in recent memory.  The carrots were cold but perfectly cooked (not too crunchy, not too soft) the greens were delicious, and the dressing was light but flavorful.  The star of the salad was the chick-pea (i think) fritter.  This was the only part of the salad that was warm, but it worked great with the dish.     Chicken Liver Mousse: We felt a bit let-down by this dish.  The mousse itself was a bit under-seasoned (this is perhaps nit-picking) but the real problem was with the way the mousse was served.  They provide you two large pieces of the most greasy toast you've ever eaten.  I'm no prude, if i ate that toast by itself i'd love it, but it was just too damn rich combining the mousse with the overly buttery toast.  The toast takes away from the mousse instead of letting it be the star.  Admittedly we ate most of the mousse (which was a very large portion - perhaps too much honestly) and had extra toast brought out, but it was just overwhelmingly rich and greasy with the toast.    Entrees: Excellent.  Roasted Octopus: I don't know why I worry about ordering octopus because every time i have it it turns out quite good.  The texture was tender, and the white bean puree was a nice sauce.  It was served with some bean fritters and kale greens that were flavorful and soft - likely cooked for a while.  I'd order this again.  Tagliatelle: My wife ordered this and only shared with me a small bite but it was quite good.  The pasta was likely fresh-made and the sauce / pork was super tasty.  The dish was fairly rich with a soft egg, and parmesean cheese.  The pasta grabbed the sauce and pork perfectly.  Very good - wish she had shared more.  We did not have dessert.  Conclusion: This is a good restaurant worthy of a try.  The value for money felt right to me, and aside the toast with the mousse, i can't honestly fault any of the food.  The cocktails were top-notch and the service was very good.  My only concern was that we went on a Saturday night where the weather was nice and yet the restaurant wasn't full - didn't even feel that busy between 7:30 - 8:30.  The bar was mostly empty when we left as-well.   Hopefully it was just a slow night relatively speaking.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EUUakxIivp59DEu7EYBZ_w"
  },
  "_ZsFxu9lyzg_FzvAVm6qZw": {
    "date": "3/11/2018",
    "text": "I hade such a great experience here for dinner! My friend and I had our first girls night out in like a month and Station was our starting point. Our server made the experience so much better. I believe his name was Nick and he walked us through the menu and told us in detail about the food we decided to order, he even helped my friend branch out and try something she normally would not and it was great. She loved it, the entire experience was amazing and he even helped us find a place to go to after to have drinks and make memories and the rest of our night was just outstanding because of that. I could not speak more highly of him and his service. Our experience at station was one that led to other great memories and we won't forget.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x1uDasG6j78BAwKUGVkNsw",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/x1uDasG6j78BAwKUGVkNsw/o.jpg"
      }
    ],
    "user_id": "lopO7LlKU5Pkc29-xVfKDA"
  },
  "FI9GlmoqE4hlNhPtiOF0bg": {
    "date": "8/3/2018",
    "text": "Been here for happy hour and dinner many times, but as of recent we had our rehearsal dinner here since our ceremony was up the street.  We had about 50 guests and were able to rent out the entire restaurant with an open bar. There was more than enough room to eat and mingle, amazing cocktails and beer selection, appetizers were incredibly delicious (best wings I've ever had in my life), fried gnocchi, and everyone was extremely pleased with their main meal (steak, scallops).  The staff was very friendly and professional and did a great job accommodating such a large party, they even let us do a tasting a month before the rehearsal dinner which was so nice.  This is by far one of our favorite spots in Bloomfield.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DnHvPuQZ5Nb9s3mN-sVneg"
  },
  "mEsNJ4tPC1c1AqJEhhrJFg": {
    "date": "3/20/2019",
    "text": "Absolutely delicious restaurant. The chicken wings are to die for and probably the best wings in the city of Pittsburgh as well as the chicken liver mousse which is also on point. It's a great spot for a good little date. The scallops were also delicious and the steak I had was just as good. The only downfall and the only reason why it's not 5 stars in my book is the price point. After tip for 2 people it was $205. Yes we did have a few drinks but when you think of other restaurants that are just as good, you're not spending $205 for a random Tuesday night dinner date. Other than the price, worth it! Phenomenal food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W_RA_Jr0Aabu9fTyuEBjUA"
  },
  "_0BDTgNoDYB7e3ESt7mYng": {
    "date": "3/13/2016",
    "text": "So far, I have eaten here twice and came in for drinks one other time. I have to admit I've only had one entree because I am absolutely obsessed with it.  But first, the ambiance: very trendy without being overly pretentious. I love that. You walk in and you know it's a cool place but Bloomfield is filled with and array of people and this place has that.   The service: every time I've been here our servers were awesome and helpful and knowledgeable.   The food: the most important part! I will say I think it's a little pricey. Which is probably why I won't give 5 stars. I don't really expect $25-$30 entrees in a place like this, but the majority are. But not the station burger ($16). This is seriously one of the best burgers I've had. They cook it to perfection every time. Lately I've been to a lot of places that don't understand what MEDIUM means and it's always over cooked. But both times here it's been perfect. From the Asiago fondue topping to the jam, it's seriously incredible.  This time we also has the roasted carrots and the Chicken liver mousse. I absolutely recommend the chicken liver mousse. I've never had chicken liver before so I was just going out on a limb but it was awesome!   Its definitely a good date place or a good gathering place for friends. Check it out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4JBRr10ARQYXhJRGS5Yi2Q",
        "caption": "Photo of Station - Pittsburgh, PA, United States. The station burger. Check out that jam and Asiago fondue! Amazing!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4JBRr10ARQYXhJRGS5Yi2Q/o.jpg"
      },
      {
        "img_id": "Ey0tfXT_uyCjmZFwoR5h3w",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Roasted carrots (good but probably wouldn&amp;#39;t try again)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ey0tfXT_uyCjmZFwoR5h3w/o.jpg"
      },
      {
        "img_id": "ng9B0OEKmQVXLGkBKhl4dw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Chicken liver mousse (incredible)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ng9B0OEKmQVXLGkBKhl4dw/o.jpg"
      }
    ],
    "user_id": "tJiWkQtxSmr4UdfEp-EYHA"
  },
  "4bXTqsAgS5iswf1FJIdqpA": {
    "date": "1/21/2018",
    "text": "I went to Station with a few girlfriends for restaurant week and we were all incredibly impressed with the value of the $35 appetizer, entree, and dessert deal. Optional wine pairing for $20 was also priced right. I got the roasted carrot appetizer and loved the chickpea fritters. I was able to steal a few bites of a friend's chicken liver mousse and absolutely loved the richness of the dish. For my entree I had the olive oil poached salmon which was perfectly cooked, and again stole a few bites of a friends entree- the risotto which I loved just as much. When I go back I will definitely be getting the risotto as my entree. For dessert I ordered the special which was a chocolate peanut butter flourless cake. It was tasty, nothing special but well made. Overall I was very impressed with the menu and can't wait to return to this Bloomfield gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iE3qiY9gdCDO21Ko5k2DJA"
  },
  "1ua55hqPt4zXtK5l13uBEQ": {
    "date": "9/21/2015",
    "text": "This place is really like nothing Bloomfield has ever seen before, yet they really make you feel comfortable with a casual vibe, just like Bloomfield itself! The bar is beautiful and the drinks are a work of art, thanks to the master behind the bar. If you don't get a cocktail here, you're really missing out. The most inventive one I've seen is the Ruby Queen, beet juice at it's best, spiked! And my favorite so far, the Manhattan.   It's really all about the seasonal produce and interesting ingredients to give a dish personality and flavor. The first time I came here I ordered the heirloom total salad, which was every bit as good as I'd hoped it would be, with some playful twists. The golden tomatoes dill and sweet corn mixed brilliantly together. And the fermented cherry tomatoes were such a great and unexpected element of an already awesome salad.   For an entree I ordered the crispy chicken breast and leg. I NEVER order chicken in a restaurant because it always ends up dry, but I seriously trust that Chef Curtis will whip up something incredible here. I was not disappointed in the least. It was tender chicken, lightly breaded and not over-coated by any means. The bread portion came in the form of dirty bread pudding with a corn puree that I wanted to lick off my plate.  The second time again I ordered the Butter Poached Walleye. Every single item in this dish was drool-worthy. the walleye was excellent, the green beans and fingerling potatoes were a great accent but the saffron dumplings were the icing on this cake (don't even get me started on their popcorn panna cotta...soooo good!!!).   I've actually only eaten in the bar area so far. First night was PACKED and admittedly a little too loud (am I old??). But my second time I hesitantly sat in the bar area again and the noise level was totally fine. I could hear everything my friends were saying... unless I was too busy stuffing my face.  I can't wait to keep coming back and seeing what rotates on the menu seasonally. I imagine each time will be just as good as the last, if not better! Get ye to Station, stat!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 15,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "HHvymKapMiGqB8ePZz62ow",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Crispy Chicken Skin Breast &amp;amp; Leg",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HHvymKapMiGqB8ePZz62ow/o.jpg"
      },
      {
        "img_id": "Cjy8VcpUUyapV-nOqACDiQ",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Heirloom Tomato Salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Cjy8VcpUUyapV-nOqACDiQ/o.jpg"
      }
    ],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "2g4irvbzMYex2ZSGTFC2SA": {
    "date": "3/30/2017",
    "text": "Our visit to Station was nothing to write home about.  Honestly - I was disappointed.  We had reservations - but they definitely were not needed.  We were the only people in the dining room till we were almost finished.  My friend and I try new restaurants once a month - so this month was her pick of Station.  We always each get an appetizer and Entree then share - especially the appetizer.  My friend got the Chicken Liver Mousse and I got the Crispy Wings.  My friend loved her Mousse - it was quite good.  However, the Crispy Wings were more like soggy wings.  There was so much grease and oil that they were sitting in - the only wing of the 4 that was crispy was the one sitting on top not laying in the grease.  I know their is olive oil and chili listed with the wings - what the wings were sitting in was not olive oil.  It was pure grease.  As if they didn't drain long enough after being fried.  My Friend asked our waiter out of 3 items on the menu - which he recommended.  He wouldn't recommend any.  Because we have different taste buds.  WHAT?!  Any restaurant  - ANY - I have been to and said - the 3 of these sound great - which one would you recommend - they always have a recommendation.  ALWAYS.  Even if they recommend the most expensive option - it doesn't matter.  You know your menu and have recommendations!  Maybe it was a fluke on a not so busy night.  Maybe it wasn't.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WPI0YGOSA13eZ5eThfMFkQ"
  },
  "Tso_w6DhGo0Cil_XxNSgyg": {
    "date": "2/22/2017",
    "text": "Yay!!! A Bloomfield restaurant that doesn't make you want to cut your tongue out.   Since Stagioni left, the fine'ish dinning scene has staggered in Bloomfield...but not no mo.  Station has great staff and ambiance that has a real rust belt feel, that's less rusty.  Looking at the menu, and the space, I felt they might hand me a bow and arrow to eat with.   We had the Venison, the crispy wings, beef tongue toast and burger.   Wow, the venison was clean and the flavors and textures gel'd...it was amazing. So was the beef tongue toast, what a flavor, and again, textures that made you just keep coming back.  The wings where solid and 'crispy' was no joke. A brilliant plate.  The burger has issues. A bit dry. A bit bland. The cheese did not work.  The staff was on point, and the bar had serious cocktails and beers.  Can't wait to go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jLjRhLdNUWcZP3_4v-Egkw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. The beef tongue toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jLjRhLdNUWcZP3_4v-Egkw/o.jpg"
      }
    ],
    "user_id": "4ojeUId0geFF9uo7rTSFSA"
  },
  "fLRuEEyGGlau8_Ha5lEOig": {
    "date": "8/6/2015",
    "text": "Despite consistent Bloomfield efforts to Keep Pittsburgh Shitty, Station enters the neighborhood as the restaurant that no one wants, but everyone needs. As a resident of the area, I'll admit that I wasn't totally sold when I heard about Chef Curtis Gamble's classy casual yuppie hip dining joint injected in the heart of Bloomfield. After only being open for a week, though, the warm hospitality and enthusiastic attitudes of the restaurant are already spreading the great reputation that it deserves.  The owners are committed, friendly, and eager to meet their new neighborhood. The service was perfect--not too obtrusive, not too serious, and never neglecting (even in a nearly packed house). The drinks were refreshing, and the food was spectacular.  The tagliatelle is handmade using the pasta maker left over from whatever old Italian joint was in the space decades ago. The heirloom tomato salad features fresh dill and an Old Bay mustard. The chicken is perfectly crisped and complemented with bread pudding and grilled lettuce.  And the space rules. Relax at the bar with a cocktail, walk in for a nice meal near the bar, or make a reservation in the dining room for a more intimate atmosphere. I hope Station sticks around the area, mostly because it's nice to be able to walk to a fine-dining restaurant for a meal and cocktails without worrying about how I'm going to crawl home.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 11,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Ofder3y6ayIBXGzbsseDMA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Tagliatelle with meat, one hour egg (be still my sous vide heart), sofritto",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ofder3y6ayIBXGzbsseDMA/o.jpg"
      },
      {
        "img_id": "YnMIpZhBD6BdTiBn8ylryg",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Chicken leg + breast, grilled lettuce, bread pudding, minimal lighting that hardly does the dish justice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YnMIpZhBD6BdTiBn8ylryg/o.jpg"
      },
      {
        "img_id": "dHqfj9YNcBwyMLWP5TZ_Ew",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Heirloom tomato salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dHqfj9YNcBwyMLWP5TZ_Ew/o.jpg"
      }
    ],
    "user_id": "xhVlmdU1sPVH6GBJw6AZtQ"
  },
  "ZhrFSi1scrBinHm9o35i7A": {
    "date": "10/12/2015",
    "text": "Sad to say I was disappointed. Station has a wonderful interior, but unfortunately the food is not as good.  The three of us shared the corned beef tongue for our appetizer. This was good/not bad, just too much salt. For my entree, I ordered the pork tenderloin & pork belly. Not a good choice. The pork tenderloin tasted like plain supermarket ham and the one piece of pork belly I got had way too much fat in it that I practically swallowed half a mouthful of liquid fat. I struggled to eat even one piece of the \"pork tenderloin\" and could not finish the rest. I also found the whole dish pretty salty.  Although two out of three of us found a number of problems with our entree, we still took a leap of faith and ordered the lavender pound cake for dessert. It was weird. It had a bunch of clashing flavors--sweet, salty (actually, friend bit into a chunk of salt with the first bite she took...and was not happy), lemony--that I thought just didn't work well together.   I was disappointed by the taste and quality of the food here, but the presentation of the food and beautiful ambiance bring the rating up a bit.   Taste | 2 Atmosphere | 4 Presentation | 4 Service | 3.5 OVERALL | 3",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "m3T0L_tdCG3-noZHXWEstw",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m3T0L_tdCG3-noZHXWEstw/o.jpg"
      },
      {
        "img_id": "FOM-UQSUm4lXQJi6xncznw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. lavender pound cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FOM-UQSUm4lXQJi6xncznw/o.jpg"
      },
      {
        "img_id": "JRfs-6GiX7HWGav4KHdWAQ",
        "caption": "Photo of Station - Pittsburgh, PA, United States. hanger steak",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JRfs-6GiX7HWGav4KHdWAQ/o.jpg"
      }
    ],
    "user_id": "HC5zLdut4caN1VPqxqRsMw"
  },
  "WENz00i6zJMz8CWzihDf_w": {
    "date": "11/18/2016",
    "text": "There is definitely a buzz in the air. The first thing that caught my eye was the corners beef tongue. Then the burger and the steak. We got them all along with the tagliatelle and dill pasta. Good.... interesting...not knock-my-socks off. We all thought everything was heavy on the seasoning.  The wait staff are all great; friendly, knowledgeable and fun.  The seats are hurting my butt!!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BJUY0UadA-STNQfNGnpTjg"
  },
  "M5OA2kuwjrNWamiNLKwqkw": {
    "date": "2/28/2018",
    "text": "It was a beautiful day and we needed to kill some time while we were having some work done on our Mini at the Mini dealer so we decided to take a walk and find some lunch. We ended up here at Station. What a great place!  I loved the decor-a mix of old and new. They have 7 beers on tap as well as a full bar. The menu was small but it all looked good. I chose the Station burger. It had an onion jam, an onion ring, and Asiago fondue. My curiosity was peaked by the term fondue. How do you get cheese fondue on a burger??  When I bit into it I found out. The onion ring is what holds the fondue on the burger. It's a thick cut onion ring so it holds a lot of cheese. So as your eating the burger the Asiago cheese fondue spreads itself to keep the burger covered. The burger was the perfect size-not huge and overwhelming but enough to fill you up. The burger came with fries that were seasoned with garlic, parsley and truffle oil. (I don't know that for sure but it's my guess). They are finger licking delicious.  Great food, great service, and a great environment m. I'll definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 9
    },
    "photos": [],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "VV1ZCvksAVG8uG8pThBSXQ": {
    "date": "12/27/2018",
    "text": "Overpriced food that was not in any way worth the money. Felt like we were being judged by their staff.  Won't return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGAzg3eD07AKbQLX_psfbQ"
  },
  "wfM_598DYwGvxcd0K7qL4w": {
    "date": "2/16/2017",
    "text": "Thank you  so much to this place dishes was ridiculously great  me and my wife had  \"crispy chicken wings\"  \"Chicken Liver\" Mushroom pasta\" and of course desert \"chocolate mousse \" amazing experience with Station  definitely will be back!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sc7XR93HpoIo80Z0UnoHvA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. chocolate mousse",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sc7XR93HpoIo80Z0UnoHvA/o.jpg"
      },
      {
        "img_id": "2ZpG6rZjgIHSPj-w9kB7ug",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Chicken Liver Mousse",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2ZpG6rZjgIHSPj-w9kB7ug/o.jpg"
      },
      {
        "img_id": "0AHvnvpcbIppZ_reQmdRKA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Crispy Crispy Fried Chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0AHvnvpcbIppZ_reQmdRKA/o.jpg"
      }
    ],
    "user_id": "TvVbOGdF4V0RqcKc1dVXCQ"
  },
  "Z4_ARF0ffO8e9dhGSukkKw": {
    "date": "9/12/2015",
    "text": "Best meal I have had in a long time! The unique blend of flavors, paired with a talented staff, made this my new fav restaurant",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rhhOoW5y8zTtMuyTqYCUwg"
  },
  "TDVS0XFxx5TLu_8vwDJDzA": {
    "date": "8/16/2015",
    "text": "Although it's only been open a few weeks, Station already competes with the best contemporary restaurants in Pittsburgh (on a par with Cure and ahead of most others).  Curtis Gamble's food is creative, well executed and absolutely delicious -- the roasted carrot salad with chickpea fritters, chicken liver mousse and caramel popcorn panna cotta are easily among the best dishes we've had in Pittsburgh in the past couple of years.  The front of the house -- stocked with veterans from other top 'Burgh eateries -- is polished and welcoming.  The bar program is among the most creative in town -- a particular favorite is the Ruby Queen, with tarragon-infused vodka and beet juice; it's herbal, sweet, earthy, funky and terrific.  Station is a nice departure from the usual \"red sauce\" Bloomfield dining scene.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-RTNuWydhfx9-vS2i4XWLQ"
  },
  "3kZW0ab7GzQa-EH-Q9WAOA": {
    "date": "1/18/2019",
    "text": "Had an amazing experience here. The roasted carrot salad was to die for, as was the pork loin/belly. The food was absolutely beautiful and tasted even better than it looked. Every bite was exciting and made in a way that I couldn't tell you exactly what was in it, it was just a new thing on its own for me to taste. I kept thinking I don't know what this is but it's amazing whatever it is. I wanted to lick every plate.  It seems like an awful lot of care goes into the food.  My boyfriend got the tagliatelle- we both agreed it was maybe a safe order, good but not interesting.   The service was also super great. Very knowledgeable staff with the right recommendations (very appreciated).    The cocktails were also out of this world. Complex but not in an overbearing way.  Truly interesting to drink and the whole was more than just the sum of the parts.  Every sip was an experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eGE3RhuEqTdLp9y7IdtFbQ",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Tagliatelle",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eGE3RhuEqTdLp9y7IdtFbQ/o.jpg"
      },
      {
        "img_id": "B3v-UayvZgnT38lhP0632w",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Pork loin/belly with hazelnut gnocchi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B3v-UayvZgnT38lhP0632w/o.jpg"
      }
    ],
    "user_id": "3pEz4WL31d7k31GTu3_7MQ"
  },
  "2oFPmUzJjB2uTV9iwX99mQ": {
    "date": "2/15/2019",
    "text": "This place has one of the best chicken liver mousses in the states, definitely order this with extra bread because you're gonna want to eat all of it. We ordered two noodle dishes as well, a vegetarian carrot bolognese pasta and tagliatelle, both flavors were great. The carrot bolognese was an impressive dish, very tasteful and able to capture the essence of bolognese without any meat.   However, the reason I'm giving it a three star is because the pasta for both our dishes were undercooked. This is not a tough task to execute, so at a restaurant where everything else meets expectations, this was a large disappointment.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aKdzUFPZeV9UGNiPCsecsg"
  },
  "n1lnfHKe4gUq3He-kPPURQ": {
    "date": "11/2/2018",
    "text": "Over rated, service isn't great. Not a good happy hour spot. Much better options around the area. The food menu has barely changed since they opened. We enjoyed it when station was new but the standard of service seems to have gone down a bit and nothing exciting happens with their menu.  Also crazy overpriced for some dishes.  We would usually get the liver moose ... but the huge amount of moose compared to the 2 pieces of bread you get, is unrealistic and makes it hard to share or hard to finish. And if you ask for more bread THEY CHARGE YOU FOR 2 MORE pieces ... horrible portioning.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wwRWW7j_zg3raVGKwh2G9g"
  },
  "iUSM61O2-A14pVA2JJD8qg": {
    "date": "7/24/2019",
    "text": "Absolutely delicious. Tried the tasting menu with chicken mousse, pan seared scallops and panacotta. Highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "piqAfqrnk6yst-SneSzejg"
  },
  "XyMTesOEzRK6ADlePfwR1A": {
    "date": "5/5/2019",
    "text": "Station seems to fly under the radar, but you should know that Chef Curtis Gamble and his team put out some really good, creative food.  Active bar with hi-tops on the right side of the house with dining room on the left.  The local grains salad was delicious.  Crispy chicken wings really well done.  Excellent beef tartare.  Unique chilled charred green tomato and cucumber soup.  The tagliatelle with smoked pork shank can compete with any hi-end Italian joint.  A new addition to the menu, roasted veal breast & crisp sweet breads, was a hit. Lavender pound cake with coconut and pineapple was a nice ending to a delicious meal. The price point provides great value for local ingredients and quality preparation.  Service is efficient and friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jlWYqr9IGLQrSRowtsKf4g"
  },
  "5YDDixNoDQz1q3njXWVMEw": {
    "date": "9/28/2018",
    "text": "We were walking around killing time before dinner plans when we stumbled upon Station. It seemed really cool from the outside with the wooden exterior, outside seating, and plant boxes. It's a beautiful space inside with a long, wooden bar and some booth seating. We were immediately approached by the bartender who couldn't have been nicer. They have great happy hour drink deals so I got an aperol spritz and my friend got a glass of the rose (both pictured). We decided to sit outside and enjoy the sun, and we were promptly brought both our drinks and a caraffe of water. Mine even came with a metal straw to deter pollution, so a major plus for Station!!  The spritz is really delicious. I lived for a year in Padova, Italy, which is the birthplace of the aperol spritz, and I can honestly say that Station has done a good job of getting the right balance of prosecco and aperol! It's completely refreshing and even has an orange peel for that extra burst of flavor.  The food menu also looks delicious. The \"small plates\" menu is pictured, and I'm personally looking forward to coming back for the eggplant caponata!  A high recommend, I'll certainly come back next time I'm in the burgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CV_Qfr6RuX4gfDt6tUvlXw",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CV_Qfr6RuX4gfDt6tUvlXw/o.jpg"
      },
      {
        "img_id": "gYhCXhCGcxlOqnFapF869Q",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gYhCXhCGcxlOqnFapF869Q/o.jpg"
      },
      {
        "img_id": "E_Bj_uirihEbxe2535XsSg",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E_Bj_uirihEbxe2535XsSg/o.jpg"
      }
    ],
    "user_id": "5Vmz8Q_EcMA3btZt6RoAOw"
  },
  "Vyj4plWglF4lT2fvQ2H_qg": {
    "date": "7/5/2018",
    "text": "You know the food was damn good when you can't stop thinking about it days later!   I had heard very positive rumblings in the Pittsburgh vegan community about Station's vegan Sloppy Joe, and already experiencing their stellar cocktail offerings, I knew it would be a great place to enjoy my birthday dinner. In addition to the Sloppy Joe, my husband and I also enjoyed the Carrot Bolognese.   Both items were SO delicious! The Sloppy Joe was perfectly seasoned and served with Potato-Patch-esque french fries. The Carrot Bolognese was \"meaty\" - even though of course no meat was involved! My Corpse Reviver #2 cocktail was a refreshing choice to wash it all down with.  My only (so small) gripe are the choice of seats in the dining room. I noticed when making my online reservation you can choose a high-top table in the bar instead of the wooden seats in the dining room - I will do that next time and I'm sure my back will leave just as happy as my stomach!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "Gv7Cmnkyv2v8kTMD8clMww"
  },
  "0faIYXy6k9jGO9YoDV3LvA": {
    "date": "2/12/2018",
    "text": "Great place for candle lit dinners in the Bloomfield neck of the woods of Pittsburgh.   We started off with an old fashioned, which was absolutely amazing. The Dark and Stormy, on the other hand, tasted a bit more like flat ginger ale with lime juice.  Actually, my girlfriend started out with the Dark and Stormy and didn't like it/finish it and got the Old Fashioned. It had potential, but I would go with the Old Fashioned.  The chicken liver mousse was very delicious. It was a cream cheese consistency and was garnished with something that was crunchy, crisp, and sour (sunchokes?). It had such a smooth texture and just melts in your mouth. This is no ordinary \"pate\" which look like gritty cat food pate. This is definitely a must have here if you like pate.  I didn't have the salad, but my girlfriend and her boyfriend got  the roasted carrots salad and local greens salad and ate then clean so... I presume it was good. The local greens looked very fresh and the greens in the bowl had a lot of volume to it (ie greens were not wilted). I'm not much of a veggie kinda gal.  We all got the hanger steak which was very flavorful, but it was pretty chewy but that tends to be how hanger steaks are I suppose.  I still highly recommend it.  The Popcorn Panna Cotta was surprisingly delicious. I mean, I knew it would be good just not my thing since I don't have much of a sweet tooth for desserts in general but I was wrong. The panna cotta was server in a small mason jar and topped with caramel popcorn. It was very very good. Just imagine a delicious creamy custard topped with crunchy caramel popcorn.  The lavender pound cake was pretty good, but I'd prefer the former. I didn't really taste the coconut pudding... it was two thick cuts of pound cake topped with some diced caramelized pineapples. Maybe the pudding was baked in to the cake? But I couldn't taste the coconut. The lavender was very subtle. It is very dense and moist cake, so this may have your name on it if you like pound cake, but I have also had dried out pound cake.  For four people, the Panna Cotta got devoured, whereas there was still 25% if the cake left that we didn't want which I ate anyways just to get rid of.  Wrapping up : Old Fashioned, Chicken Liver Mousse, Grilled Hanger Steak, and Popcorn Panna Cotta would be the course I'd recommend.  In fact, I'd just get two Panna Cottas instead of one of each like we did.  My girlfriend also said the salmon was very good, but she prefers the hanger steak if this nugget of information may help.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KDw1B6VZ-c0cSobzgRx06A"
  },
  "uxm3SIAit4DOw3oB_wWFfg": {
    "date": "2/15/2017",
    "text": "Happy birthday to my friend and happy first time coming here for me. I loooovved what I tried and what I ordered. I thought that the ambiance and the service were really good. We had a huge party, over ten, so the fact that nothing was wrong with the bill and we all got everything we ordered correctly, that to me is a win. I didn't like that they wouldn't do separate checks, but that was the only issue I could really say.  Small Plates: ROASTED CARROT: FRESH CHEESE, HARISSA, POMEGRANATE CURD, CHICKPEA FRITTER, WATERCRESS. I loved this dish. This was amazing. The chickpea fritters. Can I get the recipe? They were the best thing that I have tasted in a really long time. I was really surprised and impressed. The entire dish came together so well. I really was impressed. The roasted carrots were different colors and sizes and really made the dish pop. Just really really well put together. For a small plate, I felt fuller than I expected. I mean, could I have eaten more, of course, do you know me? But for the small plate I was full. I would get this again. It was a really great treat, surprisingly.  Bar Menu: VEGAN SLOPPY JOE: VEGAN KAISER ROLL, FRENCH FRIES. I just got a bite of this from one of my friends. I thought it was really good. Usually vegan food that tries to be meat creeps me out. I mean, why try to be meat when you are not meat. This bite had a nice full flavor and didn't taste like weird styrofoam. I liked it. If you are not a meat eater, this was a nice menu choice. The fries, they were also super crispy. I love me some super crispy fries and it came with a side of this garlic buttery dip. That was awwweeesome. It was not salty but just really full of garlic flavor. YYYUUUMM.  Dessert: POPCORN PANNA COTTA: CARAMEL CORN, SALTED CARAMEL. Just order this. It was awesome. YUMMMY. The panna cotta was just amazing. But the caramel corn, made it just so much more interesting. I loved it. I basically ate the entire thing myself. (Sorry birthday people).  I am going to look forward to my next visit to Station. I want to try more of their menu and some of their drinks. I hope I can go again sometime soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "AozAD9fhV_dADj3FytWIfg",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AozAD9fhV_dADj3FytWIfg/o.jpg"
      },
      {
        "img_id": "POVJn2SEYFePRqgpNIeGlA",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/POVJn2SEYFePRqgpNIeGlA/o.jpg"
      },
      {
        "img_id": "Okm_iNFuKDFikVFxQgJLtg",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Okm_iNFuKDFikVFxQgJLtg/o.jpg"
      }
    ],
    "user_id": "-hietrA8M58asfpyJkCyiA"
  },
  "D_u37XJ1cpSolnjFg_omlg": {
    "date": "2/6/2018",
    "text": "Love love love Station, and I feel this restaurant definitely flies under the radar. Perfect spot for date night dinner & drinks, dining with a large group, or just to pop in for a late night meal or beverage. The kitchen menu is always changing and they source local, in-season ingredients, keeping things interesting. They have both a full blown menu for normal business hours, as well as a smaller bar menu for late night. They always have at least one vegetarian/vegan-friendly option on both the main menu and bar menu. I am always impressed with their menu items, serving up some really unique combinations. Cocktails are to-die for as well! I've never had a bad meal here. The vegan sloppy joe and their crispy fries might be one of the best meals in the burgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OVKjT1uooWM0p-G8_f0xQA",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OVKjT1uooWM0p-G8_f0xQA/o.jpg"
      },
      {
        "img_id": "NfZCH6Cc5Dcj3QcJy77gxA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Vegan sloppy joe with fries. Sooooo delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NfZCH6Cc5Dcj3QcJy77gxA/o.jpg"
      },
      {
        "img_id": "1LaV5wwumpN7okWJaSyrkw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Roasted carrot, fresh cheese, Harissa, pomegranate curd, chickpea fritter, watercress. $9. This is amazing!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1LaV5wwumpN7okWJaSyrkw/o.jpg"
      }
    ],
    "user_id": "HdEM0xeldw4QAweECyOwcQ"
  },
  "_rXkGGltLnIz87pDseJDTQ": {
    "date": "5/23/2019",
    "text": "Looks like it would be a great bar for after work drinks...but should have been forewarned when completely empty when we arrived for late lunch. The bartender was doing double duty - unfortunately they were out of two of the five beers listed on menu. The food was decent- not great- not bad....but definitely over priced for what we ordered! The lavender pound cake had nothing had not a hint of lavender ...they could have at least \"colored it purple\" so we could pretend it wasn't just plain over priced pound cake. We had to track our server down to get the bill- he wasn't behind bar...I assume doing something in back area. All in all not too great.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EjpstyRLRhPsZ1lQpBQwqw"
  },
  "ep653M5_gvDIF4yMgI5Bcw": {
    "date": "9/28/2018",
    "text": "Just stopped at Station for happy hour before dinner. Drinks are delicious and affordable, service is WONDERFUL and the decor is industrial and stylish, definitely paying homage to Pittsburgh history. And the outdoor seating is a huge bonus. Will surely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j-U_vZbxkKOe9bn6AyAMiw",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j-U_vZbxkKOe9bn6AyAMiw/o.jpg"
      }
    ],
    "user_id": "m7Wu3LLzq0hHJPB9lS5SUw"
  },
  "BA2c54ZMNBf_U-5jsQkGsw": {
    "date": "9/29/2017",
    "text": "Why is this place not packed every night of the week?!   Station is truly a gem - hands down the best meal I have had all year from start to finish.   It is not a cheap place, but it is absolutely worth every penny. We did the $40 three course tasting menu.  Tasting isn't the right word - it's a full meal.  I had expected tiny portions based on some of the reviews and the overall style of the menu, but actually found the portions to be ample and left full and happy.       I started with the roasted carrot salad with fresh cheese, harissa, pomegranate curd, chickpea fritter, and watercress.  The carrots were roasted to perfection and all of the ingredients in the dish worked together to make a well balanced and filling starter.   My companions went with the beet and fig salad.  The server explained when we ordered that the figs didn't look great that day and so the chef was substituting plums.   While they were disappointed about the missing figs initially, they both thoroughly enjoyed the salad.  Clean plates all around.     Second course was a medium rare short rib entree, which wasn't on the regular menu, but was an option on the tasting menu.  I can't remember all the bits in the menu description; but again, I was pleasantly surprised by the dish and it's sophistication.  I expected a hunk of braised short rib and some veggies/potatoes, which is what you usually get when you order short rib.  What I got was an artfully arranged array with a decent portion of sliced short rib that was cooked just right.  It looked as good as it tasted and we all cleaned our plates.     Third course was a lavender pound cake with poached pineapple and coconut pudding.  Again, the portion was ample and the dish was beautiful.  It was tasty too - a strange and creative combo of flavors that really worked well in the end.  My companions got the popcorn panna cotta, which was also delightful.  The panna cotta was just the right texture and the popcorn topping added some contrast.  Neither dessert was overly sweet, which I appreciated.   My only suggestion on the entire meal would be that the jar the panna cotta is served in is a little awkward.  It would be easier to eat if it were shorter and wider, spreading out the popcorn topping a bit.    Service was top notch from the bar to the table.  Our server was well-matched to the place - with poise and polish, but not stuffy arrogance.  We will be back, that's for sure!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 9,
      "cool": 9
    },
    "photos": [],
    "user_id": "h9LPugJk2cpIh0gmQb5LnQ"
  },
  "AGKpB3At4gTHQFMQfEON_g": {
    "date": "3/5/2019",
    "text": "I get cravings for their vegan sloppy joe! The lunch menu can be perceived as limited but it's all very tasty. The local grains salad is slightly better with a lemon vinaigrette vs the maple one but that's only a slight critic.   Dinner menu is interesting and time has been invested in being creative without trying to be artsy.   Gorgeous panna cotta dessert.  Service depending on the day can be slow if you're in a hurry.   Inventive drinks menu and it's a lovely place for happy hour. Parking is on street and easy to find.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TwG4RYNLVWi-_emlLC_lCw"
  },
  "EAE1byyC1oFNgYIyGxA_Nw": {
    "date": "1/19/2019",
    "text": "I went for the first time during restaurant week. I had the carrot appetizer, the hanger steak and the lavender pound cake. The food was all really great but my favorite was the cauliflower that comes with the steak. I thought the pound cake could use a little more lavender. My only main complaint is that the restaurant is too dark. We asked the waiter to turn the lights up a little and nothing was done. I couldn't even see how the meat was cooked",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I2PfeHvdgn1wYz0EboRQnA"
  },
  "LiIhWwyQNJlHjXLopqSwsQ": {
    "date": "12/30/2018",
    "text": "Every time we go to Station, I leave thinking I've had the best meal. Every time, I'm wrong. Because the next time we go, the experience is even better. From the craft cocktails to the entrees to the dessert (seriously - I dream about popcorn panacotta), they exceed my expectations EVERY TIME. The food is nothing short of amazing. And the atmosphere is great. If you have t been there yet, GO. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fl3WyIvXsxc8hsGC23HxPw"
  },
  "69HrD9n3Af-UACyoBCj46Q": {
    "date": "4/30/2019",
    "text": "I selected Station for a graduation dinner with 8 people, because it had delicious looking meat options, but also had a reputation for providing strong vegetarian/vegan options. The drinks were inventive and tasty, the server did an excellent job, and the entire meal from appetizer, through main course and dessert was fabulous -- everyone raved about their meals. The James Barkhurst (Dos maderas 5+3, Salignac cognac, Barolo Vermouth, Butterscoth dolin blanc vermouth, coffee porter), and a drink called the Penicillin stand out from the several that I sampled. The Roasted Carrot appetizer was truly amazing, a hearty blend of flavors and textures, and the best of the first courses tried. They also had a seasonal chilled cucumber soup (smoked trout roe, charred cucumber skins, pressure cooked ancho and a yogurt panna cotta). Interestingly the baby romaine salad with its buttermilk dressing reminded one of the guys of a great burger, without having any meat in it. Two people had the station burger, served with onion rings and ideal crispy, seasoned french fries bearing bits of real potato skin. They were great dipped in the asiago fondue that came with the burger. Two people had the vegetarian carrot bolognese, which they enjoyed. One had the spare rib appetizer for his meal, which ended up being a huge portion with four large ribs. Both the hanger steak and the scallops on the prix fixe menu were excellent.  The hanger steak was perfectly cooked and delicious, with its cauliflower, roasted mushroom, shallot and roasted garlic custard. But the scallops were unbelievably good, served over rhubarb jus with pickled ramp relish, white asparagus and green garlic fritter. Even though there were only three scallops, the entire dish was deeply satisfying, particularly the asparagus in the sweet-tart sauce and I thought the amounts of each element were perfectly satisfying. I appreciated that they did not just pay lip service to offering tiny bits of (tasty) vegetables, as often happens in nice restaurants, but gave enough for a balanced meal that stimulated the palate.  The lavendar pound cake with coconut pudding and candied pineapple was delicious and everyone happily helped the person that ordered it finish hers (it was a pretty large dessert). But the star of the desserts was the caramel caramel corn panna cotta, a rich satisfying custard topped with the most amazing caramel with caramel corn on top. My prix fixe meal (roasted carrots, scallops, panna cotta) was the best meal that I have had in a very long time, and at $45 was a real bargain.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "88nmybLoIu7Xp4Bx-E4c2A",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Roasted carrot salad - an amazingly delicious salad although it&amp;#39;s hard to see the tricolor carrots",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/88nmybLoIu7Xp4Bx-E4c2A/o.jpg"
      },
      {
        "img_id": "s0iNUNysdV_-PaS4L24KBA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Hanger Steak",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/s0iNUNysdV_-PaS4L24KBA/o.jpg"
      },
      {
        "img_id": "jFhQlcUMQK1N2Hasd-x6jw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Scallops with white asparagus, rhubarb jus, pickled ramp relish, green garlic fritter. More filling than it looked at first, amazing flavor",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jFhQlcUMQK1N2Hasd-x6jw/o.jpg"
      }
    ],
    "user_id": "aDBC325GPsbrqoZ-HL6qMw"
  },
  "uKzEnn6n_5p9MyK_QPGBKw": {
    "date": "5/26/2019",
    "text": "This place has 5 star prices, 2 star service, and 1 star food. All the flavors in the plates were mismatched and just did not mesh well. I got the pork loin/belly and I have never had a tougher more leathery piece of pork loin-- which i assume the chef knew as they had pre-cut the meat into pieces. I should have stayed home and cooked. My friend who got the veal agreed that the flavour profiles left much to be desired and overall everything was too acidic. we both left quite hungry and disappointed.  There's nothing wrong with the people who work there-- there was only one person seemingly doing all the work and he was hyperactively trying to get everyone settled. Seems like poor management.  Also, the server came and poured the jus on the veal but nobody poured water into our cups.. a bizarre combination of decisions when it came to the dining experience. Overall this restaurant is a huge hit and miss at those prices. Small tweaks could have made a huge difference. I can get a far better meal in a more 5 star atmosphere for 20% of the price in a handful of places just nearby.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kI94hDK19b_SVlNUgI_t7A"
  },
  "FrWIDaXM26Km5uPxeqn-Bg": {
    "date": "1/17/2019",
    "text": "I really wanted to hate this place.  I've lived in the area well before this was here, when Lou's still scared away the hipsters rather than attract them.  Before the apartment complexes brought scores of over-privileged a$$holes to Liberty that really belong on Walnut.    I used to come here when it was D'amicos, an old man bar with lots of oak.  They tore it all out, which is shameful.  But damn, their food is GOOD.  Their chef is absolutely killing it, everything I've had has been outstanding.    Sometimes change can be ok. I suppose.  You should still shame the soulless folks that live in expensive high-rises on Liberty, but like the restaurants that thrive on their wallets.   Get the roasted carrots.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CsDsLShRwj8VJUl-23CtiQ"
  },
  "u--N25D5iBdrPxS9G0R5og": {
    "date": "7/10/2017",
    "text": "I hosted a happy hour here with heavy appetizers for thirty folks. Right from the start, planning with Curtis was a dream. He suggested our party take over the whole of the bar and that worked out great for us. Planning a party in Pittsburgh from afar in San Francisco could have been a chore but Curtis put my mind at ease and executed our event with plenty of panache.  Food highlights: Crispy fried spare rib? Hell yes! Crispy wings with chili, garlic, parmesan and extra virgin olive oil? Five stars, for sure!  Finally, because the little things matter: The bartender prepared for me the most divine sparkling lemonade and it made my night.  I'd love to come back here for dinner, and would highly recommend hosting a private event with Curtis and staff.",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 12,
      "cool": 9
    },
    "photos": [],
    "user_id": "gjhzKWsqCIrpEd9pevbKZw"
  },
  "eJ1IqN_Nh9a9L4dMP8xBAQ": {
    "date": "9/3/2015",
    "text": "Really really good!  Loved the bar atmosphere and the food was amazing!  I had the hanger steak which was YUM!  Our server was perfect too!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lBIMvxFwJsn7uL06csgkOg"
  },
  "vjthcGMQNv92p9JU1V14kg": {
    "date": "10/18/2015",
    "text": "Outstanding new restaurant with creative fresh, beautifully presented and not heavy food. Service was the best. Will return soon. Steve",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VROiRy93buqf8fVkjWTUhg"
  },
  "-1h2ojaB-2BhYhn9mvGH1w": {
    "date": "4/8/2016",
    "text": "This place is a great addition to the neighborhood! The menu was impressive and the food was delicious! The only negative is that it's a little pricey.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YELKzDctQKZEdZ8WzEzSbQ"
  },
  "it5jX1OIjEsmTluG3F5MhQ": {
    "date": "1/24/2016",
    "text": "Can you spare a chair?  Apparently not!  Our party of 6 were denied chairs.  When my husband and I arrived, our friends were already seated...on stools.  Our table was one of the few tables that had stools.  I don't mind stools, but not for what I thought might be a two hour dinner.  So, I asked the manager if we could have chairs from the other tables that weren't being occupied.  He told us that those tables were for reservations.    My friend mentioned that we too had reservations.  The manager excused himself as if to ask permission from someone else.  When he returned my husband had arrived from parking the car.  We filled him in on what was going on.  When the manager returned my husband also asked for chairs and again we were told that the empty chairs could not be put at our table.  We even asked if we could sit at the tables with the chairs and again were denied.  The tables with the chairs were for 4 and 2 tops, and we had six people.  They refused to put the tables together for us.  We could not believe the lack of willingness and incompetence to resolve this simple matter.  We decided to leave.  As we were leaving, we told the manager that we probably would have had over a $300.00 tab.  We asked him if 6 chairs were worth it.  Apparently they were.    I'm guessing that the people at Zagat had chairs.  However, if you still wish to try Station, call ahead and request a table with chairs.  They will NOT spare a chair.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "C_OzBWLcsxkMK3WSbdaGgQ"
  },
  "WhfymLNNvoQzya7kNTyNMw": {
    "date": "5/8/2016",
    "text": "We had such a great time at Station. The carrot appetizer was amazing! I would highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w1SvZ70-PtbNyUoBzAKUtQ"
  },
  "EpLdf0WdbhmBaRu7NjVGFA": {
    "date": "10/19/2015",
    "text": "The food was very good but it costs way to much and the helpings are very small. The atmosphere felt cold, the chairs uncomfortable.  Bring a pillow for your chair and order two meals.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "rl1qrjfjQuIsg8kpNt0YYw"
  },
  "ioHqTrIDwZcum8Wifyv1nQ": {
    "date": "10/11/2015",
    "text": "Was looking for smart food in a stylish but unpretentious, relaxed place, and lucked out in finding Station. Good wine list, concise, imaginative menu, efficient service that is helpful and never obsequious, delicious food (the fries are amazing and I don't even like fries), and then a couple of killer desserts. Good enough for foodies, casual enough for locals, Station deserves the good word of mouth it's getting. I wish it success -- just not too much, I'd like to still be able to get a table the next time I'm in town.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "eoLSKRfnfiQqjfExxRJ42w"
  },
  "iWsvvwuKwVTGT7CD0ssSZw": {
    "date": "12/25/2015",
    "text": "It has a nice decoration with two separate rooms for dining and bar. The decorations resembles a train station and everything is blended nicely with the building itself. However, they have some electricity counter meter or something like that in the dining room which is not covered and it's just tasteless compared to the rest of the decoration! We were first seated at the far end of the dining room, but the waitress changed our seat to the window table when we asked for it. I ordered bavette steak and I wanted it to be medium. The waitress insisted that it's better be served rare and we eventually agreed on medium rare. It was delicious. We had popcorn panacota and lavender pound cake for dessert and they were both amazing. The beer selection was not that big, but it was ok. The only bad thing was the chicken liver mousse. It was horrible in taste and it had an awful aftertaste also. Not sure why many people like it, but none of our party (5 people) liked that thing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UiVdWZIdo6kGBTfm__SXVg"
  },
  "MDr_4BGu9Vi3Tj3YldA8mA": {
    "date": "12/26/2015",
    "text": "Completely amazing. Words can't really do the food, service, or drinks justice. Just go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I2wmliUdjALT3TTk4alBIQ"
  },
  "gjGv_dSW4IB7QMx4q-7o7w": {
    "date": "3/12/2016",
    "text": "Very cool place !!!   A little loud in the bar area so if you want a quiet dinner eat in the dining area.  food was very creative and very good.  A great mix of casual but yet upscale in preparation.  I will definitely go back !!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "phvXw1_8neFdMEmSF5cxvg"
  },
  "rwIdjNyBd78CpaLmtZvFWQ": {
    "date": "9/11/2015",
    "text": "First time at this restaurant. Heard a lot of good things. Definitely not disappointed by this place. The setup of this place is a bar w some tables and a main room w tables. The food is more contemporary American feel with a small but diverse me u. For appetizers we had the heirloom tomato salad, chicken liver mousse, and wings. They were all delicious, however the wings had too much on them - Parmesan and sauce which made it overwhelming. For dinner we ordered tagliatelle which was outstanding. For dessert the popcorn panna cotta was also amazing. The service was very good and efficient. The appetizer portions were adequate to share and I would recommend doing that. The dinner portions were perfect size as well. Overall very pleased and will come again to check this place out w a different menu.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "F49i8bvNQeViBGMswnA06g"
  },
  "vE5to8ghBRzvL0vLOfxQhw": {
    "date": "2/28/2016",
    "text": "Had their wings, delicious! Tasted their burger, as good as all the reviews. If you have room for dessert, definitely try the pancotta popcorn. Wasn't a fan of the lavender dessert. Overall really liked the place and will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o4z9G9b4U0UBSb-uf8sKLg"
  },
  "4IefMQlk_X0_iGyXJ5o8Dw": {
    "date": "2/6/2016",
    "text": "The food was amazing. Drinks were amazing. Service was excellent. Menu was unique. We loved the roasted carrot salad and the endive salad. The tagliatelle was very good- not too heavy, and the pork was a perfect accompaniment for this dish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Psb1U0rA58BNmfW9VCsttQ"
  },
  "1nM-yuuZAhILgogAKcmTZQ": {
    "date": "11/29/2015",
    "text": "Great atmosphere and personable staff! Finally a hip and delicious spot in Bloomfield! I would totally recommended the caramel wings they are perfectly seasoned. I'm a huge fan of the beef tongue as well. Though originally skeptical about eating tongue it was very tasty. Every time I go I have to order it now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkL1EpqG1dXIPRCLB9pMEg"
  },
  "lS4JZ8IEsbImhF1vnANyeQ": {
    "date": "9/13/2015",
    "text": "The food is definitely the star at Station. The descriptions on the somewhat limited menu are creative and the execution delivers. An Heirloom tomato salad was elevated with the introduction of Old Bay custard and sweet corn and though the croutons were tasty, they seemed a bit out of place in this particular salad. The crispy chicken breast and leg was a home run. As if the tender chicken wasn't tasty enough, the addition of grilled baby lettuce, dirty bread pudding, corn puree and buttermilk vinaigrette made it all the more interesting. As good as the savory dishes were, the lavender pound cake for dessert was my favorite. It was smartly coupled with coconut pudding and pineapple. The restaurant is conveniently located along Liberty Avenue in Bloomfield, a great neighborhood that lacks creative destination restaurants like this one. The interior is modern, industrial and warm all at once with a pained exposed brick wall, cool lights strung about, but kept appropriately dim. While the food and interior design are winners, I did find a three drawbacks, all of which are fixable, and hopefully will be adjusted as this new restaurant finds it place. (1) The price of wine seems excessive, as there's no reason it should be more than other high-end places, such as Casbah, that known for their wine selection. And the more stunning thing is the lack of value for bottles. An $11 glass is $50 by the bottle and a $15 glass is $69 for a bottle. The pours are 5 ounces, by the way, according to a server. (2) The server was nice and efficient, but we could have done without the introductory spiel to guide us through the menu, which is very small to start with. That shtick is corporate-like and shouldn't be in chef-driven restaurants like this. Save the spiel for those who ask. (3) This one is a bit more difficult to put a finger on, but despite the cool surroundings, the restaurant lacked a good \"vibe,\" especially in the dining room, which wasn't particular busy. There was no music, so perhaps some livey (but not too loud) music would add to it. There also seemed to be a lot of \"empty\" space that otherwise could be filled with tables, which didn't help in this respect, but perhaps management plans to add more tables once the restaurant is open longer. Perhaps the server will also add to the charm of the place as they get their groove.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IlRmNuOSy9HMoxMMa6zhbg"
  },
  "KiGvrBf5DpUCdQMrUcKyww": {
    "date": "10/3/2015",
    "text": "Awesome food. Everything we tried was great. Definitely worth the visit in my two day trip to Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M5uoFNyLuefjVjZu4zLorQ"
  },
  "H7AFn2QwXnFLU_VAJBhrWg": {
    "date": "1/6/2016",
    "text": "I live just a couple blocks away but this was my first time in since Station opened.  It was a phenomenal meal, full stop.  We sat at the bar, fairly busy evening mid-holiday season with the wait for a table approaching an hour; Amanda handled bar and dinner duties with ease.  We skipped entrees and shared several small plates.  Chicken liver mousse and corned beef tongue were both solid with just right combinations of flavours to be interesting and in much larger than anticipated portion sizes. The wings were crispy and nearly perfect but just a tad under-seasoned, still a solid offering though.  The surprise for me was the miso poached apple.  I'm not generally a fan of mixed sweet and savoury, this plate did it right.  All the sweetness was from the fruit itself, no added cloying drizzle of some syrupy mess. The pickling, poaching, and tartness from the vinaigrette balanced nicely and the miso (I love miso) was subtle but clear.   Between the food, the portion sizes, and the very reasonable pricing, Station is definitely on my return soon list.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XoaeSBRdvJmlKRN7b8QvxA"
  },
  "9-omuxyS8n8CCuThpztHUQ": {
    "date": "9/6/2015",
    "text": "Poached walleye...wow what a unique and intense combination of flavors. Great drink selection and very filling (but not obnoxious) portion sizes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nCOlFxn-hpf4I68nvWx7Vg"
  },
  "YOA_nD6KX1OLz5_Si5ItvA": {
    "date": "8/19/2015",
    "text": "This place was AMAZING! The service was great, the atmosphere fantastic, and the food was top-notch. For just starting out this place is already ahead of the game. Go eat here now.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YNxmeUayPppPKaeye1jd_g"
  },
  "1vQqBibVvYG21c8QDyb_wg": {
    "date": "8/16/2015",
    "text": "solid 4.5 stars.   ambiance: 4 stars - was a bit loud for my preference. Definitely better on the dining room side than the bar side, but if there's a big group of people dining at a table, it gets louder than I typically like. also, good idea to make a reservation.   service: 5 stars, just the right balance of attentive without interfering or being annoying.   appetizers: 5 stars. we had the heirloom tomato salad and the chicken liver mouse. both outstanding.   entrees: 4 stars. we had the Tagliatelle and the crispy chicken. both dishes i found a bit too salty. we both felt the appetizers were the winners over the entrees.  cocktails: 4.5 stars - delicious, but wish there was a larger menu.  looking forward to seeing how the restaurant and the menu progresses!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9sOtOQse-3h6EFj_FvvaKQ"
  },
  "eTu-M2oGTliN5tZXzukWPw": {
    "date": "8/14/2019",
    "text": "Been here 3 times in the last 3 years, including a wedding dinner, and always had  a good experience. Came here again for Restaurant Week menu. Everything was exceptional, the food and the service. With a pretty expansive menu, they did excellent with all the preps. Not only that, the presentation was so beautiful. It's a pretty laid back environment unlike some upscale restaurants around here, but the food is superior to most 'upscale' dining restaurants I've been to.  Great drink options and fantastic cocktails. Station may be my to-go restaurant for all my celebrations from now on...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sBy4n1tdZXYcihSLwVVAhQ"
  },
  "aicXzPyfFzvWJgHdjMJoIQ": {
    "date": "8/12/2019",
    "text": "This is a review for restaurant week, but everything we ate is available on the regular menu. The benefit of restaurant week here is that dessert is essentially free.   While it has a casual vibe, Station's menu is anything but ordinary. Cocktails are upscale and the selection of beer is strong. I had a very nice aperol spritz and my husband had a local beer.   I ordered the chilled soup with charred green tomato and cucumber. It was the perfect summer combination. My husband ordered the roasted carrot salad, and it was excellent as well - certainly hardier than either of us anticipated.   The entrees we chose were the scallops with white asparagus and the hanger steak with fried cauliflower. Both great choices!   I was wishing that Station would change up the dessert selections, but in retrospect we enjoyed both the popcorn panna cotta and the lavender cake as much as the first time we had each of them. And why change a good thing? If asked to pick one as the better dessert, I would say the panna cotta, which has to be one of the more creative desserts in the city.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1-h1r6Fu4DGkcgh2dZrIgQ",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Popcorn panna cotta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1-h1r6Fu4DGkcgh2dZrIgQ/o.jpg"
      },
      {
        "img_id": "DBNJVkLSwPJ6Ek2B1IqY8A",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Pan roasted scallops",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DBNJVkLSwPJ6Ek2B1IqY8A/o.jpg"
      },
      {
        "img_id": "uImRYGaLLBpKd5uzNN7b9A",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Lavender cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uImRYGaLLBpKd5uzNN7b9A/o.jpg"
      }
    ],
    "user_id": "CxXZG-zsK8dJLi2sEc2wQw"
  },
  "xedJ-pQ8-0hZBBEuHo4GIg": {
    "date": "7/21/2019",
    "text": "A very eclectic menu of Brunch items made this a diificult decision as to what to order. The selections made by our table of five were all well received.  Truly a Five Star dining experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oz3lRYcfDL1tFzXo2AtNsw"
  },
  "fz5wincsFnIviUiasAsdjg": {
    "date": "5/10/2019",
    "text": "Thank you, sir, may I have another?   I could have said that about anything I ate here.  While perusing Yelp for a place to eat while visiting Pittsburgh, I was impressed with the reviews and the photos so we decided to have dinner here on a Saturday night.  The bar area is beautiful...I loved the giant mirror backed bar and it immediately have a warm, friendly and cool vibe.  In the dining area, there was some really cool lighting (which oddly brightened and dimmed so many times I thought I might be having a stroke) as well as a terrific brick wall that gave some texture and depth to the room without making it too noisy.  We started with cocktails (old fashioned) which were good.   Then for starters, we had the roasted carrot salad and some kind of cold green soup.   The carrot salad was great and I'm still not sure about the soup.  The flavor was unique and it had a variety of textures in it...I'm just not sure if I liked it.  For the entree, I had hangar steak over roasted cauliflower and it was delicious.  Honestly, I could have just had the roasted cauliflower it was so good, but the steak was a tender and tasty complement.  My better half had carrot bolognese pasta which was also wonderful.  To finish, we shared a popcorn panna cotta and a lavender pound cake.  The combination of the caramelized popcorn with the creamy texture of the panna cotta was a match made in heaven.   And that lavender pound cake was something straight off \"The Great British Bake Off\".  Wow, was it good.  Service was professional and on point.   This is one of those restaurants I'd love to pick up and move to my neighborhood in NYC so I could eat there all the time.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 11,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "ggXKVAtD0XqJy_M2ys5DrA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Bar",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ggXKVAtD0XqJy_M2ys5DrA/o.jpg"
      },
      {
        "img_id": "cv8waTZsxkY388Imolt44Q",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Popcorn panna cotta",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cv8waTZsxkY388Imolt44Q/o.jpg"
      },
      {
        "img_id": "4odVT5vkuFUmV71aNecoyg",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Lavender pound cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4odVT5vkuFUmV71aNecoyg/o.jpg"
      }
    ],
    "user_id": "wzyGNvArcpUjZauRWFrKHA"
  },
  "QGcpsHtOshsNwdG8PdmJNA": {
    "date": "5/20/2019",
    "text": "Unfortunate review. I was really looking forward to dining at Station, but after an evening here with friends I have to say that my expectations must have been set too high for this place.   Station is beautiful, the decor is romantic and dark - and this is a great place for a date. However, I have to say that this was some of the most disappointing food that I have had in a long time.  It was my friends birthday so we splurged a bit with the tasting menu ($45 which includes a soup, entree, and dessert) All three, fell so short it wasn't even funny.   For starters, my friend and I ordered the Chicken liver mousse and the soup, which was served cold. My friend was a fan of the chicken liver, but the soup was probably the worst thing I've ever had. After sitting there staring at the bowl for 20 minutes the bus server came over to clear plates, and when I explained that I really wasn't a fan of the soup (and had hardly put a dent in it) nothing else was said, he just abruptly picked up my full bowl of soup and walked away.  For our entrees we had the scallops. The taste was good, the portion was extremely small! We received 3 scallops, three TINY scallops. Needless to say we both left hungry.  Final course was dessert, which was relatively good. I didn't feel well so I ordered my dessert to go (popcorn panna cotta) which was again, the smallest portion on the planet.   I guess the \"tasting\" menu indicates that the portions are prepared in a smaller manner. I guess I just thought that there would be more available, and that the food itself would be more impressive.  If I came again, I would like to try their happy hour specials. I wouldn't try the tasting menu again, just because I was so disappointed in it the first time. I'm",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kspzkbu2x6nkXbnVpS0R7A",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Popcorn Panna Cotta to go",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kspzkbu2x6nkXbnVpS0R7A/o.jpg"
      },
      {
        "img_id": "ZAp-JNuJe_4iAgCVxRL_Nw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Chicken Liver Mousse (tiny)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZAp-JNuJe_4iAgCVxRL_Nw/o.jpg"
      },
      {
        "img_id": "H8bdGGiMYDDnmGgfeQ-Jag",
        "caption": "Photo of Station - Pittsburgh, PA, United States. A friends burger (who didn&amp;#39;t do the tasting)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H8bdGGiMYDDnmGgfeQ-Jag/o.jpg"
      }
    ],
    "user_id": "q7kb0GVCWOdORhOrRfkxbw"
  },
  "2_2IQKgr_kdVT5UzEy23Rg": {
    "date": "2/16/2019",
    "text": "The Station was the first hot spot we tried in Pittsburgh.  A trendy looking pub inside and out.   But, this is no normal pub. To our surprise, the menu did not have your everyday pub offerings. They offer unique dishes that they can call there own.  For example Roasted Octopus, Pan Seared Pheasant or Carrot Bolognese and many dishes have sauces and cheeses that I never heard of.  I unfortunately wasn't too daring as I am pretty picky eater but I was easily able to customize my dish.  My friend on the other had ordered a Long Grain salad.     Overall, we enjoyed our first meal in Pittsburgh.  The food was delicious and the atmosphere was trendy and hip.   Warning: plan to pay above average pub prices. They are not cheap.    The one thing that was a little sis",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "t19_XA1JWaiprAHu-c_a_Q",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Hanger Steak",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t19_XA1JWaiprAHu-c_a_Q/o.jpg"
      },
      {
        "img_id": "GLbbEu1Y5sTHC8EwjC6x8Q",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GLbbEu1Y5sTHC8EwjC6x8Q/o.jpg"
      },
      {
        "img_id": "FknE_f_3YzWTHQt1JraoyA",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FknE_f_3YzWTHQt1JraoyA/o.jpg"
      }
    ],
    "user_id": "uK_GOFy1KZ8bYoJD9K_XhA"
  },
  "lskkesNQGCrz9QLqkVdswg": {
    "date": "6/15/2019",
    "text": "Station was very good! The service was great and I really enjoyed my meal. I had the Roasted Carrot Salad with fresh cheese, harissa, pomegranate curd, chickpea fritter, and watercress. I also added chicken for more protein. The salad was extremely unique and delicious. I also had to have the lavender pound cake with a coconut pudding and pineapple. We all enjoyed our meals and were happy. Our server even took a photo of our group, which we appreciated. I wish the prices were a bit more reasonable, but overall, great experience and I would recommend dining at Station!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IeYKdAu38glrmTzxgjN3cQ",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Lavender Pound Cake with coconut pudding and pineapple",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IeYKdAu38glrmTzxgjN3cQ/o.jpg"
      },
      {
        "img_id": "APOZw2CoQjuKuDam4luPeg",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Roasted Carrot Salad with fresh cheese, harissa, pomegranate curd, chickpea fritter, and watercress. Added chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/APOZw2CoQjuKuDam4luPeg/o.jpg"
      }
    ],
    "user_id": "ENZbh_u6v1vT_zTUW3vZGw"
  },
  "AMGZDeOBQkiN5QBxj5VFsg": {
    "date": "2/9/2019",
    "text": "We came for Winter 2019 Restaurant Week and had a delicious meal! It was really fun to try multiple things on the menu, at a very affordable price.   The soup was phenomenal and packed with flavor, the octopus was good but not great, and the pound cake was very delicious without being overly sweet. Good food and excellent service, so overall a great experience!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HY1TSt9KbnxP8BkAkA_dIQ",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Restaurant week Winter 2019",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HY1TSt9KbnxP8BkAkA_dIQ/o.jpg"
      },
      {
        "img_id": "b8G4jJ41yFtyqeYfq3VTbA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. lavender pound cake; 4/5 stars",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b8G4jJ41yFtyqeYfq3VTbA/o.jpg"
      },
      {
        "img_id": "2ICzFzAVg9y9CzjTFQB8Dw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. roasted octopus, yogurt braised greens, and dumplings; 4/5 stars",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2ICzFzAVg9y9CzjTFQB8Dw/o.jpg"
      }
    ],
    "user_id": "vekZnPvP0s9LT8lEvGXnKw"
  },
  "iVWE1TrDVXRSAOFtrY_H-g": {
    "date": "7/27/2018",
    "text": "Really no complaints! Service here is so friendly yet professional. The dishes are creative, pack robust flavor, and are elegantly presented. I was a little intimidated by the prices initially, but the food and drinks were worth every penny.   I was also blown away by the classic yet refreshing cocktails they serve here.   I would say that the burger here is quite possibly the best I've had in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 13,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "M9hs_qvp1Hqv36OiM3m9mg",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M9hs_qvp1Hqv36OiM3m9mg/o.jpg"
      }
    ],
    "user_id": "zdpn-MrLT_QPhwJ5-KHKCA"
  },
  "VyFq_KNIZX78tkqV1kgaOg": {
    "date": "6/20/2019",
    "text": "Was here on a quiet Thursday night but that was totally fine with me. The staff was very nice and the inside was cute and rustic. I got a drink (can't remember the name now) and a burger that was delicious. Not rushed at all and it was a nice place to come on a late night. The rest of their menu looked great as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kFuKi3Js-Wzr0FX0uF0kzg",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kFuKi3Js-Wzr0FX0uF0kzg/o.jpg"
      }
    ],
    "user_id": "cBvQir2uzA59ZjZYcSngHQ"
  },
  "UM1N1no33a7-tRXfEJ0zcA": {
    "date": "6/10/2019",
    "text": "I love Station! They have some of the best cocktails in the Bloomfield/Garfield/Friendship area, on par if not better than Apteka, Mixtape, and Spork.  Their bar menu has some very affordable options, and a few great veggie options as well. The vegan sloppy joe is actually pretty great!  Brunch here is perhaps the best brunch I've had in Pittsburgh. Dishes are plated immaculately, artistically, and with so much passion that it brought tears to my eyes. The Fried Sticky is just fantastic, with little shards of dehydrated fruit chips that add such wonderful texture to the dish. It's a fixed menu and a tad on the pricey side, but so so worth it if you're really out for a nice brunch!  I've also come here for a team lunch, and they were very accommodating and allowed reservations, which is nice for a large group size.  Lastly - I love the decor. It has a sort of 20's dark art deco vibe with modern and slightly industrial (but not overdone) feel to it. Noise levels are pretty tolerable as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "InDrrRvQ9f732YGPX4Ixmg"
  },
  "Tn-0_U8fIzvfydsYaviF3w": {
    "date": "4/6/2018",
    "text": "You know a restaurant is good when you're still thinking about your meal weeks later. It took me waaay too long to try Station, but better late than never right? I came in on a Saturday evening for dinner. The space is small but cozy. The overall ambiance is very relaxed and casual but still classy enough for a date night. You can have a good time and actually hold a conversation without shouting across the table - a rare find at a bar restaurant on a weekend night.   Where do I even start with the food. Everything we had was simply amazing! They offer a 3-course tasting menu for $45 a person which are just selected items off the regular menu. My boyfriend ordered from the tasting menu so I was able to steal some (or most) of his appetizer. We ordered the roasted carrot app which is just a bunch of really delicious vegetables thrown together. I came solely on a mission to try the vegan sloppy joe (which is not on the tasting menu unfortunately). Vegan or not vegan, you need to try this! It's made of a soy protein that gives you the same consistency and texture of ground meat. This is the perfect vegan comfort food when you just want to treat yoself. It also comes with a side of fries because a sloppy joe isn't complete without something deep fried.  Dessert time! I know everyone is hyped up about the popcorn panna cotta but no - the lavender pound cake where it's at. Perfection on a plate. It's a light dessert but super fragrant from the lavender. We got the dessert to share but the sharing part ended very quickly.  I can't write this review without talking about the fantastic service. Everyone from the hostess to our waiter were so friendly and attentive. With a small scale restaurant, the waiter and kitchen staff can really focus on the few people there so food came out very quickly and the quality was on point. I can't think of a single complaint. Definitely check them out when you're in the Bloomfield area!",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 17,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "zq_-ZVXcLqf_Dvp6ttB_SA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Lavender Pound Cake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zq_-ZVXcLqf_Dvp6ttB_SA/o.jpg"
      },
      {
        "img_id": "VtCfHKXn_aPEewuFB0XVOA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Hanger Steak",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VtCfHKXn_aPEewuFB0XVOA/o.jpg"
      },
      {
        "img_id": "L7O0Axpp9i-ED1U4RGQmqw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Vegan Sloppy Joe",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L7O0Axpp9i-ED1U4RGQmqw/o.jpg"
      }
    ],
    "user_id": "6KUA3-IfHoAhQ3FL2djQoQ"
  },
  "-ffSGlSQrCRATivJrQrbvw": {
    "date": "6/9/2019",
    "text": "My boyfriend and I decided to go to Station for date night this evening. We ordered the beef tartare and grilled pork rib small plates to share, he order the burger and I ordered the grilled hanger steak.  The starters: The beef tartare was good, the beef itself wasn't as outstanding as I would have liked, but the dish came together beautifully, and the spiced crackers were great. The grilled pork rib is where things started going a little sideways. The meat itself was done perfectly, but the sauce was a touch on the weird side. I am a huge fan of sezchuan peppercorn, but I really don't think it worked with the rest of the dish on top of which some bites were beautifully balanced, others were not.  The mains: His - Between the asiago fondue, onion ring, and onion jam, the beef, which should be the star of the show, got lost in the mix. That and the stacked burger is a somewhat absurd height. The fries were to die for.  Mine - The hanger steak was grilled perfectly, the fried cauliflower was thickly battered, was interesting, but quickly became soggy. I would have greatly preferred a roasted cauliflower. The mushrooms were perfect. There were two slivers of onion, and they were both tasty. The garlic custard needed way more garlic and way less custard. The jus used to coat the bottom of the plate was far too abundant and far too rich. I wound up moving the majority of my meal to the edge of my plate so I could enjoy the flavors of the components of my meal without losing them in the sauces.  Overall, it is very obvious that Station uses high quality produce and meats, but those ingredients were not allowed to shine and were buried under too many flavors and unnecessary rich sauces. Everything we had was very rich with little done to balance the richness. I craved some acidity by the end of it.   We will be back to try other options on the menu at some point, and I really am hoping the second attempt goes better than this one. As someone who loves using quality ingredients in my own kitchen and letting them shine through, I'm hoping the next time we're there, we walk out with a better impression. Right now, both of our meals are sitting heavy on us.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MS0ZclqMGHAnNaj_TXMtEA"
  },
  "Tm47H0KPkYcqK8EGFRvDbA": {
    "date": "8/9/2019",
    "text": "I've always had a great experience here and it's one of my favorite places to eat in the city. Their vegetarian dishes, though limited, are superb.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XJRgygBy7jY26p0ObZfNNw"
  },
  "7GDaE7GqWv0qdndP6p4BAg": {
    "date": "6/11/2018",
    "text": "We went to Station a few months ago when a group of friends and I chose it as our \"upscale\" dinner place.  We have had great luck with cheap and casual eats in Pittsburgh so we were excited to try a little bit of a more formal meal in this great city.  We arrived a little bit after the dinner rush, so the place wasn't crowded or crazy and we got a lot of great attention from our server.  Since there were four of us, we decided to have their prix fixe menu and each of us picked one.   I won't go into great detail for the meal, because the items are not standard menu items, so you won't get what I ordered by this time. What I can tell you is that each dish was wonderfully executed and the wine options worked perfectly with each dish.   One of the specials included the chicken liver mousse (which is in the main menu) and that was a revelation for me. I am not a huge fan of liver, although I do like organ meat normally, and this dish managed to convinced me to try more liver mousse. The taste that turn me off liver (that iron-like earthiness) was perfectly balance with all the other ingredients creating a luscious creamy spread that we loved. Our only complain is that we needed more bread to spread it on!  Another highlight was the fact that the vegetarian and vegan dishes we got (I ordered the vegetarian options) were as well planned and executed as the meat dishes. So many times I've been to a restaurant with a great reputation and they usually are just good at pork, or beef, and everything else is an afterthought. This shows a commitment to all the food they serve, and a willingness to please their customers.  After having such a great meal, we told our server how much we loved what we got, and they offered to send us a recipe for one of our favorite items. I got a great recipe for a granola that was both easy and very impressive tasting.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "-UYVA6_U7-OsP498vJ3NuA"
  },
  "XbR4MVGH_G6f55LSF0QiOA": {
    "date": "1/27/2019",
    "text": "I really wanted to love this place. The storefront is amazing, the menu sounds incredible. But it just left me feeling-meh. Our waiter was great, very excited about the dishes. I ordered the carrot salad and octopus, my friend ordered the romaine and scallops. The carrot salad was the star of the night. It was certainly delicious. While my octopus was cooked perfectly, it was incredibly salty and the greens accompanying oddly bland. The scallops were good, but nothing incredible. A little boring as well. My friend felt the same. For the price of each entree, it shouldn't just be \"meh.\" It should be memorable. The only thing memorable was the carrot salad. I was hunting for flavor, and not just the flavor of salt.   Another odd thing, minutes after ordering, my friend's entree was delivered (prior to salads and without my order).  They took it back. But when our salads were finished, the same thing happened. His scallops arrived well before my entree. Very odd timing issues.     So, great space, great looking menu, but it was just not memorable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CtUsYYsJFd5QvMVJUOsTAw"
  },
  "PUmfPF5RAMczuzgb-cH68Q": {
    "date": "12/9/2017",
    "text": "Let me start with dessert. Please save room for the lavender pound cake. Although the flavor of lavender was very subtle and I would have liked to taste more of it, the cake itself was one of the most fresh and delightful pound cakes I've had. The plating and diced pineapple also added to the experience!   I chose the Camponelle which was very good and came with an 1hr egg that tempts your Insta-boomerang urges. I loved the cheesiness, slices of pork, and buttery toast. Although I found it to be a bit salty and oily at times, I was surprised by how light it was. I finished the entire pasta dish feeling no regret.   I didn't try the roasted mushroom, but my friend enjoyed it. I did try a fry and dipped it into that pesto aioli dip.. really good!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "AeaAFkSskosYIqS59jgALw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Camponelle",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AeaAFkSskosYIqS59jgALw/o.jpg"
      },
      {
        "img_id": "FyDxhj3_tGVQyaL4hJKnWg",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Some pesto aioli dip",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FyDxhj3_tGVQyaL4hJKnWg/o.jpg"
      },
      {
        "img_id": "qEzwrTKWXVIwzESmufUt_A",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Roasted mushroom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qEzwrTKWXVIwzESmufUt_A/o.jpg"
      }
    ],
    "user_id": "U-FY_uZs1set1LFs7YL12w"
  },
  "QAb_8JGSS4k67-3sszWaXg": {
    "date": "5/24/2019",
    "text": "The corn salad knocked my socks off...like eating summer on a plate. I find myself thinking about it frequently.  Have tried to recreate the recipe at home to no avail. Maybe I'll have to go back to Pittsburgh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ogCxKqRO5v40zz4MkD5pIA"
  },
  "FznjiXPHORlSkAwqYPAvpA": {
    "date": "4/12/2019",
    "text": "One of the best happy hours in town. Amazing $8 cocktails and delicious $6 apps. Highly recommend. Haven't been for dinner. Yet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "8olBpjPE13vY4KgENnmqNg"
  },
  "tPwzqTV27KL510hHhufxKA": {
    "date": "11/17/2018",
    "text": "Had an awesome dining experience here this past weekend. There were so many great options on the menu and decided to do the prefixe so that we could try a little bit of each. We started with the roasted carrots and parissimon appetizer, and loved it. I have never had parissimon before but loved the sweet, subtle, and refreshing taste, complimenting the beautifully roasted carrots (and awesome cheese!). Our main course consisted of the steak and carrot Bolognese. I'm not much of a meat eater out of fear the meat will be too chewy, but the steak was cooked perfectly, easily chewed and enjoyed. Although the carrot bolognese did not contain any meat, you the texture of the puree made you certain there was. And to top it all off, we devoured the lavender pound cake and salted popcorn pannacotta! Highly recommend coming here for a classy night out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "by9WgccrFe3DNxUkwJUkOg"
  },
  "sLoRM6Bx2zwaQWYg7xUl3A": {
    "date": "12/29/2015",
    "text": "Truly exceptional. Went here for a birthday dinner and the decor is on pointe (to be expected b/c it's the same sign painter/designer as Sienna Mercato, Meat and Potatoes, Union Pig and Chicken, Industry Public House, Kimpton Hotel Monaco, OTB, Tonic, Sweet Peaches...) So that sets a nice first impression. Atmosphere is really nice, the space is clean and sleek - everyone in the party is hungry and ready for good food!  Now on to the food! The best part about birthday dinner is it usually means a little bit more of everything because why not? You're the birthday kid! Get that extra cocktail! So we had a fair sampling of everything from drinks to apps and desert.   We started out with some carrot and Belgian endive apps. The belgian endive was pretty good but the carrot app was stupid good. For my main. I ordered the Bavette Steak. It honestly knocked my socks off and I'm not really even much of a steak eater but my friend recommended it. It was perfectly cooked and served with little mushrooms and cauliflower in an amazing savory but not too salty reduced au jus. There is nothing I dislike more than overly salted sauces where all you can taste is the salt and none of the other flavors. The au jus with the steak was just right. It was salty enough, but you could still taste all of the mushroom and other subtle flavors. Great. I sampled some of the chicken and the pork that friends ordered and both dishes were also sooooo good. Particularly I liked the chicken.  The bow lane was my favorite drink of the night and maybe in Pittsburgh period! Black walnut liquor is one of the ingredients. I've never tasted anything like it before and it is incredible.   We tried both of the desserts - panna cotta and the lavendar cake. The lavender cake was fairly good but I would choose the panna cotta next time for myself.  Definitely give this place a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJwWewoUNJsyl4X7mENxwQ"
  },
  "di8pjOWCXg2iaCw5l_aHpg": {
    "date": "1/24/2016",
    "text": "I really enjoyed our experience. We came in around 10, happy hour was just beginning. There was a nightly punch on the happy hour. I inquired about the punch and they had not prepared it yet. The barista crafted the nightly punch based off my personal taste. Asking me what flavors I prefer, alcohol preference, it was really so fun. Once he had crafted the punch to suit my taste buds he came to the table and gave a short presentation. The drink was brillant. I ordered the wings, they were garlic flavored cheese perfection. I loved the ambiance of this spot too. Amazing food, drinks and truly exceptional service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hYQ_X-yRPcTrzlN5sumTQ"
  },
  "5EiTCzRUm9rD84G9FlmYEw": {
    "date": "3/14/2017",
    "text": "We've been to Station twice for dinner and have enjoyed our experience both times. Their cocktails are tasty with a good mix between vodka/gin and whisky drinks. We can't go to Station without getting the wings because they are so good! Spicy, but not too hot because the creme cools it down, and very crispy. We've sat in the dining room both times and had to ask for the bar menu. If you want a burger or sandwich, ask for the bar menu since they aren't on the regular menu. I had the tagliatelle with smoked pork shank. It was tasty, the pasta was homemade and the poached egg on top was delicious, but a better description for the pork would be ham. I liked it but the S.O. doesn't like ham and didn't enjoy the pork. The dish was good but overly salty for my taste. The S.O. got the chicken sandwich and enjoyed it, but ended up just eating the chicken and toppings because the bread was too crispy to eat as a sandwich. Overall, we'd come back to Station and I've been wanting to try their brunch and happy hour.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UDR3NRyy0o4J5O_I4aBPqA"
  },
  "nPNfYccJazZVUDKMKebysw": {
    "date": "2/14/2016",
    "text": "Just had V-day dinner here! Service was exceptional!  My girlfriend had the Skate and loved it! The fish was perfectly cooked and the veggies were a great compliment.   I had the ravioli and it was amazing! The bread crumbs added texture and the sauce was delicious!  We shared the wings for a starter and they may have been the best part of the meal!  We were both stuffed and satisfied! We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j-h7dt_jTbfrM8ZSzYoUyw"
  },
  "SzBqiKXNEurAwLZNt1M7yQ": {
    "date": "2/19/2017",
    "text": "We went to Station for the first time this past Saturday. The restaurant was crowded. Our server was very good. The drinks were creative and really good. Our dinners were excellent. I had the Tagliatelle and my wife had the steak.  However the noise level was unbearable. It made what should have been a very nice evening into a bad one. I don't believe we will be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NKEpOU2wZpImMXQT90q5pg"
  },
  "NyM1pC_kMt4jKZ7sqVPepw": {
    "date": "8/27/2015",
    "text": "Our waitress Jennifer was nice n friendly, but she didn't check on us very often, and it took quite  a while to get our food even though there weren't  many people there.  They have a good beer menu, And they're not badly priced.   The food, however, it is definitely more expensive then two dollar signs.  The meals range from $15-$30, and there's not enough to fill you up, let alone to take any home.  All of our food was delicious though  :-)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kJbdnfdD8G7wM49U9nd7EQ"
  },
  "bd2YUSuJ9QLCdIM9dYfkRw": {
    "date": "12/4/2015",
    "text": "I've been here twice so far.  The overall ambience and vibe of this place is really great. I felt very comfortable in here. I know that's a weird thing to say, but it just felt good to be inside this place. A very warm feeling.  I've tried a few things off the menu and each item was pretty yummy. The food here in my opinion is consistently good. I've had nothing fantastic or must try yet, but I've also tried a limited portion of the menu. I'll be sure to keep sampling. The price of the food is about what you'd expect. Portions are smaller though so this is a place where you should definitely try an appetizer or two in addition to the main course.   I think my favorite thing about this place so far is the cocktails. The bartenders are awesome. The drinks alone will keep me coming back. On my last trip we just sat at the bar and talked with the bartender for a few hours.   I tried one cocktail here - I forget what the exact name was - but it was a take on an old fashioned, but had a banana walnut taste to it. Unbelievable. Really Really good.    As a Bloomfield resident, I'm super excited a place like this opened up in the neighborhood. Hats off to the owner for taking a gamble on this one. I hope this place is around for awhile.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZapG02yc3W72Xt7tBQMHPg"
  },
  "BHGOrVAd8z7I3Q_gLCRW4w": {
    "date": "1/8/2017",
    "text": "Interesting dishes! Reading the menu the items seemed bizarre, but actual meal was delicious. Good blend of flavors and hearty food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6N2aDjn5LIA1OwCpmtLHbg"
  },
  "8Ulo-N4uusPBF3iOM9ZkWw": {
    "date": "12/12/2015",
    "text": "Probably one of the best meals my wife and I have had out in the Burgh. We went with a large group and tried nearly everything on the menu and it was all tasty. Service was excellent and did I mention how good the food was? Fantastic place, a place everyone in Pittsburgh needs to try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LjvTK142fdtAAS27oVVHHQ"
  },
  "6e6Y66eAPO7gZSuCUPxsRg": {
    "date": "11/17/2015",
    "text": "What a great experience. The service was outstanding - Dexter knew the menu, was ready with great suggestions, and a lot of fun. We had excellent cocktails - corpse reviver for me - and a nice bottle of wine. The chicken liver and corned beef tongue (get over it - it's worth it) are awesome, as were the pastas and fish  if you're into pretentious service and people who take themselves too seriously, it's probably not your place. If you enjoy good food from good people who love what they do, you'll have a blast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lXTheDqOlqYgfPFNPuExqA"
  },
  "ZwuMu6rn3sk3KUoThjX5HA": {
    "date": "12/27/2015",
    "text": "I had the cabbage & taleggio ravioli & my date had the Bavette steak. Both dishes were exceptional, five stars all day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sQp61pVuzivnGiIWoRf0Rw"
  },
  "Ye0iepikx8KzYUyA5xvYQA": {
    "date": "7/24/2016",
    "text": "We came in on a Sunday early in the evening and had the place to ourselves. First impression was that it was a bar that allowed smoking. We sat in uncomfortable chairs as we trudged through dinner. Had the chicken and striped bass. The crispy skin chicken was really good. The striped bass was almost too salty to eat. As others have posted, the price for the quality you get doesn't add up here.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wPpMjmTAiQCJtuaUNjQI9w"
  },
  "ip4oSsf3mm23Df_H3s20Jg": {
    "date": "2/4/2016",
    "text": "What a place! Took my wife here on her birthday and had a great time. Food was fabulous great service very friendly. I would definitely recommend this place for a nice meal and great cocktails",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-KcheB4gc81LdCIa12N8tg"
  },
  "BHtlh1-LzycEq0UWdErnow": {
    "date": "8/23/2015",
    "text": "We are definitely going to be return visitors to Station!  Station's space is great--the restaurant divides neatly into a bar area with a few high tables and a quieter dining space. Since we dined during Little Italy days, the bar side was a bit crazee, but the dining area was pretty quiet. The place was tastefully decorated, although we heard that it is still unfinished. One thing we noted is that the hanging light fixtures over the tables were at just the right height to be right in the waiter's face when delivering or removing items from the table. Awkward. Our waiter sheepishly admitted that he'd been clunked in the head more times than he cared to admit.  The cocktail and wine lists were small but carefully curated. The wines we tried were really nice and between $8-$13 a glass. Our waiter was very informed about the drinks and ingredients and attentive to the needs of the table. We took all of his recommendations for dishes and were not disappointed.   The menu was really attractive--again, small and well thought-out. Many of the dishes looked delicious but our party decided on the Chicken Liver Mousse and Heirloom Tomato Salad to start. The mousse was incredibly---great smooth texture, wonderful crunch added by the breadcrumbs, acidity from the red onion. Our slices of bread were a little on the burnt side, but still very good. The tomato salad was also very good--some sweetness added from the corn, acidity from the dressing, skins removed from the small tomatoes to remove any bitterness.   Our entrees were all aggressively seasoned--so beware that dishes you identify as likely to be salty are going to be REALLY salty, like the Tagliatelle with Smoked Pork Shank. However, all dishes were tasty. The pasta was cooked perfectly and even though it was definitely a heavier dish, there were no ill effects after eating it.  My least favorite of the entrees was probably the Charred Eggplant and Yogurt Ravioli. While the ravioli itself was awesome (never thought of adding yogurt as a filling and the slight tang was great!), the bowl itself was a semi-unattractive mess of oil and breadcrumbs. The winner at the table was definitely the Crispy Skin Chicken Breast & Leg that came with an incredible your-mom's-Thanksgiving-like bread pudding and this delicious buttermilk vinaigrette.   We'll definitely be back to Station and hope that as it settles into its new spot, it keeps the clarity and focus on ingredients. Even though the head chef was not in during our dinner service, the food was great, so there's definitely quality control and talent in the kitchen.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oOrTAswjcLcMOqNQqSP9AA"
  },
  "wG4B36M03hxgyq2a2E94dg": {
    "date": "11/12/2016",
    "text": "Simply amazing! We loved all of it. For starters we had the Crispy Wings which were to die for. For the main course, We had the burger and the steak. Again, all of it was mouth watering. Perfection! Service was very good too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Thdto-vBhnVu57HP_TH1oA"
  },
  "O5IVFR-rTXAa9CTOpALQrw": {
    "date": "10/23/2015",
    "text": "incredible amounts of flavor in everything we ordered.  Really warm atmosphere and staff....  As a bonus, later that night: best leftovers ever.   I need to go back with a team of 6-8 friends so I can taste everything on the menu",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pzWqbCd17r056Saa4lhBDg"
  },
  "HVq9DuZOjnBgRjemJBu6kg": {
    "date": "10/29/2015",
    "text": "Great wine, great atmosphere (granted the chairs in the dining section are a bit uncomfortable), great service. I ordered the pork tenderloin with pork belly, absolutely delicious, melted in my mouth, so many flavors but not overwhelming. I'm not a fan of lavender but I was pleasantly surprised by the lavender pound cake, not overpowering and very moist. Excellent wine. I look forward to returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zzFZXZ-jiW_AhHR_w25aeA"
  },
  "k0JEm9b5uDlidQSUBN2VAQ": {
    "date": "9/28/2015",
    "text": "The burger is fantastically put together and the fries are top-notch - one of the best you'll get in Pittsburgh.  The atmosphere is classy yet laid back, and the service is prompt and friendly.  The owner came out to personally check on us.  Overall, an amazing new addition to the Pittsburgh restaurant scene.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qWtrwmwfJRhb9YHMkLpF5A"
  },
  "I2VaXyy02AW4iBHfd0b_EA": {
    "date": "12/4/2016",
    "text": "My husband and I adore this place. The food is good, the cocktails are delicious and the wait staff are lovely. Good brunch too. Really have never had a bad experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CdSOEke5sP3CPcq_rrQ0DQ"
  },
  "cVulVQf14nGDa1FI-mQl_w": {
    "date": "11/21/2015",
    "text": "Great cocktails and very good food. Cozy atmosphere with good hosts and wait staff. The manager even gave us his attention. Over all, I'd say it's fantastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lu7QvOJl-EiaqV0VvNhpWg"
  },
  "WXVCGaTpc6o5xLDL-Xd5YA": {
    "date": "2/3/2016",
    "text": "Because the servers are pretentious and there is an equivalently pretentious corking fee, salty, exposed electric meters 3 feet from our table.  The food was only \"meh\".   The hostess made it seem like it was a chore that we  were interested in a four top for dinner.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "C3WcYnBjw2IPxdnd3cPyMg"
  },
  "AJunB_qyW-HYELWxzVCQjQ": {
    "date": "1/5/2016",
    "text": "So, before we begin with the review, let's start with reminding everybody how to use the Star guide - 3 is everything is par for the level of restaurant it should be, 4 is service OR food is above par, 5 is both, 2 is something is off and 1 is both service and food is off. Leaving that there.  This station both Food and Service were just off and that's just the way it is, but food more than Service.  I came here with my favorite foodie KB, having gathered up our pennies for one night and coordinated our reservation book for a highly anticipated night at a new, greatly and positively talked about restaurants in one of my favorite parts of town: Station. After reading all the positive reviews, I couldn't wait to in dig myself into an appetizer of chicken liver mousse, while KB started salivating for days over popcorn panna cotta as a desert.  We got there for a 7 o'clock reservation during a weekday. The hostess was lovely setting us at a table for 2 in the second add on room. This place is absolutely gorgeous. The carved out wooden pillar that line up the wooden bar, the metal offset that rims the bar stools, linked together by an elaborate tin ceiling which transports you back in time and the railroad photographs that line the wall in the adjacent room. Absolutely lovely, but that was where it about ended.  We received the menu as well as the cocktail menu and had a waiter arrived with good timing. I asked for a guide as I glided over the cocktail list and eventually settled on a Signature drink the Settlement which is a version of a Manhattan. It was an easily forgettable drink, especially for the price and if you're used to the likes of Tender, Grapparia, Acacia or Mardi Gras. KB was asked what kind of cocktail she would like after me. Not being able to find anything on the Signature lists she asked for an Americano which perplexed the waiter into an apology for not having Espresso. Sigh and Ding. I shrugged it off as a simple mistake as waiter are waiters and not bartenders.  We decided to try two appetizers, first the Corned Beef Tongue and the Chicken Liver Mousse. Corned beef tongue was the first in my mouth and my favorite thing of the evening, but barely. With the slightest slip of the hand the salt level would have been unbearable and you forget that you're eating Tongue. Which is a shame, because if you order it for the taste and don't get it, why would you fork over $12 dollars for it? Addendum - after rehashing with some service industry friends who naturally know more than me, from the picture alone the peppers seemed dilated, which apparently just indicates bad prep work, I will take their word for it until I see what kind of competition they serve up at Pallantia. The chicken liver mousse was too large a portion for the two pieces of toast served with it and utterly too creamy. I thought I was eating chicken flavored cream. Ick. KB stopped half way through her toast.  Next the main dishes. From the pictures and reviews I ordered the Pork Shank Tagliatelle, while KB had the Ravioli. Seems like it was a pasta night. Um. Alright then. The pork was good but the rest of everything fell apart. I came served in a broth that completely washes noodles rather than coating them, leaving them soggy and flavorless. The 1 hour egg does absolutely nothing to help this, as it delicately dissolves in the mix. I was hoping for an egg that would help amalgamate the ingredients, however, no such luck here. On the other side of the table, a similar experience, KB was not digging the flavor and first, not enough salt and after adding some, too much. Plus, more brothiness; we were just not having this at all. We asked for both of it to take home, and our items were boxed up because, simply, I hate wasting food. At this point we were so disappointed we didn't even indulge in desert, which looking at the table next to us, didn't look at happy as hoped [hopefully we were mistaken and it tasted great]. We just couldn't justify another 8 dollars for another disappointing course.   Now, a surprise. The saving grace for the flavor of the Entrees happened later that night and the next day. I got the munchies around midnight and gobbled up my leftovers cold. Serious surprise! When cooled down to fridge level the broth solidifies and starts doing the noodles justice by bringing out the delicate flavors hidden in the layers of pork. Weird, and also upsetting that when served at desired temperature it doesn't work and at incorrect temperature it does.... Please look into that.  So yes. Two stars. I'm hoping this was an off-night or that the menu has modified a bit [I'm pretty late on this review] similar to what happened at Grit & Grace after a few months. As you may recall, that first line up of dishes was also a hit and miss ensemble.  I will be giving Station another try soon with my Pgh HappyHour crew descending upon it later this month, but until then, a serious disappointment.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "X2AiYF7z32_0Oitl4aYXwg"
  },
  "br-U15g4wh7caFB_QHGy-A": {
    "date": "12/14/2015",
    "text": "UGHHHHH!! We had such an odd experience here!    We headed there on a Saturday evening around 10pm, excited to have an after dinner cocktail.  As soon as we walked in the door, a man with glasses jumped in front of us asking us barely audible questions about our dinner desired and honestly made us feel uncomfortable as we barely had time to survey the surrounds.  He was eager, but disorienting with the instant ambush technique and not the most helpful.    He scurried off when we mentioned we were only interested in drinks. The bar was packed and we spotted an open high top table (one of at least four open tables) and asked a waitress if we could sit there instead.  She didn't seem very sure if we could and told us to ask the hostess. The hostess is set in an odd location to the left and not easily noticed when you enter.  Hostess told us we couldn't sit there because it was reserved for potential dinner patrons. Normally, I wouldn't begrudge a policy of that sort except it was after 10pm and it's hard to fathom folks strolling in for dinner at that hour.  It's hard to explain but we just felt so uncomfortable we just turned around and left.  It was as if there was a private party... But there wasn't.  Maybe they just aren't coordinated yet.  But there were a lot of people talking about where we couldn't sit and no one telling us where we could sit.  I felt bad walking out, but we did and promptly went to acacia where we were welcomed with open cocktail arms.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "cAvlJ-lvBywOjcG1FTC_7A"
  },
  "o53Fx_KO5cjEeSzzv4nNVQ": {
    "date": "11/24/2015",
    "text": "Okay, let me start this review by first saying I've eaten here three times and I love this restaurant! Let me also say that I initially decided to rate the restaurant with 5 stars. The first time I came here, I ordered the pate as a first course and the chicken as a second course. One really has to try the dirty bread pudding accompaniment to believe how good it is. The second time I came I again enjoyed the pate so much that I got it again but this time enjoyed the pork tenderloin. The third time I returned, I know it shows a real lack of imagination, but I had to get the pate again. This time, however I had the poached cod. Unbelievable!  I have to say that the food is beautifully prepared. The Manhattans that we had with dinner were some of the best I've had in Pittsburgh, comparing very nicely to Butcher and the Rye which I place at the top. I do notice a subtle change in the attitude of the restaurant, however. This time, when we went, we were told by our waitress that we could no longer place our order for a first course, enjoy our drinks, and then place our order for our entree after relaxing over the pate. We were told that everything had to be placed at once. Now I get it, small kitchen. It's just that there's been a bit of a shift from a friendly atmosphere - to one where the emphasis seems to be less on the patron and more on the needs of the kitchen. Still, I guess they know what they need to get the job done. Fair enough.  When it was time to have dessert and coffee, we ordered dessert and each had a coffee. Again choosing to relax over coffee each desiring a cup and then a second cup we were told that $4 each for coffee ($8)  buys you one cup each. If you'd like another cup, well, you don't get another cup. Go ahead and buy another cup. $16 for two cups each of coffee does not seem reasonable. To be fair, we still enjoyed our meal. The meal was expertly prepared. The only problem is that we felt that $143 for 2 should entitle you to relax over dessert and a couple of cups of coffee for a few minutes. We left feeling unloved. Well fed, but unloved. 5 stars for the food -1 star for the lack of love!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "t0rIMuPRfnfqMNe5-2n5FQ"
  },
  "PGmyFsQAMW85vM0IFEgHOQ": {
    "date": "3/2/2017",
    "text": "I came in with high expectations and was disappointed. Both myself and my wife didn't like our meals. The place is cool inside and I did have a good old fashioned with dinner but the food was disappointing. It also seemed somewhat overpriced to us.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "x2m4algCjksl7lwDU3TXxg"
  },
  "UbqBfhOCtc8Wdd-JJrJffg": {
    "date": "10/25/2015",
    "text": "So good!!  I loved I could call the day of and get a seating for 2 at a reasonable dinner time. The interior is dark with dim lighting but has a casual and intimate feel. Loud at the bar area but quieter on the dining table side. Here is what we ordered to share between two: * Roasted carrot salad * Crispy wings * Tagliatelle * Lavender pound cake  All of which we loved!! The fried tofu in the roasted carrot salad was a pleasant surprise. The tagliatelle was rich so am glad we split - breaking the 1 hour egg just melted over the pasta and pulled pork. The crispy wings are on the salty side however I will say after we were done with the wings we asked for bread to sop up their yummy cheese oil garlic spiced concoction in the bowl the wings came in. The bread was thick, toasted and buttered so made the perfect accompaniment - there was nothing left in the bowl (or in any of the bowls we conquered)! And the desert made for a great ending.  Staff were all incredibly nice and informative - we will be back soon for sure! We are excited a place like this has popped up in Bloomfield.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 11,
      "cool": 9
    },
    "photos": [],
    "user_id": "57tf_RmT5o3BiFj2gpV-Jg"
  },
  "A3fo0JtUjgQJTA-uxtLjJw": {
    "date": "10/31/2015",
    "text": "The menu looked amazing, and based on the rave reviews, I was expecting more....a lot more.  The decor is very hip and pleasing to the eye. But the seating was not very comfortable and I was cold throughout my entire meal. Yes, I kept my down jacket on the whole time, and at one point I even considered putting my scarf on.  We ordered: -Chicken Wings: Great flavors, very unique, but overly salty. I kept thinking the entire time that it would be perfect if I had a big bowl of white rice to eat it with. (Yes, I love rice and I think it goes with pretty much everything. But more importantly, it would have balanced out the saltiness of the chicken.) 2 drumsticks and 3 wings for $11. -Roasted Carrot Salad: Again, very unique. The carrots were cold but there were a few small cubes of warm chickpea fritter. I liked it a lot. $9. -Tagliatelle: Loved the 1 hour egg. The pasta was a good texture; thick cut and al dente. But it was so overly salty that my dining partner and I had a hard time eating it. All we could taste was salt, salt and more salt. I think it would have been good if we could actually taste a flavor besides salty. $20. And to be clear, I am not overly sensitive to salt. It was just over the top here.  The service was good.  Not sure I will be back.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "g7S7fGfZC9ow_wIsK848MA"
  },
  "M2BCuneTq05TJFZguJknWg": {
    "date": "11/6/2015",
    "text": "Ok. Pretentious staff. Cool environment, but staff are driving a little too hard at the whole \"Hipster\" thing.  Everyone is dressed up to fit the part, but service not so good. Our server had an attitude like we were an inconvenience - was not good.  Seemed like her image/attempt to seem hipster was her biggest focus.  Food was good-staff is pretentious-price point way off.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "dr5MhFuPDZydQFa69MP44Q"
  },
  "87InQjeTmMBs_91XbXfb0w": {
    "date": "9/23/2015",
    "text": "We went to station for my birthday a few weeks ago. We were a group of 8 and sat at the high top tables on the bar side of the restaurant. It was a little loud, but not too loud that we couldn't still converse. We would have preferred to be on the dining side where it is quieter, but when you have a large group you take what you can get! My husband and I shared an order of wings as an appetizer and we both agreed that they were the best wings we've ever eaten. EVER! They had so much meat on the bone and were deliciously crispy. The flavor was also out of this world! For dinner, we also both had the Pork Tagliatelle. It was also a winner. It was a rich pork meat sauce with a one hour egg on top of thick ribbons of pasta. I got full and couldn't finish my plate and it was so upsetting because it was delicious and I wanted to keep eating!  The service was good, but we could have used some more water by the end of the night. All four of the glass carafes at the table were empty and the waitress never refilled or brought new ones.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 6
    },
    "photos": [],
    "user_id": "fhAk9y00oF5yvXwn8gl3JQ"
  },
  "XcOlVOPQIjZ-VgEva7lRcQ": {
    "date": "12/17/2015",
    "text": "Our favorite pittsburgh restaurant of 2015- well rounded with excellent cocktails and satisfying portions of delicious food. Nice hipster atmosphere.  Veggie perspective- I absolutely love the roasted carrot small plate (lovely roasted flavor with rich puffy chickpea puffs and yummy fresh cheese) which I get to share as an appetizer (loved even by carnivores) and I've gotten the caramelized cabbage and taleggio ravioli twice now and it is full of umami and super filling for someone who is skeptical of pasta as the only veggie main dish. Look forward to dinner here every time!  Carnivore perspective - my husband loved the grilled Bavette steak- perfectly medium rare and a great portion.  Cocktail lovers- the old fashioned here can't be beat- my husband often orders two or three of them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "WQDG1_b28izxQgj061FD2Q"
  },
  "8OMVv6yZQCjF20KVfpBjrg": {
    "date": "7/20/2017",
    "text": "Excellent happy hour specials! Friendly staff! The bartender made a really tasty Moscow Mule. My friend and I each got a meal and 3 drinks and our tab was very reasonable! Definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XWd-8s2r1Lx6Fz6oldzM-g"
  },
  "vrBoa2TTrQaymdoS1ypKGA": {
    "date": "12/19/2015",
    "text": "Despite living right over in Lawrenceville, I don't often find myself in Bloomfield. I'm trying to change that and thought Station would be a good start, considering all of the buzz I've been hearing about it. I've noticed when driving by that it always appears to be packed, so I made a reservation just in case (though it ended up not being necessary on a Sunday evening).  There are two sides to the restaurant: the bar (which also has some high tops) and the dining room. Being that it was slow, we were given a choice and opted for the dining room. The atmosphere of both areas is warm, cozy, and inviting.   The menu is not huge, but consists of dishes that cover a whole range of tastes and seems to be very thoughtfully planned. I had a hard time deciding, but eventually went with the tagliatelle (with smoked pork shank, soffrito, parmesan, and a 1 hour egg). The generous portion of pork shank was fall-apart tender and had a great smoky flavor. The egg was a great addition and was delicious with the rich sauce. There was a ton of flavor in this dish.  We enjoyed a beer over dinner, but next time I definitely want to try one of the cocktails (they sounded great). We were given great service and everyone that we encountered was very friendly.  I'm glad to have this as an option close to home for a nice dinner, and will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "J9OSJ7Xl9wnS0tL709AIqA"
  },
  "GQW94uGR-vIEAIo4mBNEGw": {
    "date": "12/10/2015",
    "text": "I ordered the chicken and my partner ordered the burger. By far one of the best burgers and French fries I have had the pleasure of consuming in Pittsburgh. the ambiance is a typical Castro pub with a dining room to the left to accommodate more seating than most. the dishes were inventive interpretations of classic pub dishes. The drinks were absolutely perfect. I had the tea cocktail and was pleasantly surprised. We will most definitely be returning with friends and family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "71FcU_uik5_RWinD8c8-OA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. The chicken leg and Brest with AU gratin potatoes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/71FcU_uik5_RWinD8c8-OA/o.jpg"
      }
    ],
    "user_id": "fU8qJksd9F-Sh-6ZnoNhAw"
  },
  "MQ59IokgwxJX3eRAkqbsRw": {
    "date": "10/8/2015",
    "text": "I really wanted to like this place, especially after reading the glowing reviews on Yelp. Two friends and I came here for dinner tonight in hopes of finding a new gem in Pittsburgh. However, I found my hanger steak too oily and our appetizer (corned beef tongue) too salty. My boyfriend had the station burger, but he found it hard to eat because the fries were covered with an excess of salt and his onions were nearly burnt. We all shared the lavender pound cake, which was good, but it had large chunks of salt throughout it. Through it all, our server was very kind and attentive. Overall, I want to like Station, especially for it's contemporary American menu, professional service, and stunning rustic decor, but sadly, the food here was too salty to ignore.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "rfFco6lZ59398G8rXgvkEw"
  },
  "uvoYOB9r4Am-zeoC3Xhn4g": {
    "date": "1/4/2016",
    "text": "I heard about Station through the Zagat's article and was excited to have a new dining option in the area! Tried it for dinner on December 21, with my husband and a friend from out of town.   The food here was great - I'm only deducting a star because the hostess here was so totally rude. She told us to take a seat in the bar area because the dining room was full. Apparently the high top tables are not part of the bar, because she actually scolded us for sitting there! My friend was so shocked by the hostess' rudeness that she was still talking about it halfway through the meal!  Anyway, I had the CARAMELIZED CABBAGE AND TALEGGIO RAVIOLI, which was delicious, and a really unique cocktail that had beet juice in it. I was very happy with both. My husband had the ROASTED PORK TENDERLOIN & PORK BELLY, which he liked - said the pork belly was nice and crispy - and the LIBERTY AVE. cocktail, which was a bit sweeter than he'd hoped for. My friend had the BUTTER POACHED COD and seemed very happy with it.  I definitely recommend making a reservation, as it was packed even on Monday night. I will probably go back - hopefully when a different hostess is on duty!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ql1LUL-zS8ChMIXra3r92w"
  },
  "ATfGevV21gzXvGACEBSNng": {
    "date": "9/25/2015",
    "text": "Station is absolutely fantastic. I knew I had to get there after they opened after trying their food samplings at the Yelp's Big Top event. I finally made it this past weekend and I was beyond impressed. The space itself is really gorgeous, and also quite relaxing. We went on a Sunday, so it wasn't super busy. But it was nice to see a few groups in the dining area.  To start I got the Louisville Lemonade cocktail, which is great and really unlike any other drink I've had before. My husband and I ordered the tomato Heirloom Tomato salad as an appetizer. I ordered the Tagliatelle for my entree and he ordered the burger. The reason I grouped all the food together instead of talking about them individually is, I just need to say about everything, talk about all the flavors!!! Everything, even down to the corn in the tomato salad, tasted incredible.  My entree though, amazing. I've never had a dish like this before. The one-hour egg especially adds something to the meal. I also got to try my husband's burger. He said it was definitely \"top 3\" of the burgers he's ever eaten. I loved that the cheese used on it was more of a spread rather than a slice.   We didn't have any room for dessert, although I'm sure that's great too. I can't wait to go back and try something else on the menu. Everything on it really sounds wonderful.  I also want to point out how attentive and wonderful the staff is. We had a main server who was great, and it seemed every time she was busy if someone else noticed out water glasses were empty or that our silverware had been taken away with our appetizer plates, they were right on top of it getting us whatever we needed. Someone that I believe was the owner even came over and asked us how our meals were and really seemed to care about our answers. Sometimes I know this can just be a courtesy question.  Definitely go here if you can.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "B3fVQWx-gb3ZEMwbjOjBrQ"
  },
  "aPwRc-L8fbJcywj81obckA": {
    "date": "10/13/2015",
    "text": "Nicely done, Pittsburgh. This was my best meal here and within (fair-weather) walking distance of our hotel, to boot!   Somehow the Courtyard Shadyside hotel fell into a weird no-man's land of the neighborhood, so very few retail or restaurants were immediately nearby. I got tired of driving most of the week and suggested to my colleagues this place, which came up in my under-0.8 mile radius search. It had what appeared to be an optimal nexus of walking distance, alcohol, and good food.   I'll fluff my feathers a bit and say my colleagues were happy about the choice, too.   Between the confit wings appetizer and my crispy chicken breast dinner, I may have gone too heavy on the poultry, but it was delicious nonetheless. Those wings... man, that was good. I guess I characterize most gastropubs as \"fancy versions of pub food\" and these wings definitely qualify. Still messy, but a much more sophisticated flavor profile. There was parmesan _foam_.  The chicken entree was probably disproportionately large/hearty compared to the other dishes (it was probably double the size of the others. Two in our party ordered the tagliatelle, which the waiter said was her favorite... and I wish I'd taken her advice), but I still enjoyed the flavors.   I also enjoyed that the wine list had at least two wineries near my parents' house in California. Not a selling point for the general public, but I was surprised to see small Sonoma County wineries on the relatively short list... maybe they have a great distributor or something, just didn't expect that in Pittsburgh.  Friendly service, nice ambiance, tasty menu. Get at it, Pittsburghians!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "2xb2kHnC-mFhtGggWBhZFQ"
  },
  "gNAc0Dmgzu-L_qSI8lC78A": {
    "date": "1/9/2016",
    "text": "Solid 4 stars. Nice vibe. Went with a group of 5. Was sometimes a little difficult to hear each other but we managed. Started with liver mousse, the miso apple, and the roasted carrots. All were good but the roasted carrots were my favorite. The two other dishes were a little too creamy and blunted some of flavors I was expecting. For entree I had the cod. It was perfectly cooked and seasoned and the sides that accompanied it were scrumptious. My friends got the ravioli and tagliatelle. Ravioli was good and the bread crumbs added a nice crunch but I wish the Caramelized cabbage was showcased more. The tagliatelle was also good but too rich for my taste.  Overall, fantastic experience. Definitely worth a visit. I will certainly be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "war8vMvCDNuVaB5FQ-ObcQ"
  },
  "GdYeJvN-GbPoVcud1uJK6g": {
    "date": "11/12/2015",
    "text": "The starters/small plates were downright phenomenal--the carrot salad was incredible (creamy, almost tofu-like chickpea fritters!), and the beef tongue was an indulgence in beefy deliciousness perfect for a cold fall evening. While the entrees (chicken and pork) were pretty tasty, they were much less inventive--we're fortunate enough to have a sous vide setup at home and the entrees were things we could fairly easily recreate.  Our server wasn't overly friendly but the food runner was incredibly gregarious, chatting with us about the preparation of the food and making additional recommendations. If he's not also a server, Station is not making enough use of his talents! He also talked us into dessert, and the caramel popcorn panna cotta was really tasty. However, the vessel used for serving isn't particularly conducive to experiencing the carefully flavor-balanced layers--the popcorn is so deep in the narrow container that you don't get any panna cotta until the 4th or 5th spoonful. Fortunately, we picked off some of the popcorn so we could enjoy it all the way down. If you're a fan of less sweet, more balanced desserts, I heartily recommend it.  Drinks were excellent, and the bartender was happy to make classic cocktails in addition to the interesting libations on the menu. I'd absolutely return for small plates and drinks...and perhaps another panna cotta. It's worth mentioning that this was a Wednesday night around 8pm and while we got a table, they were still nearly full...glad to see they're getting the foot traffic they deserve!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ri4xmSrehzGEqbR1EWAhAw"
  },
  "TVgOLGaf7LH8_g9mFCnvaw": {
    "date": "11/18/2015",
    "text": "Lovely, old world modern decor...New York atmosphere.  For drinks, I told the waitress what I liked (normally a dirty martini)...she offered to have the bartender create something for me....which was absolutely fabulous!  In was served in a romantic champagne looking glass and along with the bartender's creation he included both vodka and gin. Had 2, by the way.  Our dishes were absolutely fabulous (overused description, but so True).  I'm a vegetarian, so I was somewhat limited to ordering the ravioli...but it was worth every bite and every penny.  My friend tasted mine and said his was even better.    As an appetizer we shared the roasted carrot dish and it too was delectable.  All in all, it was an outstanding meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lT1K7uqkRnB9aND3UvUx5g"
  },
  "2ntdaCBvXvX646kNQdANMg": {
    "date": "5/3/2016",
    "text": "I've been to Station twice, once just for cocktails at the bar and a second time for a meal. A few friends and I came here on a Sunday and it was basically empty. From what I hear, Station is typically very busy and you may want a reservation.  So I'd like to preface my complaints about my meal by saying that I love salt and have always been pretty heavy handed with salt in my own cooking. So much so that my family jokingly calls me the \"Salt Queen.\" That being said, I found the tagliatelle (with smoked pork shank, soffrito, parmesan, and a 1 hour egg) to be too salty in a way that really overwhelmed the other flavors in the dish. My friends both commented that their entrees (the burger and the one vegetarian option) were also heavy on the salt. To be fair, I LOVED my starter which was the endive with pickled egg and gorgonzola. I paired my meal with the pinot noir which at $8 a glass was an excellent value for a very drinkable wine.  Service was very attentive both of my times here. Ambience and atmosphere is great. If you're a vegetarian or have dietary restrictions call and check about their day's menu ahead of time because it is quite limited. Overall, worth checking out but not a place I will be rushing back to.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "DnU3dz1nknbbskRFeR0dgg"
  },
  "E9ImP2JQqgTCBDmzgmZhew": {
    "date": "6/25/2017",
    "text": "The burger was unmemorable. It was also completely dead on a weekend evening which should have been a red flag. We were in and out within forty minutes.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JRwacA7kVVeP_L42hM8hlQ"
  },
  "aexRjxB_FZqNVnVT8b7Vdg": {
    "date": "1/14/2017",
    "text": "Creative, fresh, unique food, the best bottle of Malbec I've ever had and attentive service prevails over absurdly long wait times and a meal that lasts almost 4 hours:  I'll start with the good. The food is phenomenal. For me, the best part is that the menu is filled with items that I would never make at home, and probably couldn't even if I tried. Went as a first timer during restaurant week so I was able to sample a salad, main course and dessert. I went with the roasted carrot salad, as did my friend sitting next to me, and we agreed it was pretty gosh darn delicious. My favorite part was the chickpea fritters, which served as a sort of fried doughy crouton. Yum. For the main course I went for the Dill Rigatoni and let me tell you, I almost licked my plate clean. I'm so not used to these flavors with pasta but everything worked together beautifully. I especially loved how, for a pasta dish, it still felt like a light, airy meal. No complaints other than I usually like my pasta cooked a little more al dente but that's hardly even worth mentioning considering how great everything else was. Dessert was the caramel popcorn panna cotta. Served in a mason jar this dessert is probably one of the more adorable things I've consumed. Topped with salty Carmel corn the whole thing was melt-in-your-mouth amazing. Washed this whole meal down with an incredible bottle of Malbec (priced fairly at $36... we got three) and I can say this meal was truly top notch. Note: Friends also raved over the chicken liver mousse, corned beef tongue on toast, and crispy wings. Highly recommend all three.  The not so good: Went with a group of 8 during restaurant week. I know what you're thinking but in fairness the place was not overly crowded and I don't think we made any outlandish requests during our stay. Our waiter, when we saw her, was attentive but the problem was that we waited up to an hour for requests and orders. After a round of drinks we put in salads and appetizers, those took an hour. In between courses when we wanted drink refreshes, it seemed to take forever. It even got to the point where we felt like we had to order another drink when our current one was half full. The whole meal took almost four hours and while I love sitting around a table with my friends enjoying a nice long meal, this felt a little more like our party had been tossed aside. Going back to the waiter, she was nice enough to comp a drink that took especially long and split up our bills with extreme precision. She was fun to talk to and super nice. I think the wait time issues may have been coming from behind the scenes. But really, no way to tell. On top of it all, the whole wait time situation was never really addressed. Nothing like \"hey sorry guys XYZ is taking a bit, we'll have it right out\" or anything like that. Eventually when everything was finished up, we walked out in grumbly frustration rather than riding high from an exceptional meal, which is sad considering everyone really really loved the food and drinks.  To end on a high note: the only reason this place didn't get my five-star rating is because of how long everything took. The atmosphere is awesome, the place draws a really cool crowd and serves amazing cuisine. I would happily go back, but maybe without any after-dinner plans in case it ran long again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1qDYFvYzhwKSaITGAvJ-rw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Dill Rigatoni - light, airy, and went down fast!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1qDYFvYzhwKSaITGAvJ-rw/o.jpg"
      },
      {
        "img_id": "-XWAN75_GG8ZG7Ywrs6N2Q",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Grilled bavette steak",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-XWAN75_GG8ZG7Ywrs6N2Q/o.jpg"
      },
      {
        "img_id": "jHo_G1eFy_fg517KwRRoHw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Beef cheek - restaurant week special not usually on the menu. Friends raved about it.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jHo_G1eFy_fg517KwRRoHw/o.jpg"
      }
    ],
    "user_id": "z6zOtpIXMdbx_cN_wtGQ-w"
  },
  "5kOeJJ-hlMAm1u-I1pcTmg": {
    "date": "6/24/2016",
    "text": "Exceptional quality food. I'll be going back at least twice a month. I've only been here once and it's already in my top 5 in pgh. Go here",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jsNwXWS_Q0tX7oBak-s-Kg",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Ramen night menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jsNwXWS_Q0tX7oBak-s-Kg/o.jpg"
      },
      {
        "img_id": "n9TJg-JONzU_brvCY-F8zQ",
        "caption": "Photo of Station - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n9TJg-JONzU_brvCY-F8zQ/o.jpg"
      },
      {
        "img_id": "1F_ADoxG2vstZmArDIwExA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Miso dressing w radishes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1F_ADoxG2vstZmArDIwExA/o.jpg"
      }
    ],
    "user_id": "JTXpFVACryRLyWcMaEfGtQ"
  },
  "LgIRwRxvcS98JDepxRawsg": {
    "date": "9/26/2017",
    "text": "Fantastic food at a price that isn't crazy. The artistry and care in the fare here is noticeable the second your plate comes to be set in front of you. Their ribs and chicken wings are phenomenal. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FIVmmjlXYJ3Ce3smEXtCmQ"
  },
  "P-OYrqf5UDUN0DsGmDd45w": {
    "date": "8/13/2017",
    "text": "Best hamburger ever - asiago fondue,onion rings with onion jelly My family also had a great salmon dish and a braised pork pasta with a poached egg.EXcellent craft beers and great service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3JLusOY8FkjcvEoTAVO00A"
  },
  "WjOrfbTOUw3oWrQPkE2YQA": {
    "date": "4/7/2018",
    "text": "Great food. Great staff.  Loved the 3 course option and the Moscow Mule was perfect!  The SQUASH AND BARLEY RISOTTO was delicious.  We can't wait to take some friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j6tqaxxd-qTVeF7q62sbjQ"
  },
  "9Dfwh5c8KMvZR2KcFDZzvQ": {
    "date": "10/16/2017",
    "text": "This place is great. Fresh food, great atmosphere, and a pleasant staff. I couldn't have been happier to go on a date here! I'd definitely recommend the Tagliatelle and popcorn panna cotta! Divine! Parking might be a little tricky on busy nights, so, plan accordingly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z1l4HncqDFzqTEOz9Zo-0A"
  },
  "n9OwRYjubVY140cB3ECSyw": {
    "date": "5/17/2018",
    "text": "Amazing staff always going above and beyond to accommodate the group I make dinner reservations for. We've hosted several dinners there with out VIPs and heard nothing but good reviews on food, service and atmosphere. Dietary restrictions across the board and everyone can find something delicious they are telling ppl about days later. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ifrX6zcxIEI-K2XyArd8Mg"
  },
  "rBl_i29UksOdgwNGdLAw7Q": {
    "date": "1/30/2016",
    "text": "My mistake was reading all of the Yelp reviews for Station before I went because my expectation level was high.  I met a friend for an early dinner on a Friday night. It's close to a parking lot (convenient) on Liberty.  We had a reservation and were seated promptly.  The dining areas and bar are smallish, but it was okay and didn't feel cramped.  The decor is cool and trendy. It's a very pleasant space.  We were greeted promptly by our server, and they had a nice craft beer and drink selection.  My friend ordered two small plates (the liver mouse and the endive), and I got the Station burger. You know... I just expected more based on the reviews.  Isn't that sad? The mouse was fine but mostly overpowered by the heavily buttered, seasoned, and salted bread.  I didn't try the endive, but it was a bit sad, small, and seemed overpriced.  Maybe it was amazing and I missed out.  My burger was flavorful and good, but again, the bread was heavily buttered, heavily salted, and overpowered the flavors.  Guess what the fries tasted like? Salt.  I'm Southern.  I love butter and salt.  I require salt to prevent hypotension.  But I felt like the food we had relied too much on butter and salt, which is a cheap trick for a moderate-scale restaurant.    I feel bad that I didn't love Station.  My friend loves it.  I wanted to.  I waited to write my review to be sure I'm not being unfair.  Since I was at Station, I've drunk water like its my job.  I just didn't love it. Sadly... I'm sure.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "us0CgncpaRvCZRp9Sqzezw"
  },
  "JvvIr3HJ8Z5vx6N9cMlr3g": {
    "date": "2/18/2018",
    "text": "Nice place! Delicious beautifully presented  food! Chicken liver mousse is just amazing! Never thought it can taste like an ice cream!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RC6oUGxHihtwPxEBKCfv0Q"
  },
  "PgdPD2mbukfxS3yQa0fvhg": {
    "date": "5/17/2016",
    "text": "Station is a GREAT addition to Pittsburgh. My boyfriend and I went for an early dinner on Saturday and grabbed seats at the bar. The bartender (who we later found out was one of the owners, Justin) immediately started chatting with us and giving recommendations on their menu as well as for Pittsburgh in general. We're fairly new to Pittsburgh so we always love getting local insights!   We like to share multiple dishes so based on Justin's recommendations we went with the carrot salad which he said was probably the best item on the menu, the wings, and the crispy chicken leg/breast dish. We also had to try the chicken liver mousse after reading all of the Yelp reviews. Best dish on the menu was an understatement, the boyfriend said it's possibly the best dish he's had in Pittsburgh. The combination of the carrots and the cheese and the sauce and the chickpea fritters, oh my! We already plan to get more than one order of this next time. The wings had an interesting Parmesan foam which set them apart from other garlic wings, and the sides with the chicken entree really complemented the dish. The chicken liver mousse had a very distinct taste that I enjoyed, though I can see why it may not be for everyone.   We were hoping for port as an after dinner drink but they didn't have any, and we weren't familiar with the other selections so Justin gave us a couple tastings of amaro and campari followed by a complimentary shot just so he could join in too. They weren't for us so we ended up ordering station sours from the cocktail menu to finish to our night, BUT THEN Justin brought out an order of the popcorn panna cotta on the house. If the carrot salad isn't my boyfriend's favorite dish in Pittsburgh, this dessert is. The crunchy caramel popcorn with the creamy panna cotta was the perfect combination. We don't usually even order desserts, but I think we're now stuck with getting this any time we go back.   Overall this has been our best restaurant experience since moving to Pittsburgh and we've tried quite a few places. The couple standout dishes plus the awesome service made this a place we will definitely return. Can't wait to try their brunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VPryWejfgtEZB9BRcTrCmg"
  },
  "vhxcclDm0foAD7EmT08lGQ": {
    "date": "1/3/2016",
    "text": "I'm not sure what I was expecting of Station, but I can say I was underwhelmed. I was thinking Station was more of a restaurant with a bar, but it turns out it's a bar that serves some food. It's clear that more attention was paid to the drink menu than the food menu. The food menu is limited and incredibly overpriced for what you get.   I had ordered the crispy chicken breast and leg and for $24, I should have had more than an anemic leg and three slices of chicken breast served over mushy leeks and what was described as squash but it all tasted of leeks.   The interior is a cross between post-modern industrial and early 20th century traditional, i.e. classic hipster. I felt like I was in a movie set as Station felt more of a facade or pop-up than actual restaurant with staying power. The TVs placed over the bar really knock this place down several notches. You're either a sports bar or a trendy restaurant, not both. Restaurants with TVs are not worthy of $24 and up meals on the menu.   There are very few seats and we were directed to the  bar to eat since I'm assuming the four empty tables were for reservations. The staff were somewhat friendly, but pretentious. I really didn't feel welcome.  I waffled between two and three stars on Station. The food wasn't awful and my drink, while mostly ice, still tasted good.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 2
    },
    "photos": [],
    "user_id": "A0Tkq4VV8dD6t8NbBxvBPA"
  },
  "o0yvNz-FaBV3xFUZW0dHqg": {
    "date": "1/3/2016",
    "text": "After hearing people rave about the food here, hubby and I decided to check this place out for our new New Years Eve tradition of getting a burger.  We headed over and thought we were in trouble when we walked in and were asked if we had reservations (as we didn't have any). Fortunately for us, we walked it right at 9pm and apparently someone had just cancelled their reservation!   We were seated promptly, and the host kindly took our bulky coats, which was something that I did not expect here, but truly appreciated it.  The place was pretty packed and the decor was pretty awesome, had this old fashioned feel with a modern twist.   The waiter immediately served us water and left to give  us time to decide on drink orders. Now, this place has some outstanding cocktails, had that experience a few months back when I came in for the first time. But instead of cocktails we opted for beer to go along with our upcoming burger selection. Their beer selection was pretty decent and the prices were not too bad for a place like Station's caliber.   Anyway our drinks came swiftly and placed our order for chicken liver mousse and two Station burgers. The chicken liver mousse presentation was pretty impressive. Had two large toasted sourdough slices that were propped up with the aide of the mousse...kinda looked like a tasty butterfly. It was garnished with some coriander mustard, kohlrabi, and some brown butter crumbs. Let me tell ya, if you are a fan of chicken liver mousse (and few people are) then you need to get yourself over here. This mousse was not overly powerful, it was exquisitely balanced with the bread and the crumbs which added layers to the texture.... this mousse was absolutely amazing, probably the best I've ever had.  I would honestly return just for this appetizer. Fortunately I have more than one reason to return (besides the cocktails) as the burger that followed this was just incredible.   After finishing that mousse, the burger followed. Oh. My. Freaking. God. this thing was massive, not only massive but impressive to behold. The bun had this beautiful golden color. The caramelized onions that were on the bottom were perfectly caramelized, the burger patty itself was cooked medium rare as requested, the cheese....oh the cheese it was so freaking good, it was like goat cheese, but upon looking at their menu it was asiago fondue topped with some giant onion rings. This burger had a sauce on the side, but honestly I didn't see the need to mess with something so naturally delicious. But this is not all.... then there are the fries...oh the fries. This is something I consider to be one of my weaknesses when I am attempting to eat healthy. Well healthy went out the window with these fries which were seasoned to perfection, and had some herb which I will guess was parsley. The texture of said fries were again perfect. These fries were magical I honestly thought fairies made them.   Our overall experience here was outstanding. The service, the ambiance, and the food all were excellent. I couldn't ask for a better restaurant experience. I honestly think I found my new favorite restaurant.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "xtHAcRICYX4HKDkX0Gb8wA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. Station burger. Best burger ever.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xtHAcRICYX4HKDkX0Gb8wA/o.jpg"
      },
      {
        "img_id": "1L-mHJHib45mI-0UForBYw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. The most amazing chicken liver mousse ever.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1L-mHJHib45mI-0UForBYw/o.jpg"
      }
    ],
    "user_id": "i3lHb48oSkgrjFuA1t4ApA"
  },
  "ft9uNhFlnsAQKgmmPm_IhA": {
    "date": "1/15/2016",
    "text": "Considering my friends and I ordered over half of Station's menu in one night, I figure I might as well write a review, right?  Here's how it went down; 4 people, 3 appetizers, 4 entrees, and 2 desserts. All shared family-style.   SERVICE: Our server actually encouraged us to split dishes before we'd even mentioned it, and she brought us plenty of extra plates and serving utensils to do so. She gave us great recommendations, was very friendly and attentive the whole night, and even brought us extra toasted bread when we asked. Couldn't have asked for more from her. :)  FOOD: My impressions are kind of mixed on the food... there were one or two things I loved, but some I was less crazy about.  - Appetizers: the chicken wings were nothing special, and the beef tongue was alright. If I had to order anything again, it would be that chicken liver mousse. As creamy and flavorful as you'd expect!  - Entrees: the pork and steak were just alright (a bit salty). The tagliatelle was pretty delicious (especially that 1 hour egg!). However, the highlight of the entire meal for me was definitely the butter poached cod. The buttery smooth texture instantly won my heart, and I wish I could have ordered it all for myself! - Dessert: with only two dessert items, we felt like we had to just try both. They're entirely different; while the lavender pound cake is more refreshing (especially with the pineapple), the panna cotta has a strong, rich sweetness. Even as a big dessert person, I personally don't think they're must-haves, especially if you're satisfied from the previous courses. The selling point seems to be their uniqueness haha.  Overall, I was kind of hedging between a three and four star rating. I'm not necessarily dying to come back and try anything else... I feel like I hit most of the highlights here. If the menu changes up, I'd consider trying Station again, but I'd be more choosy about what I'd order.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "U_HrY74wXe9wFhjKoRJAMA",
        "caption": "Photo of Station - Pittsburgh, PA, United States. the tagliatelle is great if you want something a little more filling for your meal. the flavors and egg are delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U_HrY74wXe9wFhjKoRJAMA/o.jpg"
      },
      {
        "img_id": "wk44L6SNCwL6jma-3sJ59g",
        "caption": "Photo of Station - Pittsburgh, PA, United States. don&amp;#39;t knock the chicken liver mousse until you try it.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wk44L6SNCwL6jma-3sJ59g/o.jpg"
      },
      {
        "img_id": "v787kBmZhfd6le8CYZQOMw",
        "caption": "Photo of Station - Pittsburgh, PA, United States. while the butter poached cod is the most expensive item on the menu, it was also my favorite by far!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v787kBmZhfd6le8CYZQOMw/o.jpg"
      }
    ],
    "user_id": "IhB3dvBjH5gWp__Ae1VxIw"
  },
  "fAYlrq3Htdqw3E2JaT8WiA": {
    "date": "3/10/2018",
    "text": "This restaurant is a must try in Pittsburgh! We had our rehearsal dinner here for our wedding over the New Year, and the Chef Curtis was extremely easy to work with and made a menu that fit our comfort level and style while being extremely unique. Every bite was incredible, from the appetizers to the dessert. Our guests said it was he best overall meal they had ever had. Curtis is extremely creative with his dishes, making them look extremely appetizing and tasting incredible. We will certainly be back, and continue to come back to Station!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wqCSvxqJw7YU9qp7hlJSUw"
  },
  "FOOon2FbdX_ASh4aCzzW3g": {
    "date": "12/31/2015",
    "text": "I was going to give it three stars, but the perfunctory check delivery without even a \"HEY, F*CKERS, ARE YOU DONE YET?\" pissed me off.   The food was OK. I mean that. It was fair. I was not blown away. The flank steak with a fancy name was flank steak with assorted mushrooms. I had higher hopes for the accompanying bits like the \"garlic custard\". Custard my ass.   My dining partner thoroughly enjoyed her dish. Or maybe she was just being polite. She's polite.   We had some starters too. I can't remember what they were, because see above re: OK/fair.   The cocktails were also unremarkable and inoffensive. My first was way too sweet, but some people like sweet.   Draft beers were ok, but I think their draft system is putting out too little CO2.   So, food-wise it's deserving of a solid three stars, as noted above. HOWEVER, our server was a complete dick. He was inattentive and generally attitudey. I get it, we're lowly paying customers, but Jesus Christ dude, try being slightly personable. Give me a little info about the entrees, deliver starters to each diner at the same time, don't drop the check at our table in passing assuming that we were done spending money. The fact is, we weren't. However I'm more than happy to take my remaining dollars elsewhere and will ensure that future dollars don't end up in your employer's coffers.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "f4OOZxwwUSSA-tqOndpmCA"
  },
  "LlQAtbeUedP0YV7iF470Cg": {
    "date": "3/10/2017",
    "text": "Not impressed with the burger. Bartenders were not friendly to bar customers. A few decent cocktails. Food is hit or miss.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "AemcaZdZBVW7sO9KsT3UnA"
  },
  "-Lqz8byGTobM7S54MJYGLA": {
    "date": "10/21/2017",
    "text": "Went here with a colleague and faculty we wanted to impress, and impress we did! The food was top-notch; the wine and liquor pairings were on-point; and our main waitress was very knowledgeable about the drinks and the food. We all did the tasting menu; excellent price and so very delicious. I had the carrot salad--a must-try. Unique dishes with twists on favorites (salmon, risotto, beef ribs). I don't know why this place wasn't packed on a Friday night, but people are missing out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4RLvq7JSWvPyjOIRtfl5mw"
  },
  "H7Sdu_EeK20lYpsZRbp_gw": {
    "date": "2/20/2016",
    "text": "This restaurant is one of the places that has put Pittsburgh on the map when it comes to world class cuisine. It is as good as it gets and you will not be disappointed. Take the time to talk to your server about the food and the preparations and you will see how amazing the process is. They will also not lead you astray with recommendations. We liked it so much we even got a chance to talk to the owner, who was very gracious and sent our regards to the chef.   Make reservations a head of time! I have also been told they have a great happy hour special!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "vfPUBDkKsWBb2YOKXG8r5w"
  }
}