{
  "LtAXryEx6E2s2k8aIh2Pwg": {
    "date": "9/9/2017",
    "text": "Careful with how you pay here. The servers will charge you the incorrect amount. I was charged $91 on a $19 bill and they refused to issue a refund. If you go here I recommend pay in cash.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3yHKLsFuiNLJw-GABzdH6w"
  },
  "BMwLpxkpA6b4a_zS-wLSWA": {
    "date": "8/25/2016",
    "text": "I have been here for both brunch and dinner. Let me tell you, it was amazing! My friends and I ordered a few things on the brunch menu to share (it all looked so good) and it was delicious! The brunch burger, chicken and waffles, French toast, Belgian waffles with berries, and the big Bloody Mary! Try the St. Chelsea on the drink menu and thank me later.  When I went for dinner I had the signature Twelve whiskey BBQ burger and a side of Kansas City cheesy corn. The burger was melt in your mouth good and the cheesy corn is addicting.  Great atmosphere, polite staff, great food. It's my new stop when I go to Southside!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EC4q4rBleoP8b9vgI7-7vw"
  },
  "OygQW5bd5FPA2W_tYwSDPw": {
    "date": "7/22/2017",
    "text": "Twelve recently added outdoor seating which is absolutely phenomenal. I recently gathered with some friends outside on a Thursday night. It took a long time to get a server outside and there was not a large selection of whiskey on the menu. We ordered our drinks inside of the bar and brought them back outside, I was really impressed with the bartender because she was attentive and really sweet.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8B3hGCIDhKlK34EdDQUKEA"
  },
  "JEc4ThIJmkHjsRTyUTeWfg": {
    "date": "6/26/2017",
    "text": "Heard a lot of good things about the food so decided to try.. Everything we ordered was sooo salty, including the marinara sauce for the cheese sticks..  just could not even finish our food. Def a salty food lover but that was just too much. BBQ sauce wasn't even noticeable on the sliders or sandwich. Overall could have been good but just wasn't. Hopefully it's better next time around..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EsWmsTkxgbDqmypnvdl8pA"
  },
  "Ivu-3m87juLxPscPYPfptg": {
    "date": "11/17/2017",
    "text": "This place is really underrated.  Great food, great service, always a pleasure. The burgers and nachos are can't miss. Drinks are strong and beer selection is great. Strongly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nZtw5p27KSl6D4qPJIjSCw"
  },
  "mu0SviBLmcpOKBEx5_UTbg": {
    "date": "8/10/2016",
    "text": "My friends and I wanted to go somewhere new in the southside. I checked yelp and it led me to this place. I can say none of us were disappointed. On Tuesdays they serve platters of nachos & margaritas for $5.00.  Their menu is small, but they can customize anything. I was trying to eat healthy and the waitress suggested two items that were not on the menu and had them made to order for me. Which is always a great sign of customer service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y5SHjnFi5P2BytM5lPBnBQ"
  },
  "GAJgxcD82G0TWZ3SGqInNg": {
    "date": "6/9/2017",
    "text": "Ok I got the brisket . Omg Can you say MOUTH WATERING! So tender, so fatty, such flavor! I had a pickle on a stick and green beans for my sides and my friend had The Twelve Whiskey Burger (which I took a huge bite of) and it was equally delicious. I'm definitely going back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "L24Vrr_DixHeSEFZrZF72w"
  },
  "_t72BD3gv9DElZK44SO4vw": {
    "date": "3/18/2017",
    "text": "My girlfriend and I stopped in here for a quick bite and a drink. After sitting at the bar for 10 minutes the bar tender handed us menus and said nothing and walked away. A few minutes later she asked us for drinks. My girlfriend and I ordered beers and she asked for our IDs. My girlfriend handed over hers and the bartender asked for a second form of ID and she handed over a college ID.  My girlfriend said, \" I'm 28 years old and my birthday is .....\" to which the bartender responded: \"if you're 28 years old what are you doing in college still?\" If she actually understood how college and graduate programs work then maybe she wouldn't be a bartender at a bad bar. They can keep their overpriced BBQ and domestic bottles, we will go to the smiling moose instead.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Yv4GHPhHkc351LgWrvo5Q"
  },
  "j_kYIBGwbiIIkdP_lm8r4Q": {
    "date": "7/28/2017",
    "text": "Amazing brunch $15 32oz bloody Mary with a grilled cheese, a slider, french fries and other good stuff in it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QfLB2z5JFb4Uo8ZZ9rLiyw"
  },
  "Otts1F_5lMNVf4BwQvhQLQ": {
    "date": "3/19/2017",
    "text": "The bartender took ten minutes for menus, then proceeded to not understand how to read an OH state ID. This to me was ridiculous (being that I'm twenty seven years old and a bartender on state lines myself.) I gave her my college ID. She then proceeded to insist for a third ID because if I was actually 27 how could I still be in school? Clearly she had never heard of a graduate program or a non traditional student. Obviously after that type of insult and idiocy we left and gave our business to another bar. Worst experience ever.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lnzoy_Tq-DDiWluzwMZT2A"
  },
  "B_3GGXWn-GLb9uIbLlUYzQ": {
    "date": "3/20/2018",
    "text": "They have some good food, I'll definitely give them that. They have the WORST service you can get. Their food proportions are never consistent. I'll be sitting at the bar with an empty water cup and beer and they will just walk right by multiple times without asking if you need anything. Save your money and go somewhere else",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KZBlUvyzm_3oM27BMNhPOQ"
  },
  "9NqEFhnz1VEClqhBY2GK2w": {
    "date": "12/3/2016",
    "text": "Love this place but had really bad service a few weeks ago. Had the worst Bloody Mary of my life! Then the waitress brought my husbands lunch out, which was a burger..but it wasn't the type of burger he ordered when he cut into it...(had a fried egg on it and so forth)...the waitress realized her mistake, took the cut burger sandwich from us and served it to another table...DISGUSTING!!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "ijrB0iOx2Rrjwx7cuJwhAw"
  },
  "hA2XKHbPOZtNtu-g-QWkZQ": {
    "date": "8/27/2016",
    "text": "Dj's are amazing, brunch can not be beat! Overall a great experience. Definitely worth visiting if you have not been, I guarantee, you will become a regular.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CHiCdh-6CKtGti-jGGzCeA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CHiCdh-6CKtGti-jGGzCeA/o.jpg"
      }
    ],
    "user_id": "JC0YSIS9duYDhi7aywk4oQ"
  },
  "FDnnCHaORaASz2bfgREXyw": {
    "date": "3/8/2017",
    "text": "The food was terrible. It taste like it was flash cooked in a deep fryer. I had the macaroni with crispy chicken tenders and they were so greasy. The mac was a stomach ache waiting to happen. I gave 2 stars because the drinks are really good. I would not recommend to eat here but do stop in for a drink.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x3yg1CtprSEaHzh61YpMtg"
  },
  "7kZ5M5U4ecMiKlvDpUrVEg": {
    "date": "2/25/2017",
    "text": "Burgers were phenomenal.  Pulled pork and slaw on one with a great smoky flavor enhanced by their homemade bbq sauced.  Other with a honey mustard bbq sauce and smoked brisket, a tad overcooked but really good flavors and still juicy and delicious.  A little understaffed for a Pens/Flyers outdoor game but everyone was very friendly and helpful.  Beers had a good selection as well.  We're coming back again for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cY9rU3IGEMCcRHsZ8e8_sg"
  },
  "l5SDihX2_s7Zmei8aKXjig": {
    "date": "8/17/2017",
    "text": "I made a few of my friends go there with me for my birthday.  I wasn't sure what to expect.  The food was amazing and their drinks are delicious.  The service was so-so.  But the next time I went in, I was alone, the service was impeccable.  It is very possible it was just a busy night or they were short people the first time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z9f8zpd7IYIHbqObb9wZ2w"
  },
  "_MQLmkkPKBo5ibPaidZZCQ": {
    "date": "8/15/2017",
    "text": "The only reason I'm even giving this place 2 stars is because of their food and drinks. Their service however, is probably the WORST I've ever had. I used to (emphasis on the tense) go there every Tuesday for trivia night (the guy hosting is awesome). My service has been absolutely horrible every time except for once when a girl named Jess waited on us. The rest of the waitresses are completely incompetent and utterly rude off the bat.   When we began ordering appetizers the waitress stopped us and asked if this was \"going to be complicated or not.\" She then forgot to put in an order for 1 of 3 appetizers ordered. It took about 15 mins after getting 2 of them, to even bring that to her attention, for which she didn't even apologize. After 35mins and someone else bringing our food out, we finally had to go to the bar and ask someone to come take our drink orders, a task that was also messed up (I ordered their special of Big ass margeritas to which I received a small mason jar of mostly ice). They told me it'd be free, but it honestly wasn't even worth that. After that, the only time I saw our waitress was when she was visibly talking about us and pointing with another waitress. Completely unprofessional. A different waitress had to bring us our checks and messed that up too.   I had this same waitress the Tuesday before accompanied by the same crummy service. That's when I realized that it wasn't just a bad or busy night (it was a Tuesday for crying out loud), but that this woman is just REALLY bad at customer service. Definitely do NOT recommend going there!!! Don't know exactly which was our original waitress but our checks said Joanne G.   Will also be posting my experience on your Facebook in hopes that you get better trained and caring staff.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8pv8leqC1AVx1KgefjM8sw"
  },
  "Oq9cOdrZGibgdNjLuK-Lmg": {
    "date": "8/11/2017",
    "text": "50 cent wings..cant beat. Good as well. I would have preferred my ribs grilled but they were smoked. They were good..little to no fat on them",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0KTev8zr6R4wwvbPwieohg"
  },
  "HD3qVuviENzXC-oXKZpw-w": {
    "date": "5/21/2017",
    "text": "Went on a Saturday afternoon and wasn't starving so went with the chicken fingers and waffle fries. Fries were hot, crispy, and delicious! Chicken fingers, while only really warm, were surprisingly very good. Seem to be fresh made in house versus frozen in a bag. The chicken was huge and was crispy with a great flavor. My friends ordered a brisket salad and a brisket sandwhich and also said their meals were very good. Would definitely visit again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "12V2mfSc_elHNSO-FPNQNg"
  },
  "3ekYijOuVkmesiNJxiHcpQ": {
    "date": "1/16/2018",
    "text": "Food and drink were awesome.  However,  the music was blaring so loud I couldn't carry on a conversation at our table without screaming.   Tone it down a decibel or 2 and this would be 5 stars!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rxWmqVMAcUaZtOV4rQyZ4Q"
  },
  "ejF7cugDoANn0TKjLKdDLQ": {
    "date": "1/29/2018",
    "text": "From a few years back when it used to be 12 on Carson St.  In short, same place different name and same owners. No difference.  The place is still extremely racist! I just recently wrote an  unsatisfactory review just about a month ago for Twelve  before, so I think the one of the owners deleted the previous profile on this site. Well here I am again, what goes around comes around! Too bad they cannot seem to handle criticism like a champ and to learn from their mistakes. Grow up A.B.  In my opinion, this place is VERY discriminatory and very selective on playing favors about who is allowed in their bar. Reason being, I thought it was rude about how all of these people were waiting about and hour more in line to get into the establishment because he was letting a bunch of people in who didn't have to wait an hour or longer to get into the bar.  Then once I got into the bar I went and spoke one of the owners (Andrew Balint) in person as a customer about how unsatisfied I was with how he was treating me as a customer. When I approached him, I was very nice about it and was only asking him questions as to why he was letting all of these people who did NOT have to wait in line in. He pointed out a few people and said it was family. (I get that, I would let my family and very close friends in without having to wait in line. There is nothing wrong when it comes to family. ) Well then I pointed to someone, I saw get in without waiting in line and asked him how he knew him. He didn't say anything but a huff and a puff then walked away without finishing our convo like a teenager. After this, Andrew ran to his bouncer like a little baby that he is and told him to throw me out. So his bouncer physically grabbed me pushed and threw me out where I fell on the ground in front of everyone. I have never been more embarrassed in my life. Sad thing is, I was not drunk at all because I just got done spending time with my family at church and went to a dinner after work that day. So, therefore, yes I was sober and thought it was very unprofessional with how he was running his establishment and made nothing but a bunch of nonsense excuses for treating his customers badly. In fact, his main excuse was \"oh its St. Pattys Day\" well let me tell you, not everyone goes out to drink on St. Pattys day, and I am one of them. I just wanted to see my friends who like to drink while I sip on cranberry juice and water.   Once again, like i said never have I ever been more humilated in my life. At least I was able to talk to him in person about it instead of hiding behind the computer to bash him. I was nothing but very respectful towards him about it, but no being a ego boosting jerk that Andrew is he got b*tchy like a woman about it. Basically, he handle the situation very poorly and very unprofessionally. I mean come on, what business owner would treat his customer in that manner. Whatever happened to the \"customer is always right?\"   Thing is, I hardly ever go out and I just wanted to celebrate some time with my friends after finishing up a couple years at Pitt for getting my degree in Psychology because I hardly go out as I am a single mother. Moreover, this place is overpriced.   Lastly, I just want to say, while I was observing and waiting for abt 45 minutes to get into Twelve on Carson seeing all of these people who were not his family and close friends, these were people he was letting based on looks, I knew this because he had let one of my friends in without having to wait in line, so once she got into the establishment she asked him if he would let me back in. So he did, but I was still completely and utterly upset, still in tears and all for being treating like I have no dignity, therefore I did not want to be there at all, so I just went in to say hi to my friend and asked how she got in so quick. She told me he let her in so I asked her how she knew him and all. Well her response was, i barely knew him but he just let me. I was so disgusted.   Finally, I DO NOT recommend this place at all, therefore, I am sure all of the 5 star positive comments are his friends and family!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dq5hlbDm-X1lnn3Vc9VGeg"
  },
  "X3agFycNAvQkAb0q5oor6w": {
    "date": "11/25/2017",
    "text": "Twelve is one of a minority of truly good barbecue spots in Pittsburgh. It meshes a relatively inexpensive menu with rich flavors and unique combinations.   Their Sweet Heat burger is among the best burgers in the city, mixing fresh beef with Applewood bacon and a creamy candied jalapeno cream cheese sauce. The sauce is the perfect topping for the burger and the waffle fries that come along with it are a nice treat as well.  Twelve has a great ambiance and concept with lots of space both at the bar and at the tables and booths. Their servers are friendly and knowledgable about the beers and drinks they have available. It's definitely worth a stop if your eating your way through the Southside or looking for an excellent barbecue.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GlLJqfmTtxlmSxYvw9bAsQ"
  },
  "YeVx1sJa0cjZ81lpyfC2xg": {
    "date": "3/26/2017",
    "text": "My name is Hitt, I'm from Pittsburgh PA.  I do many things but one of the things I like to do is experience everything I humanly can from foods to places plus people and things.  Rather than write a long review and clutter the reviews with anymore long reviews (no knock, you guys are great) I'm just gonna get right to the point...  This place?   I'd say at least try it once.  A nice Sunday brunch menu. A freakin giant 32oz Bloody Mary WITH a whole damn grilled cheese on it and much more! Interestingly delicious burger meat. I can't remember this place ever being rumshakers. Horrendous service.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 7,
      "cool": 7
    },
    "photos": [],
    "user_id": "zUQVfRIwoDJb_-8qiWUNwA"
  },
  "AHdMTfZ1E45MRpKtZgmf2A": {
    "date": "5/20/2018",
    "text": "Me and my son stopped in to try the food and the place was great! The other customers were having a great time. The employers were always walking around making sure everything was good. We were seated quickly, the waitress was so nice. The food was incredible! I couldn't get over how tender the pulled pork and brisket was! It was so huge too! It took me a couple days to eat and was great every day! I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4x7iKXX_FMzYc0IOoKNiZA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4x7iKXX_FMzYc0IOoKNiZA/o.jpg"
      }
    ],
    "user_id": "tStDxJ1-eyD-raVlp3WuFg"
  },
  "u8hSrccEqYh1RTuUtccq1w": {
    "date": "4/23/2017",
    "text": "We stopped down to check out the Brunch Big Azz Bloody Mary, also ordered the Brisket Benny and the Brunch Burger. It was all very good! Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dGUymB2f9lywAP0PUsQKDw",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dGUymB2f9lywAP0PUsQKDw/o.jpg"
      },
      {
        "img_id": "jzy-1qvGJKkqnEvJ68QuAg",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jzy-1qvGJKkqnEvJ68QuAg/o.jpg"
      },
      {
        "img_id": "v6A3w3RoGMWeUHZ-Zb075Q",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v6A3w3RoGMWeUHZ-Zb075Q/o.jpg"
      }
    ],
    "user_id": "tnOqesIA1DeQgb-74ssxqw"
  },
  "Fue4QlMPqFIxZLn-IU6vkg": {
    "date": "7/29/2017",
    "text": "Weren't sure if they could accomodate our party of 11. We headed out and the manager ran down the street to tell us they were setting up a table for us. They went above and beyond to accomodate us and the service was phenomenal.   Ladies, if you have a bachelorette party, this is a great place to start your day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1_KSumh5IQn_XdWQB8ARAQ"
  },
  "4-pR_9iu0eDVz9WpwdscGA": {
    "date": "11/13/2016",
    "text": "Stopped in for Brunch.  Some interesting items on the menu and a lot of different style  burgers.  Ordered the Brisket hash.  The brisket was little cubes on top of the shredded potatoes with some red pepper and an egg on top.  The hash was good and enjoyed the flavor of the brisket.  A side of toast with apple butter came with the hash.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 16,
      "cool": 16
    },
    "photos": [
      {
        "img_id": "lKdv-mCJgMoS-3pKuvObtA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Brisket hash",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lKdv-mCJgMoS-3pKuvObtA/o.jpg"
      }
    ],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "Pxh379clvbDP3jzGOc9viQ": {
    "date": "2/2/2018",
    "text": "Awesome brunch spot! Went here with a big group when I was in town last weekend and there ended up being about 12 of us even though I had originally made reservations via FB messenger for 8. They were very accommodating to our whole party and were extremely attentive. Their bloody marys were amazing, not too spicy, and everyone enjoyed their food. They went above and beyond to split up the bottle of champagne we got too. Will definitely be going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YOmwXwy8vGnJ24Ipkek8TQ"
  },
  "3vg0WLOiz1NZdMSZwWIyOA": {
    "date": "2/15/2018",
    "text": "Went here on a whim.  We had such a great experience.  Lisa was the bartender and she was so friendly. Offered plenty ideas of things to do while visiting. Lisa went above and beyond to make us feel welcomed. Speaking of which, we're headed there now. K byyeeeeeeee",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GCtO7qs_SnLyonT_zVYnjA"
  },
  "EeeFr7aIyw8jqH_UgzrnPA": {
    "date": "8/10/2018",
    "text": "Some of the best BBQ I've had! Was able to be seated right away, and didn't wait long for the food to come out. Service was good and food was even better. The Notorious PIG was AMAZING!! I will def be returning to try other dishes. Highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_I6MwFpyZiilpWPsFb5sIA"
  },
  "jfG601ChZpRf-wDPxvA6rQ": {
    "date": "6/17/2018",
    "text": "Had a great experience here. We were seated right away, service was efficient and friendly, and the food was great. Literally no issues. The waitress was very sweet and we will definitely come back for brunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a0NgnJLcl8NBiU4Xj98wyg"
  },
  "RgIyS0Z9yMqLKtYJduUvXw": {
    "date": "11/26/2017",
    "text": "Not the best of service or the best food. They are a service industry bar and that's about it. I wouldn't ever go here to Food again. If you wanna go hit the south side on a Friday or Saturday night this place will be packed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kDWWI3vl23QslSsJ277D-A"
  },
  "SE58yRx52Uxpp3zKoa1m3g": {
    "date": "12/19/2016",
    "text": "Facelift and Revamp, from the inside, out: The inside of Twelve recently went under renovation, a positive change accompanied by new menus for both brunch and dinner. I had a phenomenal brunch with friends, complete with massive bloody Mary's that each contained a meal in themselves. These things were the size of a torso. Also sampled the pumpkin French toast which was delicious and has me wondering if they're moving towards a more seasonal menu- if so, this one was a great start. Servers were attentive and the manager stopped by our table on multiple occasions to make sure everything was running smoothly. I'm really impressed by what this place has become. What was once a late night spot that never even crossed my mind for food has quickly become a fun spot to sit all day at boozy brunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tUa9b0XvaM0qaF9OOzFl1w",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Bloody Mary found on the brunch menu. It was literally as tall as my torso. Yum yum yum!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tUa9b0XvaM0qaF9OOzFl1w/o.jpg"
      }
    ],
    "user_id": "z6zOtpIXMdbx_cN_wtGQ-w"
  },
  "iVow0eIMBkjY6v7fqJvy8w": {
    "date": "9/21/2017",
    "text": "I'm giving this place one star solely based on the staff. I've never had the pleasure of trying the food and never will since kitchen staff seem to think it's ok to stand outside the side enterance and try to start fights with strangers.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GAeutek-rDK-Rr7GTS7_Bg"
  },
  "sRopfTLU8Wm2v4mk0iEbgw": {
    "date": "8/13/2016",
    "text": "This was a pretty disappointing experience. We visited on a Saturday evening, in a small party of three. We waited - no exaggeration - a half-hour for menus.   The menu is rather small with a few variants of barbecue, wings, and burgers. I had beef brisket on a brioche bun which was, in all fairness, quite good.   The atmosphere was mixed; the decor, as others have commented, is cool and the people watching is a delight. I found it very hard to hear even from the other side of my table, however.   Service was absolutely terrible. There genuinely seemed to be only one waiter and one bartender in the entire place and getting the check took an unacceptably long time. Our waiter never refilled my water once and we also had our checks mixed up as another reviewer commented. Its too bad as the good, again, is pretty enjoyable, but I probably won't be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "_9ZU0YdnsdLpti90DsWcNQ"
  },
  "lNxUxhiaxahY3wduLunZeA": {
    "date": "11/2/2017",
    "text": "Good barbecue, good drinks, and fun atmosphere. This is a great turn up spot on the weekends. You've been warned.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0MI0CFd3HuyZJvTwsFGVTQ"
  },
  "rmsQwcSvFm9ZhsQL0fvRaA": {
    "date": "7/22/2016",
    "text": "I stopped in for brunch on Sunday with a few friends around 1pm.  We were welcomed by a waitress who told us to sit where we'd like.  She then arrived at the table with some brunch and drink menus.    The waitress recommended the Bloody Mary so I took her suggestion.  Let me tell you, it was AMAZING.  Stacked on top of the Mason jar which it is served were a burger slider, chicken tenders, waffle fries, olives, grilled cheese, and bacon.  I recommend ordering as an appetizer to share with friends.  You'll love it. Trust me.  For my meal I went with the Sausage Gravy and Biscuits which were served over shredded hash browns.  The potatoes were crispy, biscuits were flaky, and the gravy was delicious.  My friends ordered the Chicken and Waffles and Brunch Burger.  They both enjoyed very much.  The chicken tenders were hand breaded and fried to order.    Will certainly go back to try the regular dinner menu.  Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "y4WW68wfXPaJh5NokfiBYQ"
  },
  "FCdkSwrLUmMT7PZ4UT6CjA": {
    "date": "3/26/2017",
    "text": "Great neighborhood bar with great food !!! Feels like home !!!!    Brunch is on Saturdays and Sundays till 2:30.  Kitchen is open 4 to midnight.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OL3BKhUozrYLLbRU1UbYzQ"
  },
  "ggFX4aoSe3lTaH9qcGa-7w": {
    "date": "11/19/2017",
    "text": "Walked into a bit ago and got a seat at the bar. 2 of the 3 bartenders looked me in the eyes and continued to walk pass me with not even as much as a head nod let alone a greeting. I continued to sit before I had to flag down one of the bartenders to ask for a menu and a drink. I would love to stay for BBQ... But I'll drink my drink and wander elsewhere!!! Not worth me spending my money and I don't they even care honestly.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dJVyAtp-Zm1YHipCN2Ep9w"
  },
  "PjdaLHD9sFAuGgUVmZSdwA": {
    "date": "3/25/2018",
    "text": "Wish i could tell you about my experience there but i wasnt allowed entry, because i had timberlands on. The door man clearly doesnt have any style, because my boots are actually timberland north face collabos that were 450 bucks! There were at least a couple other dudes in there with less fashionable boots on as well. If your going to have a dress code at least be consistent about it. I came to Pittsburgh from out of town and was looking foward to some bbq, but now all i have is a disappointing story to take with me back home with me. Step your game up! Im not giving a broke ass bouncer ten bucks for entry to some bar NOBODY around town recommend. Literally NOBODY! I went to a bar one block down the street to ask about this place and the bartenders didnt even know what place i was talking about! With all the competition in the neighborhood you probably should be a bit more smart with who dont let in because i was bout to drop hunnids in that bxtch! Anyways you guys suck Pitts. Hope you close or your drug front gets exposed :) you get one star because the food smelled decent, but most bbq does.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9p1roSiL9YJ5jm7b92V_sQ"
  },
  "VXIHnrOfYBrHuyO0ujMDFQ": {
    "date": "8/13/2018",
    "text": "Boo racist/sexist dress code.  What a way to treat potential customers.  This is completely unacceptable in our community.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "6F7i5idCafBg8y_gtPdDrw"
  },
  "f7g1wU3J7pwgkZ_yjRm_GA": {
    "date": "10/4/2017",
    "text": "Just ordered from here- I've always seen it on Postmates but passed it up until today. I always look at the Yelp pictures before getting food somewhere just to give me an idea. It looked great, so I wanted to try. I ordered a burger and 6 wings with a side of the cheesy corn. The corn was great! It was super tasty and a lot of cheese, there were also peppers in it that made it spicy and I really enjoyed that.   The wings were also tasty. I ordered the garlic Parmesan wings. They, however, did not supply the ranch or celery as I requested and these wings were pretty greasy, which made them hard to finish.   I was craving a burger so I ordered just a regular burger. It was nothing to write home about- especially because they put SO MUCH mustard on it. It was literally dripping out of the bottom when I went to eat it. I had to take the bun off and eat it on it's own and even then the lettuce was soaked in mustard and so were the pickles. I like mustard but I don't love it that much! Unfortunate.   I also ordered the \"pickle on a stick\" and it was legit just a pickle. I paid $3 for a pickle. That annoyed me.   I will most likely not order from here again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vRHUVyLn6uzShnF8uG4Qcg"
  },
  "Q03oI1Dk-y1bQhNeI9FNZw": {
    "date": "10/4/2017",
    "text": "I came here for brunch with a couple of friends and overall was not very impressed. I was excited to get the huge Bloody Mary with all the fixings but was disappointed. The Bloody Mary was very watered down and all the food that came in it was not very warm. Then by the time I started eating everything from my drink I wasn't even that hungry for a full meal. I ended up ordering cornbread and the cheese grits. The cornbread was delicious but the grits not so much. They tasted more salty than cheesy.   The service and atmosphere were okay but it got pretty loud at one point.   I will probably give this place another chance but will be ordering different items next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NhZvV4mNTQhqe1nvro9UGg",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. 32 oz. Bloody Mary",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NhZvV4mNTQhqe1nvro9UGg/o.jpg"
      }
    ],
    "user_id": "GLjJP23cKxHYbfLh1zA1uA"
  },
  "zPS8737Wj6mTSUFHsJrRog": {
    "date": "8/20/2018",
    "text": "Any bbq joint that has a dress code is already on notice.  The food was gross and dry, over cooked and unseasoned.  Avoid, at all costs.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nXPdot6NAUkJDTC_02XL2w"
  },
  "Pw2gWmLHNV7o8XmY7-TOhQ": {
    "date": "2/26/2018",
    "text": "I'm not going to hold it against them that I forgot my license and they wouldn't give me a Bloody Mary - despite the fact that I am old enough to be the waiter's mother.   But the food was subpar.  I got the brisket and eggs.  I wanted poached eggs, but they said they didn't know how to make them.  Um, you are serving brunch, you should be able to make a poached egg.  But ok.  I got them fried.  It comes with cheesy grits which took up most of the plate with four pieces of brisket.  Each piece had a huge hunk of fat lining the side.  Now, I know that brisket is fatty, but this really should have been trimmed.  The sauce was ok, but nothing else had much flavor.    Z got a burger and the bun came out burned.  It bothered me, but he didn't really care.  What did bother him was that the burger was so small - like the actual patty.  Couple that with some fairly soggy waffle fries and it was just not a great meal. It had a jalapeno cream cheese on it that was good, but didn't taste any different than Bruegger's cream cheese.   We will not be back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2JjI8DCyrpabtg36iL5lrw"
  },
  "XaYva4Acjz4ZoyZpDR5g9A": {
    "date": "3/31/2019",
    "text": "Had an amazing rack of ribs and hush puppies. Great service and great food. Will definitely come back again the next time the firm sends me to Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9v2VaKrWws0UDwLY6XEcQA"
  },
  "65AbhJ9CWjd9ZZ0KbTQ9aQ": {
    "date": "3/18/2017",
    "text": "Like this place . always fully loaded with people  nice girls . food taste good . nice and clean.  prices reasonable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CJt7mmGyisb1uNMY6VrR-A",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CJt7mmGyisb1uNMY6VrR-A/o.jpg"
      },
      {
        "img_id": "gUceIcbMSI_KjL5skR272A",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gUceIcbMSI_KjL5skR272A/o.jpg"
      }
    ],
    "user_id": "TvVbOGdF4V0RqcKc1dVXCQ"
  },
  "wNiGvDjVPDCLuWpXvJeBjg": {
    "date": "9/15/2018",
    "text": "Stopped by Twelve for an early dinner and we are happy we did. We took advantage of the happy hour which was half off specialty drinks and apps. The nachos were great to share and everyone enjoyed their drinks. The service was a little slow but the waitress seemed to be in charge of all the tables and the bar so we didn't mind. The food was terrific and very filling. The food was reasonable priced, I believe our bill was under $60 for three people who all got drinks, entrees, and one split app. Would recommend if you are in the area looking for Pittsburg barbecue!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "78oWKkIgcpRVxfxf9uDt6A"
  },
  "nIDBLA5BCd_zi5HhZkLPQg": {
    "date": "1/9/2017",
    "text": "Stopped in for lunch on a Saturday, the staff is super friendly, helpful and accommodating.  The atmosphere is cool but not that niche style/ hole in the wall BBQ joint that smells like smoke that you'd expect.   The major positives aside from the great staff here are the drink menu, beer selection, and the nibblers; They compliment a good drink if you stop in to watch a game (the place is equipped to accommodate your game watching needs)   But that brings me to my meal. The buffalo bleu. It was a good bun, and a tasty sauce especially if you like bleu cheese. The jalapenos were fresh which made it really tasty and there was a really nice texture difference with the crunch from the onion on top. I evidently made a mistake by substituting the beef burger for the Chicken. I assumed chicken from a bbq joint would be pretty good. I was wrong. It was thin and underwhelming. The burger would've been great had I not substituted but i effed up and substituted the product made to work in the first place.   Definitely going to go back. In talking to one of the owners ,who runs the taqueria next door, the chicken is not the same chicken they serve in there BBQ/smoked dishes, which is the reason I tacked on a star. Ownership is clearly committed to serving the best product gotta love that.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "UxPAc2HbZHkcLTExEuqx9Q",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Fries on point.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UxPAc2HbZHkcLTExEuqx9Q/o.jpg"
      }
    ],
    "user_id": "H5U7NJWU7pA3-xLQg70OFw"
  },
  "PqtLH6MaXs9sAlEOr6gpog": {
    "date": "3/10/2019",
    "text": "Great atmosphere and food is bomb!! Would come back over and over again. I really enjoyed our time here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rSnU9lGT2XBnJtDT1YglPw"
  },
  "nj05zJmUX9lriYuzdW_Fig": {
    "date": "1/1/2018",
    "text": "This place looked pretty nice, but we were disappointed. The servers were more interested in gossiping than worrying about the customers. The chicken nachos were disappointing as well.  On the surface, they looked good but it was just good plating. We found 2 small pieces of chicken in the whole thing. The rest of the toppings were skimpy as well. Once you got beyond the first layer of chips with the toppings, there was nothing but salty chips. The music was blasting and was more suited for a nightclub than a supposed barbecue restaurant. Unfortunately this place was a disappointment all the way around.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EeWYibAhNZD1g82_BaFveg"
  },
  "oaDsLvOmE8_re93urxRpBg": {
    "date": "11/2/2017",
    "text": "I went here for brunch recently and unfortunately wasn't super impressed.  I was really excited about the super bloody mary that has as accoutrements a mini burger, mini grilled cheese, fried chicken, etc. They warned me when I ordered it that it would take about 20 min to prepare which was fine, but it ended up taking 35 min and some of the items were no longer hot by the time it was brought out, although it was quite tasty. But it wasn't as artfully presented as I had anticipated based on photos, with all the sticks of accoutrements just kind of randomly laid on top and there was an overabundance of cheese cubes relative to other items. For the food, I ordered the hog hangover breakfast and asked for my egg to be a dippy egg rather than scrambled.  But the egg came out way overcooked and completely hard and there was barely any hollondaise on it so it tasted extremely dry.  The amount of pulled pork was quite generous but it was really too much and overpowered the rest of the dish.  I asked for an extra side of hollondaise and it was very light and runny, which may be why it seemed like there was barely any on it.  Two of my friends ordered the French toast that was supposed to come with blueberry and bacon but it came with a weird pumpkin paste that looked like it came from a can.  They said it was so disgusting they couldn't eat it, and my friends usually aren't super picky.  Pumpkin is also quite a different taste from blueberry and bacon so they should have warned us about the seasonal menu change.  They did prepare some plain pancakes to replace them, but without the bacon or blueberry, though a discount on the check was provided.  Overall the service and time to get the food was quite slow, which seemed to be mostly on the kitchen end rather than our server.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MaAByxnBye56d9mi_hlNKg",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MaAByxnBye56d9mi_hlNKg/o.jpg"
      },
      {
        "img_id": "7Rnjxi6g9RTET9dnx02ClQ",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7Rnjxi6g9RTET9dnx02ClQ/o.jpg"
      }
    ],
    "user_id": "3bo1FXvQnxw2hmO0CHH4Nw"
  },
  "LrgTq2dBoz5d7BGTcYLk_A": {
    "date": "5/15/2018",
    "text": "Decent BBQ.  The pulled pork nachos are really good and a nice sized portion, but could use a little more meat.  They have a decent Happy Hour with $2 domestics and 1/2 price appetizers from 5-7.  The staff is very friendly and accommodating.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iJSvri1sARt4dttrcnAibw"
  },
  "2p5iKzQ8lxkipiq-nDVQww": {
    "date": "12/7/2017",
    "text": "This was the second time I at ate twelve. The first time was like a year ago and the menu was a lot smaller. They have added several items to their brunch menu but it seems like the quality went down. I'll have to try something different next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mA3tALTzmDunDRctGEu-wA"
  },
  "6KS1vyyqDHPLTgQYR-VHfw": {
    "date": "4/3/2018",
    "text": "Nice tasting BBQ set in a loud \"night club like\" atmosphere. Huge portioned items. Their wings are just okay , with the insides being juicy & the outside lacking flavor.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UFIpCR9j2tFUwBV9O4pZXQ"
  },
  "cpVjjbQzwQKkvJSCFcT1CQ": {
    "date": "7/27/2016",
    "text": "Nice stop on Carson St. for brunch and cocktails.  The menu is limited, but adequate and delicious - and the drinks are pretty darn good and the service is friendly...all of which is always a recipe for success!  The place has some cool decor as well, which adds to the character of the place.  It's cozy but not confined, so even when it's crowded- you can still carry on a conversation, which makes this place a worthwhile visit.    This is a must stop for small groups looking for some good grub, good beverages, and a good place to hang out in the south side of town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "WktlCUYYh-gtQc3K2JKMxA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Pretty cool logo...",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WktlCUYYh-gtQc3K2JKMxA/o.jpg"
      }
    ],
    "user_id": "0BxF-X_WBAoL6Zk46RzhYQ"
  },
  "jyn-HnJLapqWdsNMOfQ2wA": {
    "date": "6/27/2018",
    "text": "I went here for birthday brunch and loved it. The food and atmosphere was great and we had a good waitress who took care of everything.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n0DqgdAqooQcDGXDs0-s-A",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Brunch was delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n0DqgdAqooQcDGXDs0-s-A/o.jpg"
      },
      {
        "img_id": "JOqpCc38xnfUtjJKqo1peg",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Brunch was delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JOqpCc38xnfUtjJKqo1peg/o.jpg"
      }
    ],
    "user_id": "7QqYgsyNzGcMEneOQHoO8g"
  },
  "4w9B5y_0vSdTcI-CC43Djw": {
    "date": "5/4/2018",
    "text": "My experience was dry tough sauce on one side ribs and corn on the cob wrapped in foil with a zig zag of mayonnaise dubbed \"street corn\"",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y-QG3kwQQJOM34CruBk4-w"
  },
  "NqGkv57dlsv5dHSzMbECXg": {
    "date": "6/20/2018",
    "text": "I'm giving 2 stars only because they have good happy hour prices. But don't expect good or timely service. The bartenders weren't present and disappeared for extended periods of time. Management should staff their bar and service staff better to accommodate for the service their guests expect and deserve.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fp3LlE_1dFjNzb5FjpN5mA"
  },
  "qljni6yLumEX8bQUP-xWcA": {
    "date": "8/16/2017",
    "text": "A few weeks ago, me and my boyfriend were craving some barbecue and went to Twelve. We usually go to South Side Barbecue or Pork n' Beans but figured we would switch it up for a change. The service was good and we both ordered the combination platter that had brisket, pulled pork and ribs. It also came with two sides. I ordered the mac n' cheese along with the baked beans. The food was really tasty and the sauce was nice and peppery. I do wish they had a variety of sauces though. My sides were ok but not amazing. I was sad about the mac because I thought it was overcooked and not super flavorful. Even the best mac n' cheese can be ruined by overcooked noodles so it's even worse when the mac isn't the greatest to begin with. Overall, the food was pretty good but I don't think I would choose Twelve over other options in the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OWtzJMlqA7cY559O80nqQg"
  },
  "Tz4ArRBxdKU01CruF8vMWQ": {
    "date": "6/26/2017",
    "text": "I have to admit - every time I walk in here I think of Rumshakers... but it's a whole new world! Twelve is a perfect mix of good food, friendly staff, and solid deals during happy hour! The space has been renovated and is lookin' good! They recently added the outdoor sidewalk seating area on 13th Street - which is cute and big enough for a group to enjoy outdoor seating.  Food: Carla's Corn Cakes - YES! Even if you don't order a meal to get them as a side... just order them as a side! So tasty! Pulled Pork Sliders - three delicious sliders for $8.. but wait! Go during happy hour - they're only $4!!  Chicken tenders - good meat and they have all the sauces to choose from for dipping. I went with a few of the spicy options and loved them all!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Us7IRI5KqeHGYCOxhY2B0g",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Us7IRI5KqeHGYCOxhY2B0g/o.jpg"
      }
    ],
    "user_id": "MXE5dJEqzzfKDLEGkHbdVA"
  },
  "7TE_gsMSS7J4Y_L_IZqILA": {
    "date": "4/2/2019",
    "text": "I keep wanting to like this place.  The decor is cool and the food is pretty good, but the service is miserable even when it's not busy.  I've been 3 times and it's been near impossible to get a server to stop by the table.  The music is always incredibly loud so you can't hear anyone.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g49MsYxBLha9Thzv1E3Uug"
  },
  "wBSCzCmhZvpPRyHBfldmig": {
    "date": "4/1/2017",
    "text": "I was actually pleasantly surprised with this place since it sounded like in the previous Yelp reviews that the service was bad, drinks weak and food not so good.  We were greeted as soon as we arrived and the waitress came right over to take our order.  They have daily happy hour specials and the Thursday night we went it was half off apps and half off specialty cocktails and a $5 burger.  Since it was a BBQ joint we had to try the meats so we ordered the  nachos with pulled pork to start and got some margaritas too.  First of all, the nachos came and the portion was crazy huge we didn't think we could make a dent but they were so good and the margaritas went down so easily next thing we knew the nachos were gone and we had another round of margaritas on the table.  We had all ordered dinner before we got the nachos which meant we had to get to go boxes because we were too full from the nachos. The prices are very reasonable and you get a lot of meat and 2 sides (your choice from a list of 8) with dinner.  Our table got ribs and brisket with a bunch of different sides.  My favorite sides were the cornbread, mac n cheese and waffle fries.  I probably would stay away from the cheesy corn.  The brisket was smoked perfectly and tender and delicious-ribs were super tasty.  We left full and buzzy and with leftovers for the next day.  We had a great time and will be back, I'm sure, to sample other dishes.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "I8DzaLkUmiu-3lXdkfg4HA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Brisket with Mac n cheese and waffle fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/I8DzaLkUmiu-3lXdkfg4HA/o.jpg"
      },
      {
        "img_id": "QJSsR5YMPDorGDTcjrH2jQ",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Half a rack of ribs with cheesy corn and coleslaw",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QJSsR5YMPDorGDTcjrH2jQ/o.jpg"
      },
      {
        "img_id": "3uS4YYbIdoQq4TUWhq6r-w",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. These nachos with pulled pork were so good and only $5!! With the HH special",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3uS4YYbIdoQq4TUWhq6r-w/o.jpg"
      }
    ],
    "user_id": "hjk--8VuDX3479_atPJQ1g"
  },
  "-t99f0pUKQI3JuMR21qOMQ": {
    "date": "1/5/2018",
    "text": "Normally I avoid the South Side like the plague after living there for 6 years, but I found myself here in the evening on Christmas Day after coming back into town from the holiday.  My friends and I were looking to have a few drinks and catch up on our holiday adventures and I wasn't sure anything would even be open.  It wasn't overly crowded for being one of the few places open that particular evening, so we were able to easily get in and find a place to stand and chat.    My friends and I enjoyed the music and I was also impressed with the drink prices - I forgot how inexpensive South Side bars can be!  We ordered 2 beers and 2 shots of tequila and it clocked in right around $20.  Pretty decent price tag for some Christmas cheer if you ask me!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "fp6wXrr5r3poOg6YhL4yvQ"
  },
  "zX9VN1BhfLq1abDXyCfrpA": {
    "date": "5/24/2018",
    "text": "Brunch is a wonderful thing. Throw in some slow cooked BBQ brisket with grits, a big juicy burger served over French toast and syrup, hair of the dog Blue Moon beer special and brunch becomes a verb. It's that \"thing you do\" when you just can't do anything else til after you eat and take an after brunch nap. Twelve Whiskey BBQ does it right.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "sU-lICYG1aiqMxrq6N33xA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Oh my &amp;#34;goodness&amp;#34;: Brisket N Eggs with grits",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sU-lICYG1aiqMxrq6N33xA/o.jpg"
      },
      {
        "img_id": "-pQud-dZkNwP5FzhFRWxqw",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Sweet and salty: BRUNCH BURGER Burger, American Cheese, Bacon, Fried Egg, Berry French Toast, Bourbon Barrel Aged Maple Syrup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-pQud-dZkNwP5FzhFRWxqw/o.jpg"
      },
      {
        "img_id": "zgozY5HWYn8VNisdfi7O8Q",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Brunching as a verb: Blue Moon brunch special",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zgozY5HWYn8VNisdfi7O8Q/o.jpg"
      }
    ],
    "user_id": "X315dgV7z031K70VD13uOg"
  },
  "BRPka0-ktaJIvbQhexbXOw": {
    "date": "3/18/2019",
    "text": "My husband and I came here for dinner on a Friday night. It wasn't too crowded and we enjoyed the atmosphere. We ordered the fried green tomatoes to start and they were AMAZING. My husband ordered the jerk chicken wings but unfortunately had to send them back because he said they were so salty that they were inedible. The staff quickly substituted them for the regular BBQ wings which hubby said were fantastic. I ordered the Pig Mac. The corn bread was the best part. I felt the Mac and cheese could've been a little more cheesy but otherwise it was huge and good. We decided to try dessert which was the banana pudding. HUGE disappointment. The description on the menu said it came with Nilla wafers however there was only wafer DUST sprinkled on top. Not worth 50 cents in my opinion let alone the $4 or $5 it cost.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HyNsAGV-WibYaQiBzoegQQ"
  },
  "xsJWNt6xEM4HSsU9XpxF-g": {
    "date": "3/10/2019",
    "text": "I attempted to eat dinner here but was turned away at the door because I had my camera with me. I'm a photographer. I carry my equipment with me. The doorman was exceptionally rude and told me that no photography is permitted. I let him know that I am not shooting, just want a bite to eat. Photographers beware! Avoid this place like the plague!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0PYZWskzuCEhZUIfGQG9WQ"
  },
  "1oWtU7JWJZrvntUMW2_RvQ": {
    "date": "1/7/2018",
    "text": "We stopped in for brunch on Saturday. I ordered the Southern Biscuits and Gravy. When my food came it look delicious. The bottom layer was home fries. On top of those was a biscuit split in half and laying open. There was a fried chicken strip on top of each biscuit. Then ladled over the top was country gravy. On the menu it said it came with a side of syrup but I didn't receive any. The chicken was a bit over cooked. Overall the dish was good. It was definitely  comfort food.   My husband ordered the Brisket and Eggs. The brisket was tender and the eggs were good. The grits that came on the plate were very bland. They had a little bit of cheese on top but they did nothing to give the grits any taste.  I would go back to try their wings and a few other dishes but I won't be rushing back to do so.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "2HbMwIflzPU3beN5iVSMTg",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Brisket and Eggs",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2HbMwIflzPU3beN5iVSMTg/o.jpg"
      },
      {
        "img_id": "qcfECV5jUMt5kelk1i1tXQ",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Southern Biscuits and Gravy",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qcfECV5jUMt5kelk1i1tXQ/o.jpg"
      }
    ],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "YQh5wtjXn4KU-fNtV5AimA": {
    "date": "3/18/2019",
    "text": "This place has such good BBQ!! They have so many options and every thing I have ever had has been so tasty. Meat is amazing and the Mac N Cheese is to die for. Drinks are good but can get a little pricey at times. I highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qwx3mC7RktFFQ7cWXDaVzA"
  },
  "5KUljdmEImf-5W0JVB6fbA": {
    "date": "3/18/2019",
    "text": "A friend and I stopped by on St. Patty's day after being at Claddagh Irish Pub for most of the afternoon. Wish we would of waited to eat here vs Claddagh! Ordered a brisket sandwich and an order of Spinach Artichoke dip with chips... both were excellent! Brisket had a smoky flavor and the barbecue sauce was very taste... loved the chips  that came with the dip (not the healthiest but sometimes that's ok). I would order both of these again and recommend anyone to try them...   Great atmosphere, servers were nice, friendly, busy no one just standing around. Lots of folks eating and socializing, for a Sunday afternoon not celebrating St. Patty's Day the place was packed. Good beer selection on tap & bottles... We sat at the bar, talked to people sitting beside us everyone seemed to be just enjoying themselves being there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JhtLYanU8fKkrziFhRhpVQ"
  },
  "eoWzr8X4zKUYZeLHWlpqlw": {
    "date": "11/13/2017",
    "text": "I was here a couple months ago to grab a snack and a beer. I was out in the South Side bar hopping on my way to get some tacos. I spotted this place and had always heard good things so I decided to stop.   I ordered a beer and it was wing night so I got half a dozen wings. The waitress recommended the special sauce for the night, honey ghost pepper. She said they weren't too spicy but they had a good kick. So I gave them a try. (My waitress was also the manager and she was very upbeat and polite to everyone who came in!)  My wings arrived, crispy and steaming hot right out of the fryer. The waitress said they were spicy and she was not lying. These wings were spicy, and they kicked my ass.   I'm a huge fan of spicy food, I usually have some sort of heat element in any dish I order. These wings were hot and it was difficult for me to finish them. They were delicious though, the sauce had really great flavors throughout. If I was not in so much pain from the spice I would have ordered more.   I'm only giving 4/5 because I briefly touched their menu and I cant give a full 5 stars until I have a full meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0N91KZHstHSnKwJVRa2p2g"
  },
  "jabBl0_cbmlJWMhO83p_Kw": {
    "date": "1/2/2018",
    "text": "I have been to Twelve for brunch and dinner, with a small group of friends each time. It wasn't hard for us to get a seat on either occasion, which is always a plus. I was happy with the brunch options, I had the chicken and waffles. The portion size was large - I definitely could have shared it with someone - but it was very good, so I wasn't too upset I had to eat it all myself.   When I went to dinner, I had the pulled pork on a brioche bun with mac and cheese and a side salad. I really liked the classic BBQ sauce, and the sauce to meat ratio was just what I liked. Sometimes it can be a little too sloppy, and gets too hard to eat. The mac and cheese was good, it had what appeared to be cheese crackers on top which was a nice change from regular breadcrumbs.   The beer selection was decent, but all of the craft beers aren't included in the happy hour which was a buzz kill. The mixed drink specials were pretty good, so if you are into that I would definitely go that route.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iCXJ3gO2GhopYHmfmnktfw"
  },
  "n7ryMXcGNxSxNmABZg_xJg": {
    "date": "3/3/2019",
    "text": "Chicken and waffles is amazing. I've been there a handful of times for brunch and dinner and I've never been dissapointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sz17HiLvGpcVB9JRI5KSaA"
  },
  "rixipOEXjdCnvV-9qRVHoA": {
    "date": "10/1/2018",
    "text": "This restaurant is exactly what I've been looking for. The food is delicious. The portions are huge. The service from outlet server was wonderful. Our server was knowledgeable of all items on the menu and knew exactly what to recommend. The corn bread was moist and full of flavor. As the hush puppies were also flavorful, had a little crunch, but soft on the inside and so good. I was able to order the hush puppies in place of my side of fries with the burger. I am looking forward to returning again very soon to try more items off the menu.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "nzl2KyGKLtV7j8QEfOhC-w"
  },
  "fQZgnu0sSW3cdZkEyjoNGA": {
    "date": "2/28/2018",
    "text": "Bar hopping in the Burgh!!! Wings here! Great atmosphere, but service not so great.... so far I'll update later. The waitress is braiding a girls hair at the bar while we wait and wait and wait!!!!!!!! So unfriendly to.  Food was incredible, I try Cole slaw everywhere and I would rank this one way up there. Wings were perfect, especially the garlic. The whiskey BBQ is award winning for a reason.  Corn cakes were worth getting extra to go...   Braiding hair at the bar is so unsanitary! The served us food?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uL2OrRY1-eocjL8Qy3SzlQ",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uL2OrRY1-eocjL8Qy3SzlQ/o.jpg"
      },
      {
        "img_id": "yTc49XNQECs1mCwGQeAeWg",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yTc49XNQECs1mCwGQeAeWg/o.jpg"
      }
    ],
    "user_id": "XeOCjJwfLlKpkSd_oYxyGQ"
  },
  "dTpy86KIzIWG06D77DEGHA": {
    "date": "4/18/2018",
    "text": "Food is great! Specially burgers  really cool atmosphere, nice service, music...really not a bad place to meet up with friends",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O8jakwbIJS29cOWYFBzq8w"
  },
  "ttWhlWGL2I9FePSx0a3bGA": {
    "date": "9/16/2018",
    "text": "Good brunch lunch spot. Wife likes the bloody Mary. Coughlin law is still her favorite  but the food here is better and way cheaper. Bonus free parking on sunday.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "RRSdvsxJSJ1QXmAV0ivDkA"
  },
  "bNxTlzJFoRyFDEYzXMlgNQ": {
    "date": "5/2/2019",
    "text": "The meet was really chewy the sides were good and hot but couldn't eat because the meat was so bad.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5a8S58Ftewl0SmRvGCCs0g"
  },
  "j_YTABOnJAE96YRfw3lOzw": {
    "date": "11/2/2017",
    "text": "Good BBQ, the Corn Cakes are off the charts, and cheap PBR is always on the menu!  Twelve has an updated decor and recently put in an outdoor seating on 13th Street, just off of E. Carson. The space has plenty of tables and the booths are either for 2 or 4+ people. Plus there is plenty of space at the bar. My first trip it was suggested that I try the corn cakes... and I suggest you do too! They are perfect with BBQ or on their own. The menu is sizeable and offers lots of options. I've ordered a full meal and shared it, because it was so. much. food. The mac & cheese was nice and cheesy and the meat was good and tender.  I was once there for a meeting and it also happened to be trivia night - the host seemed to be fun and there were prizes available! I plan to try to participate in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuImB8xcQ5lJCrsbB9vCvw"
  },
  "ag6MH9JV-sQlwe8LeHIPLA": {
    "date": "3/23/2018",
    "text": "Food is always delicious, I've been there a dozen or so times because I live in the South Side. If it was based on food alone, I would give it 4 stars.  Most of the time when I go, I sit at the bar because I'm just grabbing something quick. The girls that work behind the bar are always less than enthusiastic, and it always takes forever for them to notice if you need another drink or are ready for your check because they are busy talking to each other and complaining about how much they made there or at the taco place next door. No etiquette when it comes to customer service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o8WBDKznLXx_aLU1B0-sCA"
  },
  "I9_jEd6f1IZxa0LD_VuHhg": {
    "date": "9/18/2019",
    "text": "I recently moved to the South Side and I'm trying to find \"my place\". You know - the place you frequent weekly, the place you've tried everything on the menu - that kinda place. And I feel like Twelve is on its way to becoming that place. I'm a huge BBQ girl so I took my family here a couple months ago and we loved it. Then, once I moved here, some friends and I started going every Thursday for wing night. 50 cent wings and some amazing draft deals. They have some small tables perfect for two and then they have some pretty large tables to fit big groups - which I feel like is honestly rare in most Pittsburgh restaurants. They are able to accommodate me and all my friends every week. All around a great place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "COx2BIbrQoD9oRFFPrsVyg"
  },
  "cbUah8-ZC1mUKPlphck5zw": {
    "date": "5/2/2019",
    "text": "I am delighted to see what happened to this place over the years. I was a bit sad to see the shadiness of Rumshakers leave, leaving us with this Gastropub styled Whiskey BBQ location. I swear it was called just 'Twelve' at the beginning, do correct me if my memory is failing me.  Anyway, this visit. Came for brunch for a Birthday Party.   Atmosphere - not too crowded for Brunch on a Saturday; had Pop-country in the background, which happens to be my thing but not everybody's. We had a large table toward the back of the room, as there were a lot of us. It was nice outside so people could sit out on the porch that connects to the pub.  Drinks - Started with Mimosas. Okay - a bit on the OJ side for me, so I switched to my standard vodka soda. No issues on here. Regular beer specials for Beer, a plus for a Saturday day service  Food - Our party was overall satisfied with the food - Chicken and Waffles came out in generous portion and is one of the best items on the Brunch menu, I had the Brisket Benny - which was nothing to ride home about, to be honest, except the side of potatoes that was perfect. However, do be warned, do NOT get the Turkey Bacon - it was garbage on repeated visits.  Service - This one wasn't that great of a start - There was confusion about if our tabs were with the server or at the bar or if they switched us in between, then were was a random food runner girl who also was a server (?). All in all, unsure. This could have been better. We had people dripping in over time so that probably is partially on us.  Price - Aok; fine quality of food for the prices paid. Depending on how much you drink you'll probably get out around a $20 occurrence because of deals on the drinks.  Definitely will come again, they have a DJ at night on weekends, including Sundays.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2AiYF7z32_0Oitl4aYXwg"
  },
  "veujBJ7OMVDRLjQ-n3-WLg": {
    "date": "2/18/2019",
    "text": "Stopped in here, not by choice, but because Urban Tap was unexpectedly closed & it was pouring/freezing rain and I needed to grab a quick bite for dinner before a show at Club Cafe.   I was surprised how totally packed the place was on a Sunday evening at 6pm. I was also surprised there was a bouncer at the door. I guess I shouldn't be surprised when most everyone out evenings on Carson St is under age 30, so they do a lot of carding. This place was no exception.  It was super loud & no one looked to be over 25. I also saw someone on YELP posted a photo detailing their rather extreme dress code, which was kind of weird for a restaurant.   I was definitely a little skeptical but needed food, so got one of the remaining tiny booth tables next to the packed bar. I was given a menu within 5 minutes & my order was taken fairly promptly. They had a featured special & some special beers of the month so I went with a $4 Ale that was decent & ordered a turkey burger.   I was pleasantly surprised that my turkey burger was actually quite delicious & the bun was super soft. It came with a huge pile of fresh waffle cut fries. Everything was hot. I got my tab promptly when I asked for it as well & was out of there within 45 minutes.   As a patron who \"isn't under 30\" this place would not be my choice for evening dining. The noise level was deafening, like being in a club as opposed to a restaurant. But, my food & service were good despite the noisy packed atmosphere so I had to go with 4 stars. If you're under 30 you'll love the place, I'm sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AYA3Axu69-9du1ba1AagwA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Turkey burger &amp;amp; waffle fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AYA3Axu69-9du1ba1AagwA/o.jpg"
      },
      {
        "img_id": "AmpqQcg1H9WQJI3GKSbPzA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Beer &amp;amp; Cider",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AmpqQcg1H9WQJI3GKSbPzA/o.jpg"
      },
      {
        "img_id": "jTrypTGUZRoNZaGrhNog2w",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Rheingeist Dad Beer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jTrypTGUZRoNZaGrhNog2w/o.jpg"
      }
    ],
    "user_id": "dNREuxkWYW3Op83kQiQdWA"
  },
  "lom_2v07y1v7PETomNPB0Q": {
    "date": "2/13/2019",
    "text": "This place is just solid. It was my first time here this weekend. It is great portions for your money and taste great. It was nothing incredible necessarily but the staff was so attentive to my booth, checked in consistently and were on top of things even for a friday night. I had their one special cocktail, I want to say it was the Twelve Twist and it was great with my meal. The pulled chicken was very tasty and we had a wonderful time. Great place to keep in mind for a casual, affordable, and solid spot to stop.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iOHdpvxNuMwJaer8lZUW9g"
  },
  "9wIdIwbYzgcHrhYZ5c-QKg": {
    "date": "7/29/2018",
    "text": "My boyfriend and I were in the mood to grab some brunch one weekend and I wasn't in the mood for the usual spots. I took to yelp and thought the menu at Twelve Whiskey looked fairly good.  The place was a little packed so we ended up having to sit at the bar. As much as I wanted to get the huge bloody mary, I decided I should probably not. I ordered a Irish coffee and they were unfortunately out of the ingredients to make one. I ended up going with the manmosa and I was super disappointed. I'm not sure if it was the glass itself or something in it but it had a very funky smell/taste. I couldn't even finish the drink because it was so gross.  For my entree I got the hangover hog bowl. It was a little smaller than I expected it to be but it was still filling. It was decent but it wasn't anything worth raving about. Tasted pretty basic in my personal opinion.  Overall, I wasn't super impressed with my experience. With all the brunch options I probably wouldn't consider going back to give it another try.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FXtIs1lKoh_fvJMf-HnFxQ",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FXtIs1lKoh_fvJMf-HnFxQ/o.jpg"
      },
      {
        "img_id": "QaRljoUfkZyNF69NEISaVA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QaRljoUfkZyNF69NEISaVA/o.jpg"
      }
    ],
    "user_id": "-Y6tXYPYqeVy37-L5p0rMw"
  },
  "OIog9Ngq9nK3LDi8y2h0Og": {
    "date": "3/14/2019",
    "text": "Beware. Both of us were very sick (severe cramping and you know what else) after ordering Brisket Melt Sandwich. Holding my stomach before even getting in car to leave. Talked to friends online when I was home and they both said same thing happened to them weeks before and they would never be back. Looked online and others are saying the same (see photo posted 120 days ago via Reddit)  Had high expectations and was let down from beginning. Mimicking Southern BBQ, but no Sweet Tea??? So we said Mt. Dew will work. Waitress said dont get our Mt. Dew bc people hate it, its gross. Ok water then lol. Brisket was so bad tasted like straight pepper or something and very dry.  Wiskey bar but Tecate and Belvedere vodka only happy hour specials? What? This is a very wanna be bbq with no authenticity. The South would be very ashamed. What was worse Twelve Bar or BBQ...  Waitress was very nice! And she apologized for them giving us wrong order at first we knew it wasnt her fault. This is like my first review in 6 years so you know its bad...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wx_Lndusw8j_DEjlgOqyHQ",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wx_Lndusw8j_DEjlgOqyHQ/o.jpg"
      }
    ],
    "user_id": "-UHgplR3_MLTznzyVnqsxQ"
  },
  "Y6IQSbwBxB02fgWFisl-dA": {
    "date": "5/13/2018",
    "text": "Came in for brunch on a Saturday around 12 and we were able to be seated immediately. The service seemed a little slow and it took the waitress awhile to even acknowledge us. The food was so good though, so it evened out. I had the pulled pork brunch sliders and my boyfriend had the breakfast burrito. The barbecue sauce they have on the table is sooooo good, I probably could have drank it. We didn't order drinks, but I saw someone get the loaded Bloody Mary and was instantly jealous.  Overall, be prepared to wait for food and service BUT expect good things for the food",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2BBhXNnrDwoyY1y39mUFCQ",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Big azz burrito bomb",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2BBhXNnrDwoyY1y39mUFCQ/o.jpg"
      },
      {
        "img_id": "hgyWTMzxwBN3DO6Dmx4_ng",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Pulled pork breakfast sliders",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hgyWTMzxwBN3DO6Dmx4_ng/o.jpg"
      }
    ],
    "user_id": "6BnvEluqfazShd1tg9kqGg"
  },
  "qXL-akX5UCjxE3eMlKXY7A": {
    "date": "7/14/2019",
    "text": "Mediocre at best. Stale bread. Water served with a piece of lettuce inside the glass.  Brisket required a saw to cu5. Looks like a good place to drink. That's it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nv6AB7IyZuLxW6_HnTUPXA"
  },
  "-BKiII5oblPBBpjnUL10Jg": {
    "date": "8/12/2018",
    "text": "Standard grub and fair, nothing outstanding.   They have a pretty strict dress code posted, more strict than many fine dining establishments I've been to, but, from what I've seen, it's only enforced if you're black. If you're white, it's pretty lenient, so dress accordingly.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C-1Va4XFKb3cqpHuajjB7Q",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Harsh dresscode. Only enforced against *some* people.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C-1Va4XFKb3cqpHuajjB7Q/o.jpg"
      }
    ],
    "user_id": "7kGysjkalCEZ0QtXu5jftA"
  },
  "k3vke4wFdCz386K__RaUkg": {
    "date": "9/4/2019",
    "text": "I'd have to say that we will never go back.  My husband and I shared a whole rack of ribs.  The description on the menu did not specify that they were St Louis Style Ribs.  The ribs were very tough and extremely fatty.  We were very disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-4KZWp5M8vTjsOkz6dnvGw"
  },
  "iNHfqRa714ou8l4-n8ES9Q": {
    "date": "12/6/2017",
    "text": "I was home visiting for the holidays and decided to come here for brunch. I have only been here for drinks to watch a pens game and the food always looked good so I knew it was a must try.  The location is great being right on E Carson Street and is a quick drive if you're staying in Shadyside, North Shore, or Downtown. The only thing is parking can be a pain in the butt, but I'm used to it being a Pittsburgh native. It was a great atmosphere and I liked all of the TVs with sports on. I liked the rustic feel to it.  Our service was great! Our server helped us pick out suggestions for our meals and was very attentive and made sure that our waters were always filled, which was great since we were hurting from the night before.   Everyone enjoyed their meals. The portions are a good size and there are so many options on the menu for anything you're in the mood for. My boyfriend got the biscuits and gravy and it had fried chicken on it - literally amazing. I got the bloody mary with all of the fixings on skewers - definitely served as my meal. There were cheese cubes, waffle fries, a cheeseburger slider, grilled cheese, and a piece of fried chicken. I love bloody mary's and even more, bloody mary's with all of the fixings.  Definitely will be coming back the next time I'm back in the burgh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dU-wcV5GbPAHJPHkBa9GNw",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Bloody Mary with all the fixings!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dU-wcV5GbPAHJPHkBa9GNw/o.jpg"
      }
    ],
    "user_id": "_tEiJs38BkCJvc5sf_y_4Q"
  },
  "SozP_KBn4SvvQRjW_rYXtQ": {
    "date": "4/19/2018",
    "text": "Stopped in here a few weeks ago to watch the penguins game. We didn't have the best luck with our first few seats since one TV was black&white, and another was fuzzy. Finally, we found a spot to watch the game. Our server was not very attentive so we started going up to the bar to order more drinks, but the food was okay for a quick bite to eat.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "3-g-UymQLPcGCKPUGIwN0A",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Nachos with chicken.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3-g-UymQLPcGCKPUGIwN0A/o.jpg"
      },
      {
        "img_id": "48lkgq5d8FSMasLXlGM4BA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Not the best quality TV.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/48lkgq5d8FSMasLXlGM4BA/o.jpg"
      }
    ],
    "user_id": "3CYDgFXGK5M8qfF8COrXGQ"
  },
  "sYQqyrpzfnB8yGjZEp7xZg": {
    "date": "10/13/2018",
    "text": "I first came to Twelve in the summer of 2017 because they were one of the few places on Carson street still serving food late (11PM). And the place was populated, but not packed. I ate here again in the Summer of 2018 and still enjoyed it. I had the brisket both times, which were tender and flavorful. The second time I had the Mac and cheese which wasn't as cheesy as I would have liked.   Although I never had an issue with dress code/discrimination, it has been a long time since I was last there.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XMtle3LEJNmJfmG0Aey74Q"
  },
  "3AxckMOCamh7hNh4dcuZ3Q": {
    "date": "11/27/2017",
    "text": "Visited here for Thanksgiving and did brunch here.   Honestly was quite impressed with the place. It has a great location with great views by the windows. It had a rustic feel to it. Great family atmosphere as well as sports location with a lot of TVs.   The service was excellent. Our server was very attentive to our needs. Waters were constantly filled and she was very friendly. She even helped with suggestions about which meals to pick.   The food was great! It is good sized portions and a lot of things to choose from. I got the biscuits and gravy. The gravy was delicious.  They also have bloody Mary's with all the fixings attached to them by skewers that serves as a full meal.   Great place and I will most likely come back to visit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EG5RpUIxj7PmBvJyK2dElA"
  },
  "rurHflU86esKbk1odNzvzw": {
    "date": "8/28/2017",
    "text": "On my radar for quite some time ..  took my nephew while out and about - on a Sunday afternoon.  He loves ribs and gets them everywhere.   I love the decor when we walked in..  rustic and typical bbq joint - but cool at the same time.  Spacious - and nice lighting.  We were seated promptly at a booth in the front of the restaurant.  It was fun to people watch - the comings and goings on Carson.  The menu was short and simple..  2 sides if you were to get Ribs or Pulled Pork. ..nice.  My nephew ordered the half rack of ribs and mac and cheese and waffle fries.    I had to taste the ribs.. they were good but more fat than meat for sure.   That's the chance you take with ordering ribs.  Some have more meat than others.  There was bbq sauce on the table -which was nice but not several different flavors like some bbq establishments.    I ordered the buffalo blue burger.. think it was called that.  It was probably one of the best burgers I have ever had.   Bursting with flavor.. my taste buds were singing and no doubt that burger was a 'life changer\" (my reference to anything that blows my mind).  We ordered the Cajun - wet style wings for an appetizer and they were dam good - super flavorful.  The service was great.  I checked out the ladies room (but of course) and the decor is so cute..  and was clean.  Prices not bad - typical.   Our meal came to about $40.00 which was standard.   I noticed there was a dj stand too..  cant wait to go back for that some evening!     Puzzling I went to the website <a href=\"/redir?url=http%3A%2F%2Ftwelvepgh.com&s=9e1a36f139d5a27372d35c07e890d7e2bf34cb1cfda1c5d2e4b4492c0bf123a4\" target=\"_blank\" rel=\"nofollow\">twelvepgh.com</a> to share some menu items with some friends- as I was raving about the restaurant and to see if events are posted etc.  The website is under construction? I thought this establishment was open for a while - having a current update to date website is pretty important I would think.  That was a little disappointing. Well at least the website list the hours. Thank goodness for the beloved YELP providing information to the community and the best way possible!   Thank you ...I will no doubt be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "fUUU1HlzW4wTBLs6nwJD8Q",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Buffalo blue burger..  probably one of the best burgers I&amp;#39;ve ever had",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fUUU1HlzW4wTBLs6nwJD8Q/o.jpg"
      },
      {
        "img_id": "bVt1JgNJQdk0im7bx4-EhQ",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bVt1JgNJQdk0im7bx4-EhQ/o.jpg"
      },
      {
        "img_id": "vqRbOO5dCbeWLIC9h3KVzA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vqRbOO5dCbeWLIC9h3KVzA/o.jpg"
      }
    ],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "dE1U8xvPsy6EMXVSTN67vw": {
    "date": "8/13/2018",
    "text": "Don't waste your time in Twelve unless you support discrimination of others. If you're into that, this is your place! Stop by! This place has an extremely targeted dress code. (Just like The Flats, just like Jimmy D's.)   I mean I was never pressed to go in here anyways; only when I've partied and decided to float in here to meet up with friends. But the bartenders and waitresses attitudes suck along with the food they serve. They put a whole new meaning to \"Fuck Twelve\".  If you care, do yourself a favor and avoid this racist place, or just boycott south side in general. Like really, go out of town. See a new city! Who still goes to south side anyways? TBH Twelve, you would have saved more ink just posting \"no blacks allowed\" :) Respectfully, go fuck yourselves.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 11,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nlHoVm7SKWqziEc3KEEPtg",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nlHoVm7SKWqziEc3KEEPtg/o.jpg"
      }
    ],
    "user_id": "Mj9fQrAT0JO6lbGnQgucow"
  },
  "9_sEImmm9m0WXSdSofLFJA": {
    "date": "4/26/2019",
    "text": "Roommate and I decided to get delivery from this place via Postmates last night. Our food took 2 hours to arrive so by the time the food got here, everything was lukewarm. I had their brisket with coleslaw and waffle fries, and my roommate had one of their sandwiches. After taking our first bites, we were unexpectedly greeted by extreme saltiness of the meat. I understand that BBQ meat tends to be saltier but in our case, it was so salty that it was unpalatable. As for the waffle fries, they were sad and slightly soggy likely from being placed in a closed container for too long. I'm not sure if my body could ever handle that much sodium in one meal, so I don't plan on coming back to this establishment for the sake of my health",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jM-ZW2DrQjIU6TGNk7HVlg"
  },
  "oifZyEZAQlo1NdRnglt7pg": {
    "date": "5/3/2018",
    "text": "Best burgers in town bar none... use a triple beef blend that is unreal... has good drink prices, tons of TVs and a good crowd.. definitely a good place to eat.. the brunch is good as well. Basically it is a bbq gastropub style",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PrVaTg8DdIzt1O46Bb1FhA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PrVaTg8DdIzt1O46Bb1FhA/o.jpg"
      }
    ],
    "user_id": "exrXZ2hjraSC6QV2PWaBAw"
  },
  "6oF4rvlI40iZWPlt_ahM-w": {
    "date": "10/7/2018",
    "text": "I've been here a few times, mostly for brunch and have had good food and drinks but this time was different. We arrived at the restaurant at 12:00pm we put orders in for drinks which came pretty quickly and when our friend (who was in from out of town) arrived at 12:30 which is when we placed our food order and it did not come until after 1:45. The waitress told us the reason for the delay was that the printer wasn't pushing the tickets out to the cooks and that it would take just another minute, 30 minutes later our food had still not yet arrived. They gave us 50% off of our food for the wait which honestly they should have comped. I was happy to pay for my drinks that we ordered but the delay in food was completely their fault. I was disappointed because we talked up Twelve to our friend and the the wait for food was ridiculous.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XjgD6DGDMLzsQy8D-Km91A"
  },
  "Qh_SMMA4o1tHKf70ihLYNQ": {
    "date": "4/26/2019",
    "text": "Bread was stale, brisket tough, pulled pork not tender. Ribs were ok. The combo platter was served cold. Everything had a sauce with very little Bbq taste. Cole slaw was good. Beans weren't southern nor sweet. Cheese corn was good.  These guys need to hire a bbq master from down around Memphis or Dallas if they are going to sell southern Bbq.  Perhaps the hamburgers are better than the Bbq.  Thank goodness our company was wonderful!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8BnhiiL8IuvDxQe52tOFqA"
  },
  "KsxDXelG_XOtQ7ywu6pOiA": {
    "date": "2/4/2018",
    "text": "This is my favorite place to go out to eat in Pittsburgh. Everything here is delicious. The atmosphere is great and the service is excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8kx7VydXWc2YKHKyYgEnKA"
  },
  "MvlCp7K867Ly35bBUviyKw": {
    "date": "8/4/2016",
    "text": "A new place to grab bbq and I'm not complaining! What I really like about this place is the specials they have going for each night. Every Tuesday $5 nachos and $5 margaritas, every Wednesday $5 burgers and half off drafts, and every Thursday .50 cent wings just to name a few. What I am most excited about trying is their brunch that is Saturday and Sunday from 11:00 to 2:30. I have nothing bad to say about my experience I had this past Sunday evening. The service was great, the prices are just right and the food was delicious. For an appetizer we ordered buffalo chicken dip and it was served with warm pita, I ordered pulled pork in the regular size and it came with two sides. I decided on broccoli and a side salad. The side salad was pretty large and thats always a plus. It came with croutons, tomato and onion. My mom ordered 7 mild wings and she said they were nice and crispy. It's a nice addition to the area!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "xK8mIKDiw6ONqIL-SLfjoA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Side salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xK8mIKDiw6ONqIL-SLfjoA/o.jpg"
      },
      {
        "img_id": "eKauIDbVil3iwB2Fq_npvA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Buffalo chicken dip",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eKauIDbVil3iwB2Fq_npvA/o.jpg"
      },
      {
        "img_id": "nSvGIdW9oxRfXOgWX1s2hQ",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States. Pulled pork",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nSvGIdW9oxRfXOgWX1s2hQ/o.jpg"
      }
    ],
    "user_id": "mYJW4-M4tcRygSwdT3A6Ww"
  },
  "TRfV7UVzZF3DHV7ZOonr8g": {
    "date": "12/27/2016",
    "text": "The atmosphere is super fun and the food is delicious. The service is a bit slow like maybe they need more waitstaff or something and the food took a long time to come. But overall this place is great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bqPHSff1zCPt9FYkf7hxXQ"
  },
  "eBklz2U1xCckaP6CwmoV-w": {
    "date": "3/26/2017",
    "text": "Excellent food and service. Helps that the bartenders r hot and fast at turning drinks. Andy created a perfect bar/restaurant in the south side",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KK_6mjlGpxGpmePJ5br_Aw"
  },
  "mgSsx95FwTyKwv9R9S8rpw": {
    "date": "1/7/2017",
    "text": "Great place, good vibe. Service was great, food was enjoyable, solid selection of draft beers. Nice burgers, and the barbecue combo was very good. GREAT WINGS!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9GGKrMNmUVemBww-QDdxlw"
  },
  "RrlegknQp6qMubbn067MeA": {
    "date": "2/21/2017",
    "text": "Went here for brunch. My girlfriend had the chicken and waffles and I had the red velvet waffles. Best breakfast food I've ever hard. Staff was friendly. Service was great. Didn't have to wait to be seated. Not one complaint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vi1bYE6jFY5WwJhChwq-3Q"
  },
  "IQ-ttSgeBT4lCug2vKKsfg": {
    "date": "7/26/2017",
    "text": "This place should NOT even be in business.  Went with a business associate to celebrate a recent holiday. Was denied entry by the doorman (who by the way looked like they has just crawled out of a gutter). My associate was denied because he had a white t-shirt on and I was denied because my shorts were camouflage. All the while the person sitting at one of the window tables had the same white t-shirt on.  The most unique part about this is that my associate and I had just returned home from working private security detail for the government. Seeing as that we had just served our country we were only trying to get a beer and some barbecue.  The best part!  It was the evening of July 3rd. Discriminating against the very people who give them the freedom to own this business in their country on the eve of the anniversary to celebrate our independence.  On a side note...The southside is a complete slum. We were dressed better than anyone there.  Out of towners DON'T GO HERE.  Especially if your a soldier.  We got treated better at the Kremlin!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NEpoS0nEkN4ERl0QxKHDMg"
  },
  "AtzICZRFGEsszWycCGhcnA": {
    "date": "8/23/2016",
    "text": "I don't know if they were having an off day, but my 2 stars is being generous. The food was bland, drinks terrible, and service was so-so. Frankly, it's a great place for drinking if you're already wasted from bar hopping and just need a place to sober up. Unless you have a thing for weak, tasteless cocktails, I suggest ordering a beer or glass of wine. They certainly couldn't mess that up. Well, I had super high expectations for their Bloody Mary after seeing the photos on Yelp. Needless to say, I was sorely disappointed in more ways than one. The presentation was acceptable, but the fried green tomatoes was over cooked and the sauce tasted like it came out of a can. The only saving grace was their barbeque pork sandwich. At least that's what my boyfriend said. The fries were limp and the Moscow Mule was barely drinkable. Beyond the esthetics of the place, I suggest you go to Urban Tap if you want a real drink.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CdkbycCxq7WOdQn6gbi-qQ",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CdkbycCxq7WOdQn6gbi-qQ/o.jpg"
      },
      {
        "img_id": "2hKDZpTh47eg1WGvZavnrg",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2hKDZpTh47eg1WGvZavnrg/o.jpg"
      },
      {
        "img_id": "ORB4C26gPt_uYHOulloijA",
        "caption": "Photo of Twelve Whiskey Barbecue - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ORB4C26gPt_uYHOulloijA/o.jpg"
      }
    ],
    "user_id": "QMWghwszNHovcu00CmUzsA"
  },
  "I4gsB6M_eJyDrrgwKc9taA": {
    "date": "9/12/2016",
    "text": "Visiting my family and went to brunch on a Sunday and really liked this place a lot.   From the drinks to the food to the atmosphere this was a great place.   All of us really liked our food and the Bloody Mary with all of the stuff in it was awesome.   Definitely recommend this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HNVyHAElkCSRaFR4gJ890A"
  },
  "EY2BUxVq7Vc3ZnUtlP0OOg": {
    "date": "12/10/2016",
    "text": "This place was hashtag dope. Who knew you could fit so many 10's in Twelve?! The staff there has got me more vertical than the Duquesne Incline! I'd take these chicks and the BBQ all up in my grill any day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zjXpDXbM-5V84dmxwNJNbg"
  },
  "D-prmQrCNJpRlcTdQzuMwg": {
    "date": "8/7/2017",
    "text": "Went here for Saturday brunch and it was AWESOME!  I am from Texas and we know our barbeque...this place does it right!  Food was super tasty and the service was great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZrAnUQPnmkUeqzZyTuqC4g"
  },
  "TVFSS_9AzzLudNwV1CMgOQ": {
    "date": "3/22/2017",
    "text": "Save yourself some time and just go to doce tacqueria next door. Nothing BBQ here. Food is bland and uninspired. Good location, decent service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "W6xW1BsKMCENklerKJBpxQ"
  },
  "mSPtsqNWW9H3fzud61b8JQ": {
    "date": "8/27/2016",
    "text": "Great food!! Great atmosphere!!! I had the brisket hash and it was amazing!! Food and drinks are awesome and the staff and Dj are awesome!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vr3WFS7xrS6T7CdDkXBOkg"
  },
  "zotUSakc9zkqe1tnRdQ4qw": {
    "date": "7/28/2017",
    "text": "Came here for happy hour with a group of friends. We loved the atmosphere and the food was tasty. The happy hours specials were cheap and the drinks were well made. The service was average. The waitress examined our ids which seemed weird but I'm assuming this place is very strict about underage drinking. Will be coming back soon",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oQjo0WdSmoCO_jMzQiEgfg"
  },
  "aFDABxyfLy-6VjRh0qEI5g": {
    "date": "10/16/2016",
    "text": "Went to twelve with a group of friends. Was told no hoodies aloud ( I counted at least 5 white guys in there with hoodies on and I wore one the week prior in here) I took my hoodie off and had a pittsburgh t shirt on. The bouncer then tells me no t shirts it's a casual dress code. At least half of the white people in there had on t shirts. I'll never go back to twelve the are racist and rude. I'll take my money somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rim7h7wv1OnefQfd_HULiQ"
  },
  "E5ndeBDlgpNflnTD6HhLXg": {
    "date": "6/11/2017",
    "text": "I just finished the Balint's Market Melt. I've eaten here several times for brunch but never realized how incredible the regular menu is as well! If you're a first time visitor to this city please stop her for lunch or dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6UC7hQ5IA3AzDGkl1mRVjQ"
  },
  "GeQjEte1YHduykZsbKvO5g": {
    "date": "4/22/2017",
    "text": "Went to 12 for the first time today. Holy cow!! Amazing! Service was top notch, food was even better. I had the Brisket Benny, my friend had the Biscuits and sausage gravy and added chicken. Absolutely delicious. Great music while you eat, too! Will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AvQKnpzyChxYtltlpgb0iQ"
  },
  "Hl8fdyc69j2neV2AxX5K-w": {
    "date": "8/27/2016",
    "text": "Awesome service, great atmosphere! The Dj was so much fun and he had great music. We came for brunch, the mimosas and grapefruit mojitos were delicious. I had the omelet with potato shreds.. SO GOOD. 10/10 would recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JsRESLRj9xZuv-yzkxUbLg"
  },
  "9JICA75aXjojRAHJy6mZVA": {
    "date": "9/4/2016",
    "text": "Twelve has played a crucial role in turning Pittsburgh's Southside reputation around.  From the beginning it has set exceptional standards to adhere to and has maintained them all this time later.  Unlike other Southside locations, Twelve has an open floor plan closely monitored by a number of security guards making it a place where you feel safe.  The legal occupancy is followed to allow for space for patrons to move and enjoy themselves without being on top of other guests.  This is why when I do go out, this is always where I go.  The music is always great, playing mostly top 40 music mixed with throwbacks with DJs that create a welcoming atmosphere.  They are always interacting with the crowd, and don't be surprised to see the owner, Andy, greeting people himself and making sure they're having a good time.  As far as the newly opened BBQ dining hours, I have been fortunate enough to try a \"Twelve Whiskey BBQ\" burger which has won a few awards; I believe in 2015 & 2016 at the Pgh Burgerfest!  People don't take the time to fill out these reviews unless it's a really good or really bad experience.  I repetitively am guaranteed a good night with a mature crowd here.  I look forward to seeing Twelve continue to reinvent Southisde and will continue to support them!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KO6erBfK7iPLupSlZIP5xw"
  }
}