{
  "F7fCalnWBBnOVm9T2yvrnw": {
    "date": "6/23/2012",
    "text": "I haven't eaten at every joint in Pittsburgh, but I'm convinced that Homewood is the center of Pittsburgh's barbeque world. There's the Dream BBQ, and the Showcase, so close to each other you could do a rib-off and the sides wouldn't have time to get cold. Both are good places to eat, but the Showcase edges into greatness with ribs I found slightly more tender, greens that are fantastically smoky and good, and a Hot as Hell sauce that lives up to its name and is actually quite addictive. Vegetarians, if you get dragged here, it's worth noting that the sides are prepared without pork (according to the menu), so you have some delicious options.    Having eaten at both, my choice of Showcase or Dream might actually depend on the mood I'm in, the kind of sauce I want - but if I had guests and wanted to feed them really, really impressive ribs, I'd head over to the Showcase.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "3vYsjC90S80legSDDTmqcA"
  },
  "-Ab0N8SuYCRaSixnO9G8-A": {
    "date": "5/16/2012",
    "text": "Love Showcase!  1. tender, tasty bbq wings, ribs 2. cheap-i tend to get the children's meal, which i like to call 'the fat kid's meal' cause it's just that 3. large wings 4. awesome sauce 5. awesome friggin greens  6. mac and cheese-also finger licking good. 7. i ve never had a problem with the service admittedly, the place doesnt look like much from the outside, but im not planning on eating the building. im eating the wings! you can eat in, or out on the picnic table, or take out. ive done all three, generally the latter. check it out! im getting hungry now! :))",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "xcvpnyHvPpSoyxxGgmMUkQ"
  },
  "EH8X742DPntEGL7KyI8cog": {
    "date": "5/26/2015",
    "text": "Stopped here on Mother's Day because we didn't feel like cooking.  The line was long but it was definitely worth the wait.  The waitresses/order takers are amazing at keeping track of everyone's orders.  Definitely will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "01IfZk7itXErPVzU72I1Ow"
  },
  "V8BFEHyofIw1GSJTc8IM3g": {
    "date": "3/21/2015",
    "text": "I absolutely love this place! The staff is great  and the food is delicious. I normally get the chicken wings and from time to time I'll get some ribs; either the pork or turkey ribs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N_LyFYrey_LuxJFkdFwRkw"
  },
  "yA7_NfTLC_laX9dHgCtQcw": {
    "date": "7/26/2015",
    "text": "I got six bones, greens, and mac & cheese.  I asked for the hot bbq and the lady behind the counter warned me that it is \"hot as hell.\"  She was right, I like hot, but this was above my threshold.  She just sprinkled in the hot bbq sauce with the classic sauce.  The sauce was perfect, Mac & cheese was delicious, and greens were great.  The ribs were very tender as well, but were a little over cooked in some parts.  Overall, this is the best bbq meal that I have had in Pittsburgh to date.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YTuksHb6YsMI62BqEG_eRA"
  },
  "B6pVg-hqhJSBfnicih45xQ": {
    "date": "3/23/2012",
    "text": "When they call themselves showcase, they ain't joking. You see smoke all day long till around 6pm when they close, so go before it's too late!  I get their 2 ribs (and do I mean they are BIG), 3 wings, their home made BBQ sauce, with a dab of hot sauce, with mac and cheese and rice and beans. Meal made fit for a queen. Just under $10.  I don't think I would ever want to eat BBQ anywhere else ever again. It's even making me hungry by the thought of it now.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "FWyF9OZ2YUsq1mGYpoKM2A"
  },
  "yYKP43vnYrxEYPlwvvjxKw": {
    "date": "6/1/2012",
    "text": "I travel all over the United States and have had multiple types of authentic southern BBQ and was always disappointed to return to Pittsburgh and nothing was quite that tasty.  Well I found that tastiness in Showcase BBQ.  I will be back for some of that tasty food.  Friendly service and great food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q5EVWdId8_GZftqguZbFKA"
  },
  "A67dOhuffjpzweqquBfxRw": {
    "date": "6/30/2014",
    "text": "The giant smokers outside are a True sign of things to come. I ordered 4 ribs, greens, and Mac n cheese. My plate was so heavy I thought the to go bag would break. I just finished my 3rd meal from this one plate all for $10.50.  Very smokey ribs, tons of meat on em too. Hot and mild BBQ sauces, hot was very flavorful but too hot for me. I took a small dab of it with the mild at the recommendation of the nice lady serving.  I had the best greens of my life and excellent Mac and cheese.  My fiance got ribs and wings with amazing BBQ beans and candied yams. This kind of food is hard to find and good for the soul.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cznGJgYRkWvhontgwLmOrw"
  },
  "gsE_BxPbEXCRHOE9A6VVKA": {
    "date": "2/23/2015",
    "text": "One of the best bbq/soul food takeout places in town! I just want to lick their homemade sauce that they put on the ribs and chicken .. its umm, umm good! Everything is delicious. They have a nice selection of meats and sides that are usually already prepared (you don't have to wait long). I've always had good service and a smile when I go to Showcase BBQ. My only suggestion would be to add some corn bread to the menu and a few more specialty side dishes and desserts.   Looks can be deceiving. This is a small take out restaurant at the border of Homewood and Lincoln-Lemington. Don't be afraid, you are safe to park your car and go inside and order food.   The owner is always grilling food outside, no matter what the weather. And we know the weather can be nasty in Pittsburgh (snow, rain) - but he is always out there.   Showcase also does catering and I've had their food at local events. I definitely recommend this place. The prices are RIGHT and you get a lot of food for the money. Most dinners are about $10.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cf7cqd7deB2cGEabTpBCww"
  },
  "WqRgbi9811i-vBCp-y_-GQ": {
    "date": "7/26/2014",
    "text": "Always been a showcase regular ever since i was a kid i grew up on tha best bar b que n the city!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EY5qpYQVe1jEWPN1GGUCIw"
  },
  "IZODYGpM-eGjZK3k4oLSAA": {
    "date": "4/3/2016",
    "text": "Real love goes into the food here. Skip Union Pig & Chicken & Paycheck and get a full rib meal with legit mac n cheese and greens for they price they're posting for a sandwich. Hot sauce that's really hot, too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x3ei6Z5sNoMP1Qg74_arpA"
  },
  "_XOhu1SanVSYIVkM-iUN4Q": {
    "date": "9/16/2014",
    "text": "Best ribs in the Burgh. I was informed about the place from a freind. I have tried a lot of BBQ in the area. This hands down is the best that I have had .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pCr5xIn7pJZXRSIENw33YA"
  },
  "N0tVJbN7Jcj-sbrfGN_BiQ": {
    "date": "8/19/2013",
    "text": "Thought I would try a new (new to me, anyway) BBQ place yesterday and settled on the Showcase. If you are fussy about appearances, you'll probably want to go elsewhere, as it is spartan on the inside. But I'm only interested in the food, so it didn't bother me to get some takeout.    We got a half-rack of pork ribs, a pulled pork sandwich, mac-and-cheese, and baked beans.  The ribs were pretty good, with a good bit of crispy bark, a little on the dry side and middle of the road for meatyness. The server put the sauce right over the ribs and dished out a hefty amount.  I loved their homemade sauce and kept slathering it back onto the ribs each time I picked one up --  I might still have a little in my ears, actually.  The mac and cheese wasn't the very creamy style some people prefer.  I really liked the taste and was glad I could eat it without worrying about drips.   She liked the pulled pork which was served with the sauce on plain white bread. The baked beans were too spicy for her and she gave them to me after three bites. She wanted to eat them but the heat level was beyond her low level of tolerance. They were very tasty but I agree they were hot.    Both of the sides were generously sized.  The inexpensive prices earned the 4th star. Would go again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tdAOfrdNHBeWkASn90Lk6A"
  },
  "GZG5DuMnYkJEtEFoDbR1ow": {
    "date": "10/5/2013",
    "text": "The ribs are wonderful, meaty and tender. Twelve bones was plenty for 3 people. If you add sauce, expect to be pleasantly surprised. We also enjoyed the wings, well done and crispy. The yams side dish was delicious. Our group was not so impressed with the Mac and cheese or the potato salad. The baked beans were good, with a little bite. We'd go back for the ribs and chicken!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Z5pchVE-rD11hJbk_nbpg"
  },
  "yDLAHs91nOaCanVysrTfWg": {
    "date": "10/27/2015",
    "text": "It's exactly what it says it is - great barbecue. You're not going to go here to find white tablecloths or the like, so you'll get just what you expect.  I had the 2 ribs, 3 wings, and 2 small sides dinner ($10) and it was plenty. The ribs were huge, there was about as much rib beyond the bone as there was on it. The thicker end with the bone was about an inch and a quarter to an inch and a half thick, and it quickly fell apart into two pieces when I picked it up. The meat had a little chew to it along the thinner edges, and the thick parts just fell apart, just the way I like ribs.  The mild sauce wasn't the usual intense red, I'm not sure what region to identify it with, but it was good. The hot was a bright red, and they warned that its very hot. I tried it too, and it's definitely on the hotter end for barbecue sauce although I didn't think it was too hot for the ribs.  I'm glad to have found this place just a couple blocks from where I'll be working for a while, I'll be going back for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "StddXvP59PNWdF0UV9Pf2Q"
  },
  "TnQgxIIs2IY62YhQM6qbDw": {
    "date": "7/17/2012",
    "text": "Disappointing at best. Ribs were dry, sides were sub par, service was average, neighborhood was one step up from Demascus. Not to mention the fact that the building looks like it's about to burn down and there's probably several health code violations. I drove across town to eat here because the reviews were so good and regret my decision.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "cUUCMncwWZm57s95iUX1Gg"
  },
  "nJ1EkVWkHrax7hkezHnCkw": {
    "date": "11/1/2015",
    "text": "I have tried the turkey ribs w/sauce, greens, yams, and potato salad. All of which were very tasty! My mom enjoyed her pork ribs too. I will definitely go back to explore further.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RQK14L5ndm_NF_3u_uD_2g"
  },
  "GHXp2-4O4J08kNK4HfJAZQ": {
    "date": "8/22/2012",
    "text": "The portions here were very large.  I came here because of all of the good reviews i saw here on yelp and to be honest their ribs were tough their beans way too salty and the mac and cheese was just okay.  This is not a five star establishment the price and portions are excellent but the food is no where close to where it needs to be.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gSUU4Kq_Xm09cnmBkqj8Ag"
  },
  "im8WSxzC9OuHSIU7zNnpMQ": {
    "date": "3/20/2015",
    "text": "Great spot. I was already expecting everything to be good, but almost everything was better than expected. The broccoli and cheese which I ordered on a whim ended up being a 10/10 and a huge surprise. I was really impressed by the baked beans as well. Sweet but still a little vinegary and also cinnamon apple or something? What the? The sauce all over my brisket sandwich (which I ate open face like a savage - recommended) and my girlfriend's ribs was great. It is the definite star of the place in my opinion. The meat was obviously good, but I eat BBQ for the sauce and the sides and I was not let down at all. My only complaint would be that the brisket was barely room temperature. Everything else was piping hot and ready to go. Not sure what that was about. But it was great anyway. They do apparently have cornbread now for $1 but I forgot to order it. Next time I'm going to try the turkey, the corn bread, and maybe their hot sauce!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mcVFtQdatb78gclcsImstw"
  },
  "2f-qgnwJXw9S8G1uSrxoqg": {
    "date": "3/31/2012",
    "text": "I would give this place six stars if I could. It is absolutely amazing. Best ribs in town. The barbecue sauce is homemade and honestly addicting. The Mac and cheese is homemade and melts in your mouth. The greens are so good a well. The ribs are just cooked two perfection. You will never want to go anywhere else.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "sCcQ7YBYseFAE026JFOFtQ"
  },
  "5zBs0X1YaAA_AJfY3D2Vvw": {
    "date": "10/17/2016",
    "text": "Went to Pittsburgh for a funeral and stopped by Showcase BBQ. The staff was very pleasant, the ribs fell off the bone, the BBQ sauce looked like gravy but was very good. and the price was very reasonable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "On-rZH0Sv8Yv8VKIBGGjsA"
  },
  "MgLPo8ocYdBItudzQj7wOQ": {
    "date": "9/23/2017",
    "text": "This is the best bbq in Pittsburgh. They're always quick and the food is always great. It's becoming more known but for years it's been the best kept secret in town",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jEJe4HpbeLj9jeb-DKCe9g"
  },
  "s1mbGfTtBI2Lr1dzBdd6MA": {
    "date": "6/27/2016",
    "text": "This is best BBQ in the Pittsburgh area! Ribs are always  moist and tender! Sides are tasty great variety almost always available!  Except 30 min before closing ! You can smell the smoke from this place for 1/2 mile radius!  Can be busy so get there early!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_8mzOe3HFwHC5M_8InvO6g"
  },
  "Jzbj0klYwbsuq8vH3R0QMQ": {
    "date": "3/16/2014",
    "text": "Appearances continue to deceive, especially when it comes to low-key places like this one. Passing by this place, I almost missed it, but then our noses were alerted to the huge grills outside the side of the shop. So impressive! It was barely above freezing the day that we went, but this guy was grilling those ribs like no tomorrow. Good publicity technique, to be sure, but we took this to be a good sign right away.  The place itself is quite small; you walk in and you immediately bump into the end of the line if there is one. You order from the counter as usual, and there are a few (like 3 or 4) small tables to the side if you want to eat in. I don't know if it gets full here; we came around 1 but during our stay no one customer ate in.   For about $18, we got a 4 bone and 6 (but they actually gave like 9!) wing combo, plus two sides and two sodas. It was so cheap, and we almost had trouble finishing everything in the end. Their homemade sauce is quite interesting--not too sweet with hints of sour. Went really well with the wings. But for the bones, both the pork and turkey were so delicious that we didn't bother smothering much sauce on them. The pork ribs were large and tender; the turkey was juicy and delicious. I will be honest here--never in my life have I really enjoyed turkey before this. I've always deemed it too dry compared to other poultry, but their turkey really is unbelievable.  As for the sides, we got the candied yams and greens. Both were great choices, and they gave hearty servings of each. Really good complement to all the meat, making our overall meal a great experience. This will definitely be our future go-to place for pork ribs and turkey!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "JdRMJqGM5c6aY12Pkdu_Ng": {
    "date": "7/13/2016",
    "text": "Hands down the best BBQ wings in Pittsburgh. Fantastic turkey ribs. If you're feeling daring try the Hot sauce. I like to mix the mild and hot together. Honestly the seasoning is so good sometimes you don't even need the sauce on. Great place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zl27BmsLKIM4AiyIGF8itQ"
  },
  "9bcciiLaQknaLUdUGPSqsQ": {
    "date": "4/7/2016",
    "text": "Their pork ribs and chicken wings are to die for! If you love spicy food, don't forget to ask for their devil spicy sauce. It's is SUPER SPICY but so addictive too! Having lived in Memphis for 6 months and nothing compares to what they offer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-v8aVYjXCciT0f7btiOkzA"
  },
  "MjpdG3hcMj7hdNf_VHlIdA": {
    "date": "8/10/2013",
    "text": "5 Star food at One $ prices. Easily the best quality for your dollar in the city!  The staff was super nice to the point that if the food was average I would give it four stars. When I saw the prices I thought maybe I was confused or something was wrong. I ordered 6 ribs, mac & cheese and candied yams for $14. The ribs and the sides were amazing and nothing I write could do them justice.  (the following is included to shorten the line) Showcase is in Homewood in a building that from outside looks condemned with all the boarded up window glory. If it weren't for the whiteboard outside that said \"Open Today\" I wouldn't have gone in.   They only have like 3 small tables and all the food is served up in styrofoam containers so this is clearly a place where the food is meant to be taken out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "3I2wGF73UOPMuwSuzMCYWQ"
  },
  "Ds-9QV7l8FVsxbwEFc60hQ": {
    "date": "4/3/2016",
    "text": "This place needed a photo on here to do these ribs justice.  Smokey as hell and a mustard sauce that will make you wanna slap your Mama!  Real deal BBQ in the Burgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SF6QEsS8rsOLbhvnL1Mlmg",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States. Pork ribs with mustard BBQ Sauce. Smoked to perfection.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SF6QEsS8rsOLbhvnL1Mlmg/o.jpg"
      }
    ],
    "user_id": "0NIUd76PDqnXm53ud57eGw"
  },
  "1gVJiI667VsJaQWeJPzozQ": {
    "date": "1/14/2016",
    "text": "Both the pork and turkey ribs are to die for - but, if you haven't ever had turkey ribs, then you're in for a treat! The 6-bone dinner with two sides is plenty for two people to split; and, prices for everything else are well worth it. The sauce has a great kick, though the ribs are good enough to even eat with out it. Greens, candied yams, baked beans, mac and cheese...try it all - I've never eaten something here I didn't like. Showcase is one of the best BBQ joints in Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YNkbvkPhLMFlOFYH2PLMwA"
  },
  "W6VZTq-XixcVIitne-5Cig": {
    "date": "4/30/2017",
    "text": "Everything was just awesome here. Ribs - tremendous!  Turkey ribs - outstanding.  All the sides - delicious!  Friendly people and great at their craft.  I'll be going back next time BBQ is on my mind.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CZEKc6muIm7XHqCnjq7QdQ"
  },
  "d0QUpP4baOtYAlvTgIoCOg": {
    "date": "3/27/2013",
    "text": "I am a native Pittsburgher, but my soul belongs in the south with soul food and all that other good stuff!  After celebrating the end of finals, I sauntered over to East End brewing with some friends. After a few tastings, we decided we were hungry for some RIBS.   Off we ventured into the cold, the wind cuttting like shrapnel as we traverse the path from East End to showcase. Our foray towards the smoked barbeque glory would have made Edward Hillary proud. Our heads looking down to the ground, and holding on to our caps, we continued in single file and single purpose.  Showcase was a beacon of light, reminscent of the smoldering campfire in the middle of the woods to ease weary travellers. The equipment was simplistic, half drum smokers wafting a delicious and time honored recipe into our nostrils. As we huddled inside, taking in our surroundings, we saw that other travelers of all walks of life underwent the same pilgrimage to this protein laden Mecca.   Samples of ribs, greens, turkey legs, and macaroni and cheese were passed around in a communion to the gods of barbeque.   Moist and succulent morsels dimmed the conversation to non verbal affirmations and murmurs of delight between mouthfuls.  The staff was pleasant, undertaking their holy work with gusto and pride.  Showcase,   I am a believer.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 6,
      "cool": 6
    },
    "photos": [],
    "user_id": "s_PI8eOGJdoYCIGCSmBN8Q"
  },
  "2-A_rF2xjF03QDTi_Swjiw": {
    "date": "8/25/2013",
    "text": "Surprisingly good value coupled with a down-to-earth staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_85nGzHDRvD1ElaQw8wjHQ",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_85nGzHDRvD1ElaQw8wjHQ/o.jpg"
      }
    ],
    "user_id": "L24lwOtCetlcV6kOJvBi1A"
  },
  "IDqrMiqY41b3sXBftzTFGg": {
    "date": "3/30/2016",
    "text": "The giant smokers outside are a True indication of things to come. I purchased 4 ribs, greens, and Mac n cheese. My plate was so heavy I believed the to go tote would break. I just completed my 3rd meal from this one plate all for $10.50. Really smokey ribs, short tons of meat on em also. Hot and light BBQ sauces, hot was quite flavorful but too hot for me. I took a little dab of it with the light in the recommendation of the fine woman helping. I 'd the finest greens of my entire life and superior Mac and cheese. My fiance got ribs and wings with astonishing BBQ legumes and candied yams. This type of food is difficult to locate and great for the soul.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j6iSqBMy_MuMw-_uZIlHNg"
  },
  "N1ISYETzfNTmu_rKCiQbtw": {
    "date": "8/3/2014",
    "text": "This was great tasting food that will leave you say wow! We are from Out of state but left a great impression. Great people. You need to go",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A8P2IG78AtmLOsa5DGBhGg"
  },
  "Rwcxy6v4o1raSC8UMJvm8g": {
    "date": "10/9/2015",
    "text": "I stopped by Showcase recently to get a quick BBQ fix and they did not disappoint! The smokers were firing on all cylinders and the smell was delishly intoxicating.  I ordered a dinner for my Mom that included 6 pork bones, baked mac n cheese and greens. I ordered the wing and pork bone dinners with a side of potato salad and collard greens. The sauce was superb, sweet and complimentary to the smoke.  The meat was cooked very well and fell off the bone.  There were a few pieces that stayed on the fire too long, but still good.  The greens had just the right amount of seasons with the touch of vinegar. My potato salad was perfect and had a good balance of eggs, relish, soft potatoes and seasonings. Mom's mac n cheese was very good, creamy with lots of cheese. Overall, the experience was great and the price was right! It is a blessing when you can find good BBQ soul food in Pittsburgh. I will be back again to try the turkey ribs!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NBxTQoYwzrAgydPGqnFw2A",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States. Ribs and wings platter with a side of potato salad and greens. So good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NBxTQoYwzrAgydPGqnFw2A/o.jpg"
      }
    ],
    "user_id": "LbSRTGCY1STRCo6kzV4xBA"
  },
  "bwqH9RNNj_ZXq-L04HDR2Q": {
    "date": "6/20/2015",
    "text": "I met the owner at work one night and he told be how good his BBQ is. So I took him up on it and stopped in to get lunch for myself and a friend. The ribs with the house BBQ sauce are a solid score of awesome. The wings were small but ordered 8 and they gave me I guess 10 to make up for that fact. They were smoky and really yummy. I also got the sides of greens, potato salad and Mac n cheese. The greens were greens. They had a little kick to them and tastes great. The Mac and cheese was good and the potato salad was also good. I'm a picky potato salad person so it's very hit or miss with me.  The price was cheap the food was generous and delicious. This place might be out if the way for some people but don't let the outside fool you. It's a great BBQ dinner waiting for you to pick it up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mgBV3YmtaEqKmvrOHKQXfA"
  },
  "83bhF8Pjd1GNoXxH79Rl4Q": {
    "date": "10/19/2016",
    "text": "I knew it was going to be good BBQ when you saw the smokers on the side of the building and the long line. I don't like chicken wings...but now I like chicken wings--if I can get them from Showcase BBQ. The ribs were amazing as well. I love mustard, so I wanted to straight up drink their BBQ sauce. However, if you aren't a mustard fan it may not be for you. I'll be dreaming of this place until I visit Pittsburgh again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xYhXh6q8QkTwe4nhI9cIog"
  },
  "-i7J4Js7kqTOdSre8sSE7w": {
    "date": "7/24/2016",
    "text": "Very good ribs and wings. The bbq sauce in Pittsburgh is weird, sort of horseradishy. but good. Drew is the grillmaster! This is strictly carry out, but there is a picnic table out front if you are interested,",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vlRU91OoO3AiiJFShFgTlQ"
  },
  "g3sDwKmPdPjmxr_W57GdFQ": {
    "date": "8/30/2014",
    "text": "Good BBQ is hard to find in PGH, at least for someone coming from NC. I was happy } to find Showcase BBQ and went in on a Tuesday to order for a group of 10   to be picked up on the following Saturday. The young lady that took my order was very sweet but over sold me, we had enough to feed 30 to 40 people. I gave a deposit for 50 percent and was called the day before pick up to be informed the cost would be double what I was quoted. Ok, I had no choice with 24 hours before my guest arrived so I agreed to pay the difference. Went to pick up on Saturday packed it all on my car. When I got home I found the order was incomplete, could not call back to ask for the rest of my order as they would not answer the phone. Over charged and under served, will not be going back the owner was rude as hell.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "dGADkQVvbQhgHYYRfuGYFg"
  },
  "HRGa-GIOPd41beFdueJgCQ": {
    "date": "7/18/2015",
    "text": "Came here to finally try the ribs! Fiance had ribs and double mac and cheese, I had a BBQ pulled pork sandwich with greens, beans and mac and cheese. The sides were great, especially the greens! Super flavorful with just a little bit of spice..they were perfect! I was slightly underwhelmed with the pulled pork, but fiance said he LOVED the ribs. The sauce was great too. Not the best BBQ I've ever had, but not bad for Pittsburgh either.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5qAQt0mFuM8uWmymF-6iPQ"
  },
  "_n-10GBzXwi5t8CBmubhrQ": {
    "date": "9/17/2016",
    "text": "Ordered Ribs, Wings and 2 sides for $18. The bbq sauce that comes on the side is really different from any other sauce I've tried. Its both sweet and spicy. The meat itself was very good and I loved the green beans. This was definitely enough food for two people.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HvDBT2whHCalPX7eWgmrqw"
  },
  "f530h-ESPONVoTNVz4WVIw": {
    "date": "4/30/2016",
    "text": "The best!!! Having lived in Memphis and traveled to a few places in Texas, I think I can say I'm not a noob in bbq. This place amazes me every time! Juicy, smokey, and full of flavors, the meat is just unstoppable! The amount of smokiness is just the right amount, and the portions are always big. We always ask for the spicy sauce and loved it. The level of spicy is definitely not for the faint of heart, but it goes wonderfully with the meats. Somehow we never had a chance to try their turkey rib (none in the evening!), but the chicken wings and ribs are already as good as it gets.  It's not in the best neighborhood possible, so people sometimes miss it. But this is truly THE bbq to have in Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "T_YJxmDyoWk6i0wU5UI19g"
  },
  "viN-j4_rvaA1FWgJfkfsQA": {
    "date": "3/18/2018",
    "text": "OMG! Their turkey ribs are OUTSTANDING!!! The are flavorful and the meat falls off the bone. The give you a generous portion. I swear they give me more than they're suppose to. I'm not complaining at all. The service is good. I've never had any problems with food or service. The prices are more than fair as well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2H3PyftDlizkICoTdm-4Bw"
  },
  "UBZx1S2u8aaVBfNuMvqEpw": {
    "date": "2/28/2017",
    "text": "Great ribs to be found here ... a worthy alternative to Dream House BBQ if that's out of the ribs you want. Meat on the ribs tends to be super moist, juicy, and full of flavor. Sides here are also pretty dope - the mac & cheese, yams, green beans, and more. Baked beans here are probably some of the best I've had ... and having been through numerous summer camps where baked beans of this kind are served, I think that's really saying something. In general, you will definitely leave here with some great tasting food that is pretty much guaranteed to leave you stuffed. Worthy of coming here at least once for sure!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "MLf4JUa1uzQkDLrBJ5yJHA"
  },
  "7T9o7Y_uavha2IRuFusCGA": {
    "date": "8/30/2017",
    "text": "Just posting an update to say I can't believe it's been two years since we started coming here, and we still haven't found a single place that even comes close (in Pitt, Chicago, or Cleveland!)!   Hands down the best, and cheap too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UwR5-EQtDw-Py8ldExWc4Q"
  },
  "8nu7GKlJnxp2pbZwaQtARQ": {
    "date": "5/24/2014",
    "text": "Good food. The price is right and the service was good. I had grilled wings, candied yams and collard greens. I tried the mac and cheese as well as the baked beans. I enjoyed everything. They have ribs for all you bbq lovers. I recommend this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "e4pPNWwQBpvl9a_TGWEv5w",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States. Wings, yams and  greens",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e4pPNWwQBpvl9a_TGWEv5w/o.jpg"
      }
    ],
    "user_id": "pr8_C12oHakeNB4ZPp_dig"
  },
  "pl3H1g4wuTzayrb-fQmsHw": {
    "date": "4/28/2017",
    "text": "I treated my son to some of those ribs and fixing..he loved it.they even have turkey ribs..they were good..the Mac and cheese was good as well..thy lady tht waited on me was nice friendly and efficient with getting my order together.i definitely will go there again when my son wants ribs..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "d4T9T2EX-46r9fhHddZKEw"
  },
  "9ARp8oy69zOUnBVIb_j3fw": {
    "date": "8/22/2017",
    "text": "Got a 4 bone combo with 6 wings 2 sides and 2 sodas.  A True adult happy meal!  Sides were these really kicking baked beans and delicious green beans.  The ribs were meaty and had the right amount of smoke and great flavor and texture. But the real star here were these smoked wings.  WOW!!! These were without a doubt worth a trip back to get more, they are THAT good!  Sometimes a line when you go, but after eating here a few times that is no wonder that this place gets a line.  Cash only, but worth every penny  I think it was like 20.00 and I was quite full!  And yeah....I got some sauce on my shirt.  But it ain't real barbecue if you don't get some stains on your clothes.  That's why you wear your old clothes to a barbecue!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PXVt6mYWYhiCPooXpoeORQ"
  },
  "UweCCayneyzKUZOn8xPRXw": {
    "date": "1/24/2017",
    "text": "Really chill staff. Dope food. The turkey ribs are a weird sleeper yet absolutely dynamite. Convenient location. Outdoor seating is nice. Great prices. Many sides to pick from. Highly rec this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iJELxrdYsVtHtk_W__PttA"
  },
  "YfIAn3xM3vGVJmtZUH5ntQ": {
    "date": "3/2/2016",
    "text": "First time having BBQ from the East coast...and being born n raised im Texas...I must say this is some of THE BEST BBQ I have ever had!!! Definitely will going back for more!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NE8icBF6d5brMDRIRRCFpA",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States. Incredible!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NE8icBF6d5brMDRIRRCFpA/o.jpg"
      }
    ],
    "user_id": "C_VkLbYAZcovMa19j37cOg"
  },
  "aNLfQ2Yo1F7dZ3qd1Apt0w": {
    "date": "5/18/2017",
    "text": "It was a lot of food for the money, and the staff was super nice and friendly.  I had ribs, green beans, and macaroni and cheese.  The ribs were adequate, moist but a little rubbery.  The mild sauce was way too mild and ketchup-like.  They apparently didn't have hot sauce when I visited.  The green beans were cooked to death, which was probably intentional.  Not my thing, but some people like them that way.    The mac and cheese was tasty.  Next time I'm in the neighborhood, I'll probably just get a bucket of that instead.  Ambiance was good, standard BBQ joint.  Clean and in good repair.   It would have been nice if they had some wet naps or a sink to wash up with after a sticky meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9-0dpW-rkP8O0mGCwI3xwA"
  },
  "Cs6XDj7j6PFZNoBHMvQ2nA": {
    "date": "6/21/2017",
    "text": "Best barbecue in Pittsburgh. Friendly service and fair prices. The mild BBQ sauce is delicious and the hot sauce has a real kick. Sides are delicious as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OOMbALZqOxRIrJfZy4oezQ"
  },
  "UjJDcjRu8bu799vd31FC1w": {
    "date": "11/24/2016",
    "text": "We had been dumped by our caterers the week of a birthday party for 60 people. I called Showcase on Wednesday evening, and asked if they could have a large order by Saturday. The woman I spoke with said \"absolutely!\" She was helpful and so great to work with. The food was fantastic!! Showcase made a tremendous amount of food, and it was delicious! All night long people were asking where we got the food. We're looking forward to eating at Showcase again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_r0tVYzImX0jJvTwkl19Qw"
  },
  "9bHKPsvfAHdazgmBHmJ3Ow": {
    "date": "11/13/2016",
    "text": "We are in town for the Steelers and Cowboys game and looking for some good BBQ.  I saw the reviews and decided to give it a try.  The food was delicious!  Everything, the ribs, chicken wings  and all the sides.  Truly tastes like home cooked food.  We got to sample the turkey rib and it was moist and seasoned very well.  I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YInYS6uh4XzT0UwLMsSX8w",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YInYS6uh4XzT0UwLMsSX8w/o.jpg"
      },
      {
        "img_id": "snxRARHbGXVck_x8p5o3LQ",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/snxRARHbGXVck_x8p5o3LQ/o.jpg"
      }
    ],
    "user_id": "BUyoVfpmyUp1FDAQhvQdTQ"
  },
  "XCYezR1HifZ3Sed-dfmKuA": {
    "date": "7/15/2015",
    "text": "Been living in Texas for a while now and I know when I come home I have to get some of your famous Turkey Ribs!!! Ordered a slab and decided to get a large side of Greens and a small side of sweet potatoes,  until the worker informed me that,  2 large sides were INCLUDED with the slab.  Expecting to pay a little over $25 dollars, I was ready to pay and the cashier stated my total was $33.44. Huh? How when the menu clearly states the ribs are $23 and small side $2.25... I was told that I was paying for a Slab Dinner,  in turn charging me for the 2 large sides and there was a extra $1 charge for them being turkey, ok? I did not ask for a dinner,  I was told the sides were included... So that's how y'all are doing business Showcase!? very disappointing when this is one of my favorite places to eat when i visit my hometown! I paid for the food and decided NOT TO TIP (which I always do)! But YOU WON'T FooL ME AGAIN... So for that I give you a 3 star instead of a 5, which I had planned to do if it had not been for your misleading pricing! Keep up the good work with the delicious Turkey Ribs, I May be back, wish I could find them in Dallas!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CxxvSmu7qmrIZMPOs11y_w",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States. Turkey Ribs, Candied Yams, Collard Greens, and Mac n Cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CxxvSmu7qmrIZMPOs11y_w/o.jpg"
      }
    ],
    "user_id": "GTYgYLlgSJKv86zepCpoGA"
  },
  "AHfYV-ZqOfnIoVMHl8Dw6A": {
    "date": "8/30/2010",
    "text": "Hands down the best ribs in Pittsburgh!   This place may look like a dive, but it definitely serves up some great bbq. This place blows Big Mama's out of the water! They are take out only. They offer barbeque chicken, ribs and burgers. The ribs are so tender they melt in your mouth!  Pork Ribs: A whole slab cost $25. A 1/2 slab cost $10.50. Rib sandwich with four bones cost $6.50. A bone cost $2.00.  Beef Ribs: A whole slab cost $13.  Dinners: A full slab (12 bones) with four small or two large sides cost $26.00. A 1/2 slab (six bones) with two sides cost $13.00. A four bone dinner with two sides costs $9.50. A three bone dinner with two sides costs $9.00. Six wings with two sides costs $8.00.   Two bones, three wings and two sides cost $9.00.  Jitney Special Two bones, a hotdog and three wings cost $9.00.  Kids Special One bone, two wings and one side cost $5.50  Sides consists of yams, mac & cheese, broccoli & cheese, greens, red beans n rice, baked beans, green beans and potato salad and cost $2.25 for a small and $3.75 for a large.  Wings: 4     $3.56 6     $5.34 8     $7.12 10   $8.90 12   $10.68 15   $12.75 18   $15.30 24   $20.40 30   $24.90 40   $33.20 50   $41.50 75   $62.25 100 $83.00   They also cater private parties and sporting events. You will need to call two hours in advance for beef ribs. Visa and Mastercard are accepted.  I highly recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 19,
      "cool": 4
    },
    "photos": [],
    "user_id": "BjtJ3VkMOxV2Lan037AFuw"
  },
  "HA2AjudIFTVJX2Dg-v0wug": {
    "date": "7/24/2016",
    "text": "I went for the first time today. Heard great reviews about their turkey and beef ribs, and wanted to give it a try. Once there, it was said turkey and/or beef ribs had to be 'pre-ordered' at least 2 hours in advance. I understood their reasoning behind it, since pork is a more popular meat. But nevertheless, I was still slightly disappointed. (Since I don't eat pork).   I ended up purchasing a 6 wing dinner with yams and macaroni & cheese as my sides. The chicken was good, but VERY small. The yams were good. However a bit too sweet for my liking. The macaroni & cheese was a bit dry with a weird after taste of stuffing...oh god! (Not sure if stuffing got in my mac and cheese or if they actually use stuffing mix as part of the recipe.) But I've never been a fan of stuffing, so I was a little thrown off by the taste.   I will say that Showcase has some of the best homemade BBQ sauce I had ever tasted! If i remember  to order my ribs in advance I will come back and try different sides.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1BkUmMSj7Zzqu39SaHCmVQ"
  },
  "D9eTMtF6P7IHi7zuOCqZXQ": {
    "date": "6/20/2015",
    "text": "A coworker recommended this place to me so I decided to try it out. More of a takeout place then a restaurant. The food  was awesome and the service was good. I would give it more stars but I had an issue with the price. The prices on the menu board did not match the total I paid.  I ordered 4 bones (comes with 2 sides) for $10/11 and a brisket sandwich for $6. Somehow the total came to $24. There was another guy ordering at the same time so maybe the prices got mixed up. I didn't realize what I paid until I was half way home (totally my fault for not paying attention).  I would go back because the bbq was tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WyRxfYusbw7OLYsGc5Wcnw"
  },
  "ZkZp95Z7AKGiE8Oa2sU0Gw": {
    "date": "8/14/2016",
    "text": "Small dine-in, takeout Resturant offering home style soul food and BBQ. The BBQ baked beans got my full attention, like the saying \"it tastes so good I'll make you smack..\", it was worth every cent. My next fav was the BBQ chicken. It was seasoned to perfection and was moist. The greens and ribs were ok when compared to the chicken and beans as well as to other rib places in the city. They cook the ribs with the membrane film (not my fav) and the greens was on the coarse side. I'll defiantly return to try their turkey ribs and to get more of those soulful beans.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lUWOUW3gI7Hp75vZJbA_uA"
  },
  "FKMGXacgLtB6m9y545OW5w": {
    "date": "7/11/2014",
    "text": "This place has been around for years and not a year went by when the food wasn't good.    They have often been a staple at local events and wether on the road or at the shop, the quality is always second to none.  Local owned with that Pittsburgh Pride, this is quality food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "zUQVfRIwoDJb_-8qiWUNwA"
  },
  "k64r9HD46j8QC4W6XJIPXw": {
    "date": "11/17/2018",
    "text": "Very good food. I got the plate with 2 ribs, 3 wings, macaroni and greens. Excellent value for $10. Large tasty meaty ribs, the wings were a little small but very tasty, greens were very good macaroni was adequate, not bad, not great, just a bit bland and the macaroni was pretty soft, but that's typical at BBQ places. The BBQ Sauce has a nice zing, it's an opaque sauce that almost looks like brown gravy, apparently a mix of red chili based and mustard sauce. If the review were just about the food, I'd give Showcase a 5, it's the best BBQ I've had in Pittsburgh to date, better than Pittsburgh BBQ, Z-Best or Rowdy.  But one star off for ambience, which it does not have (nor do the others). So you probably shouldn't take a date or your boss here. The ceiling is unpainted sheetrock, the bathroom faces the dining area and with the door open, you'll be staring at a toilet as you eat. But of course you can get your order to go, or in nice weather you can eat at the tables outside or head to Frick park.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "989O-qZsZvVKt4Ue9Rm2rQ"
  },
  "dFlkrYxSGXaFtEMZvn3dlA": {
    "date": "8/25/2017",
    "text": "I live in Tampa but I am from Pittsburgh. I've probably tasted almost every BBQ place in tampa in my give years of living there and very few are better than the meal I had from showcase Bbq. At first I was skeptical because of some of the internet reviews but I am so glad I decided to stop in. I ordered the rib and chicken dinner and loved every bit of it. One of my gripes with some BBQ places is you can't taste the smoke on the food but you could taste every bit of it on this chicken.    Both the ribs and chicken were cooked to perfection and the sauce was just right. Sweet, smoky and not over sauced. Its a small shop in the middle of the hood but you can't tell by the taste of the food. Definitely getting another plate before I go back to Tampa.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "13SebkYdGj_QBNcKB_yLWQ",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States. Ribs, Wings, Mac and Cheese and Greens",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/13SebkYdGj_QBNcKB_yLWQ/o.jpg"
      },
      {
        "img_id": "BoIuymLueCeTGfYRv7p80g",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States. Rib and Chicken dinner",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BoIuymLueCeTGfYRv7p80g/o.jpg"
      }
    ],
    "user_id": "2PnNS8-0weVIcymeeKfucw"
  },
  "zf3i1eTjdPkebqVxnbiqQA": {
    "date": "3/23/2019",
    "text": "Me and my boyfriend usually goes to zbest but thought we would try something different . This has to be the nastiest tasting bbq place black owned I have tasted in so long . The Mac and cheese was one big ball with barely any taste the yams were almost whole with no type of flavor also and the sauce was nasty for my ribs and chicken and did I mention how chewy the cornbread was yuck . I give one star because y'all tried haha",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I6w4_iti6r7rQ2rV-cxQiw"
  },
  "LhP46q5GNpnGFbKU-X1Cuw": {
    "date": "1/25/2017",
    "text": "Quintessential no-frill take-out barbecue joint with delicious, smoky baby back pork ribs.  The 1/2 SLAB DINNER with 2 SMALL SIDES at $14+ came with 8 meaty ribs that were nice and tender with a super flavorful crust.  My husband and I aren't huge volume meat-eaters, so we had leftovers for days.  They forgot our sauce on the side, which initially made me super sad when we realized this at home, but they were slightly redeemed when we tasted the meat and found it didn't need sauce at all.    The MAC AND CHEESE was pretty ordinary, a bit dry even, and the GREENS were pretty salty and not my favorite.  Vegetarians beware--though the sides are advertised as pork free, my greens definitely had some chicken bits hidden throughout--a strip of skin and even a small wing bone.  Yep.    All this made for pretty shabby service, but I came to taste the ribs and I wasn't disappointed.  As a lover of divey hole-in-the-wall ethnic restaurants, I'm pretty immune to these types of frustrations.  Would for sure return for the smoky pork and the great prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "Yk6WWwezDBeQB3Kpb7xehA"
  },
  "ucfd-iyOAYsXlZsJB90cXg": {
    "date": "12/5/2016",
    "text": "I have to admit I was a little skeptical of this place, mostly because I don't really eat meat, but I went with my husband anyways. They are super small and in what seems to be an old storefront. The guy was outside cooking in a HUGE smoker?? I think... Anyways, I had the mac n cheese with the hot bbq sauce.... 1st please do not tell me if either of those things has meat in them and 2nd OMG YUMMMM the sauce is spicy as hell! I LOVE spicy as hell, and mixed with the mac n cheese it was creamy, cheesy, and spicy as hell. I was a vegetarian in heaven at a BBQ joint.  Also, my husband insists that the ribs were a deal and amazing, he liked them with just a little spicy sauce and mostly regular. He was not a fan of the greens (but he is never a fan of greens, I have no idea why he ordered them). We both liked the corn bread.  Great little place!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 7
    },
    "photos": [],
    "user_id": "3DltS5Wr9MOntnc8StBFBA"
  },
  "z0ZhFmflRczOCp9fZlmvGQ": {
    "date": "11/22/2016",
    "text": "The pork ribs were tender and juicy and had the BBQ smoky flavor.  Really enjoyed the sauce, different then most others I have had.  I think just a hint of mustard but a variety of flavors.  The Mac & Cheese is OK.  Had the Baked Beans and they are terrific, Spicy, With Peppers.  Paid $1.00 for a piece of cornbread that was moist & pretty good.   Staff was friendly and helpful when asking about the sides.   We sat outside at a table. Luckily it was one of the last warm days of the year.",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 17,
      "cool": 20
    },
    "photos": [
      {
        "img_id": "v8SSkPuSUrhNe2NVSW9Qag",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States. Ribs, baked beans, Mac &amp;amp; cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v8SSkPuSUrhNe2NVSW9Qag/o.jpg"
      }
    ],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "-EPZ8Ncuit-X9SvEEMg3Vg": {
    "date": "9/6/2018",
    "text": "You won't make it through dinner clean!! Came in about 5min to closing. Brisket and turkey were gone but that was my fault. Got the half rack of pork and a side of wings. Everything was amazing, fall off the bone meat, great tangy sauce. And the greens were out of this world! As you see quite a spread and the it was only about 20 bucks great deal, great food, highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hzDxu57i6EW6XjTzO0YPzQ",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hzDxu57i6EW6XjTzO0YPzQ/o.jpg"
      }
    ],
    "user_id": "0vNkswQVOCv8YAkVfhRJhA"
  },
  "uk3QFmnhoEeadQf7ZOXA4Q": {
    "date": "11/16/2017",
    "text": "Just had some of the best BBQ I've ever had in my life. Ribs were full of meat, charred just right, and the mild sauce was dynamic with multiple levels of flavor! The Broccoli and Cheese, Collard Greens (with bits of chicken?), Green Beans, and Mac & Cheese were outstanding. I got the cornbread (not a side), and it was quite tasty, kept in it's own plastic wrap.   The shop itself is humble, the seating area indoors is sparse, and there are some patio tables out front. The women behind the counter were super nice, and were happy to answer my questions. There was a nice stream of people coming in, mostly for take-out.  The hot sauce wasn't crazy-hot, but very good, added a little bite. But, if you don't have a high spice tolerance, you might stick with the mild sauce. Oh, my, this was soooo tasty! :D  After living in California for 24 years and having nothing but mostly fake BBQ, this is such a relief to have now that I've returned to Pittsburgh! I'm almost afraid to review it, because I'll have to wait in line for all you readers now. :( haha",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 4
    },
    "photos": [],
    "user_id": "GixqhsOxjgNt3Yy7finNog"
  },
  "nWziY2D9ivRnfDIafHu9-Q": {
    "date": "8/9/2018",
    "text": "Excellent food at extremely reasonable prices. South Carolinian here confirming everything is authentic, it's all correct. 42$ buys a feast for 5-6.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ra2Yl10R5M-9wxm1SPfFhg"
  },
  "lxmfrZLLt1wE9Xev-9FmxA": {
    "date": "11/20/2016",
    "text": "I'm really sad to write this review so I'm going to give a benefit of the doubt and say maybe I need to give it a second chance. They opened at 12 and we got there around 12:45. They didn't have everything ready to serve and there was a wait for Mac and cheese. The employees were really nice, but it was just kinda missing.  Food: Chicken was very good but the wings were SO small. Ribs were seasoned very well with great flavors, but they weren't the most tender. Mac and cheese was a huge disappointment but I will say that ours didn't really look like the other pictures on here so maybe something happened? It wasn't very creamy/cheesy. The cabbage was really good though!   Would I go back? Yes probably later in the day or not on a weekend with hopes they would have all of their options available.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tJiWkQtxSmr4UdfEp-EYHA"
  },
  "ivqXB49sWuET56sSeM4vPQ": {
    "date": "8/3/2018",
    "text": "Food is amazing. Ribs fall off the bone mac n cheese yams and potato salad was really good. Affordable dinners for BBQ",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eBLKLnIVFk7JZQZxQVw7nw"
  },
  "wURaNcD2Lqe9SWuym4xsgw": {
    "date": "5/28/2018",
    "text": "I've lived close by in East Liberty for 3 years, I can't believe I've never been here before!  Just a local bbq joint, nothing fancy. Amazing food, big portions, at a low price.  While some people like \"fall off the bone ribs\", I actually prefer my ribs to not disintegrate on impact. They are still tender, but have a great bite. The flavor it just out of this world. Perfectly seasoned and smoked. They don't skimp on the sauce either if you choose to have the sauce on the ribs.   Wings were good too!  I just wish they were opened on Monday so I could go two days in a row.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OTDUFAGt72eqcM5HHR9qrA"
  },
  "KHuWjWxIzxPR1DyubMMUxw": {
    "date": "7/15/2017",
    "text": "I stopped by here earlier today with my wife for lunch.  I had been wanting to head to Showcase BBQ ever since I first went by and saw all of the smokers outside.  However it has taken quite a lot time for us to get there but I am glad that we finally did!  Upon walking up to the restaurant the first thing that I noticed was their sign which says \"The Burgh's #1 BBQ Spot\" which is quite the proclamation but one that after dining here I am likely to agree with.  Showcase BBQ has a bit of a confusing setup where you enter through the right door, proceed to order and then exit through the other side.  If you don't follow the directions here you mess everything up.  It had some very minimal indoor seating and seating for 20 just outside the restaurant.  On this day as my wife and I often do at BBQ places we decided to split the Woodley (4 bones and 6 wings with 2 sides and 2 drinks) as well as a brisket sandwich both with the sauce already on it.  For our sides with the woodley we went with the greens and the Mac and cheese.  Once ordered, our food was ready within a few minutes and packed to go even though we were eating it outside.  The first thing that I dug into were the pork ribs.  They were delicious as they were tender to the point that they fell off the bone and had smoke flavor in each bite although with enough restraint that it wasn't overpowering the meat.  The BBQ sauce was really good to and was a Carolina based mustard sauce.  After finishing off my 2 ribs I tried the chicken wings.  While I thought that the wings looked a little small they had big flavor with the same smoke in each bite as the ribs.  After those were gone I was able to try the sides that it came with and both were delicious!  The greens were braised or cooked in some pork juices to give it some extra flavor and it also looked like there was some crushed red pepper that gave it a slight spice.  Then the Mac and cheese was super flavorful with a spice blend on it that my wife thought tasted similar to old bay while I thought it was very peppery.  Not every bite of it was as creamy as I would have liked but I still enjoyed every bite and wish I knew what was in it so that I could add it to any Mac and cheese that I make.  Last but certainly not least was the brisket sandwich which consisted of 5 think cut slabs of brisket in between two pieces of white bread.   I really wish that the bread was toasted to help keep it together a bit better but in the end it didn't really matter.  The brisket was cooked nicely and so was tender and tasty and both my wife and I enjoyed that as well.  The bottom line for me is that I will definitely head back here again in the future.  My wife and I came hungry and left stuffed and both thought the food was excellent and good value for the money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "H9F9YCUVSX6WPVa6ODcyfw": {
    "date": "4/10/2018",
    "text": "Best barbecue I've had in my life. Hands down. HUGE portion of ribs with two sides for just $15. The greens also tasted surprisingly good. You probably don't want to blow your calorie budget by coming here every week but when you want to treat yourself, I guarantee that this place will not disappoint you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EU5dSjk-UzILTp5kcg-dOQ"
  },
  "eie0j7Qry9IbwAlHGUncUA": {
    "date": "5/20/2016",
    "text": "OMG!! Love their BBQ. The day we went, they opened later than usually. But, the owner was there and explained why. No one in line moved!! They were all waiting for awesome BBQ and they were not disappointed. Don't go there if you want table service, a nice ambiance, music, etc. This is all about the food. Good food. Great food in fact. The sides-let's talk rice and beans. I think the best rice and beans I have ever had!! The BBQ has a mustard base-so keep that in mind if you aren't a big mustard fan. Everyone we went with absolutely loved it there and we went with some very choosy people!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "BJUY0UadA-STNQfNGnpTjg"
  },
  "OeynrycHWgj3DKCzT-SFJQ": {
    "date": "11/3/2018",
    "text": "No doubt this is the best barbecue in Pittsburgh. Potato salad blew my mind. Baked beans blew my mind.  I have some ribs caught in between my teeth from yesterday that the toothbrush won't get out and every once in a while I get a little taste of it and it's blowing my mind right now. If i could give a higher score i would.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_7lmuMJ3Kyremmm742xYBQ"
  },
  "4OXa1K4TOTTiIsZYgSuXow": {
    "date": "6/17/2018",
    "text": "If you've never had turkey ribs, try them! We've been here a few times but always got the beef, mostly because when I think of ribs, I think of beef or pork. We got a bunch of things for a family dinner and finally tried the turkey; oh my god. I love turkey, usually anyway it comes but I have never had it like this. It moist and full of that smoky flavor you associate with BBQ. Really delicious. The beef ribs are fantastic as well, but the turkey.... Everything we tried was good. The mac'n'cheese, the greens were really great, and the BF loved the potato salad. Chicken wings are not a favorite of mine, but they come with a kind of honey mustard sauce, which is very tasty. I was just dipping my bread in it, it was so good. The staff is usually nice as can be with a line out the door, and there is almost always a line. I would not go very early or very late; they do run out of stuff, and sometimes things aren't ready if you go when they first open. I know other people have complained about that, but to me that just what happens when you are talking about real, fresh BBQ. And a tip for your leftover turkey ribs, I was putting them on salads and put some in store bought soup lol. I love those ribs.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "TDOF4SZAh7MsFgfshOL66A"
  },
  "tP873Em0a2Lvgi93_aNiQQ": {
    "date": "3/31/2017",
    "text": "This is a review for a catering order. I was so pleased to learn Showcase BBQ delivers for catering! I was hosting an event right down the street and this made coordinating the delivery even easier. The order arrived on time and was set up nicely by the delivery driver.  I ordered wings, brisket and a ton of sides. The brisket was so tender and I didn't use any sauce as the flavor sans sauce was too good to change. The cornbread was far and away my favorite side of those ordered... so much butter!! I wouldn't recommend eating here on the regular, but it's a nice treat.  The price of the meal was just right and I'll definitely remember this establishment when I need future catering orders fulfilled.  My only disappointment was the lack of serving utensils. I ended up having to quickly run to a dollar general before the event, which worked out - but would have been nice to know ahead of time. All the staff I encountered in person and on the phone were pleasant and helpful.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RYrKddIs0_PBPhGG3LNDdw"
  },
  "VF4JKk93sp0bFGqyRPb9lA": {
    "date": "7/29/2015",
    "text": "I have been on a quest to find 5 star worthy BBQ in the Burgh, and by golly, this is it!  My friend mentioned to me a couple of weeks ago that she'd been wanting to try Showcase, since she works nearby and a coworker often gets lunch there.  As thanks for helping me drop off a window air conditioner that'd stopped functioning and pick up a new one yesterday, I decided to treat her (and myself!) to dinner from Showcase, which happened to be nearby.  I'm so glad that I seized the opportunity to try Showcase's BBQ, since we both found it positively mouthwatering!  When we went to place our order, we asked to see both the turkey and pork ribs.  The woman working asked us if we'd ever had turkey ribs before, and we said we hadn't, so she gave us a sample to try.  It was so moist and smoky, I had to order it, so we got the 6 bone dinner with them, as well as two sides of collard greens and candied yams ($16.05).  The dinner came with a generous amount of homemade sauce, which my friend applied sparingly, and I applied liberally.  While the ribs can totally stand on their own in terms of flavor, the sauce had such a complex and interesting flavor that I wanted to take advantage of it.  Please note that this sauce isn't your typical Sweet Baby Ray's or Kraft BBQ sauce--Tony D.'s review describes the flavor well, and it has just a slight kick of heat.  As for the sides, they were both great!  The greens were cooked perfectly--they were tender without being soggy or mushy--and were delicious, with just the right amount of salt.  The candied yams were sweet yet smoky in flavor, and were also tender but not overly mushy, with a somewhat chunky consistency.  Even my friend, who isn't a big fan of yams, enjoyed them!  We were originally planning to order baked beans in place of the yams, but they were out at the time of our visit.  Needless to say, given my love of mac and cheese, I would have ordered that, but my friend subsists on a GF diet, which unfortunately ruled that out.  Overall, we were very impressed with the quality of the BBQ at Showcase.  The prices are right on par with other nearby neighborhood BBQ spots, and the service was friendly.  While it's True that the neighborhood isn't the best, let's face it, sometimes the best food can be found in the unlikeliest of places--esp. when it comes to BBQ!  If you live in PGH and you enjoy BBQ, but you haven't checked out Showcase, you're missing out bigtime--so stop procrastinating and stop by ASAP for some quality 'Q!",
    "rating": 5,
    "rated": {
      "funny": 8,
      "useful": 22,
      "cool": 17
    },
    "photos": [
      {
        "img_id": "JWDw7hney0auQHoi8WKKPA",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States. Turkey ribs, collard greens, and candied yams",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JWDw7hney0auQHoi8WKKPA/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "4nyRi_EhDbz5Ox0doo2n1w": {
    "date": "7/18/2015",
    "text": "This is one of the best bbq in the city!!   Fast, friendly service and great food!  The pork bbq ribs are so tender they fall off the bone! And that sauce is on point! You can't get ribs without that sauce! Mac n cheese side is so creamy n cheesy with a slight smoke flavor. Greens were perfectly cooked, not too mushy or salty; it's just right. Cornbread is more like corncake.   5 stars for sure!! I'd come back again.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "kroYYmIwdnh-j1375CVeDA",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States. Pork ribs, greens, Mac n cheese, and corn cake!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kroYYmIwdnh-j1375CVeDA/o.jpg"
      }
    ],
    "user_id": "2IweYEr1K6vWxx428zZoVg"
  },
  "rvCFfR8nDlLek4uPkurs3g": {
    "date": "8/6/2019",
    "text": "As I arrived there was a line out the door!!! But I waited and was happy that I did!   You will not be disappointed when it comes to this place. One tip I would share is that you should get there early to get certain sides because sometimes they run out of certain sides. However, they are always more accommodating on the sides they do have. Everything is bomb! Like literally whoever grandma be in the back cooking be sharing all the family secrets because the food is simply amazing.   So I went here a few times before and figured I check in and write about this spot because it is worthy to be praised!   I ordered a slab of ribs, four bones of turkey ribs, 10 wings, and Mac n cheese. The bbq sauce is out of this world. Just be prepared for a eat and nap situation because it's bound to happen.   I tried to order the greens this day but they didn't have any(not sure if they were made that day or just ran out) but it was an amazing time afterwards once I consumed this amazing southern cooking!   One thing that's never really mentioned ... this place doesn't have a five star restaurant look but they're food taste amazing and most importantly they're clean. While there I saw the server change gloves frequently and ensure that food was covered so that it maintained temperature.  You won't be displeased at this place, just saying I'm looking forward to next time.   One con is that they don't take on line or over the phone orders. In today's society we want to do mobile meals nah that's not happening here they're busy but it's totally worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "NiNX6RKigjvxnPMsgJAXjw"
  },
  "gMNtF8lKCqaMh6EJy8IGUQ": {
    "date": "6/26/2019",
    "text": "This food was amazing. When I'm at work we drive past this place constantly and smell the amazing food cooking out in the smoker. Had a break and decided to stop today. The people here are all so nice and try to make you feel like you're eating a good homestyle meal. The inside is definitely and order and go type of place. Not a sit down restaurant. BUT DONT LET THAT TURN YOU OFF.  Their food was, like I said, amazing. The flavor lives up to the smell I went with a coworker and we got the chicken, cheese broccoli, Mac and cheese, brisket, and corn bread. For $20 for two whole meals (with basically 1 meal left over) this place is a gem.   The brisket was full of flavor. The cornbread was the right balance of sweet and moist. The Mac and cheese was very cheesy and creamy. The cheesy broccoli reminded me of cheesy broccoli soup but it was delicious. The chicken wings were small, as to be expected, but the meat was fall of the bone.   Both of us got our sauce on the side, the bbq had a sweet and spicy taste - I thought it was a great balance.  I would recommend stopping by to pick up some food, because with these options I wasn't disappointed. In the time we sat there eating lunch, we saw about 10 people go in and out of the door with their to-go boxes and sometimes 2 boxes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nfSALCqow4Sb0f75Mf4c6A"
  },
  "-c1Zvj72GHcp3N-5l-QjfA": {
    "date": "6/20/2019",
    "text": "Yeah, this place is the shit.  I have never had turkey wings before--never even heard of them, but I went half turkey half pork ribs and it was better than ice cream on a hot summer day. The turkey ribs were like if you took turkey meat and actually had moist cuts of it--smokey turkey flavor plus that moisture from it being rib meat (I had too many dry turkeys in my day). I ate them and passed out on the couch watching some pro wrestling from the 90s--dudes with neon trunks and mullets fake beating each other up while I digested those ribs.  I overate to the point of self-loathing. But it was worth it. YOLO.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7e1rMJVUwMHpKA4dMlpMiA"
  },
  "sZIVfCTBTPIvy-I8siwsXg": {
    "date": "5/10/2019",
    "text": "This place is just out of control amazing. HANDS DOWN the best BBQ in Pittsburgh, their BBQ sauce is the most addicting sauce I've ever had. The side options are all packed with flavor, you can't make a wrong choice. It's such an unassuming location but the food is high quality comfort food and the people that work there are always so nice. I want everyone to try this place so they get all the hype they deserve BUT I don't want the secret to get out!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ghNETdfRkfqjJ-2TbZgdlg",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States. Half slab of ribs with mac and cheese and baked beans.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ghNETdfRkfqjJ-2TbZgdlg/o.jpg"
      }
    ],
    "user_id": "uEVVGVbQsIC0CNAJdM2dpw"
  },
  "mkVVfs9kyMGr6BcMJJyH3g": {
    "date": "5/28/2019",
    "text": "Wow! This place is awesome! I haven't had ribs this good since I was in Alabama! This place nails it! I got a half rack meal and could hardly eat it all. The ribs were lean and meaty and smoked to perfection!!  I used to frequent a couple lace called Dreamland in Alabama, and this guy is right up there with them!   The collard greens were excellent also.   The serving size for money was really generous and the sauce is a unique mustard base that you might want in the side if you're a rookie like I was.   I was enjoying pedal pgh and it took me right past the front door, so I took a second lap and stopped for lunch!    I enjoyed the food, talking to the owner, and just taking it all in.   I have hit Yinzburgh a few times and it was good, so was Walter's in Lawrenceville, but this is much better q, and a good value too.  I'll be back soon!  Check it out!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GnZoOPrN-mgf3qHmax30yA"
  },
  "teT7fuDnBHXUGQmUNLzpZw": {
    "date": "7/28/2018",
    "text": "It's Saturday morning and I'm riding around the area on a bike thanks to Open Streets Pittsburgh. I spot a BBQ place and see the grills outside working. It's 10 AM...I will be back for you!  After I did my loop around, I head back and find the place bustling with fellow bikers. I park the Schwinn and get in line (it's out the door now). As I'm waiting the BBQ aroma gets stronger. Hmm...what to get. I stand in line reading the menu, watching and overhearing what others are thinking. As I get closer for them to take my order, I see a fresh pan of mac and cheese come out. It has a generous cheese throughout and a light brown layer on top. Yes, please! I also hear, \"This is it for the pulled pork.\" It's not yet 12 pm and they've been busy serving hungry bikers.  I'm up. Because I want to try a bit of everything and couldn't order a kids meal as an adult (not in sound mind), I opted for 2 pork ribs, 3 wings, and two side dinner: mac and cheese and greens. \"We're out of greens. How about green beans or broccoli and cheese?\" Green beans, please. $10--of goodness.  Seats outside were taken by other hungry folks, so I sat at a high top inside neat the open garage door. On this day I people watched as much as the people in line watched me eat. The plate is so big! Portions mare HUGE! The ribs were so big and tasty. Definitely slow cooked bbq, you could taste the smoke. I ate both, but it was an effort to do so. Sadly, I couldn't eat more protein and saved the wings for later. There is still the sides to eat. The mac and cheese was glorious as expected from seeing the new pan come out. The green beans were excellent! I generally am not a fan, but the flavors and hint of spice made it a wonderful side.  I'd definitely be back!  Here are some tips: - This is a to the point kind of place. Ingredients cost money, they'll let you know by the signs on the wall. Personally, I appreciate this. - Ribs are turkey or pork. State your preference when ordering. - Sides don't have pork in them. - Cornbread is available and is extra. - Don't be on the phone and ordering. It's just rude and they have signs to ask you not to do so.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PEpE39sZTmpLJ2NkWCa2ow",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States. 2 ribs, 3 wing, and 2 sides for $10",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PEpE39sZTmpLJ2NkWCa2ow/o.jpg"
      }
    ],
    "user_id": "2i0A5OoKyiwskqvnkGq7cA"
  },
  "4Eci66d6OlzM9HM7soIyXg": {
    "date": "6/2/2019",
    "text": "tl;dr The ribs themselves are very good. The red beans and rice are ok. The sauce, chicken, and collards are not good.  The meat on the ribs has a really nice smoky flavor that's enhanced by the rubs. I shouldn't have had them pour the sauce over, which is their usual practice, though; even though it seemed to have a nice amount of vinegar/mustard at first, it's quite sweet and becomes unpleasantly so over time, to the point that I was dreading the sauce while looking forward to the meat. Chicken is weirdly dry and chewy.  I might go again and strictly order dry ribs with sauce on the side, but I don't feel a profound need to.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0nP7RnaaThFgphKUXtaZTw"
  },
  "nkQV-xpEKgDcyU31LKFTDA": {
    "date": "7/14/2019",
    "text": "Three of us shared a half order of pork ribs and a half order of turkey ribs (which were super special). It was the perfect portion. The sauce is like a sweet , and spice honey mustard brown sauce, not the usual tomato based bbq sauce. The meat was tender, Smokey, and not fatty at all. The place has a nice community feel to it. It's mostly a take out spot but with pleasant umbrella covered tables on front. Definitely a local treat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7T68t03MFYqjhbqnWkLZvw",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7T68t03MFYqjhbqnWkLZvw/o.jpg"
      },
      {
        "img_id": "moXam_vWkzKIRpsFfRh8iw",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/moXam_vWkzKIRpsFfRh8iw/o.jpg"
      }
    ],
    "user_id": "2PrDYlo8377F-z1A5XMcGg"
  },
  "L9uhJ8ShCB9S_2LXkzJNQA": {
    "date": "9/3/2018",
    "text": "I work so close to this location but never knew that it even existed until some coworkers wanted to go there.   I'm a big fan of pulled pork so I went with that and was I happy with that decision!  For $7 I got a sandwich that was enough for two people.   At first glance their sauce is odd to look at since it's not your traditional red bbq sauce that you would expect to see. It's a brown sauce!  I got it on the side since I wasn't sure how it would tase. Next time I'll be sure to have them put it on it because it tasted so good!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "91koVXu54Y6tIiZKKxVmrw"
  },
  "DEkYJfW7WB2y4w4JqPUqlA": {
    "date": "7/23/2019",
    "text": "Oh my gosh. This place has the BEST barbecue food in pittsburgh. The ribs are delicious and so is the cornbread and everything I've had on the menu so far!! Sometimes there's a line but that just means that the food is delicious. I've been a couple times and will be returning for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cgZiOxGu3XQN7HGk_M2_UQ"
  },
  "LrwbTzX6alLgalWEIdygPg": {
    "date": "9/20/2018",
    "text": "I freakin' love this place. I lived in Pittsburgh for two years and this was my favorite place to eat. I got it for my birthday meal, and I got it for my graduation dinner. It's the best. Get either their pork or beef ribs with mac & cheese and yams as the sides. You will not ever regret that.  Pro-tip: mix their hot and sweet BBQ sauces together for maximum awesomeness  Note: if you want beef ribs, order the day before so they can make them for you. I once got lucky that someone hadn't picked theirs up and came away with some day-of, but usually you've got to pre-order.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "Jaq3aXvYpBAjyoKiQwhnzw"
  },
  "lPfYIwkya8MkyY4cKpMcmQ": {
    "date": "6/23/2019",
    "text": "Mmm mmm good! Ordered a rack and a half for three of us and we had practically an entire carton filled when done. The ribs are big and meaty, and the sides are good. Will definitely go again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hN3sG-jhV2FJlKzz9emnIA"
  },
  "r9RIs1c4dBzTIBcrb82ImA": {
    "date": "8/8/2019",
    "text": "first time here....they open at 11:30....ish....line of people waiting to get in (always a good sign)....everything was solid (broccoli n cheese, yams, cornbread) but the ribs were excellent....meat literally falling off the bone....good flavor to the sauce....only regret is i only got 4 bones...will b back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KWJS0luKCwyW6SOqJLZcgA",
        "caption": "Photo of Showcase BBQ - Pittsburgh, PA, United States. yams, broccoli n cheese, RIBS with their hot sauce on top",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KWJS0luKCwyW6SOqJLZcgA/o.jpg"
      }
    ],
    "user_id": "2S8ZiH29dQSrO5HcTx1O6Q"
  },
  "xZ4qWu_ngmbgJRyA8NjuKA": {
    "date": "7/24/2018",
    "text": "This is easily the best BBQ in Pittsburgh.  The ribs and the wings are must-orders.  The smoke flavor comes through in both of these items and you know it's real from the big smoker outside.  The sides are also delicious, I've tried almost all of them but Mac is my favorite.  Make sure you try the hot BBQ sauce also if you're into spice, it'll def wake you up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_hsruQCw6UTnjlQiuSpScg"
  },
  "wxaR3EEeIvrZLkZBIZEi8g": {
    "date": "5/30/2019",
    "text": "Yummy smell in the air approaching this place! Good smoky BBQ flavor on ribs. Dry rub instead of saucy style I usually prefer. Teeny tiny wings look unappetizing but flavorful nevertheless. Pricey for small portions, but would go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NhuYB-RKnTJGk4KjFbsEgg"
  },
  "vbVWEOuVIr5zvewnFw1oFQ": {
    "date": "3/30/2019",
    "text": "I only came here because Dreams BBQ was closed. This place just isn't what it use to be years ago, I went two days ago and was disappointed. The BBQ sauce was so spicy, the Mac and cheese wasn't as cheesy, the green beans had very little flavor. The sweet potato pie was bland. I won't be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tWz7nGOSznFgp_VRFmHiFg"
  },
  "kfkso7H3HZQz95URTWNGNg": {
    "date": "10/2/2018",
    "text": "Excellent place. Not a single thing in the menu is bad, although the Turkey Ribs should be recommended, as they're unique to the establishment.   Would return and highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iv2rd8x9vzkhwwLDOQSk0A"
  },
  "QtEh1wkSfHeePAerzCgb9g": {
    "date": "5/26/2019",
    "text": "I love bbq dont live close but when in the area we definitely want to stop...was a bit disappointed today Sunday hrs said 12-7 didnt open the doors until 12:22 but we in here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "k5Akw5Ufpv7TVoj5IQgSdQ"
  },
  "dz9OqRSLZVK5Ihp_O19jjA": {
    "date": "5/15/2018",
    "text": "Get sauce on the side.  Containers are skimpy, and sauce ALWAYS spills out  into the baggy--very messy.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "0o6QkYNKhRp4IIH6L4g_9Q"
  },
  "Zb-T7lVE44r4MWiT78WbEg": {
    "date": "8/25/2017",
    "text": "Ambiance: Definitely hole-in-a-wall that's a little dark and bare inside. They have tables outside but they're that wire-mesh style so be careful with that BBQ sauce. Food is served cafeteria style, you order and they immediately assemble everything for you. The staff was a little brusk trying to move the line along but they were not mean in any way.   Food: We had the pork ribs which had a nice smokey-charred flavor and pulled off the bone easily. The rib silverskin was crispy which I enjoyed and the spice rub was complex enough to not need any sauce. A half-rack was also more than enough for one person. The chopped brisket sandwich was pretty good but ultimately nothing special, neither dry nor super moist, smokey but not particularly beefy. The BBQ sauce had a great balance between tangy, sweet, and a hint of mustard-spiciness but by the end of the meal I found myself wishing they had more options to mix things up. The mac was cheesy and not an congealed mass like most cafeteria-style restaurants. The beans were surprisingly good as well, they were sweet but not sickeningly so. Not the   Having moved from Kansas City, I've been looking for good no-frills BBQ and this place definitely fits the bill. It's not fancy and there's not a lot of sauce options but what they do, they do well. Definitely give this place a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "yyGp1_3i_zhfpBVIY4Xaww"
  },
  "_Y3jUbd9gCBaAzED1M7xTw": {
    "date": "11/7/2012",
    "text": "Every time I come here, I am seriously impressed.  Everyone seems to like me, here, as well.  The ribs are always so moist and delicious!  If you've ever had a bad experience here, it's probably because you showed up in a Toyota or some other car that screams, \"I like dudes, not ribs\", and then proceeded to walk in, dressed in something that screams, \"I like dudes, not ribs\", and then order in a shrill voice that just screams, \"I like dudes, not ribs.\"",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J5n05w2zTAOup-pD-e7jFw"
  },
  "lleOWcw7rVLl5LsVA7xeAQ": {
    "date": "11/6/2011",
    "text": "best bbq...finger licking good...yummmmmmmmmmmmmm",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uLWWpi62JJLnTh7UciJFHg"
  },
  "a92wtWDgFwfBfFaEAjcCEg": {
    "date": "6/12/2012",
    "text": "BBQ to make you smile.  Had a great hint of mustard and a nice soft hint of heat.  tThe bibs were meaty but still stuck to the bone and the wings melted in my mouth.  Love the greens not over cooked - the mac n cheese was good and complimented the amazing BBQ.  This place looks like it is on the way out but it is all in for me.  I'll be back soon- I'm a fan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UetOIhAdPBkGjm_o-mSC3Q"
  },
  "BSVkJNVsIH13ZSMkYZiYAA": {
    "date": "5/29/2011",
    "text": "Gorgeous smoky bbq pork ribs. They are tender are just fatty enough to satisfy, without being overwhelmingly rich. The mild sauce is tangy from what tastes like mustard w/ a hint of chili heat and what might be cumin.  I got a full rack to go w/ sides of mac'n'cheese and potato salad. The sides weren't bad, but the meat was so good I forgot all about them.  Friendly service. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "FFxzTd8fxsPQA_7ncsvjsA"
  },
  "-nKlD_AsBA0SMAieBF9H-g": {
    "date": "8/12/2012",
    "text": "Drew got the True BBQ I remember the dedication when he first started out in the cold to get you those great tasting ribs and wings it's the best in town  greatest around",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iBdKndGWsecpCO1ZFjyyAQ"
  }
}