{
  "6dgyzQVyI6V6TVQsKifH8Q": {
    "date": "7/9/2015",
    "text": "I've ordered catering from here several times for my company, and I was not too happy with my experience. For catering orders, you choose a 15 minute delivery window and they delivered 30 minutes after the end of the time frame. If it was just lunch for myself it would not have been an issue, but it was catering for a large event at my company, and it was a big issue that the food was late.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WP9e2YqFJRX_qIy_ThVkow"
  },
  "8T1dVqLM7Pn0elDOAQSLUA": {
    "date": "4/7/2012",
    "text": "Large & fast but they forgot my toddler's food.  If you've never had a toddler, this is one of the worst possible things that could ever happen that doesn't involve death or dismemberment.   resulting commotion sounded a lot like death &/or dismemberment, though.  Two year olds are awesome, FYI.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dgUd6PFN1D4wltea4f725A"
  },
  "E0eEJLrOkA8eVdtzCq19bw": {
    "date": "2/19/2015",
    "text": "First of all, I am a Panera Bread LOVER!  However, this location was different.  Our breakfast sandwiches (egg / turkey sausage) were unedibile.  After the first bite there was a strong after taste. The only food up to par was the fresh fruit cup.  Ususally the staff are very nice and friendly at other locations, not the case here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pqbduPygIyqOBAhdmGxoKQ"
  },
  "QTrLkBoScd3hAEcoxbwVyw": {
    "date": "10/24/2011",
    "text": "Huge!  Convenient, friendly and with WiFi. Plenty of parking. And unbeatable for a good - and healthy breakfast. Probably the healthiest lunch menu out of all the \"fast food\" chains. And despite the crowds, it's clean and airy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k_muz40jJaiY1PVga6NDXA"
  },
  "l_u4bJVtnIklABw-SzQfGA": {
    "date": "8/8/2010",
    "text": "I liked to hide here between classes @ Pitt.  PROS: Free WiFi; Great food; Great pastries; nice staff; clean  CONS:   CRAZY busy between 11:30 and 1pm (lunch rush is nuts here!) Parking  (either street on Forbes or surrounding or the Sennott Square garage underneath the building, but the garage is busy after 9:30am)  As for the \"takes reservations\" question, they have a room that you can rent out for meetings and anything--but that's the only reservations they take. Phone/Fax Order are a \"can do\" here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "E73xr_twLJZemdGrXWQobQ"
  },
  "ejcpYogQ8rOePS-P8kO7cw": {
    "date": "11/3/2011",
    "text": "Awesome location and free parking!   They also have a large isolated room that is excellent for studying.  I think this might be the same location as 3401 Blvd of the Allies.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "or5fL0Yjho-zb5iC-phB2A"
  },
  "7FwQC5GBG-nYMvJnw72MfQ": {
    "date": "4/8/2013",
    "text": "We stopped in here a couple times while we were in town to get some work done, grab a snack, and have a coffee or smoothie. Both the mango and berry low fat smoothies were fantastic and the coffee was good as well. Great scones too (we liked the blue berry and the orange best). The place has free wifi and tons of seating, so I can see why it was packed with students. The facilities could have been a bit cleaner (both the tables and restrooms needed a good clean) so I will take off one star for that, but I get that its tough with so many students in and out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "76xS0Vin4uT25XKaxbsvmQ"
  },
  "5Uncw_M64jX8zXaiyYDpIA": {
    "date": "10/29/2015",
    "text": "This location even though it is usually very busy, the staff is friendly and fast. I visit this location at least three times a week and usually my experience for bagel breakfast or pick two lunch is very good . Just a few times , mainly in the weekends I have come across some not well baked bagels .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cZu9sbcwd6bIL8YgninfWQ"
  },
  "5i5aWVlv5RIvAjLDmdx7dQ": {
    "date": "7/9/2012",
    "text": "I park outside on the street of Panera so I could run in and grab a bite to eat.  Well, I didn't have quarters, and when I asked the girl at the counter if I could exchange my dollar for 4 quarters so I could feed the meter while I ate, she looked at me like I was crazy and said \"I can't give you change.\"  ..... How the hell am I supposed to park and eat if I do not have change and you are unwilling to exchange a dollar for me.  I know it might be company policy to not open the register, but do not roll your eyes at me and get an attitude.  Gracias para nada.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7V29xzsIxlHfdcHsnpHB3Q"
  },
  "Ji31AOGrbPkt4kNuDjzLZQ": {
    "date": "2/8/2009",
    "text": "This is a pretty good Panera location, but it tends to get quite busy at lunch time when all the students come in. Still, great food, good coffee & pastries, and free WiFi; what more could you ask for?",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ZZNOoMQ7WFvFoxDUFw1wg"
  },
  "ancGsshAnuc2_b8CruxbKQ": {
    "date": "3/15/2011",
    "text": "Pretty good they catered to our swim team did a pretty good job didn't mess up any of the orders. The food tastes the same as the others so nothing special there",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GF8nVcQbFg_lJRLMoegSYQ"
  },
  "ZMFOKpiAI5-9Xz4-Cc1Pjg": {
    "date": "5/23/2013",
    "text": "Very tasty hot and cold foods that are always prepared correctly.  It can get a bit busy around lunch time but the staff is always working quickly to get the orders out as fast as possible.  Some of the food is a bit expensive, but they do have a rewards card program that helps you get the occasional free treat.  There is lots of seating here and I've never found it to be too loud.  I like the chipotle chicken sandwich the best.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Vr1EGhcykHivrOtPYdJKQ"
  },
  "aNrVYF1r-wTfGKhUuIp5fg": {
    "date": "11/26/2012",
    "text": "I love Panera and the food in this location is great. However, I must say that the service sucks!!! They are such idiots who work at this location, stuck up, and expect only college students to eat here. The staff looked at me like I was crazy since I wasn't in college. Also, I see the employees' here texting, being unprofessional, and not even working! I would give this 5 stars if the people who work here would do their job. I had even asked why they don't put out napkins and I never see any of the staff putting out napkins, straws, or anything like that when they run out of napkins and I always have to ask them for napkins and they just give me a weird look. I don't recommend anyone going to this location if you rather have professional workers!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Los2wL7iM5FMUIUZD-v3g"
  },
  "LrB50dDz0_sC39rbJepTrg": {
    "date": "7/19/2007",
    "text": "I usually hate reviewing national-scale chain restaurants, but this one is special. Not because it is actually special but because I've probably eaten lunch here over 300 times over 4.5 years. The food is OK, the service is OK, the people are OK. It's ridiculously crowded on a weekday lunch. It's pretty empty at all other times. It's convenient enough and passable. Still, I remember it fondly.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KKdBQXnUlVUZ0ZNTfMQoEA"
  },
  "mkAJt-lPzv9f1Kadt0TGVA": {
    "date": "11/27/2011",
    "text": "Good atmosphere. Hate their chicken noodle soup though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AyhF9VDkrReBv_cO-oI-JA"
  },
  "FS2OgvLDH97889WEgdHUBw": {
    "date": "9/19/2011",
    "text": "The staff here was very friendly and the sandwich was alright.  Portion sizes were pretty small though for the price and the apple they gave me seemed like it was chewed up by a dog (no joke.  There were brown teeth/gnawing marks on one side of the apple).  If it wasn't for the apple, I probably would've given three stars.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mKhdfiq4rSOV0Z14JWDqEg"
  },
  "Dg6npWniy-4MzL0XrZE73g": {
    "date": "8/29/2017",
    "text": "I generally like idea of Panera. I ordered a grilled cheese sandwich. It was promptly served piping hot. I would be willing to bet that it was cooked ahead and then zapped in the microwave. If somebody from Panera let's me know that they ARE NOT microwaving there stuff I will take this review down.   What next--hot pockets?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hPt58SgdBCOIHNWdEd1syg"
  },
  "fTf4gGGI3bvwvE0PyV9fBQ": {
    "date": "4/2/2018",
    "text": "They gave me the wrong soup. My wife's order was wrong quinoa bowl. They also had 2:30 minute old coffee. Had to wait for a new brew.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dnEIpXsjBU8qJJ_FYbvK9Q"
  },
  "_CcGblBj8M77n6faLzN5qA": {
    "date": "12/15/2015",
    "text": "Went during lunch time and it was busy, but the cashier was pleasant and took my order quickly and accurately. The wait for food was a little bit longer than I expected (~13 minutes) and I could've gone next door and gotten some Thai Iced Tea had I not have the buzzer given to me. Once I received my order I briefly checked to make sure that my order was correctly filled and then left to meet a friend elsewhere since all the tables and seats were full. What I was not expecting, was a charred Chicken Frontega Panini -- despite the busyness of a weekday I cannot believe they had the audacity to serve such inedible food. though I had a to-go order and the priority is to provide fast service, I would've rather waited an extra 5 minutes for an edible Frontega chicken panini - as long as I was told (otherwise I'd be in the dark about the extra long wait for a measly Frontega chicken). By all means, the other half of the panini was great, but would've been better had I got to enjoy the entire sandwich that I paid $8 for.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "10_CcF9axonMRc4Pflgjsw",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. Charred Chicken Frontega, can&amp;#39;t believe they had the nerve to serve. Would&amp;#39;ve waited extra time so I could enjoy my $8 purchase.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/10_CcF9axonMRc4Pflgjsw/o.jpg"
      }
    ],
    "user_id": "1msVg_B-Ef6K814sQDOTPA"
  },
  "_VYr5yWD2v63TjpEU5z4aQ": {
    "date": "9/18/2013",
    "text": "Hey, a Panera is a Panera. I have fond memories of this one just because it's located near Pitt, where I attended college; I would meet a number of friends for dinner here and even interview people for the school paper here. Good times!  However, no Panera is perfect. The biggest drawback to this Panera is its location. The service is wonderful and the food is as good as it is at any other Panera, but unfortunately if it's time for the midday/dinner rush nothing will save you from getting lost in the swarm of students and staff members all looking to get a yummy sandwich or bowl of soup. It's always good to have a back-up plan in case the line is really long here - fortunately it's Oakland, so there's no shortage of alternative eateries. Also: if you want parking, try the Panera that's along Boulevard of the Allies; that one has a parking lot, but this one does not.  On the plus side, in recent years this Panera's added a LOT of new space to accommodate the population it feeds, which is wonderful; it doesn't do much to help when you're standing in line, but at least once you get your food you have a greater chance of finding a table hidden in the back corner and you can use the wi-fi in relative peace. Still, fair warning: extra space or not, be ready to compete with a massive student population if you want to sit in here.  One final note and tip: if you're looking to host a class or meeting here, go for it: this Panera, (like many, it seems) has a nice meeting room that's separate from the main dining area. The one here is almost constantly in use - that's how popular this place is. Everyone likes Panera in Oakland, I guess!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "jC_9Aw_cEhRPkTG_obP7qA": {
    "date": "1/8/2017",
    "text": "The food wasn't bad. The trash cans were over flowing. Trash was everywhere. And my chicken Alfredo tortellini didn't even have chicken in it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BfKJ6uN5aDgzYt1ISyHYNA"
  },
  "Yh4wqpIMftkgYruJzKRqIA": {
    "date": "1/14/2015",
    "text": "Let me start out by saying that I love me some Panera. Usually, I get my soup and salad or even some soup and a sandwich and I am on my way. There new broth soups are awful. Seriously. It was flavorless and gross. I was not amused. Especially since it was so expensive. I will go out and update my review. But for now, it has two stars.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hietrA8M58asfpyJkCyiA"
  },
  "e-eX_50or-4EWi5mwqAvUw": {
    "date": "8/20/2016",
    "text": "I Usually love Panera but this location just doesn't listen. Went there this morning and my eggwhite, avocado, and Swiss on sesame bagel came out as eggwhite, tomato, spinach on sesame toast. I repeated it to her 3 times...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0R4EQE0khRTivoO0bufwHw"
  },
  "mFq8OzTEIvXngvvg_aJNlQ": {
    "date": "3/11/2015",
    "text": "Standard Panera, from what I've experienced. In general, I feel that Panera doesn't give much food for what they charge.  On Thursdays from 4:00 to 8:00, students can get any soup in a bread bowl for $3 with the purchase of a drink. Pretty good deal. The bread bowl also comes with chips, apple, or bread. I'm not sure if it was because of the deal (I've only been on weekends before), but there was quite a line when I went around 7 pm. The wait time to order and for the food to be ready wasn't bad, though.  I'll probably be back only for this deal--there are plenty of other places that will give more food for less money.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Figs8mO8s_aPRq2W7W0cYQ"
  },
  "BsMomYPgtf_3JGiY6TjS8Q": {
    "date": "3/18/2015",
    "text": "I absolutely love Panera!  I like the pick 2 that they have on the menu. I usually get a salad with soup.  I would recommend trying out the steak and blue cheese salad.  I'm not a fan of blue cheese, so I ask them for feta cheese instead.  The cream of chicken and wild rice is really good too!  I have yet to try the broth bowls, but if you go on their website and watch about 2 videos that are 2 minutes in length then you get $5.00 off of the broth bowl!  Hopefully, it's still on the website!  Check it out! :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ed0BgzLvqoo6LWMu_CPlCQ",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. Lentil Quinoa Bowl",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ed0BgzLvqoo6LWMu_CPlCQ/o.jpg"
      },
      {
        "img_id": "s6tUvfx4zis1uRP1WYZfMw",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. Steak and Feta Cheese Salad, Cream of Chicken and Rice Soup with an apple",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s6tUvfx4zis1uRP1WYZfMw/o.jpg"
      }
    ],
    "user_id": "g8bE-lj6sp73JNkf-VbvVA"
  },
  "qI7XupFpcKHL2ZBXSFkbwg": {
    "date": "6/28/2016",
    "text": "Internet is extremely slow , I tested the speed it was  80kbps just a bit faster than a modem",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d7WRJgT4DMYTfSA3dE1JyA"
  },
  "vGcQtz-6jygQ0tSF7FY11Q": {
    "date": "6/29/2015",
    "text": "I just got the Lemon Chicken Orzo soup and it was really awful. There was barely anything in it and the broth tasted like water. The one piece of chicken I got in it was so gross looking I had to take it out and throw away (it was attached to a string of purple weirdness and fat) so disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3IMVKkPFQEa8NA3UEoMBbg",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. Barely anything but watery broth in the Lemon chicken orzo soup.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3IMVKkPFQEa8NA3UEoMBbg/o.jpg"
      },
      {
        "img_id": "r0aaCEzgB0U-BVr-0jfSpg",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. Gross chicken in the Lemon Chicken Orzo soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/r0aaCEzgB0U-BVr-0jfSpg/o.jpg"
      }
    ],
    "user_id": "dqwStxu-gDfwB0GL5EWZUQ"
  },
  "ysuXusIK5YlFmfk26dJ6bw": {
    "date": "1/12/2012",
    "text": "Actually, for a Panera, this was quite nice.  I was at the Petersen Event Center and this was a quick walk down the hill....idiot me never realized I'd eventually have to go back up the hill.  The restaurant is huge...they must have room to seat 300 people, and every visit it's always been packed.  Surprisingly, this Panera, for its location has a decent staff.  They're quick and they prepare their easily prepared national chain foods quickly.  Personal pet peeve that Panera's are Pepsi establishments but soda and pop are bad for you and I shouldn't drink it anyways.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nF2TR0yfB2tx3VzAMvdlgQ"
  },
  "y70qhDj5_8hfUgzD5_BeRg": {
    "date": "12/23/2015",
    "text": "This restaurant has a lot of space with tables, seats, and booths if you want to hang out with some friends for a while. The cashier was very nice in her conversation. My order was prepared very fast. I enjoyed the taste of my broccoli cheddar soup and baguette. The bacon in my BLT roasted turkey avocado sandwich was soggy and not as good as I have eaten at other locations of Panera.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FW5F5QzzMoeRdIib1OyNOw"
  },
  "lyc2_9pnxrvj5M8NTyk4pA": {
    "date": "2/19/2016",
    "text": "Great place and fresh food! Especially if you want a light lunch like soup and maybe a sandwich. Otherwise definitely try out the mac and cheese!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_MQEOz6DkC7y8DPnJT1-jQ"
  },
  "JdWiHHosk9qtbtiRgGBgJg": {
    "date": "9/26/2014",
    "text": "I overheard a male manager and female employee making very rude and racist remarks about chinese culture. This sort of behavior is ignorant and unacceptable in any situation. I found it to be extremely offensive and refuse to visit this location ever again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "hknQtHRuPwr004CgxPIaLQ"
  },
  "esSzRxYwraXEBflJUgJGkQ": {
    "date": "10/29/2014",
    "text": "I'm not a fan of the Panera in Oakland.  Often when I have been there the salads have no dressing on them or are missing a vital piece.  Last time I went I ordered a breakfast sandwich on a bagel and they pressed it on a panini press making it flat as a pancake and burnt.  Very unappealing.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "i4dDFruJnSuaw0hz6J2Deg"
  },
  "gbceRL0y4J3k9VgYoyLB4w": {
    "date": "12/1/2014",
    "text": "Soup in the breadbowl comes with an apple. Don't know it's usual or it is holiday special. I like soup and bread so this dish is definitely for me and panera does a good job. BTW, I tried mix vegs and chicken noodle. I prefer the latter one since it is less salty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-SDx-d5jppC4OBBosLVpYw"
  },
  "cguZyjX7HRl0zRIcCz0T3w": {
    "date": "6/23/2015",
    "text": "Love the cinnamon crunch bagel especially as a breakfast sandwich. The atmosphere is great with free wifi with lots of available seating. Service is speedy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rdWBFixiaJFVlYmhUq7uZQ"
  },
  "jFodMIDREYk_rMtRHwv8sQ": {
    "date": "7/11/2014",
    "text": "I've waited a bit to write this review because for me this branch deserves a 3.5 star review; however, Yelp confines me to whole stars so I lean towards a 3. I've been here quite a few times for lunch and in between writing sessions in the library. It's always quite busy, particularly during semesters, and sometimes it's a bear to wait in line for a while. The quality of the food is always good, and the staff seem competent and friendly. I've been disappointed here a few times that the types of bagels I want are not available later in the afternoon. Sometimes, there are only a couple of types of bagels left as early as 3pm. I wish they had a variety of bagels available throughout the entire day rather than \"while supplies last.\" Overall, though, I enjoy this place and will continue to frequent. Their black bean soup is amazing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2oTG2GrBpikkonRxQywI7Q"
  },
  "W8tRaWw9rnwhoY9WECjz0g": {
    "date": "10/16/2015",
    "text": "Truly the worst Panera Bread you will ever visit. The only thing that is good here are the bagels and baked goods (which I'm pretty sure are the same at every Panera). I have had salads here that every single leaf of lettuce inside was dead/wilted/rotten, One time I was actually given a sandwich that had a hole in the bread....an actual hole as if someone took the middle of the bread out. Bizarre! The only reason this place is still in business is because they have a nice seating area and it is one of the only restaurants available on Pitt's campus. This location also has mice.....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZRdeSie_ZV2Jc8hGJks8cg"
  },
  "CI53kBTkdEvH-FjYNgm5gw": {
    "date": "5/5/2019",
    "text": "It seems that my experience here isn't consistent with many of the other reviewers here, because I thought this location has great service and food. The employees I did interact with were very friendly, gracious, and efficient. Even better, the interior of the cafe is completely updated and clean, with plenty of tables to sit at. There are kiosks to order your food at, in case the lines for the registers are too long, which is helpful. I'm unsure if my experience was an anomaly, but I hope not!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sYtCcI9Z7dQ91ky8lcEb1A"
  },
  "CCNHd_71vDAZYkT8zh3IoQ": {
    "date": "3/4/2019",
    "text": "Panera is a go to stop for me when I use my Panera rewards and have a craving for a pick 2. You have parking available around the location but can easily walk from one of the nearby hotels or hospital. The location is large and have a good amount of sitting room.  The customer service was good the food was below average at best. I went for the Turkey BLT & Chicken Apple salad pick 2. The food came after 3-4 minutes. It was obvious after the first bite the food wasn't fresh. The chicken was partially frozen along with the lettuce on both my sandwich and salad. My side of an apple was delicious though!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "H0nlzaLPa6n6bacVwJkM7g"
  },
  "lBwqAJP6FbgnLRmEkTT5qw": {
    "date": "2/13/2018",
    "text": "I have a 25% love and 75% hate relationship with Panera. They make you feel like you're eating healthy when you're really not. They're hella expensive for no freaking reason. I always get the \"You Pick 2\" and there's no way that half a salad and microwaved soup is $10. No way. I always avoid coming here for that reason but there's tons of tables, is in a convenient location, free WiFi and the environment can be nice. The service is always quick and they always get my order right.   The 25% love is for their bakery goods. Their brownies are out of this freaking world and I know that they are baked fresh every morning. None of their other food are, even if they claim to be. Baked fresh every morning.   I only come here when I feel like using my points from the Pocket Points app because then you can get BOGO You Pick 2; which makes it a little more affordable because then I have enough food to feed me for two meals. Otherwise, no way would I waste my money here.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fJCe_UGW_BBZZewK8BmciQ",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. Chipotle chicken lime ranch salad or whatever it&amp;#39;s called, with a French baguette and chicken with wild rice soup.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fJCe_UGW_BBZZewK8BmciQ/o.jpg"
      }
    ],
    "user_id": "pspJkQgUOap1OjTZVMbdsQ"
  },
  "je57A3jatlWVCNrKl6cWNg": {
    "date": "4/18/2019",
    "text": "I got the Madagascar vanilla cream cold brew... but it's just the regular cold brew with pumps of vanilla syrup... disappointed. Not worth it.. I even went to ask if this was correct and the girl just tells me it's suppose to be pumps of vanilla but I can add cream if I want... pictures online are deceiving",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KNhvM1iBbIhuJCFNJ0kjXQ",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. Madagascar vanilla cream cold brew...",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KNhvM1iBbIhuJCFNJ0kjXQ/o.jpg"
      },
      {
        "img_id": "Uhe-wbfAPC0-8b1cpHrzsg",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Uhe-wbfAPC0-8b1cpHrzsg/o.jpg"
      }
    ],
    "user_id": "0nv0fojAAKrnQppPtjgjDA"
  },
  "xm1ke8-QRkK8lLFjmI53OA": {
    "date": "12/17/2018",
    "text": "I have been to this Panera Bread location several times in the past. I have always enjoyed experience at this location. During my most recent visit I had a minor issues that was wonderfully resolved by the staff members.   I am a Panera rewards member. I ordered through the app. There was a minor issue fulfilling the order with my rewards through the app. The staff members hastily mitigated the issue. The best part, is that this process did not take any longer than a normal mobile completion time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TiiVWUPoYY3KGUJ66awPwA"
  },
  "ftG5EXAryEw_TCvb6kukUg": {
    "date": "6/26/2019",
    "text": "Probably the worst experience I've ever had at a Panera in my life. Cashier was not friendly, did not seem to be engaged or even want to work. My food was missing chicken ... Went back to the counter and let them know.. the Young lady working behind the counter stared at me, did not apologize, but rather threw the chicken in the microwave and put on the counter and turned back around. I will never to this location. So far treatment and terrible food service",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ztCTWT6ZMw04lQlovNd0KA"
  },
  "LcgPxlWccRksgHkqDvM4fw": {
    "date": "9/7/2017",
    "text": "The restaurant is pretty clean and the employees are friendly. Overall, the service was mediocre because I got a pager for my food because I was dining in, yet it never buzzed. After 15-20 minutes, I checked the counter and my food was there... I felt like they should've paged me another time if they saw that I didn't come to pick up my food.   The food was average- the mac&cheese was very rich and the BBQ chicken flatbread was very drippy (sauce kept on dropping out). Overall, a decent meal, but in my eyes it's overpriced for the amount of food you get.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lgukI9ZuDasM39k1JA3PSA",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. You pick two: BBQ chicken flatbread, Mac&amp;amp;cheese, apple side",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lgukI9ZuDasM39k1JA3PSA/o.jpg"
      }
    ],
    "user_id": "9MU6L4v83qo9jmutekcWMQ"
  },
  "4_i3HxhJajq1izAdh5YGvw": {
    "date": "4/24/2018",
    "text": "I worked at a Panera when I was in undergrad, and the standards were much higher than this one. My food is always sloppily prepared, my orders are frequently wrong, and the wait times are excessive. I know it is a busy location, but the Panera I worked at was the busiest in its franchise and our wait times never got like that.  I used to love Panera, and I still enjoy other locations, but this one is seriously lacking.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DrlqkLkNc2oa2-wTYntOSw"
  },
  "W16Ir3c1nt8XbO64T7U2nA": {
    "date": "5/16/2019",
    "text": "pretty certain my dog can slice a bagel more evenly than this. also not sure why my cinnamon crunch bagel has a hint of onion to it",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i5yLbbqolkZb4Mp1PbO2MQ",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i5yLbbqolkZb4Mp1PbO2MQ/o.jpg"
      }
    ],
    "user_id": "JR2nTYlFSkM_eurThw2jKA"
  },
  "a6ZEjWbTa2U0Gw1DDcyi0g": {
    "date": "12/1/2016",
    "text": "Come here infrequently due to the high prices for mediocre food. A small cup of soup is $5.13. I find that overpriced for something that is frozen, but it satisfies the soup craving when stuck in the library.   However, in November through my Panera rewards I had a free bagel everyday of the month. I will say their bagel quality is pretty good. They are huge and filling. I tried a variety from cinnamon crunch, pumpkin pie, asiago, blueberry, and everything, but my favorite is always sesame. Their plain cream cheese is also really creamy and delicious, but more expensive than the bagel.   Their online ordering is great if you know when you will be popping in. Otherwise, there is usually a line.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OWluruwkqOa29Smg2NVCfg",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. You pick two: French onion soup with steak and white cheddar panini",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OWluruwkqOa29Smg2NVCfg/o.jpg"
      },
      {
        "img_id": "x4DbEGMJieaUp8yxDWLojA",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. Pumpkin pie bagel",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/x4DbEGMJieaUp8yxDWLojA/o.jpg"
      },
      {
        "img_id": "b7TF749RahVA2sg77LtSBA",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. Blueberry bagel with honey walnut cream cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/b7TF749RahVA2sg77LtSBA/o.jpg"
      }
    ],
    "user_id": "gofnmwo5ptoEnQI47zCBYg"
  },
  "QfWperQ5ttiPeD-_aJ_QpQ": {
    "date": "2/24/2018",
    "text": "Salad smelled bad and was just a handful of lettuce but cost almost $10. Incredibly disappointing. Panera's has changed for the worse. It used to serve bigger salads that didn't literally smell like trash for the same price.  Also Came here for a coffee and waited 30 min just to get a paper cup to serve myself coffee instantly.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nvOa_CzbreG3qs9u6BMyvw"
  },
  "c6-yGe-8f6zseineGRahMg": {
    "date": "11/14/2017",
    "text": "Despite the fact that it always riddled with undergrads, this is a pretty solid Panera. The food is good, the employees are pleasant, and my order has always been correct. You can expect to wait in line at all hours, but they move through the line pretty quickly.   I'm giving 4 instead of 5 stars because Panera is so overpriced, but I do find myself here more than is good for my wallet because of the soup and salad varieties.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VO16w17eBZOXO-evJrLvBw"
  },
  "mvPFF8eMo52JnXU-jjnX6Q": {
    "date": "1/11/2019",
    "text": "This steak arugula was more arugula than steak and they gave me a baguette with a bite out of it. However in the end it didn't matter that the food at this Panera was shit because I threw it all up an hour later",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CidOXxSElOcn8GdSm2Dp8Q"
  },
  "mHkvavD2W1uxmEIsM95Fig": {
    "date": "9/10/2016",
    "text": "Plenty of seating area for all Panera guests! I can only imagine how many students visit this location during the school year since it's near the college! It would be nice to study in here since there are some quieter areas.   We came to Panera for breakfast and ordered the steel cut oatmeal, power sandwich with egg whites, avocado, and spinach, and four cheese souffle. My hubby loves their souffle and is delicious. It is made out of buttery puff pastry and has cheese and egg inside of it. Yum! The steel cut oatmeal and the power sandwich are pretty decent. I also got a cinnamon roll to go for free because I had a free birthday pastry to use from being a Panera rewards member. It is huge and can easily be split between two people.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2QqtEKFdyvzFYQzLWTuTEA",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. Soufflé",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2QqtEKFdyvzFYQzLWTuTEA/o.jpg"
      },
      {
        "img_id": "XKR6wTjZgNWWA6TCHBXxEA",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. Pastry display",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XKR6wTjZgNWWA6TCHBXxEA/o.jpg"
      },
      {
        "img_id": "rADHextfzElIfvpcn_1sTg",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. Steel cut oatmeal with blueberries and granola",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rADHextfzElIfvpcn_1sTg/o.jpg"
      }
    ],
    "user_id": "jNGNhSu-2cQSWaF--kBBYg"
  },
  "NvwdmhEylJg0nqf5SizzZg": {
    "date": "7/25/2017",
    "text": "My go to place before afternoon classes at Sennott Sq. It gets really crowded during day time, sometimes noisy. Otherwise a good place to do some last minute study before your midterm or final.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JrvAjn2LYdGhaMXfMVAiTw"
  },
  "Oya8nGmV6VC_lVcMtrjS3w": {
    "date": "5/27/2017",
    "text": "This has be the largest Panera Bread I've been to; seating isn't an issue here. The food was traditional Panera with the great bread and the prices were the same. Service was quick and easy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9tcr-am0LCDg3bKk7fMKCg",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. Inside",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9tcr-am0LCDg3bKk7fMKCg/o.jpg"
      },
      {
        "img_id": "mttxcDUMN0zt9h9KY5PxUg",
        "caption": "Photo of Panera Bread - Pittsburgh, PA, United States. Inside",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mttxcDUMN0zt9h9KY5PxUg/o.jpg"
      }
    ],
    "user_id": "EIFi7yFivT4o2PuOlNx5FQ"
  },
  "IDeEFEkFf87QLpPIaGadEg": {
    "date": "5/3/2016",
    "text": "Each time I go here, I very rarely have complaints. The service is quick, the food is good, and the employees are pleasant. This is one of my go-to places for a meeting, because I know it will be quick and provide ample space to meet. It can get pretty cramped in here, but it all depends on the day and time. There is a private room available in this Panera location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UyXqGEKod-veD6m6Hq0EDw"
  },
  "rzlPV6dr0JmzDffny0csdQ": {
    "date": "8/29/2018",
    "text": "Just stood 2nd in line for 15-20 mins while the cashier prepared a huge order. Everyone including the manager just walked past as the line got longer. Not once did the girl call for help. This is not the first time it took close to 25 mins for me to get my food. That's my whole lunch break. Sure I can order ahead but then they place my food outside the counter where people's can just pick it up. I'll go to the one on the Blvd of the allies from now on.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jp-6muM2NrBYQ3v10Ln6fw"
  },
  "rwze6Ggmo89DR7niQpx6TA": {
    "date": "1/28/2018",
    "text": "Friendly staff, clean environment, yummy pastries. Definitely a good place to study (read procrastinate) when you need a break from the library. My favorites are their artisan chocolate pastry and asiago bagel (yum).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EU5dSjk-UzILTp5kcg-dOQ"
  },
  "e1mKR-0ZAgGZzXfVX9fLZg": {
    "date": "7/23/2018",
    "text": "This is probably the worst Panera I have ever been to. My bagel arrived in three separate chunks, not nicely cut. I had asked for a cream cheese bagel and the bagel came without cream cheese spread on and instead little packets of cream cheese that were hard. I will never come back to this Panera. I highly recommend finding a different cafe.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "94i9QGY-MYKoKRbkkq06Tg"
  }
}