{
  "-eJQzOY8RQz3oOJMymjp6g": {
    "date": "6/24/2015",
    "text": "We decided to try this restaurant because of their extensive dim sum menu. You order from the menu and they bring out the dishes one or two at a time, so that there's always food on the table. I miss the dim sum restaurants in Chinatown restaurants in other cities where the dim sum dishes are rolled around on carts. It's always nice to be able to see the dishes, so you know exactly what you're getting and so you can try food you would have never ordered from a menu. The menu here has photos of some of the dishes, but not all.  In addition to the dim sum, we ordered scallion pancakes, veggie rolls, and General Tso's tofu. We had a feast. We thought the food quality was very good. Service was attentive. We will definitely be back! We're excited to have such a good dim sum restaurant in Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pecOLZ7b__8UQp3hjbLpyQ"
  },
  "xw5JzBhOowYnba5rQUHzxw": {
    "date": "6/7/2016",
    "text": "The price is not fair. Most important thing is the food Taste horrible. It was totally over cooked. Do not come unless you truly need something to disappoint you.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D4GMqFaWTOVsVCvJi6V35w"
  },
  "Us7jSUd_IiRr9Km53jCrug": {
    "date": "12/18/2014",
    "text": "We have been here several times, it's one of our favorites. They have a great dim sum menu along with your favorite chinese selections. A couple of my favorites on the menu are the egg drop soup, crab rangoon, shu mai, and fried shrimp balls. The servers are always friendly. Prices are reasonable. The only complaint would be parking but that's Squirrel Hill for ya!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hGNn8lIQ4EjZAoM-HM_Vbw"
  },
  "O6n1_5Ymcx1XSwp5Kud-Jg": {
    "date": "9/7/2014",
    "text": "Ordered online from grubhub. The food was fine, but the Thai ice tea tasted funky. The delivery service was horrible. The driver took a long time to find our house, and then forgot to give us the Thai ice tea. We had to call the restaurant for the driver to come back and redeliver our drinks. Would much rather go in person than order delivery.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FGOAXa7rSSRuPYoGkehe8A"
  },
  "h2-RLSU0DMn2v0CI1evRMg": {
    "date": "1/1/2012",
    "text": "I decided to give this restaurant a second chance and have concluded it is hit or miss as well, but my recent experience was definitely deserving of four stars.   We ordered the green curry with chicken, which has this amazing light green curry sauce with coconut that has a perfect amount of spice to it.  It might be too spicy for those who are sensitive and tend to steer away from spice.  Also it was one of the best southeast asian curry dishes I've ever had.    We also ordered the basil eggplant and tofu which came in a delicious sauce with various vegetables; this dish was also spicy which was wonderful.    I really do not recommend the pad thai but would like to go back to try the other noodle and rice dishes.  I was pleasantly surprised that their specialty dishes are quite tasty.  I was really apprehensive at first but the next time i visit I'll definitely open up to trying new dishes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zAzCOnCSS1DiceIWXKQQWw"
  },
  "7GPrndn4NmDnxfi3NJGicw": {
    "date": "5/21/2012",
    "text": "Another lunch in a different place. I was attracted to Sun Penang for a number of reasons sum and Malaysian primarily.  Over all its nice.  The dim sum was relatively sparse and menu ordered as opposed to being wheeled around the room. We had the shrimp bonnets which were good but the cover was not as fine as some I have had... or made.  I and my companions all zeroed in on noodles which were quite good.. The Singapore noodles, Pad Thai and Penang Char Kway Teow Noodles were all good. Note that the left overs made a great breakfast as well.   I'm not very familiar with the cuisine of Malaya but this was a fine meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HIAU0RTaRUwJEoJUJ3rAIw"
  },
  "pYfPOA2n6top-e8R7VBD5A": {
    "date": "8/9/2014",
    "text": "If you come here snd get dim sum its really good and its the onky place to get dimsum in the pitsburgh morganrown area. The shrimp dumplings are better than most along with the fried shrimp balls and the steamed pork buns.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mGcm0H4l5uUu2GaErh-aCw"
  },
  "ARcqIWKb-QQJheLnBXuzww": {
    "date": "10/27/2013",
    "text": "I thought being in squirrel hill this place would be right on.  More like way off.  The waiter was not very friendly. My food came out 10 minutes after my friends meal did and we were the only ones in there.  I won't be going back there. However the receptionist was very very nice.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uRrk4iuVNt5sqj2B1E2tFA"
  },
  "zkCHJWQsp72pmDeYomIyCQ": {
    "date": "7/5/2011",
    "text": "More of a 3.5  Went here yesterday July 4th for lunch after driving in from NY.   We ordered:   Kara Mee Soup (highly recommended) Pad Thai  (highly recommended) Dim Sum:       Fried Squid (was alright, but a bit greasy)      Garlic Spare Ribs (could have been better, needed a longer cooking time)  We tried to order the egg custard and roast pork bun, but they didn't have either.   Service was alright.  The glasses were filled, but not always quickly.  Hot sauce was brought out quickly so the food did not get cold waiting to be spiced.  I would have preferred that the waiter brought out service silverware since we said we would be sharing everything, though he did make sure we had extra bowls and plates.  Overall a good experience.  The food was solid and the Pad Thai was particularly delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kXt6tPSGLWhWTiXO7XPjuA"
  },
  "O7Vr-6zBO6LAqer5ABCi2w": {
    "date": "11/21/2015",
    "text": "Very nice! love the steam white fish!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IsE27jRycLE8xQl6tNGwbQ"
  },
  "XTri2cSOX3B9jv2dShpj6w": {
    "date": "1/18/2014",
    "text": "This used to be my favorite restaurant in the town. But I was so disappointed today! Poor service and cold dim sum. The shrimp dumpling were cold. And the egg custard buns were raw!! The flour was running! OMG! Disgusting!  Also, the server dip water on my friend's coat and he did nothing! Ridiculous!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qPsn9g1-KZS9vuQ9OUZqEg"
  },
  "GKF5oYL0SDRVxi36mnOIqQ": {
    "date": "12/19/2015",
    "text": "the dim sum here is really nice! i love the xiaolongbao with crab! super delicious! and lots of other stuffs are also awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "geBUUhoXs-DPghHlG62QzQ"
  },
  "0TYH8WqQF3irpU-6kGUUXg": {
    "date": "4/22/2013",
    "text": "Their Kari Mee soup is fantastic on a cold winter's night. I highly recommend ordering it extra spicy, and most importantly they deliver!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ugd_yB1RecZMCWfSsr3GQ"
  },
  "JT3JmA7nrDUueY4CcGiR6w": {
    "date": "4/26/2013",
    "text": "The food and the service are consistently good here.   My only complaint is the cleanliness of the bathroom on the main floor.  It smells like man pee.  Otherwise, the food, the service, and the atmosphere are wonderful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p_OlY_uSdI6qyqJnC2-oRw"
  },
  "35ZJHsCNFRVePA33g7EEgA": {
    "date": "2/14/2013",
    "text": "1.5/5 - Beef Chow Fun: Lack of flavor, no spice, beef was a bit chewy.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GvHK50CjK0Fr9i3YAM6gAA"
  },
  "9G-ToQVVoZ8Egh15cTXUZQ": {
    "date": "6/23/2011",
    "text": "I'm actually pretty surprised by the negative comments on this restaurant, judging by how I'd have to say the food was pretty amazing when I went a week ago. It could just be the food we ordered was slamming or the chef, but whatever it was, I'd definitely come back. My family and I went there on a whim because we were in the area and it sounded interesting so we said, why not. Keep in mind that this review is for the dinner service.  I'd have to say the Sarang Burong is definitely a black pearl in this restaurant. The taro outer layer was just cooked perfectly. It wasn't too crispy but just had the right crispiness to the taro with plenty of seafood and chicken inside. The Hainan chicken was also good as well and had tons of flavor in each bite. We saw dim sum on the menu and decided to try some and I would say the dim sum is just OK. Nothing extraordinary, but not bad by any means.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rXoymJVtWZyBkx-gU7aVXw"
  },
  "f2sWgVk_nHKjb6Sg8L9Oxw": {
    "date": "4/28/2011",
    "text": "Dim sum was not too bad all things considered. Tea tasted funny like it came out of a giant vat that was never cleaned properly.  a decent place to go if you're in pittsburgh and need a dim sum fix.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IvidCwnCMi9HCCbD9LpR3Q"
  },
  "wSYHnRqaZaMirzoYXYGeJQ": {
    "date": "8/15/2010",
    "text": "I grew up in Penang, Malaysia. I've also been to multiple Malaysian restaurant around the east coast and the midwest. So it is safe to say i know plenty when it comes to malaysian food.   We ordered some roti canai, loh bak and satay as our appetizer. Roti canai is too small of a portion but the kuah (curry) is actually decent. The satay is nothing like satay but chicken on sticks. Loh bak is actually pretty good except they serve it with a sweet sauce instead of \"loh\". Defeats the point of the LOH bak if its without \"loh\".  We ordered a Mee Goreng, Char Koay Teow and Curry Mee. The Mee Goreng is good. I give mad props for that cause its one of my all time favorite. However, the Char Koay Teow and the Curry Mee was a big disappointment.   Will probably still give it another try when i return to Pittsburgh next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "y7JOMUXb-dEo5QdN6_VigQ"
  },
  "OxKwFbDJu7XGx7mW-0K11A": {
    "date": "9/7/2015",
    "text": "I've been on the search for authentic Chinese-Malaysian cuisine in Pittsburgh so I thought I'd give this place a try. The food was 3/5; we ordered the roti canai and chicke satay. While the roti was great, the chicken satay was over cooked which unfortunately left it stiff and dry. For the main course, we ordered shredded beef over vegetables which was delicious. Where the restaurant loses two stars is the service. While our waiter was polite and responsive, she was overworked and frazzled. When we asked for something (mostly for water), it took her 15-20 minutes to get to us. Overall, the food was okay but the service was unfortunately mediocre. Might give this place another chance.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d0bqEdYSJElMEmHr61Cklw"
  },
  "M8906Kv6fC0kH5uk8tomug": {
    "date": "6/19/2013",
    "text": "I stopped here for lunchtime dim sum with two friends on my birthday. It was delicious! Lots of options and different sauces with almost every dish. The server was fantastic - working with me on my sensitivity to shrimp and constantly swooping in for refills. The owner/manager stopped over to chat with us and was sweet and funny. Can't wait to take a group back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SbptN52njtiJK2G73FTcnA"
  },
  "LbCKE0gr7epCEY5nWcNCbQ": {
    "date": "11/6/2016",
    "text": "Beef chow fun was burnt. Taro kor was burnt. Chives shrimp dumping was raw inside and has no shrimp. And they said it is meant to be like this inside. Well...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cEWG6xTyIg-kcqXkwSqBWA"
  },
  "efG-8ITHXVntpM70q3Tb-Q": {
    "date": "6/28/2013",
    "text": "I really, really, really like this place. It's become a staple in my Squirrel Hill dining out rotation.   I'm most impressed with their Shiu Mei and Roti Canai as far as apps go. The chicken satay is yummy as well, but it's sort of difficult to really mess that one up in my opinion.   I've really liked all of the main courses I've ever tried, save for the green curry. Oddly enough that is the only dish not up to par with the rest of their standards. The wait staff is very attentive, friendly and pretty accomodating for large groups. Also would be good for a couple grabbing a dinner in a more intimate restaurant, as the low lighting, decor, and full bar can make for a special kind of ambiance.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mLDC0DjkT2IJkoppBze4eA"
  },
  "nYJlB6tG_78N6ZSMvhfCZg": {
    "date": "1/16/2016",
    "text": "Our second time for the miso hot pot. It smells and tastes fantastic.  The new hotpot is a masterpiece. I really enjoy it. A must-try especially in winter. Everything blends in perfectly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "spihDFyHqv91DJK9v8yh4g",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Hotpot",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/spihDFyHqv91DJK9v8yh4g/o.jpg"
      },
      {
        "img_id": "vEU7MQuTsMdiKIjLlfAWGQ",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. A Masterpiece.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vEU7MQuTsMdiKIjLlfAWGQ/o.jpg"
      }
    ],
    "user_id": "bekIoEBr7DqOv7TI_arEcQ"
  },
  "KY5TUFX6ySbQKOnO1JU2dQ": {
    "date": "7/4/2013",
    "text": "Wasn't the best ambience u can get. The guy almost drove us away since they were about to close!  But loved the 'roti kanai' dish. Probably shall keep going back only for that dish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ApRtlJbTaYUP1SI5wJ3-lw"
  },
  "OuW35OeJrXv8g5vZETudwg": {
    "date": "1/2/2016",
    "text": "Food :Really good shrimp dumpling (Ha-gao).  Nice pork congee. Taro kor was a little bit too dark and bitter.  Service:The owner (or manager) left me with a menu, and then he was not interested in taking my order. It took a while before the waitress from the back of the restaurant came to ask me and took my order. However, the service from the waitress was good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CcCb5XiyuIS60sJ1watjmg"
  },
  "U8wXwysjgyVAQ0_1JGVUMw": {
    "date": "11/4/2014",
    "text": "Being a Singapore resident for some good years, visiting this restaurant was like home coming for me. I could find most of my favorite dishes and they were well prepared. We ordered the Pangan Ikan (Spicy fish wrapped in banana leaf), Char Kway Teow (Spicy stir-fried rice noodles, Crabmeat and prawn dumplings, prawn rice rolls (ya..the chee cheong fun for those who know it that way) and bubble milk tea.   I must say that the pangan ikan and char Kway Teow tasted exceptional. The authenticity was there and I was able to specify my desired spice level for the char Kway Teow.   However the rice rolls could have been better. They were sticky and the prawns were a little overcooked. Traditionally, they drizzle soy sauce on the top and add a little sesame seeds.  But for this one, the chef had just placed the rolls on the soy sauce.   I would like to try the lotus leaf sticky rice and hainanese chicken rice next time.  Overall, the experience was good and it made me feel really happy to have found a restaurant where I still can have my beloved dishes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JnFiIKJzPPcdJUdDFTpYAA"
  },
  "M07ecghZJocW53gZRvtKtg": {
    "date": "10/29/2010",
    "text": "Having read some Yelp reviews of this place, I didn't expect much when I came here for lunch even though the friend I was dining with said how much she enjoyed the place.  The lunch specials here are $7, and come with a salad and a vegetable spring roll.  I was satisfied with the green curry I ordered, which also included a side of white rice.  The vegetables (green pepper, onion, broccoli, snow peas, and eggplant) were fresh.  The curry wasn't super spicy, but had good flavors.  We split a dim sum order of sesame balls for dessert, and they came out piping hot, fresh from the fryer.    Not bad for lunch, though it's more pan-Asian than Malaysian or any other specific Asian culture.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zh8-XfjqlwAxf--RS4azzg"
  },
  "7Kpp0Fy1l6el4eF9pJ7-vg": {
    "date": "8/30/2014",
    "text": "I don't do reviews but just for this, I download the app. This is by far the worst Malaysian food that we have had.  We were greeted rudely.. (Surprisingly,  he was the owner of the restaurant!) which totally ruined our mood. However, the waitress was really nice. We ordered the Hainan chicken rice and curry chicken.. As we thought we couldnt go wrong with these. The chicken rice was blend and horrible!  And did have the taste of chicken but just brown fried rice with oil. The chicken meat was dry and coarse.  Curry chicken was bad.. rotten kind of bad that it tasted sour. The boss did not even apologize nor spoke to us - I didn't think he'd care! For what they charged, not even worth it : portion wise nor quality.   Totally disappointed because we read the good reviews before going. I'd rate it 0 star if I could, so 1 star is for the nice waitress.  Would not recommend anyone going there if you're expecting decent malaysian food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "EUNeLBlH92xPnxQGH5S35w"
  },
  "z2uMrVGdA03lkzzQYdETBg": {
    "date": "9/22/2015",
    "text": "Large portions. Super friendly and attentive service and fast but just ok food. Curry was very watery and meat not great. Kung pao decent and my son loved his orange chicken. Lots of broccoli but meat quality just ok.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zpCpkAuQb669meNOgJw6PA"
  },
  "NsPAt40paCOa7_rBKuViUg": {
    "date": "7/28/2015",
    "text": "Wow! I came here expecting Malaysian cuisine and got Malaysian, Chinese, and dim sum! Dim sum! And not even on a weekend for brunch either! Amazing food. Very affordable. After ordering we had our food I front of us within 10 minutes or less. Great service. I ordered the shrimp dumplings, sesame buns with lotus/jazmine paste, the stuffed eggplant, and the steamed pork buns from the dim sum menu (all small dishes, I'm not that much of a glutton). It tasted as good as it does when I visit an establishment that is solely  dim sum where the nice ladies push food carts around and you pint at what you want ( or you do what I do and bring someone who speaks Cantonese). Anyway, this place rocks. Go here and order delicious food immediately and without hesitation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7pDWdIeQFROfsLHyqbh8ZQ"
  },
  "B3UO_TPuRfu78Rjj_t-94A": {
    "date": "9/23/2014",
    "text": "Delicious variety of food, good drinks. Everything tastes very authentic and the staff is really nice too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iaUmKig7QJFtD8A_hRRpvw"
  },
  "VTijmVEK6U-_ZBVB7qKn8w": {
    "date": "2/4/2012",
    "text": "This 4 star review is happily posted for Sun Penang's dim sum menu!  (I honestly don't know why the reviews are not great here.)  After some disappointing outings for dim sum in Pittsburgh (I'm looking at you, New Dumpling House and Empire Palace!), my family and I finally came across Sun Penang in Squirrel Hill and we are so glad we gave them a chance today.  We got an assortment from the dim sum menu to get an idea of what they had to offer.  There is a pretty good selection (available from 11am-9:30pm) and the prices are reasonable.  Here's what we got:  Bean Curd Skin Roll - excellent Shiu Mei (Pork and Shrimp) - also excellent, did a 2nd order on this one Chive with Shrimp (Dim Sum) - great Rice Kor (Dim Sum) - OK, great texture on the outside, a little skimpy on the filling Steamed Dumpling - OK, filling was good but the dumpling skin was a little soggy Coconut Cake - perfect dessert Steamed Pork Bun - great  I also ordered the Young Chow Fried Rice from the regular menu.  This was good and it hit the spot flavorwise.  Not heavy on the white onions, great rice to meat ratio but it was a little oily.    We went in on a Saturday lunch and the service was very attentive and friendly.  Our family can rest a little easier knowing that we found a dim sum spot in our new home in Pittsburgh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "oF8Efb3fBrwWZvmsl6e-pw"
  },
  "9xH9NULh2G60MMpm9hXVvQ": {
    "date": "3/4/2013",
    "text": "I'm so excited Sun Penang now offers Shabu Shabu hot pot! The broth and dipping sauce was amazing and the veggies were all fresh. I will definitely come back here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dWLsVm40QCeFSxaVa82jEg",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dWLsVm40QCeFSxaVa82jEg/o.jpg"
      }
    ],
    "user_id": "w2AYXokBMGjAAdHsYQnPxg"
  },
  "qUgZ2BkiaXBB2m17u7uH4g": {
    "date": "9/6/2014",
    "text": "The food is good here, but we find it frustrating that they won't make dishes gluten-free. The other Southeast Asian restaurants we frequent in the East End offer gluten-free versions of their dishes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rpK40ZN2rNFJLhfdlQqS-Q"
  },
  "7z1f6fINIUsHwA-WOhN2eg": {
    "date": "5/14/2012",
    "text": "I really wanted to like this place, having heard great things about their dim sum (which turned out just to be dim sum style dishes you order off a menu like everything else).  After sampling over a half dozen offerings, I have to say it was pretty hit or miss.  And, unfortunately, the misses were far more memorable than the hits.  Soggy eggplant and bland, chewy spare ribs far outweighed passable dumplings and interesting shrimp balls.  The modicum of enjoyment brought on by Sun Penang's successes were not nearly enough to escape from the depths of disappointment that were equally present throughout their varied menu.  With China Star just a short walk away, I doubt I'll ever return here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "D-_yG-XuT_-gf3six6a7mg"
  },
  "Ok6uKlvA1JdtFiu59m45hQ": {
    "date": "6/14/2014",
    "text": "We had stuffed eggplant and pork bun dim sum, which was tasty and reasonably priced.  I had tofu basil and asked for it very spicy, loved it!!  Hubby had spicy beef and broccoli and he cleaned his plate. Very friendly waitstaff, knew the menu well.  Only complaint was the bathroom, needs a complete gut job--if I went in there first I would probably not have been able to eat.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "70sSlkooEgL_TEjWDQbr3A"
  },
  "x7B0eMaaT-I8XUk55PxjFw": {
    "date": "1/2/2014",
    "text": "Large variety, poor quality. There's nothing here I've tried that wasn't a huge let down. The food is bland, leaves plenty to be desired. I've tried the spring rolls, they are too big and not crisped, the pad thai, green curry, potato curry, and fried rice. Everything smells better than it tastes. The only positive is that they delivers and they take online orders through GrubHub.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cKeMks0yFeItSlkUKnZW0w"
  },
  "p9NdnmErUgosfSoal7R0PQ": {
    "date": "1/20/2014",
    "text": "Worst meal I have had to date.  Orange Beef, hot n sour soup, brown rice all terrible.  How do you mess up rice?  The rice has some smokey coal bad water flavor going on....yuck...good bye 30 dollars.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4cGeJLRNp1psvxWqfwHW-A"
  },
  "1YgnfbeMIwau7Ecr6zikoQ": {
    "date": "8/7/2015",
    "text": "I love the Singapore Noodles. The Basil Chicken is OK. The service is great. If you want spicy you must emphasize it but they will do it. It's good stuff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WsWYPgmErgy1EatHfIWMBQ"
  },
  "u5TtMcI6EbHyrLxkLKi76g": {
    "date": "11/13/2012",
    "text": "Excellent all around, but service is very slow if you eat there; I recommend take out. Dim sum menu is delicious (I recommend the turnip cake and what they call 'lotus leaf sticky rice' which is actually  [zongzi], a sticky rice dumpling), and the rest of the menu is delicious as well (best  [beef chow fun] in Squirrel Hill).  They do have a full bar, but the drinks from it are not particularly good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P81YNqyBLoyTu8wo1nFTWA"
  },
  "-rY3QVEehLcvFrEV1wMrCQ": {
    "date": "7/4/2011",
    "text": "Came for Dim Sum. They have standard dim sum choices. Overall it was mediocre in my opinion. I agree with many of the other reviews here. Missing Golden Palace.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3jthjsC-KNPTeXl6R26PhA"
  },
  "7VrXpyBoPJ4dLo-UJ9pmVw": {
    "date": "7/30/2010",
    "text": "I went here for dim sum. Overall, the food was good, although I have an aversion to bones in my meat. The service was quick and the atmosphere very nice. If you're looking for dim sum in Squirrel Hill, this is the place to go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mtGmYZ-k2YIqrVh0ek6ecg"
  },
  "R2u3SsXBTXHXE14WPSs_JA": {
    "date": "5/2/2009",
    "text": "Delicious food, nice ambience, and friendly service. It's pretty amazing how there is Malaysian food in Pittsburgh. During all of the times I went there, I never had a bad experience. I highly recommend Sun Penang!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "k6GurG0wmHVyiZGzmxs8eQ"
  },
  "XpFgExkD_TkqcHlY-K_vvw": {
    "date": "1/26/2013",
    "text": "Great place for dim sum and several types of Asian food including Chinese and Malaysian. Decor is tasteful and modern, though a bit dark. Service is pleasant, prices are a little above average for Pittsburgh but not bad. The food is quite good, and there are many things on the menu you won't find in other places, including the sizzling rice soup with shrimp, Pengan Ikan (fish wrapped in banana leaf), and green curry chicken. All of the familiar types of dim sum including hargow, shumai, chicken's feet, tripe, stuffed pepper and sticky rice are excellent here, probably the best in Pittsburgh, although Misaki buffet has been increasing their dim sum offerings and quality lately.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cGEcpa2fqX3UqM97ljVfNA"
  },
  "O2HK86iRofI0TIHpozA-qQ": {
    "date": "5/11/2009",
    "text": "I'm reviewing this based on the dim sum that Sun Penang has to offer.  We went on a Saturday afternoon for dim sum.  We quickly were offered the first of two carts, from which we selected several items.  I would say that the items in the carts were a bit more towards room temperature than the items ordered off of the menu.  Everything was pretty good (although I would not recommend the spring rolls).  The two items that stuck out were the pork dumplings (that had a ton of filling) and the malaysian cake (which was like the best angel food cake I've ever had).  Overall I would definitely recommend Sun Penang for dim sum.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "e1k6ae0iKDph5b5Jf2f3uA"
  },
  "797TSUf76icUb_jtWnGDKg": {
    "date": "10/6/2012",
    "text": "Ordered Vegetarian Pad Thai and Thai Ice tea. The pad thai was so bad (despite me ordering like a spice level 8). No flavor.. not enough salt. It wasn't so good. In fact I still have half of it left in my plate as I write this review and I am going to have to toss it. Rather not eat Veggie Pad Thai ever here",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qK7lGw8y5mfByT-I-Se0mg"
  },
  "43CjRcOr_UcohLRS1FLprQ": {
    "date": "9/7/2008",
    "text": "It's hard to go wrong with the reasonable prices, swank atmosphere, and delicious food at this restaurant. I heartily recommend the Malaysian Beef Rendang. It seemed like the other dishes were hit or miss, especially in the more generic Chinese/Thai categories, but I'll definitely be going back if just to have the Rendang again. They get an extra bonus for having hard-to-find Malaysian food on the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S1cjSFKcS5NVc3o1MkfpwA"
  },
  "ho5yyWBtaxlh1c2rnMc_Ag": {
    "date": "3/31/2012",
    "text": "I've been there twice for lunch, and liked it both times.  The first time, most orders were off the regular menu.  Second time was dim sum only.  I thought the dim sum was reasonably priced and delicious, even compared to dim sum I've had in SF and Houston.  The deep-fried items (taro kor, sesame ball) were perhaps too greasy even for something deep-fried, but had a very nice crisp and tasted great.  The regular menu is on the more expensive side, but the dishes were large and very good.  I heard they do dim sum carts on weekends.  Will definitely have to go for that sometime!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8heSpevri02f06W9VeNz0g"
  },
  "HRdu2dTsNBKDnLuTQe7oqA": {
    "date": "5/9/2008",
    "text": "Very tasty mango chicken, like previous reviewers have said--the mango is shockingly fresh and juicy. Other dishes are good, too, although a friend complained the satay was too greasy.  Other appetizers like curry puffs are great, though. They also offer a malaysian iced coffee which is quite refreshing!  Service is courteous and quick, which helps maintain a relaxed but professional atmosphere. The outdoor patio is nice during good weather, even during a spring rain since it's covered. Overall, a rather nice dining experience!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yKFeQD-gcsPKj1BIs813oQ"
  },
  "4hCZmpQvbZ-YdHYeHh-D6Q": {
    "date": "6/7/2014",
    "text": "If I would've reviewed this place 4 years ago, they would've gotten a solid 3 stars.  Unfortunately there are several things that make this place awful.  First, the Malay cuisine.  After their Malaysian food went down hill worse and worse, they finally pulled most of the cuisine from their menu.  Mind you this was supposed to be a 'Malaysian Restaurant'.  They added Dim Sum, which used to be not bad, but the last time we went, it tasted like the frozen dim sum that you buy at the chinese grocery store.  Not fresh at all!! Finally, two weeks ago we went to a friend's who ordered delivery from them.  They ordered from their American Chinese menu; Beef and Broccoli etc., and it was not edible.  The meat all tasted like it was FAKE.  I'm guessing they are using cheap meat and marinating it in a ton of baking soda. It was gross.  It is disappointing that Squirrel Hill has so many restaurants, and so little of them are good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HkYrrXZgDkETqrT6g0FPUw"
  },
  "Cn7sfYzQ52a-7783jXEYYw": {
    "date": "6/14/2011",
    "text": "Has Malayasian and Chinese Cuisine. Good service, I thought that the Sarong Bourong was awesome, but everything else I have ever had is just good. Great place to grab lunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vNbr4JUZtIDB34xT-1n8ew"
  },
  "yN9VTxIu3wb_14HJ8wiIEg": {
    "date": "3/12/2012",
    "text": "Food flavors are nice, but I think the food sits all day and gets sent out after being microwaved.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kbcQLfhozPaUaGZjJ_noSA"
  },
  "i0JFO9zMRbkexVa9BNRhHg": {
    "date": "8/9/2009",
    "text": "Overall, Sun Penang was OK, not great. I went with three other people. We got four dishes to share: Pad Thai, Basil Tofu, Green Curry Chicken, and Coconut Fried Rice. The food was good -- nothing special, but fine. One interesting thing is that, as opposed to similar restaurants, the waiter did not ask how spicy we wanted our food. We were fine with how it came out -- though the Green Curry was incredibly spicy. (This was OK with me, but it may not be for everyone.) The coconut rice did not have any coconut flavor whatsoever.   The service was fine overall, but two aspects of the experience were especially disappointing: 1) We went on the hottest day of the summer  and, as a result, did not want to sit outside in the heat. The inside was not air conditioned at all and was somewhat uncomfortable. If we had known how uncomfortable it would be throughout the dinner, I might have suggested that we get up and go elsewhere from the start. (This wouldn't have been an issue on a cooler day or in the winter.) 2) When we got the bill, there was a line that said \"Rounding\" and 4 cents attributed to it to bring the bill to end in a 5. So we were charged 4 extra cents that was not related to the food or to tax. We had never seen this before and thought it was ridiculous!!! Why does the bill need to end in a 5? Or if even numbers are important to them, why didn't they round down one cent so it ended in a 0? In annoyance, we left a tip that made the total of the bill end in 91 cents. I would probably have given three stars rather than two if it hadn't been for this \"rounding.\"",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "euFRyJO4U3to-PqfPXPnRw"
  },
  "sWPELA7WwIMj3A2N1UFsdA": {
    "date": "12/27/2009",
    "text": "This was definitely a disappointment (I guess I should have realized it wouldn't be anything special given that the place is normally empty).  I ordered delivery from here and it took over an hour (mind you I live about a five-minute drive away).  I ordered Singapore Rice Noodles and Spring Rolls.  The spring rolls were definitely not fresh or homemade and were an extremely small portion for $3.50.  In general, I felt that the prices were a little high (and am surprised that so many people commented on how low the prices were below).  The Singapore Rice Noodles were supposed to be with shrimp but arrived with about two pieces of shrimp and about 15 pieces of chicken (mind you, I don't eat meat...and there was no mention of chicken on their menu).  That was the disappointment that has made me decide to give it such a low score.  I can honestly say I will never patronize this restaurant and will encourage others to do the same....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cyDZ02DWiw-NJDpk9TtMNw"
  },
  "pTrWuI8J1SWt7Hd8Cgd0mA": {
    "date": "7/17/2010",
    "text": "First we weren't hungry, so we ordered light... shrimp puffs(we call them bacon-wrapped shrimp at my favorite dim-sum parlor in New York), Roti-canai(actually pronounced Ro'tee Cha' nai in Malaysia) and Chow Kuey Teow(a standard Malaysian staple 'chow-fun' and a good indicator in judging a Malaysian restaurant.. you screw this one up...you may wipe out any chance of a five-star rating regardless of the quality of other dishes). Well the Shrimp-Puff gets an A-, the Roti Canai, a B-(sauce is a little watery), the Chow Kuey Teow, a D-, awful, the shrimp is overdone like rubber eraser, squid(not indicated in the menu). same problem , and overall too spicy(even for a person who loves hot spice), and way overpriced,yuck. By the way the standard Chow Kuey Teow uses only Shrimp or Baby Clams in Malaysia. This is reviewed by a former Malaysian, now a New Yorker and a Pittsburgher. That's  all folks! Hope the owners and the chefs read this because things really need improving.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ep6r7gd4B8qmoAyvGXilDQ"
  },
  "S4HLf2FFXVsPqgyt6e6pDA": {
    "date": "1/4/2016",
    "text": "Don't be fooled by the name. Although the word 'Penang' is right there in lights outside their front door, they don't serve Penang curry, which I was on a mission to find. Instead, the waiter talked me into trying a red curry which he said was similar. It wasn't. I ended up just having white rice and soy sauce for dinner, and they didn't offer to get me anything else instead or to take the curry off the bill. My hunt for good penang curry in Pittsburgh continues...",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "pAfCfcfScZGoT4IG1sjbVg"
  },
  "KheeK1OV5e6jh0lJ_aX3Ew": {
    "date": "8/26/2016",
    "text": "Food is ok (the traditional \"Asian\" dishes are a bit unusual here, but not necessarily bad - just a bit different). The service is among the slowest I've ever experienced. We waited for over 30 min to get our food after we placed the order. And there were not that many people in the restaurant. In addition, right before they brought my order they told me that they ran out of brown rice, so I had to adjust accordingly. (How can an Asian place run out of rice of any kind?!?) Anyway, avoid at lunch time during the week if you are looking for a 30-45 min quick lunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H6b815p3QkCdsp5zbpux8g"
  },
  "8XZkgQTdkuEMgQH3b2wi7A": {
    "date": "5/2/2014",
    "text": "Sun Penang offers great lunch options if you go between hours of 11-3pm. You can practically eat lunch for less than 10 bucks and that's including soup/egg roll and a main entree. It's not so great during dinner hours. I ordered the mango chicken from the dinner menu and it was not so impressive. It came with a whole mango cut into halves and stuffed with chicken garnished with lettuce, peppers, and carrots (also an umbrella that you find in your drinks). The dish was extremely sweet and lacked any real flavor. I guessed I should have expected this outcome since it is called \"mango chicken\".  I tend to come for the dim sum since this is the only place that I know of which has dim sum. The dim sum menu is very limited and the \"shiu mei\" and shrimp balls were pretty small.  Anyway, the reason for my 3 stars is that the place usually only has one waiter or waitress for the entire place so the food comes out very slow. And also, I feel the food is altered to the American taste with large amounts of sugar added and the dim sum portions are small. There's definitely better Malaysian/Chinese/Dim sum elsewhere....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jYJkHfgI-BgwAIz1e0y0dw",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. mango chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jYJkHfgI-BgwAIz1e0y0dw/o.jpg"
      }
    ],
    "user_id": "kjNm9hqvQOV3tFzpiWaTVA"
  },
  "5GqNKMg2JqXCO6EcV2PlyA": {
    "date": "11/6/2015",
    "text": "When we saw the \"Dim Sum\" sign outside, my husband and I were intrigued because my favorite (and prob only decent) Dim Sum restaurant in Pittsburgh, Golden Palace, had closed years ago. Sun Penang seemed to have a decent crowd for a Sunday afternoon so we thought there has to be something good here. Wrong. Maybe all the folks there had the same idea we had and were dining there for the first time? Our waitress was grim, lacking any sort of emotion. I gave her the benefit of the doubt, maybe she was having a bad day. But we quickly noticed that all the wait staff had the same emotionless expressions on their faces and \"I hate my life\" tones in their voices. As for the food, the dim sum was awful. We ordered shumai, shrimp dumplings, chicken feet, roasted pork bun and turnip cake. Everything tasted like it was straight from the freezer aisle of the Asian store and reheated in a microwave. It was all semi soggy and nothing tasted fresh or homemade. Not to mention, it all was kind of cold when it got to us. In terms of the atmosphere and decor, not too bad. The place has a full bar, but by the looks of the bartender on duty that day, she didn't seem to know what she was doing.  Lastly, they must not have a busser. When we came in, several tables had not been cleared and were left that way for our entire visit. Don't waste your time and money coming here, you're better off getting the frozen items at the store and heating them up yourself at home.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "SEEVCC9nF8LRZ2blbR6NiQ": {
    "date": "5/4/2015",
    "text": "Sun Penang's rendition of the famous Hainanese chicken rice is mediocre at best. The chicken was rubbery and tasteless compared to the kampong chickens I've had in Malaysia and Singapore. The rice was much darker coloured than usual, but falls short of the delicious oily chickeny taste that one expects. The sauces were pretty standard. Overall, I don't think it is worth the whopping $14 price tag, considering that it costs $4 in Singapore, and places such as Mamalee in Vancouver, BC serves a far superior version of the dish for $12.50 CAD.  As an aside, it is interesting that Sun Penang serves chicken with bone (this is not a bad thing of course) when most places in Singapore and Malaysia serve boneless chicken nowadays.  People visiting this restaurant would do well to heed the other Yelp reviews and stick to their dim sum.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E8s8jjzZ69F1A92sxVPt6Q",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Hainanese chicken rice (take out)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/E8s8jjzZ69F1A92sxVPt6Q/o.jpg"
      }
    ],
    "user_id": "vg-_YnzqVERXgcAt5wDFmQ"
  },
  "Yju86F9WoYELfDEarNA3zw": {
    "date": "4/29/2010",
    "text": "Had some dim sum for lunch today.  Steamed pork bun and the Lotus Leaf wrapped sticky rice. The latter was the star though it felt like it took nearly a half hour to get to the table. Unlike most dim sum places, not served with any sauces. Maybe you have to ask. Also tea charge is $3/pot.  I guess its tough to serve dim sum in small quantities, but I had much better experience with low volume dim sum in Singapore a couple months ago.  $15 min credit card charge is a bit annoying too...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MN1K12ax0vm0UceNvyjCNg",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Lotus Leaf Sticky Rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MN1K12ax0vm0UceNvyjCNg/o.jpg"
      }
    ],
    "user_id": "x9rkVoNB92HR_bFOe6MFTQ"
  },
  "r55En4Yf1dvKQBwQiCI7-Q": {
    "date": "3/2/2012",
    "text": "We decided to give Sun Penang a chance after passing on it a few times while driving around.  There was a Groupon or Living Social deal, so we figured why the heck not as we were both quite curious about it and every time we drove by said maybe we should try it.   We were not disappointed... the Scallion pancakes (a huge reason why my husband was excited to try it) were good, and everything else we had did not disappoint.  We got it to go so not much can be said for a dine in experience.  They did a great job with the packaging (nothing leaked), it was ready when they said it would be, and we enjoyed everything.  Was it the best we have ever had, no?  But it was good and we had no complaints really.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLVq7VSJBHZwqurwWoCmpg"
  },
  "jQW1nJLpUZC6EjrKvksLcw": {
    "date": "6/18/2014",
    "text": "Came here with a couple of friends a while back, since it's one of the few restaurants in PGH that serves Malaysian food.  One of my friends and I spent several months in S.E. Asia back in 2010, and we were excited to see laksa, one of our favorite dishes, on the menu.  Since it was awhile ago, I don't remember specifics about the flavor profile, etc., but I remember that we were both pleased with the quality for a place in PGH.  The atmosphere is pretty laid back, though I agree that it's dark.  Don't remember much about service, so it must have been okay.  If you're looking for decent S.E. Asian food in PGH, give it a try! 3.5 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "gF-vdYI45NuX__2-B1iJow": {
    "date": "2/6/2016",
    "text": "This place is as Malaysian as it is Chinese, and when I say that I don't mean the American Chinese menu (I just skip that entirely). For the first half, they have quite a selection of different dishes from curries to noodles, and some of those are on the lunch menu as well. Only tried the char kway teow so far, and that was decent--lots of flavor, maybe a bit on the salty side. A bit more shrimp and squid would've improved it I think, and noodles could've been softer. On the Chinese side, their dim sum is pretty average from what I've tried. You could get better in Cleveland (probably the closest city around that has dedicated dim sum restaurants), but it's not bad for a quick fix. The century egg porridge with pork () is a classic comfort food which was made quite well, sized pretty well for one person or for sharing. Their new hot pots seem to be popular too, and I'd like to try those (and some other Malaysian dishes) when I get the chance.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "JPtBrgXWiwljIxD3zHtJUA": {
    "date": "9/8/2013",
    "text": "I find Pittsburgh's obsession with \"new American\" cuisine to be annoying and can I say small minded? Why not!   Endless nights of over priced boring food leave me with a bad taste in my mouth...that given, when you love Dim Sum, you will do anything to get it, even risk a muti-ethnic cuisine restaurant. I was pleasantly surprised with the quality of the Dim-Sum here, and let's put that statement in perspective--I have lived in San Francisco (home of world's best dim sum) and I'm from New York--a close second contender. I am not some burger-chomping novice---though I do love a good burger.  We ordered the chinese broccoli, the shrimp with chives dumplings (way better than the plain shrimp ones which we also ordered) the stuffed eggplant, the bean curd skin roll, the shrimp rice roll and the fried sesame balls. My only real complaint is the price--which was more than 20 dollars per person. However, we left feeling stuffed and elated. The people next to us ordered crab rangoon though, just to give you an idea of the uphill battle for good food in Pittsburgh.   So GO support this place and their all-day dim sum effort. Maybe if we go there enough they will lower the prices?",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cqXXdLyVKlpckdu5odG5sw"
  },
  "weni5wbGwLrv7PtLUjkV9g": {
    "date": "6/27/2016",
    "text": "We ordered several dishes and were disappointed with all but one. The Roti Canai was made of frozen Roti but it was hot, the gravy had no flavor. One of the best Malaysian dishes I've ever had is Rendang Beef. The preparation of Rendang we received at Sun Penang was terrible! It lacked the complex flavors of that Rendang should have and was made of poor quality beef. The very small serving on a few leaves of lettuce was so sad looking. We orders a Malaysian eggplant with chicken and it was the only decent dish that didn't feel like it was made of old or poor quality ingredients.   The server recommended Singapore street noodles and it was a barely ok rendition of this dish. It was so oily and felt old.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4QDd6Hu0KRhV1cKohjZNNg"
  },
  "hR7y0tasNyx4n_rQzgO10w": {
    "date": "6/13/2016",
    "text": "Absolutely superb food. Great prices for Dim Sum. Perfect for a quick lunch. Highly recommend the streamed pork buns. Atmosphere is great, and the staff friendly and accommodating. They offer indoor or outdoor patio seating, when the weather is nice. Will definitely come back my next trip to Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yWmSF_4Vg-3K1Hy0hLxsBQ"
  },
  "LIw6BQNKiG-KjEGtD5I2Og": {
    "date": "11/5/2016",
    "text": "Beef kway teo, porridge and dimsum were really good!  I'll def make the 3.5hr trip just to eat at this place again!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-7CA-bBwzhYicjqjyfO7Ew"
  },
  "qTvPyP3gG57A77b1WOMsbg": {
    "date": "3/5/2016",
    "text": "We really enjoyed our takeout here. Roti Canai was the favorite by far, Chives with Shrimp dim sum the second. The Kari Mee soup was good but not well suited for takeout. Skip the pork bun; it was too bland. Reasonable prices and big variety means we'll try more dim sum in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m0_hyv29LLf_IY4sMewt1w"
  },
  "PCzKER0TZP3yvASFGmp4zg": {
    "date": "1/11/2015",
    "text": "I've been somewhat disappointed by Sun Penang, though I may not be the best judge of this particular restaurant. I wanted to experience authentic Malay cuisine, and while I enjoyed by rendang, I have nothing to really compare it to. On some occasions, I've had some pretty poor service, and some lackluster food, but I got the sense that I had come at a bad time (like on a weekend afternoon, after they had been very busy with lunch service).  If a friend invited me to go, I wouldn't refuse, but considering the choices in the immediate vicinity, I'll continue to go elsewhere.  The decor is pretty nice, though.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xwlKaJbUbZf4x8tkowDNOA"
  },
  "BjJzq8tr2_zFmRHOMD2K6w": {
    "date": "6/21/2014",
    "text": "The food is great, not to mention the soft jazz in the background.  I get lunch and dinner from here on a regular basis.  Everything is tasty.  Mango shrimp all the way!  I also love congee and shimp dumplings.  Mai Tais and Singapore Slings!  The owners are super nice and Steven is an awesome waiter.  And they have outdoor seating that's dog-friendly!  What?!  Yes.  Bring everybody and the pooch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2LmUdOXDNK0kaF0hcyDEyg",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Saturday Night. 11.8.14",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2LmUdOXDNK0kaF0hcyDEyg/o.jpg"
      }
    ],
    "user_id": "hAdRBwFynVfhRK2MbKR8Cw"
  },
  "xx9KFY4LotJ4-wWaxPM9eg": {
    "date": "7/21/2013",
    "text": "Boy it was hot today and although I was not really in the mood for some heavy Malaysian food I decided to give this place a try. I had the Penang Char Kway Teow Noodles, which was stir fried wide noodles with squid, shrimp, bean sprout, egg and chili paste. I also ordered stuffed eggplant as an appetizer. Both dishes were very delicious. The eggplant dish both looked and tasted exotic and, more importantly, good. The main dish I would have otherwise had to pack since it was a large serving but was tasty enough that I devoured the entire dish on the spot. It was rather spicy but still tasted very good. Oh I also had the Malaysian Iced Milk Tea, which was sweet but watered down with ice and thus tasted very good.  My server was friendly and accommodating and often came by to fill my glass of water.  Only minor setback was that it was only a little cooler inside as it was open to the outside (and it was extremely hot). None of this would detract from the overall experience. Wow that food was so delicious. Five stars for me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Z3aJjyr8YD892R7jw_3Iw"
  },
  "Ap2MHg70XId8wqHtyRUkUw": {
    "date": "3/23/2013",
    "text": "I was extremely impressed by the Malaysian specials on the menu.  I tried the Mango Chicken, and it was excellent, both in terms of presentation and taste.  My friend ordered the Basil Noodle and it was also very good.  With most entrees priced at 12 to 16 dollars, I think Sun Penang is an excellent value.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "Bzh1R2XBYzSpSyKj7_9XUw": {
    "date": "6/13/2014",
    "text": "I'm surprised the food in this restaurant is so multi-ethnic. It has Chinese food and dim sum, Thai and Malaysian (never tried authentic Malaysian). As for what I ordered, they are all altered to fit American taste. Chicken feet & fried intestine, I know they are so Chinese and I wonder how many non-Chinese would try. They are actually tasty though not very much like those I had home. The entree, forgot the name, but it tastes like typical American style Chinese food, which doesn't agree with me. Coconut cake looks good but tastes like a disaster. It lacks coconut flavor but is like that the sugar is free so it can be squandered into dessert. I wonder why it belongs to the dim sum category.   Service good. Lighting a bit dark. Not a bad restaurant but not one I like around the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DFQmDSSmyW5pSBBYgzp5AQ"
  },
  "cwBBCVclX3mP0Kto6JgMLg": {
    "date": "12/6/2015",
    "text": "Best Dim Sum in Pittsburgh, the crab pork soup dumpling  and beef chow fun are super ! It's quality is comparable to my hometown Shanghai and Joe's Shanghai in New York city.  Their steamed shrimp dumpling, Taro kor and chicken feet are also highly recommended. Service is great as well !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jzRPObG8G2ttG0nyhRNfCQ",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Taro kor",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jzRPObG8G2ttG0nyhRNfCQ/o.jpg"
      },
      {
        "img_id": "BQit7wS5EPKfqg0dqh3DDg",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Beef chow fun",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BQit7wS5EPKfqg0dqh3DDg/o.jpg"
      },
      {
        "img_id": "Ys8GNbNtTfG9NjogQ59QXQ",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Crab meat soup dumpling",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ys8GNbNtTfG9NjogQ59QXQ/o.jpg"
      }
    ],
    "user_id": "rdw0fsGerGLyBI-_jpp60g"
  },
  "0A1W0qGGu1sS9LB8wVGAGA": {
    "date": "12/29/2014",
    "text": "Came here for dim sum based on previous positive comments on Yelp. There was a variety to choose from. For dim sum, we ordered shrimp dumplings, chicken feet, ribs, beef tripe. It was decent. Not bad but not great. One down side was everything came out lukewarm. I usually like my dim sum fresh out of pot and steaming hot.  We also ordered stir fried vegetables and porridge with thousand year eggs and pork. The vegetables were very tasty and fresh. The porridge wasn't very well done. I felt the ingredients weren't really blending together. Maybe it was done in a hurry.  Nice environment with soft music. Doesn't look like your typical dim sum place. Good service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2Ib80eZWpi_DlZ7HBFqcpQ",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Porridge with thousand-year eggs and pork",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2Ib80eZWpi_DlZ7HBFqcpQ/o.jpg"
      },
      {
        "img_id": "I175t_niqvQAw38E8L7T0g",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Dim sum",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I175t_niqvQAw38E8L7T0g/o.jpg"
      }
    ],
    "user_id": "ZI5aFpYSdZtiR8DH7IKFkA"
  },
  "GAlrLEZXegAnFLQjMHBLpg": {
    "date": "6/26/2016",
    "text": "We went in Sunday around 9pm, for Everyday Noodles, our usual go to place when visiting this area, was closing down for the night.   Upon arrival, no one was seated, therefore we were seated immediately to the location of our choosing, which ended up to be outside, underneath a roof.  Our server, very kind and friendly, seemed to be the only one up in the front at this hour, which is more than understandable, for most places were closing on a Sunday at 9pm, if open at all. She was very attentive. We told her that we do not eat pork, and so, when ordering dim sum if we said anything with pork in it, she let us know immediately so that we could get something else. How kind! She even let us know when the kitchen was closing so if we wanted something we should get it at that point. Trying to flag her down was a bit difficult, but regardless, she did a marvelous job and had a very friendly attitude.   We ordered dim sum this time around, I do believe we ordered sesame rice dumpling, egg custard bun, shrimp with chive, stuffed eggplant, shrimp rice roll, doughnut rice roll, and the shrimp and scallop dumpling.  It took about 15 minutes for our food to arrive.  Everything tasted amazing and the complexity in textures made everything an absolute delight.  A few highlights included the lotus paste inside the sesame rice dumpling, the molten egg custard in the egg custard bun, the crisp chinese doughnut inside the chewy rice noodle wrap, softness of the eggplant in the stuffed eggplant, and the bold flavors of the chive and shrimp dumpling.   Heads up! The rice rolls came out to be lukewarm, nothing to complain about though, for this allowed for the flavors to come out a little better.   Overall, the incredible feast of dim sum cost us $35. I definitely recommend this place to any local who needs to get a fill on dim sum.  If you aren't a fan of dim sum, know that there is a full chinese and malaysian menu as well, to cater to everyone's tastes!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iq7s7ujZoUn1JVHMQu0tbg"
  },
  "drcQRo0Nz5tVyun9b01NUA": {
    "date": "12/25/2013",
    "text": "Decent Malaysian food because Pittsburgh lacks Malaysian food in general.   I would mainly come here for the dimsum, since this seems to be the only place in Pittsburgh that serves a decent amount of dimsum. You can find most of the dimsum you would expect to see at a restaurant in Chinatown. The quality of the dimsum is also surprisingly good if more expensive. They even have douhua.  Best part is you can order them via Grubhub, so if you ever have an insatiable need for dimsum, it's quick and convenient to get.  Favorite ones to order: Bean Curd Skin Roll Egg Custard Tarts Turnip Cake Taro Kor Shrimp and Chive Dumplings Stuffed Eggplant Beef Tripe Douhua Shiu Mai Shrimp Dumplings  I recommend to not order their Congee and Sticky Rice. Both are really overpriced and flavorless.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "DC1hfeeSaYr2E1xwiEL81A"
  },
  "N1jtgBY-mVh6rbFzxaBQEQ": {
    "date": "4/24/2016",
    "text": "This is the only place in Pittsburgh where I've found dim sum that actually has its own menu and isn't put in with appetizers. Little man and I shared spring rolls, chicken buns, egg custard, and coconut cake. Everything was the bomb. Can't wait to go back to explore more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OrG93BVBb9y5P7lQF6Vj9g",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Taro kor",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OrG93BVBb9y5P7lQF6Vj9g/o.jpg"
      },
      {
        "img_id": "JOV6Ctnz2xDI6F2iuf-OVw",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Dim sum, shui mei",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JOV6Ctnz2xDI6F2iuf-OVw/o.jpg"
      },
      {
        "img_id": "iEbPq2rEAnrGk2Lvf_THgw",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Dim sum, turnip cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iEbPq2rEAnrGk2Lvf_THgw/o.jpg"
      }
    ],
    "user_id": "5W_LMSthT2jsQOqKFU6IKQ"
  },
  "LW88DyoeaciKm0K55y5ayQ": {
    "date": "6/27/2016",
    "text": "Ask for chicken egg rolls from tea garden.   Wow. I remember growing up with the Tea Garden Billings and all and now the daughter has worked here at this Chinese restaurant making egg rolls for all of us to enjoy beef shrimp chicken egg rolls mustard and sweet sauce here they are Squirrel Hill great place enjoy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zynts26yRquRGC0RfzLJkw"
  },
  "dlP4abQFR2eVd8F-QES4HQ": {
    "date": "5/14/2017",
    "text": "Really good dim sum. We ordered the shrimp siu mai, green onions and shrimp, pork buns, salt and pepper pork ribs and the soup dumplings. Everything was fresh and delicious. We will definitely be back. Dim sum places run out of things, particularly as the day goes on, so be prepared with back up items when you order.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TfWOJ9eXRNByNVJElfeXsA"
  },
  "DDmQ3qAMQ8cDefJI5IHkYg": {
    "date": "1/18/2014",
    "text": "I'm going to give this 4 stars because there are very few options for Malaysian and Dim Sum in Pittsburgh but if this were in a larger city it would probably be more like 3 stars.  I went there once for lunch and had one of their Malaysian noodle soup dishes which was pretty good but not amazing.  I also went for Dim Sum on a Sunday and very much enjoyed it.  They had a large diversity of options and everything was very tasty.  It's certainly not at the level I've had in places like Boston, Seattle, or NYC but for Pittsburgh I was very satisfied.  My friend who had lived in China for a year also found it to be pretty decent.  I would definitely go there again.    The service was very good and the prices reasonable. The atmosphere was comfortable though I found the lighting to be rather dark.  There is also some outdoor seating available when the weather is good and a full bar with seating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3bo1FXvQnxw2hmO0CHH4Nw"
  },
  "vNl5Og8toA4WSE0ncv8Ljg": {
    "date": "12/1/2015",
    "text": "So we still love Sun Penang, and eat their regularly, but...  Sun Penang is good to its regulars. I pretty much have a standing order, and whether I order for pickup or eat in, they recognize me and are friendly and personable. The dim sum is always hot and fresh, and we mostly just order the dishes we know are good, so they are. (The shu mai and har gow (steamed shrimp dumpling) are particularly recommended.)   However, not only are we regulars, but we go at odd times. This may be helping. The only time recently we've eaten at Sun Penang at regular dim sum hours (lunchtime on the weekend), was also the only time that some dishes were cold or off (e.g., the shrimp roll had double thick noodles from usual, so the inside layer wasn't cooked all the way through). I'd be curious when those those who've had disappointing dim sum experiences were eating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mBDD9QS1AISnJqxGgk4OVQ"
  },
  "FMLQvXRUhRMHb71tJCve8Q": {
    "date": "12/24/2017",
    "text": "The people of the restaurant is really nice and they delivered delicious Chinese-style food to CMU almost every day! The food in the restaurant is also nice!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aIeO-iXbEaMS0EFLyqnFyg"
  },
  "xZP6XBeiVRmQRmKDvNGdDg": {
    "date": "11/8/2017",
    "text": "The lotus leaf sticky rice I ordered was not fully cooked. Cold inside. Several dim sum were not provided during that day 's dinner time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9gdRV2jTbSaKly1GRD7tfQ"
  },
  "Sqm01TdiRHEIaUP726_GVA": {
    "date": "4/22/2016",
    "text": "Check out the article in today's post gazette. Apparently the owner is accused of lying to the us dept of labor in a wage dispute with employees.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "ee9X7FcJvSJ2e770gOwWnA"
  },
  "gk85wJqpv25reTffXic2qg": {
    "date": "10/20/2015",
    "text": "Decent food, nice decor... but why does it smell so funky in there?!  Okay dim sun; in the dim sum desert that is Pittsburgh, I guess beggars can't be choosers. If there were other dim sum options in the city, I wouldn't be coming here but alas.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hnBzgVoRoqLrGVSxO0ilg"
  },
  "0yCfUXYnn8p3lkH5kVUvrQ": {
    "date": "12/26/2015",
    "text": "Recommending new menu items, Chinese Hot Pot!!  Came here with the family and ordered three hot pots!!  I had the Japanese Miso Lamp Hot Pot, their soup is really really tasty; no artificial flavoring , and I do believe it is the result of many cooking hours on soup alone.  There are different soup flavor for everyone!! I love my Japanese Miso soup, but u can go for either Korean Kimchi, Curry, Thai or Taiwanese Spicy. For the protein selection, you can choose between beef, pork and lamp.  The Hot Pot content is filled with wide variety and home flavor meat balls, stuffed dumplings and vegetables. It not only comes with rice, but served with Udong for my Japanese Miso, and Spinach noodles for the Taiwanese Spicy hot pot. The serving size is perfect for a dinner portion, at the end of it, one should be satisfied with fullness and planning the next visit.  If you do not have prior experience with Chinese Hot Pot, I will highly recommend you to try, especially during this winter season, warm the stomach and the heart, you will not regret it!!  On top of it, the best dessert selection for this dish is egg custard!! It's not overly sweet and the crust is crispy and non-oily.   In conclusion, come join us for this new special menu!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "avsn9_SDfqD3pc8hG7OWSg"
  },
  "9KVce-l_-zDmr8sy_0aCnQ": {
    "date": "4/9/2015",
    "text": "Choose from the dim sum menu and you will know! They have the best chicken claws and the turnip cakes! And I love their beef chow fun too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SlSYbKA-7kLBrXWE15ms8g",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Steamed spare ribs. They are goooooood!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SlSYbKA-7kLBrXWE15ms8g/o.jpg"
      },
      {
        "img_id": "2MQIGkys9bfplQ3V2FJh1w",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Perfect! Best chicken claws ever!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2MQIGkys9bfplQ3V2FJh1w/o.jpg"
      },
      {
        "img_id": "oXryYNhnrLinAxKaD5zyUg",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Shrimp rice roll~",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oXryYNhnrLinAxKaD5zyUg/o.jpg"
      }
    ],
    "user_id": "d2M2Aflh5G9nSQGr8K5YLw"
  },
  "9nDKmup2P8-PbXKnnwJ7yw": {
    "date": "6/28/2015",
    "text": "Love their dim sum. This is also the only dim sum place around... Good service, has delivery.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JrvAjn2LYdGhaMXfMVAiTw"
  },
  "Zu2fZ2CUgoOgCnMf8zCD3g": {
    "date": "11/29/2014",
    "text": "Stopped by for dim sum last week, and was disappointed of their quality. They didn't have the usual chrysanthemum tea that we always get at other dim sum places.   We ordered garlic pork ribs and it was cooked in tomato sauce, definitely had a different photo on the menu.  The curry fish ball was extremely disappointing, it taste like Indian curry versus Asian curry, and most of all, the inside of the fish ball was still ice cold.   They didn't have rice roll when we just started ordering, but we were happy that they offer it later. It's decent, but we've definitely have better rice roll else where.   Overall, ok if you really crave dim sum and had to go somewhere close.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "gc3QnuH4FURVzLVbyhmbqw"
  },
  "GX0X2y5tQEVhOHn5CFJVow": {
    "date": "1/11/2015",
    "text": "This review is purely for their dim sum, as I haven't tried anything else.  The menu's pretty long for an American restaurant, but pretty short for authentic dim sum. I probably can't blame them, since they cook the dishes on order, instead of pre-cooking them and carrying a full cart to the customer. So by now I think I've tried over 50% of their dim sum dishes.  And I have to conclude that the taste is below average. It just falls short. And their dishes that have pork in them (shu mai, roasted pork bun, tofu skin rolls...) often tastes like they're using bad meat. I don't know what their problem is. Some of the better dishes are congee, stuffed eggplants, and crab&shrimp steamed dumplings. I think from now on I'll just order these things when I go.  The price and the environment is okay, but considering all the competition they have on the same street, I wouldn't really recommend this place unless you're in terrible craving for shrimp dumplings and nothing else would satisfy you. They do have somewhat of a monopoly for dim sum, and that's really the only reason I'm giving it a 3",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "llTi-deaXgVEjr5zJSv8XA"
  },
  "INecevQAn-oui2NoDO9iLg": {
    "date": "12/19/2015",
    "text": "Very delicious hot pot with various different stuff in it, I had Taiwanese spicy soup, it awesomeness",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U8T_hlRn8bmxQ2SWBUIigg",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U8T_hlRn8bmxQ2SWBUIigg/o.jpg"
      }
    ],
    "user_id": "ADD2IACpL5CFlzP3bdW-Gw"
  },
  "jwZCKMb_1jApHR9AnpM6Pw": {
    "date": "10/31/2016",
    "text": "First off, if you are into decor or turned off by worn carpet and pipes and vents overhead, better get the takeout. It's small and dark like an old club, nothing fancy or hinting at Asian cuisine. That being said, don't jump to conclusions, because the food is fantastic! I refer now to this place as Asian fusion. Malaysian, Chinese, Indian, Vietnamese, even some Filipino! Have been here twice. The menu is extensive and expertly applied! I have not a single complaint!!! The waitresses are cute and friendly and the food presented is exqisite! Try the dim sum offerings. To die for. Don't care for Indian.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D5S9LUEzsSXfvmMCOXyyRA"
  },
  "StHm_VnfUWZi8g954DcWhw": {
    "date": "1/8/2016",
    "text": "I really like this restaurant especially the hot soup, it is amazing!!! I think it is suit for everyone!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Hf9l5u3QvRFbrrDnSwreTg",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Taiwanese spicy soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Hf9l5u3QvRFbrrDnSwreTg/o.jpg"
      }
    ],
    "user_id": "9dkdEJoxGXOkk-9-gPmnIg"
  },
  "_NV3WichFPsEP3i9zJ2ZRg": {
    "date": "12/28/2016",
    "text": "So I got delivery here my first night in PGH.   The food took a minute to get here,  it wasn't piping hot,  but still warm enough to make it enjoyable.   The food was super tasty!!!   There was a lot of veggies and a lot of chicken,  I also got the lettuce wraps.   The wraps were my favorite part.   After moving all day it was a FANTASTIC start to my Pittsburgh life.   I ate till I was full and still had leftovers,  a thing I am really appreciative of.   The food tasted fresh and the veggies were tender crisp.     Will definitely order here again!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mEye5eGR02eE8wd9WzXIPA"
  },
  "lqtS8m_WKqURo7gQZVYgog": {
    "date": "12/6/2018",
    "text": "Shut down by Allegheny Co health dept Rats found Not eating there anymore  <a href=\"/redir?url=https%3A%2F%2Fpatch.com%2Fpennsylvania%2Fcranberry%2Fs%2Fgkh29%2Fpennsylvania%2Fcranberry%2Fs%2Fgkh29%2Frat-nest-found-popular-east-end-restaurant&s=d0926f08a9dcb7c111730d5ce75114722e81d473f2b244a37a5b27ecce592996\" target=\"_blank\" rel=\"nofollow\">patch.com/pennsylvania/c...</a>",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MMk-Zdo83cCjn6cne-teZA"
  },
  "IQ_igzmvk-ylqqSUJhTEwg": {
    "date": "12/12/2018",
    "text": "I swear this place has been closed so many time for horrible health citations - maggots, backed up sewage, operating without permits, mold - it's hard to keep track. <a href=\"/redir?url=https%3A%2F%2Fwww.wtae.com%2Farticle%2Fhealth-inspector-orders-squirrel-hill-restaurant-to-close%2F25450560&s=1d980f79d58d91ea2d2da597dbf387cf7119435900b61ee542003aaa5fa1a29a\" target=\"_blank\" rel=\"nofollow\">wtae.com/article/health-...</a>   They also don't pay their workers. All of 2013 they didn't pay workers and only backpaid after being indicted by a grand jury. <a href=\"/redir?url=https%3A%2F%2Fwww.post-gazette.com%2Flife%2Fdining%2F2016%2F04%2F21%2FSquirrel-Hill-s-Sun-Penang-restaurant-owner-accused-of-unfair-labor-practices%2Fstories%2F201604210206&s=e33fdf48a868197c683c1eece548cde22998109380549d7656e161a9d15083e1\" target=\"_blank\" rel=\"nofollow\">post-gazette.com/life/di...</a>",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UcwzDDDK4dElIwBLTH4UwQ"
  },
  "ZJHo-6_REWcWmEpei3E9Vg": {
    "date": "12/30/2017",
    "text": "They never, NEVER have egg tarts, so don't go there for them. I've called every weekend for a whole month and somehow they are always \"sold-out\" of them. The Char Kway Teow is delicious, and the dim sum is good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cx6QIU9RAxBc96uxsbyNbA"
  },
  "-LpogP_tqA0yYrMvSviePg": {
    "date": "12/5/2016",
    "text": "This got two stars only because I only tried one dish (which really rated a 1 star review).  I might go back and try the Malaysian dishes, but for now, this is all I can give them.     I was craving some Pad Thai after stopping at a couple of shops on Forbes.  I hadn't tried this place yet and Pad Thai existed on the menu, so I grabbed some as takeout.  I got home all excited to try it, but was immediately disappointed to find a gloppy mess of noodles coated in what appeared to be soy sauce and little else.  I ate a few bites and threw it in the fridge.  Later, my boyfriend pulled it out and said \"what is this?\"   I responded that it was supposed to be Pad Thai, but it didn't look or taste like any Pad Thai I had ever had.  He agreed and it ended up in the trash.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "h9LPugJk2cpIh0gmQb5LnQ"
  },
  "iHBcRnWBAdCHi42pwk42MA": {
    "date": "10/8/2016",
    "text": "I really wanted to like Sun Penang when I stepped through their doors a few weeks ago. The place is small but cozy - not uncommon in Pittsburgh - and I admit that when visiting Squirrel Hill I often look forward to the food I can eat at their various Asian restaurants. Unfortunately, my first experience and meal left me feeling exceptionally frustrated rather than satisfied.   There are a few key reasons for this. Firstly is that I found the service to be slow; granted, I do allow leeway for this when servers are managing a large party, and I came with a fairly big dinner group. So while we could have benefited from someone checking on us more often to at least refill water glasses, I understand we were a large party - a few speed-bumps were bound to happen here.  Far more frustrating for me, however, was the trouble we ran into while ordering dinner - and this is something I am not so forgiving about. We learned as we ordered various meals that the kitchen had run out of key ingredients on the menu left and right, from dumplings to crab rangoon to teriyaki sauce. As a result a lot of us ended up skirting around classic Chinese dishes and choosing alternatives when we learned that key staples on their menu were simply unavailable. And, sadly, the food that came to us after all the trouble we had ordering varied in quality. For example, my order (a standard mix of different meats, vegetables and rice) came out ok enough, but the \"curry\" sauce on a friend's order was basically broth, it was so watery and thin.  Finding an out-of-order women's room in the back before I left did not do anything to sway my opinion in the restaurant's favor. And I admittedly feel obligated here to say that I do get that things happen. Restrooms need to be closed due to unforeseen problems, kitchens run out of ingredients. But still, the experience I had overall was incredibly frustrating, especially since we didn't walk in on a whim: our group made reservations well in advance of visiting. I can excuse some things, but I cannot excuse the lack of preparedness for our party. Hopefully, this is not the norm for Sun Penang, and in the future I have a chance to write a much more positive experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "L9pMJgsaxwViw2klBQvBrg": {
    "date": "9/5/2017",
    "text": "I can't remember the last time I gave a one star review, although I guess I could check. (Ok I just checked, it wasn't too long ago. Maybe I should say that I don't leave *a lot* of them?)  But this visit was a rough one! Nothing too dramatic but just bad, and certainly worthy of one star.   To start with, I've never felt the need to come here based on the reviews. But one day I walked by and one of the outside guests was gushing to me about the fried fantail shrimp. Now, I'm not a super extrovert and doubt I would have just randomly asked a restaurant guest how their shrimp were. But there we have it, I was told that they were amazing and that the person comes here *just* for the shrimp.   My other half isn't addicted to Asian food like I am, so I had to wait for an opportune moment when she was out of town.  Finally the time came. I ordered the shrimp and the red curry. I noticed the menu was a bit too expansive both in size (three separate menus) and scope (covering *all* of Asia), but I was willing to try.   The shrimp came and were pretty poor. I couldn't tell if they were freezer burnt or just old. Not very good. Very disappointing after a months long build up induced by the mystery guest.   Finally after about 15 minutes the main dish came out. It had a peculiar glazed look to it, the way food does when it's been sitting out. I touched it with the back of my index finger and, as suspected, it was room temperature. Suddenly it clicked. The server had been chatting away with some guests (whom she apparently knew personally) for quite some time. Evidently the kitchen had finished the dish long ago, and she evidently wasn't aware, or didn't care.   I mentioned it to the manager who was just walking by and said that the food was \"cold\". She picked the dish up and said the bottom of the dish was hot! I reiterated that the food itself certainly wasn't hot and that she was free to touch it since I wasn't going to stay. She refused. I said I was happy to pay for the shrimp but wasn't going to wait for them to \"heat\" up my food a second time.   At the register the story continued. When she handed me the receipt the shrimp were $6.95 rather than $5.95. I did a double take on the menu and there it was: $5.95. When I showed her she said something about she doesn't know why it was different. I said I was happy to pay the advertised price but not more.   Man! That whole visit went downhill quick. I have to assume it was just a perfect storm of events but I don't think I'll ever go back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 0
    },
    "photos": [],
    "user_id": "CIKD9oMj-qTZ3zDdgFW5_Q"
  },
  "rX7Y5YBRUlsj0BuB14gtVg": {
    "date": "4/15/2016",
    "text": "I ordered lunch here for my fiance and I to share, steamed shrimp buns, crispy squid, and the chefs 3 way special (or whatever it is) Delivery was 20 min late. From order to delivery (I ordered before 11am) it took 90 min to get my food. The chicken tasted like salt. The crispy squid was mushy. And the steam buns (they were out of shrimp and I had to get pork) were trash. Very disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o-Z7cqx-ukU-3KnLZoc3aQ",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Steam buns. The picture said it all. I didn&amp;#39;t eat any of this. Neither did my fiancé. $25 lunch wasted.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o-Z7cqx-ukU-3KnLZoc3aQ/o.jpg"
      },
      {
        "img_id": "TuvA2rUFATK9DZgABtJYXw",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Mushy squid. Didn&amp;#39;t taste like anything.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TuvA2rUFATK9DZgABtJYXw/o.jpg"
      }
    ],
    "user_id": "s8wh26XtTE5RQp3LYWyXVg"
  },
  "o0igJDnM4j7-TV7Z0uL1PA": {
    "date": "2/2/2018",
    "text": "The waitress was extremely arrogant and annoying. We just sat down and asked her to help us record and place the order. She said, \"Just wait! Is it possible to be that quick?\" She didn't even serve us any water to calm us down. So we left the restaurant immediately. No next time!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "haDgw1SU62mq312BVXlraA"
  },
  "ooi0OOzkJsRGn21b_06jzA": {
    "date": "6/6/2018",
    "text": "Do NOT waste your money. Spring rolls were still basically frozen. Steamed Chicken Bun and Shrimp dumpling had to be from a pre-made kit. Entirely a waste. Go to the Turkish Kebab House a few doors down instead.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c4noFc554LKU6mZHy-d-Iw"
  },
  "sAyzODlwXRWBCJiYvW-_qg": {
    "date": "10/6/2015",
    "text": "We were craving some dim sum, so we came to the only dim sum joint that I know in Pittsburgh.   When we got here at 1:30pm on Saturday, the place only had a few patrons. We were seated but it took awhile for our waitress to take our order. When the food finally arrived, it wasn't very good. The spring rolls were typical Chinese take out vegetable spring rolls, not the good dim sum kind, and they were not cut up in halves. The Chinese crueller wrapped in the rice crepe, one of our favorite dim sum dishes was also made poorly, the rice crepe was wrapped twice over a huge crueller that was not cut up for our eating convenience either. The beef tripe was okay. The two other dishes we got - the radish cake and glutinous rice wrapped in leaves were good though.  The other thing was that our waitress probably only checked up on us once, and it was so difficult to wave her down for a glass of water or a refill. I wasn't sure why she was always running about as the restaurant was not packed and the place was well staffed with servers.  I would give this place another try if I was ordering out though, the menu had some pretty promising entrees at some reasonable prices.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "SaYctOj-v2LNNkD4EXtZUA"
  },
  "PIP7tlGEaXxoJUP9BXn6hA": {
    "date": "3/16/2018",
    "text": "Horrible service and food. Food was 20 minutes late. When I was there to pick it up, there was so much yelling in the back that I didn't want to go in. I eventually did, but I received the wrong order. When I requested a refund, I was denied. They said I didn't know what I ordered. This is actually the second time I was there. The first time I dined in. The food was mediocre at best even then. I don't know why I gave them a second chance.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "0IiW7JT9Qin1gn5-orCkSA"
  },
  "hVI49pDyie39Vi71ghQw9g": {
    "date": "5/21/2016",
    "text": "It already got 3 stars because it's the only place you can get dimsum in Pittsburgh, another star because it does have a wide variety of food to choose from, but let's just say I've had better.   Personal recommendation, Penang prawn noodles, siew mai and lychee green tea. Please try the lychee green tea, so refreshing to have on a summer night. Prawn noodles were good, but they were a bit too salty.   My boyfriend really like the shrimp rice roll and shrimp dumplings. (I've had better)   Do not get: Fried intestines (I love intestines but this just wasn't good), bean curd roll, satay (I come from Singapore, Satay really doesn't taste like that), congee(too bland and watery).   Generally good (and only) place to have dimsum in Pittsburgh. Food (except congee and dimsum) was a bit too salty for my liking, but do drop by for the lychee green tea because it is delicious.   I gave the lowest tip I've ever given there. We were the only people in the restaurant at 9pm, it wasn't bustling. But everything I asked to go without (like scallions and bean sprouts) were blatantly ignored. The waitress said she would let the kitchen know, but all the dishes came out with scallions and everything I didn't want in it. So that was a little annoying.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NXgXz5Nk2ElwQln2DI2JIQ",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Siew mai, fried intestines and chicken satay. Definitely recommend the siew mai.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NXgXz5Nk2ElwQln2DI2JIQ/o.jpg"
      }
    ],
    "user_id": "wZPMMXxzTtJt98N0lKmNtQ"
  },
  "LJXxYhuVFVKpxI88TsaX3g": {
    "date": "1/31/2016",
    "text": "For the appetizers and dim sum. We tried the chicken foot, shrimp rice, crispy squid, shumai and egg custard bun. I recommend the chicken foot. It's tasty and spicy. Actually this is the only dish that I'm satisfied with. The shrimp rice is also good. I recommend it but it is like normal good, no special. the crispy squid has too much oil and flour. And the squid is not tasty. They should have the dip for that. The egg custard bun is also good. But if you have tried better one. You will feel the difference. I have tried one in Sanfransisco. It's like a heaven taste. I missed it so much. The one in sun Penang is not as good as that one.  We also tried the new hot pot, both the miso one and Taiwanese spicy one with beef. We are disappointed! I have to see the beef is not very good. And the hot pot doesn't have any taste. The spicy hot pot is not spicy enough. It's like level 2 out of 10. The miso one is not authentic enough. They forgot to bring me the dip for my miso hot pot. In the end, they bring me one. But it is not good. I have tried the dip in Xiamen back in China. It is far not good as that. But what you could expect in a foreign country? It's just like the taste but far not good.   I came to this restaurant full of expect after seeing all the photos and reviews. But I have to say it is just a normal restaurant. The only dish I would recommend is the chicken foot. You can order one and pick it up.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cpi3lyPiKhkPeS7ry_Qrmg",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. The shrimp rice is good.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cpi3lyPiKhkPeS7ry_Qrmg/o.jpg"
      },
      {
        "img_id": "shIHkIrhAO5ocan7vSbJLA",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Although it seems good, it is not good enough for the taste.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/shIHkIrhAO5ocan7vSbJLA/o.jpg"
      }
    ],
    "user_id": "Vg2VTANG7NCNL7RNnq-Jeg"
  },
  "5N3hPJmkkYBG4_v8lO-o7w": {
    "date": "4/22/2016",
    "text": "The food is tasty, but then you read this news story:  <a href=\"/redir?url=http%3A%2F%2Fwww.post-gazette.com%2Flife%2Fdining%2F2016%2F04%2F21%2FSquirrel-Hill-s-Sun-Penang-restaurant-owner-accused-of-unfair-labor-practices%2Fstories%2F201604210206&s=5a6d075d54f04435d6b092603aeb5906f4c502eee047f316538978a2cee1c467\" target=\"_blank\" rel=\"nofollow\">post-gazette.com/life/di...</a>  Squirrel Hill's Sun Penang restaurant, owner accused of unfair labor practices  April 21, 2016 5:36 PM  Squirrel Hill restaurant Sun Penang and its owner were federally indicted by a grand jury today on charges that its workers were asked to forfeit back pay or work for no pay, according to a release from the U.S. attorney's office.  U.S. attorney David Hickton alleges that Hsiao Yen Wu, 40, who also goes by the alias Sophia Wu, had agreed to pay back wages to her employees and provided information and copied checks to the Department of Labor's Wage and Hour Office in Pittsburgh in order to show authorities that she was in compliance.  Federal authorities say Ms. Wu then ordered her employees to deposit their checks into her personal account or to work without pay until the restaurant recouped the backpay.  The indictment also alleges that Sun Penang, located at 5829 Forbes Ave., did not pay its workers minimum wage or overtime pay during a one-year period from Jan. 1, 2013 to Dec. 31, 2013.  In the three-count indictment, Ms. Wu is charged with falsifying, concealing or covering up by trick, scheme or device a material fact. It charges Sun Penang with willfully violating the Fair Labor Standards Act.  The indictment was returned Tuesday, but unsealed today.  \"All employees working in Western Pennsylvania deserve to be treated fairly under the law,\" Mr. Hickton said in the release. \"Prosecutions like these demonstrate our commitment to stopping wage and hour abuses in the workforce.\"",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "pHhnRlW6-q1uk4ZjLvu5Ew"
  },
  "nDwLsAh828GEJri48gmZgg": {
    "date": "4/14/2017",
    "text": "This is probably the worst place ever. The people here are very very mean. I would give a negative rating if possible. Food here stinks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "g5KIo165frNMVPFF-Ia4Lw"
  },
  "S8GZXMh_dqahxWsyYi38Bw": {
    "date": "12/29/2016",
    "text": "I love their dim sum! This is so far one of the most genuine Chinese flavors I've found in PGH.  I am also crazy about Thai food but green curry here was a little bit pale. Anyway, I will definitely go back to try more dim sum.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eLpfzTxTaXskmODT6kjZxQ"
  },
  "zpXTpFJnKd0QMXUH0ej4nA": {
    "date": "4/25/2016",
    "text": "One of the best SINGAPORE rice noodles I've had in Pittsburgh. Their Malaysian cuisine menu selections are great, and we had the Penang Char Kway Teow is AMAZING! When the weather is good, sitting in the patio is a treat! Their meal portions are huge, and definitely leaves you satisfied!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bECg21t3VdPXg9hT9A-kTg",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bECg21t3VdPXg9hT9A-kTg/o.jpg"
      },
      {
        "img_id": "v-95s8CHkBMP769hCEQU1w",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v-95s8CHkBMP769hCEQU1w/o.jpg"
      }
    ],
    "user_id": "9byPjXAC04cppb8vcDW2tg"
  },
  "4xacdbVC5KRtWwtQDRGIDA": {
    "date": "5/9/2016",
    "text": "I really wanted to like the dim sum here because I've been craving dim sum in Pittsburgh. I ordered delivery so I set my expectations kind of low, because nothing taste that good after 45 minutes of transit time. I got the Turnip Cake, Shrimp Dumpling, Shrimp Rice Roll each for $3.95. The turnip cake was tasty but soggy. I actually ended up refrying it in a pan, and adding an egg. It tasted much better after that. The shrimp rice roll, one of my favorite dim sum dishes, was tasty but SO much smaller than a normal dim sum portion. Lastly the shrimp dumpling (har gao) had way too much bamboo in it. I don't know... I guess if I'm in desperately need of dim sum I would try it again since theres seemingly nothing else available.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SrTKphv_hitq01ODcp3qmw",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. turnip cake (which I refried with egg), shrimp dumpling and shrimp rice roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SrTKphv_hitq01ODcp3qmw/o.jpg"
      }
    ],
    "user_id": "bkr_Mo4Ns_k5TB4ei6VELw"
  },
  "w8fo6P-JgDT5QEglSDiZYA": {
    "date": "3/16/2017",
    "text": "I never wanted  my first review to be a bad one, however my experience at Sun Penang has forced me to write one.  The two star is just for the service otherwise I would have put one star. Went there for a friend's birthday dinner. Service was fine, but the food was horrible to say the least. The steamed dumplings were uncooked with raw meat in the middle, bland food with smelly oil and cold food on top of that. I have worked in the restaurant business and this is no way to serve food. What was more appalling was the owners lack of response to our questions regarding the food and the unwillingness to at least recook or reheat our food. I don't recommend this place for new diners, maybe go to other Asian places if you are feeling adventurous. Believe me, the food is not tasting weird because its authentic. It's tasting weird because it is.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VINCXnRHdhz0jwf8HwOjew"
  },
  "ss8JIdsZZZjVYrqa6ba5XQ": {
    "date": "2/4/2008",
    "text": "Sun Penang is great. I was pretty skeptically initially considering that Asian food in Squirrel Hill tends towards hit or miss. I guess Yelp doesn't consider Malaysian food to be a category?  The service is quite good and attentive. The room is very airy and spacious. Though the restaurant was quite busy, it never felt crowded or too noisy.  Though I think some of the menu items that tend toward Thai are only okay, I think the real gems are their seafood/fish dishes. Basically  for those who are willing to be more adventurous, just order the things that you've never heard of before and you won't be disappointed. Portions are quite generous. It's a great place for groups and couples.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dHKq-j3rNwNDKQ0xGXRCdw"
  },
  "R7RuuGVg4xbAEWaG5GUNkg": {
    "date": "12/11/2011",
    "text": "Hit or miss. I had a spicy seafood soup here which was divine, but I've also had utterly terrible green curry, a lousy mango salad, and uninspiring dim sum. This seems to be one of those restaurants which has a few really good dishes, but you really have to cross your fingers when ordering something unknown. On the plus side, the service has been friendly, and the atmosphere is pleasant enough.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ZZNOoMQ7WFvFoxDUFw1wg"
  },
  "SvwZxLCF7L4df0zfdHW_FA": {
    "date": "6/10/2011",
    "text": "The spring rolls were very greasy and soggy.  The main dishes we ordered (Basil Tofu and General Tso's Tofu) were bland.  A bottle of soy sauce spilled on the ground and spread to surrounding diners' tables but none of the staff attempted to clean any of it up.  Also we were overcharged for wine ($1 more than what was listed on the menu).  But our biggest complaint was that we paid a dollar extra each to have brown rice with our meals, were given about 1/2 cup each, and then after we'd run out were told we'd have to pay even more to get a little extra to take home with our leftovers.  Bad business practice, Sun Penang.  Rice is cheap and it would have been easy to make us happy.  We definitely won't be back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EhJ09S907IZbuVBHe79pbQ"
  },
  "FT0nE_03dgc8mM_s6ApAAw": {
    "date": "1/7/2012",
    "text": "Awful. Good food poisoning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sYICfcex5_jGEhWATtndyA"
  },
  "X72rIFRvUk4x8dZT2Qll7Q": {
    "date": "11/15/2009",
    "text": "Their small dishes are better than the entrees.  My best experience was when I went with a large group of people and shared multiple appetizers. Otherwise, I find the main dishes to be generally disappointing. They are not all that different from what you might find at other Asian restaurants (more generic Chinese than Malaysian).  Since 2008 or so, they also began to offer \"Hong Kong style dim sum.\"  Although the selection is limited and the dishes taste like reheated frozen stuff, I welcomed the addition. A Sunday brunch at Sun Penang offers at least a pale imitation of the dim sum experience (they'll even wheel out one lonely steam cart), which is the best we can get in Pittsburgh for now.   Of the dim sum items, I like: the stuffed eggplant. I also find that  the Malaysian sponge cake, the baos, and the shrimp dumplings are pretty robust to reheating. If you are ordering to-go, you can revive the egg custard in your toaster oven. I am disappointed by: the turnip cakes (I prefer Rose Tea's) and the congee (Ka Mei's is marginally better).  Overall, their food is above the minimum threshold, but it's hard to get too excited about them.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tGx9-4LpdahotPuNuVfNVQ"
  },
  "8YOC1SilT840IllHqjNSMw": {
    "date": "9/2/2008",
    "text": "I looked up this restaurant hoping for a close approximation of Malaysian cuisine. The place is located in an active, mixed use area that is pedestrian friendly and a largely student/ hippy population.  The decor is trying to be Thai and the music was a horrible medley of obscure cover versions. I ordered the Achat, a refreshing pickled salad, served cold (a little too sweet for my taste), and the potato-chicken curry. The curry sauce and potatoes were excellent, although there was too much dark chicken meat and not enough potatoes. My partner who is vegetarian got a vegetable soup in a dark, salty, soy based broth that was bland but palatable.  We paid about 40$, which in my opinion was too much for an unremarkable meal I could have ordered at any old Thai restaurant. My quest for decent Malaysian in the mid-west continues...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9OVPPf6NX-b_Hl1Hu-bKCQ"
  },
  "B_vyDnzTb4rRJr_UYsucyA": {
    "date": "5/26/2011",
    "text": "Worst restaurant experience ever. My wife's rice came out with a huge braided string in it, then her green curry came out and was the consistency of a bad soup. Super watery. Tasted like coconut water. We had a coupon through living social that they then refused to take because we  didn't spend $20 after her entree was removed from the bill even though spending $20 is not the requirement. The manager that came over coped an attitude with us, then tried to say that's how they make their curry, shitty. Living social was totally nice and refunded us though. PASS",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8M5-7DRsWW2DdbLa8I8v5A"
  },
  "N4mDy9PYgdiQE4zRRPs08A": {
    "date": "5/20/2008",
    "text": "I've been here a couple of times.  Overall, I am just ok with the food.  Having had more of a background in Malaysian food, I am a bit more critical of the food here as it is more Malaysian than Singaporean.  The prices are more reasonable at lunch; I am not sure I would come for dinner.  Most of the food on the lunch menu was good - that Kari Mee was delicious and the Hananese chicken was decent too.  The Mee Goreng - not horrible, not great.    The service in general is quite good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7sAkIM47_LE99Hyg5lwdrg"
  },
  "YL1OMc-E98tQU0VYsG2-0w": {
    "date": "1/24/2009",
    "text": "The service is pretty attentive, and the restaurant environment is great, but the food itself has gone a bit downhill.  I loved Sun Penang when it first opened, but something's changed.  Beef Rendang is still good though.  I've had better Malaysian food back in DC, but I guess this is decent for Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6DbvYyAvTtXTmVOAG32Djw"
  },
  "a27T4wx0ON3t9BypJMl-6g": {
    "date": "7/11/2011",
    "text": "I like it...if you think of it as unapologetically greasy hole-in-the-wall Asian food. If we're comparing it against other places of that caliber, it's average, maybe a bit above par. But the prices are, in my opinion, a little high for what it is. It seems like they're trying to compete with some of the other, more \"refined\" Asian restaurants in Squirrel Hill and be a Malay version of Bangkok Balcony or Chaya, but the food just didn't reflect that for me.  I mean, it was good! The mee goreng was yummy...but it tasted like something from a food cart! You know what I'm saying? I also don't really understand all the Chinese and Thai dishes on the menu...if they stuck to Malaysian fare and lowered the prices, my rating would probably be more favorable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zFCuveEe6M-ijY1iy23IJg"
  },
  "hYzmMl5jyk2f9Fw_l87QHg": {
    "date": "7/8/2008",
    "text": "I was once banned from going here by a friend, because I was told the food is bad. I don't actually think that, but every time I have gone here I have ordered the same dish - the sweet & spice pepper chicken with rice thing (that isn't really what it is called).  One nice thing about this place is the outdoor seating which is pretty hard to come by in Squirrel Hill.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xyTInk3Ctrdz00sHsGgbZg"
  },
  "zH_8vsf9cmHNWbdVyV7grw": {
    "date": "5/27/2012",
    "text": "Well, I have to say that their spare ribs are the very best  I've ever had in my entire life! The meat on them was very thick and delicious. The sauce was just right, not too heavy, just perfect. I was sorry that I'd agreed to share them with a friend because I wanted  to eat them all by myself.  The main course I had was Green Curry from their Thai menu.  I hat to be critical because I'm not so familiar with Thai food that I've had better Green Curry, But it really wan't that good. The sauce watery, the meat was okay but nothing terrific, and although the dish was somewhat spicy, it lacked flavor. At leas that's what thought. I didn't finish it, which is unusual for me. I didn't want to take it home, either. I had a desert, Malaysian cake. It was okay, very much like a sponge cake without an topping.   I gave the place four stars because of the spare ribs, that's all. OH, and also the service which was very friendly and prompt. I noticed that all the customers, except those at my table, were Asian. That usually means that the food is authentic and  very good. I'd certainly go here, again, but will definitely not order the Green Curry",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YTf7Tce_ZllvDCwvlngvsQ"
  },
  "DlUTfYMOLOPevhcYY0_ZOA": {
    "date": "1/3/2008",
    "text": "This place is relatively new and I had wanted to try it for some time.  It was worth the wait.  The food is excellent.    We started out with some type of a spring roll appetizer but it wasnt just a plain spring roll (I cant remember exactly).  My girlfriend got the pad thai and loved it.  I dont remember the name of what I got but it was beef and vegetables stir fried and then placed into a ring of deep fried bean paste.  It was served with a little cocktail umbrella stuck in the bean ring.  The presentation was quite unusual and unique and it made the meal that much better.   The meal was moderately priced, I think around $30 for the two of us including our app.  The service was great too, in fact our waiter recommended my dish.    I will definitely eat there again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xwc-oEjXn_aRZR4bhCm0kw"
  },
  "nbo4MvmWa56nDgsoaWlrhA": {
    "date": "5/25/2011",
    "text": "Really great interior decor and beautiful bar. We grabbed seats on the patio, because the weather was beautiful. The wait staff was friendly, and the fresh spring rolls to start were good. Not impressively good, but I just love spring rolls and they satisfied my craving. I ordered the basil tofu with brown rice, which was not what I imagined it would be. It almost had a tomato-sauce taste and I really couldn't taste the basil, but there were tons of fresh veggies and the tofu was cooked well. It also wasn't heavy and greasy, which I like. Our food came quickly and was hot. I definitely had Thai on the mind and unfortunately Sun Penang didn't deliver killer Thai, but Thai is not their specialty.  The menu is more Chinese than anything. I'm not cutting them down in any way, because they have a good thing going, it just won't be my go-to for Thai.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_tWsCv3Hh0MZcy1qSv-Xog"
  },
  "mBSJL13Z1rNfZPETV6iCkg": {
    "date": "7/3/2010",
    "text": "July in Pittsburgh; it's usually hot and muggy- not this evening; the air was warm, and the temperature was perfect.  We were in Squirrel Hill on Forbes Avenue; sitting outside was a must.  There were only a few restaurants with outside seating- we chose a place called Sun Penang because the thought of Asian food appealed to us.  We seated ourselves at a table (on the sidewalk) and waited for our waitress to arrive.  There were two occupied tables on either side of us; a family of four, and a couple with a black lab by the name of Chloe.  Chloe was tied to a small tree a few feet away from us- she was the official people-greeter; nice to meet you Chloe.  Woof. Before our server arrived, I went to the wash my hands.  Every single table was unoccupied- not a good sign in any restaurant on a Friday night at 7:30 PM.   Our waitress stopped by with menus, and to take our drink order.  We were famished, and asked for an order of summer rolls (which weren't on the menu).  \"We can make them, but it will take a while,\" our server explained.  No problem... we can wait.  In the meantime, our drinks arrived.  My dinner guest ordered a long island iced tea, and I had a Sprite (I had to get us home ok?).  The iced tea was STRONG but good- lots of alcohol- no skimping here. Four Spring Rolls Arrived with a spicy peanut sauce.  The rolls were good; filled with carrots, lettuce, cilantro; no Asian noodles- bummer.  While finishing our appetizer, we ordered entrees: Penang Char Kway Teow (stir-fried flat rice noodles with shrimp, bean sprouts and chili paste ($10.00) and Green Curry Chicken (chicken with eggplant, peppers, string beans, potatoes basil and lime leaves in a spicy coconut- curry broth ($12.00).   The Penang Char Kway Teow arrived looking good.  The noodles were robust, and covered with sauce.  Since our server didn't serve both of our entrees at the same time, we decided to dig in.  The dish was flavorful, but needed some seasoning.  I grabbed a small shrimp with my chop sticks and popped it into my mouth.  The shrimp was moisture-free; dry... more like shrimp jerky... YUCK.  We also discovered small pieces of unrecognizable protein in the dish.  Baffled, we asked another waiter to identify these flat-like slabs of something- \"that's squid...you're not allergic are you?\"  Thankfully no, because it wasn't in the list of ingredients on the menu!  Our Green Curry was next, served with brown (at my request) and regular, white rice.  The Chicken Curry was very flavorful.  One disappointment- I know it reads \"served in curry broth\" but a richer, sauce would have been better.  Another curious observation- there was fresh and canned mushrooms in the dish.  At the end of our meal we had noticed that our new friend Chloe, the black lab was eating a scoop of vanilla ice cream from Baskin Robbins... I wish we had done the same, in lieu of having dinner at Sun Penang.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "nHxQfB9CRettoPKJmkDx_A"
  },
  "wrBB6riw9tuvYZIigRgEJw": {
    "date": "7/17/2010",
    "text": "With a spacious bar that opens up to the street and a few tables on the sidewalk, this place looks so inviting. Every time I passed by, I wanted to go in. When I finally got a chance to grab lunch here, it was so disappointing. We got dim sum: pork buns, sesame balls, lotus leaf sticky rice, taro and shrimp and probably something else. It was all pretty gross, even the fancy sounding lotus leaf.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "VFxrLIlgApHIdOCrkAYIGA"
  },
  "ZynPZ8MGdDFe8glx7CvA_g": {
    "date": "3/26/2013",
    "text": "Good place for a dim-sum brunch! Been there several times. It's not the greatest dim-sum I ever had. But as the only dim sum place I can find in Pittsburgh, it's not bad. If anybody know any other dim sum restaurant, let me know.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oLyfrIEmKxI-SEysj-Y2jA"
  },
  "fi4s62GNigtXviHHxet6tg": {
    "date": "4/29/2009",
    "text": "It used to be really good when it first opened, after a year or so prices went up and food quality went down. Most importantly, the standard is never the same. Everytime I visit I will order the hot and soupy Penang prawn noodles, and sometimes the broth is tasteless, and sometimes it is just way too spicy! Only once, my hubby and I had diarrheo after eating that. Nevertheless, we still go back once in a while cos we love the prawn noodles. Each time we just have to pray and keep our fingers crossed...  Service is really good though. I giving this a 2 star simply because of hygience. Sometime back i found some kind of bug in my bowl of prawn noodles right AFTER I finished eating. Not sure if it's a cockroach cos it's too small to identify, but it definitely has legs. So I alert the waiter. He seems surprised at first, then he  apologised, I am really expecting at least a discount if they are not going to waive my order, but none of that sort. Truly disgusted at that. So I banned sun Penang for a few months but I hv to go back again cos I miss the noodles so much!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UB-0acMHPPGwiJisHH6pig"
  },
  "jXjFfM4yLpTukVC8ZvlEuw": {
    "date": "8/20/2011",
    "text": "I really like this place.  The dim sum is quite good, and the price is reasonable.  The decor is beautiful.  I've been there twice and will continue to return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y81808aeGu5YuZSaDiFC8A"
  },
  "DkAo8bntnDpjQ7XvAxQgEg": {
    "date": "1/2/2012",
    "text": "I'm honestly surprised to see some of the low grade.  Great tea and a group of great appetizers, especially the tofu one.  The curry isn't phenomenal but is pretty good for Pittsburgh and he indian-malaysian inspired dishes are authentic. Service is great and restaurant is really comfortable as well.  They also deliver quickly and will bring some of their great tea!  My second favorite in squirrel hill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "clSui3GDi2o4oS9KFnwIvQ"
  },
  "Gk-K4L15eIWhJwjxMqoKdA": {
    "date": "12/17/2009",
    "text": "If you are a vegetarian DO NOT go here!!!  My wife went there with a friend and brought me home take out. She asked if they had Gen. Tso TOFU (stress - TOFU). They said they do not but that they could make some.  How awesome right? WRONG - they were too stupid to actually make it.   Well if you're a meat eater this next part might not seem too important but if you're not you'll understand - she paid for and they sent her off with CHICKEN! That's right c h i c k e n, chicken. Disgusting dirty bird parts. When I opened the container I nearly puked. The stench of dead birds permeated our apartment and we both began to gag.   So we paid for a big bowl of dead rotting animal parts. I'd like to have our money back but I'm not going to drive all the way back out there for it - I just wish these idiots could understand what a disgusting mistake they made. I'm sure it was just a mistake but it's one that you should NEVER make when it comes to serving those that don't eat flesh.   Clearly a mistake like this shows that they have little regard for peoples dietary needs. I can only assume that even if they got it right they may have cross-contaminated it with dead animal parts. If you are a vegetarian DO NOT go here!!!",
    "rating": 1,
    "rated": {
      "funny": 19,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "DtSpueHE6wH0Ml_e_U6gHg"
  },
  "FdF_jSc9_6G5hRp1cptX5A": {
    "date": "8/8/2015",
    "text": "I used to really enjoy the food at sun penang; it was tasty and fresh. However,  the last 2 times have been exceedingly disappointing. I have aways ordered the chicken hainese, the bone in chicken and steamed broccoli. I decided to get carry out. The server who took my order seemed disinterested and rude. I actually sat at the bar for a while until she approached me. When she brought over my take -out, I gave her more than a 50% tip and  she didn't even thank me! Before I  left, I had to use the ladies room. On my way, I noticed for the first time the tattered and dirty carpet much to my dismay. This restaurant used to be so pristine. Added to that, upon returning home and ready to eat, I opened up the container of broccoli to find most of it on its way out. I know  sun penang has been around for a long time but for me resting on its past laurels isn't enough!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gODPcel3Vdr2fHZcbdCpVA"
  },
  "Ij7_iYIZf24MPQrIx_W8Bg": {
    "date": "3/7/2015",
    "text": "I've been to Sun Penang twice and order dim sum both times.  Sun Penang is one of the few places in Pittsburgh that serves dim sum.  This isn't a dim sum place that serves dim sum on the cart.  You order each plate individually like tapas.  Their egg plant dim sum is great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HxK8ZBF6Ke2sXd6oDIk5VQ"
  },
  "lgWenSpYcd9nc9c4TTi5OA": {
    "date": "6/3/2010",
    "text": "Went here with my wife & her family for dim sum.    They are chinese and they hated the place, her mom even sent back the taro cake which was reheated in the first place.  I hate dim sum in the first place, but I had a better experience here than I did in one philly & one nj dim sum restaurant...  My favorite was the malaysian dessert cake - definitely worth a try.  Not much to write about the rest since it was just a bunch of mediocre food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OEFwXYlkHFTsVXHzKCuEOA"
  },
  "dhUmigt16in_1gEKjMzECA": {
    "date": "5/17/2010",
    "text": "Dropped in for a much-needed lunch after a day of apartment hunting.  We split two entrees - Taylor had some form of curry chicken with potatoes, and I had a noodle dish with tofu, shrimp, mixed vegetables, chiles, and potatoes in a brown sauce.  Both dishes were all right - mine was better by far.  Still, it wasn't creative or unique at all - its appeal lay in its nostalgic flavor.  One bite, and I immediately thought \"Chinese food!\"  I've been eating Thai for so long, I'd almost forgotten the taste of Chinese, but this was it.  Americanized Chinese food, anyway.  It's a good taste, just not a super-exciting one.  I'd skip the curry chicken with potatoes - the flavors were bland and it was served in a very thin sauce that was more like a broth.    I'd stop in again to try the dim sum, or if I wanted some simple take-out....but this was my first foray into Asian food in Pittsburgh, and I hope to find better!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yaBIVHDxaUBN2YHQ8-YiuQ"
  },
  "LRncfJ7sZtY5TCmjSte2xw": {
    "date": "12/14/2009",
    "text": "I often visit Sun Penang simply due to its location and the ambiance is great.  However, the quality of the food is variable. Sometimes it's great, but other times the curry would be watered down or something disappointing like that.  I would recommend the Sarong Burang though if you like yam--delicious, fun to say the name, but sort of expensive.   Overall, I don't feel like their price is appropriate for the quality of the food. I ate at Malaysian restaurants in Sunset Park part of Brookyln, and for a comparable dish that may only cost $5 in Brooklyn and tastes better, Sun Penang does not do as well.  Edit on 3/23/10: After a visit here today, I feel like Sun Penang should now be downgraded to 1.5 stars.  $11 for Tom Yum Soup without much seafood or ANY noodles! The man on the phone  told me afterwards  that it's usual for the soup to be without noodles. My reaction: What??! How much do I need to pay to get soup and noodles?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "s3safihVeRV_3YOvzDoy3g"
  },
  "9ydaVNkXDVBt2K_rnu8gDQ": {
    "date": "1/6/2011",
    "text": "If I could give this place a 3.5, I would.    I love their tofu dish, they use a special tofu made of eggs instead of soy bean.  That results in a much tastier tofu dish.  I also like their noodles.  I can't quite remember the name but the clear noodles are very flavorful.  The herb soup is also another favorite.  The herbs will warm you up during the cold winters.  The Hainan chicken was decent; not the best I've had but certainly not the worst.    Overall, I can't remember actually picking a dish that I disliked from this restaurant.  But, then again, maybe I was just lucky in all my choices :-)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "40BzYQULr17Nh7LQMPB38g"
  },
  "L8AV47HzIxWv2AoeHwGhyQ": {
    "date": "6/12/2012",
    "text": "We like to go to Sun Penang for Dim Sum. Though they don't have much competition for Dim Sum in Pittsburgh, we find it to be as good as many of the restaurants we've been to in Toronto, with less menu items. My husband loves the congee and chicken's feet and I love the beef noodle rolls, turnip cakes and bbq pork buns. And the scallion and shrimp ball is outstanding. We've also tried the Thai as take out, and it was mediocre. But there is no better place for Dim Sum brunch on a Sunday morning.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gvLm5KI1HqENv9yk7NS8Lg"
  },
  "K8umdpf4m8ZoYLhfGpfTRw": {
    "date": "5/2/2011",
    "text": "I have reviewed this restaurant on urbanspoon & only recently joined yelp. I was surprised to see some negatives. I am a fan of their Dim Sum. Their Thai tea is authentic--though as is the nature of this tea, it is rich in cream and is sweet. I love their noodle soups and their Roti Telur is one of my favorites. I can't say I have eaten at any other Malaysian restaurant, but I have enjoyed every meal at this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uf8zvAFy3SmgenVFpQipcA",
        "caption": "Photo of Sun Penang - Pittsburgh, PA, United States. Penang Prawn Noodle Soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uf8zvAFy3SmgenVFpQipcA/o.jpg"
      }
    ],
    "user_id": "RyfWmy_uAfc0pb_MF5oIww"
  },
  "FLQS5DNc6RJys4PWLOZcRA": {
    "date": "5/2/2009",
    "text": "I first ate at Sun Penang over a year ago and remember it to be a decent meal. Like most people have already said in their reviews, finding a restaurant for Malaysian food in Pittsburgh is in and of itself impressive. I think once I got over the novelty of finding a place for prawn noodles, hainanese chicken and roti canai, I could more objectively rate the restaurant itself.   I just don't think Sun Penang deserves high praises for being the only place where you can get _______ in Pittsburgh. This city is better than that! And, I believe the other reviews that say the food used to be better. So, before giving the stars away , let's make Sun Penang earn it again!   The one saving grace is their outdoor seating. On that one beautiful Pittsburgh spring day, having a meal while people-watching in Squirrel Hill is definitely a treat.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "qDgApqioN9qReeLiNytQqw"
  },
  "6L6rWmawvAL1YcmST9QQTw": {
    "date": "6/1/2009",
    "text": "If you're looking for a mind blowing adventure in taste - this is not the place to go. Sun Penang is meant for comfort and quality. I love the ambience created by the soft muted tones of asian decor in contrast with bold color splashes. The service is friendly and attentive.  However, the True star of the Restaurant is its Malaysian cuisine. The flavorful blend of spices in the Beef Rendang and the Curry Chicken with Potatoes scream comfort with every bite. Their Penang Prawn Noodles are nothing to scoff at either. This restaurant has good prices and different portion sizes. I would recommend giving it a chance and letting your taste-buds explore the comfort found in Malaysian cuisine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "y7DLKy_D6CPqhzGswGXAZA"
  },
  "_aTMSxIgrx2C7wiXiL4DPg": {
    "date": "9/6/2011",
    "text": "This is one of the only Malay/Indo places in Pittsburgh, and it's not bad.  The Pangan Ikan is crispy and juicy, and the Mee Goreng is quite good even if it isn't the most authentic.  You can also get Nasi Lemak if you ask for it (not on the menu anymore), too bad they stopped putting anchovies in it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "HnKpnz9Rt-aWpG0KW8WL2A"
  },
  "vbyLZ9jWFW9G13yzuBUlqg": {
    "date": "9/17/2012",
    "text": "Interesting Dim Sum/Malaysian place in Squirrel Hill, Sun Penang is great for offering these things in Pittsburgh even if collectively the restaurant doesn't equal the sum of its parts. More specifically, there are great Dim Sum and great Malaysian offerings but one's experience here is dependent on choosing the correct menu item as some dishes fall notably short.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zaNUeZZ-Xm21o3fZ0CUbXA"
  },
  "kWyXby0SXpikCRjwnJi6Qg": {
    "date": "10/14/2012",
    "text": "The dim sum menu is pretty tasty, especially the turnip cake. I haven't ordered off the regular menu yet. I would warn you to be prepared for a wait, which might be unpleasant if you're in a hurry or very hungry. Overall, prices are reasonable and food is pretty good, but the wait and the somewhat lackluster service bumps it down to three stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NftdZP8_WCfYtt7HukemPw"
  },
  "2WpsMkSn-s4jI1z-Z4H3Jg": {
    "date": "4/25/2015",
    "text": "I used to really like their food but lately, it's been really bad. Don't think it's a good sign if you mess up Green Curry twice in a row.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y735i3H9oYo-AG0RgTB22g"
  },
  "nDvMWRODRqb8pPuV8BMWag": {
    "date": "3/31/2013",
    "text": "Dim sum menu is nice, great for large groups.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7_I2DafA1dNDVRTQeCZdNA"
  },
  "AL9PYaFBIem7Lonmf1YC7Q": {
    "date": "10/20/2008",
    "text": "We went to Bali for our honeymoon. The food here is as close to the food we had on BAli as I can find. It was delicious. We have eaten here many times. Sit out side and enjoy a Thai iced tea if you get the chance.  so sweet, and watching the retarded Pittsburghers walk around acting silly is fun too.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "e5O_lm2Mov6kHOka8wgvOA"
  },
  "WCvaOUbBWoyZWxB6wgKPJg": {
    "date": "10/5/2014",
    "text": "The waitress was a mess and got two orders wrong. It took forever for us to order, and then to get a check when we were done. I'm not sure if this was because we were a large group. But everyone seemed to enjoy their food!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HAbASizzsq-Z26CbdTpbpQ"
  },
  "PfPMcaqgX101yJ_pFeiU3w": {
    "date": "9/5/2006",
    "text": "This place is new in Squirrel Hill and I sure hope it sticks around.  The food is uncommon and delicious.  I had the mango chicken and it had an excellent mix of sweet and spicy.  I was surprised at how fresh the mango tasted.  The service is quite attentive without being annoying.  My ice tea and water were refilled several times and without prompting.  The covered outdoor seating is quite pleasant and perfect for people watching.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-a9IN_IZSLphqDCq5r1DUw"
  },
  "vN0qPlhfhsB4mMRwtNGx-w": {
    "date": "10/14/2013",
    "text": "I ordered food from Sun Penang because of the great Yelp reviews. I excitedly called in orange chicken and thai iced tea. An hour and a half after I placed my order, I wondered where my food was. Finally! A phone call! But alas, it was only the driver calling to tell me that he spilled my tea in the car. Would I like him to drive back to the restaurant, make a new one, and come back to Shadyside? No, my hunger couldn't wait more time in addition to the hour and a half. About ten minutes later, my food arrived. Salvation! I ran upstairs and to my kitchen table, ready to eat. I eagerly took my first bite of the suspiciously cold chicken. An entire mouthful of chilled congealed fat caused me to vomit on my table. One star.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vJZeLWC_33MkJ7NyGf3RsQ"
  }
}