{
  "OEi4Up-cOjUF76k5zBnTpw": {
    "date": "2/2/2016",
    "text": "I was kind of reluctant to try their noodles, thinking it was kinda weird to have noodles in a froyo place, but I'm happy I did! The broth was bomb and the pork was pretty good too. They use tea eggs as their eggs which was a really nice touch. I was pretty disappointed with Ramen Bar, but I guess it doesn't matter anymore. I hope this place gets more business because it really is a good place even if the location isn't very prime",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c-7wFwxtPuK7DQqAc34ldg",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Red bean brulee",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c-7wFwxtPuK7DQqAc34ldg/o.jpg"
      }
    ],
    "user_id": "qbzWr6kIidWdzC24uBHwTA"
  },
  "Fefqf3ty1zZ05FINjinTHA": {
    "date": "3/6/2017",
    "text": "Came here for try the ramen as I saw a friend who had discovered that this place makes ramen. Given the lack of decent ramen in Pittsburgh in general, I was initially excited to try this place's ramen out. How it works here? You can pick your noodles, meats, fixings, condiments, and any other stuff that you want to add to your bowl via marking up a menu with an erasable marker what you want, they make your order in the back, and then bring it out to you if you're eating in. Will have to say that the result was less than stellar. Broth here was not flavorful (certainly not as flavorful and rich as tonkotsu broth is usually) and very generic & watered down. Noodles were half decent at best ... they got rather soggy pretty quick. Meat quality is relatively mediocre compared with cha shu that I've had at other ramen joints. Not worth it for the ramen if you're used to the quality you get in bigger East Coast/West Coast cities. Still, it may be worth coming here for dessert though ... I'll have to pay another visit soon to try that and will update once I get a chance to do so.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "r0HAtTM-y5EMtN0D8SUajg",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Ramen with Tonkotsu broth, chashu and other related fixings (made-to-order, customizable)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/r0HAtTM-y5EMtN0D8SUajg/o.jpg"
      },
      {
        "img_id": "pnVThgy2K084M4ZcZccg_w",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Pork buns",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pnVThgy2K084M4ZcZccg_w/o.jpg"
      }
    ],
    "user_id": "MLf4JUa1uzQkDLrBJ5yJHA"
  },
  "xNblaSn_-L-sDtaqFUTe-A": {
    "date": "11/5/2016",
    "text": "Yes, this place is called Love Yogurt, but believe me when I say that this is the BEST ramen place here in Pittsburgh (or at least close to CMU/UPITT/etc).   Desserts are pretty good too. Right at this moment, I am in a heavy state of lethargy form having eaten a whole bowl of delicious tonkotsu-flavored ramen, and getting various bites of three different desserts (mixed fruit sango-something, panna cotta, and a matcha strawberry crepe).   Will be back again.  Come here. Get the ramen.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yF4xj4E_5ASSB5D6PD50qg"
  },
  "VP5dbjpWOUYcWdfOmXbhrQ": {
    "date": "12/4/2016",
    "text": "The best ramen in Pittsburgh! You can have a super filling meal for $7-$10. Their broth is so great and they have a good selection of different types of noodles. I like that you can customize it to however you want. The toppings are 50 cents to 1 dollar each. Definitely would recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J5vEo3tpxCriMr0cTsN5pw"
  },
  "URKF1DUK8XWp7jnr8hOgzA": {
    "date": "7/3/2016",
    "text": "We ordered sweet crepes as we wanted to try them after looking at their menu photos.  It didn't turn out as we expected. It was not too bad but we might have expected too much.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qBi56_wwlaIuOMm8LIBWTQ"
  },
  "sKNpgRH6Fj27_mlvRc6bZQ": {
    "date": "4/29/2017",
    "text": "Good ramen and potted milk tea. Reasonable price! Would definitely coming back to have their dessert!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9gdRV2jTbSaKly1GRD7tfQ"
  },
  "Zf5gWHN8g38FrRf-zNbnrw": {
    "date": "4/19/2017",
    "text": "Kind of an odd mix of things (yogurt and ramen) but really good ramen with fun games to play while you're waiting for your food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CldOMkcpLWhLZC0YBDQ8CQ"
  },
  "LPgTmRgx3eVjxYctnc6FCg": {
    "date": "3/8/2016",
    "text": "- Ramen is delicious. - Crepes are incredible and come with a free hot drink/cappuccino that comes in flavors like red bean, cinnamon bun, chocolate mint, cake batter, peanut butter, and I'm sure a lot more (as it rotates) - Fascinating variety of frozen yogurt - cotton candy, salted caramel corn, apple pie, and the like - and tastes great for how inexpensive it is!  I'll have to try their beautifully plated desserts sometime!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k4rXLpIAZFNwxmgK2WcGxw"
  },
  "a09UcD3RUgIuLHyLUt7DRQ": {
    "date": "9/15/2016",
    "text": "I had a taro bubble tea here, and it was terrible. The milk wasn't cold, the taro powder was poorly blended in, and the tapioca was stale. I threw out the drink after a few sips because the milk and tapioca quality were so poor that I was concerned about getting sick. I am definitely surprised by the relatively good reviews for this place. Perhaps, the rest of its offerings are better. I don't think that I'll dare to test out that theory, though.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Caz0AvRFlKLt88Q8BRer3w"
  },
  "K4NXpqSSDbtkY4azo5eNjA": {
    "date": "7/7/2016",
    "text": "I went in for lunch today and was mostly disappointed. The decor of the place was just not professional looking restaurant at all. There were cheap looking glass tables and even tackier looking chairs. The ramen tasted ok, more authentic than some, but still not super authentic. I expected a lot more for $14. The potted ice matcha latte was very disappointing. First, it didn't come in a cute mug like all the other photos on here. Second, it didn't taste like matcha at all. It was green like the color of matcha but had no actual matcha flavor. It was also way too sweet for an Asian-style beverage. I will not be returning here again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O2a7daBECA404rb59H-XEA"
  },
  "U7zKwl6KA1foIm10xyzAwg": {
    "date": "1/30/2016",
    "text": "best ramen in Pittsburgh and best creme brulee I've had in my life (I got the red bean one)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "5dA2F1uLQrX1_yIRUd-xJA"
  },
  "x0Q4bOFQTAIEddBlt0Rc7A": {
    "date": "4/8/2017",
    "text": "I did a search for Japanese crepes in the area and I happened to find this hidden gem. Love Yogurt serves a variety of well known Asian desserts and beverages - bubble tea, crepes, sago, and even standard frozen yogurt. This place also serves ramen, though we were full from lunch and ended up just getting dessert stuff.  Two important factors in making good desserts is the choice of fruit and the amount of sugar. The fruit should taste very fresh and not kept in a freezer for weeks. The sweetness should be just enough to accentuate the flavor of the fruit but not be so excessive as to be overpowering. Love Yogurt does a good job on both fronts - the fruit tastes very fresh, and the crepes are not too sweet. In particular, the matcha azuki bean crepe has a nice mix of various flavors - sweet and mild, that blend well together. The mango sago likewise is not too sweet, and is just right.  The bubble tea was good but nothing out of the ordinary - although the Thai bubble tea had a unique cinnamon-y flavor to it that I do not normally expect from Thai iced tea. Aesthetically, the potted plant teas are very pleasing to look at, though the flavor is not anything unique.  Great place to go for standard desserts. I will try to return at some point to sample the ramen.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z27fERSsub99cZNbcJHBDg"
  },
  "VDawqKKEZwT14vTxnST4CQ": {
    "date": "9/7/2016",
    "text": "This place is interesting. Not only do they have fro-yo but they also have crepes and noodles. This review is purely based on the fro-yo but with a quick look at the menu I might be writing another one soon.   Love Yogurt's cotton candy fro-yo was great. I really, really enjoyed it. It had a nice milky smooth taste and was sweet but not overly sweet. It hit the spot for a hot day.  I also mixed in some mango fro-yo into the mix. The mango was more of the original fro-yo consistency and taste. I was not super impressed but I did not think that it wasn't good. I enjoyed the cotton candy one a lot more.  The toppings bar is also split up in two places. I did not realize there was fresh fruit until I got closer to the register. I would have preferred it to be in one place or at least a sign. I kinda got caught up in the mochi toppings and almost (ALMOST) didn't have room for the fruit.  I also liked that they had interesting spoons. The spoons (because apparently I am a kid a heart) were from the Chinese New Year. You can pick the spoon animal that corresponds with your birth year. I thought that was pretty fun.  I enjoyed my visit there. It was clean, open spaced, and well lit. I am looking forward to going back, this time to maybe try a crepe or two!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 5
    },
    "photos": [],
    "user_id": "-hietrA8M58asfpyJkCyiA"
  },
  "9J5PiT9SAYSUJWLI96SkTA": {
    "date": "1/11/2017",
    "text": "I was thoroughly surprised by this place. Like everyone else said, they do ramen and crepes as well as frozen yogurt! My friend and I did the noodle bar and I thought it was pretty good! Granted, I have never had \"authentic\" ramen from Japan; so I had nothing to compare it to. Regardless, the flavors were good, the toppings were tasty, and the broth was refreshing! The noodles were cooked perfectly too and it was a decently sized portion. And it's not all that expensive either, I definitely look forward to coming here more often whenever I'm craving my ramen fix.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nlFFSgo3d1xXVIiei3FVbQ",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Ramen",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nlFFSgo3d1xXVIiei3FVbQ/o.jpg"
      },
      {
        "img_id": "zAOBBvMZGPS5ZtwDgRvovQ",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Ramen",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zAOBBvMZGPS5ZtwDgRvovQ/o.jpg"
      }
    ],
    "user_id": "pspJkQgUOap1OjTZVMbdsQ"
  },
  "jD4y0CN1xaX20F42zzb9Iw": {
    "date": "9/27/2016",
    "text": "Funny, I have not actually gotten the frozen yogurt here, but I've been here multiple times for their ramen.  This review is for their ramen, and not their desserts.  That said - this is probably the best ramen option in Pittsburgh right now.  I'd rank the ramen at i Tea Cafe a close #2 (if they remember to salt the broth), Grit and Grace #3, and Tan Izakaya and Ramen Bar a distant #4 or #5, depending on whether you consider not actually having ramen noodles in your ramen to be a greater sin than excessively MSG'ed broth.  All things considered it's a rather low bar to be the best ramen in Pittsburgh, but this yogurt place does a decent enough job of it and the prices are reasonable enough that I keep coming back.  The noodles are fresh and come out with the right amount of springiness.  The toppings available to build your bowl are plentiful.  The pork belly is flavorful and tender.  The broth is well salted but their tonkotsu broth is lacking in richness.  Service is relatively quick and informal, so it makes for a great lunch place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qWtrwmwfJRhb9YHMkLpF5A"
  },
  "7zApvvZmiSB1G5oZl2mGIg": {
    "date": "11/30/2017",
    "text": "Their new item: the spicy beef rice noodles are the best thing that has happened to Pittsburgh Asian food scene. Hands down",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CvAgVvd1wbdNLZBjEz8pHg",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. So delicious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CvAgVvd1wbdNLZBjEz8pHg/o.jpg"
      }
    ],
    "user_id": "mPHsVnDXF-UUB3D710Twuw"
  },
  "54jHO423ZkLJybCzAH8O3w": {
    "date": "7/24/2017",
    "text": "Went here this past Friday after an unexpected visit to MaGee so the location was super convenient. Hubby and I each ordered the ramen with plenty of toppings. We both got tonkotsu broth but somehow miso too? Not sure what that's about but the soup was very tasty. Value is not great in my opinion because there was not a lot of noodles or toppings. The bamboo shoots out of a can cost $1 extra and you get like 5 pieces, maybe. I ordered the pork belly but it was more like thinly sliced chashao rou instead of the chunky, seared, fatty True pork belly. Egg is not soft boiled but just a tea egg sliced in halves. That's fine, I suppose.  The dessert and drink selection looked great on paper but looking around the store, we had doubts about freshness and variety. The fro yo toppings were sad-looking and stale so I probably wouldn't recommend that. The crepes are made to order so I might have to try that next time!   It's self-service, which I like but the owner (or whoever was taking our order) was taciturn and not friendly at all. We gave a big tip too and he didn't even smile or say thank you... I liked the cute decor, furniture and wide variety of little games they had. I do really want to come back to try the sweet stuff and hope that it's yummy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8DclOINSPldMTgiEbuCdoA"
  },
  "XEq4Gi5tBHnSiHCjkTaa2g": {
    "date": "6/27/2017",
    "text": "I work in the area and always thought this was just a bubble tea/dessert place until I saw a ramen sign out once and I got excited to try it as there is a significant lack of good ramen choices in Pittsburgh. There's a menu of choices you indicate with a dry erase marker so you can fully customize your ramen based on soup base, noodle type, spice level, and toppings. They have a pretty wide range of meat, fish and veggie toppings. I was excited to see a Tonkotsu broth option as I haven't seen that elsewhere in Pittsburgh but I don't think it was a True Tonkotsu broth as it was too clear and thin of a broth but still quite delicious with a great level of spiciness. The pork quality was also very good, as were the other toppings. However, I was disappointed that the boiled eggs were fully cooked rather than soft boiled. They were also dipped in soy sauce so quite salty, though I like salt so didn't mind it. The atmosphere is very casual and the staff are friendly. It is not full service, as you order at the counter but they bring it out to you.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qkQffpXjjIYohSE460QcAA",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qkQffpXjjIYohSE460QcAA/o.jpg"
      }
    ],
    "user_id": "3bo1FXvQnxw2hmO0CHH4Nw"
  },
  "b8HHo9iPZjKstk_a84qnlQ": {
    "date": "2/15/2016",
    "text": "Aptly enough, I stopped by Love Yogurt with a good friend during the evening of Valentine's Day.  We were hungry for some sweets, but didn't want to go far.  Intrigued by the reviews I'd read for Love Yogurt, I suggested we try it out, so we headed on over.  Both my friend and I were intrigued by the red bean creme brulee, so we each ordered one ($3.95 each).  Additionally, I ordered the potted plant iced matcha latte ($3.95), which also piqued my interest, and my friend ordered a taro jelly milk tea ($3.50).  Our desserts were served about 10 min. after ordering, and our drinks were served a couple of minutes after that.  As another reviewer mentioned, there are puzzles on the tables (Rubik's cube, etc.), which kept my friend and I uncharacteristically quiet and occupied during the wait for our treats.  The creme brulees were decorated and presented very nicely, with the red bean topping in the shape of a heart and a cute dollop of icing crowned by a little plastic dog.  While I'd had creme brulee and read bean desserts separately, this was my first time trying a combination of the two, and I must say that I was favorably impressed!  The brulee had its characteristic clear caramelized sugar topping, and the read bean added extra flavor and texture, making this version one of the most interesting and delicious ones I've tried.  True to its name, the potted plant iced matcha tea resembles a potted plant.  I'd never had a drink anything like this before, so I don't have a True standard of comparison.  Having said that, it was also quite interesting and tasty--though, TBH, I don't know whether I'd order it again.  My friend's bubble tea was okay, but wasn't one of the best ones she's had.  Overall, I'm awarding this place 5 stars due to (1) the range of options available; (2) the care taken in food preparation; (3) the friendliness of the owners (despite a bit of a language barrier with non-Mandarin (?) speakers).  My friend and I both felt that Love Yogurt was very authentic as East Asian eateries go (FWIW, I've been to (South) East Asia twice), and agreed that we'd be up for a return visit.  In particular, I'd like to revisit during lunch so I can try their ramen bar.  Despite a slightly out-of-the-way location, Love Yogurt stands out among the recent plethora of East Asian tea/dessert places in Oakland, and is definitely worth a visit!",
    "rating": 5,
    "rated": {
      "funny": 11,
      "useful": 23,
      "cool": 19
    },
    "photos": [
      {
        "img_id": "zBhVDug8rE-k8H8RUqEYHQ",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Taro bubble milk tea w/ jellies and potted plant iced matcha latte",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zBhVDug8rE-k8H8RUqEYHQ/o.jpg"
      },
      {
        "img_id": "ewr_-yAMW8K7ESlJVRjwFw",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Red bean creme brûlée (x2)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ewr_-yAMW8K7ESlJVRjwFw/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "fCVx0RQqesvmdelb4ZXHUA": {
    "date": "2/13/2016",
    "text": "It's a surprise that this place is called Love Yogurt when they do so much more than that. You kind of wonder when a place offers everything from froyo to crepes to creme brulee to ramen whether they're overextending... from what I've tried, I don't think they are!   First, the food. The ramen will be as expensive or cheap as you want it to be based on what you pick, but I would expect somewhere around $8 if you want meat. Each time I've gotten it, it has been flavorful, cooked well, and come out in a reasonable amount of time. I've tried the creme brulees, and the flavor and sugar crust have been really well done. I also had the potted plant iced matcha latte (just out of curiosity really), and this one seemed to have kind of an odd flavor... can't pin it down, but not my favorite.   Next, while not suuuper important, you can tell the owners put great care in how the dishes look. A+ for presentation!   Maybe it's because they're still a new business and have more time, but each component of the ramen or the desserts always seems so meticulously placed. They like to play around with the plating for the desserts, so you never know exactly what it'll look like.   Other notes: + Owners are very nice. + Interior is bright and spacious. + Each table has little wooden puzzles that you can play with... it's the kind of thing where you'll be like \"oh that's stupid\" but then spend the next half hour trying to figure out. Yep. + You can get a punch card, where 8 orders over $3.50 will get you a free yogurt up to $5.  + There are a couple of actual parking spaces in the mini lot out front.   So yes! Totally onboard with more good Asian eats in Oakland!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "2sml8xX0ZgcShc1G05Iufg",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. red bean creme brulee",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2sml8xX0ZgcShc1G05Iufg/o.jpg"
      },
      {
        "img_id": "LASwH5gtBL4llvLg0JvNUQ",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. pork buns with bamboo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LASwH5gtBL4llvLg0JvNUQ/o.jpg"
      },
      {
        "img_id": "ATH2jedBL1pVDdQi9FS4_g",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. red bean creme brulee",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ATH2jedBL1pVDdQi9FS4_g/o.jpg"
      }
    ],
    "user_id": "IhB3dvBjH5gWp__Ae1VxIw"
  },
  "p2E2ja_a3gLcy59QZ_wU_w": {
    "date": "1/28/2016",
    "text": "So this dessert place also sells ramen now, which is fantastic since good ramen (or noodle soups in general) doesn't really exist elsewhere in Oakland. Their \"noodle bar\" is really a customizable menu where you pick every component of your ramen to your liking, from the noodle to the broth to the toppings. The base price is relatively cheap, and you can get a good bowl of noodles with all of the standard Japanese ingredients for just about $10. Otherwise you can have it as cheap or as expensive as you want, which is really convenient. If you want to go all meat, feel free; if you don't like seaweed or broccoli, then it won't cost you anything to skip it. It's a great alternative to just having different preset options like at Ramen Bar.  Aside from the novelty of building your own bowl, the portion and flavor are all there as well. The bowl was pretty big, and with the number of ingredients I chose, there was a good ratio of noodles and broth, and at the end of the meal I was pretty full. For my particular bowl, the noodles came out nice and spongy, the broth was rich and flavorful; the bamboo was soft and chewy, the seawood was nice and crispy, and there were several pieces of chashu which were just the right amount of fatty. Surprisingly the best ramen in Pittsburgh (there isn't much competition to begin with) was found here for me, beating out Ramen Bar in both taste and value.   Plus, the owners are super friendly, they provide free tea or coffee with any meal, and you can walk around casually or amuse yourself with some of the in-house board/party games while you wait. What reason is there not to come here?",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "kByJn0LO6V85Ol9iT1tECg",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Chicken teriyaki crepe",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kByJn0LO6V85Ol9iT1tECg/o.jpg"
      },
      {
        "img_id": "mZBwSo7wLEQz67VHgWhVdw",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Dumplings and pork buns",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mZBwSo7wLEQz67VHgWhVdw/o.jpg"
      },
      {
        "img_id": "VyV94lhC9KKS7ZxN84gQ4A",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Tonkotsu ramen with chashu, egg, bamboo, dried seaweed",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VyV94lhC9KKS7ZxN84gQ4A/o.jpg"
      }
    ],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "-SbsPg_LR_IJQwdNNuJWFQ": {
    "date": "3/30/2018",
    "text": "Very bad service. I came here for the dessert and milk tea drinks but they told me they were too busy to provide. The only thing they sell here is Ramen. But also really slow. I'm just curious that if you don't serve the dessert or drinks, why put them in the menu. It is the worst experience I have met here in America. I have been Pittsburgh for two years but never became so angry like this. If the restaurant don't provide what they have in the menu, why you open it? Definitely, I won't come again. Never! They are whole bunch of good Ramen bars around this area.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bBMw-2_pGbUcguKlhvXgcw"
  },
  "0r7_5yljvwIzHiU85JFjlw": {
    "date": "5/7/2016",
    "text": "A mix of ramen + desserts? Ok, well, that's interesting.  We stopped in after finding this place on Yelp. It's a bit random- the ramen looks interesting. The froyo- your typical build your own, and then there's some fresh fruit offerings.  I got the potted plant ice matcha latte, as I was rather intrigued by it, from the pictures. I think I thought it looked much more interesting in the Yelp pictures than when it was made. I kept trying to ask what it was made of, but the guy just wanted me to order something rather than explain it. Oh well, I thought. I want the potted plant matcha, I said.   The mix of just matcha powder with 2% milk with some ice in a blender, and then just whip cream on top with a couple of green tea pocky stuck in it.... well, that's not what I had imagined. I mean, it was good matcha powder, but still...err....I think from the pic, I thought it was ice cream or something more complex?  So, I thought this place was just a-ok. In my opinion, there's a lot of other better asian dessert places you can get in Pittsburgh....",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PrwnAL82LL4Ewt_wJpHWCA"
  },
  "670b8FDP09YsiSBNJZnjmg": {
    "date": "3/20/2018",
    "text": "The low rating is not even for the food. It's for the time. I came in at 2.10 in the afternoon, not super busy or anything,  30 minutes had passed and still no food. If you are a working professional, don't bother coming here. Your entire break will be spent just waiting. Slightly overpriced as well. My bowl came up to be 9.10 and I had to buy a drink since their minimum for card is 10$. I hope they increase their speed. The food is not bad however and they work really hard obviously.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N5q5ZCrNPLEdnCdyioB4oQ",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N5q5ZCrNPLEdnCdyioB4oQ/o.jpg"
      }
    ],
    "user_id": "6oc5ddX-3gOTwZH87eiIvQ"
  },
  "qDbv01aFvxkvaKU_XySSGA": {
    "date": "1/15/2017",
    "text": "idk why a Yogurt place is the best Ramen I've had in Pittsburgh, but holy moley it was freaking fantastic! As per the usual, checked this place out because of the awesome yelp reviews and I was NOT disappointed! Four different types of noodles, many different combinations you can make for the broth, tons of different additions, some BAMF kimchi, and just I was in heaven - in a little college area yogurt shop! I ate that whole bowl and couldn't even eat yogurt after! But I'm definitely going to be back for the crepes (both savory and sweet!), so I'll update y'all then :)))  Also, you can believe my review because apparently all of my end punctuation was exclamation marks and I don't even want to go back and edit it for variety.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "V0pP_PQnWdtyKpF-pifiaw"
  },
  "qlVumHDI4CKxK_Rc2yT3mQ": {
    "date": "1/31/2016",
    "text": "This is going to be my new favorite place to go in Oakland. I just found this hidden gem today and absolutely love it. I have been looking for a crepe place for awhile, and it has met my expectation :) the owners are super sweet and they are very helpful as well. I will definitely recommend it for people looking for ramen/ froyo/ desserts",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gAORyHBJVUCihHjp45Xq0g",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Mixed fruit",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gAORyHBJVUCihHjp45Xq0g/o.jpg"
      }
    ],
    "user_id": "X0ThBT2nXkeEFzd7RSuy6Q"
  },
  "mnS9hIOcdf66f0Bb5ZnLug": {
    "date": "12/7/2017",
    "text": "Not expensive and so delicious  definitely go there in the summer and also during the winter it is a good opportunity to get a frozen yogurt during exam time",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1kOziKuwSR3LY5bnCz_XcA"
  },
  "DVoXoWQw4_T80erQj2xLVA": {
    "date": "4/1/2017",
    "text": "I had their ramen and Asian mango desserts multiple times and they're both very good!! Their ramen is definitely worth trying and it is customizable with add one. Also love the atmosphere of this place as they have a bunch of free fun games as well as free tea available. Really great chill spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iAbG_QrgeF46ehx9-C9W4A",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iAbG_QrgeF46ehx9-C9W4A/o.jpg"
      }
    ],
    "user_id": "oiNE4MJQTBOpMdtEHQhtQw"
  },
  "Qm-njSPbKcPbZVg3AURlwA": {
    "date": "7/17/2017",
    "text": "Sad they don't sell frozen yogurt anymore! I used to stop in here all the time when I was craving fro-yo because it's so conveniently located- only a 2 minute walk from my house",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7VVKEsENs8RpO_Y_Hryb3Q"
  },
  "KK7epoRoiS0pJnpDeVDwgA": {
    "date": "10/1/2016",
    "text": "Although most would say it's in the name, Love Yogurt also does Build-your-own-ramen. Go figure right? Not that bad though! Staff was friendly and got some good food too! The ramen has many categories so you can pick as much as you'd like. I tried to get a bit of every section and adding an appetizer I got to $16 dollars (completely expected since I did double meat and a seafood). Getting all of that definitely makes it look great and have a nice varied taste amongst ingredients which I love but we'll have to see next time when I try the minimalist order. Soup flavor was great but not as spicy as I would have hoped for it being called a spicy soup. Maybe in the future add a spiciness level? There's even off-street parking, which is great. With complementary tea in the back as well as games and other knick knacks on the tables to play with friends, this is a really nice place to hang out for both the sweet and savory taste buds!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oNnnGGmoDc_cFlAqJ_o0fg",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Chashu pork, egg, seaweed, mushrooms, and a spicy shoyu broth. Love it :D",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oNnnGGmoDc_cFlAqJ_o0fg/o.jpg"
      }
    ],
    "user_id": "gcfrEGqrnxX0UzBt_bTSfA"
  },
  "sP8kEQvZqfYmoqjK0H96Mg": {
    "date": "2/12/2018",
    "text": "I was really surprised I pass this place plenty of times..today I gave it a try I didn't know much how to order.. I figured it out and build my noodle dish...it was different and delicious vegetarian is my thing.fried tofu.curry base broth. fried onion. pink ginger. sappora noodles..will be back..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h_dwH3_dPeSY9OF_ZMBFxw"
  },
  "NCY3J6GHIYabH4uzrRvzDg": {
    "date": "5/7/2019",
    "text": "Solid soup noodles.  The place can look really sketchy/international China vibes, but the food is good. The soup bases are flavorful and savory, and the toppings are very comprehensive, from egg to meat slices and even pickled vegetables.   Definitely more of a home-style place, but I like it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RTTMsplbxNb61fujtFz23g"
  },
  "QR2VvdvjKXc6uYA0wToQqg": {
    "date": "5/13/2019",
    "text": "Their website states they open at 11:30 on Saturdays. I showed up at 11:30 and waited until 11:45 for someone to arrive... a tad frustrating but not a deal breaker.  The ramen is customizable and you choose your noodles, broth, toppings, protein etc...  There was a SERIOUS language barrier and so I had to create my bowl blindly... a tad frustrating but not a deal breaker.  The gentleman tried to explain that it would take 20-30 minutes as they had just opened...the language barrier was STRONG and their lack of preparation was impacting my ability to enjoy lunch in a timely fashion...very frustrating and bordering on deal breaking.  I went for a short walk and came back 25 minutes later...my ramen wasn't ready and waited another 10 minutes...  The ramen was really tasty- I have no idea if I choose noodles/broth that complimented the pork / seaweed salad / tofu / mushrooms / fried garlic... but I ate it and would possibly stop back with someone that knows what they're doing...but wouldn't make a special trip on my own to return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gm-kEiEsSk_92_kr_6ln1A"
  },
  "monuy6DKNFM1T5yCVN65iQ": {
    "date": "2/9/2018",
    "text": "This is an authentic small Asian family / friend owned restaurant in the heart of Oakland. It's a casual setting great for groups. Nothing fancy: the place offers board games and has fun, different plastic chairs and tables. It has a $10 CC minimum.   I came at lunch time on a Thursday. I wanted to order the potted plant iced matche latte, but I was told they couldn't serve anything from that menu because they were too busy. It took a while to receive our food. The man who manned the cash register was also delivering the food to tables and busing tables... I'd advise some patience.  My friends ordered from the make your own ramen. I tried the broth, and the overall consensus was pretty positive. It's one of the better and more authentic ramen places in Pittsburgh. I ordered the edamame ($3.95). Great portion size and nicely salted. I also ordered the pork buns ($3.95). Not worth it. It's not what I had expected... It looked like they took the steam bun and stuck a slice of chashu pork, a tiny piece of lettuce, and drizzled spicy mayo on top. Nothing like the other pictures I've seen.    The menu(s) is extensive. They offer like 4 different menus which range from crepes, noodles, rice dishes, desserts, and drinks. It seemed disorganized, so I think they should consolidate them into one. The desserts looked delicious.   Overall, this eatery is not perfect, lacking style; however, I'd return for the ramen and desserts!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DdDouz2pEIxsJm6tjYpMqA",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Pick your broth, topping, noodles",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DdDouz2pEIxsJm6tjYpMqA/o.jpg"
      },
      {
        "img_id": "sM7Nob9er6mr_C9mDPhF4Q",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Pork buns",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sM7Nob9er6mr_C9mDPhF4Q/o.jpg"
      },
      {
        "img_id": "EOET2al2qZcKaVTOQuJg8Q",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Shaved ice &amp;#34;yogurt snow&amp;#34; topping bar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EOET2al2qZcKaVTOQuJg8Q/o.jpg"
      }
    ],
    "user_id": "U-FY_uZs1set1LFs7YL12w"
  },
  "TeBkIymXo9GHG66PoFcERQ": {
    "date": "7/23/2018",
    "text": "This place is okay. I think I came in expecting something like snow-cream (this Asian shaved ice-style dessert that is also creamy) and it sort of was the same texture wise but flavor wise everything was extremely tart, as expected of yogurt. If you are a tart yogurt fan, you will probably like this dessert. I would probably rather have fro-yo any day over this stuff but it was not terrible tasting by any means, just not my go-to choice for a dessert for the future.   The atmosphere is also a bit dingy and dirty. I really dislike when a place appears unclean and I felt this place was messy and unkempt. I understand that it is a \"casual hangout\" area but it could use some ... cleaning up? The table was sticky and the bins near the trash can were piled high with used dishes. It looked like everything was falling apart in this place from both outside and inside. Speaking of the exterior, there was no sign anywhere that said Love Yogurt. How do the owners expect people to find it..?   All in all, I was a bit disappointed in the experience. Did not get a chance to try the ramen or other desserts but I would not come back again for the yogurt one.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZvsxI7NlvtzPbX2T8eUZIQ"
  },
  "hZh3CpW2xDCoCLBTfZvRBg": {
    "date": "11/6/2017",
    "text": "** Definitely doesnt deserve four stars - mediocre at best. Build your own ramen options had potential but left me unsatisfied.  I am still convinced that there is no good ramen joint in Pittsburgh (but hoping some place can prove me otherwise). Living in the SF Bay Area for 18 years has given me a high ramen standard that has just never been satisfied in Pittsburgh.  The menu had a build your own ramen bowl, which sounded good since I liked having control of picking out which ingredients I wanted in my ramen. However, the chicken was just so odd... So odd that Im having trouble even describing it. They were like small chunks and really oily, almost looked like they came out of a can. That was enough of a turn off for me. Noodles we're just okay, I got the QQ noodles which were supposed to be chewy but I didn't think the texture was anything special.  Can't comment on the desserts, but another thing to keep in mind is that they have a $10 credit limit.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "P4m_j1l_evePjTQQ4YmKGg",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Build your own with chicken - looks decent but wasn&amp;#39;t that good",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P4m_j1l_evePjTQQ4YmKGg/o.jpg"
      }
    ],
    "user_id": "mxufNEcZIYndtjPHVtCh5w"
  },
  "DgFtXBrTbQzS2kGmQTSibQ": {
    "date": "1/13/2019",
    "text": "Great place for noodles! You would enjoy the rice noodle they build, but I still recommend build your own noodle with different soup and adds-on! All of them are delicious. The price is also lower than other noodle places! 8 bucks you can go home with a happy stomach!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FmyYSodHuwK-x7cw4atA4Q"
  },
  "z1wedaeSHpz_YcKGidnshw": {
    "date": "10/31/2017",
    "text": "Ahhh... Love Ramen (formerly Love Yogurt) used to be my close-by ramen spot.  It was chilly outside, and there still seemed to be good business here, all for their ramen. Decor is nice and colorful. They replaced the yogurt with snow cream (fun!!). Their desserts I'm sure didn't change in quality, but I felt like their noodles did. (All purchases must be over $10 for card now too.)  BUILD YOUR OWN NOODLE ($4.50+): With my return after maybe a year to Love Yogurt/Ramen, I did my usual order: QQ noodles, chicken soup, spicy shoyu, bean sprouts, chicken, and green scallions. The toppings vary from $0.50 to $2.00 each. Noodles were decent, soup was okay, but my real concern was the toppings. I don't know if I just got unlucky, but the chicken they used this time was very fatty. It looked like cut up tofu before, which was still good. But this time.. it was fatty and they gave less along with the bean sprouts too.   With the name change, they also now have a noodle menu that isn't the BYO. If I am to visit again, I would try one of those, hopefully to redeem what I used to like about Love Yogurt.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "E1FJIPr-VRPotG8v6c2kaA"
  },
  "LD6Ya0UblfI6uybIMz5z_A": {
    "date": "12/8/2018",
    "text": "I really enjoy going to Love, Ramen. It's kind of a secluded location and looks a little sketchy, but it has a really nice vibe: there are games you can play while you wait (which usually isn't long), it's really colorful and has nice music.   It's not the best ramen I've ever had, but for an average of $6-8 it's more than suitable. Base noodle soup is $4.50 and toppings are $1 or $0.50. You order off a dry-erase menu and can choose from different noodles (wavy, rice, Sapporo, etc), broth (tonkatsu, vegetable, shoyu, curry), meat or fish, vegetables or other toppings (kimchi, seaweed, mushrooms, avocado, etc), and then free toppings (garlic, scallions, etc). You can really get a lot of toppings and it doesn't cost that much. However, I would advise bringing cash because their credit card minimum is $10, but regardless it's great if you're a broke college student / just don't wanna spend much money.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "062hbg4N1JJJgM4XADGgig"
  },
  "tlZDtr-7F_L-gbNZjbF9Lg": {
    "date": "3/20/2017",
    "text": "My friend Gertrude brought me here and I enjoyed it so much I said \"love you, Gert.\" The owner heard me and thought it was so sweet, that he renamed the place after my sentiment. He spelled it wrong but he has the Potted Plant Black Milk Tea so he's forgiven.  What to get: Potted Plant Black Milk Tea Why: Well, it's like a potted plant, and it's black milk tea Really?!: Yeah, crazy right, you'd never guess from the name  The potted plant tea should probably be consumed \"for here\" rather than \"to go\" so you can get the full effect of how much it looks like a potted plant. I'd probably have given LY a 5 star rating just for the \"Lovely\" decor and the awesome retro games such as their Rubik's Cube. Speaking of which, would you like to see my Rubik's Cube? It's more of a Rubik's Cylinder.  Rubik's Oblong, maybe. Emphasis on long. But anyway.  So it's a really cute place with nice decor and plenty of places to sit. The products are generally pretty good, but none is more fun that the potted plant tea, which they make to look exactly like a potted plant. In itself that's cool, but as a massive lover of milk teas, I can say that this one - along with those at I Tea Cafe and Sumi's Cakery - is the best milk tea in the Burgh.  Speaking of the Burgh, Chris De Burgh told me that he's never seen you looking so Love Yogurty as you did tonight. Maybe it's because you were wearing red.",
    "rating": 5,
    "rated": {
      "funny": 20,
      "useful": 27,
      "cool": 22
    },
    "photos": [
      {
        "img_id": "RtehyLiNXLPMQEc6IABsPg",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Gurt was like, do you even like me. I was like, I love you Gurt!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RtehyLiNXLPMQEc6IABsPg/o.jpg"
      },
      {
        "img_id": "ijaZ0USwmPg2jK7hyLbKnA",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. I hear the secrets that you keep when you&amp;#39;re talking in your sleep. And they&amp;#39;re all in Chinese characters so I can understand them.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ijaZ0USwmPg2jK7hyLbKnA/o.jpg"
      },
      {
        "img_id": "_uC4zhMM6-yLkaKRzDekpQ",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Like right on the wall. But the bowl right there on the wall. Don&amp;#39;t worry if it falls down. Put it on the wall. (Smash)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_uC4zhMM6-yLkaKRzDekpQ/o.jpg"
      }
    ],
    "user_id": "Hi10sGSZNxQH3NLyWSZ1oA"
  },
  "LhF74XHutV4E_yR9zFTg3g": {
    "date": "1/8/2018",
    "text": "I went to \"Love Ramen\" today and I was excited to see they added a new menu of Chinese dishes to their inventory! I didn't get to try anything on it, but I'll be sure to give it a chance sometime soon.  It was super snowy and miserable outside today in Pittsburgh (as always) and I needed something to warm me up. I'm so happy I decided to come here. The Japanese style ramen never disappoints. And they always have seats available because there are so many seating possibilities!  The man and woman who work here are always so nice and patient. They brew hot tea, offered free to paying customers, and supply water as well.  There are also so many board games to play while you wait (though you honestly don't have to wait too long).  Even though this place also sells fro-to, I'd recommend you get the ramen, if anything.  The only reason I gave it 4/5 stars is because of the price but the prices are pretty standard. I think they give the perfect amount (I have a suspicion they've been giving more since I first visited) but my guy friends argue there could be a little more for the price.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "bgIYmGzX7s77Ndd2jW4A2g"
  },
  "9E_C4tbC4xRPd1qxRPDw4A": {
    "date": "12/20/2017",
    "text": "It's funny how this place is called love yogurt but more people come here for the ramen than the frozen goods. I came for the ramen. Although this place has one dollar sign, the ramen is actually normally priced, especially with all the ingredients that they consider add ons. After adding the usual egg or meat or veggies, you'll have a dish that's around $8-10, which is normal for ramen. That being said, the quantity is decent, and the freedom of choice is appreciated. If you're not a ramen expert, you might end up picking uncomplimentary ingredients, so watch out! I would stick to classic noodles and shoyu broth, with egg and charisu to compliment it. Can't go wrong with classics!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mqBBkAgvdAqmSI3TfWjG1Q",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mqBBkAgvdAqmSI3TfWjG1Q/o.jpg"
      }
    ],
    "user_id": "Go2GaPE609qgJI0jCMvmrg"
  },
  "mqGz_BYA04xeBixxIBSr5w": {
    "date": "4/8/2017",
    "text": "This review is for the crepes and the customer service, not the ramen, which I have not tried. Three of us came in looking for some dessert and ordered a couple crepes which sounded good. Shortly after us, a large group of around ten or so came in and ordered noodle bowls. We waited for a little over a forty minutes for those crepes, which was ridiculous. The group that came in later got their food before us and only afterwards did the man start making our crepes (which only take a few minutes each, I was watching). He should have let us know there was going to be wait, like if they had run out of crepe batter and needed to make more. Otherwise, the process here doesn't make any sense at all for a food establishment - it felt like they favored their regulars or friends first or at the very least that they don't have a very optimal process for the kitchen.  The crepes were just alright. They were fairly large and decently priced, but the red bean on the matcha crepe was low quality and way too sweet. The menu also listed pocky as a topping and they definitely did not come with the pocky garnish. The other desserts like the mango pudding and the panna cotta sounded good and would hopefully come out quicker, but honestly I don't think I'll be back given my first experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K8VYonn7dP_7zcMM2adXDg",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Matcha red bean crepe",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/K8VYonn7dP_7zcMM2adXDg/o.jpg"
      }
    ],
    "user_id": "OQBMu7x0V4Oz3iFv3x0i5Q"
  },
  "H4WqF02CtAC49f6CR7FySA": {
    "date": "4/30/2018",
    "text": "S'ok for some asian dessert.    Sugo brulee - not bad, I actually thought the brulee would be crisp'd but it wasn't so it was mostly just a layer of sago on egg creme.   Red bean brulee - same as above just layered with red bean instead. I liked this better, the sago was pretty bland.    Mango juice w mango and rice balls - win! Mango was delicious and the rice balls were not overcooked.  The mango juice also was not overly sweet so it was a light(er) dessert.   $10 card min.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Lg-rKGTEsxNpnnNsR2tv-g"
  },
  "83QvFmwJ0Oh-Su02D-GHcw": {
    "date": "1/5/2019",
    "text": "This place is delicious. Definitely recommend it if you're looking for good ramen on Pitt campus!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "InCgJgCxjSDhHdtzyyl4EA"
  },
  "eRmS_sdu4isLBhcR64u4lQ": {
    "date": "6/4/2018",
    "text": "Absolutley delicious Ramen!!  It was my first experience and I was nervous but I ate every bite!  The seasoning was perfect and not over powering, and I didn't wanna add anything to it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OQmb044bUw3X-NoAeQPdEQ",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OQmb044bUw3X-NoAeQPdEQ/o.jpg"
      }
    ],
    "user_id": "4KFsYW9beALU5wCXERtFUw"
  },
  "5rg_EaGIOdC4W6uRhDEsHQ": {
    "date": "10/15/2016",
    "text": "I had no idea that this place sold other things than frozen yogurt! My friend had suggested to stop here for lunch as he wanted ramen and I could get something else since I wasn't too hungry. As you go in, you order at the counter. The ramen itself is pretty cheap. It's the additional things that you want in it that start to add up. I got wonton soup as I wasn't looking for anything too big. We sat at a random table near the back that had the wall cover with pictures of other people's vacation trips. The guy brought our food to us as we weren't sure if we had to get it ourselves or what. My wonton soup was good. It had a lot of seaweed and it came with a couple of pieces of wonton. The wontons itself were a bit too salty for me. My friend also enjoyed his ramen as it was better than other ramen places that we have tried in Pittsburgh.   The atmosphere here is pretty relaxed. There are board games for you to use. After you're done with your meal, you clean up after yourself. The dish bin and trash can are near the entrance. Overall, I did enjoy the visit here. Definitely will be coming back to try dessert!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OF7gPnbQeLpgShp6pjGcZA",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Ramen",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OF7gPnbQeLpgShp6pjGcZA/o.jpg"
      },
      {
        "img_id": "G2zF5Kk5be-SH2cqeoxM8A",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Wonton soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G2zF5Kk5be-SH2cqeoxM8A/o.jpg"
      }
    ],
    "user_id": "gmCK2ARSx22S_4_RQF9Jwg"
  },
  "a5N1kX-QlTo2l-pXDvKdAg": {
    "date": "2/5/2016",
    "text": "Love Yogurt has an extensive, unique, and cute menu that seriously goes above and beyond for a froyo place. They have almost everything! Noodles (choose the type of noodles you want and whatever toppings you'd like), bubble tea, smoothies, froyo, coffee, crepes, creme brulee, fruit sodas, etc. Their selection of crepes is mouth watering (\"Blueberry NY Cheesecake,\" \"Chocolate Nut Party,\" \"Amazing Cheese Fries,\" etc.).   Things I've tried:  - Potted plant iced matcha latte: Has a very plant-like/earthy flavor because of the matcha and ice and whipped cream if you know what I mean (or am I just imagining it?). Still pretty good.   - Matcha strawberry chocolate crepe: So good! That's all.   - Frozen yogurt: Pretty standard in terms of flavors and taste. However, they have Lucky Charms! Which you don't see a lot. Yum.   Owners are really accommodating and sweet. I once forgot to tell them that my iced matcha latte was to go, but they immediately transferred my drink to a to-go cup container and still made it look really presentable.   Very spacious and colorful inside. And puzzles/games on the tables while you wait!  So many more exciting things to try on the menu. Definitely will be back to try their noodles and more crepes.  Taste | 4 Atmosphere | 4 Presentation | 4 Service | 4 OVERALL | 4",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "mgcejE4_w0LeuHOp6-VV9g",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. matcha strawberry chocolate crepe",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mgcejE4_w0LeuHOp6-VV9g/o.jpg"
      },
      {
        "img_id": "M5f1l_RBQ_ch0OqmxJvLZA",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/M5f1l_RBQ_ch0OqmxJvLZA/o.jpg"
      },
      {
        "img_id": "Brc3UyNCnzC1t2R9uUBBQg",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Brc3UyNCnzC1t2R9uUBBQg/o.jpg"
      }
    ],
    "user_id": "HC5zLdut4caN1VPqxqRsMw"
  },
  "YklLI-OwoFHC1-vRyEOXSA": {
    "date": "4/7/2016",
    "text": "So you probably wouldn't think a place called Love Yogurt would have ramen, right? A Yelper friend (shoutout to Pauline T.) told me that ramen was on their menu and she heard it was good. This really intrigued me as there aren't too many ramen places in Pittsburgh. I had to give it a try, even if it was in a place that is known for yogurt and desserts.   Stopped in here on a Saturday night with the hubby and there was only a group of college kids there. There are make-your-own noodle bowl forms at the counter and that's how you pick what you want. You pick the noodles, the broth, soup base, veggies, protein, extras, etc. Everything is a la carte. My husband and I each got our own bowls plus some steamed buns. The ramen was delicious. Broth was hot and flavorful, the beef and chicken sausage were moist and bold in flavor. I would definitely come back for the ramen. However, the steam buns were pretty gross. The pork was dry, sauce was straight out of a bottle and bamboo was straight out the can. We also got yogurt for dessert and it was rather disappointing. The yogurt itself was tasty but the toppings weren't fresh at all. The toppings must have been out for weeks, maybe even months.   I didn't get a chance to try any of their special desserts but I'll be sure to give them a try next time I'm here for ramen.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j_Myd81cGnBfuURNAcoH7w",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Ramen with chicken meatballs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/j_Myd81cGnBfuURNAcoH7w/o.jpg"
      },
      {
        "img_id": "TIj_n-k-5NdeaMv9KnfL1A",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Ramen with steak",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TIj_n-k-5NdeaMv9KnfL1A/o.jpg"
      },
      {
        "img_id": "7Q3xV1NjZjnybAnKM472gw",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Steamed buns",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7Q3xV1NjZjnybAnKM472gw/o.jpg"
      }
    ],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "WO33g7JUFMgcR3A_PQolyw": {
    "date": "10/11/2017",
    "text": "This is a reaaally solid ramen place in Pittsburgh! Don't judge the place based on the appearance of the building. It looks like a little beat-up building on Atwood with a super asian-looking sign and the inside of the restaurant looks too casual to be a place to eat. However, the food is super delicious and I come here with my friends all the time. There are plenty of board games (Connect 4, Chess, Jenga, etc) to play while you're waiting for your food so you'll never get bored. The food doesnt take that long to come out anyway.   For those of you looking to check this place out for the first time, you need to order your food at the cash register! There are erasable menus that you write on with expo markers - checking off the type of noodle, soup base, toppings, and protein that you want. There are other appetizers that are mehhh. The ramen is the highlight!   Would recommend this place!  (Personal suggestion: Tokyo Wavy Noodles + Spicy Miso)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5Ox3A0e1FjVLuF8GZ52r4A",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Spicy Miso Ramen (Fried Tofu, Egg, Seaweed, Pork, Corn, Bean Sprouts)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5Ox3A0e1FjVLuF8GZ52r4A/o.jpg"
      }
    ],
    "user_id": "R5AuWqCdNP8U2SFAm1g0PA"
  },
  "m_airwisEUStEhMA3Yf7-A": {
    "date": "4/9/2016",
    "text": "I'm so impressed by the offerings at Love Yogurt. Want Ramen? Well, you can build your own bowl. Into crepes? They have you covered on both the sweet and savory end. Love delicious bubble tea and blended beverages? They do that too. Of course, they also offer frozen yogurt and a variety of toppings.   The husband and I were craving ramen and there aren't many places to get a good bowl of ramen in the burgh. You can find a good bowl here. I love the customization: You fill out an order card where you pick your base/broth, noodle, veggies, proteins, etc.   The broth was perfect and the noodles were yummy. Cloud ear mushrooms were lovely and flavorful, and the shrimp and pork wontons were super delicious. I do have to say that I was disappointed in the chicken. I thought the chicken was going to be.... different. What I got was reminiscent of bagged, frozen and precooked chicken strips. I won't be ordering the chicken again.   My taro bubble tea was delightful and my husband really enjoyed his potted plant Thai iced tea. I appreciated that neither drink was overly sweet.   We'll definitely stop here again. There are so many other things I want to try!  Bonuses: There's a parking lot, they offer free tea and coffee, and there are little puzzle games on every table. My husband and I hung around way after our bowls were dry, trying to figure out the puzzles.  Love Yogurt \"Love Poem\": Roses are Red,  Love Yogurt has choices, I build my own ramen, And my stomach rejoices!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8QQPV2zAn9RuyFMOhGBTow",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Taro bubble tea and potted plant Thai iced tea",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8QQPV2zAn9RuyFMOhGBTow/o.jpg"
      },
      {
        "img_id": "K54yUA267Jybi8blrjEOAg",
        "caption": "Photo of Love Yogurt - Pittsburgh, PA, United States. Build your own ramen",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/K54yUA267Jybi8blrjEOAg/o.jpg"
      }
    ],
    "user_id": "DtzguIRjy-oRbrwVidAxQQ"
  }
}