{
  "4YPE-ub3a71WOg2BtRwVow": {
    "date": "4/30/2011",
    "text": "We live near this bar/restaurant and frequent it.  As a vegetarian, I love that they offer a portobella \"burger\" and other veggie friendly appetizers. They have a lot of great beer on tap and it rotates seasonally. All of the servers we have had have been knowledgeable about whats on tap and willing to offer suggestions. My husband and I always go there during the week. The crowd weekday nights is pretty mellow (unless a game is on!) I don't know how the weekends are. It's a great place to watch a game too, as there are tv screens all around the the bar.  I also wanted to give them a big THANKS to the Saloon. During the big snow snowstorm of 2010, our power went out and the staff at the Saloon let us spend a long time eating dinner, and hanging out while we waited of our electricity to come back on.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "myKVt2Hf-FhuEBuLMDztbA"
  },
  "_VmdZjnERhujjJJWAPNjGQ": {
    "date": "12/8/2012",
    "text": "great place outside the city",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T7Nhxux5ao3Bk7ItFhpuig"
  },
  "4uuxoRrdjth7f6aoTxjYmA": {
    "date": "1/18/2011",
    "text": "I think this place is alright - good beer and your usual selection of bar food.  They do offer a bowl of popcorn to all patrons which is a nice little touch, but I'm weary of such communal distribution of food - has it been recycled, how long has it been sitting out, whose hands have touched the piece of popcorn that I'm placing in my mouth?  You know the usual salad bar/buffet questions that us over-analytical types like to run through our heads.    But the Saloon seems to be a very popular spot with the South Hills crowd.  And I sorta get it, the location is convenient for the South Hills patrons and with the selection of restaurants in the area you can grab a bit to eat before heading over to the Saloon.    Overall, I do enjoy this place when I go, but I'm not a frequent patron.  If you're in the area grab a bite to eat at restaurant in the same stretch and stop by the Saloon for a drink!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NnrCwpS1i5mZtkGGzmIk0g"
  },
  "JwjGHn063jMonCczhJpYhw": {
    "date": "3/23/2015",
    "text": "Great local bar with a great selection of beer on tap. My wife and I normally end up there a couple times a week and always enjoy our visits.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F3mrjDuxpxiziYiZbwn6sQ"
  },
  "PPyYq9mop96CQn0xWBtbfg": {
    "date": "7/22/2011",
    "text": "Why does this place always smell bad? Seriously, the second you walk through the door it's vaguely sewer-ish. Their roof deck is okay, and I am honestly glad that not every establishment in Lebo is high-end, but overall I'm not a fan.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "0qbki8EIeJndXajubFOIhQ"
  },
  "WnPVDoV3SXFLozGwiKADag": {
    "date": "11/27/2011",
    "text": "Great selection of beers and very friendly service. LOVE the buffalo chicken wings, best I've had, seriously. A nice local dive to watch the game and get together with family or friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_0r-2JvUk279ugyz-Dj7Hw"
  },
  "8E9ZorfePxHCEv5gXJl0dQ": {
    "date": "9/30/2013",
    "text": "This place is just okay.  Food isn't that great.  It's kind of dark & dingy.  Lots of TV's though.  I prefer Cain's Saloon...just right down the road.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "C7pVJtxnqReTjs7Gz7gjcA"
  },
  "UraSc6TWSoA9Am8j4MoiyQ": {
    "date": "4/11/2009",
    "text": "Great Beer selection good sandwiches and a basket of popcorn when you sit down. Very reasonable prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J6yo29yiVDisPE8eljiFRA",
        "caption": "Photo of The Saloon of Mt Lebanon - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J6yo29yiVDisPE8eljiFRA/o.jpg"
      }
    ],
    "user_id": "ccfYicnJienP1eZa86m-Vg"
  },
  "BH__b8feR-FSIpL-oXFCDw": {
    "date": "3/23/2012",
    "text": "Bad food even for a bar and some of the beer prices were a bit much.  This place has a nice layout, but the food is not worth the money.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MOMJQIYzbh1iAjzNTJzIJA"
  },
  "NQJdFTysaswFSxO97HLi4A": {
    "date": "11/5/2011",
    "text": "The Saloon is a great place to have some drinks with friends, catch a game on tv. The service is mostly friendly and quick. It really gets busy on Fridays and weekend evenings. They also have a decent beer selection, although I will add that there food is only so so. I'm not expecting much on the food front in this type of environment but there is room for improvement. And since there food isn't stellar there are plenty of good places near by and you can always grab a slice at apizza badamo.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vNbr4JUZtIDB34xT-1n8ew"
  },
  "_3hv1K1urVnQRrCAPBXBuA": {
    "date": "3/18/2010",
    "text": "Great place to meet friends and girls. Been going there a long time.  Only reason it doesn't get a 5 is a few of the bartenders that have been there a long time need to get on with their life's work.  You'd think THEY owned the place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nmSdDov8m3cW9f9af5QUEw"
  },
  "PbfG5Ehynit8psdkYYj1qQ": {
    "date": "2/24/2017",
    "text": "The bartender and table service was really good. The food was subpar even for bar fare. We requested a med/med rare burger that came out well. The taco salad was bland. Beer selection was good.The wine was terrible. Again was not looking for 90+ point wine but the basic cabernet smelled and tasted horrible, and tasted like it had been open for months. Again didn't have high expectations because it was typical bar food, but it ended up being below expectations.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W5tvKFe72UAudv5aFFflSA"
  },
  "xexWdU6LgX-0qk-EdONwGg": {
    "date": "4/11/2015",
    "text": "The service was terrible. We were there for about 2 to 2 1/2 hours, and we weren't trying to hang around to watch the Penguins game. The food was solid, and nothing more. The waitress was really cute, but that's about the only positive thing I had to say about this place. I usually dig the sports atmosphere, but the service was really bad, I cannot stress that enough.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "tEOqGtheLV4FF0o6BBxtsg"
  },
  "d6i3SGxFooebUfcSFQyT6g": {
    "date": "1/31/2017",
    "text": "Great local bar.  Good beer selection.  Food is a bit above simple bar food, but I am enjoying the Tuesday Taco special and is pretty good for cheap tacos.  Not too original, but perfect to grab a quick beer or watch a game.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mmoI0-Sc6GKz878pcwwCOg"
  },
  "pAkZNzIcxmAtuSu-b2gLVA": {
    "date": "10/22/2012",
    "text": "This is a decent sports bar - good selection of beer with your usual bar food menu. The drink and food prices are very reasonable for the area - also they do have happy hour specials from time to time.   I come here mostly during the hockey season to watch the pens game and also may be because I live only a few blocks away from the bar. Most of those who come here are usually locals from the South Hills Area. Although it's a bar, you will likely to see groups of families with kids. Also, there's usually a bouncer to check IDs at the door after 8 or 9 PM.  Although I don't frequent that often, I do enjoy whenever I go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "fBO-AauqOjPX2UBp9RgeQQ"
  },
  "h9TKuyRt-v_e5ZRSU-tv1Q": {
    "date": "6/21/2014",
    "text": "Typical dive bar. Mostly Mt.Leb locals and families, but smells like an old fraternity house. It has a lot of beers on tap and a great following. I like that it's close to my apartment, but I'd rather stay at home with a bottle then venture to the Saloon.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "1C-aJJRIilfZRB4IxMZplg"
  },
  "lb0qRadEGYndmw__v2lB2Q": {
    "date": "8/26/2016",
    "text": "Food is sub-par bar food. I think there is one slice of each kind of meat on this Italian hoagie. I'm only giving three stars because of the beer selection. Go for the beer not the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q3ycagiLqUaRkOgEPf_gbw"
  },
  "KZu8AQOaaJw0AL1EAsq7EQ": {
    "date": "9/17/2012",
    "text": "This is the sports bar I have been looking for since I moved to Pittsburgh! I only wish it was closer!  We checked this place out on Saturday. We were dressed up because we were attending a reception for a wedding later on and we were just trying to kill time. There weren't too many people in there and majority of the TVs were focused on the Pitt game with a few other games sprinkled throughout.   First win: PUMKING! I am seriously in love with that stuff. The bartender was incredibly nice and funny and social, which is how I like my bartenders. I mean, shouldn't they all be like that? Customer service is pretty much your job, but I digress ...  We didn't eat anything, as I said, we were heading to a reception afterwards, but we got to enjoy some beers and watch a bit of the Penn State and FSU games, my two favorite teams, so that was nice. The TV setup was in such a way that no matter where you were sitting you could see the game, a feature most sports bars in this town seem to be lacking. Prices and selection seemed on point and the bartender hooked it up! :) All in all I was super satisfied.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ahBUJmFUedHoFfgtcfzqSA"
  },
  "AQCfKp-rwufjroeTqAOAxA": {
    "date": "11/14/2011",
    "text": "It's a local dive where the Lebo citizenry can pretend to slum it.  Is it irredeemably bad?  As far as I can tell there are three reasons to go: 1) Golden Tee; 2) bubble hockey; 3) you can relive your high school glory days.   I admittedly wasn't popular in high school, and although I love a good round of GT, I'd look elsewhere for your fix. If there's a bouncer you can expect to be treated like a criminal, and if there's a crowd the wait for a round can be excruciating. Nevertheless, two stars for having a sweet sign outside and offering more than just Bud/Miller/Coors.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "YGHp8XlRkzbXQyGLh7U0Eg"
  },
  "HnYd63oji0Bh98dVRvBQgg": {
    "date": "4/29/2012",
    "text": "The Saloon is one of the best sports bars in Pittsburgh.  Tons of new TVs so you can see the game from any angle.  Sure you can go to the Southside, but then you have to deal with the zombie scene.  Seriously, that place has so many red-eyed, foaming-at-the-mouth people stumbling around it looks like George Romero is filming again.  I'd rather go to The Saloon where I can watch the Steelers/Pens in a festive, but not out of control atmosphere, and have a good time with my friends.  Great bar menu and beer selection as well.  The wings are the best in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qkU2o630sMtKUKin-HgRQA"
  },
  "boCW0bHftExiJOBXG0g0JA": {
    "date": "2/8/2015",
    "text": "This is one of those places where everyone thinks they are the only ones in the place. People just move around bumping into you. This place should have a limit on how many enter, but instead you are a sardine in a can. This place has been around for a long time though so the traditional style of the place is nice. They have an upper deck outside but you literally go up a fire escape to get there, kind of unsafe. The upper deck I would recommend to anyone who is going here for the first time in the summer of course. You can actually breathe and there's restrooms up there too.  This place is made for the townies and no one else. Bartenders are okay and servers are kind.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2YTAPdnmIhG4MH-voxXx9g"
  },
  "SNUmd0lokkrYA-BrG4Lz4A": {
    "date": "2/3/2014",
    "text": "If you are close to the area and you simply want a cheap beer with friends on a cold night, go for it. Just don't expect to get anything else out of it. The bartenders are pretty attentive and make strong drinks but I can't say the same for the food -- it's downright disgusting.   The ambiance is a little strange. After sporting events, they blast a collection of random music that has no flow. The crowd consists mostly of guys in their late 20s who wear beanies and fedoras and like to hunt the crowd in their high school wolf packs and cougars who most likely live in the area.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fCHNEijio8v7mfQg9IUcIA"
  },
  "SHzblj48XF09V3HUcGi0JA": {
    "date": "1/1/2014",
    "text": "Good beer selection and great additional space when the deck is open. Typical dive and bar food. Crowded on Friday/Saturday nights.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "owsX5JI9cHzkCiTvuVGhVA"
  },
  "qwRHskMNcLh6Lp80mBDZNg": {
    "date": "4/2/2016",
    "text": "I frequent the saloon about once a week.  I love it.  Love the atmosphere.  Food is good!  Wouldn't say great, but for bar food...love it.  Always a good selection of craft beer on draft!  Would highly recommend.  Just wish there was a pool table ...but not enough room.  :(",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dd084NoxG1TlkUTTVcMHgw"
  },
  "tAJ5xa1Nb-iA0wAAl99I6Q": {
    "date": "10/18/2015",
    "text": "Just finished eating at the saloon. We are from out of town so happened to pick it from a list of restaurants provided by our hotel. We found it to be wonderful. Enjoying a Sunday night with football on television, delicious food, and great drinks. We just had sandwiches, nothing fancy but everything was so fresh and the French fries were tasty. I could have ordered a basket of the fries and been very happy. For a couple of tourists, after 6 hours of driving, it was just what we wanted.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JXaa99SRn7SfmDA2mymihA"
  },
  "-P7cSeVF7Q6XeTppJJToyg": {
    "date": "12/28/2015",
    "text": "Good atmosphere friendly staff most of the time and they have direct tv to see all the football action on Sunday's. But the food is BAD. Worse than gas station food. Our pizza tasted like it was made in a microwave. Nasty! Burger was sloppy and cooked well done when I ordered medium rare. I don't recommend the food here!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e1ZapXyXVLWAcVUAeGXBFQ"
  },
  "3y2Gi29rpsCCLWqD11Tsug": {
    "date": "5/7/2015",
    "text": "The Saloon is our go- to pub. Keep in mind, it's a bar, it's not fine dining. But after remodeling their kitchen last year and revamping their menu, I can honestly say their burger is the best in Mt. Lebanon, neck in neck with Bistro 19. Beer selection is amazing, 30 craft beers on draft. Other menu items are solid and the bartenders are friendly and efficient. Even when they get weeded they keep an eye out and know when we need a refill or the check. When not too busy they take the time for small talk and get to know you. We live within walking distance which is a huge plus. More of a younger crowd on Friday/Saturday nights but over all, we always enjoy going.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DdTefWHlVWSy_9ml-bm-1w"
  },
  "J1mVIpScg5LgXckoxXFO9A": {
    "date": "4/9/2013",
    "text": "If you want to watch the game and drink some beers, this place is fine.  If you want to grab some lunch or appetizers, I don't recommend it.  While the food isn't bad, it's not  good.  That's kind of sad because it isn't that hard to get burgers, fries, cheesesteaks, and other pub food right.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oc-OgRqG5vUFk_nL9O-Vpg"
  },
  "rRMClJpzPrPJieGTWdd0Cg": {
    "date": "6/24/2015",
    "text": "This place has the best draft beer selection by far in Mt. Lebanon and the menu is decent for bar food. Too bad the bartenders are slow and the wait staff are too few.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UqHsq1NopijbntheBrXN9Q"
  },
  "ju-jEjyvvMOP_keXqNXDtQ": {
    "date": "12/11/2012",
    "text": "Any place that puts Yuengling on special on Saturday night is going to get a second look from me. So I went in, and I saw the sort of popular and unassuming place that every neighborhood should have. But this was a little better. The bar has a good 15-20 taps and a huge liquor selection.  I ordered the buffalo wings -- hot -- and I really liked them. They had good meat on them and the hot sauce had decent flavor to it. Seems like this place puts decent effort into quality food and drink, and the atmosphere speaks for itself.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "B_0YCpvWyZRr6voBiaULGg"
  },
  "SyZV4XN8qvq_Ekhwon6isw": {
    "date": "1/4/2014",
    "text": "Great for drinking during all sports occasions! Bar tenders were great, but servers could be more attentive. Food is cheap. Literally- out of a box kind of cheap junk food. I have yet to find anything I liked to eat there, but I like the bar atmosphere n the bar tenders are great. Food needs improvement. I would rather go there then Buffalo Wild Wings, but BWW food is better (and that is really low quality).   Friday night at the saloon was a little crazy too. Very cramped.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QPL8UPcC-aWmJe9f8aOVyg"
  },
  "3oVsjg-C0MSAzVrknV8aAQ": {
    "date": "6/13/2016",
    "text": "I was in the mood for a hometown Saloon with great beer choices and filling food. I decided to make a quick stop in Mt. Lebanon and I just so happened to park right in front of this place, so I thought I'd give it a try.   The beer selection is on point, tons of different brews on tap and bottles to choose from. I decided on a blood orange IPA which brought my summer taste buds to life. Prices aren't terrible, but watch because you could break the bank on a few.  For a bite, I had the buffalo chicken hoagie with lettuce, tomato, onion, and a side of fries. No complaints here, there wasn't anything over the top special about the food, but it was good and filled me up. You know, average bar food.  We sat at the bar and were immediately greeted. The bartender was nice and catered to our needs, but could've used a more enthusiastic attitude.   Overall, it's not a bad choice for some beers and food. The bar has seen some better days, but I think it would be a cool place to hang with the gang to watch a game or chill after a long day at work.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rGuevqz7WCka0f4UfkHurQ"
  },
  "X6pATx9gLMA2NoI80n2tow": {
    "date": "9/21/2017",
    "text": "Slow service and below average bar food. You could tell the grease was old and overused way too many times. Also noticed the popcorn is stacked one on top of the other, hopefully the baskets are washed before filling back up...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tMiPHwYrTBYv1Ym6ZATanA",
        "caption": "Photo of The Saloon of Mt Lebanon - Pittsburgh, PA, United States. Stale wrap falling apart",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tMiPHwYrTBYv1Ym6ZATanA/o.jpg"
      },
      {
        "img_id": "DpGxB_9KuAxZ8muqYPfbtA",
        "caption": "Photo of The Saloon of Mt Lebanon - Pittsburgh, PA, United States. Stacked popcorn baskets",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DpGxB_9KuAxZ8muqYPfbtA/o.jpg"
      }
    ],
    "user_id": "IHFhket9d4a2ZS672iigDg"
  },
  "FgiKF_9T8ODPyIqh6gwzWw": {
    "date": "1/15/2017",
    "text": "Came here with my family on Sunday afternoon.  There weren't many people there but we decided to brace it anyway.  Glad we did.  The food was reasonably priced and very good.  We had burgers and pizza.  They have a tremendous selection of beers on tap as well.  The only negative was that there was a subtle weird smell when we walked in and it was there pretty much the whole time.  Hard to describe exactly.  It wasn't terrible or overwhelming but did detract from the experience in my opinion.  I'd still probably come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HnkKv1zt29aJSsVlf0S-EA"
  },
  "BiWncsPDiZFH_UNR_LFnOA": {
    "date": "4/14/2013",
    "text": "I'm giving The Saloon 5 stars because I love it there, but this is not a 5 star restaurant.  It's a straight forward, cozy, fun tavern in the heart of Mt Lebanon and it's usually busy for a reason:  they have just about every beer you can imagine, the crowd there is FRIENDLY (I know two people who met their spouses at The Saloon) and it's a good place to watch the game.  The decor in nice is very tavern-esque.  Wooden floors, walls, etc.  Its not a dive, and the ladies room is always very clean.  The wings are really good.  There is free popcorn but I'm convinced I will contract swine flu or something from communal snacks so I always pass on it.  In terms of food, I recommend anything with buffalo sauce on it.  I think this is more a lifestyle choice for me than it is a food recommendation, but its just so good!  Parking can be a challenge.  I'd also like to mention that this is Mt Lebanon.  The police there WILL ticket you for ANYTHING.  Make sure you are parked in a legal spot.  They'll seriously chalk your tires and time you to see if you leave your car parked too long in a timed spot.  So be mindful of that!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "PD3X7S70zXHeOx1NjeicjQ"
  },
  "1T1wbz1Zty6GuzqKw8uP8Q": {
    "date": "3/18/2013",
    "text": "There's two saloons in the South Hills. I was confused between Cain's and The Saloon of Mt. Lebo because they're both the \"Saloon.\" Maybe it's like the Wild Wild West and they're feuding. In any case...  If it were to that angle, I'd be hard pressed to say which one would win the shoot out. I liked Cain's because it was clean, tons of beer choices and good bar food. BUT, even though this place is a little darker, a little more \"aged\" as I'll lovingly put it... they had some darn good wings. And beer selection. But those wings. They were crispy, the sauce was tangy and plentiful, plus it was just plain hot wings and they were delicious!  So the joint looks like it may have seen some better days... if you serve me some bangin' hot wings that are making me dream about them later and a row of around 30+ beers on tap, I'm in! I'll be back to demolish some wings...",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "-k9-cuYFH3nAn7JfKwJUPA": {
    "date": "2/25/2017",
    "text": "I found this gem while traveling for business.  They have good drinks (great beer and whiskey menus) and the food was great!  I had a blue cheese and bacon burger and homemade, hand-cut fries.  The next day I ate at Michael Symon's restaurant in the airport and got the same things and it was not even close to being as good as the meal I had at The Saloon.  Kevin the bartender was a really good guy and made the experience enjoyable with good, friendly conversation.  I am not rating it 5 stars because the atmosphere is really dark, which is not my favorite.    I will be back the next time I am traveling through Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZFnmWgmRjGyzOfDLN9fhqw"
  },
  "jxk1hxs1dhu9TUxcaDxidg": {
    "date": "1/31/2013",
    "text": "I LOVE THE SALOON! It is my favorite bar in all of Pittsburgh. I used to live in Mount Lebanon and would be here at least once a week. The popcorn is like crack. I'm jonesing for some just thinking about it. I also think the food is great bar food. I've sampled my way through most of the sandwiches and burgers but always come back to the buffalo chicken sandwich with sweet potato fries. So good.   Staff is super friendly, there are lots of TVs, ample seating, and Yuengling drafts are less than $3. What more could anyone possibly want?? I have yet to find a Saloon replacement in Chicago where I now live. Every time I come back to Pittsburgh to visit family, we always stop by the Saloon.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "8JvUGKKcTfAmkTBOmUIMzA"
  },
  "q9k-elobkWY7QrCC3xjOdg": {
    "date": "10/25/2015",
    "text": "I've never had their food, but their draft beer selection is top notch. It's somewhat surprising as this is just a neighborhood bar, but they offer a variety of high quality drafts.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xwecV1wwnA_2oZH0GkpZOw"
  },
  "bL6RmVcmYX1mGBbr3glvcw": {
    "date": "8/9/2016",
    "text": "One waitress for the whole place....and it was wing night. Enough said. Food was terrible. My buffalo chicken dip had so much grease in it I had to dump the grease out and soak it up with a napkin. Gross. With multiple complaints about the food from other members of the party. And since we had a large party we were unable to have separate checks since our waitress said it would be easier for her. Not a place I would go back to, at least not on wing night. Maybe they will get more staff soon snd it will be better. Who knows.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rd5KrzbuzilVZQ5gwZPBcA"
  },
  "XYKZ8JrMoK8mMYpwMfeh1g": {
    "date": "5/30/2013",
    "text": "The Mt. Lebanon Saloon is such a happy hangout for my entire family. It's a perfect bar atmosphere with lots of aged dark wood and beer taps with fabulous selections lining both sides of the bar. There are plenty of TVs all around the bar and dining area - after all it is Pittsburgh! They offer up a big basket of popcorn (aka 'crack') as soon as you sit down. No one in our family can stop eating it until the basket is empty.   The wings are delicious and I wish I could say my favorite buffalo chicken sandwich was also still a delight but the last time I had it, somebody messed with the recipe and not in a good way. I sincerely hope this was a fluke and they bring back the old buffalo chicken sandwich.......please!   There's a wide array of burgers, hoagies and sandwiches to choose from on the menu that range from good to really good. It's bar food not fine dining but its always fun in there and the beer selection and atmosphere rocks!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2otXDEiKDqUbox4BS6uK0g"
  },
  "8TP3J2iDXRRTqgHgOMI0VQ": {
    "date": "3/29/2015",
    "text": "Went for the Wings, they were interesting.  The \"regular\"  sauce had a ton of black pepper and also parmigian cheese.  They were cooked good, but the sauce was so over powered with pepper they were hard to eat.  One highlight was the hand cut french fries, they were delicious.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kXfV1AoZ4Fh6GdK34TQHIQ",
        "caption": "Photo of The Saloon of Mt Lebanon - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kXfV1AoZ4Fh6GdK34TQHIQ/o.jpg"
      },
      {
        "img_id": "Bw5yNYEMxYjk-9sdN48HQA",
        "caption": "Photo of The Saloon of Mt Lebanon - Pittsburgh, PA, United States. Wings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Bw5yNYEMxYjk-9sdN48HQA/o.jpg"
      }
    ],
    "user_id": "1nKwjsHAOY5XzA6tUwVZ8Q"
  },
  "txIp4xVfv5WzyAvcj8hsbw": {
    "date": "3/12/2012",
    "text": "As far as atmosphere, The Saloon is a decent place. Earlier in the day, when it's dead, it has that low-key neighborhood vibe. In fact, it's so low-key that the last time I was in, it essentially became a family restaurant with a few of the tables filling up with groups of little kids and their parents after what I presume was a basketball game. Granted, that forced us to move, as our group of adults didn't want to spend the afternoon attempting to talk over the sounds of a dozen + kids, but I guess with a few video games on the one side of the bar, the TV's, and affordable food, it's not an awful option for the locals to bring their kids during the day.  The bartenders have always been really nice, and the beer selection is pretty good. With a nice pint and all of the TV's, it's a decent place to catch a game, so there are definitely some positive aspects to The Saloon. Just don't expect much from the food.   Now, yes...I'm fully aware that it's a bar, so the food isn't supposed to be great, but their food is actually bad enough that when I'm hungry The Saloon just isn't a place I consider an option unless we're meeting people there. I've given the food on the menu three chances to impress me, ordering different items each time, and sadly, the only food item that I enjoyed was the complimentary popcorn they brought to our table and/or gave us at the bar...and I'm not a big fan of popcorn.  Even something as simple as the buffalo chicken tenders I ordered last time as a fail-safe hope for a meal - after two previous disappointing experiences - scored below-average. The buffalo sauce was almost gritty, as the seasoning in the sauce was too noticeable. Talk about an awful texture. The fries are okay, but the sweet potato fries were too greasy. Now I'm sure there are people who will stand behind the food at The Saloon, but after my 3 unimpressive meals, I know I'll be hesitant the next time I'm perusing the menu during a visit. Perhaps I'll wise up and just eat at Aladdin's or Little Tokyo next door to The Saloon before heading into the pub next time.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "JiPMk9WmbJu-VfTRAKpZpw"
  },
  "PTZQbKH0uTEwQnnd1Ojlcg": {
    "date": "9/24/2016",
    "text": "Great sports bar, amazing deck in the summer and fantastic wings. Ample parking with back lot and garage across the street. Multiple rotating drafts on tap.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UIxHixfg8-qu9xNSe_0JNA"
  },
  "W81nqHWu4nL1X6uOukgDCQ": {
    "date": "3/16/2014",
    "text": "Decent bar atmosphere with dark wood and tavern like feel to it.  Being that it is a bar, I was actually surprised by the amount of families. But, a neighborhood bar to say the least. Came on St. Patty's weekend around lunchtime which meant this place was packed wall to wall. We eventually found a high top and were able to watch both the Pitt and Pens games. They have several TVs in all different angles which is really nice when it's packed and you don't really have to worry about finding a place near one single tv or anything.   It was kind of a mess, but because it was a packed holiday weekend, I'll cut them a break. The food wasn't that good at all.. I had the Reuben sandwich and my friend had a chicken salad. Yes, it's a bar, but I've had good food at several bars before. The service was also overwhelmed and really slow. You would've been better off walking up to the bar and ordering a drink on your own. Needless to say, it wasn't a horrible experience by any means, but I wasn't impressed.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Dge39vNFVUTm2rzGNqSQBQ"
  },
  "kBhLsWw13uIF3SWQdnR6FQ": {
    "date": "9/9/2016",
    "text": "The food took a little bit of a long time. But when it arrived it was great. I got chow that was reasonable price wise and the service was great. 4/5",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z-mI0i98D8FeXwvUkyQYxg"
  },
  "76rj0IvYP-fjv81Z3QQbvA": {
    "date": "12/27/2014",
    "text": "I met future husband here 12/23/09 at a girls night out when he was out with his buddies celebrating the divorce of his friend. We got married 9/20/14.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JsbnV4UfkU5so6R6ONoJYg",
        "caption": "Photo of The Saloon of Mt Lebanon - Pittsburgh, PA, United States. Saturday after Christmas.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JsbnV4UfkU5so6R6ONoJYg/o.jpg"
      }
    ],
    "user_id": "ODdO5QBv-KC3N_7SHwfsPA"
  },
  "wiQqjdqxyZyTiM1oBbKQkw": {
    "date": "7/31/2015",
    "text": "The Saloon, the mediocre family restaurant from the 1980's surviving based on locale alone.   Somehow the employees are confused - they claim it's nothing more than a bar, excusing their below par service and eh-okay food as a \"bar\", yet their menu offers more than your average family restaurant and most regular bar patrons from Cali to Europe will find the service frustrating and the offerings disappointing.  The pricing is too high, even for a bar with the quality of food and service received.  Sorry, not sorry.   This is fact for anyone that has their regular place at a real bar, where cheap pricing is served up alongside friendly cheers and hearty meals that are not reminiscent of your step-mother's microwave.  The saloon is posing, even for a family restaurant or a bar - it would be the lamest bar in any college town for that matter, The Saloon is more like a bar where high schoolers sneak in for underage drinks.  There is no bouncer nor cops on duty, even though they are located across the street, and there will be no bar fights, because - it's not a real bar.  The Saloon does not know if it's from Pittsburgh, Irish, or just some old guy's retirement fund.  Severely stale popcorn is served up alongside poorly mixed drinks and warm beers.  Management is absent, care is absent, and above all else - I am not coming back despite the short distance.  Just 10 minutes away is Primanti Bros, where I have not received lame service, warm beers, nor overpriced sandwiches made by emotionally frustrated staff.  $6.89 for a Primanti sandwich, well you'll be paying a few dollars more at The Saloon along with the huff and puff of the staff and the dim, lost souls of the local populace. Yuck.   P.S. When you see bad reviews from Floridians posted below, you know this place is bad news.  When you see positive reviews, think lost, drunk, or staff - this establishment is not worth more than two stars, even for a bar, which it keeps excusing itself as.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "SjdBTVzi5so-Z5xtMganSg"
  },
  "UCk6kzO6-fbXBFUo_xxbIQ": {
    "date": "5/10/2015",
    "text": "We are weekly regulars, as a family of four and as a couple for over the past year... so we know The Saloon from good to bad from both perspectives.  This last week, we met the \"Manager\", unrequested.  He harassed my dinner partner and myself with a condescending tone regarding a sandwich that we order nearly every visit, which happened to be just last Sunday, in which we had great service (she must have worked at a steak house somewhere and SHOULD be the manager, her name is Erika, thank you Erika... and she was rewarded with a 30% tip.  Prior to the plate landing on the table, the waitress commented on its appearance.   We both agreed with her, tasted it as per our request to be nice, and sent it back to the kitchen as she recommended it prior to us tasting it.  It came back to the kitchen in the same condition, supposedly \"remade\"... which by that time, my sandwich was cold from waiting, in which I kindly requested it to be reheated if that was possible..  We have also ordered the same sandwich from about a dozen other Pittsburgh restaurants.. we know what it's supposed to look like and taste.  Not to mention, our order was delivered wrong.  My offered sandwich toppings were not on the sandwich.  And my dinner's partner side was completely wrong.  So I complimented the waitress, I told her that she was great.  She told us that she did not know what was going on in the kitchen and that she was sorry for the third or fourth time... something that the \"Manager\" could learn to use in his vocabulary.  So after the second sandwich landed on our table, and we decided not to eat it.  My partner and I agreed to simply leave and eat elsewhere.  We were planning to pay for our drinks, and tip the waitress, and simply leave as we did not receive the food that we ordered...   Then the \"Manager\" came out.. a loose cannon that has no business even working in an establishment.  He harassed us, we showed him the sandwich, a smooshed example of their culinary art that \"his guys worked so hard on\".  He did not understand the concept behind keeping customers, \"you can get it right 6/7 times a week, but tonight you got it wrong, and we are not paying for an ill-made sandwich\".  Those were my words.  We even politely called over the waitress to mediate his attitude that had no firsthand experience in our situation.. as she was readily available for us.  She flipped her story, so the sandwich and kitchen that was off in her opinion was suddenly on their A game tonight.  I guess the three to four prior apologies from her was also none of the \"Manager\"'s concern.     He threatened to call the police and told us that he never wanted to see us again.  This was after he personally insulted myself for having a couple of light beers...as I was \"welcomed back to enjoy drinks since I enjoyed them so much.\" I told him that a personal insult was unnecessary and with that, I also advised him to attend a management school and that we will not pay for our meal.  He then harassed us more, asking us what was wrong with my sandwich.. at that point I was done.  I simply told him that we were not paying because of the way he treated us.  The staff illustrates the faces behind the business.  The Saloon would be great in the right hands, but it's in the wrong hands, run by people that may have over 30 years of ownership, but zero concern for their customers nor any competence in organizing and managing their business.  And that lends itself to a less than mediocre ambiance, low food quality, and inconsistent service... hence the 3 - 3.5 star rating seen around the Internet.  And the 5 stars... they had Erika and no \"Manager\" presence nor drinks from the bar.  Not to mention, the bartender has little competence in mixing drinks, hence the long beer list.  Save some money, fire the manager and the bartender.  After walking half a block home, we changed our clothes from our traumatizing, filth of an experience from our lovely, family friendly neighborhood restaurant, and headed to the Walnut Grill, where we sent back the sandwich only once (thanks to a kitchen error on the order), there were only smiles and no threats.  There's a reason why Walnut Grill has several locations, the ambiance is killer, the service is stellar, the drinks are mixed the correct way, and the food is just as edible the next day, because it's that great to take home.    IF the owners were savvy and recognized that they live in 2015, they would know that this review alone can hurt their business by up to 20% or more.  I hope it does.  A $8.99 Sandwich and incompetent service.. lost a tab + tip which was going to be paid.. weekly patrons.. and has initiated an interview with our dedicated lawyer.",
    "rating": 1,
    "rated": {
      "funny": 7,
      "useful": 9,
      "cool": 1
    },
    "photos": [],
    "user_id": "qLCBjWl1YvrV3QB1DIc3Ug"
  },
  "upum_O2WvivBbtGNB2TCwA": {
    "date": "3/11/2012",
    "text": "I have not been to the Saloon in years.... like 12+ years so I was not sure what to expect this time.  No complaints, but there are so many other options in the 'Burgh that I will have to say this will not be one of my hot spots.  We were meeting friends from further out in the South Hills and being Southsiders, the Saloon seemed like an ideal meeting spot.   The bartender was awesome... quick, kind, attentive and she even offered up a sample of one of the beers.  Always nice when there is service like this. We had to move to a table though since there was what seemed like a grade school basketball team there (I do not understand why parents would want to take their kids here).  Basic bar food... nothing to write home about.    Definitely probably a joint more so for locals as there is not many other similar establishments around....would be good for watching a game, playing some music on the jukebox, and catching up.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLVq7VSJBHZwqurwWoCmpg"
  },
  "Ao6p7d4-pDGaxnVGGxWeOg": {
    "date": "5/16/2015",
    "text": "If you like greasy deep fried \"food\", nonchalant/terrible wait service and the smell of stale beer then head over to this joint.. Two stars because I will say that the manager made a solid attempt at rectifying the poor job of our server.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "R76LyWlDF4r9on4uQScucQ"
  },
  "IYtMSST21eBHtV7IAD6G_A": {
    "date": "8/22/2019",
    "text": "Place gets packed on the weekends. I love the open doors on nice days, and the rooftop bar on summer nights! Perfect little hangout spot. Food is great too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S6vEDBZJl95VND0GZ-t6mA",
        "caption": "Photo of The Saloon of Mt Lebanon - Pittsburgh, PA, United States. Veggie burger. Fries were much better than burger!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S6vEDBZJl95VND0GZ-t6mA/o.jpg"
      },
      {
        "img_id": "1eckAJPVOab_ZTtahg54OQ",
        "caption": "Photo of The Saloon of Mt Lebanon - Pittsburgh, PA, United States. Italian sub",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1eckAJPVOab_ZTtahg54OQ/o.jpg"
      },
      {
        "img_id": "aZ0MBNmGVcI12v47eQ1YrQ",
        "caption": "Photo of The Saloon of Mt Lebanon - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aZ0MBNmGVcI12v47eQ1YrQ/o.jpg"
      }
    ],
    "user_id": "q7kb0GVCWOdORhOrRfkxbw"
  },
  "htysEOBli9C6wUiIjixFmw": {
    "date": "6/20/2019",
    "text": "Was in this week with a group of 4 adults and a child in a high chair. The waitress took our drinks right away and was very attentive, but it took almost half an hour before we got them. When we did get them, they forgot my husband's and our waitress had to get it herself. She seemed very stressed and annoyed with the kitchen. It took us over an hour to get our food. When it did come, my son's did not. Our waitress said that she'd put his in before the rest of ours so he wouldn't have to wait, so this seemed like an issue with the kitchen as well.  I got the steak salad, which is on the menu as a restaurant favorite, but it was very underwhelming. THey use steak-ums on their salad which are never my favorite, but this was particularly dry. The nachos were very good!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oL8RzMJFgrgahm8Ew2QeMQ"
  },
  "6lpRiKFadgkH72kz82ISPw": {
    "date": "4/30/2018",
    "text": "Fabulous family-owned and operated bar/restaurant in the heart of Mt. Lebanon. The Saloon is a staple for those who have grown up in the South Hills and continues to be for next generations to come. The warm atmosphere, extensive drink selection, surplus of mounted TVs, cleanliness, and unlimited fresh popcorn are some of the reasons this place is always packed with people. The staff is so friendly, even amongst the sea of people they are quick to serve you and your party. I truly always feel at \"home\" here, and chances are you'd be hard-pressed not to see a family or local familiar face.   They offer a full menu of standard American bar food that was just recently revamped. Tons of appetizers, wings, pizza, specialty burgers, salads, and various hot sandwiches. Just recently added the Impossible Burger! Delicious, plant-based patty that bleeds & sizzles when it cooks - totally vegan. Served with a side of broccoli. The buns and fix-ins are always so so fresh. Aside from Impossible Burger I've been able to modify food orders on several occasions, omit the cheese, add in some extra vegetables, and it's never been a problem. Food always comes out piping hot and with their ever expanding and rotating craft beer list, there's no shortage of beverages to pair with a nice meal. The food menu has everything you need and at good prices. Beer is always fresh and ice cold, with some awesome Happy Hour specials ($5 craft beer, $3 Yuengling cannot be beat!!). Open seven days a week until 2 AM, the kitchen closes around midnight most days, making it the perfect spot for late-night eats. On top of great local beers they have a full bar selection of wine, liquor, and some awesome mix-ins for cocktails.   Inside it's got the charm of a rustic old tavern, with dark-hued wood and stained glass. You'll find tons of high-top tables around the circumference of the bar, and in the warmer months the rooftop patio is the place to be. Get there early to grab a table for your party. The roof is fully equipped with a bar and bathrooms, making it the perfect place to soak up the warm weather and kick back with a cold one. Keep your eyes out for rotating specials throughout the weeks as well. Overall awesome friendly neighborhood sports bar with everything you could need to have a great time with family and friends, catch the game, or unwind after a long day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HdEM0xeldw4QAweECyOwcQ"
  },
  "lZ4EXhvgdSVev9eZEaYo9Q": {
    "date": "5/9/2019",
    "text": "As a solo traveler, I'm always on the lookout for late night dining that is safe, tasty, and friendly. Tony, the bartender, had me covered with friendly service. The Saloon serves food until 11pm I think, and they had vegetarian options (thank you powers that be). The neighborhood is safe to walk at night and was just across from my hotel. I met some Pittsburgh patrons at the bar and spent the evening learning about Pittsburgh and making new friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A073mLDQnyH-NHU87kLvPg"
  },
  "PnB27hz7Qrh4rL2KG-ozEw": {
    "date": "1/25/2019",
    "text": "A great place to hang out with some friends and grab a drink. Some of the staff is friendly but some of the long timers are a little standoffish. The food has always been a step above regular Pittsburgh \"bar\"food and the wait is never long.  Avoid at all costs when college is on break. When the college students are back it transforms into a Buffalo Wild Wings with white privilege and a need to discuss some Blue Devil's ball game no one cares about.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ncH2e2eNqfu-dNT8I6vyJg"
  },
  "u3DOYTzvTUs5eeArwk7I-A": {
    "date": "5/13/2019",
    "text": "Atmosphere, ok for a bar. Note there was only 2 regular tables, not high tops, and those are right under a tv.  Service friendly but kitchen was very slow... Went for a lunch and waited almost 45 mins for a salad and sandwiches  Food ok. Fish sandwich was clearly fresh and well cooked but a bit bland. Salad was good but the raspberry vinagrette was like an over sweet syrup.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iq_-UfNcdi7xi9oVjGfwnw"
  },
  "RoB-oRRwadsvwiDT493VLw": {
    "date": "1/28/2019",
    "text": "Overall, Typical bar food. How can we go wrong with that. Kitchen is open later than most and is generally good. Servers are a bit too inattentive. Great bartenders. Cool vibes any day of the week.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pdfqWXMmKvzfNrrQ4IIOsg"
  },
  "RXTuUsJh7Y4TVSiAHssnQA": {
    "date": "4/1/2017",
    "text": "Always good time at the Saloon!! I'm always running into people I know.... love that!! I like the age range of patrons. i've been going to the saloon since my early 20s and it never gets old.   The prices are always good and there's always seats at the bar... and if you're a table lover there's plenty of those.  The food menu has everything you need at good prices. I love the emphasis on the french fries.. they have waffle fries n sweet potato fries etc.   parking could be a challenge if you go at the height of the night but now that we have Uber it's all good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Lm1Z85LYklhOhTqb9vBLwA",
        "caption": "Photo of The Saloon of Mt Lebanon - Pittsburgh, PA, United States. french frie lovers section of the menu.. way to represent",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Lm1Z85LYklhOhTqb9vBLwA/o.jpg"
      }
    ],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "QjOiykADJy9pkdIWGpd0uQ": {
    "date": "3/1/2018",
    "text": "Nice little neighborhood spot. We stopped in and the bartenders were super friendly and quick to serve us. I had the veggie wrap... I had quite a few modifications to add other veggies and to take the cheese out, no problem! My husband had the special feature $2 tacos. He said they were tasty! The beer is always cold and fresh. I look forward to coming back again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "RkLluG0LGXiJgf2i9dGmDQ"
  },
  "NO7qD97lgM4hsZQkCsAbkQ": {
    "date": "12/22/2018",
    "text": "Always had friendly service and I feel their drinks are reasonably priced. It's a fun, local hang out that isn't pretentious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "94bs5fcaEdJnXU2QhmDRYQ"
  },
  "QH7UZpeYkdCVjEKkY82Frg": {
    "date": "4/13/2019",
    "text": "Saloon is in the perfect spot in lebo great food and drinks and i love the addition of the open windows to the bar... only thing is this place is a dark hole but the new windows help and decor is very outdated, this place has such potential to be a gold mine and hit for upper 20 age group. i wish they would remodel !!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x6HKdEb0r-0b9XVj_itqwg"
  },
  "nbI1822sYYWuV9YY19vfLA": {
    "date": "2/25/2019",
    "text": "I never really visited the Saloon except to meet friends for a beer or watch a game. The menu was stuck in the 80's for better or worse. Decor is also a late 70's early 80's game room theme; however, both the menu and interior are moving into the 21st century. On a recent visit the menu has a lot more vegetarian options (beyond fries and salad) including an awesome 'beyond burger' option. Lots of other updates to boot. It's not trying to be a vegan hipster joint and that's fine. I'm just happy they are expanding the horizon beyond poppers! They recently updated the facade to include windows that completely open to the street which is going to be awesome in the spring, summer and fall! They adjusted the seating to account for this adding a bunch of new tables that will capture the natural light from the improved windows. The beer selection is probably, no it is, the best on Washington Road. Lots of taps that rotate, but a person can still get the major brands and some great regional brew (i.e. Straub). The updates will go a long way to bringing in new customers while not offending or 'shocking' the very loyal customer base that has been calling this their own for many years. The Saloon is kinda the Cheers of Mt. Lebanon and the enhancements made will keep it so for years to come. Well done.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mIyOekSeriEs7kZ9UHGF6Q"
  },
  "xCBQRLFFRa-JpSvUjmBJWg": {
    "date": "11/27/2016",
    "text": "Not impressed. The service was terrible and the drinks were weak.   We went to this bar on September 3rd. The bar was busy and very loud. I wanted to watch the WSU vs. Boise State game, so I asked the bartender if they would change the channel. He was very rude and told me that they don't change channels (They have about 20 TV's). This was a pretty big game nationally and we finished out popcorn and went to another bar.  If you are looking for a friendly neighborhood bar this would not be it. I will definitely avoid this place on future trips to the Pittsburgh area.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4HL1brQ02bs39XN0RjQndw",
        "caption": "Photo of The Saloon of Mt Lebanon - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4HL1brQ02bs39XN0RjQndw/o.jpg"
      }
    ],
    "user_id": "0KWzswLqbzxt6TIeEW-sHg"
  },
  "q9qan83GvXofDjebopGaiA": {
    "date": "7/31/2018",
    "text": "I'm going to keep this simple. This is a cool saloon with a laid back vibe and great food. Don't believe the negative reviews. Awesome place to hang out and have a beer with a friend. The Buffalo wings are 10/10. Go here and have a great time. I'll be coming back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zVTzFhpCYaGhGv1ecibVSQ"
  },
  "EkzUvQZhiaePqCIEMy6Xfg": {
    "date": "12/30/2018",
    "text": "$25 minimum on all credit cards. Angry bartenders with slow and bad service all the years I've come here. Would rather go home, drink grape juice,  and miss the game entirely than be forced to give it try another try.  Thumbs down all around. If service is everything the saloon has............ nothing....? But at least they are the only game in town...?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VEQKsyI19DfCpb3K2KYpRw"
  },
  "-t5Frsq-Y1PeQ-zRL0vFZA": {
    "date": "12/26/2016",
    "text": "I don't know why the saloon gets a bad rep.  Growing up in this town it's the best bar to meet up with old friends and see some familiar faces. Tonight came and our waitress Alison was very nice and quickly replaced wrong drinks.  I would recommend this place as a casual get together spot where no one is gonna push you to leave.  Keep it up saloon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GVzvXwaslGKusP47T5S_JA",
        "caption": "Photo of The Saloon of Mt Lebanon - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GVzvXwaslGKusP47T5S_JA/o.jpg"
      }
    ],
    "user_id": "20wzd8uwo7ywn1Qp8fXSkw"
  },
  "R5f0QBfZLgRKQZV4bMPTRw": {
    "date": "10/14/2017",
    "text": "I came here just for a drink. Hope to come back later for a meal.   I was impressed with the layout of the bar. It's in a big space with a lot of spaces at the bar and some tables around in the sides. There are plenty of screens in easy view of the seats. This would be a good place to watch a game.   Of note, though, was the quality of the beers on tap. They have a lot of taps with many craft beers. I had an excellent Southern Tier 2X IPA, and it was only $5 (during happy hour).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dz8CFWEWuR_4S1zlZhWCMQ"
  },
  "jhlxeOkGCLcqpeE8DHXlwg": {
    "date": "4/25/2017",
    "text": "This place is one of the only places with Buffalo chicken dip, which is my main reason for returning.  The rest of the food is slightly above average.  The menu is also very limited.  I do like the bar scene however.  It is a fun place to hang out with friends.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "Ftuf7ddS162r5cXP3g_E6w": {
    "date": "7/13/2018",
    "text": "This place used to be great, not sure what happened.  We have seen many health code violations and while we tried to overlook those, we have just had bad experiences with management and staff not seeming to care about customers.  I hope things improve, because the food can be good and it can be a fun place.  Some of the staff are great and it isn't fair that customers have to have a crap shoot as to whether it will be a good or bad experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_RcSn0uRPJAl8CD2xTdibA"
  },
  "GFfYqNASoiZ_JSwjRqWBzg": {
    "date": "11/13/2016",
    "text": "Very good food and beer selection. We have ate here twice now because it is one of the few places in PGH that have Buffalo chicken dip which is our favorite. Theirs is very good. So thank you for that! The chicken cheesesteak was AMAZING. Wings & pretzel appetizer are yummy too. They also give you popcorn when you sit down which I think is a nice touch. The only reason I am giving 4 stars instead of 5 is because of the atmosphere. When we walked in it smelt SO badly of stale beer. I know it's a bar, but it was pretty bad. It was a Sunday though so they were probably super busy Saturday night. We will definitely be returning for food and drinks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eY8pzn82zhVO95vBi-mzkQ"
  }
}