{
  "Sm8WdK1-CyyMDNn30JV5_A": {
    "date": "1/21/2018",
    "text": "This is in my opinion, this is the best pizza in Pittsburgh. Although I love just about everything about Pittsburgh, we are not a pizza town. This pizza is a True New York style pie with fresh ingredients. I have been going here for a few years now and the quality is consistent. On top of the great pizza the staff is always friendly and the place is alway clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2MmX5hbfKKryAzVn8bLAHA"
  },
  "uAKl2fbvbNoUidFPcfiKEg": {
    "date": "6/9/2018",
    "text": "I am a pizza enthusiast. I've worked in the industry for years and have had probably 30 pizza shops in this city. It's this place or fioris on a good night. Don't bother going anywhere else. The sauce cheese and dough are top notch. I also love cream soda and they have some cane sugar in a glass bottle. Now I'm gonna order...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VPG7jDkIoyQZm5k5t9xQVQ"
  },
  "DwotCQ3fNO_9g4icEUyKUg": {
    "date": "4/15/2018",
    "text": "In my opinion, hands down the best tasting pizza available in Pittsburgh. Awesome staff too! (Hard to replicate NYC style pizza. ) Consider 4 stars 5, coming from a New Yorker...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aNlSS7VTZD25L5uAMJ-Zdw"
  },
  "VCUj6vOk9_511Gsz2pWBhA": {
    "date": "4/25/2018",
    "text": "Wow. Just bought a pizza for staff, as it came highly recommended. We love their pizza over at Brugge on North. Probably one of the best Sicilian pizzas I've had, ever. Holy crap, yumm. Will highly recommend. Music section while waiting is awesome and staff was super friendly. Here, take my wallet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MPSraxRflPFaGmTvLMvB7Q"
  },
  "v5WPQcam12wABm-j8ToENQ": {
    "date": "1/17/2018",
    "text": "Best pizza in the burg.  This is a Pittsburgh 10, or a NYC 8.  Really good pizza, chewy crispy crust with the small pepperonis.  Must try, no room to eat there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "E8O44KAJI8wcfKxSH09fuA"
  },
  "z4qQ6h-NmkI6Rg6CDhe_Eg": {
    "date": "1/21/2018",
    "text": "One of only a handful of pizza places I have found in Pittsburgh with True New York style pizza. Thin crust, with sauce that is spot on an not too sweet like is often the case with many pizzas around here. High-quality toppings. Have had three pizzas from here so far and have been very impressed. It can get busy as with many good pizza places on the weekend. Otherwise one of my several go to pizza joints.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hAChk8fVlyxni-3V1t_L2A"
  },
  "GqJK_m5gIA5s5n7bmVNCRg": {
    "date": "3/6/2018",
    "text": "All around an amazing pizza place! We have had this a few times and it has always been quality food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K54yUA267Jybi8blrjEOAg"
  },
  "WDMTfywOZw6wP26EyQvfyA": {
    "date": "1/12/2018",
    "text": "Pizza is awesome!  We've had both the regular and white.  Toppings were plentiful.  Now it's Best pizza in Central Northside",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VmWpFy2wKhpNDXsq0wQywA"
  },
  "MCunF7GK-OMKdSry2ZpTXg": {
    "date": "1/27/2019",
    "text": "This is seriously good, kick-ass pizza! And they make other food like greens & beans that only real dagos like me know, and know when they're good. I used to drive to Bloomfield or Squirrel Hill for pizza. Not anymore.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1UDD0NJN7XqZH2v_l8SbdQ"
  },
  "lcUYllEXzHuaTFPC2VoHkQ": {
    "date": "12/29/2017",
    "text": "So excited to have badamo's on the North Side. Easily some of, if not the best pizza in Pittsburgh! Sauces are super tasty, crust is perfectly chewy and flavorful and toppings are ample and quality. Nice renovation with some room to eat a couple slices. Service is super friendly. I'll be here often for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y20U1YyeHWuNphn_269fBg",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Y20U1YyeHWuNphn_269fBg/o.jpg"
      },
      {
        "img_id": "Is1wJSrChLUM9Z8bwUodqA",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Is1wJSrChLUM9Z8bwUodqA/o.jpg"
      }
    ],
    "user_id": "ME1-IwMQMHkowOxffKUx7w"
  },
  "jVvSLonq7K7KB5b5F3XJlA": {
    "date": "6/19/2018",
    "text": "My favorite pizza-by-the-slice.  I ate at Badamo's today after reading about it in Pittsburgh Pizza's Instagram page, and it is as good as he says. It's my favorite slice place now (sorry, everyone on Murray Avenue). And not expensive: 1 slice regular w/pepperoni, 1 slice Sicilian plain, and a bottle of water was $6.05.   Badamo's, you're out of my way, but I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9QXnLxxMOqfqIegODZ8N3w"
  },
  "te_CQbnSvS40rIbbvDeauA": {
    "date": "1/25/2019",
    "text": "Really good crust, crisp and not soggy like a lot of places in Pittsburgh. I am from Jersey and really tough on my pizza places but this is the best pizza I have found thus far in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xTahxYILuWmUe5GzWMPyeQ"
  },
  "H3sQZ7dkxm3PIpPCC9r5OA": {
    "date": "3/8/2018",
    "text": "That Sicilian square cut was [finger kissing gesture]!  They're right in the neighborhood, so the lack of delivery that other folks mentioned isn't such a deal breaker for me, especially because of how tasty their pizza is.  Haven't tried the regular crust yet because we got the Sicilian our first time, and it was so good, that we've kept getting it since!  Docking one star for the limited topping options and the fact that we've had to wait 5-10 minutes after they said it would be ready a couple of times.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "YMv6hD-8VIPu6ax4XZcEGw"
  },
  "sPlizmvpBzwcy7HyO7hjBg": {
    "date": "1/28/2018",
    "text": "Awesome pizza! Much needed on this side of town. We ordered a 16\" pie to take home- pepperoni, onion and banana peppers. The inside of the place is cute and a great place to eat a quick slice at the window counter, there are no tables. Crisp crust, great flavor. I'm trying the square Sicilian pizza next!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "wtIS-B6v0L4FGwk-2PUIWQ"
  },
  "ix1LNpU8qvzEJAa4u6nCQA": {
    "date": "11/28/2018",
    "text": "I recently moved to the north side it just randomly picked a pizza place. Boy was I the big winner! Their Sicilian pizza was some of the best that I've ever had! And to top it off they're all the guys working there were terrifically nice! When I was done eating I did something I don't normally do which was call back and tell them how great it was. They were all really appreciative of the phone calls and wondered if I'd be back tomorrow night LOL. I told them quite possibly... it was that good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZwYm3P3vvnEs3BGuptaOFw"
  },
  "G-m5ApeIzYFmbXbkMVCPAA": {
    "date": "1/21/2018",
    "text": "This is quickly becoming my favorite pizza shop. Not only is their pizza delicious and perfect, their salads are chock full of fun toppings with a homemade ranch that takes it over the top. Super friendly staff that are happy to chat away the minutes that you are waiting for your cuts. Such an awesome addition to the neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mUB_b0JtDgWneWTq_tjykQ"
  },
  "l80w5gSHSKp8Qo2DC2bzhQ": {
    "date": "9/28/2018",
    "text": "Being a Northside resident for most of my life, I grew up on Pasta Too! which was the proprietor before Badamo's. Because of my affection for nostalgia, I stayed away from Badamo's and didn't give them a chance, staying True to my memories of a pizza shop no longer around. But then, I started hearing the buzz about this place, and a co-worker of mine, who doesn't even live on the North, told me he travels all the way from the East Side to eat there. So, I went against my gut feeling and I gave them a try...and it ended up being one of the best decisions I have ever made for my taste buds! I ordered the 12' cheese steak with the works, and a Sicilian pie for the family. Needless to say we devoured the food, and I found myself back there the NEXT day, getting a single slice for myself. The food was fresh, the ingredients blended perfectly, and the staff was very courteous and prompt. I recommend any one who is a lover of all things pizza, to go and treat yourself to a real gem of a place. I will miss Pasta Too for the memories, but Badamo's has given my children to experience good Pizza on Federal St. As a matter of fact, I'm on my way to get a pie as soon as I finish typing this review....Ciao!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MAgYR9R-fv6dkEKerQWumA"
  },
  "fZRCBC2LqYfOfZYGVOoU5A": {
    "date": "3/26/2018",
    "text": "Love the pizza! It's delicious with tons of flavor ! White pizza has flavorful ricotta and seasoned perfectly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xQW1zOaqGWtPqY52xTpYig"
  },
  "my4ckIImzJKt7Y-KHpv-fQ": {
    "date": "11/3/2018",
    "text": "The way to go is the Sicilian pizza. We get the Sicilian half red with pepperoni and the other half white with ricotta, red onion, spinach, and tomato. They have excellent salads and good subs. We really like the meatball and chicken parm subs. Badamo's has become our Northside staple pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P0oNnxphq93p8bHlanaXsg"
  },
  "ff8uNLtSfSIicLL7NahazQ": {
    "date": "1/14/2018",
    "text": "Badamo's is a welcome business to the North Side! It's wonderful to have a True \"New York style\" pizza in the neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hDpJKFsPvF09inQgyXVuIw"
  },
  "Tv_CInkVT8M9GLd_POjD0A": {
    "date": "9/29/2018",
    "text": "I don't write reviews. But I'm visiting from L.A. Going to the Steelers game tomorrow.  Anyways, this pizza, Delicious!!! Owner and his workers, humble, hardworking!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZmNIRRgjCqciLpWrB32UzQ"
  },
  "S7LmiKJ4-Pg8DU6tDk-n3A": {
    "date": "10/25/2018",
    "text": "I haven't had a single meal here that wasn't fantastic. The staff is always incredibly friendly. Hands down my favorite pizza in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bpo2-ICfKs8GYa5K4JznJA"
  },
  "0Sl5ijG5NAJu7TQcdTfObQ": {
    "date": "1/18/2018",
    "text": "Delicious NY style pizza.  Crust is fantastically thin and crispy with just enough cheesiness that you get with NY style pizza.  So glad there is finally a good pizza option in the North Side.   Definitely puts Giovannis to shame.  The only critique is to not be so stingy with your toppings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tg-_tAkiRIp6TtILsJygGg"
  },
  "dAwGgI__qL2GbW5BUZHtNg": {
    "date": "7/10/2018",
    "text": "I recently found Badamo's, they have become one of my favorite pizza spots.  They offer a good variety of pizza dishes and toppings.    Badamo's is a cozy location, so it has limited dining capacity.  But where they fall short in dining capacity they more than compensate for it in delicious pizza.  The best approach is to call in advance, as the street is busy with extensive pedestrian traffic, so parking may be  a bit of a challenge depending when you visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IeLXe2mcn83C4eI0rxeoBA"
  },
  "Q5O08ODA4zpgItsiXQ32wg": {
    "date": "3/2/2018",
    "text": "Honestly: I was super excited to have a cool looking pizza joint in the Northside finally. Buuuuut.... they don't deliver, and quite frankly I don't feel that the pizza is that top notch.   It's good pizza. But then, so is Chubby's, Pizza Riviera, Doughboys, Cerasoli's, etc.   It's nothing special. I'll probably add it into the rotation if I'm near Federal and can pick it up.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "21FxvjzNEwc_MlZYQLZ2_g"
  },
  "YCq5J4E_VtZ4aN7QXLm1mA": {
    "date": "2/16/2018",
    "text": "Taste is really good, crust is crunchy.  Maybe could add more cheese to a thin slice.  Sauce is good, especially for those who don't like a sweet taste to the pizza sauce.  Definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vWlAHdQFjF4LNosgI2q4GQ"
  },
  "xNLYAQZZLGyWNo_vR48gHA": {
    "date": "2/17/2018",
    "text": "The lower Northside has not had a quality pizza spot since Pasta Too and Badamo's is located at the former Pasta Too building. I've only had the white Pizza It has a nice garlic flavor and pizza is sold by the slice which is what I prefer.   Staff is very nice and I often get a slice for me and my daughter on Tuesday's as she goes to the library which is a short distance. However my last visit the staff was playing loud rap music with vulgar language which was not appropriate and a few customers had children with them including me.   Other than that and no delivery the pizza and service has been satisfactory",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2DYeEai--Vvl0UOXD_60Bg"
  },
  "bzV-Ztj9P8y_5DWijZgxhw": {
    "date": "1/28/2018",
    "text": "Moved to the North Side about 6 months ago and we were missing a great local pizza shop.  Badamo's completely fits that bill and I'm so happy they're here.  I've only had their thin crust, but it's just the right amount of crispy and chewy while being all sorts of delicious.  The toppings are great as well.  So happy they're in the neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3EFc4FpJj_7-Rt4lqlEIZw"
  },
  "pHnsaNjwIIQENrxKTnpmhw": {
    "date": "4/23/2019",
    "text": "On the way to the Andy Warhol Museum, my stomach started to grumble so I searched for food and Badamo's caught my eye.  It's a hole-in-the-wall within earshot of Pirates' stadium, and both the Warhol and Children's museums, and definitely worth the trip; in fact, I would recommend going out of your way for this pizza.  I had the square \"upside down\" slice, which is basically crust, covered by cheese first, then topped with sauce.  The first thing I noticed is that the crust is nice and crispy, even crunchy, without being charred or burnt -- you can hold a corner of the slice and it won't bend.  The cheese was smooth and creamy, and the sauce was perfectly seasoned, with just the right amount of tang and zip to balance out the cheese and crust.  I'm not a pizza connoisseur, so I don't know if there's a name for this type of slice (New York vs. Chicago vs. New Haven vs. Maryland?) but if this is Pittsburgh Pizza, bring it on, 'cause my stomach was happy.  Bottom line - this is great pizza!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bhKPTru9Av_lP5OfNMbc4A"
  },
  "Z7ih3nLIZJeBXdQl6PIS3A": {
    "date": "2/13/2018",
    "text": "Order pizza from here... just stop what you're doing and order the pizza. I read other glowing reviews from fellow Yelpers and decided to order a pizza on National Pizza Day! We ordered a red pie with pepperoni and green peppers! After reading the other reviews, i decided to order a side of their homemade ranch. The food here did not disappoint! The pizza is traditional NY style pizza. As an added bonus, they have the little pepperoni that curls up when it's cooked! I'm so happy to have Badamos so close to my house!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "K515IDRsyrZskeKl0ydtYg"
  },
  "FmrWY6pKqxAZIPJibpIvVQ": {
    "date": "1/26/2018",
    "text": "Crispy, thin crust and all of the impulsive sides or toppings you'd want in a good slice. My favorite is the Sicilian square cut. They also do hoagies and salads, everything fresh and made from scratch and good enough to eat too fast so you end up burning the roof of your mouth and honestly you don't even care because there's another bite left and you know you'll complain about it later but is that a meatball hoagie on the menu and did that guy just order a pepperoni roll how do I get in on this I only ordered a slice of mushroom and a garlic knot??  In a city full of polarizing pizza opinions, Badamo's pizza has quickly become a top contender for Best Slice. Anthony Badamo brings all of the love and heart and taste of a solid New York style pizza joint with a supportive smile and a genuine interest in his customers, his employees, and his product.  People have been raving about the Mt. Lebanon location for years--I love it, too, but it's quite the long distance relationship for someone that lives in the city. Badamo's Pizza is doing a dope thing bringing a set of awesome standards to affordable food and expanding to serve as many people as they can in Pittsburgh. Can't wait to order here for the rest of my life, or at least until they open up a third location even closer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "xhVlmdU1sPVH6GBJw6AZtQ"
  },
  "ENGqbSCQw5Dqov23NOlNIA": {
    "date": "3/3/2019",
    "text": "If you have never had -- or are just missing -- New York style pizza, this is the place to go.  Very straightforward: go in, order, eat, and leave kind of a place... Solid ingredients and just the perfect New York slice. Kind of place you keep coming back to for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5iTdaHwTbms9D-Th3DNweQ"
  },
  "jcmVv1dmTaB94AXW0jp96g": {
    "date": "5/4/2019",
    "text": "Anthony's pizza is so good. Ladies be lining up to sit on his face. Anthony's pizza is so good. Ladies be lining up to sit on his face. Anthony's pizza is so good. Ladies be lining up to sit on his face.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T28Q6m3oXBO8E_JtrNIQdg"
  },
  "3t2lNOywPOFpxUbQ8Fzabw": {
    "date": "1/12/2018",
    "text": "I'm a Jersey native that just recently moved to Pittsburgh. Finding a good New York style pizza had been a bit difficult since moving in. I was so thrilled when Badamos opened up. After trying about a million other pizza shops in the city, this is by far the best if you're looking for authentic NY thin crust pizza. The crust, sauce, cheese EVERYTHING is amazing. Even their ranch is house made and so good.   The staff is super friendly and personable. Cannot recommend this place enough.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5n_26iYOVqIluoNW--C2iQ",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States. Their margarita pizza: fresh mozz and basil.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5n_26iYOVqIluoNW--C2iQ/o.jpg"
      }
    ],
    "user_id": "ZpRkOW3nJMCqzKVPyTvkAw"
  },
  "9YyKJiPGeKBV2sfhjpFipg": {
    "date": "7/3/2018",
    "text": "Their Sicilian pizza is awesome!! Their white pizza is also up there with any other I have had. Pepperoni rolls are tasty. The plain pizza felt like it was missing a little something but I think it's really just my sauce preference, theirs is a little sweet. This spot is my go to after work for a slice!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "ymgPMjIYBhFoNoM8Q7wsMA"
  },
  "RC84M1fPG_X2smIklLtKmw": {
    "date": "8/14/2018",
    "text": "We loved this pizza so much, we went back the next night! We were only in town for two nights and this is where we chose to have dinner both nights. My husband loved the Sicilian style, my son loved the pepperoni, and I was a fan of the white pizza. If you are in/near Badamo's definitely check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KCcexhTqJFcRj_bYcmAwaQ",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KCcexhTqJFcRj_bYcmAwaQ/o.jpg"
      }
    ],
    "user_id": "2bezEnO5fVTnZ-z4HmJHIg"
  },
  "rv2DY9dnUSa-4vw1fZG7OA": {
    "date": "1/6/2019",
    "text": "Wicked good pizza. Got a normal pie and a Sicilian. The Sicilian is more of a grandma style and that's a good thing. Dough had great flavor and chew. Sauce was tasty and just the right amount of cheese. Definitely going here again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0dz823kf_nsjMFxrcByHBQ",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States. 18&amp;#34; half pepperoni half black olive",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0dz823kf_nsjMFxrcByHBQ/o.jpg"
      },
      {
        "img_id": "yzaJYQ4gUGXpkVfl_dOO1g",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States. Cheese Sicilian",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yzaJYQ4gUGXpkVfl_dOO1g/o.jpg"
      }
    ],
    "user_id": "ovOFdZhxjz87P7Gv9AnYvA"
  },
  "w_A3UzZL9rQhdFomaTN8bQ": {
    "date": "3/24/2019",
    "text": "Will somebody please wash their hands at this establishment, not once have I seen anybody wash their hands here and the owner Anthony he picks his nose. Food is undercooked and stored improperly.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rD7tPZg98Pivqm3nQsDHVw",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States. Raw meatballs another example of how food here is not cooked properly.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rD7tPZg98Pivqm3nQsDHVw/o.jpg"
      }
    ],
    "user_id": "cQDxJAkcGhYxlzH20iZXKg"
  },
  "AU8qTTOy-_U78gaW63NQNQ": {
    "date": "2/15/2019",
    "text": "This is the best pizza place I've ever been to. Ive had the normal crust pizza and the Sicilian and been here a handful of times and I wish it wasn't so far from me. It's soooooooo delicious I have no idea why there are 4 stars while there should be 5! I went to a 4 star pizza place today because it was closer to me and I assumed it would be as good as badamos but it was so disappointing that I wished I had driven an extra 10 minutes to get Badamossssss!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4zSUUafbSeBTX0ySygCKwA"
  },
  "rp4KKsjNy_nnJd0Xld2c2g": {
    "date": "4/16/2018",
    "text": "Ok...I really love this place BUT could you please stop burning the pizzas ? Past two orders of Sicillian have been burnt. It truly takes away from the flavor of the cheese and sauce.   Please stop burning the pizzas.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "S8LIsjizMyzR-3xAqJGP0g"
  },
  "wjmQOCV_d-aFtZmQkx1wBg": {
    "date": "1/12/2019",
    "text": "Outstanding pizza. Fresh ingredients, Italian Hoagie is spectacular. Highly recommend the Sicilian slices!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6iZgjjV93Rf6Xwg2nQL0Ew"
  },
  "WnBypD4eA7Y1hEYjElQcnw": {
    "date": "4/20/2019",
    "text": "Love love this place. The white pizza is the best I've had. Salads are great and you can't beat the subs. Always fresh ingredients and friendly service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5vMoj944KlPR7A2zXaR0Bw"
  },
  "TPNEhuzeTilaOcOYX3tbbg": {
    "date": "4/14/2018",
    "text": "Really, really good pizza - and finally so close to home for me!!!  The thin crust red pizza - very traditional NY style pies - huge and reasonably priced - crust is fabulous!!!  Can't wait to try a white pie next!!!  And the Sicilian crust too!!!  The salads are huge and delicious!!! Also tried the Italian hoagie - mostly very good but I'm not a big fan of mortadella - but will definitely try other varieties!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mjumggS1MCTXydljPOJN0A"
  },
  "7kO4mBPOK30071Jk2uZgkw": {
    "date": "8/25/2018",
    "text": "The red pizza sauce is awesome! This is a great addition to the Pittsburgh pizza scene.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8ZwieHsprTixW41nUpeXKg"
  },
  "RF5wiOVs9uSz8Jt24u94qQ": {
    "date": "1/4/2018",
    "text": "Nice little shop that is primarily take out.  There is a small stand up counter you can eat at.  Staff was friendly and helpful to a few of the customers that had questions.  The pizza is thin crust with a little chew and good sauce.  Definitely a place for a couple of slices or sandwich when in the neighborhood.",
    "rating": 3,
    "rated": {
      "funny": 7,
      "useful": 18,
      "cool": 16
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "Lbt8LXdP-V_CbTcsmmETTQ": {
    "date": "9/29/2018",
    "text": "Get Square pizza. It is awesome. I hear the white pizza is the best which we ordered but for some reason they gave us the wrong pizza. It was probably the best Pizza I've ever had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q7YhbxkhiXpN9VZo0NH1lw"
  },
  "yQHNHsDArvgKNkWRK_cvlg": {
    "date": "8/12/2018",
    "text": "This place takes the cake. Favorite thin slice in the region. Crisp crust, fresh ingredients, friendly service you really can't go wrong. New favorite spot on the northside for a snack for sure. I usually don't like the square Sicilian style but this one was awesome. Almost like focaccia bread but better. Don't pass this place up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "12-PUqdni9w1TGcvZXHPCA"
  },
  "NMWJV1BtSG0I4nUxAWfOeA": {
    "date": "1/12/2018",
    "text": "Ordered a large supreme pizza. With olives on only half. And steak hoagie. Waited the 30 mins they said it would take and went to pick it up. Waited another 40 mins at restaurant to get it.  Gave me a ice cold Sicilian pizza that only had olives on one half and no other toppings that was over baked and black in a lot of places.  First and last time going there.  The hoagie was trash.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z3BYbvFyJKv17WmxxoovaA"
  },
  "37p5r76dBxEl0IFMTwn0ww": {
    "date": "8/23/2019",
    "text": "If you're in the mood for good pizza, look no further. Everything I've ever tried from here was fantastic.   I last ordered the Sicilian white and a veggie pizza. The pizzas were both delicious. We picked up our order to go, it only took about 30 minutes. The white Sicilian has some of the best crust I've ever had! The cheese melts perfectly and it has such a great crunch.   If you're looking for a sit down place to eat, this isn't it. They have a small store front, it's more of a pick up and go environment.   I highly recommend Badamo's for anyone who likes a good pizza. It's walking distance if you live in the war streets! Plus it's right next to the park if you're looking to have a picnic/lunch in Northside!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0N91KZHstHSnKwJVRa2p2g"
  },
  "unVjpx9cVoy3PwF4UxTIdQ": {
    "date": "9/17/2019",
    "text": "Nice slice of thin crust pizza right in the heart of the North Shore.   Not open as late as some of the other shops across the river, but so long as your munchies come before 10pm you should be good.   A slice of pepperoni runs for $2.50 which is really quite reasonable given the size of the slice. The pepperonis were good, the cheese was plentiful and the crust was crispy.   Will definitely be back soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5bLAro3IMbs67gfNlG70iw",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States. Pepperoni pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5bLAro3IMbs67gfNlG70iw/o.jpg"
      }
    ],
    "user_id": "Iicg8bnAevUC20LlXRNv8A"
  },
  "BREIvLPca7LqpAmNQDDeFw": {
    "date": "8/20/2019",
    "text": "Badamo's has the best pizza in Pittsburgh. Do yourself a favor, order a Sicilian 1/2 extra cheese and 1/2 pepperoni. You'll have food for all weekend, so be prepared! The staff is very friendly and always on point!   Another highlight is pizza by the slice, if you're not looking for all weekend pizza!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "802Ja9_DSzCi5jQUZm4udg"
  },
  "e0ymiwG_SFUhqYcvo5EoKw": {
    "date": "7/6/2019",
    "text": "Good pizza overall. It has a thin chewy type of crust which is not my preferred crust type but it is still good. A little oily for me but that is how most people prefer their pizza. I would also like to have a little more tomato sauce in my pizza personally but a lot of people prefer less sauce.   It definitely is a pizza where you would finish all of your leftovers even if it is not your \"type\" because it is still well made pizza; I just tend to prefer Chicago style pizza more than New York style myself. What stands out for me is the flavor. I particularly liked the flavor of the sausage and mushrooms together when added to the pizza. They give you a nice selection of toppings to choose from and the toppings are higher quality than other pizza places. My partner really liked the garlicky flavor of the white pizza and the ricotta cheese and tomatoes they put on top.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cgecfJZ46npwKX2iOIbVWg"
  },
  "scFf3eNaK_voguAOpBhEaw": {
    "date": "1/12/2019",
    "text": "I should start by saying this is my wife favorite pizza place. Badamo's is a small place with no seating at all has some small areas with countertops you can stand and eat if you are staying. I had ordered 2 pies to go for a party for my wife. By the time we ate the pizza it was warm at best. The pizza was ok definitely not the best I have had. The staff were very super friendly and service was fast. I would try Badamo's again and eating it when it is fresh out of the oven as I might give it a better review at that point. I was not that impressed overall with the pizza itself It was just ok. I will probably go back again as it is my wife favoritisms place. I I go back and the food is any better I certainly will update my review.",
    "rating": 3,
    "rated": {
      "funny": 20,
      "useful": 32,
      "cool": 21
    },
    "photos": [
      {
        "img_id": "uNTnE4oyqMrPdnAynMzzdw",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uNTnE4oyqMrPdnAynMzzdw/o.jpg"
      }
    ],
    "user_id": "hg71CGHy9bwpgY8cGVVg4w"
  },
  "NHlE0zntwWO9shaBkSzHbQ": {
    "date": "12/29/2018",
    "text": "Wow. Went to the original location in Mount Lebo last night, and I was craving their pizza again so we HAD TO try out the North Side location for lunch today.  The North Side location is smaller, without any seating, but with bar space you can stand at and eat. I saw pictures of their salad on Yelp and knew I had to try it; we ordered a small salad with chicken, a half steak hoagie and 3 slices (one pepperoni Sicilian, one margarita Sicilian, and one white regular slice). This was all ordered for takeout. We were waiting for a few minutes, but nothing out of the ordinary, and one of the employees offered us 2 additional complementary Sicilian slices to go because of our wait. Great customer service!  When we got home, we realized they gave us way more than just two complementary slices. We initially ordered 3 and ended up with 7 slices! Let me tell you, everything was phenomenal. The salad had a great variety of ingredients, and at a good price point. The steak hoagie was pretty good, but wouldn't necessarily be my reason for going to Badamo's. Their slices, both regular and Sicilian, are unreal! They have a good crunch but are nice and soft throughout - the perfect piece of pie in my opinion.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xiDPGLYVjS3WkOsmuJhdwQ",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States. Pizza display counter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xiDPGLYVjS3WkOsmuJhdwQ/o.jpg"
      },
      {
        "img_id": "Wpm8EwaOwrVwQmhuHM7mDQ",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States. Small salad with chicken and balsamic",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Wpm8EwaOwrVwQmhuHM7mDQ/o.jpg"
      },
      {
        "img_id": "5kyn2TFriTwwOGnQD8Y9vA",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5kyn2TFriTwwOGnQD8Y9vA/o.jpg"
      }
    ],
    "user_id": "nOatY-nz-cUQgZKa9TbHTw"
  },
  "dzej0eSb13RhDicvvtnxdw": {
    "date": "5/28/2019",
    "text": "The location is pretty small, it seems it's a takeout spot primarily though they do have some space along the wall to stand and eat. The staff was friendly and the prices are reasonable. We had the margherita pizza. It honestly wasn't very good, their tomato sauce tasted more like spaghetti sauce on the pizza. Would definitely go back though and try something else the next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eZGAC_nYkKzbFycSuAJjWQ",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States. Margherita",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eZGAC_nYkKzbFycSuAJjWQ/o.jpg"
      }
    ],
    "user_id": "0KhRPd66BZGHCtsb9mGh_g"
  },
  "O5jnHZxsNuehZ1hevqmSgw": {
    "date": "9/10/2018",
    "text": "Pittsburgh Pizza  not exactly words that conjure up good pizza  have no fear Badamos is AWESOme as in Capital P  its a teeny little shop right on Federal St street parking might be a challenge depending on the time of day don't give up find a spot ok there are no tables but there is a high counter you can eat at they have various pizza types  including grandma and white  and of course regular good old fashion pizza. service is always friendly my slice was right on NY style perfect with a thin crust just the way I like it  they also have good soda choices cream soda in a glass bottle and a perfect slice for 4 dollars you can't beat that for a perfect lunch. we have also ordered full pies always perfect I am going with Badamos possibly the best pizza here in Pittsburgh",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ci4VbUoX4fzSviZ5d-ZGPA",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States. A yum slice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ci4VbUoX4fzSviZ5d-ZGPA/o.jpg"
      }
    ],
    "user_id": "k55-QGGiZwKI0l6mY2w_lQ"
  },
  "svaF5OYIXEbkE4TzZaWi2w": {
    "date": "3/2/2019",
    "text": "Just as I love the Mt. Lebanon location, I love this one as well.  Always top quality pizzas with an amazingly flavorful sauce. Everything is cooked to perfection and I've never had a subpar experience here. Never.  The North Side is certainly lucky to have Badamo in their midst.  Not a sit down restaurant. There's a small area to stand and eat but I suggest doing takeaway to be able to sit down, relaxing and pigging out on these pies.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "Vx8tmV0Mp0FL76cel3z0QA": {
    "date": "7/13/2019",
    "text": "Sicilian & white pizza was very flavorful and tasted delicious.  This place is basically take out.  There is a small ledge where there were a couple people eating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UnhmExl2i8UMb4yg941y0A",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UnhmExl2i8UMb4yg941y0A/o.jpg"
      }
    ],
    "user_id": "m2uTGkOKcXqQJSmvsYvtMg"
  },
  "L6hwo1Gi0R87nWqAyD993A": {
    "date": "5/18/2019",
    "text": "I visited Badamo's Northside in the evening. Some of the pizzas had clearly been sitting out for a while, but the white pizza was glistening with that fresh out of the oven look so I tried a slice. Wow! Certainly one of the best single slices I've had in Pittsburgh... ever! Layers of excellent flavors and textures, chewy stringing pizza cheese with blobs of smooth rich ricotta, then you reach the tart fresh cherry tomato bits and the garlic sauce, then the toasty crunchy crust... it all comes together well and it's beautiful.  If you've been raised on great New York pizza, no it's not quite at that level, which is why it gets 4 stars from me and not 5, but it's darned good! I think the best time to go is when they're busy at lunch time, and definitely go for the pizza that's fresh out of the oven.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "989O-qZsZvVKt4Ue9Rm2rQ"
  },
  "huTXVhPACDhlLal-6rIRwQ": {
    "date": "10/30/2018",
    "text": "Five freaking stars. Everything has aligned with the world. Pizza in Pittsburgh is a hot topic, at least for me. Most places that used to sling a good pie are kind of mediocre now and new places are usually better than chain places but not amazing. Cue the Badamo's Sicilian pie. Sometimes Sicilian pies in Pittsburgh have too much crust (aka not like my grandmas), and sometimes they're too chewy and don't give enough crunch to the crust. But omg this was perfect. Not tooooo thick and not doughy with a perfect sauce and cheese. Oh and LITTLE PEPS. Gotta love a place with solid little peps. Seriously though, best $20 I'll spend this week.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Ta27OWjzB5zYNIlBGRih6g",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States. Sicilian with pepperoni",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ta27OWjzB5zYNIlBGRih6g/o.jpg"
      }
    ],
    "user_id": "tJiWkQtxSmr4UdfEp-EYHA"
  },
  "daT6uOcZVaf9l2252sVMTg": {
    "date": "7/19/2019",
    "text": "My favorite place to order pizza on the Northside! I've never been disappointed. We really enjoy the white sauce pizza with chicken and mushrooms. The salads are also very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "B19GhPyFxVT87-33_Z5gLQ"
  },
  "KQDb4H_kblD6zrf4acGuAg": {
    "date": "8/31/2018",
    "text": "I had heard great things about this place, so during lunch I decided to walk over to see if all the hype was real. I used to go to this building back in the 90s when Pasta Too was there.   Now I love pizza and have tried most places downtown and in the North Hills. Let me just say the pizza is really really good. First of all the atmosphere with the exposed brick and area to see the pies is great. I got there around noon and fresh pies kept coming out of the oven in many varieties. It made my decision very tough to pick 2 slices.   The front counter and chefs are very friendly and explain what they have. I went with 2 slices of Sicilian, 1 pepperoni and what sausage, both were corner cuts as requested. The sauce, cheese and topping ratio with fresh basil is excellent. The crust was charred to perfection and not doughy at all.   I added a Boliyans cream soda and settled down at the stand up bar yo feast. I was full with the first slice but still managed to get second slice down.  I will definitely be back to try their sandwiches and calzones and obviously more pizza. This is a gem on the Northside and the staff, atmosphere and great food make it worth the trip.  Went back again Friday to try their salad and a plain slice.  Place was packed, cashier was still very efficient. Ordered the small salad with tuna and a plain slice. Let me just say after eating the salad first, I was full (hate to see what the large is like). The salad ingredients were great and hot tuna on top very tasty. Had the slice last and again it was outstanding. The cheese to crust to sauce ratio was great. I think I have found my new place to frequent a few times a week",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ibzoqwEJn5SOW6UHFg_toA",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States. Plain slice, simple and so satisfying",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ibzoqwEJn5SOW6UHFg_toA/o.jpg"
      },
      {
        "img_id": "woFf3O6peYhG6zotaQ7edQ",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/woFf3O6peYhG6zotaQ7edQ/o.jpg"
      },
      {
        "img_id": "SXUfs8DPd8lOU4E66SmVSg",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States. Grampa B",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SXUfs8DPd8lOU4E66SmVSg/o.jpg"
      }
    ],
    "user_id": "cA8_7apjrrZouRuVwNZgFQ"
  },
  "YijWMK_r4e1kbtEv8-gF9A": {
    "date": "9/5/2018",
    "text": "Okay..so an update. Its been 3 days since I tried the sicilian pizza....and yeah, I'm craving it.  So it was good.  The only reason for 4 stars is cause the regular pie fell short of expectations.  Didnt realize this is the same pizza place that is on Washington Rd in Mt Lebanon.  I prefer thin or regular style pizza. But I tried the sicilian style and its excellent. I'll never get anything else now. And quite honestly I'm pretty sure I'll be craving it.  They sell slices - which is so awesome!!!! The sicilian slices are ample.  The crust is not heavy at all...it reminds me of the crust I had in Italy. The sauce is definitely tomato forward and isn't a sweet sauce. Really good - fits perfectly with the crust and cheese.  Definitely, definitely delicious",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SHyWxJxb-mKiNgHPUSu3_g"
  },
  "i4fsusZY5AYQmXSEa0bpYg": {
    "date": "7/11/2019",
    "text": "Good place to eat... definitely not a sit down restaurant but great for ordering or picking up.  If you like Sicilian pizza then you'll love theirs. Slices come in around 3$ but are decently proportioned, two slices will definitely fill you up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qmmjxWWEZ2YDk43V5M9mjQ"
  },
  "5mU1TS5iuLmvXq8n8B99Gw": {
    "date": "5/11/2019",
    "text": "The best pizza in Pittsburgh without a doubt. New York style pizza with great toppings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "hhjgjhu3m0Pe-dcacZ_taA"
  },
  "90qXVFwp6pV0sT5CrMc2aA": {
    "date": "8/11/2019",
    "text": "Yum.  Get some.  I love this pizza and since I can walk to get it makes it even better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WBWBB9fLZ7ialgUSPf9d7w"
  },
  "gjGr_IfL0YmfoiUdSFm-gQ": {
    "date": "4/24/2018",
    "text": "I can already tell you that my pizza in my backseat is going to be absolutely phenomenal. I had a piece of the Sicilian white pizza while I was waiting for my pizza to come out of the oven, and it was absolutely fantastic delicious pizza.  The folks behind the pizza counter: super nice, super cute, a little flirty. I like it.   I'm definitely going to be a regular, super happy that this spot exists on the northside, a much-needed addition. Everything looks super fresh the storefront is super clean and well-maintained, parking is no issue out front on federal, and the hoagies the guy was putting together behind the counter looked really good too.  For the slices they put out, they have a three topping rule, which I think is a sure sign that these folks know what they're doing, after three toppings it's like a garbage disposal pizza.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "09PrH0ZkraAmfOSyCu48Gw",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/09PrH0ZkraAmfOSyCu48Gw/o.jpg"
      },
      {
        "img_id": "rdUBQ6HDF85HWN2EYOmF7g",
        "caption": "Photo of Badamo's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rdUBQ6HDF85HWN2EYOmF7g/o.jpg"
      }
    ],
    "user_id": "ub62tDwXuUiS6cDiWPHCNw"
  },
  "c7j_sjy2MhsOpHk33bKV9g": {
    "date": "12/10/2018",
    "text": "What an amazing pie. I got the white pizza and it had peppers, tomatoes, and ricotta cheese atop it. It was one of the best white pizzas i've ever sunk my teeth into. I am so excited this place is just down the block so I can easily go get it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "rWZ43o97skQXb4Hk9V1pHw"
  }
}