{
  "K3RSebvip9HG52HoQGH9HA": {
    "date": "9/20/2012",
    "text": "Way overrated. This is basically like subway wrapped in pita bread. Won't go again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G9L_vwzpRqM_1E9slkRQRg",
        "caption": "Photo of Pita Pit - Pittsburgh, PA, United States. avocado pita",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G9L_vwzpRqM_1E9slkRQRg/o.jpg"
      }
    ],
    "user_id": "ZNzCguGqrXUHc7F39DxcGw"
  },
  "mYg_Sv_y4Rg3ii3z94gRXA": {
    "date": "7/21/2014",
    "text": "I work down the street, so when I do order food, this is usually my go to. It's one of the few places that I haven't yet had a bad experience with. Fresh ingredients, delicious combinations, and they deliver!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GAeutek-rDK-Rr7GTS7_Bg"
  },
  "-tsodp_grSNCXzDJICeHOA": {
    "date": "5/7/2014",
    "text": "I went to Pita Pit for the first time using a Groupon deal.  Although I wasn't too impressed with the atmosphere (slightly unclean), I was quite surprised by the food itself which was quite tasty.  And that is even AFTER a 25 minute drive home before digging in!  I also thought the staff was very sociable and made a great recommendation for toppings on my Philly Cheese Steak pita (I know, I know...not the healthiest choice).  Groupon or no Groupon - I will be back!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oJ9l3P0gXEACrSlg-ROBeA"
  },
  "UjmM2YAtXmHVTjrhB0t6_w": {
    "date": "1/19/2016",
    "text": "Defiantly really yummy way better than subway and way more options!! I ordered delivery and they messed up my order, I called and they said they would credit it idk how, so hopefully it will be credited. I will for sure eat there again !! Just wish they had artichokes and sprouts & they would be solid",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MOiK3-dQCGoLNHe9XQnyiA"
  },
  "qjiYYutrlOKDlFsjfAi0Pg": {
    "date": "8/31/2010",
    "text": "OOO Pita Pit...how you make me park illegally outside of your establishment for your delicious pitas...  Cheap, Fast, Easy, Delicious  Pros: HUMMUS is Yummus.  Grilled (warm) turkey on a salad makes it taste more like a meal and less like rabbit food, also you can have them grill your veggies for a sneaky way to get double veggies.  Great selection of veggies and sauces/dressings. Fast. Healthy. Outdoor seating.   Cons: Very limited options for a side besides chips and a cookie. No soup? No Fruit? Come on P-Pit!   Overall: Great Spot for a healthy lunch in the Southside! Somewhere you can actually eat during the busy lunch hour without having to box out other 9 to 5ers.     FYI: Hummus is extra but if you don't get cheese its free!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "IKnLl7SbuP0u6HS34jwHhw"
  },
  "Er2Y3FLLs_6vDjPYVVrYwg": {
    "date": "6/4/2011",
    "text": "This place is amazing.  Their food is sooo fresh, seriously, the freshest spinach ever. Not to mention their feta too, it is the best!  I often go in and order a chicken pita with spinach,  feta, cucumber and tzatziki. Simple and delicious, especially after a good workout or run.  Yum, this place makes me hungry thinking about it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EOJwlTPy7gy485rOchz5aA"
  },
  "VtxDNJ96DFeqEzJYaGRl6A": {
    "date": "8/19/2015",
    "text": "I was sincerely hoping for something super tasty at this spot near my new home, but was a bit disappointed.  I would say it's somewhere between 2 and 3 stars.  Yes, the veggies are fresh and there are lots of them-spinach, red and green peppers, jalapenos, cukes.  However the olives are canned.  I had the chicken souvlaki with veggies and let's just say, it's not Chipotle.  And there was very little chicken-I felt like I was on an expedition.  The place was clean and at about 6PM there were only a couple of people in there.  Also, the folks who wait on you are just as friendly as you would hope.  I just wouldn't go out of my way to get a pita here which is more like a smallish burrito.  And yes, it's inexpensive, however for almost the same $ you get more and tastier at someplace like Chipotle.  However I might go back and try something else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z79yVa08rPPugXlg4z7FgQ"
  },
  "BOeZOsduP7K7HsLC56qqMw": {
    "date": "5/2/2015",
    "text": "Great hummus and falafel veggie pitas!! The food is awesome and ingredients tasted fresh. We ordered ahead of time and picked up  so can't comment about the service but the one thing that struck me was the person who checked out didn't make eye contact or smile. Someone else behind the counter did say have a nice day though, so it's not all bad. I would go back for the food though.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nq1Lh90G1g1l8e2w269Hkg"
  },
  "yvYYkhHKQifM8zzEGb7uAw": {
    "date": "10/3/2011",
    "text": "Sorry, but it's overrated to the max! I normally don't review fast food chains, but I'm totally confused by all the extreme positivity here.  The concept? They take a pita and stuff it with whatever you want. It's kind of like Chipotle in that sense (or Subway, I guess? I've never been to Subway nor have I had a desire to), except without the streamlined assembly line convenience. What makes no sense to me is that you pay first, upon deciding what meat you want. It's also at this point that you must decide if you want anything that costs extra or has to be cooked, like hummus or grilled onions. Then after you pay, you get to choose the rest of your toppings. Why? Why not do what just about every other fast food establishment does and get all your options out of the way BEFORE you pay so you don't get stuck deciding you want to add guacamole at the last minute and having to get back in the register line to give them a couple quarters? It's such a simple little thing, but it really bothers me.  Also, I've been to this location on multiple occasions and everyone who works here always looks like they are in serious need of a hug. Why IS that? Where do they find these people? Maybe they post Help Wanted flyers at grievance support groups? Seriously, as someone who works in customer service, nothing bothers me more than an employee who does not smile and greet a customer. It's really the easiest part of your job, yet it makes a huge impact. Again, SIMPLE things, but things that leave an impression (at least on me).  So Pita Pit...work on your operational model and hiring practices, and I could be alright with you. Until then, the way you go about your business will continue to confuse me and I'd rather not bother with it.  PS: I realize that I barely mentioned the food, but it's just that unmemorable. Not bad, per se, but their cold, dry pitas are whatever. It's fine if you just want healthy fast food and you happen to be in the Southside, but I wouldn't go out of my way for it.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "zFCuveEe6M-ijY1iy23IJg"
  },
  "aihlPHVZawfA-E3Qh-qpWg": {
    "date": "4/14/2014",
    "text": "Sometimes I forget that Pita Pit always pisses me off and I go back there and then a few visits later, they remind me. Ostensibly they should be vegetarian friendly, but they will occasionally put grilled meat all over their work space and then drag my vegetarian pita through it, causing me to have to throw it away and waste money and food (and I get that eating out is always dicey, but this is pretty egregious when it happens). Today it was the other thing that annoys me, when I get a vegetarian pita and they give me only minimal vegetables. Here it is two hours later and I am starving because the dude filled the pita as though the veggies were a condiment to a meat, except there is no meat in my pita. With just a few tweaks they could be awesome, but they mess up the little details.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R5sDDIv_SQp9E5AU_sSYoQ"
  },
  "bJYNp8wub0Iq4OqU6e1LXQ": {
    "date": "10/5/2008",
    "text": "For the best simple, cheap, and delicious meal you could get around the South Side Works, go to the Pita Pit.   I know, I know, this is a bold statement for the area that's home to the Cheesecake Factory and other pretty decent restaurants. But, sometimes you find yourself around the South Side Works area walking around and shopping and all you want is to satisfy a hunger. You don't really want a fancy shmancy meal; you especially don't want to drop one or two Jacksons on dinner. You also don't want to waste good shopping time on eating. You look around the area and your pickins are slim.   Trust me, head over to the Pita Pit. For those of you who don't know what it is - basically, it's Subway on Pitas. You choose your sandwich and then you go to the condiments area and choose your toppings galore. It's got a way better selection than Subway! And, I actually really like their veggie options like hummus and falafel (beats the one selection of Veggie Delight)  Even if you do stumble in here because of my \"quick, easy, and cheap\" recommendation, I assure you the next time you'll go into the Pita Pit just because it was so good the first time around.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "qDgApqioN9qReeLiNytQqw"
  },
  "DeUcA8FAxLEqGX9DhkaQ4A": {
    "date": "4/18/2012",
    "text": "Pita Pit is delicious and healthy if you want, all at the same time! Hummus? YES PLEASE! A bit overpriced for what you get, but DELICIOUS. I will be back. Again and again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "49SXsLMeH_Py2vC8F9ZHRg"
  },
  "kNzmm_kUbs5--7MKfVpv3w": {
    "date": "9/4/2011",
    "text": "Pita Pit is a more interesting version of Subway, to me. You can pick from a variety of meats, cheeses, veggies, and sauces. Its inexpensive and tasty.  The staff was friendly and made the experience even better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "djSJ6a9gsLSdj-7BoyNNQA"
  },
  "O9-_wgXayUMlPaMBcl94Mg": {
    "date": "8/15/2008",
    "text": "As I've mentioned in other reviews...  I am picky as hell when it comes to eating.  There aren't many things I like and once I hit upon things I do like I will happily eat them over and over and over ...  much to the dismay of my husband.  So we're currently living on the sah'side right around the corner from this place.  We've been here maybe 3 weeks...  eaten here 5 or 6 times.  I love the hummus with tzitziki (sp) sauce and cucumbers on whole wheat pita.  Probably not the most normal combination but I am weird that way and could eat this every night for the rest of my life.  The turkey is also really, really good.  They serve it hot and it tastes just like thanksgiving turkey, not lunch meat.  Yummy!  Pitas are always nice and squishy.  I hate hard pitas.  It's kinda like subway but different enough that it's a nice change of pace.  The only thing I don't like about it - and the reason my husband won't actually consent to eat there every night - is they have no kid's menu.  There is a sign inside that says \"Ask about our kid's menu!\" but when we asked, the guy looked at us blankly and said \"Just order something with cheese, or something.\"  The problem with this is my son has a habit of eating the inside of his sandwich and that's all.  So paying full price for a sandwich he only eats the inside of doesn't sit well with me.  If your kid actually eats the sandwich it's not a big deal.  The place isn't exactly kid-unfriendly, it's just not budget friendly if your kid won't eat it all.    Love this place!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BBLpIfJSBQPKT-KgcUm6Zw"
  },
  "GHx0zcbp1fFW10sxHs-SDg": {
    "date": "12/9/2011",
    "text": "Basically a it's like subway, except instead of bread, they use a pita pocket.  Good place to eat healthy, for relatively cheap.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5KxItvWCOxiKbDgfpv9Lkw"
  },
  "HXp_jlVmcLcb1OX3zKM2Hw": {
    "date": "2/25/2017",
    "text": "Ordered on yelp. Pita was made quickly but amount of meat in Gyro pita was pretty awful. About 75% at most of what you would expect. 50% of Mike and Tony's gyros.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "31o6O1oRKHfHqQz3u1pwMA"
  },
  "KW88xUllpd1FwlS40b7iaQ": {
    "date": "2/20/2018",
    "text": "Loveeeeeeee this place!! Wish there were more around! Food is fresh! Options are great & nothing like it around! Highly recommended it! People are down to earth & the selection is way better than a subway or any other option like it! The meals are quick & fill you up on the go with many options for toppings !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PjRMeVg3oTTnHPlThVw52g"
  },
  "7ViY55o54k7Zi5u1QWYHMg": {
    "date": "4/20/2017",
    "text": "Very amazing and upfront about the allergens in their food. I can't eat soy so I was able to eat the chicken souvlaki with tzatziki sauce on wheat pita with veggies. So delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w8_5V5gBKObqkzlZv-09zQ"
  },
  "B2BmwmKEXNNwg-4wBaRieg": {
    "date": "6/10/2016",
    "text": "I created a Yelp account specifically to review this place. I work in the SouthSide and over the past year the quality of the pitas at Pita Pit has gone downhill significantly.  It started with the pineapple not being fresh a couple of times I went.  The last time I got pineapple on a pita it actually tasted fermented.  I chalked that up to lazy minimum wage employees and improper dating and continued to go to Pita Pit but have not ordered pineapple since.  All other veggies and toppings have always been fresh and crisp.  I've been to Pita Pit 3 times since the pineapple incident and have gotten sick that night EVERY. TIME.  The last time I went there was Tuesday.  I got a Club and the bacon was not cooked the whole way through and my entire pita was warm, not hot like you would expect a cooked sandwich to be.  I watched the cook douse all the orders on the flat top with tap water from a squeeze bottle 2 or 3 times and I believe that employee considered the meat cooked from the steam without actually testing for doneness.    Needless to say I will not be returning to this Pita Pit.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kVsjGlDPhOnjkAup4YQ36Q"
  },
  "FUdhne_GMwrDm66wzwmOaw": {
    "date": "7/9/2015",
    "text": "Good place for a quick lunch. It was my first time here just a little before the lunch rush. I wasn't sure what to order so just went with the chicken Caesar pita. It's pretty much the same set up as a subway just with 'fresher' ingredients and instead of sandwich bread, they fill up your pita pocket bread with additional ingredients.   They charge extra for certain ingredients. You can either choose the hummus or the cheese, otherwise you have to pay extra to get both.   I loaded up my pita with hummus, spinach, peppercinis, jalapenos and olives.   It was pretty tasty. Very filling too!  I'd go back if I was in a hurry!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gdTAebkameev_DQq_NCZzw"
  },
  "Ymb8ZYPg2e8dvqhdj3Gkqw": {
    "date": "10/26/2016",
    "text": "The ingredients are always fresh and I like that I can customize everything. The price for the pita/salad is reasonable, but after the delivery fee of $3, it can be pricey. Definitely a great option if I forget my lunch at home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hHFSpKcnDtJOs6M-JKFZ8Q"
  },
  "eDHVM_zn8W5Hx5n3OAcLrg": {
    "date": "8/8/2016",
    "text": "Pretty awesome falafel! Great option for vegetarians. At around $8 not bad. Super fast to. I usually order ahead with grub hub and pick up 10-15 min later",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O5LfqtWCR1ZzO5UevJ3oJQ"
  },
  "R3HHa-sO-JD8XkzGKDmx4w": {
    "date": "11/5/2012",
    "text": "I tried Pita Pit for the first time a couple years ago when I received a free gift card from work. I was flustered from beginning to end--- I handed the cashier my gift card as payment, and he just thought it was some sort of promo card. He then asked for my debit card, which I passed over. When I questioned him why my gift card did not run, he was very perturbed and snapped at me when he had to cancel and re-do the transaction. Then, I ordered the Gyro, which anywhere else would not require much description. Well, I was confused by the fact that I was asked what I wanted on my Gyro (um, the usual Gyro ingredients?!) and that Hummus costs additional (which is not ever mentioned at the register when ordering the Gyro).  Maybe I've never gotten over this initial experience, but I have yet to truly enjoy Pita Pit. I think the Pitas are over-filled with meat and sauce and under-filled with vegetables. Though initially tasty, I always feel very ill after eating here... I only plan on returning when I get dragged here yet again by a co-worker trying to avoid the other two chain options on this block of East Carson.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cCke3VtFLtqgzkgYSrSE2g"
  },
  "7DVyTcB-eeudVv-WAea0Lw": {
    "date": "8/24/2017",
    "text": "Great food for the cost. The ingredients are always fresh. The staff is very friendly. Definitely recommended for a quick meal",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9CsetdlWA2IbEIuaua0mDA"
  },
  "9ZHMURoRwIEZq1y0jvGt7Q": {
    "date": "4/17/2014",
    "text": "Truly the worst customer service I have ever experienced. The employees walked around aimlessly, never smiled, talked extremely quietly unless they were discussing sports between themselves, and treated my guest and I horribly. I even tried to thank them at the end of the night as we were leaving and they completely ignored me. I suppose they were very busy watching the TV they have in the corner.   I contacted Pita Pit corporate about this, who forwarded my very detailed explanation of what happened to the franchise owners at this specific location. Dennis Manning, co-owner of this location, responded by dismissing my comments due to my admission that the food was good. He assumed, \"based on my timeline\" that my food was created within 5 minutes of the time I ordered it and that somehow makes the horrible visit perfectly fine in his mind? He proceeded to bash me for saying that I felt uncomfortable based on what he calls the employee's \"poor interpersonal skills\". What a disgusting attitude to have toward an honest guest.   The place was extremely dirty with tables askew, wrappers everywhere, and dirt all over the tables.   I am absolutely certain that a different Pita Pit would be good, but this one is awful. The food was good, and the idea behind the Pita Pit itself is great too, but the fact that the employee walked over to the register and blankly stared at me with all-but a scowl when I initially entered was ridiculous.   I wish I had never gone here. The employees made me and my guest feel more than just uncomfortable. They made me feel 100% unwelcome. It left a terrible taste in my mouth.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "srKfRJciEukIvZazLQadbQ"
  },
  "NgjTW9-nD6uKTkOJUEbOhQ": {
    "date": "3/19/2014",
    "text": "Think \"Subway\" but way more awesome. The Pita Pit has delicious fresh ingredients that you choose to go on whatever style pita you want. I had the chicken crave and added a bunch of tasty veggies. Filling and fairly healthy lunch. I think I'll add the Pita Pit on a regular lunch rotation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYTpi63Tv_UTjsaTMCZUvg"
  },
  "IGF-Foy0rJvVSFqIIcmkIw": {
    "date": "8/10/2016",
    "text": "First time visiting and I have to say I'm pretty pleased. Food was really good and really a great value - around $7.00 for a pita was that was stuffed rather full and a medium fountain drink. If I ever find myself in the area again and need a quick and filling lunch this will definitely be a top choice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y4d5JQ7CAZDFNMY_WYEFbg"
  },
  "IVvdN54OTXDCFFpyG0rZZg": {
    "date": "2/15/2016",
    "text": "I love this place. I work one block away so I get to come here all of the time for a quick, healthy and delicious lunch. The staff is friendly and often remembers my order which is always a nice touch. The pita fillings are fresh and crispy and I love that they cook the meat in front of you while your pita is getting stuffed. In the summer they set up outside seating which is prime people watching!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jCerZmbitsWZsHKIe_VbKw"
  },
  "QPzuO5c2Ya5xwlA94RyfoQ": {
    "date": "7/17/2017",
    "text": "5 stars for kind service and 5 stars for food! Prior to this day I had never been to Pita Pit, so when I entered I was pleasantly surprised that there was a vegan black bean patty. The feng shui of the place isn't the best (the line of four people had looped around this random pillar), but as soon as I got to the front and the cashier asked if I wanted my vegan patty microwaved instead of on the grill with meat, feng shui was the last thing on my mind. They have so many vegetable options, too. (I'm the type of person to get as much as possible, and just trust that it will taste fine). I stuffed mine with spinach, pineapple, mushroom, bell pepper, and avocado. Absolutely delicious! Will come back if I'm ever on this side of town again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-wChmsRI9Uh8WkYm6kelIQ"
  },
  "Ho-hEmUSEqR-5SRkPHUS0g": {
    "date": "3/5/2014",
    "text": "I love this place! They have a ton of healthy options and delicious grilled meats. Tons of veggie options, and if you don't like pitas, you can always get your pita turned into a salad! Don't forget the avocado!  I would give the place 5 stars, but the staff often leaves you waiting for several minutes before they serve you. The line is usually empty, as is the restaurant. A certain employee seems to usually have his head up his you know what, and makes it seem as if you are being an inconvenience to him. Other than that this is a good place to eat. A good alternative to Subway.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jzuV62GK7z5ty_s06-RGiQ"
  },
  "bbjGrZ87X99I9mQHlYAifg": {
    "date": "10/24/2016",
    "text": "This place is great and has surprisingly great cookies, too. Big portions and good flavor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u1NkSJSmABkbYxFaXR-JLA"
  },
  "swrn2jkdvrNhc69Sc1BRhQ": {
    "date": "5/1/2016",
    "text": "Ask for the double chicken. It's the best. They pile on the toppings. I love it. Great post workout meal! Perhaps a tip may be to provide a value card for folks! I frequent the place and wouldn't mind receiving a free pita here and there! Overall, great shop!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "m5s9XVp0M0QGdCtCOjJmjg"
  },
  "OkV6esbc5cmq__JWEybP4A": {
    "date": "9/10/2014",
    "text": "Pita Pit is my favorite \"fast\" food!!! The workers load your pita with all the good stuff and there is no extra charge unless you get extras like baba ghanoush. I usually order the chicken souvlaki on whole wheat pita with alfalfa sprouts, baba, and other vegetables. It is so good!!! The workers are always friendly and willing to make your pita everything you want! Pay parking is available on the streets, although you could park on a residential street and walk if you didn't want to pay to park. I ate in a couple times but usually order out. The restaurant is spacious and almost never busy, which is nice if you don't like crowds or loud noises while you eat. I love this place and give it 5 stars! The price is right, the food is awesome and the service is great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "13URNpJQPWwXehKYaEvLkA"
  },
  "yejnesHzQ4rGyrNmQjkk3g": {
    "date": "7/8/2015",
    "text": "Service is always fast and friendly.  Food is fresh and of good quality for the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hTcqNOtVrP28Ksj4hr5M4A"
  },
  "P8qi24Hptc7gRx75AO9TIg": {
    "date": "3/5/2014",
    "text": "A healthy alternative to fast food they offer fresh poultry and various grilled meats with a variety of delicious veggies packed into a pita pocket.  The staff is generally polite unless you come in during their down time then they make it seem like you are inconveniencing them but the quality of the food overshadows the service, This place rocks!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jQgzL3_p6jJnpI7f-2o7Xw"
  },
  "0m5bDUfafZ_hzKwIHQUHoA": {
    "date": "8/6/2019",
    "text": "I got the sriracha chicken pita and it was delicious! The young ladies that work in the south side location are really friendly and you get your food quick! Definitely recommendthis place to eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eVpgMlHxMFJrluC2BADZMQ"
  },
  "3nsxt9VjWKxHQdZv5AVhOg": {
    "date": "12/13/2018",
    "text": "I started working close by and decided to try the Pita Pit.   I was immediately surprise by the options and flexibility of the menu.  They have several pita sandwiches they offer.   What surprised me was that if none of them appealed to me, I could make my own.  Some go-to's that I heard were ordered while I was there were: - Cheeseburger - Gyro - Chicken Ceasar  I decided on the Chicken Thai Pita.   What I expected was a taco shaped sandwich on Pita bread (yes - I am a rookie).   No... What I got was more in line with a burrito.   They cut the pita and shove all the goodness in the middle and wrap it up.  The Pita - my Chicken Thai was very tasty.    It reminded me of Panera's Chicken Thai Salad but inside a warm Pita.    Everything was freshly made (chicken grilled in front of me, fresh fillings assembled in front of me).   The pita had great flavor.  You can get a regular or bigger version.   I went with a bigger version.   They offer chips, cookies, and soda/water (similar to Subway).  Great experience, friendly staff - I will go back",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wzKju7wtyXlD5dD3alRnYg",
        "caption": "Photo of Pita Pit - Pittsburgh, PA, United States. Gyro Pita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wzKju7wtyXlD5dD3alRnYg/o.jpg"
      },
      {
        "img_id": "UlSiD51xGz6t3CiX-PiyXQ",
        "caption": "Photo of Pita Pit - Pittsburgh, PA, United States. Thai Chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UlSiD51xGz6t3CiX-PiyXQ/o.jpg"
      }
    ],
    "user_id": "JgOcyMF1lTwSVCarSZrrrA"
  },
  "yp11CRf8Lsi1yKN8R3qlEQ": {
    "date": "8/3/2018",
    "text": "I have absolutely no complaints about Pita Pit. It's been years since I've last had it and decided to try it out again, and thankfully I was not disappointed!   I had the buffalo chicken pita and it was delicious. Not too spicy, just spicy enough! I got it with lettuce, tomato, banana peppers and pickles. Also added feta cheese and ranch to make it perfect.   Can't really comment on the actual place or service because I ordered it using my Urber Eats app; however the order was exactly how I had asked for it, so there service must be up to par! Will definitely have this place again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y_W7DqTkLQ-8LBpd2A1Qag"
  },
  "j5UPafcB_eFzWO4yhbwEEQ": {
    "date": "5/30/2018",
    "text": "This was my first time eating at a Pita Pit even though they are part of a chain.  We are fortunate enough to live near a mom and pop place that makes fresh pitas and we usually go there but we were in the area and decided to give Pita Pit a try.  I have to say that I was very pleasantly surprised.  My husband got the Mediterranean Chicken pita and I got the Caesar Chicken Pita.  I liked how you could pick your toppings.  They were wall fresh and the chicken was cooked fresh.  The way the ingredients to in and the way the sauce is put in makes it where you get all of your ingredients in every bite.  The staff was super nice and even gave me a bowl of water for my dog.  We took advantage of the outdoor tables and enjoyed a nice lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "_5owsXLpwY8uUiat88bSyA",
        "caption": "Photo of Pita Pit - Pittsburgh, PA, United States. Chicken Caesar",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_5owsXLpwY8uUiat88bSyA/o.jpg"
      },
      {
        "img_id": "y9A1utFlCeSXDCIfQDpPag",
        "caption": "Photo of Pita Pit - Pittsburgh, PA, United States. Chicken Soulvaki",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y9A1utFlCeSXDCIfQDpPag/o.jpg"
      },
      {
        "img_id": "9x2vv_b54IIY9xseQqrtZA",
        "caption": "Photo of Pita Pit - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9x2vv_b54IIY9xseQqrtZA/o.jpg"
      }
    ],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "jOeEIwZIgSTRBQPOvNNFQw": {
    "date": "2/12/2018",
    "text": "After a morning spent thrifting at the Goodwill across the street with my mom, we were starved!  Pita Pit was nearby so we decided to give it a try.  We walked in totally lost but the staff were incredibly helpful and explained all of our options to us.  We thought it was super tasty and loved that you could create your own.  This was on a Friday around 1 and it wasn't crowded.  We sat and ate our meals there which were standard tables, nothing fancy.  Super easy and quick, and we didn't feel bloated afterward.  Next time we go thrifting, we plan on stopping in!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "agGWDhkVvIHaf8w16jLTng"
  },
  "bRVK5HDUwoEs-YREHFVdSw": {
    "date": "2/1/2019",
    "text": "Great food and the employees are always extremely helpful and friendly. I have also ordered from this Pita Pit location using UberEats and they are very fast at delivering the food. Would totally recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eO0P_L2t8HcDwHtCHCaADg"
  },
  "__yKr_7gL0dK8MA1yFlSqQ": {
    "date": "2/20/2017",
    "text": "I live super close to Pita Pit but this weekend was my first experience at the south side location. I had been to the downtown location before it closed a few years ago.  I actually came here twice this weekend. Saturday I stopped in for dinner and ordered a small club (turkey, ham, bacon-grilled) I loaded it up with lettuce, mushrooms, tomatoes, carrots, pepperjack cheese and ranch. It tasted so dang fresh omg. I craved it the next day for lunch and ordered the same thing.. only a regular this time. Both times the staff were nice to me.  The bathroom smells odd though. I warned you.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "h00yzSfT0ZM1c7V88vlkNw": {
    "date": "10/3/2017",
    "text": "I see why it doesn't get 5 stars. It's basically a pita-themed Subway. I got the falafel and they asked, \"Microwaved or Grilled\", which probably shouldn't be the best way to introduce customers by using a microwave as a selling point. Overall, it's perfect for a quick bite, nothing amazing, but not bad at all. I would recommend this place for an easy in and out lunch or to grab a good, pretty healthy portable snack or dinner. I roll vegan once and a while and this works, as Pittsburgh cuisine and vegan don't usually mix. But, if you aren't picky, it's worth it.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "AdB_8MuvPKlRi2r2lzoyXg"
  },
  "aH5WBDn0zGHYnPejSdCbUw": {
    "date": "7/23/2017",
    "text": "First time = 5 stars, I will surely be back and update the review accordingly - but based on my first experience:   Firstly, shoutout to Postmates - which allowed me to have Pita Pit delivered, which was definitely a perk. -- (NOTE: THIS REVIEW DOES INCLUDE A DINING IN EXPERIENCE)   My wife and I ordered two pitas, one had steak and the other had chicken. Both were absolutely loaded with what you could tell is high-quality, fresh ingredients. I ordered the chicken caesar and highly customized it (which is another huge perk of the Pita pit, the customization options). I loaded mine with veggies and it came with an equal amount, fully packed with these fresh ingredients -- I was stoked.   Super flavor and honestly fresh tasting ingredients will cause me to come back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Udn9c66i7CUCq1NwxUt05g"
  },
  "Wlm1BchHnUx3ostcKZpt0g": {
    "date": "1/27/2018",
    "text": "Pita Pit is a favorite of mine. First time stopping at this location, and we had 12 of us in our party.  Wonderful service, fresh/vibrant food and toppings, and overall positive experience.  They didn't even get mad when we pushed a bunch of tables together so we could all sit together.  Thanks for a great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ggG8YTW5ju4JqlXFLZNo8A"
  },
  "_sG2KHPCZfH_zmcWs2te4g": {
    "date": "1/23/2018",
    "text": "It was okay....I ordered a buffalo chicken pita but it didn't have any sauce.   So it was essentially a grilled chicken pita.    I also ordered a salad to eat later, and they delivered it all to my hotel.  WITHOUT utensils.  Really?  It should be known that if you are delivering food to a hotel, the customer, 100% of the time, needs the proper means to eat it.    Food was decent, but for the price of the food plus delivery, and the fact that they didn't bring utensils and the buffalo chicken wasn't really buffalo chicken...it kinda sucked.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FHPWfx-iwG_PffjF37fwMg"
  },
  "IhP3TOnkcax4QrHFKfUqpg": {
    "date": "5/8/2015",
    "text": "I have never been in Pita Pit, but Carnegie Mellon catered Pita Pit in for some kind of speaker one day.  I didn't attend the speaker, but there was remaining free food.  Score.  I had a gyro pita and some kind of steak pita.  The gyro one was definitely better.  A few reviewers have said this is healthy, but I don't think these are really \"healthy.\"  They're healthy like Subway is healthy, you know?  The veggies were crisp and fresh, and the wraps were a great size.  I have no idea what the cost was so this review is strictly on taste.  Would I trek over to the store to get the pitas on my own time?  Probably not.  But Pita Pit is good for a catered lunch if you need that kind of thing.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 7
    },
    "photos": [],
    "user_id": "Ic6-gs1_FjrWGx6JIr95Mw"
  },
  "TsbdjV9FZFNymVvmqyddWQ": {
    "date": "7/17/2018",
    "text": "Employees looked as if they were chained to their stations.  The least they could do is smile at the fact they're gainfully employed",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R0A1G6obtj_FdI6yGnWMSw"
  },
  "CguTYj7la9A2_8m36UC_5w": {
    "date": "12/9/2017",
    "text": "This is an updated review on Pita Pit. I'm writing this review as a warning. As a lover of Pita Pit, I chose them for delivery through Postmates a couple days ago without hesitation. I got the gyro (a Pita I get frequently) and my mother in law got the chicken. My Pita was fantastic as always. My husband didn't order anything because he was somewhat sick and didn't feel up to eating a whole pita, but he did have the last couple bites of mine. This is where everything went wrong. A few hours later I am having intense stomach cramps, chills/sweats, and problems with my bowels. I toss and turn all night with stomach pain. The next day there is BLOOD in my stool. I research all my symptoms and it's all matching up with E. Coli. My mother in law didn't feel sick at all, but me and my husband are both feeling crummy, and I'm left with a bad taste in my mouth (and gurgling in my stomach) from one of my favorite places. What a shame :(  PLEASE PITA PIT - wash your hands, cook all meat thoroughly, and make sure your veggies are still edible.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uIgv9cfd0KAODrXIlDQoyw"
  },
  "p88Dg27K16Wwkl84ugoOwQ": {
    "date": "7/30/2017",
    "text": "I've been here a couple times for lunch and got the buffalo chicken pita. They're always very quick here which is convenient. The staff is always friendly. The quality of the chicken is decent. No complaints at all. They're chocolate chip cookies are really soft and taste homemade if you're looking for a snack! I'd come back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "jV_xAviAhrL1-96-kHx-Yg"
  },
  "Ai-BGs-VBxbtb72Js_yDUw": {
    "date": "7/21/2017",
    "text": "Always super friendly staff. I love that I can create my own pita. Healthier option that always fills me up and tastes great! Will keep coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EqYnJ1tQ2skADrqFYq3RIQ"
  },
  "UPW7tFodQ37IhJoI_3HojA": {
    "date": "6/8/2018",
    "text": "Food is ok but worst cashier in town (Long blonde gentleman) disrespectful and not professional at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2DH51_JZbUZfXHpvCtEKzg"
  },
  "TGAdp3YIt0sQPaYCtSbhQg": {
    "date": "3/27/2015",
    "text": "The Pitas are good here and prices super cheap. It good for a quick lunch or dinner on the run. Nothing fancy but I consider it the \"subway\" for Pitas. Stay out of the bathroom though! It was so dirty and smelly when I was here. Go somewhere unless unless it is an emergency!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "99LM-uA8BGpl5a1Zlkj_PA",
        "caption": "Photo of Pita Pit - Pittsburgh, PA, United States. Giant pita!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/99LM-uA8BGpl5a1Zlkj_PA/o.jpg"
      }
    ],
    "user_id": "mm9WYrFhiNqvHCyhQKw3Mg"
  },
  "JXbcoaONOsqDoOM22-4G2A": {
    "date": "3/1/2016",
    "text": "I think I'm going to start coming to the Pita Pit more often for lunch as I was in and out very quickly. The only thing is that for some reason (to which I can't put my finger on), the menu feels very limited. They told the man in line before me that his next pita was free, not sure if there is a rewards program, but if so I was not offered to join.   This visit I ordered the chicken crave with extra cheese with a white pita. I opted for an assortment of veggies, pepper jack cheese and the jalapeno ranch. I was very pleased with my combination.   What I like so much about Pita Pit is that it still has that same sort of Subway taste but the ingredients and the quality tastes so much better.   4 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Pe5eoZvuQYif9-jPfrFSTQ"
  },
  "VKnfndM2q3iDDBRYgTTdUA": {
    "date": "9/28/2017",
    "text": "I hardly ever order pita pit, but looking through Grubhub and seeing it pop up, my first thought was \"hmm that sounds good!\" I ordered a pita with teriyaki sauce, and after biting into it, I quickly discover that it is DRENCHED in tzaziki sauce (gross!). When I called the restaurant and asked them for a refund, they told me that they can make me a new one with tzaziki (yes, make it exactly the same way...wrong) or to call Grubhub and then hung up on me. Now, as someone who works in a restaurant that uses Grubhub, I know it is protocol for the restaurant to call Grubhub to give a refund. Even the girl who works for Grubhub customer service asked why I'm calling and they aren't! I keep trying to give them a chance, but this is three times now that my order has been messed up. Either they aren't paying attention to my order, or someone is just deciding what I want/don't want for me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Da3KllVC78wI0tde_uVGHQ"
  }
}