{
  "3n9O6SwlgYOvEvw9xp9m6w": {
    "date": "12/19/2015",
    "text": "We have been coming here for years and have tried almost everything on the menu. Always good food and service. The draft beer selection is small, but we come here for the Harp and Smithwicks. Tonight I had a Reuben and my husband had the shepherd's pie. Excellent as always.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vL503s1sl9XlJmjgqdCgtQ"
  },
  "bx7YjKCXJy77BY9dsEYH5Q": {
    "date": "6/22/2015",
    "text": "Brought my family here for Father's Day.  Was expecting more based on the reviews.  We had the Kennedy Irish Stew, Shepherd's Pie, Chicken Pot Pie, Fish Sandwich and Steak Hoagie.  The stew and both pies had a sour taste to the base stock.  The Irish Stew was particularly sour.  I thought it was supposed to be based on Guinness beer but I've had other Irish stew's based on Guinness and they were rich, flavorful and a little sweet.  This was very sour as stated.  Service was good and the staff were very friendly.  This being Father's Day I expected the place to be packed but there were only about a 15 people there including our party of 6.  Wish the food was better because I liked the place and the staff but I'm sure I won't be returning.  Sorry!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qce1uwz2gi2f-8gw36f09A"
  },
  "AqwExkM7FazzGF2uJQCVCw": {
    "date": "8/29/2014",
    "text": "Our family has eaten here several times over the last few months. Each time we tried a different item on the menu and have enjoyed everything. One of our favorites is the shepherds pie, and the hamburgers.  Would eat there more often if we didn't look like we are trying to move in. Love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RZ3byPx6SO194CrG58IGWA"
  },
  "0HHvaQbgwPwXZQGMhY05lw": {
    "date": "12/18/2013",
    "text": "Good, depending on what you get.  Stew in a bread bowl, amazing, but not available on Tuesday.  Bangers and mash could use some work.  Pierogies, good, but pricy.  Funnel cake fries are fricken crazy awesome!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OcIFpzBcRMMFa2d-bVFAxw"
  },
  "-BRv_L4UH_j_tTGO460TKw": {
    "date": "11/9/2014",
    "text": "I ate at Sieb's Pub for the first time today, Nov. 9 at 1 pm.  I had the open-faced steak sandwich with coleslaw which was excellent.  They asked how I wanted my steak cooked and I told them medium rare.  The steak came to me exactly how I wanted it.  I can't wait to take my husband there!    I saw as I was walking out that they have all you can eat crab legs on Wednesday's for only $24.99.  I can't wait to try them.    J. Wenzel",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RWSTNIznbG1YesNYtUtzCw"
  },
  "PmrmhpeC7f9v_X_d5oCbYQ": {
    "date": "12/29/2010",
    "text": "This place has good food, good service, good atmosphere. Mondays and Wednesdays are All You Can Eat crab legs. They recently raised the price though, but it's not too bad. Especially if you can devour plate after plate of crab! The soup is really great here too, and even comes with the All You Can Eat crab. It can get pretty packed around dinner time, but so far I've never had a wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ryz2Vk10V7z-yfOJhwJjzg"
  },
  "EO7MBpEw92p7YPtqktepNg": {
    "date": "3/16/2012",
    "text": "Horrible place.  We waited 2 hours after putting or names down.   The owner who is a blond over weight woman sat her personal friends down before us twice.  She claims they take reservations but they don't.  They keep people waiting while they continously seat their friends.    Place is a complete joke.  Bad service and the sons mom told me to f off.   Very unprofessional place and I will never come back here",
    "rating": 1,
    "rated": {
      "funny": 8,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "KYYirsvrkd60I3yun_o36Q"
  },
  "Dv9Tse-s_LC2103bJwMVzQ": {
    "date": "10/25/2013",
    "text": "Huge old fashion hamburgers, Pittsburgh style. Prices are affordable. I was there on saturday night and guess what? Live music. Awesome! I'll recommend this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kb5Q6pC-CIS98s6_vLxajQ"
  },
  "MK-doQdaSMXOcBxcZDvUtQ": {
    "date": "4/19/2015",
    "text": "I'd like to thank the Sieb family for all of their assistance in a very difficult week. We had our post funeral luncheon here. They were able to help us on 3 days notice. The food and service was very good. Their kindness that allowed us to not concentrate on getting the details together were excellent. The banquet room on the 2nd floor has huge windows that filled the space with light. The desserts were fantastic. We hope to go back during happier times. This would be a great place to have a wedding or anniversary party as their was ample parking, and for some of our attendees an elevator to the 2nd floor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DPLeub9_wleSuFAAivhQdw"
  },
  "_J-SD1WPAcVFEtwZ9OxBEQ": {
    "date": "12/6/2014",
    "text": "They have the best bar tenders in the North Hills but they do not have a great selection of draft beers. High quality food and affordable prices. An awesome family owned and operated establishment.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "upzN3HJ9QobeCVZUOnofdQ"
  },
  "3jI8WQpjDREx6tkzAZpe9Q": {
    "date": "9/9/2011",
    "text": "The chicken pot pie is soooooo good!  It comes with a flaky, buttery crust on top.   The broth is creamy but not too rich.   Everything was excellent, great service and the people are friendly.  This is my new place to eat.  Want to check out the music on Wednesday nights.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y4yoxDTQ1djwyCmgGG8-0A"
  },
  "_sGfunpPeOejuntWzd212g": {
    "date": "3/31/2014",
    "text": "Terrible  customer service.  Rude  20 something  bartender (Ryan)  who  was miffed  that  we wanted to return a  \"sour\" glass of wine  and insisted that we would have to pay for it anyways. He  then overheard a comment I  made to my wife about his  attitude (I said he should probably be  carrying  bustrays and not be behind a bar). He reacted to his comment by  saying  that he would  \"come over to the other side of the bar...........\" .  reported this to  manager/owner and she  completely dismissed me.  It was as if I was in the wrong and was also told that no \"free\" drinks  are  served and  everybody  likes Ryan.  Furthermore,  mgr/owner  said that she could care less if I ever came in again.  Unbelievable.    BTW,  I am  middle-aged- so what a classy move by the  young  bartender to  want to \"fight\" me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5s8gUjXaRprTM_nv9VmoAA"
  },
  "dFLQFFvDaYGOMIIb1uw1ag": {
    "date": "12/6/2016",
    "text": "My first time at Siebs and it was a good experience. Fish sandwich and fries were good. Service was good. Cool atmosphere. Pub chips w ranch are super good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o9dWTABB-KODn13CZw44CQ",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Home made fries were delicious",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o9dWTABB-KODn13CZw44CQ/o.jpg"
      },
      {
        "img_id": "kOevNG6XidP2doJYFuqW6Q",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Fish sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kOevNG6XidP2doJYFuqW6Q/o.jpg"
      }
    ],
    "user_id": "pVQnE9DyNJ--Txg72AjT5w"
  },
  "eVouF3IA0zqKsNhXUQc1iw": {
    "date": "6/28/2015",
    "text": "I have been to Sieb's a few times now when over in the north hills.  Each time I am always impressed. A very hometown friendly atmosphere. There is a bar area and a dinning area. The menu is very diverse with everything to Irish specialties,bar favorites like burgers and Pittsburgh style salads.   I have ordered a grilled chicken salad which had a mixture of iceberg lettuce and mixed greens with grilled chicken fries and cheese on top. I chose the ranch dressing which was great and I think homemade.  The chicken was fresh (not frozen) and the fries were hand cut.   Most recently I ordered my favorite thing on the menu a chicken pot pie! The presentation was great and the taste was even better. With a flaky crust and a flavorful filling. The chicken was lean and fresh and again it was obvious this was no frozen entree. This is the reason I will be going back to Sieb's pub anytime I'm in the North Hills!I have been to Sieb's a few times now when over in the north hills.  Each time I am always impressed. A very hometown friendly atmosphere. There is a bar area and a dinning area. The menu is very diverse with everything to Irish specialties,bar favorites like burgers and Pittsburgh style salads.   I have ordered a grilled chicken salad which had a mixture of iceberg lettuce and mixed greens with grilled chicken fries and cheese on top. I chose the ranch dressing which was great and I think homemade.  The chicken was fresh (not frozen) and the fries were hand cut.   Most recently I ordered my favorite thing on the menu a chicken pot pie! The presentation was great and the taste was even better. With a flaky crust and a flavorful filling. The chicken was lean and fresh and again it was obvious this was no frozen entree. This is the reason I will be going back to Sieb's pub anytime I'm in the North Hills!  Another perk was a good beer selection. I love Rivertowne brews and they had my favorite Pineapple Beer!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MThTQnCaFZKxx0xdsvdeog",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. The Chicken Pot Pie with hand cut fries.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MThTQnCaFZKxx0xdsvdeog/o.jpg"
      }
    ],
    "user_id": "fvkqLZdP5RYkqZw4tw-WDw"
  },
  "uWZ56XEs3zEIt2QdDWIurg": {
    "date": "6/14/2018",
    "text": "Have been meaning to try this place for years and finally did a few weeks ago. Very cool Irish pub with tasty bar food and friendly service! I mean it really feels like you're at a pub! I would definitely eat here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q5id8l-8neWf78rbe0qbeA"
  },
  "6wtenqnQQULmndAYAMEwjg": {
    "date": "7/9/2017",
    "text": "Really nice place to enjoy a sunny evening. We were able to sit on the patio, which has lots of seating. The BLT salad was perfect and my daughter had grilled cheese. It came with ice cream, which she enjoyed. Our waitress, Kelly, was friendly and accommodating. We will definitely be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "hHFSpKcnDtJOs6M-JKFZ8Q"
  },
  "Eryu0Sr9pngbeQ-k9j0t-g": {
    "date": "3/10/2018",
    "text": "Great selection of beer on tap and really good menu/food.  Plus, bartender was very nice and a pleasure to talk with",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XPI3F0ceiLZJ7n7EhKJBfA"
  },
  "KTWPdbkYODRWgrn-OAY5wA": {
    "date": "5/17/2016",
    "text": "It's affordable with nice staff, but the food was so-so. Had the Guinness salmon with a baked potato.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JJEWQxngKjZ7xVgrgDWGqw"
  },
  "NPGcv6puYA8f8HJ4z7RSGA": {
    "date": "2/24/2017",
    "text": "Yikes. I don't know what to say here. I ordered a philly cheese steak. Waited 30+ minutes, and that's okay. BUT... what a disappointment. A HUGE hunk of bread with maybe one slice of steak-um ( I'm being generous here)... a miserly slice of cheese, maybe a SLICE of green pepper. A few onions. I threw away the thigh-sized hunk of bread. Seriously, I could have made a more delicious sandwich in my countertop oven. Big double YUK. My wife tossed her salad, too. $50 I'll never see again. On our way to Mickey-Dees to fill up. Service was nice but is that what you go out for? Never again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QGqScY1JdtDe5cAWyvYmyg"
  },
  "C7NDTU9xPYwsXAAvOpt4XA": {
    "date": "10/27/2013",
    "text": "Always on the lookout to try somewhere new, Sieb's Pub fit the bill.  We stopped by on a Saturday afternoon during off hours.  Lucky for us, we got one of the pub tables in the bar area.  The place was over done on fall decorations.  Totally over the top.  They have a really cute little patio area, unfortunately with fall weather, the time for that is over.  The menu has lots of choices including steaks and seafood and BBQ ribs and pasta dishes.  They also have Irish choices that include Bangers & Mash and Shepard's pie.  We were eating light, so I got the Fish & Chips and BJ got a steak sandwich with  onion rings.  While, I was not a big fan of the fish, I loved their fries, onion rings and BJ sandwich.  He ordered it medium rare and it was served that way.  Service was fairly attentive and friendly.  I think next time we will be trying the burgers.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tIjAPz2XGqbFFwI9XQ5NaA",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Steak sandwich with onion rings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tIjAPz2XGqbFFwI9XQ5NaA/o.jpg"
      },
      {
        "img_id": "xJt6Uv2eobY0ck97b7zQ1w",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Fish &amp;amp; Chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xJt6Uv2eobY0ck97b7zQ1w/o.jpg"
      },
      {
        "img_id": "6RB68O7ZUbDP4E3X6EDyyA",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6RB68O7ZUbDP4E3X6EDyyA/o.jpg"
      }
    ],
    "user_id": "H5d_nFqzwrREE-YduK2ABg"
  },
  "jYQPMLsbF-zMcaxOj9n35w": {
    "date": "5/28/2017",
    "text": "We go to siebs about once a month and have always felt comfortable there. Great food and great service. Usually have someone playing live but it's never overwhelming. Overall it's just a great neighborhood bar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w6IAJg8jRsocIs6CnFyJqQ"
  },
  "gvrtqQbKsJ_RnxZd23z62g": {
    "date": "3/24/2017",
    "text": "This place is amazing, the staff is great, the owners treat you like a king, never had a bad meal here yet,, we've been here about 20 times, Great neighborhood pub, one of the few that are left, can't say enough about this place,, they also have entertainment every so often live music which is awesome and sometimes you'll find the owners sunny singing,, Great time me and my wife enjoyed it tremendously,, I recommend this to everyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WKifGDgIpCG5gBh0LPzAUw"
  },
  "0_5snKs7e45IgMQwRw4T4Q": {
    "date": "2/11/2017",
    "text": "We had a banquet of 40 people and they did an outstanding job with food quality and impeccable service. It wasn't until we left we discovered the catering manager was the owner himself!!! What a great time!  Above and beyond expectation Mr Sieb and Kari we salute you! Outstanding",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bv6HtHJlwEz4eSnwKgZBWw"
  },
  "wi63YT57ascGckxieP8ndQ": {
    "date": "2/2/2017",
    "text": "Sieb's Pub has been a local favorite of ours for years. The family always treats us well and is very accommodating. We always sit in the bar area which has a traditional pub feel with the dark wood and exposed brick. It's a must try if you like old school Irish neighborhood pubs.   Bucky plays live music every Wednesday during happy hour. He is phenomenal. The music is played at the right volume level. You can still carry on a conversation.   Last night we had a few beers and some appetizers during happy hour. I highly recommend the pub fries.   Great atmosphere Great live music  Great food  Great bartenders",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wZHDuKQaxVoVnIdxQiYu6g"
  },
  "wU_8rn2qTCZe20rB0KHxog": {
    "date": "12/31/2016",
    "text": "First time here but it won't be the last. Great friendly atmosphere,  attentive and friendly wait staff, good food and live music.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qcXALjinQ795wmbhWXVGzg"
  },
  "AbdAzNvboDCeVNtohcNIlg": {
    "date": "7/4/2015",
    "text": "Recently ate here for the first time and will definitely be back.   We stopped in around 8 for dinner and the pub side had a few people but wasn't crowded.   Our waitress was extremely friendly and answered all of our questions.   The atmosphere is all things Irish which  I love.   Everything we had was good - small fish sandwich,  shepherds pie, and Southern Style BBQ soup.   That soup was fantastic.   There was good music and everyone seemed friendly.   We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IRnKY6KdBrJKDvPplEGrvQ",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Cheese stuffed pretzel",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IRnKY6KdBrJKDvPplEGrvQ/o.jpg"
      },
      {
        "img_id": "VNGBZ472wWZnbUq2m0z_4g",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Southern Style  BBQ soup.   This was delicious!!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VNGBZ472wWZnbUq2m0z_4g/o.jpg"
      },
      {
        "img_id": "c5m8dNtPSwkuY4bGv2Aiyw",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Small Fish Sandwich with fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/c5m8dNtPSwkuY4bGv2Aiyw/o.jpg"
      }
    ],
    "user_id": "sXg_Ied_7N6FwKeOO42z5g"
  },
  "Vja2jq-EO-dl3JZWir2yNA": {
    "date": "8/9/2016",
    "text": "Decent bar; if you want a Guinness and a laid back middle-aged atmosphere this is a great place to visit on a Friday night. The bands hat play here communicate and have fun with the crowd due to the size of the bar area. I have had fun at Sieb's.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LzZPZDlXiEv9adPzdN4gzw"
  },
  "y1llao11HqyDzFH2fb3daQ": {
    "date": "11/19/2014",
    "text": "Came here on a Friday night with my parents.  Had about a 20 minute wait which we were informed of and then were seated promptly in the dining area next to the pub.  Our server was the owners son.  He was extremely attentive, honest about the menu and funny!    I had the guiness salmon and sweet potato fries and the irish stew.  The stew was good, but even the server said he liked it better with the original lamb meat instead of the current beef.  I could probably agree with him. The sweet potato fries were to die for!!!! seriously AMAZING. Mom ordered the Reuben and normal fries - both very very good.  Dad ordered the ham and cabbage soup with a side salad - both of which he really enjoyed.  It is a really adorable atmosphere and I cant wait to go back with my friends to have some drinks at the bar and eat their great food.  The live music was fantastic too... A really great place - i'll be back soon!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "NIJWrUAz7-9IEqwZnGBT9g"
  },
  "4WOZgg69XaBGLNEEy3rXNg": {
    "date": "11/20/2015",
    "text": "Came here last night with a group of 15 people to celebrate my daughter's engagement - a happy occasion!  The Wait staff told us we need to calm down, that we were too noisy and bothering the other customers.  REALLY?  A Pub?  They got grumpier and meaner as the night went on, and then downright aggressive!  I've never experienced anything like it.  BAD juju and food!  We won't return!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "T_Nn0LIoEFYV9dj7P_4zrQ"
  },
  "1HRaaWPmgh8g5m8HwnUu5w": {
    "date": "3/12/2014",
    "text": "This place is simply excellent. It's a pub, and measured against others it is clearly superior for food. The chef is creative, and seems to take the extra time and effort to prepare his food with very high quality. I had some food that would be common in New Orleans, but not here in Pittsburgh. Was authentic, and excellent. Would be a hit in the middle of Jackson Square in NOLA. I have also had traditional pub type food. The menu offers what you would expect on any Irish Pub menu, but also things that would be considered unusual. The soups I have had are outstanding. The beer selections looked limited, but had both Guiness and Smithwicks on tap - and Harps. At an Irish Pub, the basics are absolutely covered!  This is the type of place to try with an open mind. Very good food. Seems like a nice place, and would highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bLOIe4K6ApkOYt2OwlsyqA"
  },
  "1Yb50sZjLHpwEAEmbjoejg": {
    "date": "3/22/2015",
    "text": "Siebs has been a regular dinner spot for our family for a few years now.  My parents were regulars, sharing in many celebrations there as well as just a normal Friday night.  When my Dad recently passed suddenly and unexpectedly, we knew there was no better place to celebrate his life.  Not only did the owners and staff cry with us, they helped us plan the most beautiful wake in his memory.  They were truly phenomenal! The food, drinks, service, and facility was above and beyond.  So many people have told us that they were impressed too.  It's rare to find places like this that you feel so at home and not like just another customer.  We will continue to celebrate life and my Dad's memory at our favorite restaurant as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "bW5FYpssmuQZbJitjJiC6w"
  },
  "uQAi-8t8XVNAHIXTIhUGNQ": {
    "date": "7/2/2015",
    "text": "Sieb's no longer serves all you can eat crab legs on Wednesday.  There is no reason to come here anymore unless you want to drink Irish whiskey or Scotch, in which there is a very solid selection.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YTuksHb6YsMI62BqEG_eRA"
  },
  "UwRMv83PAVETUvfuFwYz5A": {
    "date": "3/26/2019",
    "text": "I stopped here for lunch because I had heard so much about the Irish pub and wanted to try so Irish food. The entire business is decorated with wood sayings such as \"I believe\" and wood carvings that have messages of encouragement. The only thing they have for sale are their T shirts.  When I arrived I was told I could sit anywhere. I went into the main dining room to avoid the high top seating and truly loved the way the decorated the booths on the inside with various themes. The table I sat at was wedding themed.  A nice waitress came over and went over their daily specials. I decided to order the shepherd's pie and a side salad. Today's soup of the day was tomato bisque. My salad was the typical tossed salad you get anywhere but was a very nice size.  I got my Shepherd's pie shortly afterwards. It was ground meat mixed with peas and covered with mashed potatoes and a cheese topping. While it was good and hot it somehow tasted bland. Still the portion size was huge and was just enough for me to finish. I got to chatting with folks at the next booth who split and appetizer of pretzel sticks mixed with fried zucchini and sauces for dipping. They told me it was very good.  WiFi is available here. Pass code given upon request but even with the WiFi your reception is pretty bad. They specialize in Irish Guinness beer but also serve wine as well. They still have their Irish specialties left over from St. Patrick's day but I knew with both the Shepherd's pie and salad there was no room for dessert. when I went to pay the check I asked about the cash back offer with pay by credit card but my waitress didn't seem to know anything about it.  They do have a happy hour with specials. They also have seafood specials which I would be interested in trying. Located on Babcock Blvd not far from Three degree road in Ross Twp they have a large parking lot to accommodate the large number of people who come here later in the day.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 14,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "h2MlIDK8nUK6NJEHR83psA",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Pretzel zucchini sampler",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/h2MlIDK8nUK6NJEHR83psA/o.jpg"
      },
      {
        "img_id": "0a2UZb7BifRhjjq9uA3plA",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Bar area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0a2UZb7BifRhjjq9uA3plA/o.jpg"
      },
      {
        "img_id": "STnjYG4_f2MP0dpM-m3g8w",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Shepherd&amp;#39;s pie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/STnjYG4_f2MP0dpM-m3g8w/o.jpg"
      }
    ],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "_LlvzDTSr9Mi34MrLN3KOg": {
    "date": "3/6/2019",
    "text": "First visit.  Not exactly sure why, since I have driven past the place for at least 3 years.  Great first experience.  Walked in as live music was playing ,which immediately set the tone. Given 2 seating options,  in the bar where the music was playing, or over in the adjoining dining room.  Both looked equally inviting, but since I was with a group of people,  I figured we would prefer an area where we could talk comfortably,  yet be in ear shot of the singer/ guitar player.   It was perfect.  Service was spot on. Fast, welcoming and engaging.  Food was pleasing and plentiful.  Definitely a place I plan to visit on a regular basis for decent food and fun. We were told that the St. Patrick's Day celebration is not to be missed.  Family owned and operated.",
    "rating": 5,
    "rated": {
      "funny": 16,
      "useful": 27,
      "cool": 34
    },
    "photos": [
      {
        "img_id": "dD7Nn5Rjorp4Iy3lv16YwA",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Great display of personal and locally connected mementos throughout.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dD7Nn5Rjorp4Iy3lv16YwA/o.jpg"
      },
      {
        "img_id": "rQKd7bR2g3tNzsqKLsvXTQ",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Shared this fish platter.  Added an additional bun for a dollar.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rQKd7bR2g3tNzsqKLsvXTQ/o.jpg"
      },
      {
        "img_id": "NWnhmPj4G-3_vnxMa2hZLA",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Lobster bisque.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NWnhmPj4G-3_vnxMa2hZLA/o.jpg"
      }
    ],
    "user_id": "ZLS7cwa1UplSB8nRrwrHIQ"
  },
  "U04pmKlCyhJLIH0NU_8Z9g": {
    "date": "9/15/2019",
    "text": "Can never go wrong with eating here. Appetizers and sandwiches were delicious. My husband and I have never had a bad meal here. And the service is impeccable. The staff is always very friendly and patient.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JQZUAsJi4eK99mzNY2CPug"
  },
  "m0HrUs7MnFT3FGHUSixCoQ": {
    "date": "1/3/2019",
    "text": "Cool pub vibe, super friendly staff. They have a backish room with around 10 tables and a large bar with another several tables around it. Cool shadowbox tables too and when we came it was decorated for the holidays which was neat. Just has a really cool feel. But how about that food, eh?  Caramel Moscow mule was good, subtle caramel added into a classic drink served in a decently sized copper mug. Lots of cool cocktails to try on the menu.   Pub fries were great!!! Excellent crunch but layered with cheese and bacon. Perfect blend of flavors, it's like the ultimate for the table appetizer.   You get a choice of a soup or salad and then a side for the pot pie which we couldn't resist. Relatively reasonably priced for some good portion sizes.   Broccoli cheddar soup was ok. I'm not the biggest fan normally but this was a little watery than I was expecting, not quite the creamy I wanted. But it was still enjoyable, certainly not a deal breaker. It was better with the crackers for sure.   Chicken pot pie was excellent. Amazing crust, just perfectly flaky but still firm. The stew inside is just so creamy and packed full of vegetables and chicken. Got a side of onion rings with it and they were really good. Super crispy with a great flavoring to the batter.   My brother got the Irish coffee which he loved and the Irish pot roast sandwich which had some excellently seasoned and cooked meat. Total melt in your mouth situation there.   Dessert sounded really good but we ultimately didn't indulge because we were too full. About 60 for 3 of us: 2 drinks (8/each) with restaurant pricing for the food (2 entrees plus an app).  Definitely worth the visit though. Food and staff were great and that's what I'm always looking for!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hVBxbOGQpJO1Xt1HyrwZNA",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Chicken pot pie!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hVBxbOGQpJO1Xt1HyrwZNA/o.jpg"
      }
    ],
    "user_id": "kl_U6BarLWuCqRjKnHBW6w"
  },
  "jHYl3a5o9E23iWOJu-uXGQ": {
    "date": "8/14/2018",
    "text": "Sieb's Pub is one of my favorite places in the North Hills. You literally feel like you are part of the family eating there. We went to grab a bite to eat around 6:45pm on Tuesday evening and you get seated right away by the friendliest staff!   Heads up: they also have a wonderful banquet facility upstairs! It is a gorgeous space for all kinds of events.   Back downstairs- they have a large bar with high top tables, a small outdoor patio, a medium sized dining room area. Everything on their menu is fantastic!   To start, we ordered the delicious stuffed pretzel - it's stuffed with cheddar cheese. It's amazing!  For my entree, I ordered the fish & chips - a huge piece of fish and a great portion of French fries.   Sieb's is one of the best kept secrets in the North Hills! I'll be back again soon!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "JUSqO8f1jalu0MTLu0EwPg",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JUSqO8f1jalu0MTLu0EwPg/o.jpg"
      },
      {
        "img_id": "OTE8InjjcN3XJd0TmhZqSg",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OTE8InjjcN3XJd0TmhZqSg/o.jpg"
      },
      {
        "img_id": "uSHlgTFExwXQcYB8TBVQzg",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uSHlgTFExwXQcYB8TBVQzg/o.jpg"
      }
    ],
    "user_id": "Lph6pJNcM2Hhrb6_5i3oBw"
  },
  "nzyX8IFRxL3LnTg8EHG3Yw": {
    "date": "3/23/2018",
    "text": "Sonny and Judy Siebert and their five adult children run this great little Irish Pub in the North Hills and have been offering up traditional Irish dishes alongside pub fare for the past 14 years and counting.  We have enjoyed their festive Friday night live music and packed house for many years and stopped by on the night before St. Patrick's Day to check out their Lenten menu.  They were super crowded with families enjoying green beer, an acoustic guitarist and some super fresh fish.   After a 30 minute wait for a table that passed quickly with a cold \"slow-pour\" Guinness, I ordered a salad, some freshly breaded fried shrimp and a baked potato with all the fixins.  Now these are not your average, run of the mill, shrimp.  They are eight Black Tiger Shrimp, Jumbo sized, and fried to absolute perfection!  They were moist and tender and so delicious, I could have eaten eight more but I decided to save room for another delicious Guinness!  The cocktail sauce had a nice amount of kick to it from the horseradish and tasted homemade as well.    The service was friendly and super fast.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Yps6WucxE6SlBiDZdIt0Ww",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Fried Black Tiger Shrimp entree",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Yps6WucxE6SlBiDZdIt0Ww/o.jpg"
      },
      {
        "img_id": "jGTB_MNKDEkFU8W4lWRj0w",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Dinner Salad - with entree order",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jGTB_MNKDEkFU8W4lWRj0w/o.jpg"
      },
      {
        "img_id": "bLlx1XFUKjIvBF50uxCUaw",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Delicious creamy cold Guinness",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bLlx1XFUKjIvBF50uxCUaw/o.jpg"
      }
    ],
    "user_id": "X7mVSZxStPxD4GbN_29pYQ"
  },
  "hOdf0coGdz9Az55VPmUg9g": {
    "date": "1/21/2018",
    "text": "Pretty cool pub in the north hills area. I actually tried the challenge that they have which consists of:  2 lb burger 1 lb fries 1 beer Cup of cole slaw  The burger and fries were cooked perfectly and the cole slaw was delicious.  This challenge was pretty impossible but I had a good time trying.  It was $31 if you don't finish.  Overall, it's a nice family restaurant in this area.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_hsruQCw6UTnjlQiuSpScg"
  },
  "gvq6iuOJNwywjkmw_XCEFg": {
    "date": "3/18/2019",
    "text": "Delicious food Great service. Fun atmosphere for St Patrick's Day. Had delicious ham and cabbage. Husband had Shepard's Piie. Music playing.  Recommend you visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eoJvaORTjuL2mqgnYxkTvQ",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eoJvaORTjuL2mqgnYxkTvQ/o.jpg"
      },
      {
        "img_id": "J1gSCYyV1J14EdMETiH2Cw",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/J1gSCYyV1J14EdMETiH2Cw/o.jpg"
      },
      {
        "img_id": "O80vW0mXI6XvtdgzOT5RiA",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/O80vW0mXI6XvtdgzOT5RiA/o.jpg"
      }
    ],
    "user_id": "3XREo2mEExS2NpWZhzFQxQ"
  },
  "69jwDkJb7UOLlzTVURTuIQ": {
    "date": "10/19/2018",
    "text": "First time visiting Siebs for lunch.  The decorating for Halloween was really festive.  It was not crowded for lunch which was nice. I ordered the Shepherd's Pie.    The order came out rather quickly which was nice for a change.  The SP hot and very good. Lots of meat and a healthy portion of seasoned potatoes which were delicious in their own right.   Will stop here again!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2GBL5bjQEK_grZGEJgZ_cQ"
  },
  "6f1cKX0aXW10RuEGm9g9DA": {
    "date": "12/13/2018",
    "text": "Really great family-owned Irish pub.  The friendly and comfortable atmosphere is hard to find in the Pittsburgh area with great live music and tasty Irish and pub fare.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ekF1OvWufjIuW3XhMvmjfA"
  },
  "f1mLnWYPIhhwWt5riDPp1A": {
    "date": "11/25/2018",
    "text": "If you're looking for a well decorated and welcoming pub, look no further ! This restaurant never fails to impress. The food is great , can't go wrong with a Reuben or fish and chips .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "37Oe4gaSpLzfa01sr1xMxw"
  },
  "ipFZz3boMgPikB6LlaCS3w": {
    "date": "3/30/2017",
    "text": "I've only been here a couple of times to see my friend perform live music. For the suburbs it's what you'd expect. I mean it's not horrible and it's not awesome. Prices are what you would expect and they have an ok beer selection. I've never eaten here but a few other friends have and seemed to like it.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "KL_8z8psHbucSriEyLyS5w": {
    "date": "3/18/2019",
    "text": "Attention: Closes before 9:30pm on St. Patrick's Day. Not sure why they call themselves an Irish pub.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GfwHukEfGxfBGQfmGQIiCw"
  },
  "Zp7vB9R3O72yJL2DhyMyCA": {
    "date": "9/13/2018",
    "text": "We regularly visit for dinner and love all our meals. The kids meals are real food, not frozen junk like many places, which we greatly appreciate.  We love the chicken pot pie. My husband is convinced Sieb's' is the best burger in the north hills. I rented the upper room for a baby shower, delicious food again & great accommodations.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V2-P2oEtDhbsNsyJeTlE9Q"
  },
  "wFaoc0Q0ivwuqZTU6fvf2w": {
    "date": "3/11/2019",
    "text": "Great food, great atmosphere. I would recommend and we are taking my mother in law there later this week. Fish and chips and the Rueben were delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "055YF0x0JVhfPdz1OZ2-rw"
  },
  "C02e7DBxYJNDJyS4__NBXg": {
    "date": "11/19/2016",
    "text": "This place is a perfect neighborhood bar experience.  Food is consistent and good bar food.  Love their burgers!  The caesar salad is really good!  Had a Guinness Draft beer that was perfectly poured, with a little shamrock drawn into the foam.  The bar has an Irish pub feel with dark hardwood bars and low lighting.  They often have live entertainment, including weekdays and weekends.  The performers have always been wonderful and know how to play to the crowd.  There is a side dining room with tables and bars with brighter lighting and the live music is a bit softer in there.  The servers are always friendly and helpful.  I will definitely keep coming back when I'm in the mood for an excellent beer and hearty bar food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t1P1Mt3O1kKZ_LclhYTBSA",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States. Pumpkin pie martini!! Yum!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t1P1Mt3O1kKZ_LclhYTBSA/o.jpg"
      }
    ],
    "user_id": "D5YwD8rMx3f8gUFDp4JeSA"
  },
  "j1X0sWv6gREP8jXhPqiPtA": {
    "date": "12/22/2018",
    "text": "After giving my party of 15 reservation to another party that stole it (they didn't check ID), then making my entire party wait for 20 mins while they scrambled to find room we were crammed into the dining room right next to the offending party which was very awkward as they were not made to leave. But we weren't offered any kind of compensation for the trouble either (all I wanted was maybe a free dessert for the bday girl) . Was a semi regular customer, haven't gone back in a year because of that.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KCHbs_KET1F4bbTlrrt5bQ"
  },
  "rkzfa2oYbLHaDCXhJbIT5A": {
    "date": "8/16/2017",
    "text": "I have eaten here PLENTY of times before and the food has always been delicious but this Hawaiian Chicken salad I had today was SO OUT OF THIS WORLD AMAZING that I had to share about it to let everyone else know to come try it!!! The chicken was cooked perfectly, and the grilled pineapples went AWESOME with the pineapple balsamic vinaigrette  I will definitely be back for this again before summer is over!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "u0pg4YVuRVW0EbtPCLXcYQ",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u0pg4YVuRVW0EbtPCLXcYQ/o.jpg"
      },
      {
        "img_id": "mwDPs7__rachvgrFvqQWVw",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mwDPs7__rachvgrFvqQWVw/o.jpg"
      },
      {
        "img_id": "u5i5jnAldxZU_pEp3fFv1w",
        "caption": "Photo of Sieb's Pub - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u5i5jnAldxZU_pEp3fFv1w/o.jpg"
      }
    ],
    "user_id": "FxrSWuB-FBJuCckdnf9zPQ"
  },
  "q4LCxrRE74Sg3DAvTPYUEQ": {
    "date": "5/2/2018",
    "text": "Great Irish food, drinks in a wonderful climate extraordinary servers.  A great place to enjoy your dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ooWyoPjY1jVqAFqKB4i-A"
  },
  "bE2cI4I7hNpkql6iupbIjg": {
    "date": "12/12/2017",
    "text": "Seibs is a wonderful family owed, family friendly Irish American restaurant and pub.  Food was excellent, even the take out for my husband was wonderful and I had to bring it across town!  Great banquet facilities available as well.  I would say it's my favorite restaurant in the North Hills!  My favorite is the Irish Stew, my daughter and son in law love the Shepherd's pie.  Check it out you will be glad you did!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TwgYSsMW68QWM9whI9U4cw"
  }
}