{
  "NIB1oUK6_RWlLuJJEAXUaA": {
    "date": "3/19/2012",
    "text": "This is pretty damn good pho! Today was my first day trying the place out but I ordered take out and the Pho Tai Nam (beef briquette) was UH-mah-ziiing. The portion was very large and price was decent! I didn't like having to go search for an ATM but oh well, I dig. Can't wait to try more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FJN2TfAFwPtxSVQbQvkpcA"
  },
  "wGIlILuqO04n_iWwfmUUuA": {
    "date": "5/22/2012",
    "text": "I absolutely love the Pho here- so delicious and satisfying, either on a hot summer day or a cold winter afternoon.  I always ask for extra basil to put in my bowl (I usually order #11 or #12).  The fresh spring rolls are also great!  There is something about the basil leaf inside each one that makes them so addicting (maybe I'm a basil freak?).  Friends I've dined with have ordered noodle bowls and some of the other spicy soups and were very satisfied.  I would give this place 5 stars, but I may not be a fair judge of Vietnamese fare: I've only eaten Vietnamese a few other times, all of which were outside of Pgh.  Additionally, this place is very clean.  Even the bathrooms are given considerable attention.  The staff is great as well.  I think the owners are expanding the restaurant to include a more informal section for subs and bubble tea, separating the dining area.  The newly hired waiters are trained to give you a more formal-ish feel when you sit down in the dining area, nice touch I suppose.  Other tips: bring cash and eat here often.  Highly recommended!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jeFesQFNlhSXVkbhK7fYag"
  },
  "FkNkmlxJz3ASx00dxngrsg": {
    "date": "4/30/2014",
    "text": "I usually go to another pho restaurant up the street but thought I'd change it up for once. This place was not nearly as good as its competitor. First of all, as a vegetarian, there wasn't a single option on the menu. However, this isn't the reason for the low rating. Actually, they got an extra star because the waiter was able to understand the word vegetarian and tofu. The reason this place sucks in my book is because of the service and, to a lesser extent, the quality of the food. On a lazy Sunday afternoon with little business, the food took over 45 MINUTES to reach the table. Not only that, but our drinks took forever too. The bubble tea I ordered was brought out 20 minutes later and placed on the bar, directly in my field of vision, for 5-10 minutes while the waiter went to do whatever. As for the food, the broth for the pho was not as flavorful as I've had. Try the place up the street. You can look it up for yourself.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EOCo7T5cNcNK9jgBKkegzw"
  },
  "TkVTCVq5Evms1EMiFfCapg": {
    "date": "7/4/2009",
    "text": "I came across this Vietnamese restaurant while walking around in the Strip District.  The restaurant interior has a surprisingly nice ambiance, with wooden paneling and a stately wooden bar. I thought the pho was good too, although having little experience with Vietnamese food, I do not consider myself a good judge of the cuisine. As with all Vietnamese restaurants I've tried so far, the appetizers don't seem worth the prices. Go right to the main course and you'll be good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cFaHx-FkCnzdfF8BccukIg"
  },
  "qGyHVKel-B2f_rwcu0GjRA": {
    "date": "3/16/2012",
    "text": "Best Pho restaurant in Pittsburgh. Hands down their Pho would be my death row meal.  If you can't make it over to Vietnam (which you really should do.... it's a wonderful, beautiful country) then this is the next best thing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LS0DYfjg504obu0zRkZP6w"
  },
  "65sJFD-mHy5xUSTFGZSiow": {
    "date": "5/26/2011",
    "text": "This is the place I like to bring friends when they are in town.  There is something special for everyone.  The simply-must-try items are fresh rolls (shrimp and pork tenderloin), the Beef Pho, and the Vietnamese Coffee with the sweetened condensed milk & ice.   The owner Tom and his wife have treated us like family since the first time we came into the place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EeK6Bmye04T5EODN_91CKQ"
  },
  "hZ0EXUGixqN4qq1UOJvS5Q": {
    "date": "1/14/2012",
    "text": "Great shrimp rolls, best I had in pittsburgh Their noodles are really good, must have! I don't think they  take cards anymore, hehe",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "glCKGokVBvG2SiZxxm1dRQ"
  },
  "jTAgG73gZ5m1KE0yLBXPRw": {
    "date": "7/30/2011",
    "text": "Excellent food!!  Owner is very friendly!!  Spring rolls are great!!  Best Vietnamese restaurant I've ever been to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2WaFixpf0fKhZgXkpvFAdg"
  },
  "H34174Bm9TyDG2AHlXnDsQ": {
    "date": "3/11/2010",
    "text": "More of 3.5 stars.  I recent moved over to Pittsburgh from California and needed my Pho fix.  Of course, people have to degrade the restaurant even before I set foot into it by saying \"It's not as good as California but it's the best in Pittsburgh.\"  Due to those comments, I walked in here with an iffy mindset.  I walk into this place with two things on my mind, Spring Rolls and Pho Tai(Rare Steak) so I can't comment on the rest of the menu.    The Spring Rolls were average.  It was pretty simple.  Meat, rice noodle and lettuce. It was decent but wasn't satisfying.  The Pho Tai was pretty decent as well.  I can taste the difference in the soup to what I'm use to eating.  The meat and noodles were good.  The portions were pretty decent for a $8 bowl.    The store was pretty clean and well kept.  They have a picture of Russel Crowe posing with one of their staff hanging on the wall.  Overall, it did somewhat satisfy my pho fix.  But I think imma go explore other pho shops before I come back here.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "vy6bsyGB80NX24wddBb--g"
  },
  "tFKRqiTZZiAE2OsKX73hyg": {
    "date": "8/8/2011",
    "text": "What can I say, Trams has spoiled me. This place was average. I got the seafood pho...imitation crab meat, just 2 shrimp, rubber squid...Also got the quail and there is way more meat on my girlfriends ass. To say the least, dont waste your time, just go to trams",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-vHZgAXI-tDOKtBsJi3oFQ"
  },
  "Cx6_zN_fq7CNpEm6E-SZmg": {
    "date": "4/11/2010",
    "text": "This was the first time I've eaten Pho in Pittsburgh since returning from a semester in Vietnam in Spring 2009. My boyfriend and I came here on a Sunday afternoon after wandering the Strip District.  We started out with the fresh spring rolls. They had a good balance of ingredients - plenty of shrimp, not too heavy on the noodles, and you could definitely taste the basil and mint. The sauce was good, but I thought it was a little too sweet. I had the Pho Tai, which has the rare steak. It can be hard to find a Pho place in the area that will serve the steak rare like this, so I was pleased. The flavor of the broth was good - plenty of ginger and anise, and there were plenty of noodles and beef. I was pleased with the fresh toppings - basil and lime - but I thought there could be a few more scallions! We finished with the cafe sua da - iced coffee with condensed milk. I drank this everyday in Vietnam and it was wonderful to have a cup again. The coffee was flavorful and intense - just as it should be! While our coffee was steeping the waiter came over and I chatted with him about Vietnam and my food experiences there. The staff as a whole was friendly. In general, the atmosphere is nice - comfortable and clean. We were sitting near the TV and it was turned to some hilarious news station - seriously, I have never seen news like that before. The prices were reasonable and the food took me back to Hanoi!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "RNqvfaL9HtKu8vsG2Gs1EQ"
  },
  "6JkQD_uYDXA7JjJKkS157Q": {
    "date": "1/3/2011",
    "text": "crisp egg rolls fresh spring rolls with shrimp, pork, but too much vermicelli (Tram's Kitchen is better) seafood pho was filling vermicelli with pork was good, but too much shredded lettuce - half the bowl watercress was old and stringy (Rose Tea Cafe's is much better) TOTAL = $35 + tax & tip",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7f0q4NKAeIM-saBNWwdeoQ"
  },
  "nwb9Y0MQc233X4-ZVAHaxA": {
    "date": "6/16/2011",
    "text": "Really the only thing that matters to me when I have pho is the broth. I have to say this broth is really flat, not beefy or fragrant. Though they do have pho with tendon and tripe, they seem confused if you want a bowl of pho with beef, tendon AND tripe or beef, tripe, AND tendon. Anyway, the decor is okay and I suppose on the surface nicer than the dirty hole in the wall type pho places, but honestly? Those dirty whole in the wall places  have the best pho.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DAq3opyxg1TKaqS267nLdQ"
  },
  "JRXPfbZA2Re976sdKUAJqA": {
    "date": "3/3/2011",
    "text": "In February I took a short trip to Pittsburgh and stopped here for lunch. I can't say I am an expert in Vietnamese food but I enjoyed this meal. We ordered a beef Pho and a seafood soup, both were excellent. The portions were large enough to get at least 2 meals out of it, the side of sprouts & basil was fresh, the service was fast and they were very friendly. I don't know if it is worth a 5 hour drive back but I would love to find a place around Ann Arbor that can compare. Yum!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pM5NpfyibsPNiVyn21wT6Q"
  },
  "gD823JZ8ea63IgpVS4SpoA": {
    "date": "12/31/2011",
    "text": "This place is cash only. And the service was crappy. Never refilled our water glasses. Didn't come back to see if everything was ok or to ask if we needed anything else. The food, I had Pho, tasted ok. Overall, disappointed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nk-HvCnbWEpmEzIqluqxrA"
  },
  "3LFWKl5tE4W_BNmsqACreA": {
    "date": "1/31/2010",
    "text": "This place is marvelous. My boyfriend and I are food snobs and no other place in Pittsburgh do we frequent more than Vietnam's Pho, inc. EvErYtHiNg is good here, especially the Pho. My favorite is number 24-- all seafood noodle soup. But 23 is really good too; the broth is out of this world! They make wonderful cafe sao dah-- traditional vietnamese ice coffee. I recommend not ordering appetizers but sometimes we go for brunch and order their awesome Vietnamese sandwiches for dinner or breakfast/ lunch the next day.  Its super easy on the wallet (but cash only); and the ambience is super nice!! on weekends they keep the sports channel on. Also, every time we go, we're in the minority as English speakers. Very Special Place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uagPuBd47d6o2jX4-KbpWA"
  },
  "V9NTCF3Sj_uwCfHPmVXXcg": {
    "date": "10/19/2011",
    "text": "As a Vietnamese person who have lived many years in the bay area in California, I am very excited for the growing numbers of Vietnamese restaurants in Pittsburgh.  Pho is the \"it\" Vietnamese dish.  I love pho.  When I think of pho I expect something good and fulfilling without breaking your wallet.  It's been a while since my first and last visit to Vietnam's Pho but I clearly remember that the service was poor.  There were two people working at the bar when my friend, boyfriend and I stopped in for some pho.  I really don't understand why they have that big bar anyway.  It didn't seem like anyone was there.  It took forever to get someone's attention when we wanted order or when we needed a fork and spoon (my European friend had never used chopsticks before).  Also, whenever the server came around, he would glare at us as if we were bothering him from watching television.  Bad service aside, the pho was sub-par.  The bowl was big with a lot of rice noodle, but there was nothing really special about the pho.  It's True that a bowl of pho should be plentiful, but just having a lot of noodle alone is not enough to make it good.  Pho, though it seems simple is hard to get right on taste since the broth requires long hours of cooking and using the right combination of spices.  In addition, you need to have the right herbs/toppings and condiments.  I guess overall, it wasn't horrible, but there was nothing special about the place or the food.  Maybe my expectations are too high for pho here, but I won't be returning to this place any time soon.  I've been to several Vietnamese places in Pittsburgh, and I've definitely eaten worse pho elsewhere. In general I prefer Pho Minh in Bloomfield since (even though their pho isn't really worth raving about) their Vietnamese dishes are pretty good considering we're in Pittsburgh and the service is much better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MH_Khb4P812Axr_3BFCxZw"
  },
  "Io9WpDaDMrFrIXBMSm1eNA": {
    "date": "2/19/2012",
    "text": "Very disappointing experience.  We went for dinner on a Sunday evening and arrived at the restaurant around 5:15 PM.  We had been looking forward to ordering some pho but were informed that about 70% of the items listed on the menu were not available (including any pho).  The dishes we ordered very ok but not good enough to leave a lasting impression.  In addition, the restaurant did not accept our <a href=\"/redir?url=http%3A%2F%2Frestaurant.com&s=c5fe485af4df376130bee54f875814d79c4d7913e1258123b1206d2bdbf4873b\" target=\"_blank\" rel=\"nofollow\">restaurant.com</a> gift certificate and also does not accept credit cards.  Time to look for another Vietnamese restaurant with better service and food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WJS7iXGRz3ebjOzJVe5y1A"
  },
  "YbhWHs76C1pYRBqQsUBW8A": {
    "date": "8/2/2011",
    "text": "One evening, me and my coworkers took a cab and arrived at the restaurant about 30 mins before closing. The door was locked but there were customers and waiters still inside. We knocked on the glass door and had eye contact with the waiters and the owner; however, they just completly ignored us. They did not greet us to inform us that the store was closed at all. I would expect any business to treat their customers with respect. I would not trust this restaurant in serving good food by the way they operated their store. If they do not care about their customers, believe me, the food would be at the lowest quality.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VGV3jcmOsUVfwzJpRK24SQ"
  },
  "KJYWOO31ieGJcHgcNSRloQ": {
    "date": "7/26/2009",
    "text": "LOVE LOVE LOVE the broth... fantastic, piping hot- just the way it should be.  fresh garnishes.  i would give it 5, but the service is somewhat slow.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6QRHk1NjWQ7jUawP_UmsBA"
  },
  "BlsBy_YLgn5T1Qhb_tu9kQ": {
    "date": "10/13/2013",
    "text": "Having lived in DC for a while, we were spoiled having Pho 75 nearby and hadnt found a spot in pittsburgh that lived up to them - until now!  We accidentally arrived before they opened, but were graciously seated anyway and handed our menus.  We got the 11 pho and were shocked by the HUGE portions!  The broth was just right, the noodles tender and the fixings were fresh too.  All in all a great experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NfIw1CwJrxFrasgps4MeMQ",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. The #11 pho plus thai iced coffee.  Delicious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NfIw1CwJrxFrasgps4MeMQ/o.jpg"
      }
    ],
    "user_id": "T8eAmI1vYNf4SD5XQuHimA"
  },
  "9N6S5UsIb977bTWZzAroBA": {
    "date": "3/4/2013",
    "text": "Feeling pretty lucky to have a legit vietnamese restaurant in Pittsburgh because any Pho lover knows that sometimes you just get that feeling---that feeling that you need to drop everything, run, and eat some pho right now!    We are weekly regulars here because of its convenient location in the Strip.  I usually get the BUN (dry noodles) or the PHO (noodle soup with beef balls, thin slices, tripe, etc).  The first spoon is always so good and their food is consistently good.  They have recently expanded and are now serving BANH MI or what Pittsburghers like to call hoagies???  These are Vietnamese sandwiches made with french bread, marinated meet, picked veggies, and cilantro.  They are so yummy and though they are a 300% markup from what I used to get in California, this only amounts to $6.  Banh mi is so good and I'll be getting one for my next day's lunch every time I go now.  They also have decent bubble tea.    They are always busy when I go on the weekends, always full of Asian people which definitely means it's authentic!  All cash, no credit.  Can't wait to see what they do with the rest of their expansion.  Find me there next time a craving hits!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SX_SMrddkDU5dySbsZMu9A"
  },
  "TFh0L3VE4Qg1MbVoBQCleQ": {
    "date": "2/21/2015",
    "text": "Here's the obligatory comparison with Pho Van several blocks down. I had the pho dac biet today, and in terms of overall appearance and content, this same item from both places is actually quite comparable. Both come with very large bowls of broth with good noodles, lots of different beef cuts, and garnishes of bean sprouts. basil, and some jalepeno and lime. In the end though, I found the broth here to be less flavorful and rich than its competitor. This is of course just one opinion; reviews seem to go back and forth between the two, and I haven't been to either one often enough to test consistency.  On the other hand, the prices at this place seem to be a dollar or two cheaper than at Pho Van. And the menu here is larger, both for appetizers as well as for the standard pho, bun, and rice; I should try the fabled quail next time I have the chance. And while I haven't ordered these either, it's worth noting that they have banh mi here (which they call hoagies...), so maybe those would be some redeeming qualities for this one.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "aq42Hjp8tn_ZrXOhnQU6cQ": {
    "date": "1/3/2016",
    "text": "A case of the least evil. Soup for the pho is great but they really rip you off on the meat.  Last time, i ordered the deluxe, the $12 pho with all of the above expecting what i thought i paid for. One piece of each meat.  And I mean one.  I love the broth don't get me wrong, but there needs to be some sort of reasonable proportion and paying $12 for just straight soup and noodles doesn't do it for me.   Rip off, but what other choice do we have? Pho in pittsburgh as a whole is awful.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sa-Ni3C8UCphh4JRxVsrsA"
  },
  "GPRdmU_Ih9DiBvu0pJ5jcw": {
    "date": "4/10/2013",
    "text": "This is my go-to pho place in Pittsburgh.  It's pretty standard, good portions, good amount of noodles, good amount of meat.  The only thing that bothers me is that there are times when I've gone and they've had no bean sprouts... what's up with that?  I need bean sprouts with my pho!  Other than that, everything is good.  Also, usually have to pay cash or hit a minimum amount to use card.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zS-MLrePVjxlkjv6RhtdYg"
  },
  "c9nCZ4UCvcVdfI7R55m25Q": {
    "date": "1/18/2015",
    "text": "Everytime I visit Pittsburgh I have pho at Vietnam's Pho. The pho is delicious; service, excellent; & price, very fair.  I had the Dac Biet and my girlfriend had the number 11 - I forgot the name of that particular bowl of pho. You know you have yourself a great bowl of pho when you don't want to add any Sriracha or hoisin for fear of tampering with perfection. The flavors of the broth are the perfect combination. The noodles are never clumped so much that you can separate them, as you will find elsewhere. The veggies are fresh and the meat is perfectly tender and adds wonderful flavor. The tendon here is my favorite of all the places I've ever been. It seems like such a small thing but many places leave the tendon a bit undercooked which can isn't most desirable. Not here! Delicious!  The staff is always kind and quick to serve you. They don't bother you as you eat and only approach if it's obvious you need something. I really enjoy that. I can't tell you how annoying it is to be bothered a lot while you eat. These guys are great! The only downside is that it's cash only, which isn't a big deal at all.  The price is fair. I've noticed it has gone up a little bit but so has everything else. I understand economics and business so good on them for not undercharging,  5 stars for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xi_epbRfx-O9tV9Rqa4_Yw"
  },
  "3XeW5UCnFFYjjl-pIr-RKQ": {
    "date": "9/10/2014",
    "text": "Prices went up recently, but I still like this place for pho and banh mi. The broth is very good for the pho, and the restaurant is pretty big, so there's never a wait and food is quick.   Our usual pho place now.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5wVLW7EhvHaKoYy3tRhfrg"
  },
  "VIp8PbB3_OKYBXxu70G8jw": {
    "date": "8/8/2016",
    "text": "Meh. This place is weird. The pho is OK but there is better in the area. It's the atmosphere that makes me not want to return to this restaurant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LzZPZDlXiEv9adPzdN4gzw"
  },
  "moRcxEZ3teVLtRUOLUu_MQ": {
    "date": "5/17/2012",
    "text": "The cleanest Vietnamese place I've ever been to!  They even have the Hoison Sauce in a fancy bottle!  (But as a result, things are a bit pricier - normal pho dishes range from $7.95-8.95.)  My mom and I both got #8, the pho noodle soup with most amount and types of meat.  Their broth is flavorful!  Also they give you a LOT of noodles and broth and bean sprouts, etc.  So so good!  We also got their spring rolls which came in white rice wraps (#2 in the appetizers menu).  It had noodles, shrimps, some veggies and cilantro. Yum.  Again, so impressed with the cleanliness of the restaurant! 5 stars.  P.s. cash only!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "Vbmt5QhvcinHVnSdFuKWaQ"
  },
  "37tV2ByYqCwJOwIFWZhrMg": {
    "date": "10/23/2016",
    "text": "The restaurant itself is simply decorated: no frills, just tables, chairs, and the expected bottles of Sriracha, but that's not why you came. The broth of this Pho is DELICIOUS - well worth a little walk under the highway. Perfectly seasoned. If I wasn't just passing through Pittsburgh, I'd definitely return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IWI10DQxmLhaC2lcqwbv8g"
  },
  "Nw8rOvkwptNmbrwms7ns9A": {
    "date": "4/13/2014",
    "text": "You know a pho place must be decent if your friend from Vietnam find this place to be the most authentic. Prices range around $9-$12 which is a little bit pricier than what I'm used to but quality wise this place is pretty good. Portion wise, it isn't the largest but it should suffice until your next meal. This place is cash only, don't be mislead by the menu cover which implies that they accept card.  Ive had the beef noodle soups and the bun bu hue. Both are very good so if you aren't sure what to get, I'd recommend either.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "zgGTqXAv3bW-YCV6dS_ZRg"
  },
  "qbXfSrq-NtHTkinsKGYDtA": {
    "date": "8/11/2017",
    "text": "Maiku offers wonderful service from an excellent and friendly staff. The space is small, but don't be fooled--they serve great sushi! They recently added Vietnamese cuisine as well as bubble tea to their menu and have a variety of vegetarian options. The tofu pho is delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e5YxOGsZrAh1S6lQXM_sOg"
  },
  "hls8No81XsXOqp3bT4P8hQ": {
    "date": "10/17/2014",
    "text": "The first things I must say is cash only and they're going through remodeling so look for signs for the entrance.   The price is $$. Most dishes are $10, and the cafe sua da is $4.  However, the portions are larger than other Vietnamese restaurants in the area. The cafe sua da was in a large ~8-10oz glass cup--most places only give me a 6 oz serving. It was bitter and sweet on all the right levels.   And for a meal, I ordered/devoured the bun dac biet (\"Crispy spring roll, charbroiled pork, grilled shrimp with bean sprouts, lettuce, herb, cucumber & peanuts on vermicelli\") The ingredients were fresh and the meats were deliciously marinated and cooked.   The only thing I'd comment negatively on is their chopsticks. They're the round wooden ones, but they were just not working for me (or the rest of my table). I'd consider just bringing my own chopsticks next time.  I went with a group of 13 for which the staff were well-prepared, and the food was served in a timely manner for our large group.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PlGOItOtSgiiHvwpIM__Sg"
  },
  "XHYsAIsn5TBjru8nXh3iUA": {
    "date": "2/28/2012",
    "text": "You never really appreciate your hometown offerings until you're stuck in a no-man's land suburb like Warrendale, PA where the nearest city is Pittsburgh and there beloved Steelers Fans. Now I'm not hating on Pittsburgh by no means, you were very warm and inviting to me when I arrived and had my short visit, but coming from Houston, TX - the second largest Vietnamese community outside of Vietnam itself - you don't know pho!   The sad part is the name of the restaurant, ok wait, that's the second saddest part about this place, the first part would be that it's Vietnamese owned and operated and yet the pho was tasteless, colorless, and why was the juice murky?! Please, as a reference please check out the photo I took of their pho. I added the red Sriracha sauce to liven it up a bit.  I'm sorry, but come to Houston, pick almost (ALMOST!) any Vietnamese pho restaurant in Houston and you won't be disappointed.   I do have to give Vietnam's Pho credit for atleast having the same aroma as pho. though.  PS - Why doesn't any restuarant in Pittsburgh take credit cards?!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ffra6jCaEtWiX3m_ACkleA",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Pho Tai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ffra6jCaEtWiX3m_ACkleA/o.jpg"
      },
      {
        "img_id": "hs1NAG8L8LoNvPFkdCuMmQ",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Pho Tai Nam Gau Gan",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hs1NAG8L8LoNvPFkdCuMmQ/o.jpg"
      },
      {
        "img_id": "ILbVxnpQL8SZrfQq0mz1Aw",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Egg roll, originally came with 2 whole rolls cut into 4 pieces",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ILbVxnpQL8SZrfQq0mz1Aw/o.jpg"
      }
    ],
    "user_id": "gpHkYKDRcSvjG8fo4xKn0g"
  },
  "oBKNydGBU_CmPMjA-FnAUA": {
    "date": "8/27/2016",
    "text": "Pho broth has no taste and the service is nonexistent.  this place is the only place I haven't left a tip the last 2 times I was there.  go to pho van",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s9ycrZf0oe7_hGP8SvylJA"
  },
  "xIbE9ayecVpFvM59UdZOFQ": {
    "date": "12/31/2015",
    "text": "As a person who's probably eaten more than a thousand bowls of pho in the Fields corner section and Chinatown in Boston, Chinatown in Lower Manhattan and Avenue U in Brooklyn, as well as pho establishments in Philadelphia and DC, I can tell you that this must be one of the worst pho restaurants in the world.  That would tend to indicate that Pittsburghers are clueless as to how pho should taste...so I'm not even going to try it in another Pittsburgh restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Sx8Zq1IiaN1Frdd1exukgg"
  },
  "R7dPwARrW4qH1EN9-mpZAw": {
    "date": "12/12/2013",
    "text": "I sat down with a good friend on a cold December night, drooling for a bowl of Pho. It was cold as a Witch's... Um, stare outside. Not wanting to drive all the way to Robinson for Loving Hut, we saw this place and, luckily a parking space right at the door.   The waiter handed us menus and I asked if the pho could be made vegan and he assured me it could. With a raised eyebrow I agreed to try a bowl.   I got the greasiest, nastiest, most unappetizing bowl of pho ever, and it had beef in it. The waiter came back to bring me the forgotten lemon, bean sprouts, basil, cilantro and mint, and again, I asked if this was vegan, he assured me it was. Not trusting the kitchen, I scooped out the suspect \"meat\" and just slurped on the noodles and left the broth, not sure if it was beef or not. I doubt ill come back because to this day I'm not sure of they were honest with me or not.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UsmTxWbobLsI6WR1Db0W7A"
  },
  "eMJwevloFdfpT_h_jqS21g": {
    "date": "6/30/2017",
    "text": "The food was great with the staff being extremely friendly to my group. Got myself the Seafood Pho bowl and the broth was light but really flavorful. Then, I left with some Taro bubble tea which was really refreshing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wXaMCC-66UjgH1jPW51n_A"
  },
  "ENxQdw-M0QKv9QG16e6oyA": {
    "date": "10/12/2014",
    "text": "Good, but not as special as Pho Van, in my opinion. It's funny that Pittsburgh has two such good pho places in the strip, and Vietnam's Pho is really quite good. Authentic, really nicely prepared eye round steak and a good amount of the extras that should come with pho.  Here's the thing, it's a good pho, and I enjoyed it. But I  would not say that it was \"delightful\" and that's the experience I've had at Pho Van and in the best pho places I've eaten in in other cities. You won't go wrong taking someone here, but they probably won't think it's the best pho they've ever had.  Another small point. They don't list vegetarian options on the menu, so if your partner is veg, they'll think there's not much there for them to choose.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UzS1tUzCpGAiDABomFsXoA"
  },
  "Ys9zVY9EXJJHqSSTdJba3A": {
    "date": "10/26/2014",
    "text": "This is one of my favorite pho places in Pittsburgh. The employees are kind and remember my boyfriend and i every time we go. Our food is prompt and service is always great. The servings are the largest bowls out of the few pho places ive gone to in Pittsburgh. I recommend this restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U2JnZGuLu2jI0Z3D8suZWw"
  },
  "70zyIEWyXC86zxFJrKryFg": {
    "date": "3/7/2018",
    "text": "Would give 4.5 if I could but rounded up. Excellent service, delicious food.  Had the vermicelli with pork and spring roll which was scrumptious. Our waitress was very friendly and made good suggestions re: food quantity. Would totally recommend this little hole-in-the-wall.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HsibLfc2XD7Gh7Hbd1WfJQ"
  },
  "s6Mwz0ZxtQNYQbbNszNpHQ": {
    "date": "3/16/2017",
    "text": "Amazing. Best Vietnamese in the city. Sushi is damn good too. Service is wonderful, everyone there are super nice. So far nobody I have recommended this place to has only eaten there once. Its marvelous.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lDRMGeDN5XhbIl8A3Q-diQ"
  },
  "EAZ9yD6b_9EEpJJYFtwYiQ": {
    "date": "11/30/2013",
    "text": "Before I start, just want to say that this is my favorite Vietnamese restaurant in Pittsburgh...only because I don't have that many options to choose from. As my favorite Vietnamese restaurant, I'm rating it according to Vietnamese standards.   Prices are very affordable and portions are pretty generous. I ate here so many times that I feel I've tried everything on their menu. I recommend their noodle soups over the rice noodle dishes. The \"Bun Bo Hue\" was pretty good, just not as spicy as it ought to be, which is understandable since spiciness is subjective. I'm not very impressed by the Pho though because the broth was too cloudy. According to Vietnamese standards, broth must be clear or else it fails. The Pho here failed. Don't get the appetizers because they aren't that great. The \"Banh Mi\" hoagies are ok. I like the pork and chicken. Sometimes they can be as hard as a rock though, depends on luck.   As for the service, the owners are very friendly. It has a nice atmosphere and an authentic feel with Vietnamese music playing in the background. There's a fish tank with Nemo swimming around. Also, they sell Vietnamese sweet desserts (\"Che\") in to-go containers in the front of the restaurant. Those are pretty good.   Two bad experiences though (which is unavoidable since I eat there so often I guess). My one friend got really sick after eating a rice noodle dish here (\"bun thit nuong\"). I'm assuming it was from the cold rice noodle sitting out. To avoid this, just get the soups. Also, they overcharged me for the \"banh mi\" hoagie one time. I ended up paying $10 for a 6\" hoagie. I was too careless to double-check. Make sure you double-check the prices on the menu with your bill!!!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 2
    },
    "photos": [],
    "user_id": "H_09-Wr5JcN5hpp5RnSLTA"
  },
  "nKAonCZNec_5nXJ6FjaeTQ": {
    "date": "1/3/2014",
    "text": "One of the best places to get Pho in Pittsburgh. Could use a bit more tripe and tendon, but at least they have the option. Definitely not legit pho without large pieces of tripe and tendon. Their grilled porkchops and broken rice are also pretty solid. Prices aren't too expensive either.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "N2VrZxdi_bX_4ol0c03Wug",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N2VrZxdi_bX_4ol0c03Wug/o.jpg"
      },
      {
        "img_id": "bIluC5V4oyCbOif_5-lEJA",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bIluC5V4oyCbOif_5-lEJA/o.jpg"
      }
    ],
    "user_id": "DC1hfeeSaYr2E1xwiEL81A"
  },
  "w6yifBSs32Nse3TJQNhNcg": {
    "date": "1/15/2016",
    "text": "I'm Vietnamese and nothing compares to homemade pho. Although Vietnam's Pho doesn't really compare to homemade and probably not even to other pho restaurants in other cities, I'd probably say this is my favorite Vietnamese restaurant in Pittsburgh. The portions are large, the prices are low and the food doesn't leave you thirsty (meaning, little or no msg). In recent years, they expanded the location to include a counter for banh mi and bubble tea. Note that you can't order any banh mi or tea from the restaurant; you can only order them at the counter in that front space. I haven't tried the banh mi here yet, mainly because of the price. They're quite expensive as far as banh mi goes, especially compared to other cities that might sell them for around $2 apiece.  This is a nice go-to for pho on a cold day or when you don't feel like taking a day to make some pho.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "MDiX_NgUACX5t25i6fn2Pg": {
    "date": "10/10/2016",
    "text": "This was our go to spot for my boyfriend and I for pho and Ban minh sandwiches here in Pittsburgh. We have been loyal customers for almost 4.5 years now and go so frequently that our waiter Mario knows our order by heart. We were devastated to see that they have closed down when we went this past week, but then as we walked down the street into the neighboring Maiku Sushi, we were immensely relieved to see familiar friendly faces. Vietnam's pho has merged with Maiku Sushi and they will now be serving an expanded menu including vietnamese options as well as sushi. Out of my own selfishness to keep this business alive, I highly recommend this place. It is not fancy. There are no frills. It is not meant to be compared to Atlanta or California tier vietnamese food. It is just what it is - good old delicious pho and banh minh when you need it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "Jq0puqr3W02hMRLD3wPShg"
  },
  "GQUmHHua340y6FjKE7tt4w": {
    "date": "12/16/2016",
    "text": "This is the same owner of Vietnam Pho. They recently moved locations and added a sushi bar. Although the space is smaller, their pho is still savory and delicious. I think it's the best in town! The banh mi is my favorite and they have a good vegetarian one. I haven't tried their sushi but I'm definitely coming back. I don't mind supporting this place because they always remember me and what I like. I hope they'll get back some of their business because it's a hidden gem!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QMWghwszNHovcu00CmUzsA"
  },
  "uE-FxiwWFyaPlUC_5mssWw": {
    "date": "6/10/2017",
    "text": "Best pho and banh mi in Pittsburgh! Never had a bad meal here and the owner is awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sIWaMtz8SEn75ZuNzStDIg"
  },
  "crxTOLSOlLOU5vw3HZNPBw": {
    "date": "4/4/2015",
    "text": "Was nearby and feel like pho today, but didn't feel like driving to our usual pho place so we stopped in.   As always, we ordered pho noodle soup. We didn't had high expectation for this place, but we still expect the noodle soup to be hot, temperature wise. It was not even warm, but Luke warm. And the best part, the beef was ice cold! Unacceptable. Will never come back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ffPaySPAiKKswW4Eb_L97w",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Ice cold noodle soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ffPaySPAiKKswW4Eb_L97w/o.jpg"
      },
      {
        "img_id": "DuPaLI9gJN2ZtbTcpUvkpA",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Chx bah mi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DuPaLI9gJN2ZtbTcpUvkpA/o.jpg"
      }
    ],
    "user_id": "gc3QnuH4FURVzLVbyhmbqw"
  },
  "xDOPQFyI8P9XXFS7cin_qg": {
    "date": "12/26/2016",
    "text": "Went to the strip today to try vietnams pho but found that they had merged with maiku a few doors down. So we went there.  I ordered the vegetarian bun vermicelli and a bubble tea. The waitress brought out the taro bubble tea which had maybe 4 really over soaked mushy boba in it, the actual drink was good though. The waitress then came out and told me they were out of the vermicelli and suggested the veggie pho to me so I got that instead. I just don't even know where to start. It was a few massive chunks of broccoli, cauliflower, carrots, and tofu, in some lightly salted water. If you have had pho broth before you know that there is so much depth and so many layers to that clear simple liquid. I had to majorly doctor it up with condiments and was bummed that I wasn't even given basil to assist in this. They did give you a hefty serving of perfectly cooked noodles though so I'll give them that.   The one star is for the kind waitress who didn't charge me for the \"pho\" because she knew I wanted the bun in the first place.   I will never cheat on trams kitchen again  Ps the pictures of the food on the maiku yelp page are from the old vietnams pho page they just transferred them over",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "omwBX6tSFifgJ4xZU8a1CA"
  },
  "UQNvLkoMLuVGPLcIYH0HXQ": {
    "date": "6/24/2015",
    "text": "Is this the best pho I ever tasted? No. But it's super impressive to find great quality pho in a small city like Pittsburgh especially by the pricy strip. The pho is great, a little above average and decently priced for a large portion. I also like their fried rolls. What makes me give them a full star rating is their banh mi (Vietnamese hoagies). Not gonna lie, that's the best banhmi I've ever tasted (pork being my favorite). They give you so much toppings and its overflowing with flavor. I've tasted my share in NY and none come even close to flavor and texture. Well worth the price and a try.   The bubble tea is unique but not quite my type of style. They have little white Pop bubbles instead of standard black tapioca but they were a fun surprise!  The establishment itself was pretty worn looking but when it comes to pho: hole-in-the-wall is usually synonymous with authenticity, so i was kind of welcoming the outdated look with open arms.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ObFg3cZX6wexRBlAXE_G7A"
  },
  "pBemAqqDcZWTn9R7GJ2pNw": {
    "date": "4/29/2015",
    "text": "This is my go to pho spot in pittsburgh. Haven't tried all other places yet,  but when i need some good pho, this is my go to. The broth and noodles are good. They give a good amount of meat too. For me, the one thing to make my pho better is if they add more green onions and onions! They are nice about it when I ask for extra though.  I've also tried the bun bo hue and that was really tasty and spicy! If you like spicy, you should definitely try this.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "PIP2uRmNNP_VDfxUYVf3Rw"
  },
  "JGquK-O0gtG-anNG3rEWlA": {
    "date": "9/13/2015",
    "text": "Don't be daunted by the barren, unfinished storefront-this place has great food.   When you walk in, it looks like you're in for food of questionable quality. However, you should stay!  Service was prompt and friendly, but the menu was dated and fairly limited, and the restaurant space felt somewhat thrown together- I guess they spend more time focusing on the food than the ambience.  Once the food came out I was sold. The pho here is delicious and absolutely dirt cheap! It was worth the 20 minute walk from downtown in the rain, and it's definitely a restaurant I will visit any time I need the curative powers of great noodle soup.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mB9-i-BJycBoqapUucygXw"
  },
  "bmhz84RtggISV_-Q1AkYRw": {
    "date": "1/17/2016",
    "text": "The pho is really great! I think this is one of the best places that serve pho in Pittsburgh! It's near lotus food company, and every time after shooing at lotus, we will go here. Their special pho is really worth trying, 08! 29 is also a good dish! They serve pork pancake , which tastes great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EVfsEVtJqnhwA8nEXWa4ug",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Special pho",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EVfsEVtJqnhwA8nEXWa4ug/o.jpg"
      },
      {
        "img_id": "1yrfz6u-MDF4SCV7Fp7ywQ",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Pork pancake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1yrfz6u-MDF4SCV7Fp7ywQ/o.jpg"
      }
    ],
    "user_id": "Yuc7wZxhOKkS1hYMIXaDRA"
  },
  "iBDUhDM4-SKbblxFgx5MeA": {
    "date": "9/30/2015",
    "text": "Very generous portions of Thai basil and bean sprouts served with the Pho.  The Pho is very good, and the service is very quick and friendly.  Not sure why they continue to be cash only, but I can certainly deal with that.  The spices in the Pho are great, and the ingredients are very good quality.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "4HI6HOmwljRwaHUh8sy_TA": {
    "date": "1/4/2017",
    "text": "Wonderful hole in the wall. Small and cozy little place.  Owners were great, very nice and helpful they were also very polite and kept my water glass full. Pho was very tasty, and full of flavor.  They gave enough side veggies to be acceptable the only downside is that I didn't see any fish sauce on the tables.  The price wasn't bad, less than ten dollars for the brisket pho. I've had it for less in other cities but it's the first time in PA. Next time I'm in PA I will definitely be back. Two thumbs up, only because I only have two.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IqZXMHj9cAU5pi29bS-L4w"
  },
  "U4_bJSTc4ckl9JJ_m-fD5w": {
    "date": "12/15/2016",
    "text": "Not my fav. Owner is fantastic. Pho Dac Biet... better at other places. Broth needs more flavor.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3yqfsTxMeoSNxFY4JGkD4g"
  },
  "teLYSl_y7Zqjk6tWxPFZKQ": {
    "date": "9/22/2011",
    "text": "In the middle of a Asian enclave, check. Mostly Asian  clientele, check The general authentic feel, check Authentic food?  Nope  This placed seemed promising, not just because we walked long and hard to get here.   the menu is full of rolls, pho` , and some other dishes. I was limited to the veggie section of the menu. I went with the Tofu, which was fried sliced tofu in a light brown sauce with broccoli and a good amount of garlic. $9.95. It was pretty good as tofu dishes go.  My coworker was a bit disappointed, his soy milk came in a can not out of a fountain, his spring roll was \"terrible\"  how something fried can be terrible I don't know. His Pho` was not quite what he expected.  As of October 11 they will no longer accept credit cards.  In the area, hungry sure stop in. Is it worth the trip?  no.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wr5XH_3m589oxg5v82RE9A",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wr5XH_3m589oxg5v82RE9A/o.jpg"
      },
      {
        "img_id": "8kE--91tetlwIiiD2s_ybg",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8kE--91tetlwIiiD2s_ybg/o.jpg"
      },
      {
        "img_id": "yXP73GEj3wszCdzWeDYntw",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yXP73GEj3wszCdzWeDYntw/o.jpg"
      }
    ],
    "user_id": "gScmsSCqBeFPp6q9yG5nmw"
  },
  "6KjZ4woKiJ4Z4GKlMi_f6Q": {
    "date": "12/9/2016",
    "text": "Vietnam's Pho is the best in Pittsburgh.  I came in today for the first time since they moved next to Gaucho.  It's a lot smaller but more cozy. The owners are so friendly.    For authentic Pho noodle soup this is the spot.  Closest I can get to what they have in Philly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kx29MA9wU1vGFoQ9AwdY8g"
  },
  "AGH6wxfFpYKq7-Pztzr52w": {
    "date": "1/9/2017",
    "text": "I WOULDN'T RECOMMEND BUBBLE TEA HERE. I had spicy california roll thai bubble tea. The roll was ok, and good value for such affordable price but the bubble tea is horrible, hard bubble and sugary milk tea.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "owkcRRpF-aZ6j6BDtArWpQ"
  },
  "pCXqBjvm67Ka0qoJTmddDg": {
    "date": "6/27/2011",
    "text": "Had the #16, Bun Cho Gio (don't quote me on the name) ($8.51 with tax). It was quite tasty and had more food than another Viet place down the road. Interior looked nice, and there is a large fish tank that adds to the decor. There were no water refills.  Food Quality/Taste = 4 Stars Portion Size Given Price = 3 Stars Price = 3 Stars Service = 2 Stars Experience with Staff = 3 Stars Decor = 4 Stars",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5UDVAuh_gJcjWw5M4-xsbw"
  },
  "ULVRtcRAukVVqktmAp5nhg": {
    "date": "8/15/2013",
    "text": "This is my all time favorite spot to get pho and bahn mi. There are many different pho styles but the flavor here is most similar to ones I've had at home in los angeles. If I feel a little under the weather, I was always come here for pho. Order a bahn mi to go for lunch the next day. Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ft0-KUGvYJOD-jXgQFypHA"
  },
  "wknNwLvSSv6WCntmUPTKeA": {
    "date": "4/10/2014",
    "text": "Pho had no flavor. NONE. It's ok if you're starving. I know I was. Managers were friendly, waiter was nice. place is quaint. But Pho was not that good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KAkd4Wkwo846cbUxsyPgkw"
  },
  "kpumOd0ZpG9XMDrX7wEI1Q": {
    "date": "9/13/2010",
    "text": "We had really excellent service here. The pho was amazing - so flavorful and just amazing to smell. All of the vermicelli dishes were excellent and the spring rolls were amazing too. Just excellent food. I would definitely make this a weekly visit if I was in the neighborhood.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a5XvEtYqTIHpRarDlJ1v8w"
  },
  "3BSm2XW7EqNls7SJIH8WlA": {
    "date": "6/15/2011",
    "text": "Great place.  Cheap, delicious, crave-inducing and a new go-to place.  And authentic.    The interior is basic, but clean, and the staff are friendly.  I didn't focus on the fish tank as much as I was focusing on fishing the delicious beef and noodles out of my pho!  Generous servings- I had the beef pho- a bowl of fragrant steaming broth (not oily), delicious tender beef, perfectly cooked rice noodles (not gooey- just enough bite) and plenty of fresh basil and bean sprouts for crunch.  Can't wait to try the spring rolls and other soul warming goodness.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1GDara-37cF1xh_4GMx1HQ"
  },
  "pZt_Wnm8OEsjg-LgP9fNGw": {
    "date": "9/18/2012",
    "text": "Weird weird weird. The menu is Vietnamese and they have very few menu items with pork. Their chicken is leg and thigh only, not pounded (signature asian move) nor skinned properly. Their website is down. The portions aren't ample, the broths are overly salty and lack depth of flavor.   This used to be a shining star, now it is cold and strange. You feel like you're intruding. Cash only is cutesy for places that have been around forever and/or have an ATM. It's shady and irritating for a newer joint. No thank you, I won't have another.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKrXZY_OjTZ1yg7a3HH_4w"
  },
  "vRRQnSYfqIPL-EJKmzRY-Q": {
    "date": "3/15/2013",
    "text": "Had the pho, the soup is delicious, not too salty like some other pho restaurants.  I felt that with the price, they could have more meat in there. The portion is a bit small, compared to the price.  Other than that no complains.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XBkjukXiii128VwBhTjr7g"
  },
  "-lKEzbCcGV9l9kcBrKpW_w": {
    "date": "10/23/2012",
    "text": "Terrible service! Ordered two bowls of Pho. One came out 30 minutes into the service. The second bowl came out 10 minutes later. We will not be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6y5FddadSJfZNatjuJ0vhQ"
  },
  "H4NvgXWk6gTurd2RvAvddA": {
    "date": "4/21/2011",
    "text": "I travel to Pittsburgh quite a lot, and I wanted to try something different, so this was my first Pho experience. I have to say, despite the previous reviews, it wasn't that great and I probably won't go back.   My first impression was not a warm greeting, kind of a just 'sit wherever' introduction, no 'welcome', 'glad you are here', 'what can I help you with'. No biggie, just not that welcoming.   Then, I tried to order a smoothie, in fact, I was excited about trying the Durian, or perhaps Mango. But, they didn't have any smoothies. Once again, no big deal, I'll just get a Daisy tea... Nope, don't have that either.   Alright, so drinks aren't their thing, I'm there for the food anyway.   The Goi Cuon summer rolls were good, not great. But, I like cold/fresh rolls, so they passed the test at least to quench that craving.   I then went with the Pho Dat Biet. Once again, my first Pho experience. It was a REALLY big portion, which was awesome. The veggies on the side were cool, especially the jalapenos. The noodles were good, the beef was good, but the broth was just...good. Nothing great. I'm sure that if I was more of a Pho expert I could give you a better description/opinion, but as my first experience, it's not something I see craving.   Finally, I tried the Bun Dac Biet vermicelli dish. It was a nice sampling of pork, shrimp, noodles, and a crispy spring roll. Nothing to write home about, but good.   All along, the service was substandard. Like I said, they acted like they didn't care whether I was there or not. I asked a couple questions about what they recommended and he just pointed to something, as opposed to explaining it or giving an opinion.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZoFQecgIQ9BQVPx1epzGkQ"
  },
  "mL85BWKQJEyWMf-yePIT8w": {
    "date": "9/14/2012",
    "text": "Did you know that PHO is pronounced FA?  I did but my lunch friends didn't.  We just craved something filling and comforting so I suggested Pho.  Hmm....They've never had it!  So a short ride on a bus and we were in the restaurant in no time.   The restaurant looks like it used to be a bar since there is a huge wooden bar with mirrors taking up alot of room in the dining area, which was probably the bar seating.  It would be great to see this place with a face lift!  But I am not grading this restaurant on it's decor.    Our group ordered different things off of the menu starting with the spring rolls.  Yum!  So my rating is only on the pho.  One of these days I'll have to order some bun. But this time,  I wanted pho!  So I ordered the SMALL order with brisket. I'm not too crazy on the meatballs that go in to the pho.  To me, they seem like a spongier version of spaghettio's meatballs but without the flavor. So I stick with fatty brisket or just brisket and eye of round.  Anyone who's ever been to a Pho restaurant knows that the small is really large and the large is ginormous.  The broth was piping hot and blanched the fresh vegetables just right.  The bean sprouts were still crispy and the basil leaves still kept their shape. The meat is cut thin so it cooks as it is brought to the table.  Would love to have had a double order of brisket tho.  4 stars for the broth as it is flavorful and piping hot and would soothe anything that ails you, especially when it begins to snow and you want something filling and warm.   Boba Tea was lousy. Not a very good selection and the girl making them for us didn't seem to know how to make them.  Instead of fresh, plump, chewy tapioca balls, they were semi soft on the outside and a little too hard on the inside.  We mentioned this to our waiter and shortly, the manager stopped by our table and told us they wouldn't charge us for it.  Awesome!  It's probably not like that every day but on the day we went, it was.    This place is very affordable.  Pho dishes are less than $8  and you can call in an order to go.  I'll have to try that some time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Eu_9lumAGZ1HHf3OP3hag"
  },
  "iv1Idbo-njcldfr2LJWY1A": {
    "date": "1/27/2013",
    "text": "I am happy that I finally found a good pho restaurant in Pitt. Service was a little slow but I didn't mind because the food was so good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BQmLmiApYqDRFnhqk_o0Pw"
  },
  "P4TLpM0SE4fkO4YsF7E5aQ": {
    "date": "9/4/2012",
    "text": "Best over-all Pho joint / noodles / banh mi joint in PGH. A good selection of variations on Pho, the staple soup in Vietnam  and very tasty Banh Mi (Vietnamese hoagie, basically).  Their broth is the best most satisfyingly-seasoned and spicy hot of any pho joint in Pgh area. Nothing worse than watery bland pho broth.  My personal favorite is \"Bun bo hue\" which is a spicy orange-colored cousin of Pho.  Other , more solid dishes to be had, as well. They have recently relocated further west along Penn Avenue because that other building they were in was bought out and being turned into expensive Apartments -  go figure - who would have guessed that would happen ? The new space is very small unfortunately but cozy. I don't like the cash-only as payment policy as it is backwards and people are probably more likely to stiff their server on the tip and just extremely inconvenient if you don't walk around with a lot of cash in your pocket all the time. Outside of that, highly recommended for your Vietnamese / Pho cravings / fix .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ekUMPGWf4QB5uj6yAvGIw"
  },
  "ysaLRF2SueqLi7aNwpnYxQ": {
    "date": "3/18/2013",
    "text": "LOVE, LOVE, LOVE the Pho here. It's about as good as it gets! Hot, flavorful, traditional. I can easily eat here once weekly.  The service is fast, teh staff and owner are exceptionally friendly. The biggest problem I have.... is choosing between the #9 Pho and the grilled pork hoagie. Decisions, decisions.......most often, I choose both! P.S: Please start taking credit cards :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "igCWI64uVJMRZKIt2OKBFA"
  },
  "6O-nyGFuADf15oQTxBafqA": {
    "date": "9/6/2011",
    "text": "What can I say, way better than Tram's.  Though I think most people are too hip to actually figure that out.  You can get your meat raw and submerge it into the broth yourself, the broth is authentic, and you can get the chili oil instead of sriracha and hoisin.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HnKpnz9Rt-aWpG0KW8WL2A"
  },
  "hwqOxewDsTAqDyfdlObARg": {
    "date": "7/30/2009",
    "text": "I have an  intense relationship with vietnamese food. I crave good pho like I do a hot steamy...yes I love pho and this place is a sham. Yes, they have a legitimate website but if you ain't gots the lemongrass on the menu it's NOT a full on vietnamese restaurant. Plus the lady who waited on us spoke in Mandarin, not vietnamese,  with my bf.   The pho was one of the greasiest, saltiest, flavorless pho I've ever had but It curbed my craving enough for one star and the ambience and plus one made the experience pleasant enough for another star.  And I'm always always astounded by the price of pho in pittsburgh. It's ridic.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HlFx562GFpbL9VmILh2Osg"
  },
  "pfYqW2b_9KbSaYb5TO-Fow": {
    "date": "12/21/2011",
    "text": "That's me in the corner with my head submerged in a bowl of Pho. Excellent- fresh, not greasy, distinct flavors, beautifully done.  The pork bun thit nuong is to die for.  Can't wait to do it again!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vSeltqO5Yn08_wKDlnQqXw"
  },
  "oZLJaa78pf-FhlmjUqOpCQ": {
    "date": "8/4/2011",
    "text": "Their broth needs quite a bit more work.  It wasn't as flavorful and \"OOMPH\" like a good Pho broth should be.  I had the sliced beef/meatball/tripe Pho and the ingredients seemed fairly standard quality but the meatballs seemed as if they were store-bought from the local Italian market.  Service was friendly, the price was a bargain, but the soup wasn't where it should have been.  The spring rolls were loosely packed and devoid of much flavor.  Think of it like a lettuce and rice noodle rice-paper burrito.  Not too impressed with the spring rolls.  I am a Vietnamese Pho snob so while this restaurant may be suitable for many, it just doesn't compare to other Vietnamese restaurants in other cities.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "OPiV-yNPoLf57J1OWUdylA"
  },
  "k0cDigmjJl-m15rmJtHzJA": {
    "date": "4/6/2014",
    "text": "Delicious and cheap, had a #25 (beef soup with carrots and rice noodles) for 10 bucks and loved it. Of course, more than 1/3 I'll have tomorrow for lunch",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J1eLG-wXf4D_vcUhGvq2ZA"
  },
  "-Dhp4C3IMQcwME4XB0A0FA": {
    "date": "8/27/2011",
    "text": "I went to Vietnam's Pho for lunch on a Friday. I was seated quickly and offered a menu and water. The menu is not large focusing on noodle dishes, rices dishes and pho. The service was quick and I was not waited on by one server but by a 'team' of servers. I had Pho Tai (Beef Eye Round Noodle Pho). It was excellent and there was a large amount of condiments to add, basil, mung bean sprouts, jalapeno peppers, and lime.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GO-8SNqcUwajuTSl_rSIGg"
  },
  "tH6L7RT9IP7avDqQNTBZlA": {
    "date": "4/12/2014",
    "text": "Way better than Tram.  Hands down the best Vietnamese restaurant in Pittsburgh.  Their pho was excellent.  I got their classic, an amazing broth.  I also go their sandwich was exceptional as well.  Will definitely go back...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnNAYd7tKwdxHt7UuwcErA"
  },
  "Gpl_2_XXYHecaRRoiDBlDQ": {
    "date": "5/5/2016",
    "text": "I really enjoyed this place.  It was my first experience with Vietnamese food, and a large group of us went.  We were all newbies and were confused about the different additions and if all the soups and pho's should get everything or not.  Our server was EXTREMELY helpful and went over each individual dish with us about what he would recommend adding.  I got a vermicelli soup instead of pho, and the noodles were delicious.  The broth itself was really good and complex.  I would have been content to drink that alone without anything else.   I would definitely go back here if I'm craving Pho.  It is a cash-only establishment, but they make it pretty obvious with all the signs posted around the restaurant.  The ambience isn't anything special.  It seems like a pretty run-down venue, but luckily the food makes up for it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tfs-CSaJuQtnEsdBm7fVnw"
  },
  "MnSrYqgU74iIlBp81CE8XQ": {
    "date": "3/20/2017",
    "text": "Whenever I travel for long hours, this is my go-to stop for a comfort meal. The broth might be a little too much but I am fine with it. The portion fills you up if you are really hungry. I always get the pho with beef, it never goes wrong. This place also offers bun-vermicelli, rice plate, and sushi. I definitely recommend trying the appetizer Goi Cuon, a spring roll wrapped with rice paper. It has shrimp, pork, vermicelli and fresh vege. Love it!!  PS. Everyone is really friendly!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "X19u2P5C8sMZdt8db3Zdeg"
  },
  "nqbhomABOBqKRSH9MEv2-w": {
    "date": "9/11/2017",
    "text": "My entire 23 years of life I have never been a fan of sushi. But once I gave this place a try earlier this year I could not get enough. I'm being serious here people, I would eat here at least once a week. Which I probably shouldn't admit but this place was amazing.   Not to mention the people that work there are so friendly and kind! Loved talking to them when I would go in to pick my food up.   Thanks for re introducing me to sushi and having a great experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gzl9GMCQ_Uhsd292I0e24w"
  },
  "0pD18xYclIKgZbb5Ft40-g": {
    "date": "1/1/2017",
    "text": "I don't know the whole story behind this sushi place merging with Vietnam Pho, outside of there being construction in the old building. I didn't see any of the owners that were at Vietnam's, so who knows?  I used to always take a trip to Vietnam's for their consistency in their pho and since we saw Maiku does sushi and pho it worked out that I wanted pho and my husband wanted sushi, until we got there.  Atmosphere: So a few things, it is very small in there. So if you like a little bit of elbow room or don't want to essentially be sitting right next to other patrons, then maybe take a drive to Squirrel Hill or down the street to Pho Van. There is also not much seating, so if you have a lot of people, it may not be the best place. There were two semi large groups when we arrived and we thankfully were able to find an unused chair to grab it for our table. Outside of these, it's very basic inside, nothing fancy, which is perfectly fine for me.  Service: The service definitely depended on who walked by you. The older woman initially is the one who sat us and was very pleasant. Our server, was the younger woman, who was very quiet (as in, we couldn't really hear her). We were handed our menus and finally figured out what we wanted and were ready to place our order. At that time, is when she finally told us they weren't serving sushi. This information would have been super helpful when you handed us the menus and asked for our drink orders! Especially considering their menu is half sushi. Our waters took a long time to be refilled. And my appetizer was brought out AFTER my main dish. So, I wasn't overall pleased with the service considering some serving basics were lacking.  Food: Food was 50/50 for me, so I will break it down by what we ordered. Fresh Spring Rolls: These were lacking for me. They were very poorly made. As in, they were almost falling apart when they came to the table. They were also brought after my main dish which I found slightly odd considering they're also a sushi place. So, my assumption is, they're good with making rolls, considering they roll sushi. But apparently not so much. The lettuce was chopped much too thin and they just lacked freshness and flavor that you typically get from green onion and now that I think about, I think mine were missing the pork.  Pho: Their pho was decent as usual (I always order Pho Dac Biet). The broth was a bit peppery though. Someone definitely added quite a bit of black pepper to the broth. It could have been a touch beefier, but that's ok. Once I added in my toppings and things, it worked for me. Unrelated to the pho itself, but the bowl it was served in wasn't the greatest. The edges curved outward, which was sorta annoying when mixing up your pho a bit because broth would go over the curved edge.  Com Dia: My husband ordered Com suon-bi and his dish looked pretty tasty and looked pretty consistent from Vietnam's when I've seen others order it. I tried his pork and it was spot on and very tasty.  Bubble Tea: We used to enjoy going to Vietnam's for their good bubble tea selection. They still serve bubble tea here but, the tapioca balls were not good. They almost tasted stale? I ordered a Thai Tea bubble tea and my Thai Tea was perfect so I drank that and left all my tapioca balls at the bottom. My husband agreed that the tapioca balls tasted off.  Banh Mi: We ordered two banh mi's to go for dinner. Just say no. They were not good and not very authentically made. The bread was far too thick and sorta tough. They add cheap lunch meat to it which makes it extremely salty and just not good. Their pate is far too runny. Quite honestly, you can get a decent banh mi at the Oriental Grocery in McKnight for cheaper than here and with better ingredients.  ------------- Would I go back now? Honestly, probably not. Considering there are other pho locations that are just as good, I will probably go to those. I can't speak to their sushi, which may be great, but this visit has me not really wanting to go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "m9gbVx5omWOpZMoorxvHQQ"
  },
  "CmnZKnXPCP-kgzitU29WUA": {
    "date": "2/15/2018",
    "text": "Hit the spot. Solid sushi rolls that are inexpensive enough to try a wide range of them. Friendly, fast, casual, left happy :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-M2EQdc5NB-nFpff5RxC4A"
  },
  "nh4RBllQJGfPlk5ie9XQig": {
    "date": "8/5/2018",
    "text": "This is the best pho we've found in Pittsburgh. And we've looked hard. Their broth is flavorful and nuanced, just like it should be. The vermicelli bowl and the bun are quite good and we also like the sushi. The prices are very reasonable. Though the dining room is super small, we've only ever had to wait once, and that was because a convention group had completely filled the place. Even though there is a pho restaurant less than a mile from our house, we drive to this one because it is so much better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pki4sl8Cvp6IqAOmQ0rC_w"
  },
  "r2Hf7NWQw6hRdexItIi4qw": {
    "date": "8/14/2016",
    "text": "The pho is really good, especially the broth! It's weird getting inside this restaurant though. You basically have to enter through a random warehouse door that's out business, cut through some restaurant that looks super dirty and then you're in the pho place.  The food is great and even though they have signs posted all over the place that they only accept cash, I've given them my credit card every time i picked up my order and they run it with no problem ha",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Z26i4Awq1_cRMw35LmX9Q"
  },
  "JCx2UiSj6uSLumANQGTO9w": {
    "date": "6/11/2015",
    "text": "After reading all of the reviews on here I wanted to try this place for myself.  I consider myself pretty adventurous when it comes to food and I'll try just about anything once, so it surprised me when I realized that I had never had Vietnamese cuisine before.   Upon reviewing the menu, I was very thankful that they include descriptions of the dishes under each entree. I settled on the Bun Cha Thit Nuong  which was described as having charbroiled pork with bean sprouts, lettuce, herb, cucumber & peanuts on vermicelli with a crispy spring roll.  Grilled Pork and veggies; how could you go wrong?  About five minutes later I had my \"Bun Cha\" in front of me.  Here's where I discovered my ignorance.... I swirled my chop stick around the noodles ensuring to include a nice piece of pork  and when I tasted it I found, to my surprise, that it was cold.  Very tasty mind you but cold.  I'm at least proud of the fact that instead of immediately calling the nice lady who waited on me over, I had the good sense to Google what it was that I was eating.   It turns out that Wikipedia described my dish exactly how it was served to me: \"Bun tht nng (literally means \"rice noodles [with] grilled meat\") is a popular Vietnamese cold rice vermicelli noodle dish topped with grilled pork, fresh herbs like basil and mint, fresh salad and bean sprouts, and ch gio (spring rolls).\" Yes, the good folks at Vietnam's Pho do indeed serve up authentic dishes. Although it wasn't what I expected at first, I did find the meal very enjoyable and I look forward to coming back and trying other Vietnamese cuisine here.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cXHA0PMQDrCb9Td6sly4vg",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Bun Cha Geo Thit Nuong",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cXHA0PMQDrCb9Td6sly4vg/o.jpg"
      },
      {
        "img_id": "IqiNeq-TRCmerYxxAOEGZQ",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Vermicelli Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IqiNeq-TRCmerYxxAOEGZQ/o.jpg"
      },
      {
        "img_id": "hdH43b154C1zuct5BnVcmw",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Rice Noodle Soup Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hdH43b154C1zuct5BnVcmw/o.jpg"
      }
    ],
    "user_id": "cUqU7UfSaamDg0L5TIJPRg"
  },
  "x8iubNvHFjJ87C0nEvihkg": {
    "date": "4/30/2013",
    "text": "More of a 3.5.  Ordered a vermicelli bowl with the shrimp and grilled pork. All the flavors were good and fresh, though the noodles could have been a bit softer.  The pho everyone else ordered looked good, and they liked it.  Service is efficient and prompt.  This is a quick and easy Viet food option in the Strip if you're on the West end.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "UOIf6Ozwq6imqy9BXEp3ew",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UOIf6Ozwq6imqy9BXEp3ew/o.jpg"
      }
    ],
    "user_id": "jyoRTd9KbwzWI16gh8sdaA"
  },
  "3z8yW_qcqGHmGvg9mqBaOA": {
    "date": "10/31/2016",
    "text": "Was one of the better Vietnamese restaurants in pittsburgh but the food went from great to mehhhh. Such a disappointment because it's in the the heart of the strip district. After multiple managements everything began to deteriorate. To the point where the wait staff was doing you a favor by bringing out your food to you and there's always only enough garnishment for one bowl of pho regardless if you order 1 or 3",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_-yFnMPrRqMqc07SeIBDDg"
  },
  "vLslnaBvU6R3L6z5V7UQaQ": {
    "date": "11/11/2017",
    "text": "This has been our go-to place for pho for over eight years (previously Vietnam's Pho). It's by far and away the best in the city.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hC3BdEGAB7Ckg6Hb5eSFcg"
  },
  "cqU3X59i2L0kayg38hEE8g": {
    "date": "3/19/2015",
    "text": "Any sit-down restaurant that doesn't accept credit cards get stars taken off, period. If you're big enough to offer a full menu with at least 30 seats, you better offer credit cards as an option as well.  I've never had bad pho because it's a rather simple dish so the taste was fine and the Thai iced coffee was delicious. The service was on the meh side and the waiter/bartender/owner was really bad at answering any questions I had. The beef slices weren't as appetizing-looking as some other pho places I've been to but the taste was all right. The location was good because it was right next to Lotus Foods and all the markets on the same street.  Overall, I would probably not stop here again since Pittsburgh has a ton of varied Asian joints and this one wasn't too special or memorable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "8DclOINSPldMTgiEbuCdoA"
  },
  "OtW6EN5Gn3dsP6q6GjE2Ow": {
    "date": "11/23/2016",
    "text": "Used to be a decent place until they moved Vietnam Pho's in to their space and got rid of their lunch special. You used to get 2 rolls and a drink or salad for $9.00. They have a good range of sushi at a decent price for the strip district and you can call and order ahead for pickup. They make everything fresh and right in front of you. Owners are nice and welcoming most of the time. Rice has a different texture than other sushi restaurants I frequent, which isn't necessarily a bad thing. I like the eel, shrimp tempura, and Pittsburgh rolls from here. The salad dressing is amazing, and I recommend it.   Recently a group of 6 of us went for lunch (we get an hour) and got up and left because the service was so slow. We waited 15 minutes and never got drink orders taken or really even acknowledged. Unfortunately the owner is slow when making sushi, so making 12+ rolls would have taken forever. This is the 2nd time we've had to leave due to service issues. Another time was because all of the tables are for 2 people except the one, so it's always hit or miss. If you can get in and get waited on without time restrictions, it's a good place, but now with the addition of the Pho menu, it takes longer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fT9aijBuDSvItzBDBS_sMg"
  },
  "G3ZPfnJ7_UewbRiz6LPWyg": {
    "date": "8/5/2016",
    "text": "Favorite spot of all time! My first time eat Vietnamese food is here and I start to love Vietnamese food because of this place. My favorite dishes is vermicelli noodles ( the one without the broth) top with grilled shrimp, BBQ pork, spring rolls and dressing on the side. It's amazing!!! Thank to my boss took me to this place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RNwH3jsNw_sX7gUrPBQSZg",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Bun ~ noodle with pork",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RNwH3jsNw_sX7gUrPBQSZg/o.jpg"
      }
    ],
    "user_id": "SUXM0U20tBmwE8a80K-Gsg"
  },
  "XVwSdtFDRpaYfr0juMu47A": {
    "date": "12/23/2016",
    "text": "These are family oriented folks with a great menu. I randomly stumbled upon them while thinking about sushi.  They have options for most dietary needs.  It's worth a go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z3gAazmpfzp-fD5DAcFjdw"
  },
  "r7nFESl9jQSuQ8B0L3OWaA": {
    "date": "11/10/2014",
    "text": "I love pho.  I swear it has magical curative powers.  I have to say, I am quite disappointed with how few pho restaurants there are in the Pittsburgh area.  This was the first place I tried Pho while in the Burgh.  I wasn't disappointed but I wasn't overjoyed with the experience either.  I found the pho to be just OK.  It needed quite a bit of siracha and hoison sauce to give it good flavor.  That being said, the portions are HUGE, so you do get a lot for your money.  I have also tried the fresh spring rolls.  They were plump and full of shrimp, pork and great flavor.  I LOVE their peanut sauce and they will give you extra without charging for it which is a plus.  Service was a bit slow and unattentive.  He was pretty engrossed in something on his phone and one of the other tables actually walked up to the bar to be able to get his attention.  I know it is extremely casual, but with it being table service, you shouldn't have to hunt down the server, especially when there are not a lot of people in the restaurant.  It is a cash only restaurant, so make sure you bring cash or use the ATM they have on the way in.  Overall, a decent experience and it will do when I really want pho.  I guess I was spoiled by the amount of high quality pho restaurants back home because none have been quite as good as what I had gotten used to.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_VTEyUzzH92X3w-IpGaXVA"
  },
  "vbbKUnKhJcobNZYTic0jWA": {
    "date": "3/21/2016",
    "text": "This is a great lunch spot! I wish I worked closer so I could go more often!  The place is quite small, but it seems that they do a lot of their business with take-out lunch orders, so we didn't have any trouble getting a table.   The man and woman working there were SO incredibly kind and welcoming. I felt like I was being served lunch in their home! I witnessed their interactions with a few people who came and went while we were there and was very pleased. They seems to have a great relationship with their regulars and it is no wonder people keep coming back!  They have a great special which includes 2 rolls and a soup or salad. We ordered 4 rolls, a soup, salad and 2 drinks and it came out to just around $20. They do not have any special rolls, just the basic Spicy Tuna, California, Shrimp Tempura, Salmon, etc., but everything was fresh and made to order.   If you are in the strip and craving some sushi, check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "5IaHGddT0RLq1-S5LbP1iw"
  },
  "QR6JB-zC7Hv2WTF_bZW4mA": {
    "date": "4/19/2018",
    "text": "I'm obsessed with Maiku's pho and banh mi. I've tried other Vietnamese restaurants in Pittsburgh (Pho Minh, Tram's) as well as in different cities and even countries (Las Vegas, LA, Tucson, and Seoul)-- and Maiku has hands-down the best pho. Just writing about it is making me crave it right now! I'll definitely be going soon, hopefully next week!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NNUde28sG2YWVaBhPod2_w"
  },
  "DzTV8P4UNlq-4iAnhJ0xWg": {
    "date": "2/8/2012",
    "text": "This is the best pho in Pittsburgh.  I'm sorry, was that not detailed enough?  This is the best pho in Pittsburgh. Hands down. They serve you wooden chopsticks so your noodles don't slide off. The broth is perfectly superior to your other pho options. They don't try too hard to be something they aren't. They only accept cash. The spring rolls are a nice appetizer if you think you can scarf down more than a bowl of pho.  Walk in, sit down, and before the waiter leaves the table, ask for a Number 11. This Is The Best Pho In Pittsburgh",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "wIhBpfk3N-eiTinVAOASRA",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Number 11",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wIhBpfk3N-eiTinVAOASRA/o.jpg"
      }
    ],
    "user_id": "xhVlmdU1sPVH6GBJw6AZtQ"
  },
  "9PDi3xy6U_5gAol13MM5Bg": {
    "date": "4/10/2017",
    "text": "Got a vegetarian noodle soup here and was perfect!! The manager/cashier was so pleasant and courteous. Was a great experience overall. Wish I could come here more but need to fly back home!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "soIOfkANoQ6IOcMygdkLgg"
  },
  "zaxEmeV4bPeJydpWxDYXWg": {
    "date": "11/25/2018",
    "text": "This has been my favorite pho in Pittsburgh for 7-8 years. Pho is the ideal winter food; super warming and comforting. Maiku has a great, flavorful broth and I've never felt shortchanged by the amount of rice noodles or beef. I always leave here with a full stomach, and the staff has been super friendly from their old location to the new, smaller restaurant today.  I grew up coming to their old location a few doors down when my family visited the city. Now that I live here, I've taken my girlfriend twice and she loves the pho as much as I do. She is celiac and the pho is naturally gluten free. No contamination issues here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nRBmjvwMiLXbHMyjUmnzLQ"
  },
  "J1SfYjB4mINMF4H-B9_sGw": {
    "date": "5/3/2016",
    "text": "This may be the most oil free pho I've ever eaten!  Simply put, we came to Pittsburgh to specifically eat at the yelp famous Gaucho Parrilla Argentina just down the street. My kids hated the super charred flavor of their burgers and rib eye steak sandwich, so I had to quickly find an alternative eating venue to satisfy their teenage hunger. Although Gauchos is Pittsburgh's highest rated restaurant, I must admit I was not a fan, but I was not nearly as disgusted as my kids.  We ate a few bites there and decided to give Vietnam's Pho a try since we'd parked practically right in front of it anyway.   Yelp reviews had the overall rating here @ 3.5 stars, so I figured I wouldn't be too disappointed. However, the lack of customers and weirdly abandoned looking entrance made me pause. The entrance looks like the lobby of an old apartment building. You then walk through more doors into another space that serves as their to-go sandwich shop before walking through yet another door into the main dining area. It was dark and totally weird with a fish tank dead smack in the middle of the room, but we were hungry and decided to give it a try anyway. So glad we did!  The pho came out piping hot in a nice size bowl. I was immediately impressed that I barely saw any oil droplets on the surface. This is either an indication that they don't cook their broth using beef bones/stock or they meticulously skim the surface to give you the cleanest broth experience possible. Honestly, it may be the former! But that old familiar pho flavor I love was apparent, so I am giving them the benefit of the doubt and assume they did the latter.   FINAL THOUGHTS  Good pho at a great price. This is not the place you'd come for ambiance, but I'd recommend coming here for the pho... fuh-sho!   2016/74",
    "rating": 4,
    "rated": {
      "funny": 84,
      "useful": 111,
      "cool": 105
    },
    "photos": [
      {
        "img_id": "ios6sVFolUCDgRJma-tkSw",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Meatball pho. SIDE NOTE: I love that they didn&amp;#39;t automatically add cilantro to the broth! I hate cilantro.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ios6sVFolUCDgRJma-tkSw/o.jpg"
      }
    ],
    "user_id": "JjXuiru1_ONzDkYVrHN0aw"
  },
  "XJfFDzdrqFopjsZZaRY0Yw": {
    "date": "7/20/2017",
    "text": "Quick little sushi and pho spot right in the strip. Nothing fancy, just good, tasty food. The have an expanded menu that includes sushi, Vietnamese and Thai food, and it's a reasonably priced. Nice people and quick service. I will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "L0gtDTXCP2J8JI9ZvXWahw",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Grilled pork bhan mi sandwich.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L0gtDTXCP2J8JI9ZvXWahw/o.jpg"
      }
    ],
    "user_id": "e3dtWb_6aL5-afvXM9f7qw"
  },
  "zZlU_S8Ow-RtpOqaZ5-m_Q": {
    "date": "6/27/2017",
    "text": "I've been visiting Maiku Sushi weekly for about a year now. The're Pho is the best in Pittsburgh. Believe me, I grew up near little Vietnam in Southern California where Pho and Bahn mi rained from heaven like manna. Well, not really, but it was a lot easier to find. Anyway this is just as good as any I've had in my life.   In addition to the top notch Vietnamese food, they have refreshingly simple fresh sushi. You know, the kind where you can actually taste the fish. You wont find any of the over sauced, cooked, falling apart, wont fit in your mouth, old-white-people garbage that costs $15 a roll over at Saga.  And, as if that wasn't enough, they're some of the friendliest people I've ever met working at a restaurant. They remember people's names, play with the kids and just always seems happy and welcoming.   If you're still reading this, you should already be in the car pulling up directions on your phone. The only reason I'm not there right now is that they aren't open at 9am....",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tat_LEGUGaF0y5OGWjp_8A",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. #5 Do it.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tat_LEGUGaF0y5OGWjp_8A/o.jpg"
      }
    ],
    "user_id": "La7sjxL5OgWUBfjpaPBNtQ"
  },
  "umzVOdBLDy2oZzOTMqmujw": {
    "date": "1/6/2017",
    "text": "Vietnam Pho meets Maiku Sushi in an all-out merge of Asian cuisine.  We went here on New Year's Eve, Pho-la-la-la-la, la-la-la-la!  Confusion set in as I approached the building... Where is Vietnam Pho?  Pho napped????  We enter, much, much smaller than their last venue.  We were quickly greeted by a waitress who I immediately questioned regarding the name and location.  She assured me Vietnam Pho now aptly named Maiku Sushi & Vietnam Pho had moved to this much smaller front next door and were still the same but offering sushi as well.  Relief set in.    This new space only has about 10-12 small tables.  We were the only ones in here at the time minus what appeared to be an extended family enjoying some end of the year noodles.  Think Christmas Story.   We were disappointed to learn that though they now offer sushi, they were not offering it that night, nor were they offering any Banh mi.  Bummer on the sandwich part, but pho was the real reason I was there so I pho-got about it quick. See what I just did there???       We ordered Goi Cuon (2 to an order) spring rolls with shrimp, pork, vermicelli and fresh vegetables rolled in rice paper.  They were served with a nice peanut sauce.  Very tasty, could have ordered a couple more, but had to save some room.  I went with the Pho Dac Beit, the queen-mother of all Pho.  They served it up nice and piping hot, with lots of additional fixings per my request.  Smiles in my tummy.  The broth was tasty, but not over powering as to assume a ton of salt or God forbid MSG was added.  The noodles were plentiful, and cooked nicely.  The tendon and tripe were not rubbery as some places tend to serve them.  This was a good looking bowl of food, dressed well under my layers of toppings.  The price isn't terrible either, about in line with the rest of the Pho restaurants in town.  We also had leftovers.  I recommend having them box leftovers.  I tried and miserably failed pouring broth all over myself the table, floor, you get the picture.    I have to say, though I can't really recall if this was the case at the last location, they only have a basement bathroom.  This is quite popular in Pittsburgh, but if you are handicap or in my case recovering from knee surgery it is really difficult to maneuver the steps.  Not only is the ceiling way low but the steps are deep.  I thought I would have taken a tumble a couple of times.   Great way to end 2016, looking forward to some 2017 Pho-sho.",
    "rating": 4,
    "rated": {
      "funny": 17,
      "useful": 29,
      "cool": 29
    },
    "photos": [
      {
        "img_id": "qCs1kTutY5n65lL72selQw",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Dressed pho",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qCs1kTutY5n65lL72selQw/o.jpg"
      },
      {
        "img_id": "jGPpoiW13Vjk4Vv3WRl5ew",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Undressed Pho Dac Biet",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jGPpoiW13Vjk4Vv3WRl5ew/o.jpg"
      },
      {
        "img_id": "2ee4ZgSwAAKUCFXfvDc_Gg",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Plate of toppings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2ee4ZgSwAAKUCFXfvDc_Gg/o.jpg"
      }
    ],
    "user_id": "_5fx5gexi9OeZIuukV2gHQ"
  },
  "IZhAeRnKk7y4TpM4ExCttA": {
    "date": "2/19/2017",
    "text": "Totes adorbs tiny place for pho and sushi.  It wasn't too busy here for our nice, slow Sunday brunch.  Service is way above average for an Asian eatery.  None of the sushi options sounded very exciting, so we went with the Vietnamese offerings.  02. GOI CUON:  A must order for me at any pho joint.  These paled in comparison to Pho Van's, sadly.  The rolls were stuffed with shredded lettuce, and the taste of the rather pork overpowered the shrimp.  On top of that, both were shoved to the background by the basil.  Good thing I'm a basil fan, but this addition would have been much improved if they had chiffonaded it and dispersed it throughout the roll instead of making you bite off a whole leaf at a time.  We left half a roll behind.  The dipping sauce was nice and sweet, but sadly tasted very mall-food-courty and not very peanutty at all, despite the big crumbs of peanut they sprinkle on top.  I usually view everything on the table as fair game as a vehicle for peanut sauce, but this rendition just wasn't doing it for me.  11. BO BUN HUE: They made this extra spicy for me and it was HUGE.  The meat was fairly sparse, with only a few pieces of shaved beef and 2 slices of pork roll, but I was super pleased with the amount of broth I received, which is what I'm all about.  Noodles need not apply, as I never find that pho noodles are anything to write home about.  While the broth was spicy and rich though, I found that it lacked the depth and umami that my favorite bowls in Pittsburgh have.  The usual accompaniments of basil, lime, cilantro, and sprouts were served, along with some shredded red cabbage, interesting.    BANH MI 1. DELUXE HOAGIE: A brilliant size for a $6 sandwich.  I appreciated the traditional fillings, but this was a bit bland.  It was missing some type of sauce, like Lucy puts on her banh mi's at her eponymous stand further down the strip.  That sweet sauce she brushes on her sandwiches is like crack, and Maiku's could have used something of the sort to make the various meat fillings come alive.  The major major issue, though is that the bread was baguette-level hard, almost in a stale sort of way.  As in, way too hard for a banh mi-style sandwich.  It made my husband's jaw hurt to finish it, and he's pretty much a sandwich-eating pro.  BUBBLE TEA 12. MILK TEA:  Moderately milky, the tea was okay, but the boba was bland.  We finished the tea but left the rest.  The atmosphere here is a nice stop for a leisurely meal, as I'm a fan of cozy spaces, but everything we ordered was just a bit off our preferred taste.  Most importantly, as much as I wanted to like Maiku, I don't see myself returning to any place that can't nail a peanut sauce.  I have my priorities, after all.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "Yk6WWwezDBeQB3Kpb7xehA"
  },
  "0-rgkshWRcq7GhHkTI5AVw": {
    "date": "6/14/2018",
    "text": "This was a neat lil sushi shop we stopped at while traveling. The sushi was fabulous & the staff was great. They were funny & very personable & friendly. If I lived closer, I'd visit more often.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PlFHxlbXynyDLi3EasVF8g"
  },
  "h47hl2OE6b-2VaDJiWoVBQ": {
    "date": "8/10/2018",
    "text": "Fast,friendly, and precise. The food here was excellent, good size portions and very friendly staff. The only reason I didn't give them the full 5 stars is because of the location,parking is hard to find.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sNv1HklZHupXu0Q4bv1pow"
  },
  "mPg75iBKQz89o3cN9ekplA": {
    "date": "7/29/2018",
    "text": "Beat pho in Pittsburgh by far. The broth is tasty and no need to add any other condiments except the fresh herbs. Hole in the wall find, if you are interested in those types of restaurants. Food was served fast and even nice recommendations if you don't know what you want.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "unIoQaYMe26vYyfB8JkE4Q"
  },
  "Mys33BXqRsrXdMsBmE9NKQ": {
    "date": "9/8/2017",
    "text": "I had a lot of great pho restaurants around me where I grew up in the Denver area and have been on the hunt for an equally tasty place ever since I moved to Pittsburgh 8 years ago. Out of the places I've tried, Maiku has had the best flavored broth. Bland, inadequately spiced broth is the biggest disappointment with pho, so that alone makes me want to come back!  It was fairly cheap (i.e. $9-10) for a filling amount of noodles, so very affordable. I do wish it had a bit more meat though. 5-6 pieces of very thinly sliced meat doesn't amount to much. Overall though, it hit the spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sf0RH8LY57UU__Bgf3rBkQ"
  },
  "BGkBZD7De7nyZNJ380ItHQ": {
    "date": "1/13/2018",
    "text": "Maiku is a great place to hit for solid PHO. My wife, from Hong Kong, and I love to hit this place for our comfort food. We have explored the majority of the menu and we have not been disappointed. The staff is friendly and makes us feel like we are back overseas.  This place is a hole in the wall family run restaurant that gives great value for the  money. I cannot say enough about the quality of the food.  I highly recommend you give this a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJnR4ZtomclxJ3JiYGWJnw"
  },
  "sq5jjIo6giWlDKjuKqiCiA": {
    "date": "5/31/2018",
    "text": "Delicious sushi and awesome lunch special! They messed up my friends order but even after declining a replacement roll they made one for him anyway  very nice people- small place inside so expect a wait if they're busy! It's worth it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q8NB16E8PLfSlAXj3fESww"
  },
  "YPse2xl5pz_R550Yk0K_NQ": {
    "date": "1/4/2019",
    "text": "Whenever we visit the strip, we must go for our favorite Pho at the strip.  Best tasting broth and very friendly owner and service.  Why can't we get good Vietnamese food like this out of the city?  We need a place like this east of Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q1QMN-rL3lSowgTfPPDJ4w"
  },
  "xjW-h7rZbcFs318DajQVuw": {
    "date": "5/25/2018",
    "text": "How does this place not get 5 stars? It's the best! Friendly atmosphere and wait staff, and the best pho in Pittsburgh. Their sushi lunch special is also bomb. Don't be fooled by other competition in the strip, this is hands down the winner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vwlxC6BMJIj2anCNHACeiA"
  },
  "qILZAv8Jje0ZhXlhpnVW4w": {
    "date": "11/20/2018",
    "text": "One word: Amazing! This place is a hidden gem. Food is amazing and costumer service is great.  Price is excellent and you receive a lot of food.  They support their troops so that alone is a very good reason to support them.  They are very attentive.  I will definitely come back.  If you are in the area, support them and try for yourself. You will not regret it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Bv7l_W0oG0lYqYY3FV0dA"
  },
  "8lsbqkQqu_qcRcgiNrnXmA": {
    "date": "4/17/2016",
    "text": "So after a long week of trying pho in Pittsburgh, my friend who is married to someone who happens to be Vietnamese kept telling me to try Vietnam's Pho at the strip. She recommended this place because it's the most authentic. And I did...  You know it's all about that broth, right??? Oh my gosh... The unadulterated broth is delicious and amazing! In fact, I didn't need to add any sauce or spice to it. The add-ins were plentiful and I only needed one slice of pepper. Whereas other places I'd put all peppers and hot sauce to make it spicy. #9 is my favorite!  The fresh spring rolls with shrimp was so incredible and fresh served with a peanut dipping sauce. So fresh!  This is my definitely my go to spot for pho! I just love this place. I'm interested in trying out their sandwiches, boba, and other drinks next time.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "N6UBLA_sgpiJOKilSh_3sQ",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N6UBLA_sgpiJOKilSh_3sQ/o.jpg"
      }
    ],
    "user_id": "2IweYEr1K6vWxx428zZoVg"
  },
  "Ar3NzLYNw_LVJfwflPyeQg": {
    "date": "7/18/2015",
    "text": "I come here quite often and usually during lunch on the weekends. Let me tell you, it's not that they are the best pho place but in Pittsburgh,  choices are limited. I have tried various places in Pittsburgh and this was the one that I preferred to go to Pros:  - The food is pretty good - Reasonably priced - Plenty of sitting space - Portions are good enough Cons: - Must pay cash (this is a turn off as most people use credit/debit cards) - The food takes forever. There were times when we have waited for at least 30 minutes for 2 bowls of pho - Although the place It's spacious,  the place is not too well kept - Service is super slow. They are not attentive with refilling your water",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SLZ_EEjg32ZZCs6SoHD9bA",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Porkchops and rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SLZ_EEjg32ZZCs6SoHD9bA/o.jpg"
      },
      {
        "img_id": "xo6rQR3vpq-P6YAp_F0BGg",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Pho",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xo6rQR3vpq-P6YAp_F0BGg/o.jpg"
      }
    ],
    "user_id": "gmCK2ARSx22S_4_RQF9Jwg"
  },
  "tCHrzVql0QIjdz66s2JknA": {
    "date": "7/5/2015",
    "text": "Friendly owner. The food was pretty mediocre but probably the best viet food in the area. Their pho is fairly good but doesn't compete with pho in bigger cities. They have all the basic viet restaurant variety - pho, rice dishes, banh mi, and Vietnamese coffees.   Their sandwiches (grilled chicken) is worth a try. They're pretty big and is just $6. A cheap and fast place for a quick viet fix.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_GNetbsdbE1vuVIopztSag",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_GNetbsdbE1vuVIopztSag/o.jpg"
      }
    ],
    "user_id": "6knga-vNLcCxdQmhevWjTA"
  },
  "VQYmnzIFrBYcdQkdLJjeuQ": {
    "date": "9/14/2014",
    "text": "The entrance is a little hard to spot but there is a little sign in front of the white building.   We had the summer rolls and 2 bowls of pho. The summer rolls were fresh and made just the way I like them with shrimp and pork. They were def fresh and not pre-made. My boyfriend thought they would be better if they had more vermicelli but enjoyed the flavors.   The pho was generously portioned and they didn't skimp on the ingredients. The soup base was very good (a little on the sweet side) but authentic. They don't put as much meat in the #8 combo pho so I recommend ordering one of the other ones (#12)  Def want to come back and try the bahn mi   Oh yea cash only here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J6xEh_CmpQSlQxfAys7Apw",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Pho",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/J6xEh_CmpQSlQxfAys7Apw/o.jpg"
      },
      {
        "img_id": "-KKKLpowjaLdubbkkIJLUA",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Summer rolls",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-KKKLpowjaLdubbkkIJLUA/o.jpg"
      }
    ],
    "user_id": "MrI6H2qTp3JIQfPNPaqzPQ"
  },
  "kdWpd0hgftP4-WeVfHhk_Q": {
    "date": "8/27/2018",
    "text": "Despite its name, Maiku Sushi is really more of a traditional Vietnamese restaurant that does sushi and bubble teas as a bonus. I believe the owners used to run Vietnam's Pho down the block until they got priced out of their original location due to increasing rent prices. Anyway, in their new, smaller venue, they do just as great a job with traditional Vietnamese pho and banh mi sandwiches. I usually get the traditional banh mi (aka Deluxe Hoagie in yinzer terms) for just $6.50. If it's cold/rainy/snowing, I'm feeling a bit congested/sick, or just particularly hungry, I'll also get the Pho Dac Biet (the #5 Pho, which has all the traditional ingredients) for $11, which is large enough for leftovers the next day too. Arguably, the best Vietnamese restaurant in Pittsburgh, which is saying a lot since there's several very good Vietnamese restaurants in the area. They're definitely the best for me convenience/cost wise.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_R7QtJB86UbsFYehY4Wlrg"
  },
  "jinbGbC40wNkRislhbHunw": {
    "date": "7/21/2019",
    "text": "O o O o O o  this place was p good idk who's ever makin sushi and pho and I want both in my body most of the time so that's cooool  Ok so the sushi sooo I got spicy crab but it was a crab stick & mayo on top - wonky but honestly who doesn't luv crabstik The pho tho was so dang good ya that broth was givin me a hot case of the smile + they give u so many bean basil crap to shove in the broth bag eat it up  eat it yum",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TnhnKlmCMd8ZD9wSQDik7g"
  },
  "6q82W6jl1TMMSzhHFwvSpA": {
    "date": "6/7/2019",
    "text": "As I continue to embark on my quest for the perfect bowl of pho, I stumble upon Maiku Sushi.  Let's get to it!!  So far, of all the Vietnamese restaurants that sell this wonderful and comforting soup; Maiku has the biggest bowls. They also have tendon which is a favorite of mine. We order the spring rolls, have too because it sets the stage. They offered ice water and the cups were large, 16oz.  Which is great, I hate the little cups and the server has to keep running back and forth,,, nonsense. Anyway, spring rolls were tasty, now on to the pho. We ordered a number 5, Pho Dac Biet.  Now this is a hodgepodge of meat.  First time having Pho Dac Biet with meatballs, BRUH!  I've been missing out. The broth was flavorful, and the tendon plentiful, which I loved.  Not as much tripe as i would have liked but hey, I had tendon!   We ordered a grilled pork bahn mi. I was going to get the deluxe but my husband doesn't eat head cheese.  This sandwich was fire!  The grilled pork was tender, smoky, succulent!!  Combined with all the fresh veggies and jalapenos on a crusty roll... oh man!  You will not be disappointed!   It wouldn't be a complete assessment of the restaurant without getting bubble tea. I don't always drink bubble tea but once in a while, I get a hankering for some.  My husband has taro, his favorite and I did green.  I go between green and Thai.    The taro tasted like sweet cream, that's it. And my green tea tastes like cold green tea and 1% milk.    I will not get bubble tea again.  Which is why they get a four star rating although it's really 4.75 because I come for the soup, not the beverages.   Lastly, the price.  I've had pho at other places and the price was higher while the bowl was half the size with less of everhibf, including the accompanying sprouts, jalapenos, and basil.  Oh wait, they ask give CILANTRO.  I mean, come on, CILANTRO.  I was super happy about that, it was my first time experiencing Pho with cilantro as a side to add.    To sum it up,  Pho   Bahn Mi  Bubble tea  Price",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BWEpluqhpcacPQXn6xDRnA",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Grilled pork bahn mi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BWEpluqhpcacPQXn6xDRnA/o.jpg"
      },
      {
        "img_id": "WEJ0-iStd7w28ofKJthj2w",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Check",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WEJ0-iStd7w28ofKJthj2w/o.jpg"
      },
      {
        "img_id": "ezzTqRmV9EHoWKgVF8Qttw",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Outside",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ezzTqRmV9EHoWKgVF8Qttw/o.jpg"
      }
    ],
    "user_id": "sX3cvLnOE7z534dNtPAkDQ"
  },
  "NRUZn0KIp04BzPn_oD7x3Q": {
    "date": "9/9/2019",
    "text": "I've stop there 2 days in a row there's only about 8 tables but Ive gotten a seat each time and the same waitress who is really nice. I get the beef, tripe,meatballs Pho it's $12.50 and really filling. The owner has been there each time and is really nice. Lots of street parking",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "wVXQKeAF0m_rNY06hPx52A",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Big servings",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wVXQKeAF0m_rNY06hPx52A/o.jpg"
      },
      {
        "img_id": "IR5V46e_jZHQHwRhWcuJ2w",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Love the decor",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IR5V46e_jZHQHwRhWcuJ2w/o.jpg"
      },
      {
        "img_id": "_WhN5bz07Wn_jIh7mBzxWQ",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. They won an award",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_WhN5bz07Wn_jIh7mBzxWQ/o.jpg"
      }
    ],
    "user_id": "3xBFFH866WoySDG7uuwBSQ"
  },
  "v79MgdT8Y3wwwU1Ayuiulg": {
    "date": "8/9/2018",
    "text": "I was craving pho like a mo-pho. For restaurants in the Strip, Maiku is definitely one of my top choices.  Pho Tai-Nam ($9.99): The broth was BOMB, it was light but also flavorful. Everyone should taste the pho broth first and that'll set the tone if your meal is boutta be good. Had just enough meat and noodles, make sure you add veggies (beansprouts are a must)! Sriracha and hoisin are optional as some spice and flavor boosters. I was sooo full and I couldn't muster the last two bites. Hoagie Deluxe ($6.50): Classic banh mi here. Super delish and cheaper than other banh mi spots in the burgh. Sure it doesn't have a trendy interior like some banh mi joints in Pittsburgh, but it still is very tasty and worth your dollar.  Maiku is now my go-to pho spot in the burgh. And I've had some not so great pho at a couple places in Pittsburgh. The ladies that work here are very kind too. I have yet to try their sushi, but honestly, Vietnamese food is their strong suit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "t5-UcPX8RBlnhrZNVnXucg",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Banh mi deluxe $6.50",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t5-UcPX8RBlnhrZNVnXucg/o.jpg"
      },
      {
        "img_id": "aeF23LNTt3rgM_QgIvsE6Q",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Pho tai nam $9.99",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aeF23LNTt3rgM_QgIvsE6Q/o.jpg"
      },
      {
        "img_id": "yy8AidXgBZims3QXgi97hQ",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Menu may 2018",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yy8AidXgBZims3QXgi97hQ/o.jpg"
      }
    ],
    "user_id": "E1FJIPr-VRPotG8v6c2kaA"
  },
  "T2xJH_12AbIPoj9EXiyWUA": {
    "date": "8/8/2018",
    "text": "** Best pho in Pittsburgh that Ive ever had! Tasty pho dishes as well as other selections of Vietnamese Sandwiches (Banh Mi), sushi, and more.  Not feeling the long lines at Gaucho? Come check out Maiku and you won't be disappointed!  I've came here two times with my girlfriend, and both times have hit the spot. We ordered the Deluxe Hoagie to share, and our own bowls of brisket and steak pho (#8).   Pho - Definitely try the broth before adding in any srirracha or sauce - it tastes very flavorful and authentic. The meat in it also tasted really good in my opinion, pretty tender and flavorful. Throw in the basil and bean sprouts and you're in business.  Banh Mi - Pretty solid overall, tastes as you would expect for a banh mi. The jalapenos aren't too overwhelmingly spicy. The size is decent as well, but can also be good to share if you are hungry as I did. You can pick based on which protein you want, but the deluxe has a combination of more thinly sliced sandwich meats that could be a good starter if you don't know what to pick.   One thing I do have to say was that my girlfriend and I passed out super hard after the meal, must have been the food coma but I'd say it was well worth. A lot of times I don't leave Pho resturants feeling very satisfied, but this time we were both extremely full leaving the restaurant since the food was so good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OBtBh2Fo4v6X5otv0h2t-g",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Pho Tai",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OBtBh2Fo4v6X5otv0h2t-g/o.jpg"
      },
      {
        "img_id": "kI0xckmFMfQTGDQBPSKZjg",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Deluxe Banh Mi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kI0xckmFMfQTGDQBPSKZjg/o.jpg"
      }
    ],
    "user_id": "mxufNEcZIYndtjPHVtCh5w"
  },
  "UWhWz5VLetLbFWe4eqOJYw": {
    "date": "9/9/2018",
    "text": "Be careful what you wish for they say. I wished for a break from the past week of oppressive heat and humidity and got cold, rainy and dreary! I was in shock. So I hot tailed it to the comfort of one of my favorite bowls of pho at Maiku Sushi. So dang good I wanted to swim in the hot yumminess of Pho dac biet. The fragrant deliciousness of the delicate broth with the slurpy satisfying goodness of the noodles, meat and herbs righted all that was wrong that day :).   We started with some fresh shrimp spring rolls served with a peanut sauce. Yum. We also got shrimp tempura and spicy tuna rolls. Their spicy tuna roll is truly one of my favorites in Pittsburgh.   The place is not big or fancy , but the food is great and the people there are warm and friendly. It was the perfect antidote to the rainy day blues.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "romnHwHVW60hJLfGNk6imA",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/romnHwHVW60hJLfGNk6imA/o.jpg"
      },
      {
        "img_id": "rrduiR3IUI9_y1Nyss1u4A",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rrduiR3IUI9_y1Nyss1u4A/o.jpg"
      },
      {
        "img_id": "A1LICZW4VYwxNY_o_7kPPg",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A1LICZW4VYwxNY_o_7kPPg/o.jpg"
      }
    ],
    "user_id": "X315dgV7z031K70VD13uOg"
  },
  "qaQ5ts10wFEWzXESkhHEWA": {
    "date": "7/8/2019",
    "text": "This place was really just alright. The name \"Maiku Sushi\" is misleading; this place mostly serves Vietnamese food with very few basic sushi options. The food was quite good, but we would have really liked a better selection. The place itself is falling into disrepair, with tape covering holes in the walls. With a bit of work, this place could be fantastic. I hope it gets there someday!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pugYwS8NQ-1YXKyObABC2A"
  },
  "PD07IGOZrtQLBQqu5hsQvQ": {
    "date": "1/7/2018",
    "text": "This place was a pleasant surprise!  From the name, you would think that they only have Sushi but to my surprise, they also offer Pho, Vietnamese style rice dishes and appetizers as well!  I walked and heard classic Vietnamese music playing in the background and thought to myself it is a good sign.    I went on to order a pork chop over rice plate and nem nuong (sliced pork roll appetizer) to go.  The pork chop is marinated in traditional Viet style with the right amount of flavor.  A good tip here is to get the pork chop and rice only and not the pork chop and egg as you get more meat and better value.    I believe this is probably one of the first times I actually enjoyed Vietnamese food in PgH.  I will be trying their Pho soup next.  Oh wait, there's more:  springs, vermicelli bowls, and more!  I recommend!",
    "rating": 4,
    "rated": {
      "funny": 35,
      "useful": 52,
      "cool": 50
    },
    "photos": [],
    "user_id": "6tbXpUIU6upoeqWNDo9k_A"
  },
  "PSXJHmSvan1WQ_oiFiKPKw": {
    "date": "2/9/2019",
    "text": "Excellent pho, and currently my favorite place to get noodle soup in Pittsburgh. Service is friendly and fast, although the restaurant itself is on the smaller size-- seating around 14-16 total, so you might need to wait for seats during the busy times.   The soup was light and flavorful, meat was cut well and tender, and it was the perfect meal on a cold day. Today I had the bun bo hue, and was pleasantly surprised at the flavor profile. Flavors of dishes I've tried here overall tend to be on the lighter side, and they are confident enough in the subtleties that they don't overload the soup with heat.   Excited to try other items on their menu at a later date--  my friends ordered other items of their menu (spicy tuna roll, vermicelli beef dish and pho tai) and were also very impressed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fFUWP1tyZvxrUm8W-jxugA"
  },
  "UJho1BhCPT799emQgdvThw": {
    "date": "5/9/2019",
    "text": "Their sushi rolls are very good and I also had their taro bubble tea which was delicious. Definitely the best thing about the meal was the soup, though. The broth is incredible!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1q5wRUV6rDa3tkp-oR8LbA"
  },
  "AK1btW0-oO29r-WjRAaYYA": {
    "date": "7/17/2019",
    "text": "I've heard really good thing about this place, and I'm a huge lover of Pho. The place was very tiny without much seating but I really enjoy that kind of atmosphere. The waitress we had was very friendly and attentive. I ordered the Pho Tai and spicy tuna roll. The spicy tuna roll was AMAZING and tasted so fresh. The Pho was really good but not as good as Pho Van (for me anyway). The broth lacked a bit of seasoning for me, but was delicious! Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GxMoIXvM_2OeGz2pOPAvgA"
  },
  "PadXNMaftNuMoIHtlzfvTw": {
    "date": "4/27/2019",
    "text": "Simple, cheap, amazingly good food. Favorite place for lunch in the Strip District. It's a tiny little hole in the wall, you'd never expect this level of quality.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N4GWRHJJiWYXnm-z2QN04w"
  },
  "rCdIXpqVK5bvvCBBnwFJqg": {
    "date": "3/11/2018",
    "text": "Place is small but we had no problem getting seated. The food came out quick and the staff were friendly. We got the Goi Cuon (spring rolls in rice paper); they were okay, maybe it was just our taste buds but we couldn't stand the mint leaves so we picked them all out. Although, the sushi was delicious! The rolls were fresh and each came with 8 pieces. A little disappointed because they were out of tuna and didn't offer the option of adding crunch/tempura flakes) though",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i43CbT-Cf5Qtl2gU6ZR5RA",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i43CbT-Cf5Qtl2gU6ZR5RA/o.jpg"
      }
    ],
    "user_id": "-Ds0hzlQwZUukmOwnapaFg"
  },
  "s80Mmj9RkQcwnaF878Zbrg": {
    "date": "4/9/2017",
    "text": "Have you ever been so hungry and you don't know what you want to eat but you whatever it is you want it NOW?   And then when you finally just pick a place and eat the delicious food and you finally gain control of your senses you realize it's exactly what you wanted?  That is exactly what happened when we went here.  My trusty sidekick and I were grocery shopping in the strip and were suddenly overcome with hunger so much so that we couldn't focus on what we were there for. Luckily, this place was close to where we were and we decided to eat here before we killed each other.     It's a teeny little place but they have quite a variety of food on the menu for a place this size.  We decided to get a couple of sushi rolls and share a bowl of pho.  Thank god we split the pho - it was 'pho-king' huge (yuk yuk yuk- thank you - I'll be here all night) and so flavorful.  We had the Pho dac biet- (the one chock full of beef) and totally loved it!  The 2 sushi rolls we got (shrimp tempura and spicy tuna) were the perfect choices.  We both especially loved the spicy tuna - the tuna was served at the perfect temp and it was a perfect cut of fish - so good!!  The ladies that worked there were super nice.  Don't let the small size of the place  and no frills interior deter you - the food will wow your taste buds.  Will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NaX65U2OQ776VL8R4lE_BQ",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Pho up close - so good",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NaX65U2OQ776VL8R4lE_BQ/o.jpg"
      },
      {
        "img_id": "H65NGfqB0ulfycf9jYoWKw",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Pho dac biet (beef pho) - so flavorful!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/H65NGfqB0ulfycf9jYoWKw/o.jpg"
      },
      {
        "img_id": "8QGkyjWgzH4oLGFzlciDtw",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Shrimp tempura roll and spicy tuna roll - get these!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8QGkyjWgzH4oLGFzlciDtw/o.jpg"
      }
    ],
    "user_id": "hjk--8VuDX3479_atPJQ1g"
  },
  "steFrBR7m1eNDKenP8wSVA": {
    "date": "3/28/2019",
    "text": "This is a small restaurant but don't let that fool you. The Pho with everything, I think the #5, was amazing and the service was excellent. Everyone was very friendly and the place was nice and clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gx2NMhdj6oiDM3KSUsgQ5g"
  },
  "qEjMfoUrWliQautQII_tNQ": {
    "date": "11/11/2018",
    "text": "The place's name suggests it is a sushi joint, but don't be fooled.  The thing to get here is the pho.  Best pho in Pittsburgh.  Fast and friendly service, you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u0AOZfkmt9HSVIj2Kp6tFA",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/u0AOZfkmt9HSVIj2Kp6tFA/o.jpg"
      }
    ],
    "user_id": "ASOJSBvDEN97TJWJz-4gug"
  },
  "sTu-vh6CvFge6Gqm__dUlg": {
    "date": "1/9/2017",
    "text": "We had been planning to try this place out a few times before but something always came up and we didn't' get to the Strip for some Pho in time.  Finally on New Years Eve we made it here and got to try their Pho out.       I had never had pho before but I've seen my wife eat it a few times before.  It always looked and smelled good but I always found something else to try.  Being that it was New Years Eve they had a limited menu so my real only choice was Pho!  No problem because I wants to try it and now I had to.        I didn't go crazy so I just ordered their chicken noodle pho.  I knew I couldn't go wrong with that.  I really liked the pho.  The broth, noodles, and chicken went really well together.  I even did a good job eating with chop sticks.  Ok stop laughing at me...       My only complaint would be that it needed more noodles, chicken, and more veggies to add to my pho.  There was just a little too much broth but it still was really good and filling for me.    Looking at the menu if I didn't' order pho I would try out one of their Bahn Mi's.  I am a pho fan now and I will consider getting another type of pho other than chicken noodle pho next time.       As far as this restaurant it is small.  So it's probably good for take out for us next time.  I work close by and I can see my wife asking me to bring some home after work.  The waitress that we had was nice and their service was really good overall.         This is a nice and small restaurant.  If you're in the Strip and you're looking for a warm, filling lunch/dinner stop buy or order take out.  You will be satisfied in your tummy and wallet.",
    "rating": 4,
    "rated": {
      "funny": 13,
      "useful": 30,
      "cool": 24
    },
    "photos": [
      {
        "img_id": "k-LL1lG7UUyhKqv_dMc-8Q",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k-LL1lG7UUyhKqv_dMc-8Q/o.jpg"
      },
      {
        "img_id": "BO_9QVaJ19qSRp6J7qcwtQ",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BO_9QVaJ19qSRp6J7qcwtQ/o.jpg"
      }
    ],
    "user_id": "WO-8BmpIuaJJnzgEU5D42g"
  },
  "gBASUgqeSC6WVeMscg0-dw": {
    "date": "10/8/2018",
    "text": "SO MUCH YES!! I can't believe it took me 3.5 years to find this place but I'm so happy I finally have a go-to pho restaurant in Pittsburgh!!! Hands down the best pho in the city and I've tried them all - trams, tan lac vien, Minh, etc. Don't be fooled by the name. Bun was great too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nwU4t2g_SoWUIxitKUnSPA"
  },
  "CJEbukIwvIQnb2Ny_flb9A": {
    "date": "8/10/2016",
    "text": "Another PHO-king delicious meal at Vietnam's Pho. I had to come back and throw another star on my previous review because they're now 4-star worthy in my eyes. I've only had their hoagies because those are the only vegetarian options....or so I thought! This time, the waiter hooked me up with an off-the-menu vegetarian bun (vermicelli noodle dish) with lemongrass tofu. It was like a punch of deliciousness in my mouth. Needless to say my bowl was licked clean when I was through with it. The noodles tasted cool and refreshing while the perfectly seasoned tofu added a kick of saltiness. Pair that with the sweet peanut sauce and your taste buds won't know what hit them.   My boyfriend naturally went for the Pho Dac Biet like any hot-blooded meat-eating Vietnamese person would. It's his all-time favorite dish in Pittsburgh. If he were to leave me for anything, it would be for this bowl of pho.",
    "rating": 4,
    "rated": {
      "funny": 10,
      "useful": 9,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "4UqwoTbNUbF5gjiD5iGTKw",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Tofu Bun",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4UqwoTbNUbF5gjiD5iGTKw/o.jpg"
      }
    ],
    "user_id": "6KUA3-IfHoAhQ3FL2djQoQ"
  },
  "QyLUYVin1ydgh0-BGS4zkw": {
    "date": "12/9/2018",
    "text": "Almost missed this place but glad we turned around and gave it a try! Very small restaurant but the pho was hot and delicious. Service was basically instantaneous.  Will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OtMaG-HLeecKCK4QaB3nDQ"
  },
  "tePEhn6yke16Js-9YVK0cg": {
    "date": "9/29/2010",
    "text": "I'm sad to report that Vietnam's Pho no longer serves banh mi. Oh well. The pho is still good, and so are the bun and the roast quail.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FFxzTd8fxsPQA_7ncsvjsA"
  },
  "N0i9QRPK_OTU87HViyvfEg": {
    "date": "3/10/2015",
    "text": "I know my Vietnamese, and this was not entirely it. Their fried rolls (supposed to be , if authentic-fried rice paper wraps, served with lettuce leaves and other greens which you roll in and dip in sauce).Disappointingly, here what was served was a pre- made (looked like it was bought in the supermarket) Chinese egg roll . The Pho was better. At least it smelled like it had some real broth , and was served with all the little Greens on the side. Nothing to write home about.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NnaB0kLHYSzu9je7tfrJYw"
  },
  "6t0tTpeOgLb6-5AcEFquwg": {
    "date": "3/9/2013",
    "text": "We tried it last night after craving for Vietnamese for over a month since I moved to Pittsburgh.   I had a spicy noodle. The taste was good but I kept tasting bleach in the food. I finally had to ditch the soup spoon. My husband had a pork chop meal which is not much of food for a $9 dollar meal. Both my husband and I feel that the place is not very clean. They didn't wash the bowl thoroughly.   Coming from Phoenix, we were paying $5 dollar for the same kind of noodle soup and they charge for $10 which I think it is kind of standard for noodle soup in Pittsburgh. I don't think that the price is on the cheap side. Not planning to go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-VVSLzMsaVsLOeSce8fVA"
  },
  "0AXJTY7_n3DmwQC7g6RUPA": {
    "date": "1/19/2012",
    "text": "I'm not a super stickler for service, esp if I know the type of place I'm going to.  Generally, I'm not looking for 5 star service when I go to a pho place.  But this place made the other over 50 different pho places I've been to in my life look like 5 star restaurants.  No one greets you here or tells you there will be a wait.  There were at least 10 people waiting by the door and there were at least 4 different servers who saw all the people by the door and said nothing to them.   I come from a Vietnamese background, I grew up in a Vietnamese neighborhood, my parents and family friends make some of the best Viet food around, I cook Viet food, and I've had Vietnamese food all over Vietnam.  So I'd say I'm pretty seasoned when it comes to the proper flavor profiles and textures.    Had the spring rolls (25 min after I ordered them).  They grasped the general idea but they were mediocre at best...the rolls weren't rolled tightly enough, there were too many rice noodles, not enough greens, and the shrimp/meat inside def could've been fresher.  Also, the dipping sauce wasn't complete since they didn't give any do chua (pickled daikon/carrots).  I've been spoiled with really good spring rolls my whole life.  I can't say I'd order these again.  Pho is a quick dish to serve...it's already prepared (although it takes hours to actually make), so in theory, you should have a piping hot bowl in front of you within 5-10 min of ordering.  The pho didn't come til 20 min after the spring rolls.  That's a full and unreasonable 45 min of wait time from ordering til it was in front of me.  I'll admit that they give you a lot of meat and noodles, which I loved.  The flavor profiles were the right context. but it def lacked depth.  Felt like it was missing something..not enough fish sauce or star anise? Not sure...  Overall, I wasn't impressed..but I wasn't expecting much in the first place.  Sucks that it didn't live up to any expectations I had because I really wanted to love it.  I guess it would do if I had a dire Viet craving and was waaaay too lazy to cook.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "lLZjqoBQG8dY7qDXOXfILg"
  },
  "UgIPs5-OwY_rpYJaL0Jovg": {
    "date": "10/6/2014",
    "text": "I really wanted to give this place a chance, because I LOVE pho and the reviews here were slightly better than the place down the street. But based on my experience there, I have to give it the lowest rating.  There's construction going on so you have to go into a side entrance - which isn't a big deal, however there's no clear marker where you're supposed to go to wait to get seated. There were only 3 people working on a Sunday lunch hour, each understandably busy with their own thing, so it was confusing who would be seating us. When our number was taken, we waited for a while - not because there weren't any tables - just that the tables that were open hadn't been cleared. The guy who told us it'd be a few minutes realized no one was cleaning the table, so after a while he went and did it himself. When we sat, we took about 5-10 minutes to go through the menu, but it took another 10 before (maybe longer, I'm trying really hard here not to exaggerate, but it felt like a long time) someone took our order. And I don't know how long it was before we got our spring and summer rolls. There were 4 of us, and a table of 2 who got seated wayyy after us got their appetizers/pho way before we did.  Here's the thing - I am usually understanding when a place is busy and understaffed. The guy who sat us was really nice and apologetic. In fact, I'd say all the staff were really friendly. But the place was not clean (I love hole-in-the-walls, but this place was seemed unsanitary) and the staff were negligent. As for the food - it was ok. Nothing that stood out enough for me to want to deal with that kind of service again. I definitely won't be coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u0n4HmejDc_qrqyNGHNdEA"
  },
  "wL-zYYecNipMxEfKch8g4w": {
    "date": "6/19/2016",
    "text": "The staff was nice, but not very attentive. The atmosphere was a little lacking, with food bits and trash on the ground. However the pho was fairly good. Sadly, the Bubble tea was disappointing. My daughter and I, who love bubble tea, did not finish ours. The boba was mushy and the flavor was a bit off.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9-a3yHm-FDSurYcxiBksIQ"
  },
  "iFj0hOwr7AgfbysbYFrgOw": {
    "date": "2/5/2012",
    "text": "Nothing is better than pho on a cold day!  Pho was very tasty...also got spring rolls and they were also good, and I loved the dipping sauce.  Service was a little slow, and they don't take credit/debit cards, but we had a nice time and our waitress was very nice and was able to sub vegetable broth for my vegetarian friend.  I know that's not hard to do, but some people get very annoyed when you ask for a substitution.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lrDC3QWfbJpacTNCH3X1sw"
  },
  "WqqnS3hYi0j3dSxPMkTj9Q": {
    "date": "12/20/2013",
    "text": "This is the best Pho in Pittsburgh. And while I realize that is not saying too much, I would like to add that this place also would be a contender and a survivor in a larger city. While this is not my mother's Pho (Pho BANG NYC), this is my Pho of choice in the Pittsburgh area. In addition to Pho, they also serve Bahn Mi, I had the pork and it was great, the Tofu one was gross in my opinion. The prices are reasonable and when I have been there it's never too crowded. The bubble tea is terrible, so I actually took one star away for that. Just don't leave the tapioca sitting in water, that's basically all there is to it. Anyway GO HERE eat PHO. Use Sirracha in the Pho and Bahn Mi. Thank me later.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cqXXdLyVKlpckdu5odG5sw"
  },
  "gNjI5hfe3FlkcBJF66UWnQ": {
    "date": "3/23/2012",
    "text": "The place was extremely empty for the lunch hour, with what appeared to be a frightenly under-utilized sushi chef (worrying me about the turnover rate of the sushi itself).  Also as I entered the place, I was struck by a familiar, yet unidentifiable, antiseptic smell.  My lunch companion suggested it was the smell of urinal cakes (he was right).    Ignoring the sushi check list presented with the regular menu, I ordered the Pho Ga (chicken noodle soup), and I have to say, I loved the  combination of flavors.  I am not very familiar with Vietnamese food, but this was wonderfully tasty.  And by the time we left, we no longer noticed the urinal cake smell (although I wondered if I had just become immune to it and was carrying it back to work on my clothing).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VbLZSyr39Xx9oox3r-YOmg"
  },
  "KCP6tgFX5SUDA0gCKKZufg": {
    "date": "1/14/2015",
    "text": "This pho place is meh, but it is pricy.  I asked for extra meat for my pho tai bo vien b/c my bowl had only 3 slices of beef.  I got 4 more slices and it was 18 bucks!!! GOOD LORD!  The pho wasn't even good, and it seems like everything on the menu was expensive.  I'm sorry I have a high expectation for Vietnamese food b/c I'm Vietnamese.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2qGWg83C_RwJF0dtTOOT6Q"
  },
  "64dfxaqZmtZihZXNvkLgwg": {
    "date": "10/20/2012",
    "text": "Place has really gone down hill since they opened. Sad but True.....they have expanded but cut quality. Service is very very slow.....we continue to go, for now though",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_uE8MJX_mnDVfGDzofWzEQ",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States. Honeydew yogurt bubble boba",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_uE8MJX_mnDVfGDzofWzEQ/o.jpg"
      }
    ],
    "user_id": "tks-GCSNWe575iKutGWBIg"
  },
  "Qd6CKaitOwVi2oL1SI00uw": {
    "date": "8/25/2012",
    "text": "**CASH ONLY! They have an ATM inside**  This is the best of the 3 Vietnamese restaurants I've been to in Pittsburgh. I will first-off say that I always get vermicelli--bun thit nuong, so I cannot speak for their Pho. The nuoc cham (fish sauce concoction) was spot on. There was mint in this dish, which the other 2 places I went to did not have and that really bothered me--I feel the mint is so essential to the freshness of this dish. The ultra-crispy spring roll on top was SO GOOD. One of the best I've had in so very long. And the pork was in thin, Mongolian-style slices with a sweet glaze. I shoveled the entire bowl of food in my face and even drank the sauce at the bottom. Really good. Really, really good. I left with a light and happy step.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x1nbw-dz2Hqg137T33pMxg"
  },
  "CKFTjjJs8jBjCz7U8_JHjw": {
    "date": "1/26/2012",
    "text": "I agree with My D.  My two friends and I were standing at the door for about 5 minutes before I finally was able to make eye contact with the waitress.  When the man (I think he might be the manager) came to take our order, we weren't ready yet, and he rudely hit the table and said he would come back.    We ordered two bowls of pho and two vietnamese coffees.  Only 1 bowl of pho and 1 coffee came.  They had completely forgotten/misunderstood the order.  The waitress who brought it out didn't even apologize.    I'm not picky of service either especially when it comes to Asian restaurants (being Asian myself), but this was unacceptable.    The pho was good.  We all got the pho with steak and tripe and there was barely any tripe in it...only little tiny shreds.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MkJ85Zrf3O6_5-27OMDEZw"
  },
  "W2-k4y_azliSFN2eEaboxQ": {
    "date": "6/22/2011",
    "text": "This is my weekly place to get my Bun Bo Hue fix. I'm Vietnamese, and my mom is from Hue, Vietnam and I grew up eating her Bun Bo Hue among other Vietnamese dishes. While I do cook Vietnamese most days, I found that I stopped making Bun Bo Hue when I tried Vietnam's Pho. OMG. They pack a LOT of flavor into that bowl of the spicy soup - lots of lemongrass and will-make-your-nose-run spicy. It's not worth trying to mimic their dish, I'll just give them the money to do it for me. The bowl is super large and filling.   Service is speedy and the owners already know us and know what we order because we order it every week (sometimes twice a week).   If you're not into spicy lemongrass soup, I go for the Bun Thit Nuong because it's good and hits the spot if you're looking for something grilled on vermicelli.   My fiance gets the Pho Ga (not listed on the menu, but you can ask for it!) and I think it's pretty good. The soup is clear and packed with flavor - hard to do. The notes of ginger, anise and cilantro make it really soothing for the stomach. The only downside is that the chicken is a bit on the dry side. Everything else is spot-on for a traditional pho ga.  I haven't really tried anything else on the menu because I tend to stick with what tastes good when I first try it.   I've tried Pho Van which is also on Penn (and closer to my apartment) and the only thing I tried was the Bun Bo Hue and it was a disappointment, like all the other places I've tried. I never gave any other dish on their menu a try before dubbing Vietnam's Pho my weekly go-to.   I'm always willing to try something new so I can continue to prove (or disprove?) that Vietnam's Pho is the best Vietnamese in Pittsburgh.   But we're also kinda lazy and since we live in the Strip District, we tend to want to stay within walking distance to food. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "JE0ZE8BW0wWTSZEU7csKQg"
  },
  "TXAxv6hsOT14R1Q6Zk1k1A": {
    "date": "11/5/2011",
    "text": "I've only eaten here once but my dish was excellent.  I got the tofu (vegetarian) bun.  It was the first time that I've ever had this dish but it had a very nice flavor and the combination of textures of the various vegetable garnishes with the vermicelli and tofu was excellent.  Healthy eating that actually tasted good.  Didn't have an appetizer since none of them are vegetarian and the appetizer that my husband tried to order never came because it was part of the \"new menu\" (the one that is online) and apparently they weren't making it yet.  My dish was also online and not on restaurant menu (although it was on the take out menu).  All in all it was a satisfying lunch.  The decor, as others have stated, is a little strange but it was comfortable enough and seemed clean.  My husband got fried rice with salted fish and chicken, which came as a very generous serving but he managed to eat it all.  On a previous recommendation, I also got the Vietnamese coffee which was sweet and really strong (also a bit thick) but it was not unpleasant. Good place to duck in for lunch when shopping at the strip.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ThdDYlJf-VHLs1rYYYNz6g"
  },
  "_S7o3PisE5ogzvjeHHLcGw": {
    "date": "1/31/2011",
    "text": "'Twas a centimeter after 8PM. Sweet Lady Kay had just picked me up from work in Lawrenceville so we could both catch Holy Grail and 3 Inches of Blood at Altar Bar. It was a gamble; I didn't want to use any paid time off since the show didn't start until 7 but still wanted to see the main 2 acts.   Alas, Kay was hungry, and when Kay's hungry, all of Creation is in danger. My stomach was equally raging. This much was certain: We both needed to be fed. With luck on our side, as we turned in our tickets in exchange for wristbands at Altar, we found out  that there were 2 opening acts to go before the 2 principals.   The magical hot dog cart which is often outside of Altar was nowhere in sight. I had counted on it. Curses! The frank-peddlers must have taken the night off or were working elsewhere.   McDonald's is never an option. I don't care how cheap and convenient they are. So are prostitutes. Do cats avoid water?   I espied a sign that said VIETNAM'S PHO. With nary a further thought, I grabbed Kay by the hand and ran across the street with her to this godsend of an eatery.  We walked in and the first thing we saw were 2 fellow metallions dining, so we already felt reassured that we would encounter no bumps in the road during our night out. The owner (?) came out, greeted us warmly and seated us promptly in a booth, not seeming to mind my deep red and black heavy metal concert t-shirt. I stuck out like Ron Paul at a Workers World Party rally, but regardless of the classy interiors, it is a casual dress establishment.   Kay and I needed to dine fast, something I hate having to do. Both of us scanned the menu quickly. I had been wanting to try pho since people around Yelp won't shut the frack up about it, but my bladder just wasn't cool with me guzzling down 12 ounces of soup in a short amount of time, so...  I pointed at menu item # 15: Bun Dac Biet. Kay picked #16: Bun Cha Gio.   I was rewarded for my hasty decision with a groovy jumble of beef chunks, shrimp, lettuce, cucumber, carrot, noodles, spring rolls, and some sort of sweet/sour collusion (collision?) of a dressing that tasted like a vinaigrette. It was an unexpectedly delectable salmagundi of salad, appetizer, and entree that I wish could have lasted all night. An ace ensemble of a dish, the situation at hand unfortunately forced me to gormandize the poor thing, but it was a brief fling that I relished as I would a long-term affair.   Kay's meal was very similar to mine. She saved those first-rate spring rolls that were also included in her bowl for last so she could dip them into the dressing that collected in the bottom after everything else was eaten. Watching her do so was a delight in itself. I like to watch my girl eat for some bizarre reason. Fetish? You tell me.    I THINK I have finally achieved a sort of competence with chopsticks. The key lies in clearing your mind while you're using them and training the muscles in your fingers to do things they aren't used to doing. My circumstances this evening caused me to learn something I never thought I'd be able to do at all; the equivalent of having to hang glide from a cliff to dodge a stampede of dinosaurs.    We got our check ($22), paid it, and hustled back across the street to Altar in time to catch the back half of the 3rd opener's set, our bellies warm and full, our ears ringing, our heads banging, the rest of our concert night saved. Whew!  P.S. Vietnam's Pho is obviously endorsed by Hollywood big shot Russell Crowe. I nearly forgot to mention that a candid picture of him can be seen on the wall as you enter.",
    "rating": 5,
    "rated": {
      "funny": 13,
      "useful": 15,
      "cool": 14
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "fIEfKYfTT6L9brjYmhqoXg": {
    "date": "1/10/2012",
    "text": "A solid pho restaurant, i've been here a few times but have only ever had the pho. I hear good things about the bun and everything else, though.  What I especially like about the pho is how quickly it comes out, how non-shady the meat appears, how tasty the broth is, and the ample amount of condiments. Ask for the chili oil!  Service is quick, while a little quirky.  Wish they had a smaller serving for a couple bucks less, I would be here all the time!!  Cash only.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ME1-IwMQMHkowOxffKUx7w"
  },
  "3N9cBLhUQvjUx_RMFRYc8g": {
    "date": "7/22/2011",
    "text": "Yay!  This place is great!  Does not superscede my favorite place that sell some really Frenchified food in Vietnam-town in Los Angeles, but really good for the basics.  The Pho?  very good.  The side dish appetizers?  Very good.  get the shrimp appetizer.  It will angrifiy you that you don't get a big massive plate full of the things.  have you ever had grilled food that had a great woody smoky grilled taste? (but not TOO smoky or grilly...) this is the place.  Also, their fish sauce is killer.  Nice and mild.  And they must add something to it.  Does not taste like they just poured it out of a bottle.  The wife, who always expects food to be smokin' hot when she orders it, hot as in temperature, not as in spicy, loves the bun dishes.  THAT will tell you (if you knew my wife) how tasty their food is.  Seriously, especially with this crackin heat wave, or any day when you just want something light and refreshing, get one of their bun noodle dishes.    I like everything on the menu.  The Pho be pretty dag-nabbed good as well.  Not as good as the really beefy and hot pho I have had elsewhere, like Boston's Chinatown for instance, but really good.  Now that I have been going here for awhile, I am going to try going off-menu.  This place has to have some kind of innards and guts stuff that they only sell to other Vietnamese.  And believe me, the place generally has a two to one ratio of Asians to generic citizens eating here.  Nothing better than some delicious plate of meats of indeterminate origin to liven up the meal!  And finally, best part, it is far enough up the strip that you can usually get a parking place at a meter.  just make sure you FEED the meter, the polizei car-ticket-patrol are always hanging around.  And I swear that they will hang out at a car with five minutes on the meter, so they can bust that bad boy when the last second ticks off.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "L5dKFysiA53KMxAshNTb0w"
  },
  "guFjBofRWLKRrne7jGgetw": {
    "date": "9/5/2011",
    "text": "Vietnam's Pho is a thumbs up for me though all the times I have been I have just ordered the vermicelli with pork which comes with a spring roll. Big portions but everything is cooked just right, especially after I add in some Saracha and Hoisin sauce. Items on the menu seem to be all affordable.  The decor makes me kind of laugh, perhaps because I don't get it. I feel like the owners bought some odd and end pieces and just made it work in the space. When you enter there are some simple seats/tables to your left and right then a waist high partition to separate the two sections which brings you to a nice wood finished bar which I wonder if they use? I've never seen anyone sit at the bar for drinks. Then once you walk beyond the bar there is additional booth and regular table seating with a gi-normous flat screen tv perched above a fish tank and this second section that plays concert performances from the 1980s. It is all fabulous though.  Vietnam's Pho takes credit card.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "57tf_RmT5o3BiFj2gpV-Jg"
  },
  "jegw71CSWo6ZpX0tCsrBFg": {
    "date": "3/23/2016",
    "text": "Went here solely for the bubble tea. Both visits were on a Friday around noon. The first time I went, I got the Vietnamese coffee with boba, which was pretty decent. The second time, I got a mango tea (since they were out of peach). The \"tea\" was overly sweet and had a weird texture--like it was obviously made from a powder. To add insult to injury, the boba was hard and tasted badly. I threw most of it out and most likely will not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6gzhNQxrAqpRunnVncgAkg"
  },
  "OnaIEMvqe6FSAcza3tNa8g": {
    "date": "8/12/2009",
    "text": "I needed my Pho-fix in Pittsburgh.  But I did not go searching for my drug.  I stumbled upon Vietnam's Pho, after I found out I could not use my corporate AMEX card at my first restaurant of choice.  Vietnam's Pho is average, but after not having pho for a month it was like heaven.  Once that succulent soup touches your lips, all else fades away.  The price is steeper than I am used to paying for pho but the noodle and broth definitely hit the spot.  The chicken and rice dish was no good.  I don't know if the chicken was burnt or not, but it was black and crunchy.  I thought I was eating the bones.  The waittime for the pho was way longer than the 5-10 minutes I am used to in Texas.  However, the cleanliness of Vietnam's Pho was above average.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sBkm5dZgoZXBNb5W6YQj7Q"
  },
  "nww9JbZyCe-aX2znl-vPLA": {
    "date": "2/18/2016",
    "text": "Simple fresh delicious sushi.  Great for take-out but eat-in for some warm conversation.  Stop in say Hi and enjoy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x5GG_pGk5kPGgQBallt7vg"
  },
  "npxRRKF_d-hJTSxAbMojNA": {
    "date": "11/30/2011",
    "text": "I really really was happy to find this place! I craved Pho so much. Although it was a far trip, I think it was definitely worth it.   Although the food took a long time coming out (20 minutes I think), it was definitely worth it. The portions were ridiculously large, and everything was delicious. The waiters/cashier were all very friendly and very nice.  Keep in mind though--they don't take credit cards! They only take cash. My friends and I had to walk to the nearest PNC ATM which took 15 minutes :(",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HOGmp5D4wtMnaQ8U02UKFw",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HOGmp5D4wtMnaQ8U02UKFw/o.jpg"
      },
      {
        "img_id": "U7wJshQUZx_U2Py5IuAa0Q",
        "caption": "Photo of Maiku Sushi - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/U7wJshQUZx_U2Py5IuAa0Q/o.jpg"
      }
    ],
    "user_id": "oWjEjoX_L9HeXnD4bKjw2w"
  },
  "nq39kISDwNEeBJ9s9m1ZgQ": {
    "date": "4/27/2017",
    "text": "Our family loves Maiku! The owner, Michael, is a delight to get to know. We drive out our way to visit this restaurant. We have pho tai every time we are there, and the pork banh mi sandwiches. We have also had sashimi and bun thit nuong and it has all been wonderful. It is a small place in the strip district, but do go search it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H3JEMqzMrineu5jUJ9CLBQ"
  },
  "kGk8Asfoyg11v8fCfFNjnA": {
    "date": "1/29/2016",
    "text": "Excellent service and fresh sushi made to order.  You are welcomed like family the moment you walk in the door.  My only regret is that my lunches aren't longer.  I work down the street and only have enough time to pick up a roll or two (due to shortened lunch period, not the service), but would love a leisure lunch sampling their delightful sushi.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MEnSYeZ_iRSsiriDQETkIQ"
  },
  "gl11cm5bji4xeMLHcEDCgg": {
    "date": "2/15/2011",
    "text": "You know a place is good when you start having weekly cravings for it! I had actually never tried Vietnamese until recently. Please don't hate, but I lumped it in with Chinese and Japanese. But I can proudly say now it can stands alone in deliciousness!   I've tried the regular shrimp noodle dish, or prawn, if you will. Which on it's own is a great choice. I've also had the fried rice, which was surprisingly good.  But NOTHING, and I really do mean nothing, can compare to the Rice Noodle Soup bowls. SO GOOD!   They give you so. much. soup. It's a huge bowl filled with yummy broth, a TON o' noodles and insert whatever meat you choose. I enjoy the seafood bowl, which is a mix of shrimp, squid, crab and FISH BALLS. I really just like saying fish balls. But I digress. If that's not enough, they also give you a side dish full of sprouts, basil and jalapenos. YUM!   So, Pho' real, please go!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "knagX8jXiMeVydveKyU9Ug": {
    "date": "5/15/2014",
    "text": "The service was prompt and friendly. The food was excellent the process are moderate.  I recommend this restaurant. Be aware, it is cash only.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qJWc_DaBLRWKnt4zs4yWIQ"
  },
  "GUsdgbH61UjGKpoXGdJULg": {
    "date": "1/7/2016",
    "text": "The Thai bubble tea is awesome and the pho is delicious. The workers are nice. Excellent experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MjDWx4gr-jAQEo4iMJhbNg"
  },
  "a6WMRXWfJ1sjUNttmt0-Dg": {
    "date": "1/29/2013",
    "text": "The second time we visited, I was rather annoyed to see that they no longer took credit cards. I swear they took them the first time I was there, but maybe I'm insane. That's okay, they have an ATM in the lunch side. Oh wait, it was out of order. Sooooo we walk back up the Strip to an ATM and back to the restaurant.   This time I tried the pho and was not impressed. I'm not sure if I just don't like pho or if this place doesn't have good pho, but it was a \"meh\" dish for me with little flavor. We had bubble tea again, and again it was great. I still don't understand why you cannot order it off the menu.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "M9MXoSsb193m1g0QmmUYBQ"
  },
  "p_8L0TEOEJ4rx08Gv1q5IQ": {
    "date": "7/31/2013",
    "text": "While walking by I noticed a sign for bubble drinks and was immediately drawn in. I asked if they had a menu of their dessert drinks and the owner showed me to a table and turned the menu to the proper page. I looked through it and was a tad sad that it didn't list almond as one of the flavors they carry but decided on taro.  On a lark, before ordering, I asked the owner if they ever planned on carrying almond. He looked at me with a perplexed manner and stated that they, in fact, carry almond for their bubble teas. I then asked if they carried pineapple since pineapple milk tea is my favorite and almond wasn't on the menu. With a no given for my second question I ordered by almond milk tea.   This day I learned I can get good almond milk tea with pearls in the Strip District while the owner learned he needs to add almond to the menu. I told him he should list it as amaretto since more people know almond flavored items by that description.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rnfgjemszUlQx6U_-PO63w"
  },
  "-Dj2PWydjcUJS8yb-GCjLQ": {
    "date": "1/3/2013",
    "text": "Get the quail, not the pho.     Since I was trying a new food I figured I go all out.  I ordered the Pho Dat Biet  that had everything in it. I've been known to jump on the bandwagon and Vietnamese food seems to be all the rage. Man was I disappointed with my Pho Dat Biet.  It had everything in it. including tripe and bulls balls I even tricked my boyfriend into eating one muhahaha . I am sorry to report that I didn't like it.   I can't quite put my finger on it, it tasted like it was prepared in a haste like something wasn't left to simmer long enough.   So looking back I am pleased with myself for having ordered an appetizer the quail. Oh  the quail was done right!  Such a tiny little bird that was bursting with flavor.  I could have easily eaten two or three of those quails the skin was super crisp.  I need more quail in my life.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "V7uS5US4oTf-S9u36HJQCQ"
  },
  "K-SR2ilyT-qqmnoXfaAYPA": {
    "date": "5/18/2014",
    "text": "I got some noodles and pho. It's delicious! Lots of seating available for people with kids.  Prices are cheap, and you get generous portions.   I would recommend this place for lunch, if you're in the mood for authentic Asian cuisine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lKDAgYMKAT2J3gYYyNyp1g"
  },
  "mGLpN5sUnXFCdU6HTI_GoA": {
    "date": "8/22/2016",
    "text": "If I was a local I wouldn't come back. To me the service was poor and I know what to expect for Vietnamese restaurants and I know it's minimal service. I asked for few items which I already mention prior that I was sharing with my little one which means extra bowl. When I asked him after he brought the dish out and reminded him for my other companies as well was rude and says he only has two hands. I was simply reminding him since if I didn't, they aren't around to check on you after.  The server was not communicative or responsive to anything. This is my opinion, my review but just with that impression I would not come back. I know this review is short and brief and may not help anyone to get an opinion of this place but I just wanted to share that it's a place that has lost my business and those of my family.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IjH4uWgBzMOJVJqjBRm_vw"
  },
  "3G2G6eQ67cEKTEVLtXb5GA": {
    "date": "1/23/2013",
    "text": "Don't be alarmed by the looks on the outside. This place is a beaut! :) I looked at their menu twice, maybe three times because I couldn't find anything vegetarian. My heart almost sank until I mentioned it to the waitress. She said they have vegetarian pho as well as other dishes made with tofu and vegetable broth. For some reason they don't list it on their menu. Phwww!  There was no way I was getting my husband out of there without eating something.   I ordered vegetable pho (usually made with beef broth) it had tofu. I forgot to say no mushrooms so I took them out and noticed that they were the fanciest mushroom I've ever seen, like something out of a children's book. I was a little sad that I wasn't going to eat them being that they were so cute and presentable. But no worries, my husband gorged on them.  He had a meat dish with noodles. We both rolled out of there, we ate until the last drop.   This is a restaurant we'll be visiting over and over in the future. In fact, we're taking my brother this Saturday to try Vietnamese food for the first time. I can't wait. He eats anything.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "y-OW396z2nqGyyklOLnVjw"
  },
  "X6vxkip8_YgMcxivZ2eaoQ": {
    "date": "7/20/2012",
    "text": "This used to be my favorite place with reliable food. Things really have fallen apart in this place since the restaurant got expanded.  One time I went there with 3 other people, and all of us ordered Pho, and we got a tiny bit of bean sprout. So we asked whether we could get some more, and guess what the waitress said! \"WE DON'T HAVE ANY MORE BEAN SPROUT.\" It was lunch time on Saturday, and a vietnamese restaurant ran out of bean sprout? We had to hold our tongue and say okay. Later we saw about 10 people ordering pho, and they all got bean sprouts of course. Why do they have to lie about that kind of stuff?  After this incidence, me and my sister held ourselves back for the longest time, but decided to go back to try one more time. We parked our car outside at the meter, but we didn't have any quarters. So we asked the owner whether we could change a dollar to quarters, and guess what she said! \"WE DON'T HAVE ANY QUARTERS.\" Okay... I guess that might be True although it was hard to believe that a restaurant had no single quarters. So we went to the next door grocery store and bought something to get changes. After we finished eating, we paid the bill (btw they do NOT  accept credit cards any longer even though the menu even has credit card logos), and we had to watch the waitress grabbing 3 quarters for our change from a bunch of quarters.   Restaurant owners should know better that YOU SHOULD NOT LIE TO CUSTOMERS. Maybe not just restaurant owners, but even little kids know this simple thing.  Even pho broth used to be really good about 6 months ago, but it has changed. Sometime the broth was so clear with no flavor, I regretted ordering it. Also, they skimp on toppings in pho (different cuts of meat) which you pay extra for. When I ordered everything in my pho, there was no tendon or tripe, and they didn't even bother to mention that they ran out of certain toppings. I got disappointed for so many things for so many times. I don't go back to this place.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "N4D48rVn8MajqE5iK2KlIw"
  },
  "65wyLpMWMEXgs-zX0SAgBA": {
    "date": "1/28/2013",
    "text": "We did not receive the warm welcome that we are accustomed to receiving at Vietnamese restaurants.  The lady who must be the matriarch of the establishment did not seem happy to have customers on the day we visited.  Our waitress was nice and thankfully understood our questions though.  We had six in our party though they only brought us four waters, and they took away a few of the place settings, again leaving us with only four settings.  While in the middle of trying to eat and feed four little ones it took a bit of work to get their attention to ask for a fork and spoon and more water.  We needed more napkins and simply took some off the tables around us.  I guess self-service is what one must do at this establishment.  We ordered Cha Gio and received two tiny rolls that cost $3.50.  They were tough and not as delicious as every other VN restaurant we have been to.  I'd avoid ordering that at this restaurant.  We also ordered the Goi Cuon and received two for $3.50.  Those were of normal size and they were delicious.  I highly recommend you try these.  For our main course we ordered two bowls of the #15, the Bun Doc Biet which was extremely perfectly delicious.  I can not say anything but great stuff about this dish.  I only wish I could have had more since I had to share with two of my children.  I highly, highly recommend trying this or one of the other Bun dishes.  By the way, these entree's were supposed to cost $8.95 each according to my menu but they charged us $9.95 each because they put a sticker on another menu with the $9.95 charge.  This is a cash only place.  If you have a <a href=\"/redir?url=http%3A%2F%2FRestaurant.com&s=0aab4cbd731f3d3b0d1453050d3abc56a8c80bd214e25469c7555b750dca8a51\" target=\"_blank\" rel=\"nofollow\">Restaurant.com</a> certificate, read the fine print - you can not use it for lunch.  The bathrooms do not have a baby changing station.  The fish tank is fun for the kiddos to look at.  Parking was easy for us on a rainy day - there is meter parking on the street in front of the restaurant, or you may park by the stores on the strip on the street behind the restaurant for $5.00.  The area is fun - so if you are already there, this may be worth your while to try - just don't expect great service - and stay away from the Cha Gio - and bring cash.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fdQKTgHDfOpVXWN9CImiGg"
  },
  "MGI_nkhggsQaO91ZN15WNg": {
    "date": "7/2/2013",
    "text": "Finding anything vegan in Pittsburgh seems to be a challenge so I was very pleased to wander into Vietnam's Pho just to see if they had something I could eat. This place has the BEST vegan banh mi I have ever had! Just make sure to order the lemongrass tofu banh mi with no mayo and you will be good to go. Their vegan pho was also excellent but I'm a banh mi fan so it's what I always order. The sandwich is so good that I eat there every. single. day whenever I am visiting Pittsburgh. I also make sure to get one to go on the day I leave so I can take it on the plane.   The staff was very friendly and the restaurant was clean. They were cash only each time I visited but they did have an ATM available.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C9MOl1kkrfGPry8Rqm9fIA"
  },
  "mgN6Wu97ApcVKsayTKC2FA": {
    "date": "7/31/2012",
    "text": "Recently made a trip to Vietnam's Pho and it was my first experience with Pho.  I'm a fan...as my rating suggests!  I got the spicy noodle soup, I can't remember exactly what it was called, but it was spicy goodness.  It was such a huge portion that I couldn't finish it all, but there was plenty of noodles, beef, veggies for me to enjoy.  It's also extremely affordable with prices ranging from $7-9 bucks.  Friends of mind said that fall/winter is a great time to enjoy Pho and I definitely understand why - cold days, hot Pho - what else could you ask for!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "NnrCwpS1i5mZtkGGzmIk0g"
  },
  "8pxfnUGvD_C5otezr3VRoQ": {
    "date": "4/8/2013",
    "text": "This was my first experience with Vietnamese food. I do love most ethnic food I try and I'd been wanting to try Vietnamese for a while.   When we arrived at the restaurant I noticed it had that same hole-in-the-wall neighborhood ethnic food atmosphere. Nothing fancy. We were seated immediately. After reading the menu about 50 times I asked our server what he suggested for someone who'd never had Vietnamese food before. He suggested #9 the Pho Tai (beef eye round noodle soup).    We ordered the quail to start and it was delicious. The spices on it were just right and the skin was crisp and had a sweet caramelized bbq flavor. Of course since it was quail the portion was tiny, but the flavor and moistness were perfect.   When I got my pho I struggled to eat it with chopsticks. An art I still haven't mastered. Forks were not provided and I didn't want to be rude and ask for one so I just dealt.   The broth was okay. It seemed sort of bland, even after I added quite a bit of torn fresh basil leaves and a squirt of lime. I also added sprouts, but that was all that came standard with this dish. I was hoping for a wider variety of veggies to add, there weren't any onions or chili peppers which I think would have helped. About halfway through the dish I ended up adding some hoisin sauce to give it more depth, but it only helped marginally. The portion size was good, though the amount of beef in the bowl was lacking. It had probably about 6 pieces the size of a quarter each.   My fiance ordered #29 com suon-bi-cha which was a grilled pork chip, \"shredded\" (more like small chunks) pork cook in a glaze, rice and a fried egg (even though it says quiche on the menu it was just an egg over medium). I tasted both preparations of pork and really enjoyed it. In fact I was a little disappointed that I hadn't ordered what he had because it was much more flavorful than my soup.   I would be willing to go back and try another dish and see if the flavor was improved. The environment was nice, the service was prompt and friendly, and the food was average. I might add on more vegetables next time, maybe onions and mushroom if they have it, and maybe try a pho with a different beef preparation.   Also, Pittsburgh legend Rick Sebak came in for dinner while we were there and that made me happy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-GklRzhYxeEmt2cSYXhXuA"
  },
  "3aana25ZJN2BId0jd0d60A": {
    "date": "12/14/2012",
    "text": "I love FA. Only in Pittsburgh would they call ban minh a grilled beef hoagie. Almost as funny as calling a gyro a jyro. You know what I mean. Have eaten her a couple times and if you are nearby (like a block or two) it will work, but it is not worth driving for.  Nothing wrong here (except the no cards(I think money laundering)) everything is just  pho-bolous.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3I2wGF73UOPMuwSuzMCYWQ"
  },
  "880bo3WhPfd6OwXr15VxKg": {
    "date": "2/14/2013",
    "text": "Somewhat hard to find, but I eventually made it here from my hotel few blocks away. It was freezing cold so as soon as I got in, I got some tea to warm up.  I had the spring rolls and they were decent sized and tasty. The pho itself was interesting. The noodles came in a block and I had to break it up in my soup. The meat, bean sprouts, etc. were all pretty standard. I wasn't wowed by their food, but the workers there were pretty nice so that's a redeemable quality. Just keep in mind that this place is cash only and they have plenty of signs that tell you that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-5Bkci0QszkWEw63EbVx8g"
  }
}