{
  "KsFlBzGisLg_bcqnFGmT8A": {
    "date": "2/9/2015",
    "text": "Very loud place I'm assuming because of how many people are seated around you. Rather large restaurant which I think gives some echo. Menu is basic italian dishes. Nothing crazy and prices are fair.   Staff was nice and on the ball.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2YTAPdnmIhG4MH-voxXx9g"
  },
  "qOJqnqvbf4a9-nQqsy_fCg": {
    "date": "6/27/2012",
    "text": "Decent lunch, not great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L541HhOM0bNJJ9Q0xPhpHA"
  },
  "qQ_H69ibIjF5JX4JnmBfwQ": {
    "date": "1/26/2014",
    "text": "Got food poisoning here... Like currently throwing up the lobster ravioli. Everyone who was in my party is very ill. Food and service were okay. But could never return to this location. Ugh.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X0D0RhYzoS7h6naWhXVOog"
  },
  "yDUi2LLxmc58gS82M2g9Nw": {
    "date": "8/28/2016",
    "text": "I've been to this restaurant many, many times on business and family outings.  The food has always been pretty good as was our meal last night.  The only reasons I don't rate our experience higher are 2 recurring issues we've encountered on more than one occasion and again last night -  Dirty dishes & silverware.  Not spotty, still have food on them.  Major buzzkill when we have to examine our plates, forks, etc.  Not the first time this has happened.  Unacceptable in a restaurant of this reputation and cost.  Also they have an real ongoing issue with wait staff that disappear for 20 minute periods leaving us with long periods of empty drinks, etc.  Wait staff always appear very rushed and not able to take care of our table.  We don't sit for 3hrs and drink wine with friends, I just want to feed my family and go home.  Really affects the enjoyment of a nice family dinner.  Busy Saturday but not overly crowded.  My guess is they are overtasking wait staff with kitchen duties.  I always give the wait staff the benefit of the doubt.  Love Bravo but they have to address the overall dinner experience at this price point.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P7zjliDql_eslvaKsxH2yA"
  },
  "7gT8yk4bIRmPnhnA54p2Fg": {
    "date": "1/25/2014",
    "text": "The food is great! The front of house staff is always a pleasure and the price is right!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QWCco5SCao0ca8ZTqkWjtQ"
  },
  "eOJgQ-e1zmHIlUjK8THBYg": {
    "date": "10/22/2013",
    "text": "This is hands down the best Italian chain restaurant out there.  The creamy parmesan dressing is delicious with any salad.  My favorite meal is their veal parmesan and they serve real veal which is hard to find at any chain but every time I've eaten it, it has been perfect.  Lastly, if you like cheesecake make sure you try the creme brulee cheesecake.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qiAm2A8VsYurQKInrqS68Q"
  },
  "4aW3v_gp3c9Qko6PopBALw": {
    "date": "12/28/2009",
    "text": "Based on one visit  Great bread - very impressed for a chain. Service was excellent. Good ice-tea, seems silly but it's hard to get really good ice tea anymore. Very nice salad. Tilapia entree was interesting, risotto was over-cooked but the fish was done to perfection, just rather plain. It needed something more, was not bad, but would not order again.  To be honest I went in expecting to be highly disappointed: chain + Italian = miserable food, instead I was impressed and plan on trying them again. PS that says something because Italian is not my favorite food.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "uohvmcFpNnw-kc9U0T5j9g"
  },
  "8_urv0xjZTdWI2uxbuF1pQ": {
    "date": "3/2/2013",
    "text": "This is a big hit or miss kind of place.  nice atmosphere, friendly staff... maybe a bit rushed.  the food has been really good on some visits and just okay on others, therefore 3 stars.  I agree with Nunya that for the price Armstrongs is a better choice, not as nice, but the same quality food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6u3S4iKNerG-fSOSaYydcQ"
  },
  "st6xjcSS_kulkuHgG-CZzg": {
    "date": "12/18/2012",
    "text": "One of my favorite lunch spots! The bread and dipping oil is always delish. I really enjoy the soup (wedding) and salad ( instalta della casa) combo. The appitzer shrimp is yummy too but I sometimes get that as a meal. The service is so-so ,",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9wzK4bWSzkDcOAuc-GYb-g"
  },
  "zlOGchnYib9A3sE3HS0SVw": {
    "date": "10/27/2014",
    "text": "Food was really good.   Mama's lasagna  bolonese is really hard to beat. It is lasagna loaded with fresh sausage and cheeses then covered in Alfredo sauce.  The portions are huge.  They have expanded menu for low calorie options, but I never thought of this is a good place for a diet.  The fresh bread with dipping oil was really great combo. It would be better if you could put this bread on something called a plate!  Although the  restaurant  wasn't  busy, getting refills on beverages was a wait.  Even better was the wait staff sitting at tables counting tips while customers were eating an hour before closing.  Or employees leaning up against the open kitchen like they are bored.  Of course, watching someone dump the paper table covers and use the side that hit the main walkway to cover someone table didn't help.The staff was friendly but  I can't  get my own stuff here!  I  hope it was a bad night, because it has always been great stop.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vlu3tkXF9uMgzyWgHnS0sg"
  },
  "Cuw8P1attxCpbbsAMXbQaA": {
    "date": "12/18/2012",
    "text": "Great ambiance - food was served very quickly & the waitress was very pleasant. A bit on the pricey side compared to some of the local fare (Armstrongs is a comparable establishment that is not chain related though). Brick oven food is tasty though here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RoU_n7bum8Cgnf2-kbAVtw"
  },
  "Kxt8LtAyu2wUE4Nh_JoJrw": {
    "date": "8/16/2009",
    "text": "I've actually been to this restaurant several times over the years and when I think back on it, I've never had a disappointing experience.  On my last visit, nearly two weeks ago, I had a pleasant glass of Chilean Sauvignon Blanc.  I normally like New Zealand SBs, but since they didn't have any on their menu, I branched out to Chile.  Very nice.  I was tired after biking in the pouring rain in the morning and siting on a plane that had no A/C.  Combined with being tired, I was also hungry and was counting on a solid meal.    Bravo came through.  Again.  I went with their signature pasta dish, their Pasta Bravo.  It's rigatoni in a red pepper cream sauce, combined with chicken and mushrooms.  Yum.  Is it the best Italian food I've ever had?  Certainly not, but they have been satisfying and appropriately priced for the quality and portions given.  Top that off with consistent top notch service and you've got a recipe for a four star rating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "d9mSbe_sbWVlnaGtlylmfQ"
  },
  "X4ZKJuy--w0aXO95CyLMoQ": {
    "date": "11/9/2014",
    "text": "Food was delicious, and the server was very attentive and helpful.  The only negative, and I have seen others make this same comment, is the portions for the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GO2QWi5A2YPUmcvF-_R_9Q"
  },
  "cQpQvH9VNwtWkDXQEzM-cg": {
    "date": "9/13/2010",
    "text": "We come here at least once a month as we travel through Pittsburgh and although we really can't comment on the service because we always get take-out, I feel that it's probably fairly consistent.  I know the food certainly is!  No matter what we get, we seem to be very pleased.  It also helps that we use their meal card and after a certain number of initials on the card the meal is on them.  So it's very worth the trip there. (Just remember to bring the card with you-I always forget)  There aren't many good Italian places outside of downtown, (and after experiencing NY's Little Italy even less) but this one comes pretty close!  If you live in town don't waste your time and money with the other places and if you're coming from out of town, go right there you'll save yourself a big hassle looking for a quality place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DonOE12UOxLRBgLlTjqDNA"
  },
  "vyKrlzRDUEXZjOeM6kriWw": {
    "date": "6/1/2010",
    "text": "For a chain, Bravo is a cut above the norm  We arrived late at the Pittsburgh airport, consulted Yelp for spots still open, and decided on this Italian chain.  We found the wait staff to be cheerful and eager, even after what they described as a hard night. Two of us found multiple dishes we'd like to try; one was in a picky mood. The rosemary infused bread was delish, although the olive oil dip was too bland.   I enjoyed the shrimp diovola with a chopped salad starter, while another party member was very pleased with the pesto tortellini. Picky eater wanted the steak/shrimp combo and discovered that he could get the lunch-size version at a reduced price. This also was very good, although his Medium steak definitely was Medium Well. Overall we found Bravo to be a nice mid-point between Olive Garden and a True family run restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hfUqsA9_q8JSnKatpRv5_w"
  },
  "ABliWFp_IKPBeuoLKvdTlg": {
    "date": "6/17/2008",
    "text": "Apparently chain restaurants can be good.  Who knew?  Bravo is probably the best food available in the suburban gloom surrounding the Pittsburgh airport, which, yes, hardly sounds like an endorsement, but I mean it in the best way.    I was pleased with my meal here from start to finish.  The atmosphere was slightly kitschy, but I like that sometimes; it reduces stuffiness.  Service was attentive and friendly, without being overbearing.  The wine selection was sufficient for my tastes, and I think it would be more than enough for most rural Pennsylvanians.  Dishes came out at just the right time, every time.  The menu contained several vegetarian entrees, two of which I tried and enjoyed.  The food itself was very good--certainly not the best Italian food I've ever tasted, but surprisingly tasty nonetheless.  Flavors were well-balanced and portions were generous.  If you're in the area (and you probably won't be, unless you stay in a hotel nearby) and you're craving some real food, definitely check out Bravo.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2XqvR5GxhIrmcBV4EnmVtw"
  },
  "XkS4SxXhMmKCLDVbsn8k8g": {
    "date": "11/25/2012",
    "text": "Not if you want real Italian.  The Chicken Parmesan had to be frozen and deep fried with cheese on top.  Sauce was cold and surrounded the pasta and chicken instead of on top.  Someone should get whacked for the quality and presentation of this food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pAknn6awmxktEi273Q4hIA"
  },
  "cV0DK1KpoawONIR8vE5j1Q": {
    "date": "5/23/2009",
    "text": "Cant comment on the service as we ordered take out, but the food was pretty good. Given the amount of tired old chains around in this area, this was a stand-out. Looked pretty nice inside, with its own bar with some folk eating there too (apparently by choice, there were enough spare tables).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aJZLfMq5_gm2-128bzOcAg"
  },
  "FGevRAj9r6kkIduQ58wn7w": {
    "date": "12/13/2017",
    "text": "I just went to this location tonight to pick up some takeout and when I went home my order was missing the chicken. I gave them a call and they not only reimbursed my credit card but also delivered my chicken to my house!!! Not only did they bring the chicken but also included two desserts for the inconvenience!! The manager here was seriously so absolutely wonderful! I couldn't have asked for better customer service for such a little problem!  100% would recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K5MTV6d5psQqM5gePWq8Ag"
  },
  "MxNan5d0FhIuOJuEMVG5kw": {
    "date": "3/2/2017",
    "text": "I went to the Robinson location with a group of girl friends on Tuesday Feb 28th.  The food and service were just perfect.  Mark and Kelly did a great job keeping up with all of us even thought we had a large group of around 18.  We could not have had a better experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FZTBGJD1-kYcQy-apPklZw"
  },
  "dH32Zxe2TSQgRlrXMrcgog": {
    "date": "10/26/2014",
    "text": "The food and atmosphere of Bravo's is similar to an Olive Garden. It's not spectacular.   My chicken parm/Caesar combo was average, but a guest of mine was served a piece of salmon that was mostly raw...  Typically I wouldn't give two stars to a restaurant that serves ill prepared food, however, I was extremely impressed with our server's tact in handling the situation. She noticed the raw food on her own and immediately offered a replacement and comped the meal.   I'm not sure I'll be back, but if you go - rest assured that you will be taken care of.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ybBda5iCGEYWYXAgbug2Pg"
  },
  "g0UkZAt45YUX968FR7effA": {
    "date": "4/19/2018",
    "text": "I absolutely adore this restaurant.  I was extremely disappointed to discover that the \"Penne Mediterranean\" was removed from the menu.  After talking with one of the employees (a delightful, lovely woman - extremely knowledgeable and helpful), I learned that this very popular dish was removed because the restaurant was no longer using penne pasta or sun-dried tomatoes.  This is so confusing -- why would you eliminate an entire pasta and don't you use sun-dried tomatoes in other dishes?  Oh well, I suppose I will have to find another dish that I love as equally as I loved this one.  It always surprises me when a popular item is removed from the menu...  I hope there are enough posts requesting this dish to come back on the menu -- sun-dried tomatoes are not that expensive and no idea why there is an issue with penne pasta.  Maybe this dish can be made with bite size rigatoni, bow-ties, or even cavatelli.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FQwP7xDk4pbG5fOWLWxX_A"
  },
  "STh6GgBHNSB7MJqmQAQNaA": {
    "date": "9/28/2016",
    "text": "This used to be our go to place for birthdays, anniversaries and date nights. But lately the food has been sub par, the menu is shrinking and the service has been slow. The two times we've tried to go there for lunch, well I'm glad that we weren't on a work day lunch or else we wouldn't of gotten to eat.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "056uD1htkVjkiNykWo2z9Q"
  },
  "UiY6RUCgNqCP1P5ug3Prhg": {
    "date": "10/12/2013",
    "text": "Food (7.5/10) = Came here with family and ordered the following dishes:  1) \"Calamari Fritti\" appetizer = Not great, but not terrible.  It is mostly batter, so after the 4th or 5th bite, I got tired of it.  Each piece contains about 20-25% of calamari meat and the rest of the 75-80% is batter.  Served with marinara sauce and horseradish. 2) \"Spaghetti & Meatballs En Sugo\" = this dish was listed under one of their specialties.  Again, this dish wasn't terrible, but nothing outstanding.  You get 3 meatballs which are made with pork and beef.  The meatballs were ok.  The spaghetti and the tomato sauce just ok as well.   3) \"Meatball & Pepperoni Manicotti\" = another dish listed under their specialties.  Flavor was good, but this dish is heavy.  It's topped with a red pepper cream sauce.  You get 3 of these.  Did not taste much meatball or pepperoni.  Could not find any meatball or pepperoni after dissecting one of the manicottis. 4) Grilled tilapia and vegetables = the healthiest dish I got to sample, lol.  But even then, you can taste an element on butter everything. Fish was ok.  Vegetables ok.  Overall, this dish was just ok like all the other ones I sampled above.  Ambiance (8.0/10) = a fairly relaxing environment.  Well decorated.  Spacious.  There is a pizza oven immediately to your right as you walk into the restaurant.  In the far back, you can view the line cooks in the kitchen preparing your food.  Service (7.5/10) = standard  Overall opinion = This place was just ok.  Came here because I didn't want to take family to a chain restaurant (chain restaurants dominate this commercialized area).   Unfortunately, I didn't know this was a chain restaurant until after the visit.  This would explain why the quality of the food served at Bravo reminded me of Olive Garden.  Large quantities of meh flavored, heavy rich food.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Bkawvyssw0306OVHKIZiEQ",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. &amp;#34;Meatball &amp;amp; Pepperoni Manicotti: with ricotta and roasted red pepper cream sauce&amp;#34; pic 1",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Bkawvyssw0306OVHKIZiEQ/o.jpg"
      },
      {
        "img_id": "jSCi--tda0INdh2A-VG5wA",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. &amp;#34;Spaghettini &amp;amp; Meatballs En Sugo: Beef and pork meatballs in a tomato sauce with Parmigiano-Reggiano&amp;#34; pic 2",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jSCi--tda0INdh2A-VG5wA/o.jpg"
      },
      {
        "img_id": "qh8Ncjv559Kdvz-43ltuWw",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. &amp;#34;Spaghettini &amp;amp; Meatballs En Sugo: Beef and pork meatballs in a tomato sauce with Parmigiano-Reggiano&amp;#34; pic 1",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qh8Ncjv559Kdvz-43ltuWw/o.jpg"
      }
    ],
    "user_id": "tCXElwhzekJEH6QJe3xs7Q"
  },
  "Aa9Zxf-ZfnMCPS4_JN6YEA": {
    "date": "7/31/2017",
    "text": "Ordered pasta(rigatoni) with Alfredo sauce. Pasta was not  cooked well. It was still raw. The worst Alfredo sauce I ever had. Pinacoloda also bad. Never try this restaurant if you are looking for good Italian food",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BkLNCQShxiW7187D8XIQZw"
  },
  "kkFgm908ScMV_fweevaJfw": {
    "date": "11/3/2013",
    "text": "While shopping at Robinson a couple weeks ago with my parents, I suggested dinner at Bravo. I hadn't been to a Bravo since my husband and I first moved to Pittsburgh, and I really enjoyed coming back to the restaurant. Though the interior of the restaurants are elaborate, I do appreciate how nice they look compared to their competitors (such as Olive Garden). The service was good, and the food was great. I ordered the Penne Mediterranean, which is made with multi-grain pasta, spinach, sundried tomatoes, pine nuts, feta, and olive oil, and it was delicious! My parents ordered the Margherita Pizza. The pizza was tasty, and the crust was perfectly chewy, doughy, and sweet. I look forward to coming back in the future and trying some other dishes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cCke3VtFLtqgzkgYSrSE2g"
  },
  "FMZndEc2zrfDtcoyuWuChA": {
    "date": "12/31/2015",
    "text": "Better than Olive Garden I guess, but reservations are meaningless. They are an hour behind schedule. Won't be back ! ! !",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zs5zV2uamxMG_2CwOR7icA"
  },
  "lNdDiTxzPwSkja_hHZ3pcA": {
    "date": "8/27/2014",
    "text": "A noisy place, but the food is generally very good. They used to have better breads when for when you were seated and could use them in the dippy olive oil. Now the bread is kinda cardboardy with some herbs and spices. Not real authentic Italian. They used to have wood-grilled chicken salad on the menu and they will serve it if you ask. It's just strange to alter a menu when you know previous items were in demand and pretty good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gH230TFlvOdupiNwJAi1LA",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gH230TFlvOdupiNwJAi1LA/o.jpg"
      },
      {
        "img_id": "RZxAxg0tTj91I3cM2bNAsA",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RZxAxg0tTj91I3cM2bNAsA/o.jpg"
      }
    ],
    "user_id": "3z1EttCePzDn9OZbudD5VA"
  },
  "XoTXZySebvk-0yZw1q1U9A": {
    "date": "4/10/2011",
    "text": "I really like this place a lot! When some of my friends from Jersey visited one time, I took them here and since then, one of them can't stop talking about it! I think he'd visit Pittsburgh again just to eat here again.  My favorites are the shrimp fra diavolo and the pasta bravo chicken. They're both so good! Sometimes the shrimp fra diavolo is a little different. Sometimes it's SUPER spicy, sometimes it's just right, sometimes it's not spicy at all and is a bit spicy. I wish it stayed more consistent, but regardless, it's still really good. The pasta bravo is always good. It was the first thing I tried and still one of my favorites.   They also have really good pizza. Their margherita pizza is really good.   Of course, my favorite appetizer, the calamari - so delicious. I've always been happy with it. Comes with two delicious dipping sauces and it's perfect size to share with a friend.  I also love how they have white paper over their tables so you can always draw/write while your'e waiting for your food. (:  The wait staff is always really friendly and one time during the summer, I got re-fills! That made that experience so much better.   The interior always looks nice. It has an ancient Italy feel and in the back, you can see the cooks and brick ovens. Some restaurants feature outdoor seating which is real nice when it's warm outside. You could definitely come here for a casual meal with friends and family or come for a romantic date.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E_ksx9NkEHGn34jCPZ-qoA",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. calamari!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/E_ksx9NkEHGn34jCPZ-qoA/o.jpg"
      },
      {
        "img_id": "d0OaoqOGamvsJmispeLnLw",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. shrimp fra diavolo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/d0OaoqOGamvsJmispeLnLw/o.jpg"
      }
    ],
    "user_id": "qpnrU31DaVDjxO8gxkrQGg"
  },
  "y4UFZJzm5JUTrSd5g9MKMw": {
    "date": "10/26/2015",
    "text": "Can't miss place.  We go often and never go away disappointed.  Nice staff that allow us to order off menu from time to time and the lunch specials are a great budget item.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x3_WktDd9Xw96-OuKPG-nA"
  },
  "6jCwqFVInRkijiZrwHXRdA": {
    "date": "3/4/2013",
    "text": "Came here with my in-laws from out of town for dinner and we had a reservation for 6 at 7pm.  We arrived at 6:45 and were told that are table want ready because they were waiting for a large party to leave.  We waited until 7:15 before I pointed out that there was a table large enough to seat us in the corner that had been unoccupied for 20 plus minutes.  I was told that the table was for a reservation coming in at 7:30pm...hmmmmmm.  I asked the hostess why we were supposed to wait for our table still when they were holding this table for a future reservation when we had been there for over 45 minutes?!  She told me \"that's just how we do it and your table just left so you'll be seated in a area minutes.\"  Huh?!  After we sat down I asked to speak to a manager because I felt like the way the hostess explained the situation could have been better.  The GM, Jennifer, came over and I explained (in a very calm way) what had happened and I thought it was a good learning experience for a young, high school aged hostess on how to explain seating priorities.  She agreed 100% and thanked me for not be rude about the way it was handled.  She also said we could get some appetizers on the house for the inconvenience and brought out a few different items for us to try!  WOW!!!  Overall...Jennifer was fantastic as was the service and I would go to this restaurant time and time again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wpOFf6NU-enqM2B5MrMIXA"
  },
  "hhG56WrGa1beZzgqEtvHHQ": {
    "date": "1/10/2017",
    "text": "Food was very good and prepared as I had asked. The service at the bar was another thing.  No utensils when appetizer was delivered no bread and never asked. More concerned on watching the TV  and if I ever needed anything else. May need to try the dining room next time IF I return",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6FyORfnroJ2jXWMkry2-6w"
  },
  "mCm5f_zsr6OkQUfbakAcGw": {
    "date": "2/16/2013",
    "text": "Bravo! Has always been one of my favorites .. still to this date!! I have visited on dates, with family or friends and always a pleasurable experience.   I love the atmosphere and menu..  My usual is the penne mediterranean and a cesear salad.. together they are LOVE!   Their chopped salad is also out of this world and oh the pizza is outstanding.   The restrooms are always spotless.  I totally recommend Bravo!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "U3d5onJ1w5wXipDMQuLZvQ": {
    "date": "6/19/2010",
    "text": "I came here a couple of times a few years ago, but I haven't been back until now. Every time I've come, it's always packed! And the service is great.   FOOD: We started with the complimentary bread and oil with tomatoes. The warm bread is delicious with the oil that's a bit salty but flavorful. I had the grilled salmon salad which is grilled salmon on top of a field of greens, grilled asparagus, tomatoes and shoestring potatoes. The balsamic vinaigrette is a bit sweet but tasty! The whole meal was satisfying for a light dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sv5K9wQ04MqxtvytKXORFw"
  },
  "cbBm6bLeRuZ9QoZ_5xD6uA": {
    "date": "7/6/2014",
    "text": "Food is really good, no complaints at all there. The service is also quite good at this location. The only real down side is that it is a little on the expensive side, even considering that Italian food is generally already on the slightly expensive side. Olive Garden will always be cheaper (and you'll get much more food), but if you're willing to spend, I would definitely recommend checking this place out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "F1CHBY2gyEosREuoc97hhA"
  },
  "q35eSxVTKTpY55VlGEXo8Q": {
    "date": "6/29/2014",
    "text": "This place is gross. Here for brunch and they're out of eggs. They keep their dessert tray on the divider between booths where someone leaning back would end up with their head in fake whipped cream. They also store their paper table cloth covers on the railings that run down the center aisle of the restaurant. I hate it here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "r1zXOZ8gBYmLrMvVF0qY9Q"
  },
  "CQZFizHrjlmcmFAei2tohg": {
    "date": "5/2/2014",
    "text": "Decent Italian. Not thrilling but OK. I had the lasagna which is a large portion swimming in sauce which was good. Service was good. Just not overly wowed but would go again if necessary.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qtWYsp3Fagzr-yWtJvO8JQ"
  },
  "Mm9vPdiTvBPfPgXfhXIKiA": {
    "date": "4/3/2014",
    "text": "Came to Bravo with the family just because my mother said that the bread sticks were to die for, they weren't. The food was ok and so was the atmosphere. I'm giving it a three stars just because it's a chain restaurant (which I didn't know) and I didn't like the service that much. I'm definitely going to give it another shot! Try everything twice like Andrew Zimmerman says.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cfB4Txhm4Yz7k-tthryxPw"
  },
  "ZGlIeBPTcXHxUgE4Fr023w": {
    "date": "8/11/2018",
    "text": "Second time visit from Florida, so obviously I'm a fan. Love the bread and dipping sauce!   The salad is amazing and one of the most unique I have tried.   The entree was all me, screaming this is your dish! So the balsamic chicken is a major WIN!  Will continue to visit on my trips from Florida.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IDUjT81ETFjwMPqd6fh9wA"
  },
  "rfuoIXzAOiEGYdwjBWSj8g": {
    "date": "2/27/2018",
    "text": "Amazing service from Sherry! We came in for a small date night and saw our server had a party of at least 25. She was still soooo amazing in providing service to us without letting her party wait or us. That's amazing. Entrees were delicious, appetizer absolutely wonderful, and dessert topped off the whole meal. I will request Sherry every time, she is the best service I have encountered at any business!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "19kmgZ4dFpRSmPlyeVn9CA"
  },
  "gk78VifC1DX-HuE14ES1WA": {
    "date": "9/15/2017",
    "text": "We came here since we had a coupon. You can make reservations via their website which is nice. It takes you to OpenTable. I had the filet and it was delicious. My husband had the lobster ravioli. I was disappointed that they didn't offer baked potatoes and only mashed or sweet. The chopped salad was rather small and had a lot of black olives, more you would want on a salad. The service was quick but our waitress wasn't very personable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sEODwsFu5kCIlgb-Kk91SA",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. Lobster Ravioli.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sEODwsFu5kCIlgb-Kk91SA/o.jpg"
      },
      {
        "img_id": "yQJjvxfTV5IDcXyAJvS0qA",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. The filet with green beans and mashed potatoes.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yQJjvxfTV5IDcXyAJvS0qA/o.jpg"
      }
    ],
    "user_id": "T_mcCDS5mfVfGkYX799aBw"
  },
  "NvtB5cti3ud1-JiDIqhP5g": {
    "date": "3/24/2018",
    "text": "This place is so awesome the steak is the best and the drinks are so good this is my 2nd favorite place in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ULkNmYsZqwbT5qr-tD6dQ"
  },
  "rfsOhzLnrvDMzFwizv2chQ": {
    "date": "7/30/2018",
    "text": "Bar service was deplorably slow.  I was the only one sitting at the bar. No excuse for being busy. Just a bad bartender not interested in doing a good job. Food was good as usual unfortunately it was overshadowed by the service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QrmWsE3UdCJsipj-2qE-NA"
  },
  "mbKqzZV78YCBk_sueW6CyQ": {
    "date": "2/20/2017",
    "text": "I've been to Bravo a lot, in several locations. Food's reliably good, never had any complaints about the service. On my last visit to this location I was going to get a modest wine on their wine list that I'm quite familiar with because I have it at home: Kim Crawford Sauvignon Blanc. Pretty decent wine, not too expensive, about $10/bottle retail. Unless you buy a bottle at Bravo - then it's almost FIVE TIMES that much.  I get that one is paying for the luxury of having wine served while dinner is cooked for you. The traditional markup was double retail, then it crept up to triple, and now Bravo sees fit to try and bilk their customers with a quintuple markup.  Capitalism? Maybe. But it's also a management attitude, one at Bravo which has apparently decided that rather than a reasonable markup, they're testing to see exactly how much they can gouge the customer and get away with it. There's a line somewhere, and for me, five times is that line. There are a gazillion restaurants looking for my dining dollars - I'd rather go somewhere that appreciates my business as clearly Bravo does not. What's next? Six times? Why not just charge an even $100? Ridiculous? So is almost $50 for a bottle that wholesales around $8-9.  Update: Following my review Bravo Customer Service requested contact info so that the \"guest services team\" could follow-up but they never did, which simply confirms my comments regarding customer appreciation.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "PYpWAd7D71vx5IN7o80Ltw"
  },
  "yA8HkNvxyClwynUsuDaV9w": {
    "date": "5/19/2016",
    "text": "Yes, it is a chain. Yes, it was busy. Yes, I would go back.  I was staying at a nearby hotel, and was happy to find this place within walking distance. The waitress was extremely attentive and very friendly, and I appreciated her suggestions and modifications to ensure that my food was vegetarian. She really made the meal.  The food was good quality, too. I enjoyed my salad, and tried it on the recommendation of my waitress... she knew her stuff. If I am in Pittsburgh again, I will look this place up and give it a whirl.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RQaskBMEe6N4lX8GcdacSA"
  },
  "GYeM_1pjsOPWOUPQ9YxsDg": {
    "date": "3/8/2018",
    "text": "My wife and I went here and waited over an hour for our meal  The manager apologized but they should of not charged us at all We'll never  We were contacted by Alex the service manager and was very nice and corrected the problem and we wanted to repost and tell everyone Thanks again for caring",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6FKM9zucC6U-iW4gtamUkA"
  },
  "LONVgX6jASzLE_R5vsPF1Q": {
    "date": "3/13/2018",
    "text": "Linguine with clam sauce is one of my favorite Italian dishes. The version I got last night at Bravo in Robinson Center was, hands-down, the best ever! There were lots of baby clams that were as tender as could be, and the sauce was buttery perfection. I love Clams Casino, but I've never had bacon in a clam sauce before this. Now I won't have it any other way! The chicken caprese that my wife ordered tasted as delicious as it looked. I promised I would make her this at home as soon as good tomato season arrives. Our service was great, from the reception staff who held the door before my wife could open it for my wheelchair, to our server, Danielle, who was efficient, personable, and helpful. The only part of our experience that kept this night from its fifth star was a disappointing lobster bisque that was too thick, garnished with shrimp instead of lobster bits, and tasted of commercial Lobster base instead of lobster stock and cream. The bread was also a letdown, reminding me of the doughy stuff I'd get at Olive Garden. All that being said, I can't wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "38iT78JiSwzA-polocuSOA"
  },
  "3XDjQwTkbcUGEoqDsVcXFA": {
    "date": "1/13/2018",
    "text": "I had never been to a Bravo! before but tried it for the first time the other night.  We went with a large group and had a reservation.  They were pretty packed.  Service was pretty good and attentive throughout so no issues there.  Make no mistake - this is chain Italian but I thought it was pretty good.  Definitely better than the Olive Garden and Buca di Beppo and probably on par with a Maggiano's.    They do have a full bar but no beer on tap.  Not cool.  They had a couple of IPAs which is a plus but everything else was very generic domestic.  Our table started out with a number of apps and they were all decent.  Calamari was solid and I also liked this pepperoni cheese dip.  The complimentary bread was actually very good.    For my meal, I did something strange.  I started with a Caesar salad and then went with their chicken chopped salad.  What can I say?  I like salads and was trying to keep it somewhat healthy.  The Caesar was pretty standard but definitely nothing to write home about.  I very much enjoyed the Chicken Chopped salad.  It was fresh and came with a ton of grilled chicken.  It was a cool place for a group to go.  I'd have no issue going back again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PNvTArxaFVZF_Qfw3HVPRg"
  },
  "bcEgbtmW8mc9nYO6alqt8Q": {
    "date": "10/20/2015",
    "text": "For a chain, this place is really top notch. The food is fresh, well prepared, and there is something for everyone on the menu.   We have been to Bravo multiple times, and everyone always leaves very satisfied. The grilled entrees, especially the salmon and steak, are some of our favorites! They are usually perfectly cooked, seasoned and accompanied by great fresh sauces.  These dishes  may not be Michelin five star dining, but they blow Olive Garden out of the park. The food is also prepared fresh, unlike the typical processed blobs of pasta you get at the majority of chains in the area.  We have been here for happy hour, family gatherings, business dinners, etc., and have nothing negative to say. Great atmosphere, attentive servers, and some awesome happy hour specials!   The customer service is also wonderful and shod be complimented on their hard work! If you ever have a problem just let someone know and they will get it taken care of.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-wW_KnKsQdSXbsah3iVf6Q"
  },
  "mqLUU16JM5Uml1o262R_xQ": {
    "date": "7/8/2018",
    "text": "Enjoyed my linguine with clam sauce and service was great.  Nice option to stop at on the way home from the airport.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dTXOlgJdUaXiqr64j4Jkeg"
  },
  "ZOoNmJP1QnYdThL1MWtX9g": {
    "date": "11/9/2017",
    "text": "We visited this location recently and were not disappointed. The Shrimp Bruschetta was on point and the Grilled Pork Chop was phenomenal. Love the atmosphere as well. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nUX6itMZ0iUv86fw0bPaoQ"
  },
  "n-xpCNiJgsK5ajfjySlOcA": {
    "date": "11/20/2016",
    "text": "I had a birthday dinner on November 19th with 15 friends. As usual the dinner was excellent but the server made our entire party feel like we were the only customers she had. Bravos should clone her. Our food was excellent and everybody had a great time. Not one single order was mixed up or messed up. Every plate was so clean there was nothing left for the dishwasher to do. Thanks Bravos fir making my birthday dinner special.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W4vm7DWibYkpWLr8jLMuKg",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W4vm7DWibYkpWLr8jLMuKg/o.jpg"
      }
    ],
    "user_id": "8okrhoVx-ng3pQeOkMB7rQ"
  },
  "O1IZLVoqSzO_f9kCnXfDeg": {
    "date": "4/17/2018",
    "text": "Outstanding service for my daughter's Communion party.  The food was fantastic and the servers were top notch.  It was a great experience!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l18TeShWxF3KxKethtLBKA"
  },
  "yzCKy5EEGtczccjHylG8kQ": {
    "date": "12/17/2015",
    "text": "There are Italian restaurants and then there's Bravo. Beautiful decor. Excellent food. Superb service. We ordered their shrimp pasta with blackened salmon. It was heavenly! The only thing I was surprised is that they didn't have risotto on their menu! I mean, how can an Italian restaurant not serve risotto?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "40t5OkGSsAb6K27y7E-owA"
  },
  "Z4KKVfdvQZVn5wI2Rbw8EQ": {
    "date": "10/19/2016",
    "text": "In town traveling for business. Walked in and sat at the bar for dinner. Two bartenders. Sat there for over five minutes and was not even acknowledged. A couple came in and sat next to me and were immediately greeted and given menus. Meanwhile, I was still not acknowledged. I got up and walked out. I'll spend my money elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "G91ZvI_UlFH6Vg2i8Df0tg"
  },
  "J1nVFF9JkFkNzseV3hby4A": {
    "date": "12/16/2017",
    "text": "I'm giving a two star b/c the food was awesome but service was terrible.  We were sat and it took almost 10 minutes for anyone to come up to us (which I've waited tables before so they tell you if it's been 10 minutes it feels like 20 minutes to the guest) our waitress finally took our drink orders and that took forever to get to us.  We finally ordered and after we got our soup she came back and said she was so sorry but she lost her paper with our order.  I'm thinking are you kidding me so you haven't even put in our order? Wow the manager apologized finally gave us free desert which nice gesture but by then you don't want desert your full.  We waited",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DRoNBWseb4qwNRpJ6q4YWQ"
  },
  "B9zbe3xK2oxoKrUNPtyR2w": {
    "date": "11/17/2016",
    "text": "Yum! From the appetizer salad to the decor to the friendly and efficient staff, this place has it all! They were extremely helpful as we set up a 80th birthday surprise party, including letting us bring in a cake. Serving 26 of us was well organized, timely, and pleasantly done. Now, the food! There were limited gf menu choices for me and the menu wasn't completely accurate in that some gf meals weren't marked as such. A shared salad was well presented and the veggies were all fresh and crisp! I ordered a salmon with vegetables dish that had a balsamic glaze and it was fabulous! I didn't leave a bite! One low spot was someone's uninspired lasagna. Special shout out to Austin in the bar who was do wonderful while we killed some time ahead of time with apps and drinks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M7ywPpWtsietPugSNCv4Ig"
  },
  "o6vOo3Vc76bgxuAKWYT-Tg": {
    "date": "1/19/2015",
    "text": "I've been a long time fan of Bravo, basically since it opened. I've never been disappointed by any of their dishes. Some favourites for me have been the salmon salad and portobello mushroom ravioli. I just recently discovered their happy hour specials weekdays starting at 5:30 (I believe). The food and drinks are all around the $5 mark and I highly recommend the crispy ravioli as well as the shrimp appetizers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3RZL9Lx8DWPB1dQmlJSLaA"
  },
  "6V5LrkWf5wV6CoGCwV6Dnw": {
    "date": "6/30/2019",
    "text": "Visited Bravo! for the first time alone and sat at the bar. Sitting alone at a restaurant makes you more aware of your surroundings. Try it some time! Anyways, the bartender/ server started off very bland. She was polite but not energetic. She served me my food and drink and left me alone. At the end of my meal, however, she asked where I was traveling from and what plans I had. We got into a discussion that later involved multiple other servers and their patrons to join in. They told me what places to visit in downtown Pittsburgh. I really enjoyed the chat. As for the food, it was delicious. Not as much pasta as I would get served at a place like Cheesecake Factory. But it was good. The vibe of the place is late night dinner with a beau or a nice family gathering to celebrate a birthday party for a seasoned adult who loves Italian.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-_sjXW2_wE0_8wfEJKN8Og",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. Spaghettini &amp;amp; Meatballs Dinner w/ Strawberry Fresca liqueur for my Saturday afternoon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-_sjXW2_wE0_8wfEJKN8Og/o.jpg"
      }
    ],
    "user_id": "t56Oxxa2KfSWKM7JNXyRDA"
  },
  "8jMSOdwakUobWtRIhO-cgQ": {
    "date": "8/29/2019",
    "text": "Visited here for a friends birthday dinner. Ambiance is nice and the restaurant has a fancy feel to it. Staff was friendly. This is my second time having dinner at Bravo and I really want to like it but the flavors have just been disappointing for me. We ordered the ravioli app and it was just okay. The dipping sauces tasted a bit odd to me and the raviolis weren't filled. Then we had the cheese dip appetizer that tasted very bland and had two pieces of bread with some apples. A bit lackluster. I did enjoy the lobster bisque soup. I thought it had a lot of great flavor. Unfortunately the lobster ravioli also lacked flavored and the raviolis didn't taste too much like lobster in my opinion.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YaqiI-6TDb0S23az21hITA",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. Crispy &amp;#34;Mozz&amp;#34; Ravioli",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YaqiI-6TDb0S23az21hITA/o.jpg"
      },
      {
        "img_id": "MzL1hRp4cC8oI3Inxi1Giw",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. Pecorino Cheese Dip",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MzL1hRp4cC8oI3Inxi1Giw/o.jpg"
      },
      {
        "img_id": "ZfwYt3-QP5mtZCrd0uWDxA",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. Lobster Ravioli",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZfwYt3-QP5mtZCrd0uWDxA/o.jpg"
      }
    ],
    "user_id": "XVTqV_zHUWC6BOfOsq3nRg"
  },
  "64yL083dpfK23fF59McX6A": {
    "date": "9/20/2019",
    "text": "I ordered through DoorDash for the first time a few weeks ago. I got the chicken parm and wedding soup and it was delicious! So, I was excited to order lunch again. I ordered the house salad and shrimp Alfredo with special instructions to hold the tomatoes on the salad and include an extra side of Alfredo sauce (makes reheating it better). I received my meal with tomatoes on the salad, no big deal I'll pull them off, and no side of sauce. Including barely any sauce on my actual meal. I'm very disappointed by what I received. I know that if you're not interested in taking special instructions you can turn that function off, but as a customer it's disappointing to know that you couldn't be bothered to even glance at the special instructions.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7JTkn6C1_RiRVT3e2IhOCw",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. Barely any alfredo in the shrimp Alfredo.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7JTkn6C1_RiRVT3e2IhOCw/o.jpg"
      }
    ],
    "user_id": "LerU-z8cPjfJfBg2gNQwyw"
  },
  "aMhrkMIzX7OY3czRqPT2uA": {
    "date": "3/20/2019",
    "text": "Very unimpressive. It was about what I expected from a chain Italian place. About the level of the other main cheap Italian chain. The wedding soup was decent, though they didn't use the correct pasta. The pesto was not very good at all. It tasted like a cross between good pesto and what I'd imagine sawdust would taste like. It was also COLD. It may have been heated at some point, but it wasn't even left under a heat lamp. If we hadn't been with another couple, I'd have sent it back. (I thought this was the reason it tasted really bland, but when I heated up the leftovers at home it was still very bad pesto.)  I'd definitely get something else if we ever go back there, but I hadn't been to that Bravo ever and I hadn't been to any Bravo in years, so I doubt we'll go back in the near future.   The service was decent, the bread was great (seemed very fresh), and the wedding soup was okay, but I would definitely not recommend it. There are so many NON chain Italian restaurants and if you have to go with a chain, there are better chains, too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y1VnLOEbeBX6wQgtCMoCjQ",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. Pesto looked good...",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y1VnLOEbeBX6wQgtCMoCjQ/o.jpg"
      }
    ],
    "user_id": "ZnIaEvJwrxlBUjimIpx2Qw"
  },
  "vsEpM9pY8ucUkp7YHTQo_w": {
    "date": "10/20/2018",
    "text": "Atmosphere - I like the design and feel of Bravo. Yes, it is a chain restaurant, but in feels more like an independent Italian restaurant. My only complaint is that it can be very loud. This location is a bit smaller than other Bravo restaurants and so the bar raises the noise level even higher.  Service - Very good. I have dined at a Bravo restaurant about 10 times over the years and have seldom been disappointed. Our server was pleasant and attentive.  Food - the menu is extensive and varied. However, I am a creature of habit. I frequently order the chicken diavlo and did so that evening. Although a little more spicy than normal, I enjoyed my meal. We were a party of 4 and everyone enjoyed their meal.   Overall - I love Italian food. I have dined at tons of Italian restaurants over the years. I much prefer independently owned and run Italian restaurants, I would, however, say that Bravo is one of y favorite chain restaurants. The consistency of quality food and service is a standard that all chain restaurants should strive to achieve.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eBnedff2L15dAxfD_btx-Q"
  },
  "GEAV3mXZrxGP5N-ChZDIiw": {
    "date": "12/4/2018",
    "text": "I normally don't get as enthusiastic for chain restaurants but Bravo is always consistent with the quality, flavors,  price, cleanliness,  and great staff- no matter the location.    They provide a free bread service with sun dried tomato dipping oil, and its delicious.   I always get the Bravo chopped salad and usually one of the signature dishes from the menu.  All selections are very good and all meals are made to order so you can make alterations to your entree selection if need be.   If you have room for dessert I would recommend the creme brulee,  very creamy,  not gelatinous like some other restaurants make.    Some locations have a private room for parties which I have attended work/meeting lunches in one of these.    And last but not least, don't forget to grab some chocolate mint candies when you leave.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "6YT5nzXB-TNPKrmPuEOxKg"
  },
  "z8a78YogOscoY_3WepcVZQ": {
    "date": "10/15/2018",
    "text": "This review is for Bravo takeout.  YUCK.  The pasta Bravo was dry and tasteless, barely any sauce, and the few meager slivers of chicken in it could not have totaled more than an ounce. I have had this dish in the restaurant and it's tasty so I have no idea what happened. My friends both got salads, which I have had in the restaurant and they nice generous portions with fresh-looking fish and chicken, respectively. The proteins were hammered beyond recognition.  I would not get Bravo takeout again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hHqH_E9FCI_B6WubV0jPYA"
  },
  "gJ0vxsAqqpVnECyzfkaeUw": {
    "date": "10/15/2018",
    "text": "I have always liked Bravo, even though I am not a fan of chain restaurants.   We showed up on a Saturday night at 5:30 and had a 20 minute wait.   Our table was directly next to the kitchen, which at first I thought was cool, but soon learned it was not.   The kitchen staff is very loud and made it difficult for us to carry on a conversation.  Our server was wonderful, and promptly brought our drinks and took our order.   I had the sausage tortellini with a cup of wedding soup.   The wedding soup was not traditional wedding soup, but was good as far as soup goes.   I liked my tortellini, but didn't love them.   The bread and dipping sauce was good too.   The others at my table seems to enjoy their food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AXBsPgSbyjGkAqPLSwiTYg"
  },
  "CX4toLbsEK9pf-VltdWPDQ": {
    "date": "9/26/2018",
    "text": "A small group of us visited here while in town for work. We were seated very quickly even though we didn't have a reservation. The interior is very welcoming and warm and you can smell the wood burning oven.   I had the salmon pasta. It was good, but the asparagus was a bit overcooked and the dish lacked a bit of flavor.   We shared a few appetizers (calamari and stuffed peppers). The calamari was a bit chewy, but the dipping sauce was delicious.   I ordered the berry lemonade and it was very tasty. Just the right balance of sweet and tang.   Overall, I think I would come back, but try a different dish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XTM3INNj3liAZ-d_OcT8Dw"
  },
  "Xx89XmykQCM1i1_Ncd1crw": {
    "date": "2/15/2019",
    "text": "We normally don't go to a lot of restaurant chains. Now we aren't anti chain people. We like to support independent restaurants and experience their charm and creativity.  That being said, we were shopping on Sunday and it started to snow pretty hard. We had an hours drive home but we were both SO hungry. We had never eaten at Bravo but thought we would give it a try. I am so happy that we did. Most of the people that work there are pretty young but all worked very hard and were very nice. I ordered the Eggplant Parm which is my favorite Italian dish. My husband ordered Chicken Caprese. We were served seasoned bread with flavored olive oil for dipping. That was very tasty. I wish we would have been given more but I guess if we were we wouldn't have been as hungry for our meal. When our meals came I was caught off guard. My Eggplant was sliced long ways. I am used to it being cut sideways so they are round. This was long rectangles. The eggplant is by far the best that I have ever eaten. It was so crusty on the outside and tender on the inside. Just enough sauce to not over power the eggplant. It was not tough at all. So many times it is tough to get good eggplant in the winter.  It was wonderful. My husband loved his Chicken Caprese. It was cooked perfectly. Moist and tender on the inside and just enough of the very flavorful sauce as to not over power the chicken. Overall we had a very good experience  at this restaurant and will definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HjdK68rl6jfm9TonH2ZmJg",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HjdK68rl6jfm9TonH2ZmJg/o.jpg"
      },
      {
        "img_id": "IkakBnC6kODIfihz48FgqA",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IkakBnC6kODIfihz48FgqA/o.jpg"
      },
      {
        "img_id": "S4AWPW5pNxPVxdlBd8T0Xw",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S4AWPW5pNxPVxdlBd8T0Xw/o.jpg"
      }
    ],
    "user_id": "d1NCKAACKu7PWjkw0eGQVg"
  },
  "JizW1A1xIWSMmv8zXbLF4A": {
    "date": "11/20/2018",
    "text": "All I wanted was some bread and oil to eat with my pasta on my lunch break. So I thought I could get some from Bravo. I should have told them I just wanted a few pieces, I ended up with a whole loaf, which would have been fine if it had tasted better. I get back to work to find that it's not fresh at all. It felt like it had been sitting out all day and they just decided to get rid of it by giving it to me. It was a little too hard and dry for my taste. What a waste!  The oil had next to no herbs and spices...really disappointing!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fAqwKvIBdLyxtodfMSEIvg",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fAqwKvIBdLyxtodfMSEIvg/o.jpg"
      },
      {
        "img_id": "jn2KqmXjkBVS3lGTD-P7PA",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jn2KqmXjkBVS3lGTD-P7PA/o.jpg"
      }
    ],
    "user_id": "H7XDDvuv9-0FjF2okn7QDg"
  },
  "LLTa060m3qYhmZQa4mvcvw": {
    "date": "5/15/2018",
    "text": "Stopped in for a quick lunch.  I sat at the bar and the bartender was pleasant and quick. Unfortunately the chicken in my salad was raw in one section.  Update: Bill from Bravo never reached out to me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DDO5U20se-TjXj9Vr3h6Qw",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. Raw chicken.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DDO5U20se-TjXj9Vr3h6Qw/o.jpg"
      },
      {
        "img_id": "5AYftYOBrq0QfqZTvwdpEQ",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. Raw chicken in Romano crusted chicken salad.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5AYftYOBrq0QfqZTvwdpEQ/o.jpg"
      }
    ],
    "user_id": "z2S2HYVNwCIBRESeMkJjjA"
  },
  "WuHJ4OKCJEBrrDWdpvNCVA": {
    "date": "6/24/2018",
    "text": "We went around 12 on a Sunday and had the brunch menu. The food was really great (chicken/spinach flatbread, the pepperoni pizza and the Sicilian omelette) and were all prepared well and exactly how we had ordered. The pizza was spot on and the omelette was amazing. The egg was cooked perfectly and the mixture of Sicilian favorites inside were outstanding. The brunch potatoes had a good crunch to them and just the right amount of seasoning. I certainly wasn't hungry after all of that.   The issue we had was with the service. After it started out okay, our waitress disappeared and spent most of the time talking with the gaggle of servers behind the large plant in the middle of the room. There were maybe 10 servers all standing around talking and we weren't the only table that noticed. Hopefully the service is better next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4TSZfiuVFnPkTYfZz7rf7w",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. Sicilian Omelette",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4TSZfiuVFnPkTYfZz7rf7w/o.jpg"
      }
    ],
    "user_id": "k9LJyWvwgyxQKcgiz8xikg"
  },
  "rTy8xnxnlhz34dqqnbdyzg": {
    "date": "10/26/2018",
    "text": "I was tossed on giving the a rating a 2 or 4, so settled on 3.  Food we had was a solid 4...very good as always.  The 2 rating is due to the very recent menu change.  Menu is not recognizable from prior (numerous) visits.  Standards gone from the menu like chopped salad, chopped chicken salad, banana peppers of any kind (on pizza or stuffed), few meat entrees remain, etc.  Parent company was sold and new owners had a better idea...or at least that's what they thought. Most patrons we talked to were very, very disappointed.    Coming back is no longer a certainty....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jnn4g_Ydkj152omk17L7Rw"
  },
  "4xZAKkXYT4cgOMDX8ceC-g": {
    "date": "3/5/2018",
    "text": "Stopped here for lunch last week, and I was pleasantly surprised! Haven't been to Bravo in many years and I was impressed by their menu selection. I had the salmon salad, and it was done to perfection. Thanks for a great visit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vdCwnCiBUwhv-_cutIjoxg",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vdCwnCiBUwhv-_cutIjoxg/o.jpg"
      },
      {
        "img_id": "hmc4hLh22FDjVJLRjlkqeg",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hmc4hLh22FDjVJLRjlkqeg/o.jpg"
      }
    ],
    "user_id": "q7kb0GVCWOdORhOrRfkxbw"
  },
  "I9GA6i-dEIkX-RGItfG95A": {
    "date": "9/26/2018",
    "text": "After a busy day working in Pittsburgh and frazzled previous experience,  I just want a quick meal.  I've had good experience with this chain restaurant in the past.  Ate in bar area which was packed including all high tops.   They offer a nice selection of drinks and bar bites discounted.   Wines were ok but what I expected for $5 on happy hour.   Bar bites were large portions and enough to make a meal with 1-3. Ordered the lobster bisque and enjoyed it.  Crispy shrimp were ok, too much breading for my taste or make it really crispy.   Loved the stuffed banana peppers with sausage.  Service and staff were friendly and hustled to serve the crowds.  Just what I needed,  quick and overall good food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1Z4Dkm9kQtaPOQ9z74QpKw",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. Stuffed banana peppers!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1Z4Dkm9kQtaPOQ9z74QpKw/o.jpg"
      },
      {
        "img_id": "uYdHDJZXguu9YEGMtCKbZA",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. Crispy Shrimp Napoli!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uYdHDJZXguu9YEGMtCKbZA/o.jpg"
      },
      {
        "img_id": "3QOBRHUna5teQDGDHn6i5g",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States. Fantastic lobster bisque!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3QOBRHUna5teQDGDHn6i5g/o.jpg"
      }
    ],
    "user_id": "E8ZPjNX63kfAuUL-U3s5Gg"
  },
  "I4A3m5zlFFBtwzeIPYk6rw": {
    "date": "10/20/2018",
    "text": "I don't know how people like this place! I ordered the GF chicken alfredo and my husband ordered the shrimp scampi. Both meals had zero flavor. It honestly was unbearable to attempt to eat. This was our first time here, and we will never return.  Beer was on point at least!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O2dJITXYhLRH3UuJpJJ4bQ"
  },
  "yCMtt2b6DvyQT1vLDIy14w": {
    "date": "5/26/2018",
    "text": "I had never eaten here before, so my husband made reservations for us one night. Everything we got was delicious and the server we had was wonderful (I feel terrible that I can't remember her name)!   The only reason for 4 stars is because it is rather expensive for what it is (I don't understand why pasta and chicken cost $17, especially when there wasn't a lot of chicken in the dish)..... And the hostess stand seemed lost when we walked in and informed them we had a reservation. Mind you, we arrived early to be safe, but they had a full staff on and several open tables, but refused to seat us early or another couple thay also arrived early.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_O5ajREINPG9zeyhW5Dmqg"
  },
  "NwaowYkpiexXFfsZ0tcPeg": {
    "date": "7/28/2018",
    "text": "Bravo! Is one of our favorite places to bring our out of town guests on the way to or from the Pittsburgh International airport. We've never been disappointed. The food and service are remarkable. Our server Breanna made this evenings experience especially enjoyable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H-l82xjn2RqmKYJjmdBWYg"
  },
  "iJBPqnQEx41xLcuKonOXsQ": {
    "date": "5/30/2018",
    "text": "I was truly amazed at how an Italian restaurant chain could be so good!  From the bread to the dessert, everything was delicious.  My husband and I had a layover is Pittsburgh and went out to eat somewhere close to the airport and I honestly wasn't expecting it to be as good as is was.  Our waiter was fantastic too.  Too bad we don't have this chain in Texas.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mumbrwdA2kF5ysYcGZO4OQ",
        "caption": "Photo of Bravo! Cucina Italiana - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mumbrwdA2kF5ysYcGZO4OQ/o.jpg"
      }
    ],
    "user_id": "bQORvX5LJIFUJ1R1whSDcA"
  }
}