{
  "jrO1twzPWYP-M-KkqRg1Pg": {
    "date": "2/13/2012",
    "text": "Good beer selection, friendly bartenders, and had one really good hot dog that I'm still thinking about days later.  For $3.95 you can get a nice sized grilled all beef hot dog on a poppy seed bun with pretty much any topping you could want on a hot dog, and you get an unlimited number of toppings.  Good place to watch a game too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3WeOOgHn9Nxiezv0cjg17g"
  },
  "aCLnXXLlUM-9Udp0EQFW3Q": {
    "date": "11/28/2015",
    "text": "Ate here after a volleyball tournament. Wonderful pizza. Really likes the pepperoni. Staff extremely helpful and attentive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "97jZnawlKH0woTmW68c6yg"
  },
  "h3EyV8JbzO1IZDLnXj03PQ": {
    "date": "9/29/2012",
    "text": "I have great news for all young women within the Oakmont, Verona, Plum and Penn Hills area.  If you weren't quite bright enough to work at McDonalds or if you could not show your chest off at Burger King, I have the place for you to apply......Carnivores.  A dimmer group of gals that have zero clue on how to properly wait on a table could not exist anywhere outside of perhaps South Oakland.  Unfortunately this restaurant is located in Oakmont not Oakland.  This team of Mensa candidates do not however know the difference.  Unfortunately for me, it has taken me quite a few visits to conclude that this college bar that is not in a college town will never place any emphasis on service.  If you are looking for a bucket of beer and do not care how or if your food ever arrives, this might be the place for you.  For  me, if I stop again it will be for take out only.    Oakmont, you deserve better!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "BbD4IgpiszM4C6iu6LowqQ"
  },
  "Ha08ZzO0utdb0VAOgdVqOA": {
    "date": "3/2/2012",
    "text": "One star for the incredible beer selection that Carnivores has to offer. Otherwise, the experience was a complete failure. The wait staff was exceptional at looking through you and pretending you weren't there. We were only separated by a foot and a half of bar, but it might as well have been two and a half miles.  They managed to screw up both of our orders despite the fact that 90% of the menu is a variation on the same theme (i.e. meat on bread with 2-3 ingredients). We might have said something to a more attentive wait staff, but decided that it was best to make due and eat what we were given less we go hungry. After waiting half an hour to put in an order and another half an hour to get two hot dogs I was willing to make due.  I'll never be able to convince my wife to go back. I may go back just for the beer, but you better believe that I'll be ordering two at a time. A guy can get pretty thirsty waiting at a place like this. I posted our experience to FB and the consensus was that you can maybe go there to drink; otherwise, eat elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "vzB_ad3UIWGevVQtCm7apg"
  },
  "1fOCFunNUjJuA48Dopuqwg": {
    "date": "7/19/2013",
    "text": "The best pizza in this neck of the woods. The beers on tap are ridiculous. Very clean inside and out. Parking is a bit challenging but very well worth it. Don't pass this place up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "smjch7UyH0l5EXWT0SwTbA"
  },
  "bBVhae0-6_3Xo_Sfxzph0w": {
    "date": "7/10/2015",
    "text": "Have been here a few times and food is usually good. Beer selection is great. Service is usually good as well. Parking is terrible. Small lot and few spots on the street. All in all I recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Zp4qT6tMCH8o9ZErtCoog"
  },
  "wCnShvuW-WZXUGtVZMGcSg": {
    "date": "3/25/2013",
    "text": "Great draft selection.  Tons of TVs and very clean.  Great sandwiches.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ytoBA9mBdCA6E0N2GD-MgA"
  },
  "8l79ltgxWPptVEk1uq1hyw": {
    "date": "1/6/2013",
    "text": "I haven't been to Carnivores since the late 90's.  The place has grown a bit and so has the beer selection.  Good crowd and great bartenders/servers.  I will return...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EI-GbSLbQuqvMQ-WlZVeXA"
  },
  "tUXAhWf9LVOMmNgcYWxHgg": {
    "date": "5/26/2015",
    "text": "Could be a 5 star. Haven't eaten yet but food looks good and seems to be enjoyed. I do agree though with what people have said about the bartenders.  It's difficult to get a beer.  Have been here 3 times for a few beers and every time my glass is quite empty before anyone even glances. They are nice and courteous just kinda going through the motions though. Good selection of beers but really need to step up the sense of urgency and serving.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tau96ng1BiPVYFcOpmXGkA"
  },
  "Ho_3RP-ditzBpzQhwPEsMA": {
    "date": "4/17/2013",
    "text": "Great beer selection, if you order Bud, Miller, or Coors you need to be slapped ;-). Wings - very good, garlic parm mixed with hot - not on the menu but should be! Great staff!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "58geBOMZm3c1XduHUS2drA"
  },
  "YHVC6iX6RIvGhHSxSNAFcg": {
    "date": "11/10/2014",
    "text": "Went here for Steelers game. Very large beer selection. Food was very good had the wings they were the small wing dings I like the larger wings but we're pretty good. Fries with cheese was good very large portion. Would go here again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SQKRGzDa7qd8qHb13Z2-Hg"
  },
  "AafzEO0jAftnz9AbvZ7ZgA": {
    "date": "2/18/2014",
    "text": "this is a fun place to go for great food and a terrific selection of beer. the service iscpretty darn good too for being so crowded.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vQof7tY9U_4vLBs5nHtIBw"
  },
  "AP9FEG_-9UMwKTav7NNQvw": {
    "date": "6/17/2010",
    "text": "Food here is very consistent and tasty. Service is attentive and prices are very reasonable. Good selection of beer with the atmosphere of a sports bar. Be warned. This IS a smoking establishment. Our favorites are steak wrap - grade A, with freshcut fries that are nicely prepared and not soggy. We also like the Roni-roll which is a pepperoni roll of ground pepperoni, cheese, and a liitle bit of sauce rolled in a nicely baked pizza type crust. This is a favorite lunch place but you will gain weight if you eat here much.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PuPWzbQJ6P_tax-holDgSQ"
  },
  "h1GmITc6TGmnhXiKgk6vuQ": {
    "date": "9/15/2013",
    "text": "Food is good. Great beer selection. Service is somewhat lacking, but if you're not in a hurry its a good place to sit back and enjoy good food and good beer!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bM55XIkbT7g43fcuE8ebJw"
  },
  "7T1s6fsjmpWdmNXrHYjgrA": {
    "date": "11/2/2012",
    "text": "Slow service and just not quality.  I am not a fan of TV's in every square inch of a place, but that might be good for some.  No smoking is a good thing and certainly crushes the Oakmont Tavern.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0XKl1Z_T9HiMKs8AGzVYg"
  },
  "n-61W5T-gjl0sdbeNnzxWA": {
    "date": "3/4/2012",
    "text": "I view Carnivore's the way I view some family.  Its a bit quirky and not perfect, but I like it.  Its my favorite place to eat in Oakmont.  Most nights I have a friendly waitress and good food.  There are nights with a long wait, etc, but I still like the place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AHVhhVl_q6YMOdmpVUr_WA"
  },
  "VOWDKsFk6B5tI6y4Z6auew": {
    "date": "10/9/2016",
    "text": "Service is terrible. I really don't know why my friends and I go back. A few years ago we had great sevice. Now, it is lacking. It is ridiculous. I was there this past Friday. There was 5 of us. For our waitress took 25 to 30 minutes for her to come back for anything. So if you wanted to order something you literally had to get her attention before she left the table again or you'd never get anything. My husbands food took 35 to 40 mins. He ordered pretzel bites which he wanted out first, and a chicken wrap. We had to ask for someone to check on his food. It had to have been sitting back there because they brought out everything together and it was warm, almost cold in some parts. I ordered a bit later. Boneless wings. It also took longer than 3o minutes. So my friend asked where it was. Turns out it was given to a different table. Then when i waited another 15 mins for it, they had a totally different sauce. So again, we had them taken back. 2 mins later, i finally got what i asked for. The waitress never had a clue about anything going on. Hardly asked if we were okay. Had to ask for drinks. When i asked for my check she got it, but after 25 mins of her not coming back for it, i had to go uo to the bar to pay. The place is chaos. They need to have a better system. Have designated bartenders. Having the servers do it, takes up more time as rhey have 5 plus tables with multiple people. Train them better to have better customer service. They should frequent tables more than 25 to 30 minutes. I love the atmosphere, drinks and food, so i would hate having to find somewhere else to go.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_287i8ZeEf0H1LiqPhyvBg"
  },
  "AFwmepneeeEQrcweco62IA": {
    "date": "4/11/2014",
    "text": "Fantastic beer selection and just an overall great place. A buddy and I went there on a saturday at noon to watch college football, drink beer, and have some good food. All of the above was accomplished. The wait staff made sure we were watching the games that we wanted on our desired TV's. Nobody does that usually but this place did. I was impressed. Ill be going back for sure",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yWrGdmKxq1k854j7vwl7mg"
  },
  "zCT81FgydFbSeunbbjzujQ": {
    "date": "5/16/2016",
    "text": "I seriously love this place. Their food is awesome and their beer and now wine selection is amazing.  However, their service just seems to get worse every time we go unless we get served by some of the more tenured staff.  One time we ordered take out and went to pick it up.  We waited at the bar for 20 minutes to even get noticed and then another 20 minutes to get our food.  It wasn't even that busy!  Living less than a mile from the bar, we got home with the food and it was ice cold.  It seems as if when my husband and I go there or if I go with a girlfriend, it takes forever to get waited on but yet I watch all these younger female bartenders and waitresses flirting and waiting on prospective guys.   Note to staff - a 40 year old professional woman will most likely tip better than those guys anyway if you provide good service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "50hydw1kDal-ObGlve2mRA"
  },
  "i9Blzv9UltgO7QEZzaYJ0w": {
    "date": "4/6/2015",
    "text": "Great selection of beers, seriously I haven't found anything like it in the Pittsburgh area. The food is so-so. Table service isn't terrible, typically nice but slow.   The bar service is laughably bad. I wish I could say it's only occasional, but I live up the block and come here regularly to take out a six pack, for which you must pay at the bar. If you are a woman you will be ignored and made to feel like a second class customer. No matter how well I tip (usually at least %20) the bartenders literally walk past me and pretend they don't notice until I raise my voice to ask for assistance. I have been ignored to the point where I just leave $ on the bar and walk out with my beer.    The times I've begrudgingly stuck around for drinks there is usually something trashy going on like girls selling test tube shots.  My female friends and I have made a game to see how any times the bartenders will attend to and flirt with the male patrons before paying any attention to us.   Go for the takeout beer, not for the atmosphere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "YXhwCSJfz9HJAfl7cY7Jbg"
  },
  "LXd73sj49_j9NSeqaP7K-A": {
    "date": "11/7/2013",
    "text": "Nice little local sports bar. TVs everywhere, great beer selection, very clean, food for the most part is pretty good and decently priced.  The staff is good, and I feel gets a bad wrap. Go during lunch or non-game nights and they are attentive and courteous. During really high traffic nights like playoff games or Saturday nights the service is a little slow just because of the amount of business that comes through the door.  They sponsor all kinds of teams to include adult and kid leagues. Very rooted in the community.   Lastly, go during weekday lunches and talk to Marty, the owner's mother who works there. She may be the sweetest woman in the world.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RVDD9BKrTiH_OhwEsC6piQ"
  },
  "nKuo3qQkt9wSBD6dsoGnXw": {
    "date": "11/30/2014",
    "text": "Great service, above average pub grub, nice comfy booths, extremely clean and updated environment, great beer and cider selection. Prices are a bit steep but you are getting a very nice facility and friendly staff.   This is not an intimate setting. It's not a date night, nor a place I'd suggest any couple dating less than a year go to. This is a \"Hey, we haven't' been out of the house in 4 days except for work, we should probably make sure we don't turn into Jeffrey Dahmer and go to Carnivores.\"  Only downside is it gets INSANELY packed on weekends. If you can snag a booth, great. If not, I hope you enjoy being cheek to jowl. If not, you'll be miserable.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VKrXZY_OjTZ1yg7a3HH_4w"
  },
  "mgmXJo_2oIWiS1CNVWNcwg": {
    "date": "1/30/2014",
    "text": "Normally I get my food delivered from here but last week I met a friend there for dinner. Waitress was really nice & always checking in to make sure we needed anything.  Atmosphere is good  As far as the food goes I would love to review it all but I tend to stick with what I love there which is either the Oak barrel steak salad, which is loaded up with real steak cooked to your liking & the burgers which when I want to crush my diet I go for the Mugga burger which is a beef patty with a potato pancake, pierogie & sauteed onions on it with your choice of cheese, I recommend Gouda. All in all this is a local spot that is welcoming to all.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ir0myV5VfkjD-_Sg_dQcMg"
  },
  "JUTGvYCrSumg17At4fwaPw": {
    "date": "8/2/2015",
    "text": "I have been to Carnivores on business and both pleasure, so I can give you guys a little scoop here. First off, who doesn't love a great brew for any sporting event? Carnivores definitely is a cool spot to watch some pigskin or the big game once in awhile. The beer selection contains a variety of solid beers, I can definitely encourage you to take down some beers during some Steelers games or college football or whatever the heck you want to watch! Food = a deep variety of American, (wings, nachos, ect) and you can find things to share/ split that's your best bet probably, but that's just me. A sweetheart family owmed business that is better than most, which is a must in this industry.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y-wZ6OfqZfRqNwp1wKiu6w"
  },
  "a_s8PU5R7z2OZ5ab7E-t4A": {
    "date": "9/27/2015",
    "text": "I love the newer staff here!! The young servers aim to please and are not snobby. I had issues for several years with past female bartenders/servers ignoring me and I would have to wait FOREVER to get a refill. New girls are sweet and I am shocked by how often they check up on me. Thanks, girls!!!! Brie gave excellent service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fyGX-vkxHdZnPQMKGymjnQ"
  },
  "N44f-MQ_TIz-Ltc8lQ71LA": {
    "date": "8/23/2015",
    "text": "Changed their pizza. It's frozen pizza now. So disappointing. Still a decent place to grab a beer and some wings. Sandwiches are pretty good. Wings are above par. The pizza thing really upsets me. It was some of the best. I can't believe the switched to frozen pizza.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VH96cCvjyETes6Sn-XC5Lg"
  },
  "pVgmhjC3BtamvugfzUV3tw": {
    "date": "7/26/2015",
    "text": "Very solid beer selection and the food is ok.  However, why I bump them up a star is because they donated pizza after my sons' basketball league was over.  Reaching out to the community is a great gesture and will keep me loyal.  Well done.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YTuksHb6YsMI62BqEG_eRA"
  },
  "YdcqfpHRflgSG7Xf-9mq5Q": {
    "date": "1/19/2013",
    "text": "Good pub fare!    Things I like...good bottle/draft beer selection, pizza  Things to improve...I am fish sandwich freak - no real good one here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JEfQk9SVGmPGSjNlBkyJaQ"
  },
  "BFB4_ndkiggseT2N_Tx0_g": {
    "date": "7/25/2015",
    "text": "Good food, big portions, a lot of beer and cute servers. The place is always busy and noisy, but seems to be a local hang out spot. Overall it's one of our favorite sports bars when we feel like watching a game with some wings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0VkjmqY326SvUFofYmEYPA"
  },
  "AW9IxTBP8TKxstNLgQi3tw": {
    "date": "7/27/2012",
    "text": "I ate here this past Wednesday evening with my girlfriend while attending a charity event for Family House.  Due to this we had a buffet of food and I am not sure that it is 100% representative of the normal food that is served here.  In any case my initial impression as we drove by this place was that it was small.  However that was proven to be unfounded whenever we got inside the restaurant as it occupies quite a large space and has ample seating.  There are also many TV's throughout the restaurant including individual ones for the booths and I imagine that it could be quite a cool place to catch a game at.  The beer selection here is definitely one of the better in the city of Pittsburgh.  They boast of having over 30 beers on tap and more than 500 in their cases.  Due to this I was able to order some beers on draft which I had not tasted before and also find some more in the cases.  In the end I took home a 6 pack of craft beers for $15 and was more than satisfied with my purchase.  We started off the evening by ordering some beers which were brought promptly by the waitstaff.  Shortly thereafter the buffet was uncovered and it  had on it a salad with blue cheese and strawberries, lasagna, some type of chicken and peppers and a cous cous.  All of the food was decent with the only real standout for me being the salad.  Having both the strawberries and blue cheese combined with their vinaigrette was very nice.  After dinner was completed they put some dessert onto the buffet which was both peach and cherry pies.  Since I was full by this point, I decided to only take a little bit of each.  The filling of them was nice but was more than overshadowed by the amount of butter on the crust.  It essentially covered my mouth and left me with a not so great taste.  It ended up being so pervasive that I asked my girlfriend for a piece of gum to cancel it out.  The bottom line for me is that I would probably head back here in the future.  It would not necessarily be for the food but more for the beer selection and environment as I would like to experience watching a big game here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "VBESAttt_Qv5jyyY_3uV4Q": {
    "date": "6/16/2015",
    "text": "Lives up to its name. Carnivores. They have big meaty sandwiches, the Italian Stalian is my ultimate favorite! And the loaded tater tots are a go to with friends, tons to share. Huge beer selection including my favorite Summer Shandy's and Red's Ale.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cRx8ucdGPVv5a7IgXqddAw"
  },
  "ouYRTzFJJnXSPtHDEFU7_Q": {
    "date": "4/27/2012",
    "text": "The food is very good.  This place is usually crazy/busy/hopping, so if quiet and relaxed is the decor you are looking for, I don't think this is the place.  I'd like to put to rest the statement that the waitresses are unfriendly, we observed a lot of attentive, friendly service, especially by our waitress, Heather.  The wings are excellent, very tender and juicy.  They just added a new hot dog menu (in last 6 months), so you might look for that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "VErL66Bz07M-is-c2geNTw": {
    "date": "8/30/2013",
    "text": "Tons of tvs. If you're at a booth you can watch whatever you want. Their beer selection is awesome, you can mix and match six packs. The staff is great and they know their beer. They do their best to accommodate special orders in the kitchen. The marinated steak salad is great. I haven't ever been disappointed at Carnivores.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s53lg6FLUHubh2WQAStz6w"
  },
  "xhM45SLg0_VXChtrdVdiGA": {
    "date": "1/10/2012",
    "text": "This place is a hidden gem. Beer choice is fantastic, and love going to the coolers to pick my own bottle. They will also run specials for certain bottles, so that is a nice treat. I have been here a few times and all the food I have had is good.  My favorite is any of their wedgies.  Big and stuffed full of delicious goodness, they hit the spot every time. Wings here are also good, so check them out. Service here can get slow at times, particularly on game nights, but it's never so out of control that I've had to complain. Carnivores is set up with so many TVs that it's perfect to watch a game with friends. It is also a great place for groups.  I have also seen people bring kids in during dinner and lunch hours, however I would not recommend later in the evening as people are drinking.  Can't wait for the Steelers to begin, so I have an excuse to go back! :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qb0ZfVOe33QVjNHGoGBabg"
  },
  "UcS-pbHWwMsKw-tCo9aXTQ": {
    "date": "10/22/2011",
    "text": "Carnivores has great food, a nice selection of beer and a pretty cool atmosphere. All the waitresses seem pretty friendly although the bartenders seem not that friendly...there is no smoking here, lots of TVs, but PARKING SUCKS!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "joCcHNyvjrwEg_6KX6MMPg"
  },
  "bk0kFazgU_PzVSDfmTXRfQ": {
    "date": "4/26/2016",
    "text": "Had lunch there yesterday with a client.  Food as always was very good. (Love the tater tots), and the service was impeccable.  We were doted on by a team of employees.  I only wish I could get there to watch a Pens game.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GL9r2hwguu1oUa_MYqPsPg"
  },
  "a54ef98JlZrW5lrjGknPCA": {
    "date": "3/7/2017",
    "text": "I posted a great review at the beginning of 2016- specific to service as well as food. Since the owners opened a second restaurant in 2016-pub 333- the service has gone down hill. My office is in oakmont so i have been a regular on thursday nights. Im used to the previous manager jen and staff being friendly and accommodating. The waitstaff now are no longer attentive and i have to ask for what i need (past 3 times ive been here)...and i sit at the bar where i would think it would be a lot easier. As i write this, there are 9 of us sitting at this huge bar with no one behind it and my drink is empty. The guy that waited on me is sitting at a table with friends. On a good note- there is an older blond haired lady that is working her ass off.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iNhKt80XSgk2dXAbY_gVpg"
  },
  "uA3f0iqREd5FkcY2AQ6qnA": {
    "date": "10/17/2012",
    "text": "I went on a Sunday and had a blast.   The following changed my views:  Atmosphere:  - They have a ton of TVs - They have 2 large garage doors which gives the place a college feel.   I was thinknig of asking the waitstaff if I could park my car inside ;-) - You are surrounded by beer.   What more can a person want.  I recommend comfortable clothing (stretchy pants)  Food: Sunday Beer Specials!   $3 Sierra Nevada.     They had more varieties then Old Country Buffet has deserts!  - Pizza was very yummy!   Wings (BBQ / Hot) were good as well.     Service: The waitstaff was attentive and provided good recommendation.   I am now a fan!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E5qYlqdOcO_dg3rXhnFZwQ",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. Ultimate BLT wedgie 1/2",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/E5qYlqdOcO_dg3rXhnFZwQ/o.jpg"
      },
      {
        "img_id": "xVSbPWgvEsMJcKtMpTunOA",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. Best shrimp- huge.  Pick your wing sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xVSbPWgvEsMJcKtMpTunOA/o.jpg"
      },
      {
        "img_id": "k7VnECn4Dm_QWrWdz4kSnQ",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. Top 3 Bloody Mary - not sure if it was due the bartender but very complex....",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k7VnECn4Dm_QWrWdz4kSnQ/o.jpg"
      }
    ],
    "user_id": "JgOcyMF1lTwSVCarSZrrrA"
  },
  "hbE76LdT37KZ9QLHWpcTTA": {
    "date": "8/10/2017",
    "text": "Excellent food, came fast and fresh, priced well, the only complaint was it was confusing walking in, it's apparently self-seating which wasn't clear,  and after we were done, it took a while for the check to come, but I would definitely go back. We got shrimp po boy & tilapia tacos...yum!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XkgJa-Si8PISROphVpkOMA"
  },
  "rcOTPyGbOAb_p0GL_YIuZA": {
    "date": "6/23/2017",
    "text": "Carnivores food is, in two words, not good. It's never terrible, but it's definitely below average. Service is slow, indifferent, and haughty. Their beer selection is excellent, and their prices aren't bad.   Food: below average to bad quality, average price  Drinks: good selection, average prices  Service: well below average.   Cannot understand why this place continues to attract patrons. Just tried their pizza tonight for the first time...pretty rough.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_O43DMVc0kTf56NglM-Rgw"
  },
  "O0vel5xhGidPrM9_4Eo-Ng": {
    "date": "7/26/2015",
    "text": "Sigh... it's hard to give Carnivore's only a 3-star rating because their food is tremendous, and it's a place I love going back to for this reason, but honestly I have become so jaded with the lackluster service here that I'm on the hunt for a new place close to my good friend's apartment in Oakmont. This is usually our hangout spot. What keeps us coming back is the great food and unparalleled beer/cider/spirits collection. What makes me want to bang my head off a wall is the service. Here is a typical rundown of my Carnivores experience the past FOUR times.   1. Walk in, ready for a night of experimenting with different beers and awesome food. Meander to whatever open table you can snag. Hope and PRAY an employee is watching you so they know to attend to your needs in a timely manner.  2. Have difficulty finding an employee to give you menus, because Carnivores employees wear normal clothing and nothing to distinguish themselves as staff. Wait anywhere from 2-15 minutes for menus. No matter what day I've been in on, waitstaff is also stretched thin, working behind the bar, too.  3. Get menus and wait another 10-15 minutes to order. Hope that between your waiter/waitress running other food, going behind the bar, and fetching drinks from the coolers that they'll remember to bring your silverware.  My last visit forced me to employ especially ridiculous tactics just to flag an employee down. He didn't tell us his name the whole night. He assumed from overhearing my friend and I that we wanted a certain appetizer, so he placed the order for it, and brought us the wrong food. It took 15 minutes for that to be remade and corrected. Plates and silverware only showed up after we had already eaten our appetizer with our hands. The waiter forgot to put our entree orders in, too, and didn't realize this after 30 minutes. He'd whiz past us every time we'd try to get his attention.   All in all it probably took us over an hour and a half to eat our food. It was really a nightmare, and while I understand, having worked in restaurants myself, the ability to give staff the benefit of the doubt time after time is withering more and more. I truly think for Carnivores to keep their restaurant up to speed on the service end, it would require a full overhaul of the general flow through the place, and staff retraining. At the very LEAST make them wear matching shirts so customers know who to flag down...  Carnivores, I want to love you so much. Your atmosphere is a blast. Your selection of drinks is unrivaled. Your food is awesome - big portions, always fresh - but every time I leave I walk out full, but frustrated.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "nr7VDQ9JNZegrLMtLCFfBQ"
  },
  "Z3oDZyR_9yuSQ3G3XNG9FQ": {
    "date": "2/27/2016",
    "text": "Food and atmosphere are good. We had a party of 6. The drinks came out at different times, so did the food. On average 15-20 mins apart. This made for a very awkward and unusual dining experience.   Good beer selection -10/10  Food was delicious 8.9/10  Service 1/10",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "su2xdETVG8yC27ALXFz6pQ"
  },
  "Nswb_n3oNWl1Lh-vEjUdjA": {
    "date": "9/16/2016",
    "text": "Took my mom here after golf. Wings were undercooked, which is disappointing since they are easy to make.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "y9vhhQw-UmMcS1y4r2aYTg"
  },
  "0Xrmb2yZCvhiTXFQvmUWJg": {
    "date": "3/4/2017",
    "text": "By brother recommended this place and I'm happy he did.  The wings were awesome, especially the General Tso flavor.  The prime rib sandwich and cheese steak are out of this world.  Great casual atmosphere and friendly wait staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wShbnvmF9-J7RrGECDNwfQ"
  },
  "mWTzZocVo3A3H0OT3GGJ5w": {
    "date": "10/15/2014",
    "text": "First visit to Carnivores. A friend is moving this way so a group of us met for drinks/food.  Top points:  Beer. Great draft selection and bottle selection. Fair prices.  Bar. Large bar area...plenty of seats.  Service. Our waitress was excellent.   Mediocre points: Atmosphere. Very large open area which makes it pretty loud and not the cozy feel I expect with a bar/restaurant drawing craft beer enthusiasts. It's seems a bit like a chain sports bar.  Food. Eh. Not bad, but not great. I had the shrimp/lobster roll which was basically steamed shrimp and lobster on a bun. Tried the onion rings...greasy. Maybe I should have tried something like a burger or different sandwich. What I saw for the others was not terribly impressive.   Looking for a way to try a lot of different beer? Go here. Looking for great bar food? Maybe have a few drinks and move somewhere else for a good burger.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "UBUV0ElEvm8kgxZvcdDo2Q"
  },
  "q4FBEDw49jW62N7NhAXoEg": {
    "date": "1/29/2015",
    "text": "Come here usually once  a week and I love it.  Have been here for lunch and dinner and just to drink.  It gets packed, but never so bad that you have to wait too long for a drink.    Has good bar food and an amazing selection of beer on tap and bottles.  Servers and bartenders are great.  Always friendly and always attentive.  Their prices are good and it's a fun place to go for a casual dinner and drinks.  I would say their sandwiches are probably the best thing on their menu.  It gets loud so I wouldn't recommend it for a first date, but definitely somewhere laid back and local.  Try it! and try the Chocolate blockhouse ale. YUM",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NIJWrUAz7-9IEqwZnGBT9g"
  },
  "ojHKrUJJ2frIaFUTMGVdDA": {
    "date": "7/3/2016",
    "text": "Next time you want an appetizer for 10, order the Tot-chos.  You've been warned.  As Trump would say, \"It's huge.\"  Then again, you could say that about most of their food -- they don't skimp.  The menu is vast and varied, so when in doubt go for favorites such as Shrimp Like Wings, The Jimbo, or any variety of pizza.  Oh yeah, free popcorn is available if that's your thang.  If you can't find a beer you want on tap, there's a good selection of bottles + cans in self-serve coolers with different drink specials most days.  With their collection of well-placed HDTVs, be ready for a sports hungry crowd, even if there are no other events on TV except CFL game.  Huh?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YhkTKKMo9UQmdcxx_umxPA"
  },
  "km1BUiInlxXL5i3A89UOwQ": {
    "date": "8/22/2017",
    "text": "Went there before a movie at the oaks. Horrible food sub par service. The bartenders def cater to men more than women. Thankfully we were acknowledged because I was with my boyfriend. Not going back. Not even a hi thank you or goodbye from the numerous bartenders there. I ordered the ravioli and it came out dry and crusty asked for no onions on my salad the whole salad tasted like onions. The bartender didn't even know what beers they had in the cooler. We were ignored after we got our nasty food until finally we wanted our check and flagged a bartender down.. she was nice but again not even a thank you when we paid tipped and left. You need to train the employees on customer service and fire the chef!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oze8o8nJc-JgYRNBe8XOww"
  },
  "IlDdAzIH9RE-zLYf9GpkHg": {
    "date": "2/1/2016",
    "text": "Sitting here, currently going on a 45 min wait for a chicken sandwich. My fiance got his burger a half hour ago, which was greasy and covered in disgusting nacho cheese. I'll be happy if I never have to come here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "d_FloL0KhUcgsqsJnwp0fw"
  },
  "ReSlklff4_yxbtBnbbYl1g": {
    "date": "8/6/2014",
    "text": "Great beer selection! Wait staff is awesome!  And the food is good too! Great for a sporting event or just hanging out one night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6uHosKqWvYtWuP724Hmm-w",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. Amazing beer selection!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6uHosKqWvYtWuP724Hmm-w/o.jpg"
      }
    ],
    "user_id": "rLJa37pw9tqfzXcwxuTGrg"
  },
  "y3CW2Tbe_yWaBgWg3GW4Mg": {
    "date": "12/28/2011",
    "text": "From what I understand, this place looks much better now than it once did but I never had the opportunity to see what it was like before to compare.  But I have to say, I was not disappointed at all with how the place appeared.  Clean for a bar, and nice and roomy, good bar food.    The one complaint I have is the not so attentive wait staff and bartenders... they could use a lesson or two in customer service and work ethic (doing your job).  They seemed more concerned with chatting with one another than taking care of the patrons.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLVq7VSJBHZwqurwWoCmpg"
  },
  "R2vtE35Aa8UvoALG00fNpQ": {
    "date": "8/6/2016",
    "text": "I used to love this place but the carni square pizza is ALWAYS BURNT. I think I'm done ordering from there we usually get take out Pizza because there isn't a decent pizza place in Oakmont or Verona. One time it was so burnt I had to call them to bring me a new pizza which they did. The staff is very nice and I appreciated them replacing the pizza and quickly. My husband and kids go in to eat the wings with are ok. I wish I could give a better review but they are out of chances with me and it seems like they changed their pizza sauce.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KIQHtJwTwfZfe75U5GuM8Q"
  },
  "vNUWB62Xn5QSfAraArGitQ": {
    "date": "7/31/2016",
    "text": "Food is good and they have a huge selection of beer. Their service is pretty bad. All the waitresses are bitchy and don't attend to you if you're not a man. It's a typical bar. The beer selection is the only thing that gives them an advantage.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fBZmEe_OkLwK3RCnYwFVzw"
  },
  "jroroHYi54UZihk2Kga2Mw": {
    "date": "10/6/2015",
    "text": "Huge beer selection (with on tap and build your own 6-pack options), above average bar food, TVs at the booths for the kiddos, open air seating in the warm months, fast service and delivery, and extremely reasonable prices makes Carnivore's a great stop in Oakmont.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YNkbvkPhLMFlOFYH2PLMwA"
  },
  "CY2LPuxq8i6HEhhu1iFSXA": {
    "date": "6/12/2017",
    "text": "Decided to try this place out since we didn't know what we wanted and drive by it all the time. It was awesome! Seat yourself, plenty of seating and bar room. The bar is actually huge. The place itself is really big, although it doesn't look large from the outside as it's in a plaza set up. There's TONS of different craft beer in coolers surrounding the inside, and also a nice indoor/outdoor seating patio. The menu was huge and everything sounded delicious. Our server was pleasant, although we had to flag him down to place our order and for our check/boxes. We started it out with an appetizer of tot-chos (tater tots topped with salsa, nacho cheese, your choice of chicken or ground beef, jalapenos AND shredded cheese) and let me tell you, it was HUGE. I mean, so big we took a bite of our main meals and needed boxes. For $8.50, it was an awesome deal!!! We still took some home!! For my main meal I got a triple decker Reuben and it was great. It was the perfect balance of saurkraut, thousand island and corned beef plus the toasted marbled rye was nice. My boyfriend got a chorizo philly, which was good but a little disappointing that for 10 bucks, you don't get a side of fries. It just looks a little plain to have JUST the sandwich on a plate meant for a whole meal. He asked for an egg on it and the server wrote it down, but the cooks forgot. We were so full it didn't even matter and just asked we didn't get charged for the egg, and the server was very nice and even asked if we were sure we didn't want them to put an egg on it for us. Over all, we will definitely be back, especially for more of the tot-chos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5FgRawXskU4JtqpkBShjMg"
  },
  "4Iti1W_y_rsJV-go9pP-kA": {
    "date": "11/15/2014",
    "text": "Always great sandwich's and pizza, fantastic homemade potato chips. Want beer ton's of beer on tap, and hundreds of types in bottles to choose from.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8vEHweAj3o2Rv_iUMr6BEQ"
  },
  "Yj4m1j8Ih3XkZYCsbybqGw": {
    "date": "10/31/2018",
    "text": "Decided to try Carnivores for an after work meeting with out of town colleagues. There was a nice mixed crowd with ages ranging from 30-60. Lots of TVs with differing screen quality. The beer options are excellent and the menu is close to bar food nirvana. The restroom was clean and well lit. I wish I had this bar in my neighborhood.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xtumDNOhSP5yqhvMFj9yFw"
  },
  "5BeT9v7d_C_ZKuXuI1-c7g": {
    "date": "2/27/2018",
    "text": "This is a good spot that I often stop at with family when I'm visiting Pittsburgh. Pretty tasty, typical bar food, generally good service, lots of craft beer- all in all a win!  -Atmosphere is cool. It's a great sports bar with TV's even in some of the booths. There is a good amount of seating and I've never had to wait long here for a seat.   -Love the selection of craft beer, both draft and bottle! They even have a pick-a-six option to take home, but if there's a beer in the fridge that you want right now, you can take it to your table, too.   -I've had good salads and good burgers here. I like the fresh cut fries, too- can never go wrong with ordering them!  All in all, a great little bar to go to right outside of Pittsburgh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "76Hvgeppcr_1hDv4KIB1cw"
  },
  "ArAmJ93u5D4_Ku0p3s9TnA": {
    "date": "3/11/2019",
    "text": "Food is good enough that if you can't get in anywhere else, you will be satisfied. Typical bar food. Nothing that catches the eye as different or \"foodie\". If you are not adventurous, this place is for you. Extremely loud, forget having any conversation especially if it's a \"sports\" night. Great selection of beer though, can't complain. Many selections on draft as well as bottled/canned. Parking can be a drag. Servers are meh at best. Not well organized and a bit slow.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pREzxr2pB1_0rfYj27nNJg"
  },
  "GTAiQgkCAl4SrUEwY13LSw": {
    "date": "9/16/2018",
    "text": "I was visiting from out of town and I met up with a few friends. Poor service by the waitress. Waited a long time for drink order to be taken. Drink was emptied and since waitress was not around there were no refills. The sound system for the football game seemed to fade in and out. Spoke to a Sr. Staff member who said the owner managed several area locations. Some people work harder than others. I will not return to this location. I will not recommend to others. Thank you.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "QbiMD-w8ZXJDGp7kmGf43w"
  },
  "xwwuwMqLpgS8I1nvihGxUg": {
    "date": "9/9/2018",
    "text": "Menu has a lot to choose from and is always delicious. I love the Pittsburgh salad and they have the best ranch dressing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u_EtNBi4kUrLeFfOMzL15g"
  },
  "UctKmp5wSt6DAizyOhzt4g": {
    "date": "1/19/2018",
    "text": "This places was SO GOOD! With a very large menu, it was hard for me and my friends to decide on what to get! First we started with some apps...we had the pepperjack mac and cheese nuggets, which had the perfect amount of bite, classic busters fries, which was topped with cheese sauce, bacon, and ranch dressing, and the roni roll, which is their pepperoni rolls! Next, my two friends and I ordered wedgies. You can order half a wedgie, which would have been plenty but I ordered a whole so I could pack leftovers for my lunch the next day. All three of us ordered the buffalo chicken one. However, there was a miscommunication somewhere along the line and my friend was served an Italian one. She still ate it, even though they had offered to remake it for her. She said it was good, just not what she wanted. For that, I'm giving 4 stars. My other friend ordered the Philly cheese steak, which he enjoyed too! And that was also large enough for him to take home leftovers. Two of my friends also had beers that they could select from the many coolers that they had on the walls. Overall, it was a cool restaurant with a very appetizing menu and I would definitely go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nx3Y_sXwqrSfwWS8LsNiRg"
  },
  "UnmhnyCZ9rqs_cGUhnGNoQ": {
    "date": "2/26/2017",
    "text": "Well I requested we come here...ordered a salad and wings. We asked for a bowl of soup to share before the meal came and it never came till after our meal was ready to be delivered...so I asked that we not get the soup...our waitress w ER checked back with is unless we asked for her to open our beverages since we didn't have a bottle opener...I'm generally not very critical working with the public myself but to not check on your customer and apologize for a screw up? Food was decent service very sad ...beer selection is great.. if you are stopping for a six pack no worries...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "X-FAR_YBwzjWsPg5wX56wA"
  },
  "Ezz38MKnNSNLvWEwFd45KA": {
    "date": "10/5/2016",
    "text": "When i lived in Oakmont, I frequented Carnivores a lot.  Walking distance, great beer, good bar food.  Now that I moved away, every once in a while I head there and want it to be amazing, like visiting my old college bar.  and it does just that for me.   The menu is pretty diverse with pasta dishes, pizzas, wraps, sandwiches, hot dogs and for some reason, a crazy amount of fry options.  ***Burgers come with shoe string fries.  Change it to the hand cut fries.  The shoe string fries remind me of the pool snack bar.  The food is consistently good.  It's higher end bar food and good higher end bar food, at that.  They don't try to be fancy, just keep doing what they do.   A good burger, a nice sandwich, the usual descriptors for bar style food.  The service is a little bit iffy.  Sometimes awesome, sometimes less-than-awesome.  If its busy drinks usually take a little time, but the big timing issue is if I grab a beer out of the cooler, it usually takes a few minutes to have it opened, as it sits on your table taunting you.    Overall, I wil overlook the iffy service for the stellar bar menu.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "RFXdqe9P56RI1vW3BhHn6g"
  },
  "CEh1L7A1JOLOG5YQub76_Q": {
    "date": "4/28/2018",
    "text": "Very good food, excellent beer selection, piss poor service.  The good food and beer selection was enough to get us to come back several times.  The poor service on a regular basis has now convinced us to stay away.  Sitting at the bar with an empty glass while several bartenders huddle around giggling is the norm at this place.  There are too many other places that are more than happy to pour us a $6 draft!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nkJ5FvRVGHWjZHXU9Zw78w"
  },
  "iBzaijV69mG3SXD0wVvatQ": {
    "date": "1/29/2018",
    "text": "Yesterday I had one of their shaved filet Philly Cheese Steak Hoagies with sauteed mushrooms, onions, green peppers and provolone cheese on a Mancini's bun. It is the Best I have ever eaten. All contents complimented each other to make one dynamite sandwich. I also got an order of the fresh cut fries - so good! Order in or take out. Yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q2du8OM2CksT7LV2oFf7PA"
  },
  "NqEYUJm7D498KHSDAKoliQ": {
    "date": "1/15/2017",
    "text": "This place is a must go. The food is good. The atmosphere is casual, not too loud, and a great for families or small groups. The music was good, and there was a nice amount of TVs. It was clean and the bathrooms were clean and Kid friendly. The only thing I never look forward to when coming here is the parking. Close parking is hard to find. You may have to park across the street.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LIYaBrnlu7otVzaEDX5Xbg",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. This soup was very good. I believe it was called Crab Bisque. It was the unlabeled soup of the day.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LIYaBrnlu7otVzaEDX5Xbg/o.jpg"
      },
      {
        "img_id": "Fe982JfWNWXSjRLT5b7Awg",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Fe982JfWNWXSjRLT5b7Awg/o.jpg"
      },
      {
        "img_id": "XjuETYLrGf4Qaqf32p7shA",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. 1/3 of a turkey wedge.  It was huge and less than $10",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XjuETYLrGf4Qaqf32p7shA/o.jpg"
      }
    ],
    "user_id": "jen0KskW0qmZ1jvjbZiVyQ"
  },
  "Ahg9OOBazvaDh-iW0vcq1Q": {
    "date": "6/24/2018",
    "text": "Stemmed like a typical Bar with too many Beers available, but did have my lame Beer if choice Coors Light.  Had the Steak & Cheese Hogie which was very, very good.  Came with some great fries.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zcGDc79klSudHiVsecU-6A"
  },
  "oT9S0W7FHyP5VWpk2uOD6w": {
    "date": "10/21/2015",
    "text": "Carnivores is one of the two best bars in Oakmont.  Thy have an awesome beer selection and always have all the beer selections of one (usually very good) brewery on sale for $3.    They have the league passes for all 4 sports and I imagine can get most European soccer league games as well.  The bartenders and wait staff are attentive and usually pretty friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WPpDdRQ_ADY5I6Af2GbC0w",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. Cool, nicer sports bar in Oakmont a few blocks from the oak theater and Oakmont tavern.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WPpDdRQ_ADY5I6Af2GbC0w/o.jpg"
      }
    ],
    "user_id": "rp007n5XVLGJwIOTh9U0-g"
  },
  "5JiwFKvJFeyquuZYRY--mA": {
    "date": "6/7/2017",
    "text": "J and I stopped here for a quick bite. We have heard good things about this place and figured we would check it out. Parking was decent as it's nestled in a little strip mall and the venue is pretty large. Larger than most sports bars we have been to. They also had roughly 20 large tvs and each booth had their own personal tv which was really nice. The menu is pretty large with lots of different options for a meal, from sandwiches to pizzas, tacos and hot dogs. Another plus is the bathrooms were large and clean for the most part, decorated very modern in comparison to the dining area, and had a tv. The only con about the ladies bathroom was there were piles of dust bunnies on the light fixtures and vents which was pretty disgusting. J ordered an iced tea and I had a lemonade. Both weren't terrible, just really strong. We each ordered the small pretzel bites to start. We got a large amount, close to 15, and they were overcooked. The cheese sauce was made with beer and therefore runnier than we would have liked. J ordered a cheesesteak hoagie and I had a buffalo chicken wedgie. Both were not that great. Way too cheesy. With my wedgie, I was overpowered by the blue cheese that I couldn't taste anything else, and it was pretty sloppily made. I will say that you get very large portions of food which is nice, however the actual flavors are less than optimal. We actually expected a lot based on the area, and the amount of seating, and we were pretty disappointed. Oh, and our bill came to around $44, which J was NOT happy about considering the quality of things. Needless to say we will not be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m3Xl2KH4GbfCZON_pYI73Q",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. J&amp;#39;s plain cheesesteak hoagie. He didn&amp;#39;t get any veggies with his.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m3Xl2KH4GbfCZON_pYI73Q/o.jpg"
      },
      {
        "img_id": "P5-ars_OzSbNnxy5h4tbsA",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. Buffalo chicken wedgie with bleu cheese crumbles, lettuce, and tomato (I asked for no onions)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P5-ars_OzSbNnxy5h4tbsA/o.jpg"
      },
      {
        "img_id": "Nw2VFuKUPANUumuZpOYLFg",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. Our overcooked pretzel bites with runny cheese sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Nw2VFuKUPANUumuZpOYLFg/o.jpg"
      }
    ],
    "user_id": "BfX5cChtKJZMhWHLB1K1eg"
  },
  "ZxXMdNxO7JhOrxP-F73kyg": {
    "date": "4/23/2018",
    "text": "One of the best cheese steak hoagies! My co-workers decided to order from here. Glad I decided to order with them. I usually don't, but when I do I always get a cheese steak... one of the best, if not the best that I've had yet!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "moCkoh6I0OQfssI222QIvA"
  },
  "OYfZ0Al_ok_Nt4XCuH6fMQ": {
    "date": "4/26/2015",
    "text": "One of our favorite sports bars. It doesn't look like much from the outside and could be easy to miss since it is in a strip mall but it is well worth the visit.   The beer selection is amazing! Not only do they have 30 beers on tap but they also have coolers of bottles and cans. The best part is their daily specials. You can't beat Thursday nights when most of the bottles or cans are $3 each. When the specials are limited to a specific brewery, you can count on still having great options!   We also love their food. The gourmet hot dogs are excellent. I'm addicted to the hound dog and California dog. They are filling even without a side of fries. My husband and I are also big fans of the chicken Parmesan sandwich; The bread really makes the sandwich.   I recommend starting with an order of pepperjack cheese balls. Can't go wrong!   A great spot for watching a game. The place is filled with tvs and the booths have individually controlled tvs. The staff are extremely friendly and more than willing to change a TV if need be.   I highly recommend checking this place out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SKre6GKJAA3FLgb2e875Rg"
  },
  "yQR10okcClLVzgdqxsoCmQ": {
    "date": "3/3/2016",
    "text": "The wait times on food can be staggering and when they get \"too busy\" they just take the phone off the hook. It seriously seems like every time we order from there something in our order is wrong. My company orders from there at let a few times a week and they always do fairly well but the repeat issues case me to take away a star and the prices are somewhat high mix that with the phone off the hook I took away another star. Nice place to hang out and watch the game as long as you don't mind the cost of food and drinks!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XTHDS_FJMACc4X-PK9WjkQ"
  },
  "Kyeal3aio-FmTtMVhbfWIQ": {
    "date": "4/23/2016",
    "text": "So busy! There had to have been a few hundred people there (or at least it really seemed like it). The bartender who took my food order noticed me very quickly despite having such a packed bar. I ordered cheese fries to go, and my order was out in a timely manner. I had been here one time before with friends during a much slower week night. I ordered fries and a sandwich and was very surprised about how good the food is and how big their portions are! Prices are fitting to what you get. I love the food :) really good bar food. Definitely stop in!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xhmBgIT3xHgojioDq_c_fg"
  },
  "Yzm606c-Fi75CSSXpp2jKg": {
    "date": "1/9/2017",
    "text": "Sat at the bar for 15 minutes on a slow night while the waiters texted...then the one bartender came up and asked 1 person if they'd like a beer and walked away and bs'd with the wait staff...Alabama vs Clemson and it wasn't packed...hmmmm...foods half decent but the service sucks...d+...at my job I have to be as prompt as I can...I can't just stare at the phone when it rings and wait for it to go to voicemail...went to another restaurant and I'm getting served...fool me once",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SmkbMBZdA8YRHPw_Ts5KOg"
  },
  "_O4TzmAY46vtKcFfjOjLCA": {
    "date": "9/23/2017",
    "text": "Kumar, Kimi, Tucci, Cope, and Amber make this place the best bar I've ever been to. Food and drinks are always great. If you don't come here you're missing out. I wish I could give it six stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BZnT8-NhYfuBFpaJGvSFrQ"
  },
  "vTsQVuBeIwmQoWMsSjO4Fw": {
    "date": "9/7/2019",
    "text": "Carnivores is a decent sports bar in Oakmont. They have a large bar with plenty of seating and a few tables outside. Self-seating makes finding a place to sit much quicker. The dining room is clean and has multiple televisions on every wall. It's definitely a good place to catch a game. Despite being busy when we arrived, we still had quick service.   They offer pretty standard sports bar menu items; burgers, sandwiches, wings, pizza, and a select few seafood items. The Philly Cheese Steak hoagie was good, however, for the price, I wish it came with a small side. A \"side\" of the shoestring fries equaled a giant mountain of fries (no complaints) in which two-three people could easily share. The pepperjack cheeseballs are also a good choice from their list of appetizers. They have a decent beer selection, both local options and your standard domestics. Carnivores is s great option if you're looking for a place to catch a game without dealing with the downtown traffic!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q-ynnyOMEuCoXHOaR5lRDg",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. Chicken Mushroom Melt Sandwich with a side of shoestring fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/q-ynnyOMEuCoXHOaR5lRDg/o.jpg"
      }
    ],
    "user_id": "pkDk_kooopE11QxJQ5kN5w"
  },
  "oD992lYlvLvnY3fqNIQiCg": {
    "date": "7/2/2019",
    "text": "Carnivores strikes me as the kind of place where if you grew up in Oakmont, you'll always bump into someone you went to high school with here. That's probably just a longer way of saying it's a popular neighborhood favorite that's been around awhile. We attempted to go to the local Greek festival last weekend and decided we didn't want to wait in line over an hour for a gyro, so we walked over this way.  They've renovated in the last year so the dining area is pretty modern. Seating is self-service and we got in with no problems on a Friday night at dinner time. Our waitress was there when we needed her but it was probably made easier by the fact that you can help yourself to drinks from the cooler if you want anything canned or bottled. The selection is superb and cans were on special, so that's exactly what we did.   It's a regular sports bar with live music/trivia some nights. You know the type. The food is in line with that too. I ordered a burger and we shared some mozzarella sticks and \"shrimp like wings,\" i.e. just tossed in the house wing sauce. The one thing I noticed was that their barbeque sauce was more like a sweet and sour variety, at least to us. They could have called it something completely different and I wouldn't have thought twice about it. That's not a complaint, just something that oddly stood out. Even still, the food was fine.  I've got to admit, I probably would have started with a three star review as a baseline, but the beer cooler pushed it up one for me personally. They boast a selection of over 600 beers and are now even delivering (though nothing more than a 12 pack). Credit given where it's due. That brings them a notch above some of their peers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y-ffoQAiDQKMKCJ9q_7sGg"
  },
  "69BRARuK4BQTGfJOhwKjKg": {
    "date": "5/28/2019",
    "text": "We've ordered take out from here once, but when we got home the food was cold. So, we decided to give it another shot and dine in....and I'm so glad we did!  There was live music the night we went in and sat at the bar without waiting. The bartender helped us right away. It was nice to sit back and watch the lovely scene of the restaurant. Music wasn't too loud either! Along the back wall are many refrigerators stocked full with an assortment of beers. I can't wait to start trying them.  My chicken salad was great, especially because of the bacon bits. There were tortellini noodles in the salad too so it broke up the normal lettuce/chicken combo! The shoestring fries were great. Very thin and so easy to eat them by the handfuls.  Overall, you get a lot of food for you buck and it's delicious food too. Would recommend to anyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yUnZ3x6bGjOc7oYchRgv3Q",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. Grilled Chicken Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yUnZ3x6bGjOc7oYchRgv3Q/o.jpg"
      },
      {
        "img_id": "2OR-qwaEn1hf6C6mAvoYDw",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. Chicago Style Hot Dog with Chili Cheese and Shoestring Fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2OR-qwaEn1hf6C6mAvoYDw/o.jpg"
      }
    ],
    "user_id": "YujmPASZsHjVAtrYcmRm4w"
  },
  "z2KpxdXj9pXZTMuKyI8LHA": {
    "date": "5/19/2019",
    "text": "I thought this place was awesome. That being said, I was here for lunch today when it wasn't too crowded so I can imagine the service dipping a bit when it's busier. The restaurant space is not much to see from the outside but the inside is really cool, it's clear there must have been some recent renovations. They have some semi-outdoor seating as well. Our service was great. They have a big menu with a lot of variety, some healthy options as well. Prices are great. I had the \"The Tone\" which I turned into a wrap. It was excellent as were their fresh cut fries. I also loved their ranch dressing. We didn't drink but they clearly have a huge draft selection and lots of bottles available. Would definitely come back here, it's for sure worth checking out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GchWqKAxjqP3rkMcMpui0g",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. The Tone",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GchWqKAxjqP3rkMcMpui0g/o.jpg"
      }
    ],
    "user_id": "0KhRPd66BZGHCtsb9mGh_g"
  },
  "hYAwZbdWXmuSWUcGp3wb7w": {
    "date": "12/28/2018",
    "text": "Love the recent renovations and updates to the menu.  It is a great place to just hang out and enjoy one of their many beers on draft or bottles/cans.  The high top booths and tables provide a great atmosphere to just hang and watch the game.  Kick back with some wings and cheese balls.   Updates to the place included exposed brick, relocating coolers for their beers and white subway tile to accent some of the walls.  We had great service from the staff and management on our last visit.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "wFL_ALur5nfnG12QXAgSEQ"
  },
  "W7oR3dfrmuBjG_7dSnvaYw": {
    "date": "9/7/2019",
    "text": "Good hot dogs and fries, great sports bar.   Open air seating is available.  Smoke free?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5vJJ4vFvdbMY01MYrKL5MQ"
  },
  "v1psuxuSyB7i33sDgtCP2w": {
    "date": "5/14/2019",
    "text": "Carnivores has seriously lost its charm on me. All my friends come here \"too much\" so I'm dragged alongside. After the 3rd or 4th visit I started to realize how average this place actually is.   The main issues I have is with the food and the service. Your drink will be left empty more than it is full. You will be waiting on your server utterly too much. An the food is slightly under cooked. From what I tasted everything was just a tad higher than room temperature. Which is why I don't think this place is all the hype.   Then again, I do see the appeal. The place is neat and pretty. They offer more than the average in terms of the menu. An you get a bargain with your quantity.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PmGluGdkbD4-E--TYHJ3SQ"
  },
  "J4m07EHchqTXZn0eDL2Jow": {
    "date": "3/22/2019",
    "text": "Carnivores was once a place I frequented often living in Verona/Oakmont, and it was great. My last 5 or so experiences however have been terrible. Not sure if too much attention is put on Pub 333 and The Lot (all owned by the same owner as Carnivores), but whatever has changed here has not been for the better. Everything lacks flavor. The pizza my friend and I split tonight was honestly one of the worst, bland pizzas I've ever eaten. Wings were ok.. not great. Servers are nice, but be prepared to wait 20 minutes before you see one.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PRR_QZhRCkxa-hb-fmnA9Q"
  },
  "p8f6XPqmyk_Pd6EpcoMOsQ": {
    "date": "4/15/2019",
    "text": "Ok so we rolled into town to visit my buddies parents, and drink sk e beer and not go to jail, like he did 57 X's before he moved to Houston. So being v fro.  EW Orleans, living in the 4th largest city in America, I am a bar snob, no if and\" or buts about it. Flash forward to the corner of the bar, boom beer selection off the hook, almost comparable to Cooter Browns in NOLA. Beer selection is on point, something for everyone. Bartenders, freaking awesome, at least the ladies, treated me like I have been coming here for years, and they wear yogis pants, shwing... so bartenders check. Food I have no idea, but it smells great, I at Jamison... Thumbs up, on this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xDB-XaMg1kPiNle2XkyewA"
  },
  "28UIuZwml7PfFEVRO19kWQ": {
    "date": "2/11/2019",
    "text": "The last time I was here it took an hour to be seated, as it is a seat-yourself restaurant and people kept \"cutting\" in front of us. It was a busy Friday night but the server took at least 15 minutes to take our drink orders.   I tried to order delivery here a few days ago, because I love their garlic Parmesan boneless wings and the southwest chicken egg rolls. I was told both items have been removed from the menu (since I was there 3 weeks ago) so I did not complete my order. Really disappointed!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2j8PKFqD4NQs37VSy7DhTg"
  },
  "MYoDIULVdSWPkqjGhRPN6g": {
    "date": "6/21/2018",
    "text": "I can't say I was very impressed with our stop here on a Friday evening.  The place was busy enough, leaving a few open seats at the bar but none together.  We decided to grab a high table near the bar.  It took a while for the waitress to make her way to us.  I asked if the draft list was up-to-date.  I was informed that it was not.  I then ordered another IPA than the one I wanted since I was told that one was out.  While waiting for our drinks I decided to browse their bottle coolers.  I will say they have a lot of beer, but I am not sure how well it is rotated.  I saw Oktoberfest's and Christmas beers.  It was the second week in June.  I didn't find anything that I would have rather chosen over a draft beer which is always my first choice when visiting a bar such as this that hosts several crafts on draft.  Several is an exaggeration (at least on this night) and as I continued to look over the bottles my husband comes up and says they are out of the beer you ordered.  So I return to my seat and go back to looking over the out-of-date list for yet another option.  Thinking she would be back right away to get my order she did not return until 5 minutes or so later.  I was annoyed to say the least.  She made a suggestion and I just went with it.  I can't recall what it was, as I was less than enthralled by it.    I decided to continue to look in their coolers as they are stationed all around the place, and honestly not stationed in very convenient or safe spots.  On at least two occasions, servers nearly ran into me as the turned the corner coming out from the bar.  These locations are hazards.  The one guy swore as he almost crashed into me with plates full of food.  Perhaps moving these coolers is a good idea???  I finally did find one intriguing beer a N.E. Style IPA, from ATWATERS brewery.  Unfortunately for me it wasn't one of the better N.E.  beers that I've had, so I was back to the drawing board for a different selection.  Our waitress was busy running around so another waitress stopped over to help us, which I appreciated.  I said how I was having a hard time since they seemed to be out of a lot.  She made a recommendation only to tell me after that that too was kicked.   Funny all these taps are kicked but no one is replacing them??  Now the only IPA beers left had an ABV of 9.9 and higher.  I really didn't want something that heavy but I was so tired of the hunt, just beer me already.  It was a beer brewed at Otto's in State College, a place I have visited with clients for lunch and always wanted to try their beer but never could so I was happy they did have it though as stated it was heavier than I would have liked.  The flavor was good though and we decided to call it after that.  I don't know if I would ever make it a point to stop back here.  Seems like a lot of hype over their beer selection when they have 5 or so beers on tap that are kicked, but if we found ourselves back in Oakmont I may give it another go to see if that was just a bad night.",
    "rating": 3,
    "rated": {
      "funny": 19,
      "useful": 31,
      "cool": 30
    },
    "photos": [],
    "user_id": "_5fx5gexi9OeZIuukV2gHQ"
  },
  "TWmR7Ws4bpOtZCDyade2TA": {
    "date": "5/19/2019",
    "text": "I'll get right to the point. service. the only reason for the 2 Stars. the food is average with a few different choices than most bar and grill restaurants in the area. upon walking in, I didn't notice any signs indicating 'seat yourself' so I stood there waiting for a hostess. 2 minutes of standing in the doorway, a female bartender said \"you can seat yourselves\". Cool. nice vibe in the place, plenty of beer choices are visible and the place was 40% full. after we got to our both it seems as though this place was a mirage. service was close to non existent and not friendly AT ALL. we sat in the booth for close to 10 minutes before we were recognized by a waitress that had no interest in making or visit memorable. never got her name or I'd blow her up (working at 4pm on a Sunday) and make sure she was recognized for being lazy. everything was half ass with her and it makes me feel like it's a theme in this place. I stood at the bar to ask for my silver ware sets, because they were forgotten, and wasn't recognize by 2 bartenders that looked me in the eye and kept it moving. it added to the frustration off a place that looked like it had potential. No follow up from our waiter, about the food, water needed, beer needed.... not a word. I'm not over exaggerating, I've worked in such businesses and have been to many restaurants that were at capacity and received better service. SERVICE IS KEY and who ever the manager/owner is they need to take a good look at your employees.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Xmw_WcUCShPD0qGO1UD7w"
  },
  "7qWmKRdsWGbNfI26MPYxwQ": {
    "date": "1/12/2019",
    "text": "The food (buffalo shrimp, and waffle fries with with philly cheese steak on top) tasted pretty good but the plates were so large that the food got cold quickly which was a major bummer. Baskets aren't as fancy looking but they would get the job done.  The number of available beers was also impressive, but that had very few that I actually wanted to drink which is highly unusual.  All in all, a meh experience that I wouldn't go out of my way for. On the other hand, a nearby table had a steaming hot pizza that looked delicious so if I ended up there again that's what I would try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XVnSPTxoXD408yrGWPwBgA"
  },
  "9pOfeN9CN8znIDRsrKEgdA": {
    "date": "3/9/2019",
    "text": "We are here now...terrible service...our waitress stands around, talks to all the other workers and is just bad at her job...had her before...just bad...it's why we don't come here much anymore...the food is usually good though...",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AXxm-lhMV46XX9A714aoFw"
  },
  "r1ctPnyZy4nX1K8qKPF-lg": {
    "date": "4/20/2018",
    "text": "Classic pub style food.   I love their tator tots,  but I find most of the food to be a little greasy.  But let's be honest... you kind of expect that with pub food, right?   It can very crowded and because it's seat-yourself I often find myself getting lost in the crowd for a while before the staff notices me.   It's a good option if you specifically want that style of food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gfpQPBZGwn7KUedz6B9B2A"
  },
  "IfazXtLuTnC7__GkJGuBRA": {
    "date": "2/26/2019",
    "text": "Always recommended but the menu change was so disappointing. It was almost that they knew what we ordered and removed it (pastrami sandwich, boneless wings, hot bbq wings, waffle fries....all gone!). I asked and get that they wanted to streamline the menu, but we felt we always ordered basic bar items. Unfortunately they don't have a specialty draw anymore to pull us away from closer...and more affordable...options. So sad and hope they bring the old menu items back!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4yDIqEZn2mK_Zp0_Acn1Kw"
  },
  "CmkMm0XPr7aogZYEg9zfIQ": {
    "date": "8/14/2018",
    "text": "The buffalo chicken wedgie was underwhelming which is what I ordered last time. The first time I went the buffalo shrimp P.O. boy was much better. Good atmosphere and good service. Overall decent restaurant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9lDqS5-_vZYbZEzNYtvemw"
  },
  "VtbapoTJjHihJB40y7yUbA": {
    "date": "12/29/2017",
    "text": "First off, I need to be totally transparent here - my True venture to Oakmont was to visit the bakery. However, I needed to grab lunch somewhere, and stumbled across this place. Anyplace with a name like \"Carnivores\" has me sold. I'm the opposite of a vegetarian, so I'm all in!  I walked in. Nothing overwhelming or shiny. Your standard, run-of-the-mill sports bar scene. No one greets you at the door. Appears to be a seat-yourself kinda place. It was about 1:30 p.m., so I missed the lunch crowd (I think).  Since I was alone, I grabbed a seat at the bar. Just a diet soda for me. Immediate service at the bar.  Lots of offerings on what seemed to be a small menu. I wasn't sure what direction to go, so I asked the bartender. He points me towards a few specials and tells me \"the burgers are good\".  He doesn't sell me on anything particular. I go with the \"Slam Burger\" with pepperjack cheese since it's highlighted as a special on the menu.  The burger comes with shoestring fries.  I wait for my burger. My surroundings tell me a few things. This place would be great to come watch your favorite sporting event. TVs everywhere. Also... this place flaunts its beer and alcohol selection well. You can see the offerings everywhere.  My food arrives. There's that saying that you eat with your eyes first. My eyes were underwelmed. Nothing colorful or fancy about the plate. The burger was meat and cheese on a bun. No sauces, no toppings. Perhaps that's my fault for not asking for them? Perhaps it's the bartender's fault for not asking if I wanted any toppings? Anyhow, I thought it was strange that this \"premium blend of double ground Angus chuck and short rib\" didn't come with anything other than the cheese.  The food was good. The fries reminded me of a better, more well-seasoned version of the shoestring fries you would get at Steak & Shake. The burger was good, too; but was screaming for lettuce, tomato, mayo, something.  I get the impression that this is a place the locals come to and like. I would return for sure, but do my research in advance.  The service was solid, food was OK, location was convenient. Parking appears to be relatively limited.   After my meal, I took the 5-minute walk to the Oakmont Bakery, then returned to get my car.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RRdb4THWxO8WMNvMAG6lNg",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. My fries and burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RRdb4THWxO8WMNvMAG6lNg/o.jpg"
      },
      {
        "img_id": "-P62nPrBCctKVd4oihd4BQ",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. You can see all the draft options",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-P62nPrBCctKVd4oihd4BQ/o.jpg"
      },
      {
        "img_id": "IrFAM6A5t9Q2RBZcTQBFZg",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. Beer list on 12/29/17",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IrFAM6A5t9Q2RBZcTQBFZg/o.jpg"
      }
    ],
    "user_id": "ggG8YTW5ju4JqlXFLZNo8A"
  },
  "AK0RngKgKKxANssbmn-3qw": {
    "date": "3/18/2019",
    "text": "Stopped in for lunch today. Ordered a burger and a fried chicken salad both specified well done. Half through the salad I noticed the chicken was completely RAW! We asked for a manager, no body came, we asked again and the young girl said there wasn't a manager there at the time. Service was less than stellar starting off with our dirty plastic cup of water. I do not recommend at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cOejLAT1OSpgBhctHMsauQ"
  },
  "mGp2iOAF8kkEKUThEjSM3Q": {
    "date": "6/3/2016",
    "text": "Carnivores appears to have found the secret sauce for restaurant success, because on two random evenings when I've been here (a Wednesday and a Sunday), it was bananas crowded both times. The ambiance isn't particularly inviting...it's large, open, and spacious, but a little sterile and cafeteria-like. It's seat yourself, which is annoying since it was super crowded...so may the odds be ever in your favor for finding a table.  On the first occasion we went, the service was okay, but nothing remarkable. On our second visit, service was downright abysmal. It took forever for a waitress to bring us drinks and take our order, and we waited over an hour for our food.   Speaking of the food, it's solid. It's bar food that's done well. The menu is expansive and there's something on there that will suit most tastes. I'm a fan of their boneless wings, the fresh cut fries, the southwest egg rolls, and don't even get me started on the tachos (whoever first thought to combine tater tots and nachos deserves some kind of Nobel prize). So yeah, the food is definitely tasty....but tasty enough to deal with the hassle of hunting for my own table in an uber-crowded space and then deal with poor service once I find one? Ehhhh, not sure about that. 3 stars for you, Carnivores.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "E3zOijz_8gWIzbXFNvNFCg",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. Chicken nachos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E3zOijz_8gWIzbXFNvNFCg/o.jpg"
      },
      {
        "img_id": "GlMZEeIrSpHADBQneztoqw",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. Italian stallion hoagie",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GlMZEeIrSpHADBQneztoqw/o.jpg"
      },
      {
        "img_id": "NTkmgLEi4hlJ2a7ybrsmRw",
        "caption": "Photo of Carnivores Restaurant &amp; Sports Bar - Oakmont, PA, United States. Fresh cut fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NTkmgLEi4hlJ2a7ybrsmRw/o.jpg"
      }
    ],
    "user_id": "0EhPIlDozxGKpbbHRr6vZg"
  }
}