{
  "JOCdPyxGqedAp3_cxISBIQ": {
    "date": "3/2/2015",
    "text": "Solid sandwiches. The matzo ball soup is fantastic! I've had the salmon sandwich on pits and the eggplant on pita- both very good. Byo - no corkerage fee!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FzojxZ0mmCuiJs4fecpimQ"
  },
  "NW5buHRTHAhXnaJyULOOdQ": {
    "date": "12/21/2014",
    "text": "Had the Knishwich & Matzo Ball soup. Thoroughly enjoyed them both! This place is definitely on my Pittsburgh brunch list.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2GqP5IOXhNOB4jBq_2i-jg"
  },
  "wlTRzOvUsXbQLcdTnkQBhg": {
    "date": "11/29/2014",
    "text": "Great service! No wait, actually owned by Pamela's! The food was great-- maybe even better than next door! All sorts of Yiddish references and fun Jewish foods that are hard to find elsewhere. Love the challah French toast. Highly recommended!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NklBrXXxMRr4CALiBCJ_Hg"
  },
  "uBz2h-w0Z5zgjwLaSkpjpA": {
    "date": "10/1/2016",
    "text": "I was there for lunch today.  The new buffet table was wonderful.  I had Chopped Liver that was soooo good, it reminded me of my mother's chopped liver (may she rest in peace)!  There has been plenty of chopped liver that has passed through these lips and none nearly as good and tasty as what I had today.   Also, there were so many other delicious items on the table, I barely made room for dessert.  The chocolate bubka was delicious.  By this point I was busting at the seams and couldn't finish everything on my plate.  I didn't want to leave.  Also, the price for the amount and quality of food was quite reasonable.  I will be returning, but my poor wasteline may never be the same ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fo5DOtW-FPBZEv8odnL8DQ"
  },
  "c1yJXSzbeHGMIJZlkZHlDw": {
    "date": "6/3/2014",
    "text": "I won't worry about \"authenticity\" here, because most of the things on the menu were things I had never heard of or eaten before. However, the waiter very nicely explained kreplach and kishka to us, as well as explaining the process behind the Montreal smoked meat. The main thing is that everything was absolutely delicious and reasonably priced.  We ended up ordering 3 things: the poutine, the Kreplach, and the 1/2 pound smoked meat sandwich on wheat. We are poutine aficionados, ok? And this poutine can easily stand next that of Point Brugges/Park Bruge. It was amazing.   The kreplach was great too, but obviously the real star was the sandwich. Really delicious and flavorful. In fact, there was so much food with just 3 dishes for the two of us that we couldn't finish the sandwich and had to take half of it home (while my wife made short work of the poutine). To top it off, it's a BYO, so our dinner was enjoyed with some beers from It's Doggin' It down the street. Total came to $32 with tip included for all of this. This is a much more reasonable price range than what Aji Picante was charging in this same space.  This is probably my favorite restaurant in Squirrel Hill now. We need to support this place and make sure places with interesting and delicious food stay in the neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "CTvu7jcAGT5bA5t-Yk4rGg"
  },
  "S1etqhxWA3E4xSQcg47f6Q": {
    "date": "6/22/2015",
    "text": "The meat is hella authentic, Jewish spices. Great options. Super relaxed laid back environment. Fast service. And hostess/server milissa is an amazing human being. Such a sweet, kind, friendly person!!! We had a great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rDGBLXboAu3DjCS4AmIK5Q"
  },
  "kQM98oC7obgYyoc8YQBxGA": {
    "date": "7/30/2016",
    "text": "Just finished eating for the first time at this restaurant.  Enjoyed the food immensely.  I have not eaten such delectable kreplach in decades!  Chewy dumplings with a delicious brisket filling!   The corn beef was authentic smoked meat.  Highly recommend the Russian rye bread.  This is high praise from one New Yorker who has has had her share of corn beef on rye.  Sad that I had to go all the way to Pittsburgh to find such a good deli.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ht-O58sdN451BOLyWmEdSQ"
  },
  "txEHrBbKryHUY8WGgObhSA": {
    "date": "1/1/2014",
    "text": "I would add that the restaurant does not offer the traditional delicatessen fare of potato and macaroni salad, another flaw.  The response from Pam C., below, demonstrates that she is an honorable and gracious business owner.  Indeed, the restaurant is not for me, but I will remember her generosity.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "j1jXmA4__4UWIplZk6MJMQ"
  },
  "PEBnCKVVEesP_auubpmiGA": {
    "date": "9/7/2014",
    "text": "I went here twice. The first time I had an egg lox muffin which I would have given 5 stars since it hit the spot. The next time I had scrambled egg with lox and I think it had cream cheese on it which I did not like very much. This however isn't a knock on them since I am merely not a cream cheese fan and did not account for it being included. The service was very friendly as my waitress engaged me in pleasant conversation. While my last meal was still tasty it did kind of sit in my stomach for sometime after. Again though I don't really fault the establishment as smoked salmon can have that effect on me. This place gets a strong 4-star rating from me. I can see myself enjoying this kind of meal more in colder weather perhaps.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Z3aJjyr8YD892R7jw_3Iw"
  },
  "HNV9_SEhR091OhlFmSJJmQ": {
    "date": "11/5/2013",
    "text": "Been looking forward to this place opening since they put up the awning 2 weeks ago. Had a tasty, tender brisket sandwich! Cured and smoked on premises. My wife had the T.O.M., a brisket with gravy on a challah with a wonderful Kishke!  Topped it off with their Grilled Babka with Salted Caramel Ice Cream. Lovely! We will definitely be back! (Suggestion: I would love them to serve some fires and knishes!)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jmplhoWKidbyzj8SML3FtA"
  },
  "UbLOFqxagWltRXta9RgCDg": {
    "date": "5/18/2014",
    "text": "A very pleasant surprise in terms of quality!! We went for dinner but would recommend it more for lunch based on the type of food they serve. But it was all delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DvX2Cb2yxVuOfpmLEXI_Uw"
  },
  "SEEF3kc-_aBY9K5EBhXQnw": {
    "date": "4/5/2016",
    "text": "Solidly good, especially the brunch menu. Do yourself a favor and order the babka. I don't know why people wait in line for sadness Pamela's when Nu is right next door.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Av1TszsxJHbLCU3DkTRmow"
  },
  "gN2CU3yE7F8FSLNOiqW1RQ": {
    "date": "8/20/2014",
    "text": "I was excited when I saw there was a new place that actually serves Jewish food in sq hill. I was really disappointed when I found out that most of the food isn't actually kosher. I don't really understand how you can call yourself a Jewish bistro if Jewish people cant actually eat most of what's on the menu.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oy_YCSCXJjzaMrkh-AdJKg"
  },
  "DcqaKS2fvB-hswrYEK4EKg": {
    "date": "12/2/2013",
    "text": "I came with a friend who referred this to me because it just opened a few weeks ago. It's a Jewish Restaraunt and it was my very first time eating Jewish food. The interior was very open and clean- the walls were decorated with pictures and descriptions of the Jewish food they served there which was very helpful for someone like me. In the back right corner was the open kitchen where we could see the chef prepare our food. Our waitress was very friendly and forth coming as to giving us advice.  We first ordered an appetizer of Latke Tots- \"shredded potato, onion, and schmaltz fried crispy tot style served with apple ketchup and sour cream\" We LOVED it. My friend got the special which was a brisket with cheddar and apples (if I remember correctly) and I ordered the salmon burger- \"fresh salmon patty, nova lox, capers Israeli salad under the burger party with dill sauce on a bulkie roll \" Both were absolutely delicious. The burger was perfectly cooked and the only fishy taste was the smoked salmon slice on top. The texture, flavor and everything else was a delicate flavor and nothing was overpowering.  We shared the desert of the salted caramel ice cream on a chocolate brioche bread and oh goodness that was heavenly. They make their own ice cream which is my favorite part - but with a thick slice of warmed chocolate bread, a single scoop of their salted caramel ice cream was placed on top.  Because Nu had their open kitchen, my friend and I were able to compliment the chef. I find it very personal and assured to see and know who is making my food and the chef himself was a very friendly man.  I loved this place so much I went back a week later to order what my friend had only to find out they weren't making it anymore! Hopefully they put it back on the menu someday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ft1JbxBPhibiCboC3oty9A"
  },
  "0SWiDeFRHDoipJl41kq7iA": {
    "date": "4/3/2016",
    "text": "Love this place. Great coffee, great service, really cool specials (bring back the smoked meat eggrolls!!!). A really honestly fresh take on Jewish cuisine, and the smoked meat is just amazing. I'm here usually once a week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x3ei6Z5sNoMP1Qg74_arpA"
  },
  "vGFXnz1mNUMfFJzWxqvP7Q": {
    "date": "12/6/2013",
    "text": "Great stuff! The food is delicious and the staff is very nice and helpful. We sat near the kitchen and chatted with the chef a bit during dinner.  We started with the blintzes, which were tasty and well seasoned. My wife got the Nu BLT, and it was awesome. Seriously, you have to try it, the chicken skin bacon is great. I got the special deli burger with a fried egg on it. The burger was juicy and well cooked, the smoked meat was tender, and the fried egg was perfectly runny. I intend to try the matzo balls and soup next time. Give it a try, you'll like it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FmE5RVeKNo8DdMrpGmjNXw",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Special, Dec 6, 2013: deli burger. Burger with smoked meat, lettuce, tomato and onion on a onion roll. Added an extra fried egg.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FmE5RVeKNo8DdMrpGmjNXw/o.jpg"
      }
    ],
    "user_id": "clBPG9c0lqgCxIMnD9RL2g"
  },
  "iYuSkt2vH-k3MAqQYsCUkg": {
    "date": "5/2/2014",
    "text": "WOW their matzoh ball soup is amazing.  That deep brown, flavorful broth is to die for.  Portions are great for your money too.  I'll be back!  :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "67BS8C-9B45_hQ4cOsSQqg"
  },
  "LRm3IhA6Jpt2mIPnoKVwvw": {
    "date": "1/8/2014",
    "text": "yum yum yum great hot dog. this is a great addition to the Jewish community of SQ. HILL!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hj1uOV27vN_3KfD3Qd4dTA"
  },
  "tYqxxTOlmcNAf_YFbmXddQ": {
    "date": "12/15/2013",
    "text": "Nu has an attitude towards food that I can only describe as \"cheeky.\"  They take classic foods and tweak them just enough to expand your imagination, but not so much that they become unrecognizable concoctions.  They hang framed wikipedia descriptions of their menu items on their walls: a tacit acknowledgement that smartphone-wielding diners have no excuse for not trying something just because they don't immediately recognize its name.  They serve coleslaw sides in chinese takeout boxes, which is patently hilarious.  I wish more restaurants had this playful attitude towards food without diluting its essential quality.  Too often \"culinary humor\" means offering insulin-coma-inducing menu items only palatable to people who lost a bet, the profoundly stoned, and Adam Richmond.  Part of the genius of Nu is its ability to tickle your funny bone, your palate, and your dietary sensibilities all at once.  Disclaimer: I'm as Gentile as they come, so I really had no context coming in for what constituted traditional Jewish comfort food.  I visited Nu with a friend of mine of Russian Jewish ancestry to help me figure out the menu.  I went with the fairly safe choice of a Reuben Knishwich since it was based on a sandwich that I knew I liked, while my friend ordered the stuffed cabbage Knishwich since she was awed that someone had managed to combine two of her favorite childhood foods.  Both of us left stuffed and happy.  Nu is clearly good for both newcomers in search of a good introduction and oldtimers ready for a fresh take on the classics.  I hope to be back soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DmXlYGtjjz-EHpaDyJCWSQ"
  },
  "f4_-JKWuJX4-FBwfwezWMA": {
    "date": "11/14/2013",
    "text": "I thought this deli was below average. Maybe my bar was set too high. I thought the meat was a little dry and the chicken noodle soup was bland. The portions are small for a deli. I did not leave full. It is also pricey for what you get. It is cash only. Lunch for 4 is $100 so bring cash. Service was fair but seemed a little disorganized.  -Hungry in Sq Hill and wishing for a REAL Deli",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TWl2pdwevsiOKjK_bbPvvw"
  },
  "Z61UfAPefOjbToro2ym2_Q": {
    "date": "7/13/2014",
    "text": "We entered here on a weekday some weeks back and were the only customers.   So what is a Jewish bistro?  I didn't know either.  However, it is a strong four start restaurant.  We got the sampler appetizer and while one item was not to my taste it was not poorly prepared.  Everything else was excellent.   We both also got sandwiches we selected with the help of our waitress. They were both really good.  I got corned beef and it was just great.  I was not disappointed.  Do try it yourself.  Some interesting menu choices.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "B7aR8VlLMGzaJ7NHC-jeMQ"
  },
  "oGOvQxEP0YalfMlT82CELA": {
    "date": "12/30/2013",
    "text": "Aji Picante was my favorite restaurant in Squirrel Hill, and I was sad to see it disappear a few months back. Fortunately, it appeared to have a promising successor in Nu, which has the same ownership (Pamela's) and a menu that is inventive and appropriate for the neighborhood.  I visited Nu with some friends last week and was thoroughly impressed. We started with the appetizer platter ($15), a bountiful array of meat blintzes, kreplach, fried potato puffs, and fried pickles. All were quite tasty, especially the fried items.  Moving on to the main courses, it is difficult to choose from all the tantalizing sandwiches, each one featuring Nu's house-smoked meats. We ultimately went with the Reuben Knishwich and the Upstreet Dip ($12 each). The former is a creative take on my favorite sandwich: the meat, cheese and kraut are finely diced and baked into a pastry. The result is a delicious and filling stomach bomb that is surprisingly different from a traditional Reuben. The dip was a more standard affair consisting of a baguette filled with thick slabs of juicy brisket slathered in cheese and horseradish sauce.  It too was excellent and generously portioned.  Nu is BYOB, so we brought some wine and beer to drink with our meal; when the check arrived, we were pleased to see no corkage fee. All told the bill came to $20/person after tax and tip, a fantastic bargain for such a delicious and filling meal. Service was friendly and attentive.   In closing, Nu is a welcome addition to Pittsburgh; I don't know of any other place in the city that serves this type of food. Their menu manages to be both traditional and creative, and their execution is spot-on. Here's hoping it sticks around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 5
    },
    "photos": [],
    "user_id": "vd5wfQ2L8fszYBHDPza9yw"
  },
  "2CSddj8PpHmRTbXaK8wjmQ": {
    "date": "12/22/2013",
    "text": "I love good deli food.  I've purposefully searched down the best from Brooklyn, to Boston, to Boca and I haven't found a corned beef on rye that didn't agree with me.    Nu brings a fresh twist to old classics.  Not only do they do traditional deli well, they elevate the art form with a spark of creativity and fun I've never seen brought to deli fare.  Any deli will serve you matzo balls and latkes, but only Nu will give you mini lake tots and \"Jewish Penicillin\" brisket stuffed matzo ball soup.  My friends got the reuben knishwich (A reuben on a croissant pastry bun), and the Neufalleta, a tangy chunky olive Tapenade muffulettas with classic deli turkey, meat, and Gouda, and a Challah Cristo, a juicy turkey monte cristo with swiss on french toast challah bread. We finished by sharing a killer chocolate desert bread topped off with gourmet salted caramel ice cream and cinnamon puff pastries donuts that had warm custard on the inside.    It's also BYOB, so you can wash down your meal with friends on the cheap.  The staff was also very friendly, and helpful with any questions and terminology.  I'd give them 6 stars if I could!  Eating here felt like I had Matisyahu perform at my Bar Mitzvah, a fresh take on Jewish culture, with both respectful nods to the past, and a spark of revolution, with fresh, funky updates for the future.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "MDeA-Gx8NScCyAdziq7IeA"
  },
  "6F8G4XKJcHjdl6W-7D8WRA": {
    "date": "3/19/2014",
    "text": "This will probably be a 5 after I try a couple more items. Out of the 3 things I've ordered here, two have definitely been 5s. My first time here I went for my beloved matzoh ball soup. I'm a harsh matzoh ball critic and this didn't meet my expectations. To be fair, no restaurant matzoh ball soup ever has. It just doesn't have the same flavor as the matzoh ball I have at family dinners. The broth in Nu's version was delicious; however the matzoh ball was underwhelming as far as flavor and I prefer a softer texture.   Nevertheless, on another dreary day I wanted soup, and I came in deciding to instead try the kreplach and enticed by the specials board offering of noodle kugel (possible one of my all time favorite foods if done well). Wow am I glad I did. The brisket kreplach combined with the chicken soup to create an almost gravy like flavor. So savory. And the cup was loaded with a gigantic dumpling, lots of chicken, and carrots (carrots are key to good chicken soup in my opinion). But the True shining star was the noodle kugel. Dear god...if I could eat 10 orders of it without having to be rolled out of here in pain, it would be very tempting. This was better than family dinner kugel and I didn't think that was possible. So unbelievably rich and yummy. Don't kid yourself...this is basically a dessert not a normal side. But it's a damn good one.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cU6f0FfwVwGwj4NYf2cdcg"
  },
  "4KYIiCHdg9aMvsHC-OF9BA": {
    "date": "12/13/2013",
    "text": "I just visited Nu for the first time today for lunch, and It blew my mind.  I've been to my share of delis, here and in New York City, and have always been a bit underwhelmed by the traditional comfort food served.  I respect that the food here is firmly rooted in the classics, ie. matso ball soup, roast turkey, brisket, latkes.  What I loved was that it wasn't stuck on repeat with them.    Let's get to what I got: I had the latke tots, awesome little deep-fried latkes that were served with this savory apple sauce that I wanted to take home.  I also had the reuben knishwich, which was heavenly.  All of the classic reuben ingredients, encased in a flaky pastry dough that was unbelievably tender and easier to eat neatly than the sandwich version.  My stomach is happily full of warm corned beef and swiss cheesy goodness; I didn't even feel the cold of this sub-freezing December day.  I hope this place is accepted and supported by my neighbors.  It may not be Kosher enough for some of them, but there are a lot of us here in Squirrel Hill that just wish we had a Jewish grandmother, and this place has the Jewish penicillin for you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "-DDUDkBLn-qfkN-O668cSw"
  },
  "8VeDAlxmLly2UpRRe0PWVw": {
    "date": "10/29/2013",
    "text": "I drove by a few days ago, and noticed that the signage where Aji Picante used to be had changed... intriguing! So, when we didn't have any food at home and needed a place to go, I suggested that we see if Nu had opened.  Nu bills itself as a modern Jewish bistro (the name is Yiddish). Inside, it looks only a little like Aji Picante used to, mainly because they have added an open kitchen in the middle. I prefer this incarnation, and think Nu has a lot of potential. The food is distinctively Jewish, with an emphasis on sandwiches, soups, and deli salads (think smoked fish or eggs). The aesthetic is similar to Porch and its ilk, down to the chalkboard announcements of the day's offerings. So, consider it an upscale Jewish deli, but with much nicer service! You seat yourself when you walk in, and the menus are kept on the table, just like they are at Pamela's. Service was very sweet.  We had 1) Jewish Penicillin (i.e. chicken soup), 2) chili, 3) the special brisket sandwich, and 4) mama's meat blintzes. The chicken soup was quite good, and definitely worth having if you are in need of some comfort food when you come down with the inevitable cold/flu. I had it with a matzo ball, which was a bit on the dense side. The chili was overly salty, and almost completely beef, with minimal beans. Some people may prefer that version of chili; I do not. I prefer a balance of beans to meat to tomato, and this was just too meaty for me, even though I am quite carnivorous! The brisket was also a little on the dry side. The blintzes were pretty tasty, but could have used a bit more filling (or maybe we are just spoiled by grandma's blintzes... unclear).  I know this review makes this place sound not so good. Let me be clear - I think Nu has a lot of potential, and we fully intend on coming back again once they have gotten a little more time under their belt. Despite feeling a bit \"meh\" on the food this first time, we liked it enough that we really want to see it succeed.  If you're vegetarian, you can pretty much write this place off. There is a salad or two that might work for you, but otherwise, this is not your place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "ckMFtaljrmXWaSiQqk9ZWA"
  },
  "vJUTkjxaOUPqmb-JmwzO3Q": {
    "date": "5/7/2016",
    "text": "Been here before and will come again. Great service and great food. Latkes are awesome!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QtDbW_068VFuRygTQ68W6w"
  },
  "UvllBmwQz3uR7JFqH0MmXQ": {
    "date": "7/10/2016",
    "text": "The food is tasty and fairly-priced, especially when you consider all that you get with a meal and the size of the stacked sandwiches. I had the Jewbano (their take on a Cubano) and it was tangy and delicious. The homemade pickles were a nice touch and I enjoyed the Matzo Ball Soup.  The service was great: friendly and efficient without hovering.   Added bonus: While Nu doesn't serve alcohol, you can bring beer or wine without being charged a corking fee. Our server even brought us wine glasses.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OFC0bwpvgd09_63eCe6FEQ"
  },
  "stAZRvozyZzFt29BP4pHLA": {
    "date": "1/5/2014",
    "text": "A strong 3 stars. Nu provides a decent, but far from overwhelming experience - in fact a slightly disappointing experience, and we got out of it with a \"meh\" on the lips. It is good, no, better than most restaurants on Murray, but it is not as good as it should.  The restaurant itself looks fine (it shares its door with Pamela): there is enough space between tables, simple furniture, open kitchen, decent light.  The food was not overwhelming. The blintzes with meat (appetizer) were the best dish of the lunch. We  particularly enjoyed the horseradish remoulade that went with it (the highlight of the lunch imo).   The jewish penicillin with the matzo ball and pasta was quite bland, and I have had many better chicken broths. The brisket sandwich was quite tasty, although not light.   Prices are fine. A complaint: they clean tables with a smelly product. Surely they know that taste and smell influence each other, and smelling cleaning product is quite unpleasant when the nearby table is being cleaned.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "LMl9Z43ZVPh5wrz4LeYd6Q"
  },
  "hv_yYSF1f3KwDm7ZvTmv6g": {
    "date": "7/2/2016",
    "text": "I probably eat at Nu at least once a week. The service is excellent and the food is always wonderful. The chocolate egg cream is so good! The main dishes are good, and they take it to the next level with attention to the little things.  If you want toast with your brunch eggs, you can get outstanding rye bread with real butter. A side of coleslaw is obviously made fresh there, and is scrumptious.  My favorite meal is the Sabich, a warm pita wrapped around fried eggplant, cabbage, a fried egg and some kind of glorious sauce -- so good!  My husband is a meat eater, and loves everything he gets there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v0Gmiy2C-kXirvRbGhicCA"
  },
  "v_1UXDYJ6_KSz6asGOSLhg": {
    "date": "5/14/2016",
    "text": "The food was incredible. We had the Benny with smoked meat and the shakshuka. Both were really flavorful and prepared flawlessly. Don't wait in line over at Pamela's and get fast friendly service at NU.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z4vKcxLw4l-pnwU8t4RF4w",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Benny with smoked meat and crispy latkes!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z4vKcxLw4l-pnwU8t4RF4w/o.jpg"
      },
      {
        "img_id": "PB2HYT-NChuFat7j3sDlFQ",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Shakshuka!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PB2HYT-NChuFat7j3sDlFQ/o.jpg"
      }
    ],
    "user_id": "oCBHuPhfabkuJgqT-h7wng"
  },
  "BHaw-F_L33CHfogyRdT-kw": {
    "date": "6/1/2014",
    "text": "Went here on a Sunday at around 5pm. A couple of outdoor tables had customers, but not a soul inside. The waitress was very prompt and nicely explained the menu, a beverage special for the day, and the day's menu and soup specials. I ordered a cup of Jewish penicillin with a matzo ball and a half smoked meat sandwich. The waitress explained Montreal smoked meat and that they do theirs in house.   My companion ordered potato latkes and kishka, which she had never had, and I haven't since I was a kid.   My soup came out first, as requested. A very generous crock! The broth was nicely flavored wit bits of chicken and carrots, and the good sized ball a perfect consistency by my standards (I don't like them TOO airy). Served with a side of wonton-type strips, but tastily fried in schmaltz for a change.   After I inhaled that, my half sandwich arrived (more like a whole) with a newer half dill and a takeout carton of a good not-too-creamy coleslaw. I remember Montreal smoked meat having WAY more flavor and way less fat strips, but this wasn't awful.   My companion's latkes came with a small side of sour cream (where's the apple sauce?).  The 3-4 CD-sized disks looked delicious, and had a good consistency, but had a very odd, unappealing flavor. Her 3-4 kishka slices had a dose of gravy, and were decent, but my memory remembers stuffed derma (kishka) being more much savory and salty, less sweet.   So all in all, I'd order the soup in a heart (attack) beat for comfort, and might try a different sandwich, but the food didn't make me vaklempt.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IOYbJgL67pkodqDGr1rIXg"
  },
  "XtPvgeFBebgMRAc6-Bkvww": {
    "date": "10/9/2014",
    "text": "Soups, meats, sides--all spectacular. Been here three times and nothing disappoints. BYOB. Return visit for brunch--my wife said the French toast was the best she ever had. Hash superb also.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IYSMBkPKS-1axDII0MUIYg"
  },
  "ohon-Fkp0ud32CM1KE01kA": {
    "date": "3/19/2016",
    "text": "Ate there with friends who have lived in New York and know from corned beef. It was the best they'd ever had. Jewish penicillin was good for what ailed us. One warning: don't believe the server if she describes a portion as small.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FJPueGAznNvqrZG8hrK7ZQ"
  },
  "cHJ0IKmqY335D-tOLeS3OQ": {
    "date": "1/23/2016",
    "text": "Came in here and tried the Jewish Penicillin, or their chicken noodle soup with two large matzah balls. It was my first time tasting matzah and it was alright. I guess I'm not a fan of matzah itself (apparently, their matzah is the best in Pittsburgh). I just found it flavorless, heavy, and slightly nauseating (it doesn't look very pretty). The soup was good though - wonderfully flavored chicken broth with carrots. Interior has this diner-esque feel to it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7I5OgoncWoaNH23xmWxBNA"
  },
  "kt6L8-ZTfdE_Cm0xftecOw": {
    "date": "1/17/2015",
    "text": "Where do I start? The broth alone in the Jewish penicillin is amazing. I got the T.O.M and my boyfriend got the Jewish dip. So good. BYOB doesn't hurt either. Didn't have enough room for dessert but will definitely be back for the Babka.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M1IQ4yhPmHbr4VX-0FXxTw",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. T.O.M with a side of macaroni salad and pickle. So good.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M1IQ4yhPmHbr4VX-0FXxTw/o.jpg"
      }
    ],
    "user_id": "lyrjOhuAWovpdGviltjLaA"
  },
  "DYrXfY1kxVnlshwvBfvWOw": {
    "date": "2/28/2016",
    "text": "The hands-down best Jewish deli foods in Pittsburgh. Really friendly service. Get a Montreal Smoked Meat sandwich with a pickle and some macaroni salad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qhu-afDpwUbxPuVmwL27dw"
  },
  "vX5ZhVZVOOefo5ea6ExT_Q": {
    "date": "7/1/2014",
    "text": "I visited Nu Deli in June of 2014. I had been meaning to visit ever since I saw \"Montreal Smoked Meat\" on the menu- possibly one of the greatest deli options out there. The decor was nice, everything was clean and we were promptly seated. The waitress was quick to serve us water and take our order (though to be fair, there were very few people there at a 5pm that Sunday). The first thing I noticed was that they had already raised their prices compared to the menu I saw posted online. (I do find it a hassle that they have no website with menu posting). But I was willing to live with the increase, as I've never seen a place offer Montreal Smoked Meat outside of Montreal.   I ordered that 1/2 lb sandwich, with coleslaw. At first inspection, its about a 4 inch tall sandwich with plenty of meat. But i like to eat my sandwiches open-face, so I opened it up, and suddenly I'm staring at strips of fat. I would say probably a third of the sandwich was pure fat. Half of it was decent corned beef, and the rest was corned beef laced together with fat. I was somewhat disappointed how much effort I had to put into dissecting my sandwich to remove the fat. The corned beef itself was tasty, though not as Montreal-style as I remember. In fairness, since I don't have a picture of the tasty-looking \"before\" picture, I won't post the mound of fat \"after picture\". I was a bit surprised the waitress ignored it when she took away my plate.  The coleslaw was cream-based, which I generally don't prefer to vinegar based. But it was tasty. It was in a little chinese take-out container, so as I got closer to the bottom, it was really just a soup of coleslaw cream, which I can't really eat.  My fiance ordered the \"Grilled Salmich\"- basically a salmon fillet atop a pita. She says it was fine. I tasted it too, and I thought it was good, but not particularly flavorful.  Overall, I wouldn't call this a replacement for really good Jewish Deli based on these two dishes. In NYC, you get tons more, leaner corned beef, at a price that is only a few dollars higher than this. I didn't dislike it, but it just didn't astound me enough to be put in the rotation of regular frequented restaurants.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9L-Y-vwCneBdQfaD5v0tFg",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Top of the NU Menu, July 2014",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9L-Y-vwCneBdQfaD5v0tFg/o.jpg"
      },
      {
        "img_id": "b6U9FvsUrGLhyfFplVelHQ",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Bottom of the NU Menu, July 2014",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b6U9FvsUrGLhyfFplVelHQ/o.jpg"
      }
    ],
    "user_id": "AO3E5DObUmsISFvx5T6z2g"
  },
  "eDJ_qQ22HUrGcOCtMyGaJQ": {
    "date": "2/27/2017",
    "text": "not worth the !$$  a pickle cost extra but the stale bread is complimentary! They defiantly don't sell enough sandwiches to put a Great product forward......if you like dry corn beef than give this a try!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CZxTyU7RJSybqjCCtO970w"
  },
  "7fvkxkb-QzsLtc3q1bgCBA": {
    "date": "11/23/2014",
    "text": "Every time we go to Nu, we are treated incredibly, the food is fantastic. i am so glad we live down the street",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "u9vRV4wDWsDkupnZmA3RtA"
  },
  "JJBmp2nwNA85aweszfrH6g": {
    "date": "9/3/2017",
    "text": "This is a hidden gem. Located next to a very popular restaurant by the same owners. I would highly recommend going to Nu instead. The food was amazing! Beyond your normal breakfast fare. We are not from the area but can't wait to come back on our next trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6qQrI14T42YpGIB8DgHqow"
  },
  "Xy954rLQ-xq6ykYbtoHKQA": {
    "date": "2/19/2017",
    "text": "Wow this was great! The staff was friendly, and the food was fabulous! I ordered the lox omelet, which was cooked to perfection. The nosh table was awesome, especially the African chicken peanut stew. The sweets on the table were quite strongly flavored, but were sized appropriately for how strong they were.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CATda4Zs0ea8FU4Nhz93yg"
  },
  "rn71xcfAyMl3o8TPmFKlRw": {
    "date": "4/20/2016",
    "text": "My boyfriend and I have ate there twice now. We started off with the potato latkes which were delicious and curbed my severe hunger. Then I had the french dip which was very good, it has a sauce which I believe is horseradish based that I really enjoyed. The beau had the jewbano which has the most scrumptious smoked meat I have ever tried!! However, they do not have any desserts right now that cater to lactose free individuals which is why I cannot give them a full 5 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ghh1PKzKpVSIvYqoMXU6wg"
  },
  "2reUSCEo32AFZhYrYP4qAw": {
    "date": "10/31/2016",
    "text": "Excellent establishment adjacent to a simple dinner owned by the same owners.. my folks and I truly enjoyed the ambiance and classic dish. I ordered a rubin it was tasteful but a bit overbearing saturated in oil. I'll be back again when I come visit Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4fPEbz2julpQI_AdCG2mMA"
  },
  "7EFko-33kMjbmEDwx3emow": {
    "date": "7/9/2014",
    "text": "Comfort food prepared with authentic recipes.  Our waitress was familiar from when she worked at Aji Picante.  Everyone was helpful and friendly.  Their most popular dish is the Upstreet Dip, a brisket sandwich with caramelized onions.  We ordered that and it  was very good. We also ordered the Nu Nu Platter and the Matzo Ball Soup.  Everything was very filling.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Nuz0R1y1Mi1Gq0M34fYZyw",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Matzo Ball Soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Nuz0R1y1Mi1Gq0M34fYZyw/o.jpg"
      },
      {
        "img_id": "QVt4rRGBya8KH_T5uxYu9w",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Kishka with gravy.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QVt4rRGBya8KH_T5uxYu9w/o.jpg"
      },
      {
        "img_id": "Hi6Z1fv8u8qcwZBm_hBJCA",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. potato latkes and kreplach",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Hi6Z1fv8u8qcwZBm_hBJCA/o.jpg"
      }
    ],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "Z-3cqWMhqmdNNiy-dQusrQ": {
    "date": "11/24/2015",
    "text": "Ok, I have now been here a few times and I think that I would still consider it A-OK. It is not a place that I am rushing out to eat at but it is not a place that I am actively avoiding. If I am in Squirrel Hill (and I am there at least 2 days a week), I am hungry (which is always), and I want something quick, I will always pick NU. They are A-OK.   The prices are are little high. $12.00 for a sandwich, even if it comes with a side is a little too much for me. But I will say they taste amazing.   The Sabich: Crispy fried eggplant, Israeli salad,fried egg, tahini & amba sauce, served in fresh pita. I have had this twice. I really love this sandwich. The fried eggplant were a big draw for me to order this sandwich. I love eggplant and these are crispy and fried to perfection. I asked for extra sauce since I like my sandwiches on the sloppier side. I do not know how they originally come but asking for the extra sauce made the sandwich perfect!  JEWBANO: Smoked meat, roasted brisket, pickles, swiss cheese & mustard, pressed on a bulkie. TO DIE FOR. This is the one order that I just was hungry and said, \"eh\" to the price and went for it. This sandwich was so big that I could only eat half. HALF!!! I probably could have eaten all of it but didn't want to look like a porker and wanted my fiance to try a bit of it. The smoked meat was so flavorful and juicy. There was not a dry part to any of the bites that I tried. Roasted brisket!!! BRISKET!! This is one of my favorite meats. I really love it. How can you not enjoy a sandwich with brisket in it! I am not a fan of the pickles. I do not know why! I love pickles but these ones are just not for me. I eat them....sometimes but I do not grab for them. And if you know me, I am a pickled vegetable grabber (I don't know how that makes me look...). This sandwich is a must if you come here. So good.   I always take my food to go. During the less than 5 minute walk to my second job the food stays perfect. It does not get mushy, it does not get that weird \"cooking in the wrapper\" taste to it. It stays just as it should.   I have yet to try any desserts. Or the noshes. I would like to experience NU as a sit down with friends dinner or lunch. I think that it would really expand my idea and view of the place.   I would suggest, if you are thinking about it, to at least try it out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hietrA8M58asfpyJkCyiA"
  },
  "6Eg_pHSHVCOuduSF1umUPA": {
    "date": "9/10/2015",
    "text": "I am sorry to have to write this, for I wanted a place to have a good meal (sandwich) like I have gotten at the Carnegie Deli in New York - this was so far from that - the corned beef sandwich - I wanted something simple and hard to mess up - it was not only messed up it was not what any new York Jew would have recognized as a corned beef sandwich. It was dried up sandpaper like meat.  This is what a corned beef sandwich should look like -   <a href=\"/redir?url=http%3A%2F%2Fdzakinsdeli.com%2Fgfx%2Fpics%2Fcorned_beef_sandwich.jpg&s=8e97e65b74749425a0293d93a6f54f1a705aa0c1161062ef25e085b848dfe584\" target=\"_blank\" rel=\"nofollow\">dzakinsdeli.com/gfx/pics...</a>  -  I am glad I only got the half a sandwich with the soup - I brought most of the half even home so my wife could try (I did not want to say anything till I had someone I trust taste this drek too) she spit it out in disgust.   Matzoh-ball soup was like my mother's - the problem is my mother cannot cook either - when we visit her she makes me cook -   The Matzoh-balls were a nice size but hard and seemingly undercooked and without flavor.  The soup itself was not that bad and had the crap at the bottom you would expect with homemade soup. Overall if someone reads this with any power to do so \"Bring a good Jewish deli to Pittsburgh PLEASE!!\"    I gave the stars for the egg cream -",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8g41T51VJNA1mt3lFA-9zA"
  },
  "aIt_gJguLFoNGOmcSUy5Pw": {
    "date": "4/13/2015",
    "text": "NU bills itself as a modern take on Jewish cuisine, or something to that effect.  \"Modern\" innovations seem to include a Reuben Knishwich, and enormous knish containing Reuben filling, and a couple other things like that. I didn't get the knishwich, but I do like a good knish, and the people we went with swore this was a worthy innovation.   I got the Rachel with a \"Montreal-style\" smoked meat. It's not a huge sandwich in the style of say, the Carnegie Deli, but while not overwhelming (in a good way), the meat was delicious and then sandwich was still ample.  I also got an order of kishka; I'd been struggling to explain it earlier in the week to my partner, and found it to be a good example of the form.  I'm used to it in derma, like at Katz's Deli and Corned Beef Emporium in Toronto, but I don't suppose there's a significant difference in the taste. The gravy was also good, though I would have liked more of it; I got fries (also good), specifically to mop the gravy up with, and there wasn't nearly enough.  Perhaps I should have ordered the poutine if that's how I feel, but still.  For dessert the couple we were with split the matzah brittle ice cream sunday.  The matzah's coated with chocolate, nuts, and some sea salt.  I had a bite, and it was pretty good, but given that passover had just ended, I wanted something a little more *leavened*, so my partner and I split the \"babka sundae\".  Usually she has a couple bites of dessert, and then I finish it off, but this marks a rare dessert where it was so good we actually ordered a second portion.  You get a thick slice of warmed-up, gooey chocolate and cinnamon-y babka, with a scoop of french vanilla on top, caramel drizzle, and sea salt.  It's not especially ground breaking, but it is darned good.  They had good mustard on the table, the service was exceptional, and we enjoyed our BYOB wine.  We also each had a quarter of a new dill pickle which was good.  Again, I guess I'm of the school of deli-excess: I want a sandwich I can barely pick up, loads of gravy on my kishka, and ideally, and a full pickle, along with perhaps a selection of different pickles (I feel like we're in a bit of a pickle revolution; tons of places make their own pickles and pickled vegetables, so that would have been a cool plus). But these are minor peccadilloes; it may not match a traditional deli in Toronto or NYC, but I'd happily come back here if we were going to stick around Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "tpv8j9Rk9KN9RVmpZ8uMfQ"
  },
  "LBTZV4pB31lT5jiwD_76Rg": {
    "date": "1/8/2015",
    "text": "Normally when I write a review, I mention a particular meal and try to give readers some idea of what menu items I recommend (or don't recommend).   Well, the thing about Nu is that my husband and I go there fairly often, and we've tried most of the menu, and we recommend it all. OK, I'll try to be more specific: Any version of the chicken soup (flavorful stock, great matzo balls), anything with the Montreal smoked meat, the sausage bean soup, the coleslaw, the pickles, Portions are huge, by the way. Nu's cup is everyone else's bowl!  We only recently discovered Nu's brunch menu, and it has actually lured us away from Pamela's next door. (Of course, Pamela's and Nu are under the same ownership, so they're still getting pretty much all of our our brunch business.) The Jewish biscuits and gravy may be the epitome of World Cuisine.  Last, but far from least, the staff is friendly and the service is great.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "vEQ5c2KEbNrKm58cQs2Z6w"
  },
  "056DVmwRFzE3lN5lPpxxAw": {
    "date": "4/24/2015",
    "text": "Terrible food the one time I ate there, but decided for some stupid reason to try it again.  I didn't even get a chance, though, because both the hostess and the manager decided to give me grief about my service dog.    To heck with them; I just left and went elsewhere, where I *know* the food is good and they welcome both my dog and me - Silks across the street.    I'm fed up with having to still educate businesses about the law who should know better by now.  Which most other businesses around here obviously do know at this point.  No one should have to run this kind of obnoxious course just to get a bite to eat.    They were at least pretty polite, but you know, it doesn't make a paying customer feel the least bit welcome when we have to meet people literally physically blocking the path into the business, confronting us, demanding documentation and have to educate them about why we have to be allowed the same rights to eat there as anyone else - and specifically why no documentation or special garb is required, and why it's illegal to ask for it or require it.    But after the hostess took off to find the manager because she didn't know the law, suddenly she became an expert and started trying to tell me what was required and what was not.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "98_fHrZJitYuI8yd99cHqg"
  },
  "r30as6IT1hz2sGz0KdfdwA": {
    "date": "1/19/2015",
    "text": "I've been to Nu three times in six month.  The first time I came for the Jewish Penicillin (matzo ball soup).  I'd had a terrible day, was sick and needed some love.  It hit the spot.  The last two times we've come as a family for brunch.  We've covered most of the items on the menu.  While not as diverse of a menu as Square in Regent Square, I feel the brunch is quite possible the best we have in Pittsburgh.  You really can't go wrong.  The flavors are amazing.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hqlcrO_El_Fjg30i49BswQ"
  },
  "HQtqWXYFYS_87TCvz4ddkQ": {
    "date": "10/5/2016",
    "text": "I visited Nu this past weekend and loved the new menu and buffet  aka nosh table. We had a group of 4. Everyone got something different. I loved my Nu Benny ( eggs Benedict) best but enjoyed everyone's. It was really fun eating at the nosh table with friends and comparing things. Reminds me a bit of lydias concept but this was homey and welcoming.   The atmosphere is bright and cheery. You can linger and chat and the staff treats you like family. It's definitely a new concept for Pittsburgh. More New Yorkish I think. Whatever I'm sure some will miss the old style dining but this is delightful  and fun. As Nu advertises kinda like sitting at your moms brunch table on a Sunday as she just keeps bringing out more food.   Loved the house made lox and the chopped liver is the best I've ever had. Love that it's unlimited at the nosh table. And that it constantly changes. If you're looking for grand dining in a formal atmosphere better head to grand concourse and lydias as they are great. If you're looking for great food and a bright positive atmosphere this is your place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3ylU6sxRTnqVYjqL4TzRw"
  },
  "yN0mAZ23vFmgW0jgdUZd2Q": {
    "date": "6/27/2015",
    "text": "Stopped in for an early lunch.   I was the only customer at the time.  The Pastrami was excellent.   The bread could have been better.  I would prefer if a place like this would stop with the small bread over stuffed sandwich. I really just want a nicer larger slice of bread for my sandwich, you don't have to make it hard to fit in my mouth.  But seriously - the Pastrami was made there they said, and it seemed to be so - wonderful!  I give it 3 stars- Most of you would give it more, but I think 3 stars is good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vzVMzKYkjeJCaYqirBaM0g"
  },
  "3_PkNZAy5scGQzMo_2b4CA": {
    "date": "4/27/2014",
    "text": "Apparently this place has been open since November, but I had no idea because of a lack of signage.  Luckily, management decided to finally invest in a bright blue awning that caught my attention while driving down Murray Ave.  I said to my PIC, \"We should try that place.\"  Then, lo and behold a few days later, we were there, enjoying quite a pleasurable Jew-ish bistro lunch.  The sign worked!  Now, this place isn't Kosher or anything (hence \"Jew-ish\"), but my PIC who is of the Chosen People has stated that this is probably one of the best places to get Jewish inspired food in Pittsburgh, and that's saying something from him.  Me, being a Shiksa and unfamiliar with this type of cuisine can't say the same.  However, I *AM* a lover of food, I can say with certaninty that it was pretty darn good.  I got the T.O.M. and even though I'm not eating bread at the moment, the brisket and kishka (think meatloaf shaped sausage thing) were excellent and drenched with this tasty, tasty gravy.  The PIC got the Jewbano, which he devoured.  I even broke my \"no bread\" rule to take a bite of his awesome looking sandwich.  Luckily I didn't lose a finger in the process!    Additionally, the wait staff seemed very friendly and were attentive to us.  The only thing I didn't really like was the awkwardness of having to go through the kitchen to get to the shared bathroom with Pamela's next door.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "dKKTpZ8TeX8qv4gT_otDHQ"
  },
  "IteZKa-5uXSydgruftBQoQ": {
    "date": "6/24/2015",
    "text": "Omg you need to come here! Melt in your mouth food, corned beef and brisket ridiculous and  this food rocks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P3GIRj3ZMLvA7z8IAwm75w",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Omg the sampler platter is sooo good!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P3GIRj3ZMLvA7z8IAwm75w/o.jpg"
      }
    ],
    "user_id": "r-5QPnNy-7NUH4vRrFSVQA"
  },
  "UXwOrwWnr9OJN0KAnw7Ymg": {
    "date": "5/26/2016",
    "text": "Great food, relaxed atmosphere, and outstanding staff!  I visited them on a recent trip to Pittsburgh and was exhausted enough to leave my wallet at the checkout counter. Milissa went above and beyond to track me down. That type of hospitality is amazing and really helped keep my trip on track. I was traveling with my 14 month old son and the last thing I needed was a lost wallet. This crew made me feel comforted and welcome not just with the food but also their hospitality. Kudos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LrVAbRhZmGm5DjdaUYs6bA"
  },
  "azmp4TtpBQEGS6_qs-OPKQ": {
    "date": "3/9/2015",
    "text": "We came here looking for a place that was still serving food and didn't have a wait in the evening. We came in and there was no one else in the restaurant at all. We were seated quickly and ordered, but the server couldn't answer any of the questions we had about the food. Surprising for a place you would think would receive a fair amount of questions about their food.  It came out reasonably fast for having no other customers. It was bland. I had a salad and the fish was okay, but the portion was small. The rest of the salad was lettuce. And had no flavor at all.  I would list the rest of the orders, but they all shared the same thing in common. They were all bland.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PQHCu1Wr1Ebn68Aq7_YLBA"
  },
  "vcOM__Gv6oGdBsHdYbsysw": {
    "date": "7/12/2015",
    "text": "Great modern, hip take to classic Jewelry deli! Go here! And service was excellent!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_T9pSNf87nQ3HkyN-gVcVw",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Potato pancakes!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_T9pSNf87nQ3HkyN-gVcVw/o.jpg"
      },
      {
        "img_id": "CqHV0zPzM2S73VdLNyKpeg",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Ruben wrapped in puff pastry!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CqHV0zPzM2S73VdLNyKpeg/o.jpg"
      }
    ],
    "user_id": "mgt2CdHWkPYcljAH7L-0vw"
  },
  "t5ieoVd_rf5d-MwVe5yEIA": {
    "date": "12/6/2014",
    "text": "I got the Jewish Bahn Mi which had smoked meat, jalepeno slaw and chopped liver spread. Flavors went perfect together. I prefer the way the Vietnamese do it, but NU's version was still very delicious. I chose coleslaw as my side and was not disappointed - the waitress said they use combination of mayo and vinegar, but I think it was more vinegar-based (which is what I prefer). I also split a Jewish Penicillin Soup w/ Matzo Balls w/ my boyfriend, and it is perfect for Pittsburgh's cold winters...especially if you're under the weather.  Food came out quickly, service was above average. Cost is reasonable for the amount of food you get.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "g7S7fGfZC9ow_wIsK848MA"
  },
  "ah2g_lOx9c3RsOZJJJ-V8w": {
    "date": "10/5/2016",
    "text": "My significant other and I used to be regulars at Nu. We came every saturday morning. The restaurant recently closed for renovations for a month and we anxiously waited for it to reopen.  It reopened on a saturday am and we obviously went to go to our favorite breakfast spot. Unfortunately we were so disappointed. They renovated the menu and got rid of everything that made the restaurant unique. They added a buffet of things that I didn't want nor liked and made me pay for it. Got rid of the latkes which is a staple of the establishment. The price for breakfast is absolutely ridiculous now; 52 dollars for the two of us and i did not have more than two bites of my food because it was so disappointing. 5 dollars for a small glass of orange juice? when i was forced to purchase a buffet of things i did not eat? i am just sad. Sigh, i guess we will have to find a new spot.   old Nu 5 stars.. new Nu 2 stars and thats being generous. Employees there are lovely though. Very nice and attentive.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K9KW0XD9HpqA2yc5pZGbwg"
  },
  "QCrpoH2Y33EtovktXJT6nQ": {
    "date": "7/22/2017",
    "text": "I went for the nosh table and the nosh table I loved.  Nosh naysayer I am not.  Nosh nosh nosh.  Here is the nosh down (noshes graded on a scale of 1 to 5):  Latke hushpuppies: 4.5 noshness (like latkes from a mix except ball-shaped, aka nostalgia and whimsy in one)  Coconut shrimp: 5+ noshness (whoa! on both accounts of \"hey this is SO not kosher as in not even trying to look a little kosher\" and oh-my-treifness, these are awesome.  They were tender and flavorful)  Jalapeno-corn-cheddar balls: 2 noshness (only thing I didn't love)  Mini bagels: 5+ noshness (best bagel I've had in years, so soft and wonderful)  CHOPPED LIVER: 5+ noshness (brought to the table by the waitress, this was classic and perfect)  Israeli salad: 4 noshness (a little more complex than usual Israeli salads)  Fruit salad: unknown as I never got to it, but in theory I'm glad it was there  Greens with smoked meat: 4.5 noshness (yum yum yum and even better stirred into the Shakshuka)  Mac & cheese: 5 noshness (an excellent creamy version with big fat elbows)  Challah bread pudding: 5 noshness (sliced of tender goodness)  Spicy strawberry sauce: 5 noshness (I ate this with the shrimp)  Southwest Chipotle sauce: 5 noshness (I dipped the latke pups in this)  Peach-mango kutchen: 5 noshness (this is served like a slice of pie but tasted more like shortbread topped with chunky jam)  There was also applesauce & sour cream for the latkes, cream cheese & butter for the bagels, bagel chips, stuffed olives, and brownie bites and blueberry cake.  I chose Shakshuka and it was very good, with a more complex sauce than I've achieved on my own at home.  I didn't think I was being insanely glutonosh at the nosh table, but I was nearly stuffed by the time my entree arrived.  I tried, but I couldn't get too far into it.  Which is OK because we get to eat it for breakfast tomorrow.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pCo91HkP9E5pG9GI-MpnnA",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Nosh table",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pCo91HkP9E5pG9GI-MpnnA/o.jpg"
      },
      {
        "img_id": "7sGA03kjSg5722XbYjmQRw",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Nosh table",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7sGA03kjSg5722XbYjmQRw/o.jpg"
      },
      {
        "img_id": "EddFqxF2Kx7GO-kkcz3KOg",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Nosh table",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EddFqxF2Kx7GO-kkcz3KOg/o.jpg"
      }
    ],
    "user_id": "af8dQQZK6vWZAVQiSTae8g"
  },
  "oD_vLpAvGoT2iaGVSBnf-A": {
    "date": "4/5/2019",
    "text": "You're probably looking at this Yelp review because Pamela's is full and you're wondering if Nu is any good. My friend, you're doing the right thing. The only thing to worry about at this restaurant is if you have enough room for all the delicious food. You'll want to try it all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FwG_oehxvf7ND_iIIndTiA"
  },
  "5AwjVYm3hyZdjYkQH1IdCg": {
    "date": "1/11/2018",
    "text": "This Jeweeey little gem is planted nicely next to Pamela's, centrally located on Murray Ave in the heart of Squirrel Hill. With  all the Jewish Deli's extinct except for one, this establishment reminds of the culinary greatness of generations past. The comfort food will warm your belly and soul... well that and the amazing meats and latkes!!!  Limited hours so check before you venture out... they have a little buffet for noshing on assorted appetizers and desserts. It's even better than grandma used to make... trust me on this. Get ready to loosen your belt a notch or two",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rfCJYUTntqjo5Vq_vO3dJQ"
  },
  "0GB5bwdftUUgZ8E4tjMqZA": {
    "date": "2/4/2017",
    "text": "Was originally going to go to Pamela's but they only accept cash and we're all about credit cards so we ended up at Nu, and boy was I sure glad we did!! It was also a lot less crowded than Pamela's.   If you order an entree you also get to enjoy the nosh table (a mini buffet). The nosh table comprises of sweet and savory breakfast & Jewish items. All I can say is: BAGELS! They are warm and chewy and oh so delicious. The challah bread pudding, chicken schnitzel, and latkes were also very yummy. For my entree, I got the LEO which was smoked salmon and eggs scramble which was also delicious and went great with the bagels! Service was great and quick, will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "YzGYxCOzJURzoeCTTt_kTQ",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Eggs Benedict",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YzGYxCOzJURzoeCTTt_kTQ/o.jpg"
      },
      {
        "img_id": "blEvJsTo9_ipCd4yPq9hXg",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. LEO",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/blEvJsTo9_ipCd4yPq9hXg/o.jpg"
      },
      {
        "img_id": "O3IPh-GBm5LiYUk5Ks0GKQ",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Nosh table",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/O3IPh-GBm5LiYUk5Ks0GKQ/o.jpg"
      }
    ],
    "user_id": "cTo_QwJuLJrjfehhAgxCuw"
  },
  "fZoUCEGdm8fL8zq21_rkbw": {
    "date": "10/28/2017",
    "text": "Perfect ambiance, amazing food and outstanding service. What an awesome place!  After checking out the nosh table I wasn't really prepared for the entree anymore but it (Shakshuka) was so good I simply couldn't not finish. And the chopped liver they keep bringing is just so so good.  Highly recommended to anyone looking for brunch in the area - and it is conveniently placed right next to a movie theatre, too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WLz5wS_BTsF6_eGf-rPEUA"
  },
  "VX-_rbLg34QrZ9ebrVyxbA": {
    "date": "2/17/2019",
    "text": "This is by far our favorite family brunch spot. If you are in line for Pamela's, skip the wait and go next door to the Nu bistro, which rarely has a wait. This is a great place if you have kids, just sit down and help yourself to the fabulous nosh, which is stocked with homemade mini bagels, Mac n cheese, soup, and fried coconut shrimp just to name a few. The brunch entrees are all delicious and will not disappoint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gU7cApzeMWGXkX5_nlDxaQ"
  },
  "psQJoAPGRL0nGwsXvR7XRw": {
    "date": "4/4/2016",
    "text": "I visited Nu yesterday with some friends for brunch.  Given that she'd been here several times before and had enjoyed it, my friend suggested it.  For my part, I was game because I'd never been before and had been wanting to try it, so I eagerly agreed.  My friend who'd been here before started off by ordering the poutine ($8) for the rest of us to share.   Having tried versions of poutine at several other restaurants in PGH, I'd say that Nu's version is my favorite.  Their version is composed of a bed of crispy battered shoestring fries, brown gravy, and cheese curds topped with fried onions.  It was served hot, such that the cheese curds partially melted and became stringy (in the best way!) as we ate the poutine.  Unlike many other versions I've tried, the flavor wasn't too salty, and the variance in temperature and texture made it fun and interesting to consume.  For my entree, I was torn between the grown up grilled cheese and the eggs benedict, but I settled on the \"benny\" with lox ($12) per the recommendation of my waitress.  Other than the lox subbing for the usual Canadian bacon, the benny pretty much took the classic form of poached eggs topped with Hollandaise sauce over open-faced English muffins.  It'd been awhile since I had this dish, and it hit the spot.  My only criticisms were that the lox made the overall effect a bit saltier than I'd like, and that I can make richer-tasting Hollandaise. :-)  My other friends ordered the leo ($12) and the corned beef sandwich ($10 x 2).  I didn't try any of their entrees, but one of the ones who ordered the sandwich said that it was the best corned beef he'd had in PGH.  All of them seemed quite satisfied with their orders.  Overall, I enjoyed my brunch at Nu.  Service was responsive to our needs (replacing napkins/silverware, bringing sour cream for latkes), and the atmosphere was casual, clean, and uncrowded.  I felt that prices were a bit high for the caliber of food, atmosphere, etc., but they weren't completely unreasonable.  As another reviewer mentioned, Nu represents a nice change of pace--and upgrade--from Pamela's for a weekend brunch experience.  I'll have to return to try the desserts, since the chocolate babka and egg cream sound scrumptious!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 11,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "WelWKcU61zV5dE4SHftVbQ",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Poutine",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WelWKcU61zV5dE4SHftVbQ/o.jpg"
      },
      {
        "img_id": "jiK4tr_-bN8KTHJnAHUHkg",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Corned beef sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jiK4tr_-bN8KTHJnAHUHkg/o.jpg"
      },
      {
        "img_id": "jVdOF0PD25GJgWYV6OtGPQ",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Mix and match w/ corned beef sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jVdOF0PD25GJgWYV6OtGPQ/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "GnmECt_cxmoWSKafR9QeKw": {
    "date": "7/15/2017",
    "text": "My husband and I stopped in for breakfast on a Saturday. The entree selection, written on the chalk board was small but super varied. It featured basics (meat and 2 eggs) to complex (French dip style sandwich or a neat tomato stew). Each entree was $16 and included the nosh bar. Nosh bar had biscuits, Mac and cheese, latke hush puppies, fruit and a bunch of other stuff. The entrees don't include toast, hashbrowns, etc so this fills that out.   It's right next to Pamela's (they share a main entry) so you might have to fight through those waiting to be seated at Pamela's but you should be able to sit down right away. Nu does have a small amount of outside seating.   Only 4 stars since it is a little expensive but you don't walk away hungry.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AFy1yHdkql9k01PuUG-x2g"
  },
  "UMW_DXzYcNK0ZlnlioGZhA": {
    "date": "6/12/2016",
    "text": "This establishment deserves 4 stars, but what separates 3 and 4 here is service. The service here is poor. There are a couple reasons for it, including both their workflow and at least one of the servers.   I won't go into any more detail on that, and will upgrade to 4 stars when service improves. Since we come here regularly, the opportunity is there.   It's unfortunate because the food is excellent here. I do mean excellent, and I also mean consistent. That's what makes this place a 4 for food.   We've had most items off their brunch menu, including a number of items off the full menu. The brunch menu is very excellent and the Israeli Shakshouka is our favorite. The tomato sauce is delicious, well spiced and well seasoned (salt). The toast is fantastic and the mamaliga (a form of polenta?), is also delicious.   A few other menu items that are solid are the tomato pesto omelet and the lox omelet.   In addition their bacon is excellent (thick cut, not thin lame wisps like next door).  So, if you don't care about the service and don't want to wait in line next door, eat here! The food is awesome!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ShIl-GeKmD9JdcaOrB9wVw",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Israeli Shakshouka",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ShIl-GeKmD9JdcaOrB9wVw/o.jpg"
      }
    ],
    "user_id": "CIKD9oMj-qTZ3zDdgFW5_Q"
  },
  "vfPZjCCmm0aTw3xFRhMFTA": {
    "date": "3/1/2018",
    "text": "My partner and I went here for brunch one Sunday and had a great time! The service is warm and friendly, the bistro feels homey. You order an entree and eat whatever you want off the \"nosh\" table, which has sides and desserts. The coffee was good too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dROrat3yrewNsL-GZSTpTA"
  },
  "MutHiuSKPBIT6cEq61dOzg": {
    "date": "2/24/2016",
    "text": "This place gets 3-3.5 stars.  I have had good food here, and I'd probably come back. When I visited with a friend, we shared a chocolate egg cream ($2.50), which my Jewish grandmother is always talking about. I'd never experienced one of these before, and it's pretty weird. Like a chocolate milk soda...not bad but this has got to be an acquired taste.  We got the latkes ($4.99), which were very good, but in True Jew form I have to say they're not as good as my family's. They are crispy potato pancakes, served with applesauce if you ask, and sour cream otherwise. We shared a platter of their hand carved roast turkey ($9.99), which was very moist and tasty.  Honestly, there wasn't anything here that was life changing, but at the same time, it DID bring back happy memories of childhood Jewish holiday dinners. If you're here in Pittsburgh away from your family, and you miss your Bubbe's cooking, this would be a good place to go for a heaping helping of nostalgia. It's not the best restaurant in the 'Burgh, but if you desire True-blue-Jew-food...this is your place!  I'd probably be back to try their brunch, as I can't resist a lox & latke eggs benedict!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xHvXI-rNuk52jehqnQS0eg"
  },
  "3Z6i_JhcESl8cRntJXkvVA": {
    "date": "2/10/2018",
    "text": "I love finding really good restaurants and this is one of them. The food is delicious and the staff is great. You order off the menu on the wall, and along with your order you're granted access to the nosh table, which could be a meal in and of itself.   My husband ordered the Reuben and said it was one of the best he's ever eaten. The corned beef practically melts in your mouth. I had the up street dip and it was amazing! I was full from the nosh table so my husband ate the other half of my sandwhich and decided that THAT was the best sandwich he's ever eaten.   If you want really good, non generic meal come here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-FJeaAvhrhZcSkE5WBP8Q"
  },
  "WbEr_tAbrUlNrBDxmY0jyg": {
    "date": "10/14/2016",
    "text": "I loved this place.  I've been here about a hundred times in the last couple years.  When they recently closed for renovations, it had been well over a year since the last time I woke up at home on a Saturday and didn't go to Nu.  But when they reopened, everything had changed.  My previous review, a well-deserved 5-star celebration of one of the best menus in the city, is now but an elegiac memory that will likely haunt me for the rest of my days in Pittsburgh.  I praised the babkas, now reformulated into bread pudding or kugel like cubes that don't hold a candle to what used to be one of the best desserts I've ever had in Western Pennsylvania.  I declared the latkes an unarguably superior breakfast potato, but they too are gone, replaced by an OK potato kugel.  The Jewbano, that creative and delicious fusion sandwich I recommended to every first-timer?  Gone, along with the ability to get the smoked meat it contained.  I scanned the new chalkboard menu (which honestly isn't easy to read from some of the seats, and there's no printed alternative), looking for my favorites, only to determine one by one that they had all vanished.  The turkey?  Gone.  The matzo balls?  Gone.  The kreplach, the grown-up grilled cheese, the fantastic omelette that had become an early Saturday go-to...all gone.  By my count, the 11 strongest items on the menu had either vanished or been replaced by a far inferior substitute.  It's possible not every item is gone forever.  I was told they'd change the menu regularly and update the website and/or their Facebook page with the menu each week...though sadly, that turned out not to be True.  The website still has the old menu (dated 6 months ago), and 2 weeks after the big reopening, the Facebook page has no relevant information on what might be served on any given day.  Right now, Nu is...OK.  It's not bad.  Pretty good.  Decent.  If I had walked in for the first time this month, I'd be reasonably pleased.  But given what it was, I'm sadder to write this 3-star review than I ever have been for a 1 or a 2.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "D-_yG-XuT_-gf3six6a7mg"
  },
  "7C4twOXcOkHWL_yJJmc0uA": {
    "date": "2/1/2017",
    "text": "Best brunch ever!! 15.99 for your amazing and large entree, AND nosh assortment table.  Usually no wait.  The Nu Benny was fantastic.  Great coffee.  Soooo much good food, come hungry!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d15N-vI7s-uVStYTjL5dVw",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Nu Benny",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/d15N-vI7s-uVStYTjL5dVw/o.jpg"
      },
      {
        "img_id": "-Sz-Q4d4-90suPJmOIDLUw",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Nosh table free w entree",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-Sz-Q4d4-90suPJmOIDLUw/o.jpg"
      }
    ],
    "user_id": "WsXMA9hFxy1_C42bFl6XGA"
  },
  "F_du9iqOC995UypOxukTFw": {
    "date": "8/26/2016",
    "text": "Very good food plus it is BYOB! Located right next to Pamela's in Squirrel Hill, NU is a gem in its own regard. I had matzah ball soup that hit the spot. Generally, the food is authentic and a great place for groups to go and enjoy a meal. Parking can be a bit tricky during peak times, but a reservation is monkeying not needed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TOgL6eh0pwNfk6M6wv8vVA"
  },
  "Kqk24xpPv6FCr2wGsIFYGg": {
    "date": "8/13/2014",
    "text": "Very pleasantly surprised. I guess maybe I just didn't know what to expect either, as Jewish food is pretty foreign to me.  We sat outside in the little patio area, which is nice to watch the foot traffic go by. Started off with the latkes, which were crispy perfection, served with sour cream.  My main dish was similar to a falafel or gyro. It was wrapped in pita bread with fried eggplant and tomato and it was awesome! Again, crispy eggplant is the best, don't give me mush! The side of coleslaw was done just right. Not too much mayo, but sweetened appropriately. I'm a hard judge towards coleslaw and it passed!  The presentation was adorable too! It came on a tray with the coleslaw in a Chinese take-out carton. Service was very friendly and our bill for two people was $30. Not bad in my opinion.  I will note that the menu only offered about four main dishes and the rest are sandwiches. But a limited menu isn't always a bad thing, as I found out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "x-Z5CMTOIw0FmjEzCxxUxA": {
    "date": "7/17/2015",
    "text": "I enjoyed my first experience here... I went on a Friday at lunch and was seated immediately. The server was kind and patient while I waited for my party. The atmosphere is quiet and palatable; I prefer quiet because I don't like yelling over music or other loud people.  I was able to find a parking spot on the first pass, pay parking (and they will ticket you).   I got a Reuben with macaroni salad and matzoh. The Reuben was interesting, more cured than I'd ever had before and thusly more flavorful; a welcome change of pace, but don't expect a \"classic\" taste. The macaroni salad was blah, and the matzoh was just right, mixed with a chicken broth and breast.   My friend got the \"grown up grilled cheese\" which was a nice twist with pesto.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y1pdQpDFw5Ap5P_Ioi3JoA",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Reuben, matzoh, macaroni",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/y1pdQpDFw5Ap5P_Ioi3JoA/o.jpg"
      }
    ],
    "user_id": "cUUCMncwWZm57s95iUX1Gg"
  },
  "4nx9rPlG8bGAlMSI-dIUGQ": {
    "date": "5/14/2015",
    "text": "I'm not at all familiar with \"new Jewish cuisine\", so I don't have much to compare NU to, but I enjoyed my experience.   My friend and I sat outside and the server was very attentive. I ordered the Upstreet Dip, which seemed to be pretty popular. It was heavy, but not too greasy. The coleslaw was pretty standard. The presentation was nice- the sides are in takeout containers and the water is poured into Mason jars.   I've heard that their brunch is good- I'll have to go back to check that out!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LR4TSqMf6o4pUTy7NUoujg",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Upstreet Dip and Coleslaw",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LR4TSqMf6o4pUTy7NUoujg/o.jpg"
      }
    ],
    "user_id": "n-UaNbb9k6mE_6nOGoRZuA"
  },
  "aDTkVYBx1Ons8MaUIU67xQ": {
    "date": "7/25/2015",
    "text": "Banh mi with smoked corn beef: Sumptuous corn beef counterweighted by refreshing slaw and chopped liver. Surprising summer and afternoon-friendly.   Chocolate babka: Sumptuously sweet, ice cream just right, salt tickles",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jrN7q_kDQ4mXKDxOZkGeZA",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Banh mi with smoked corn beef; crunchy crackly fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jrN7q_kDQ4mXKDxOZkGeZA/o.jpg"
      }
    ],
    "user_id": "k6W2N8iP1GmzMxUcoTj-Ew"
  },
  "xqaNldP-6ClaIIa9e63XVw": {
    "date": "2/7/2018",
    "text": "What can you say about a place that presents as so warm and homey that you'd be comfortable just moving in!  Note though,  you have to walk through the front door to Pamela's and take a right but it makes all the sense in the world once you're in the deli. This place is unreal!  The Nosh bar simply kicks royal a**! The entree selections are not just tasteful but artistic in presentation and variety ! I opted for the good old \"rueben\" after eating them in NYC many times, the NU just made its own statement with the perfectly seasoned brisket and the presentation was plain old fashioned HEARTY! My lady ordered the Upstreet Dip and wow wee what a sandwich and side of the best horseradish ever. The chopped liver is the best I have ever eaten. Aside from NYC, this is probably the best Jewish deli I have had the pleasure, no...the honor of being a patron at. Love you folks. Keep it real as you're doing and for anyone reading this, run there...right now...even if its closed, that way you'll be first in when they open. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3_JiNmLtrdDtjMPAs4bUEA"
  },
  "7Xg1HFsZkiehSELz2_a2zg": {
    "date": "9/12/2019",
    "text": "NU has quickly become a go-to brunch spot for us because of how incredible the food and service are. I'm almost embarrassed of how often we have brunch at NU during the weekend.   My favorite dish is the LEO- lox, eggs, and caramelized onions with caper cream cheese. It's simple but divine. The NU Benny is a delightful twist on Eggs Benedict with your choice of breakfast meat and light flavorful Hollandaise. The Reuben is a hit with my partner.   The nosh bar is a delightful spread of house-made mini bagels, macaroni and cheese, greens, challah bread pudding, Israeli salad, blueberry kuchen and more. They'll also bring out liver spread for you if you're inclined.   The wait staff are great and make you feel right at home. They're speedy but don't make you feel rushed.   We've taken a preschooler, a picky eater, and a brunch snob here. Everyone was happy. There's a kids menu and you can't go wrong with the Goy--slab bacon and eggs to order.   Check out NU if you're looking to elevate your brunch. Life pro tip: it's BYOB. Bring some bubbly and make a next-level mimosa with their fresh OJ.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOt4dV5lPrug5WwhK7OpQg"
  },
  "7BjLsPwXHei-F-DBgtfZWw": {
    "date": "6/16/2019",
    "text": "Rude and inconsiderate staff. We had been coming to Pamela's next door for more than a decade and whenever it rains it is normal for people waiting in the long lines to tuck themselves under the awning of Nu's patio.   For some reason the employees on Fathers Day approached my father with an attitude. Called him bizarre and was very rude all because he wanted to stand away from the rain and be dry.  When I asked if he could just stand where he could be dry, they said, \"no, he obstructs the view of our customers.\" Meanwhile, they had no customers and nobody was on their patio.   I had eaten here before when a friend invited me and thought it was average but a nice place. But I'm never going again after how they treated my father on Father's Day.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S-pCzuWlB0BgtquZVh2GaA"
  },
  "Mhn-8u2f7hSPGxQBKpocsw": {
    "date": "3/17/2019",
    "text": "Things have changed since my last visit here. NU Jewish bistro is now only open on weekends for brunch only. Weekday hours have been eliminated. While it is still a non Kosher establishment the brunch menu is still written on the chalkboard or they will bring you a paper copy. You can still sit where ever there is space. The sign says \"seat yourself.\"  The price is pretty much fixed at $15.99 per entree. A new feature they added up front is something called a \"nosh table.\" There are some rules regarding it. First, you can't have anything off the nosh table unless you order and entree. Second, you have no choice but to order an entree unless you are coming in to have a beverage. Most of the entrees come with eggs. They do however, have their own version of corned beef and brisket if you don't want eggs.  My husband decided to order the Reuben sandwich. I went with something they call \"Nu Benny\" which is lox covered by a type of egg Benedict served open faced on an English muffin. I was told I could substitute brisket or bacon for the eggs but I decided to stick with the original order.  As we were waiting for the entree we made our way up to the \"nosh\" table. Among the items are coconut covered shrimps, potato pancake hush puppies, mac and cheese, small homemade bagels, Israeli salad, canned fruit, challah sweetened with honey and dessert minis such as chocolate chip cakes, blueberry cakes, and peanut butter cookies. I sampled some of these and for the most part these nosh items were very good. Everything comes with appropriate sauces to accompany them and you get a separate plate there to bring your choices to the table.  When we got our entrees I found my English muffin extremely difficult to cut with a knife. I asked for a sharp knife and after receiving it asked why was that muffin so difficult to cut. My waitress had no answer but just gave me the knife.  The open face was good and the lox on the salty side which is what I would expect but to have to \"work\" my way at cutting the sandwich seemed tedious to me. My husband enjoyed his Reuben and thought it was flavorful.  Nu Jewish bistro continues to share the same space as Pamela's diner in Squirrel Hill but you must head right after entering Pamela's. Restrooms are only in Pamela's which you are permitted to use as a guest of this place.  I truly miss the old concept they had when I was first here a couple of years ago. I would wish they would sell the nosh bar by itself because I found some of my better eating finds there. However, it is what it is. The nice thing about visiting on a Sunday is that city metered parking is free so that's a plus.  Located on Murray Ave near Forbes which is in the heart of the Squirrel Hill business district metered parking is available or you can use public transportation.",
    "rating": 3,
    "rated": {
      "funny": 10,
      "useful": 22,
      "cool": 20
    },
    "photos": [
      {
        "img_id": "tHe2VQO5cOi0wp4YtiQliQ",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Reuben with tiny salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tHe2VQO5cOi0wp4YtiQliQ/o.jpg"
      },
      {
        "img_id": "nHFGyt-U8wx4M58QPCAtww",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Nu Benny with eggs Benedict, lox, holandaise sauce and small salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nHFGyt-U8wx4M58QPCAtww/o.jpg"
      },
      {
        "img_id": "aAzDlk8GH8dqS6xium7eTA",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Coconut shrimp, potato pancake rounds, and homemade bagels in foreground",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aAzDlk8GH8dqS6xium7eTA/o.jpg"
      }
    ],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "d7wCUxXTBoeySZfEMhDoBw": {
    "date": "1/29/2019",
    "text": "WOW! I'm a little sad that this place doesn't get nearly as much business as Pamela's which is right next door. Luckily, they are the same owners. From my understanding, the person that makes the food at NU is Pamela's sister.   The food is great! The menu is written on a huge chalkboard and is filled with both vegetarian options and also meat options. Although this place is a Jewish restaurant, there are options for non-kosher diners such as bacon! The entree was honestly my least favorite part of the meal. I got the veggie hash and it was tasty. The food was fresh, crispy and full of flavors and textures. I think I was just too excited about the nosh and nibbles table. The table was packed with little bagel bites (both regular and everything), bagel chips, fresh chopped fruit, coconut shrimp, kugels   The staff here is so welcoming and accommodating. My water was replenished without me having to ask. The staff also seemed to genuinely care if my meal was good we also had a conversation about other restaurants. I felt extremely welcomed here and I honestly can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Cr0y1ggWNszpw_vR8A4XMg",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Veggie hash",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Cr0y1ggWNszpw_vR8A4XMg/o.jpg"
      }
    ],
    "user_id": "ikSOnLqwLxInoBeiRguuqQ"
  },
  "JcatgVWt8ICpPtUvdABHlg": {
    "date": "1/27/2019",
    "text": "I have passed NU plenty of times but never tried it. I am so glad my friend and I decided to give it a try today!  We went for the weekend brunch. I love their brunch model: you pay about 16 dollars and you get an entree and access to the \"nosh and nibble table\"-what a cute name-, which is essentially a sides buffet.   While our waitress was getting our was getting our drink orders another staff person came over to talk to us. She was super friendly and informative. She told us that NU is actually owned by Pamela's and that Pamela's sister is actually the cook; how cool! Also NU makes almost everything in house and from scratch. She also gave us some suggestions for ordering and informed us that you could substitute bacon or brisket for the Eggs Benedict.  I decided to take her suggestion and I ordered the NU Benny with bacon instead of lox. It was delicious! The sauce was perfect and the English muffin it was served on was crisp and did not get soggy.  The side bar was amazing! Prefect snacking sizes. You must try the latke hush puppies and the mini bagels.  I was throughly impressed with NU. The staff was wonderful and the would was high quality and scrumptious. I can't wait to go back and try their other dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ilUaYsYAkpnGZRI7-khfAQ",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. NU Benny with bacon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ilUaYsYAkpnGZRI7-khfAQ/o.jpg"
      },
      {
        "img_id": "9n9w5yNMg3rXahs_Xtsttg",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Desserts from the nosh table",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9n9w5yNMg3rXahs_Xtsttg/o.jpg"
      }
    ],
    "user_id": "HzCQo7SVZe8mWC7t72DKNg"
  },
  "Wnp15iUkGKk6-a7vUWOEcQ": {
    "date": "5/2/2019",
    "text": "This restaurant has to be one of Pittsburgh's best kept Brunch secrets - located right next door to one of Pittsburgh's most prominent Brunch locals - for which is there is constantly a wait. You get to just walk right in to Nu and have the best, most unique brunch experience.  There is  basic buffet fare that works for picky kids but also really interesting entree choices.  My favorite is the veggie hashbrowns with eggs. The coconut shrimp is excellent as are the hushpuppies.   There is definitely satisfaction walking right through the \"others\" waiting for a table and sitting down to a fantastic brunch with fresh coffee and great service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wQuwn2f2DI40Qsmw7nIVsA"
  },
  "7VhEa5elkI8HbA6n-rBvoQ": {
    "date": "1/30/2018",
    "text": "Stopped in for brunch one day while going through Squirrel Hill. For their weekend brunch, they offer a selection of menu items and an accompanying \"Nosh Table\" buffet style. Between the two of us, we went for the steak and eggs and smoked salmon entree selections. The steak and eggs were a delicious combo and I appreciated the accompanying salad. The eggs were over easy the way I ordered, so I appreciated that! The smoked salmon dish had great flavor as well.   The mosh table offered managers tasty looking sides: Mac & cheese, olives, stewed greens, soup, and more. Even though everything on one plate didn't *quite* look like a great mix, it was very tasty. On the sweet side, they had brownie bites, warm bread pudding, and small fruit tarts.   All of this + coffee to wash it down made for a really nice brunch!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qCB06BLK0qyNI5q7KdCILQ",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qCB06BLK0qyNI5q7KdCILQ/o.jpg"
      }
    ],
    "user_id": "MoFYvOoufOMyVTmUFAhRxQ"
  },
  "iFdJuQHHAOorKY-8A68vzw": {
    "date": "3/20/2019",
    "text": "I went here with a vegetarian friend (I am not vegetarian) and we were both super happy with our meals! The nosh table is honestly a great idea. I'm a mom now and I wish EVERY restaurant allowed you to grab some food to graze on before the main meal got there. Quite a gem right next to Pamela's!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oL8RzMJFgrgahm8Ew2QeMQ"
  },
  "LIBxVKT_bsSAgVnx9DOhYw": {
    "date": "12/2/2017",
    "text": "I want to eat brunch here every. single. day. until I die.   No joke: best brunch I have ever had!  I got the Eggs Benny with lox which was absolutely delicious and perfectly made. I hit up the nosh bar, which are little items you get free with any entree purchase and as much as you want (it is self serve/buffet style). I got hush puppies, mac and cheese, a blueberry walnut square and mango peach pie. Everything was sooooooo good!  This is going to be my go-to place for brunch whenever I am in Pittsburgh now! Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "5OgV-1KpLRNQwcwM5ywP_w",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. love this sign in here - the place is filled with cheeky signs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5OgV-1KpLRNQwcwM5ywP_w/o.jpg"
      },
      {
        "img_id": "fxXMSS512iJZjoyhMmMUdA",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. full menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fxXMSS512iJZjoyhMmMUdA/o.jpg"
      },
      {
        "img_id": "HKHjLwV5qS4Xz8TnO3vjpg",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. fresh squeezed oj- sooo good and has a bit of shaved ice on top nice and cold",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HKHjLwV5qS4Xz8TnO3vjpg/o.jpg"
      }
    ],
    "user_id": "s1hZZMkaWCql09X-cGUQEQ"
  },
  "DW71IInb7pMnDo561XM0RQ": {
    "date": "4/29/2019",
    "text": "This place was definitely NOT worth it. This is the classic example of a restaurant doing hipster instagrammable food at a ridiculous upcharge. $16 gets you a small entree and access to a \"Nosh Table.\" Our entrees were small and very poorly constructed, though very photogenic, sandwiches with a wad of meat in the middle of the bread and none by the crusts. They came with a side of literally 3 leaves of salad mix and a halved grape tomato. The sandwiches tasted fine but I've had significantly better sandwiches for half the price. The Nosh Table is an interesting concept, but it was definitely not worth the upcharge for the quality and taste.   Overall, pass on this place. You can get better food at much better prices elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HuM3US9oH0uKQWiXVbpsew"
  },
  "duvcT5yTLinGGte50yCaqw": {
    "date": "3/31/2019",
    "text": "Highly recommend this brunch spot! Great food, fast service, and friendly staff. The LEO (scrambled eggs and lox) was exactly what I needed on a Sunday afternoon. My boyfriend got the brisket and eggs, which was delicious too. There are many yummy offerings at the nosh table (all you can eat, included with the purchase of an entire). The house made bagels are superb -  very soft and plush.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rL7Lmn7cQUVq_9mOWGbv4A"
  },
  "bLY5zbWCN-xKYCjsbu9-IQ": {
    "date": "1/26/2018",
    "text": "Looking for a new spot to brunch? Put NU Jewish Bistro in Squirrel Hill on your list and here's why:  1. With the purchase of a brunch entree, you gain access to a NOSH bar that includes varying bites such as latke puppies, challah bread pudding, corned beef and cabbage soup and lots of other nibbles. 2. Lox, brisket, 15-day corned beef and bagels are all made in house. 3. The joint is BYOB with no corkage fee, so hit the Murray Ave. wine and spirits beforehand. 4. It's only open on the weekends from 10-4!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "BwdjD19LYjROZgHEtLXTvg",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BwdjD19LYjROZgHEtLXTvg/o.jpg"
      },
      {
        "img_id": "b8h595juXFuBxV_F0AzVJA",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b8h595juXFuBxV_F0AzVJA/o.jpg"
      }
    ],
    "user_id": "f0GGP6FbClG3PNFLEz_-Gg"
  },
  "sICii2NMDXuK5li9VtK-RA": {
    "date": "4/23/2017",
    "text": "I really don't get why NU Jewish Bistro has plenty of seats during brunch time while there is a one hour wait at next door Pamela's. Maybe it's because it's not clear how to get into this little cafe (you have to walk through the front door to Pamela's and take a right), but it's so weird to me. I really like this place since brunch here is pretty good and you don't wait!   My favorite part is the nosh board up by the window. For brunch, you can start off right away with some yummy bites, like latke hush puppies, coconut shrimp, challah bread pudding, and chopped liver. It's all part of brunch and you just pick an entree - like brisket and eggs, or lox scrambled eggs. I've also been here for lunch and the sandwiches are great. The service is pretty quick and friendly to boot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "2Gq7QBpdngHlnQrUdcCFGg",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Brunch - L.E.O: house cured lox, carmelized onions, scrambled eggs",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2Gq7QBpdngHlnQrUdcCFGg/o.jpg"
      }
    ],
    "user_id": "OQBMu7x0V4Oz3iFv3x0i5Q"
  },
  "GjGKIHebVOfnUoKF8U9uHg": {
    "date": "2/2/2019",
    "text": "I had the veggie hash and it was delicious! Good coffee and made from scratch items. Also the staff was extremely polite and helpful. Would recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g0KrYOESVuVlwFDwaWgMHQ"
  },
  "-Mpl4ScliCiLZSAoH4UASw": {
    "date": "4/21/2018",
    "text": "One of the hidden gems of Pittsburgh! It only has weekend hours and it shares an entryway with Pamela's diner so it's often overlooked but it's a great place to grab brunch without having to bother with lines. The place is never more than half full when we go so the waiters are responsive and the place is easy to talk in.  Food: EVERYTHING is good at NU Jewish bistro. You get access to their nosh table when you order an entree which is literally a buffet of homemade baked goods and finger foods. What is amazing is the detail spent on each of the dishes. You see mini bagels and think 'whatevs' but they are some of the best plain bagels I've had and pair well with their homemade jams. The coconut shrimp, latkes hush puppies, mac n cheese, corn muffins and kuchen cake are all very well-executed and let you pick between sweet and savory options depending on your mood. I highly recommend trying stuff you normally wouldn't try because even the simple stuff is amazing. As for entrees, I consistently find myself getting the Reuben with extra kraut because it's just superb. The non-marbled rye is not overpowering and always toasted and buttered to perfection. The corned beef is very flavorful and comes out warm, tender, and slightly caramelized. Unlike smallman deli, their russian dressing isn't sweet and is just creamy and tangy which I prefer. We've had the brisket and eggs which is a little simpler, just slab of tender and savory brisket and eggs as described. The same delicious brisket is featured in their dip sandwich however I found the horseradish cream sauce too heavy and overpowering to have regularly. The shakshuka and benny options are nice well-rounded dishes but definitely on the lighter side.  Overall NU Jewish bistro is a great place to try if you've never been or if you want a chef-quality brunch without the brunch crowd. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "yyGp1_3i_zhfpBVIY4Xaww"
  },
  "V9Hesq93KjKkKUJ8EjUAXQ": {
    "date": "9/25/2017",
    "text": "People need to eat here! I ate brunch on a Saturday morning, and there miraculously was space (which is important especially since Pamela's is next door and always SO crowded)! I snapchatted my food and at least 5 people asked where I was... so it's not too well known in my circle at least, but definitely should be!!   FOOD If you get an entree, all of which are $15.99, it comes with unlimited access to the nosh table aka the brunch buffet table of delicious Jewish snacking foods, brunch items, sauces, desserts. I had the shakshuka, which was perfectly seasoned and chunky with basted eggs and mamaliga corn bread. My friend had eggs benedict and portions were so big (alongside the nosh table) we both had enough left over to bag and takeout after!   SERVICE Amazing. As an example: when I ordered, the waitress asked if I'd be okay with the spice level of my shakshuka and brought out a tiny ramekin with the shakshuka so I could sample it!! She refilled water regularly and talked to us about our day. I'm won over omg.   Just go eat here if you haven't already.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "IZtRfzjKTvxoh6y00ESYFw",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. LEO",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IZtRfzjKTvxoh6y00ESYFw/o.jpg"
      },
      {
        "img_id": "tKiyTIcxDD8716miJaLWlQ",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Nosh table is the best",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tKiyTIcxDD8716miJaLWlQ/o.jpg"
      },
      {
        "img_id": "hP5y_jFzZwfLhYX-FvclMg",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Shakshuka below, Nu benny above. And our first plate of nosh table yummies!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hP5y_jFzZwfLhYX-FvclMg/o.jpg"
      }
    ],
    "user_id": "hwpNR2qUDMbyRmhfPnCGyQ"
  },
  "ywapaOEtAqvxaAftEjJ26Q": {
    "date": "11/11/2016",
    "text": "Oh it's definitely a hidden gem! I don't understand why it's not as packed as it should be. My friends and I came here for brunch. The way it works is that you order an entree for ~$16 and have unlimited access to the appetizer table. You can actually just fill up your belly from the appetizer table and then take your entree to go (hint hint).   I ordered the brisket and eggs plate for the entree. The brisket was a tad dry, but the unlimited appetizers made up for it. So lets talk about this appetizer buffet. There's savory finger food, like coconut shrimp. Omgsh the \"chopped liver\" (looks like pate) with some toasted baguette was absolutely phenomenal. I can probably eat that stuff all day, every day. There's also an abundance of desserts to choose from too. Remember, this is ALL YOU CAN EAT appetizers (and desserts) buffet with the purchase of an entree.   Now I know, Jewish food is so unique and delicious! I highly recommend this place for brunch if you have a big appetite and want to try something different. I'm drooling just thinking about that chopped liver pate on top of a crispy slice of toasted baguette. Yummmmm.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "otOUtGOEbetdwSthcgSP0A",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Brisket and eggs",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/otOUtGOEbetdwSthcgSP0A/o.jpg"
      }
    ],
    "user_id": "H_09-Wr5JcN5hpp5RnSLTA"
  },
  "g8KUv5IBulpwc5f7Zjgcdw": {
    "date": "9/23/2017",
    "text": "We decided to check out NU Jewish Bistro on a whim in Squirrel Hill. For the money spent, it is by far one of the best experiences in Pittsburgh. The menu is always the same but the Nosh table changes periodically.  I had the Brisket and Eggs. The brisket was nice and tender. Not dry at all. Very tasty. My eggs were cooked over medium perfectly. When that yolk broke, it ran everywhere. Just the way I like!   She had the NU Benedict, and while I don't care for hollandaise, it was absolutely beautiful. The eggs were cooked perfectly. The corned beef which was include was by far some of the best corned beef I'd ever tasted. Salty and shaved paper thin!   I can't even begin to describe the Nosh Table, however a meal could be made of it in and of itself if you choose to take your entree home. It was excellent.  I regret not taking a photo of the table for Yelp! But I will the next time we go and go we shall.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rPnKDpBS7TFsaXxg9iYo9g",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. Brisket &amp;amp; Eggs over Medium.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rPnKDpBS7TFsaXxg9iYo9g/o.jpg"
      },
      {
        "img_id": "Pv2AVMeYVLr1HxVT-_LQFA",
        "caption": "Photo of NU Jewish Bistro - Pittsburgh, PA, United States. NuBenny with Corned Beef",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Pv2AVMeYVLr1HxVT-_LQFA/o.jpg"
      }
    ],
    "user_id": "CtTgK-Crw3bKw3tEiRfINw"
  },
  "VtT07rNhE4bKVz9QgNUsTw": {
    "date": "8/11/2018",
    "text": "Hands down the best brunch I ate in a long long time. The veggie hash is simply sublime. I cannot day enough good things about the place, I just wish it was open during the week too. We were there today and the place wasn't full which I simply don't understand why. The concept is that you order a main dish (huge!) and then you can get the sides you want from the buffet table. The bagels are so good, ressembling Montreal style bagels (the only True good ones ;) ). The service was also excellent. This will be our regular brunch spot. Just go and enjoy the veggie hash!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "gXa1HYlzq63Y3AF8X2Qj0w"
  },
  "4LTA1v2l7JG-fhujFw6uAA": {
    "date": "4/27/2019",
    "text": "The people of this city are seriously sleeping on this place, and it's criminal. This is my absolute favorite brunch spot. There is something here for everyone from meat lover to vegetarians. They are BYOB with NO CORKING FEE which is so hard to come by in Pittsburgh. And don't forget the gnash table that has delicious latke puppies and house made desserts! Service is always so quick, even when it's a bit more crowded we're always in and out in no more than 30 minutes. So the next time you have to wait an hour for a table at Pamela's, just hop in right next door and have the best meal Squirrel Hill can offer you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-qYV3m8aWkfXocmbu-krsA"
  },
  "iXph-4CX95TfNA_HYwlaxA": {
    "date": "11/12/2015",
    "text": "I really liked this place for lunch.  Went with another couple and we mixed up the order so we could all taste different things.  The Jewbano was really good and all the meats were cured in house.  Great attention to detail with everything.  It isn't the absurd portions you find in NYC deli's but I don't think that is the angle they are going after.  Just good quality sandwiches in a nice location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WXdt0CMbwpF6gSYjigvz2g"
  },
  "C3ah30KYaQ6jHanBgnIG-g": {
    "date": "10/1/2016",
    "text": "Had an amazing brunch this morning at NU. Let me begin by telling you I love brunch and have eaten at probably every brunch in Pittsburgh, the best many times. This by far was my favorite and let me tell you why.  In addition to eight main courses, there is this homey little buffet with amazing things on it.  Before i get to the main courses, let me talk about the service (excellent) and the buffet of \" noshes\". Wow-  this amazing potato kugel, chopped liver to die for, bagels, many different spreads, fresh fruit salad, biscuits, bannana bread, pumpkin noodle kugel, this chocolate babka bread pudding and this buttery jam torte. I am sure i forgot a few things and the spread may change from week to week, but between the two of us, we tried most of it and it knocked our socks off. You help yourself to the table and then you choose one of eight entrees. I had shashuka, this spicy tomato stew with onions and a fried mush topped with two perfectly poached eggs. It was spicy, but not excessively so, and i could not have enjoyed it more. My friend had the house made lox scrambled with carmelized onions and eggs. This was topped with a ball of insanely great cream cheese, lemon and capers.  I was glad to see they kept the montreal smoked brisket and there were two choices, maybe three, that had that. There was a bacon and eggs choice and a vegetarian choice, and a few others. The best part was the entire meal was under $20 per person, and the portions were so big, i'm having shashuka for dinner again tonight. Cant wait to go back next weekend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yS-bz9wVCMPv6LuZ_VzHWw"
  },
  "GcPP_sMUFkP4qHEv8UoBGA": {
    "date": "4/4/2015",
    "text": "Tthis place really stands out. We had the latkes, the chicken soup with matzoh ball, the brisket with challah bread sandwich, among others. All great. Nice service. If you're in town get out to Squirrel Hill!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jvpWqjEuPW0auB8nUU4yPA"
  },
  "eOVhgwSLc0J0Xf7LMdqSDA": {
    "date": "9/6/2014",
    "text": "they have chicken soup with matzo (matzah whateva) balls and other beauties :,) jewish penicillin. go here now.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ozO-5ZxPT07pXyCdxRFhug"
  },
  "3MPCrS7O1D6FG7lt2LnM5A": {
    "date": "5/29/2015",
    "text": "Absolutely wonderful. Service was excellent. I shared the Sabich and the Bahn Mi, both of which were perfectly delicious in their own way. The jalepenos on the Bahn MI gave it a kick but not overwhelmingly spicy. I can't wait to go back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EESwR_EtSNDaWoo8Zv6itQ"
  },
  "H8vOGh-VBbGaLS0ETuj2SA": {
    "date": "10/31/2013",
    "text": "This is a very good place. Barley soup, pickles, and Mandelbrot were excellent. Sandwiches were also good. Definitely coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "qTdtffs04bwWRnvRgPsH6Q"
  },
  "IohtRfVQ4LlwKAtM6zcdkQ": {
    "date": "7/9/2015",
    "text": "This was my second visit to NU. I recommended it to several co-workers. We ordered take out corned beef sandwiches. To begin, we were the only people there, our order took twenty minutes to prepare 3 corned beef sandwiches. The corned beef sandwiches are on the pricey side, $10.00 a sandwich (no sides). The corned beef had so much fat on it, it was difficult to eat. I was embarrassed that I suggested this place, as my co-workers stated the sandwiches had too much fat. We were disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_q66bYm_IkaI-kLVEnj0MA"
  },
  "i2RJlqf8L_lS0Q57u_QGGQ": {
    "date": "5/10/2014",
    "text": "I went here last night with my wife for the first time.  I've had one facsimile of Montreal smoked meat before...at the Mile End Deli in Brooklyn, NY (twice) and it was close but no cigar.  I think Nu actually nails it..a delicious, nicely stacked smoked meat sandwich, not too moist, not too dry, taste is right on.  My wife ordered a brisket sandwich..a little less thrilled only because it tasted like her homemade brisket (and her mother's brisket before her).  I understand that Nu is not trying to be your traditional NY style Jewish deli but I think that staples like knishes and hand cut fries should be on the menu.  Their only presence was in a knish-based sandwich and poutine.  Luckily the server supplied a serving of shoestring fries, not a great substitute but OK.   BTW, the cole slaw is excellent and served in a chinese takeout container, cute.  I would come back and get the smoked meat in a heartbeat.  Pleasant surprise in Squirrel Hill.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B4EdMKFO3SF6qGyFfpSyhA"
  },
  "mAA27zTTAxXvFDJsEpV7_g": {
    "date": "9/19/2014",
    "text": "I've been here twice and both times the food and service were great. As a vegetarian i didn't find a ton of options, but I really loved the Sabich sandwich, a soft pita filled with fried eggplant, beets, and other treats. I love how the food is served on a cafeteria tray over paper with little Chinese take-out boxes for the sides! Speaking of sides: delicious! Best pickle and coleslaw I've had in a while. Their challah makes phenomenal toast. Real deli food at its best!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0zEZj6jzK24NGf1-mdJsLw"
  },
  "s5UBoxO23GlEQ9UQ_YlY8g": {
    "date": "5/3/2014",
    "text": "Has the best, tenderest brisket sandwich I've had in many, many years. Right up there with the top New York City quality, and that's saying a lot. Everything else so far was very good, too. Also a nice comfortable space.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Say9Q97UULrUiNG06d0cWQ"
  },
  "SaZOnhlFJ1Vbyut6kHwp-A": {
    "date": "4/13/2014",
    "text": "Seeing as it was a Peruvian restaurant just a few years ago, I didn't expect too much authenticity. The chef however tried really hard, and many of the meals were fairly close. The desserts were especially good. Probably brought me closer to a heart attack by about 5 years, however.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HLcRFqliAp_h7j8UwrifRA"
  },
  "nIZWjNM8lUJ-Zsl-4CqDfg": {
    "date": "3/29/2014",
    "text": "I went to Nu tonight with my husband and it was excellent. We needed to eat quick to get to a movie, and the service could NOT have been better. The highlight was that we ordered the reuben and it was amazing. I will definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a_tIaNF2OSVvI5gpVDKdhA"
  },
  "rLwzE_hoUIe3ir9eFMUS8Q": {
    "date": "11/13/2013",
    "text": "Decided to try Nu for lunch as we had seen it written up in the Chronicle, always nice to support local businesses.  Nu is located right next to Pamela's, apparently where their other restaurant had been.  It is a long narrow space, tables close to each other,  with the open kitchen in the back.  After seating ourselves, we got down to studying the menu.  It had the usual \"Jewish-y\" described items,but all with a updated description.    It is not particularly on the healthy side or much for vegetarians.  My friend and I decided to order several things and share.  We each got the chicken soup with a (hard) matzo ball.  It was OK, fortunately not over salted. We shared the chicken liver, which was  done as a pate in a glass jar and it was very good served with rye toast.  We got the brisket sandwich which I felt was underwhelming.  It is served open face on soft white bread that got quite mushy, not a lot of meat and some gravy.  It comes with a side of cole slaw in a \"take out\" container.  I did see a couple sandwiches come out and they were not overstuffed as you usually see in a deli.  The food is served on small metal paper lined trays which took up the whole tables.  I would prefer dishes.....just saying....since you asked....not sure if I will come back here .",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "NcdAGcNzTWt6RZ39AYKA-A"
  }
}