{
  "UiImT_DE5q-MhB12vu0xUw": {
    "date": "1/17/2008",
    "text": "Probably the most authentic chinese food you can find in Pittsburgh. My menu favs include: Pork and Preserved Egg Congee, Cold Chicken, and young pea sprouts.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Um2iec4NKMXVpJEME3PfKg"
  },
  "59DbnCNFvN80Cc7_z17KZg": {
    "date": "11/13/2008",
    "text": "Extremely authentic. The Shanghai baby bok choi tasted just like the bok choi I ate in Shanghai. The also have a good steamed fish and one should not pass up the cold chicken. I can't stand most Chinese restaurants as they all have sweet sauce and too many vegetables for my liking. However, I'll go to Ka Mei 6 days a week as they have a large menu and the food is the most  authentic Chinese in Pittsburgh and their prices are reasonable too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zaNUeZZ-Xm21o3fZ0CUbXA"
  },
  "POIzrzxus87B-asUzb9cpw": {
    "date": "11/27/2011",
    "text": "One of my favorite Chinese restaurant in Pittsburgh. As the name indicates, the dishes tastes like \"home\"! Try it if you wonder what REAL Chinese foods are like (ask for Chinese-version menu tho)!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AyhF9VDkrReBv_cO-oI-JA"
  },
  "NecLT1S1J-HpFMvS4BLzGQ": {
    "date": "4/22/2011",
    "text": "Always excellent each time I go.  Ka Mei is the epitome of a great mom and pop shop.  The husband is the cook and the wife is the host/waitress.  The restaurant has very basic decor but VERY cozy.  My family and I ordered the pigs feet, black pepper tofu, pan friend noodles vegetarian style, and salt and pepper squid.  The portions were generous and the flavors were just right ;balanced without being overly salty or greasy (which is hard when trying to get that \"wok\" fire taste).  They accidentally made the vegetarian noodles with chicken, but the owner was so nice and apologetic about the situation, she quickly had another order made and didn't charge us.  Even my picky Asian parents approved which is huge!  Definitely a great find in Pittsburgh.  Plus it's a BYOB.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DoINRSXLGdZLYEKxs0gOPA"
  },
  "lkZqoCr_ojwR4LNMeEtZ4g": {
    "date": "8/30/2011",
    "text": "Amazing food. Juicy chicken. Won ton soup is so tasty. Cute lady that runs the place may seem a  little rough around the edges but she's the sweetest thing !!!! prices are SO reasonable. Def try this place !!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gEgMvPcYApzONlqQFhk_mQ"
  },
  "fimQhvfazHFkXl658TegLQ": {
    "date": "12/21/2006",
    "text": "The food was quite good on my first visit and it is great to see more places with a traditional Hong Kong menu to order from.  What it lacks in interior design it made up for in quality of the dishes.  Definitely worth a check out and located in a convenient spot for the academics.  The fotos of the food in the entry are pretty helpful too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mg3fvJ2FV-6CL4z8NOcoQQ"
  },
  "Z-7o2_bow9eYBVb-stAwLQ": {
    "date": "8/5/2008",
    "text": "The name translates to \"Home Taste\" which is definitely is. Authentic Cantonese comfort food from anyone used to living near a Chinatown.   There are appetizing pictures of many dishes in the entry way to help you choose if you don't know real.  Don't let that put you off.  The pictures are helpful for choosing dishes with Chinese vegetables.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "w0UusgNXowtiRsGotkA-rg"
  },
  "AaEHIFoYHwmrG5NI9arIeA": {
    "date": "10/29/2008",
    "text": "Will definitely be coming back, if only because they actually serve congee.  For real, honest to goodness congee.  Not watered down congee, or overly thick congee.  Just right. (although, they could have cut up the preserved egg a little more).  Pea shoots were a little over salted, but those are so delicious that I don't care how I get it.  We also had gong chao ngo ho (that's beef with wide noodles), which was good, but the sauce was a little on the sweet side.  Too bad that they don't have fresh roast Chinese meats.  But whatever.  A real Cantonese restaurant that I can come to whenever I'm feeling a craving!  Now THAT'S something to be happy about.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ckMFtaljrmXWaSiQqk9ZWA"
  },
  "wDO_fcUyC2zBjATK3sXIAg": {
    "date": "4/10/2011",
    "text": "Okay, I'm upgrading them to 5 stars.  Wait? What? Wasn't your review already 5 stars? you say.  Yeah, but that was 4 stars plus a bonus star for being in Pittsburgh. This new review is a bona fide 5 stars.  I had this incredible 5-star dinner there:  Bone-in roast duck was the Most Delicious Roast Duck Ever! The skin was crispy, the meat was moist and tasty.  The chinese broccoli was yummy and al dente.  And she even corrects my horrible Cantonese for free!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "k_seSrhHW-vjB-W3Vh-XEw"
  },
  "J8BXtLkLoKMAw7kFjMhWjQ": {
    "date": "3/5/2009",
    "text": "Tipped off by the Yelp reviewers about its pork & thousand-year-old egg congee, I rushed to sample it.  A well made bowl of congee is my ideal comfort food, especially since we're having this interminable winter.  And my conclusion? Well... maybe my expectation was too high.  I thought it a bit too much on the thin and watery side.  And since they charge $7 for it, I don't think it's unreasonable to expect a bit more pork as well.    A basic congee is not hard to make. Any proud owner of a Japanese fuzzy logic rice cooker can do it at home. What I miss, though, is that full bodied richness that comes from a balanced mix of the piping hot porridge, the slippery preserved eggs and the flavorful pork bits. I don't have the knack to get the balance right, but apparently, neither does Ka Mei. Still, the next time I'm down with a cold, I'll be forking over my $7 for another bowl.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tGx9-4LpdahotPuNuVfNVQ"
  },
  "WACRIz25E0488sPszPsoMA": {
    "date": "7/21/2011",
    "text": "Of all the Chinese cantonese food places in Pittsburgh, I think this must be the most authentic. Their food is just like the food from Hong Kong but more of a homemade flavor.  If you want actual Cantonese style food, definitely come here if you are homesick. The lady is really nice and speaks fluent Cantonese. Is not a fancy restaurant but feels homey and the food is probably what your mom cooks at home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QWSiTs6VS6BDraj-j9huAg"
  },
  "iWd9v8hnMBkE0wUV-zo3xQ": {
    "date": "5/23/2011",
    "text": "This restaurant was challenging to my western tastes. I had the pork and preserved egg congee, and I also sampled the chicken with bitter melon.   The preserved egg was a little odd (never had such a thing before) but quite good; the pork was delicious; and the congee was a bit bland, but not bad. (NB: I don't know what a \"typical\" congee is supposed to taste like, so I'm not sure whether they're supposed to be relatively bland or not.)   For the chicken with bitter melon, the chicken tasted fairly typical of a Chinese restaurant, but the bits of ginger were a surprise. The bitter melon was overpowering to my tastes- I had several pieces, but couldn't acclimate to it. I can't really justify docking any stars for that, though, since these were brand new tastes for me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "lv52Tt5labpxJELNZPCRCQ"
  },
  "ywqcSIz6wAQGO8DlNRCXOA": {
    "date": "2/15/2012",
    "text": "I love this place. Try ordering from the authentic, \"Hong Kong style\" menu.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0e0lpEGQNDw4lBR7a51Tfg"
  },
  "pEN0fwYkEYs8IZnbwszoYw": {
    "date": "12/1/2015",
    "text": "Food is actually not bad here. Reminds me of home-style food in Hong Kong. The main problem is that the owner is a bit nosy. Once she realized that I spoke Cantonese she proceeded to ask me when I immigrated to the United States (I answered), whom I came with (I answered) , how come my father didn't come with us (...), and were my parents divorced and that's why my father didn't come with us (I didn't answer. I just had that blank look). I am a 30+ year old woman, so it's a bit weird to have a stranger asking about my family background. It's a lot more information than I would like to share considering that I just wanted some lunch. I agree with another reviewer that she did not treat her servers very well. On one occasion, she yelled at the server for working too slowly in front of other customers, and we were a bit uncomfortable with that scene. Other than that, the food is fine. I would recommend takeouts to minimize interactions, haha.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mdm0j0rpqR9-7kqG1Ltlxg"
  },
  "lTiEwTJBb5lXfQUeVuqgTg": {
    "date": "7/9/2011",
    "text": "Okay the best way for me to gauge if I want to enter an Asian establishment  is if the clientele is Asian. Ka Mei definitely is often packed with Chinese customers.   There are two different menus: one that is more conventional Chinese and another that is more specifically Cantonese/Hong Kong style. The great thing is, the food here is \"authentic\", which I think is important for me since I can cook inauthentic Chinese style food at home. Or if need be, I can go to a mall food court and get \"Chinese\" food. The distinction is important, bec. the Americanized Chinese food is usually deep fried and heavily sauced.   At any rate, the food here is good. I won't say it's the best Chinese food I've had, but for Pittsburgh I would say it comes closest to authentic Chinese restaurants in other cities with larger Chinese communities.   BTW, congee is supposed to be bland. It's often times what you feed people when they are sick. It would be considered an Asian \"comfort\" food. And you add soy sauce and other seasonings to your taste.  Unlike other reviewers, I wouldn't recommend the cold chicken, I don't think they do it that well. The congee is okay. If you don't feel like taking a risk, the beef chow fan is always good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DAq3opyxg1TKaqS267nLdQ"
  },
  "T4WZL9PlaRYhlTwcJz6roQ": {
    "date": "1/12/2011",
    "text": "Excellent Cantonese food and very authentic.  However a couple of things to remember before you visist: one bring cash because they don't accept credit/debit cards; two have plenty of time because the service is very slow. Actually I don't think there is service, you just order what you want at the and then wait and wait and wait with the woman behind the cash register looks at you like you owe her a hundred bucks. The only reason people are putting up with this is because their food is sooooo good.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jbLRWTg2MvMuwWdiS4NgDw"
  },
  "p2eJqFmtvu4cmL7NgIFNiA": {
    "date": "10/17/2009",
    "text": "I wanted to look for more authentic Chinese restaurants in Pittsburgh and when someone recommended Ka Mei to me, a Hong Kong styled cuisine, I figured I should give it a try. The nice thing is that they have pictures of almost all their dishes plastered up on the wall if we wanted some visual idea of what we were to order and there's Chinese on their menu too. The owner also speaks both Cantonese and Mandarin. Unfortunately, when we went on a Friday night, the place was horribly understaffed with only one cook (most likely the owner) and one waiter. And since they serve on a table-by-table process, the food for us, a party of 8 took almost an hour to completely arrive. At least we had tea to keep our stomachs from growling too loudly.  Once the food arrived, I guess I expected more authentic Chinese cooking. The beef and chicken was steamed and looked like one of the healthy options you would choose off a separate menu. They had a nice variety of Chinese styled vegetables though and a very wide Asian drink selection. My regret is that I should have looked at some of the pictures before ordering because some of the dishes were surprisingly simple. Such as the shrimp & eggs for $10, which was literally a couple of shrimps put inside an egg omelet. I'm not quite sure how authentic that is...  The decor was simple. There were just a couple of tables for sit-down eating and only two tables that could accommodate large parties of either 6 or 8. It is also BYOB which I didn't discover until another party brought in a couple bottles of wine. I'm not sure what the corkage fee is though, if there is any.  The establishment is CASH ONLY and there's also a public parking lot with quartered meters behind the restaurant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f7aDuNxDbDgOBUv24LNRyQ"
  },
  "Te5mFev34mo-9skP940aDg": {
    "date": "6/16/2009",
    "text": "I was a little skeptical when friends who haven't left the US assured me that Ka Mei was very authentic.  I mean, how would you know firsthand?  But I took my (partly Cantonese) parents here when they came to visit me in Pittsburgh, and the squid that my mom ordered was in huge chunks.  She and I were both terrified because it still looked alive, and we're not into looking at food that looks like it's looking at you.  My dad said it was delicious, though.  The service can be awkward -- we had a fobby waitress who talked loudly and was nosy about asking how the customers were enjoying their dishes.  I liked it (doesn't it add to the atmosphere?) but you might not.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6DbvYyAvTtXTmVOAG32Djw"
  },
  "ilGr09NQ-UQ40Ds8JiQ0ag": {
    "date": "12/26/2012",
    "text": "Had takeout from here recently and it certainly didn't live up to expectations based on other reviews I had seen. The food started out well as the soups were quite good. The hot & sour soup was fairly spicy and is a good deal. The wonton soup was also tasty with a flavorful broth and big wontons. The egg rolls were decent but not too crispy. The crab rangoons were pretty bland and boring and all you can taste is the cream cheese. The big problem was the quality of the entrees. Maybe we made a mistake with what we ordered but we didn't have a single decent entree. The chicken in garlic sauce didn't taste like garlic at all. All we could taste was a mild ginger flavor. The General Tso's chicken had a standard sauce and the pieces of chicken were big but the soggy breading was unsightly and I had to peel it off. The Kung Pao chicken tasted like spicy chicken soup. And last but not least, the beef with broccoli had no flavor whatsoever. All in all, a sad experience and I'll continue my search for half decent Chinese food in Pittsburgh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4i0BJLGyts1vhYAs_w0A1g"
  },
  "W_7gALNsxMDHAeK9uWEZMA": {
    "date": "5/9/2012",
    "text": "Yum.  I'm from out of state but if I lived in Pittsburgh, I'd definitely go back.  No frills decor but delicious, fresh food - reminded me of the food I ate when I traveled through China several years ago.  I had the shrimp with Chinese broccoli - steaming hot, freshly cooked, flavorful shrimp on a bed of greens. Yummy!  Our waiter was a sweetheart too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P13GDBnf5PS55z4Py_LFhA"
  },
  "07hhsjBLkTYmuRfidtTJfw": {
    "date": "12/17/2010",
    "text": "Really great Cantonese food that compares favorably to what you'd get in toronto & nyc.  everything was light, fresh and tasty. not too salty or heavy. everything really tasted home cooked and not \"restauranty\"   here's the run-down:  - average congee and good donut - perfect chinese broccoli -- cooked al-dente, really fresh and green w/ just the right amount of garlic - really nice roast duck -- crispy skin with good flavor and very moist meat  also, the waitress was extremely friendly!  I'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FFxzTd8fxsPQA_7ncsvjsA"
  },
  "_EfG5vezNkEveJ8jOYwuQg": {
    "date": "5/3/2009",
    "text": "Hong Kong styled Chinese food. Great to have the option in Squirrel Hill, but not the best Hong Kong styled Chinese food I've had.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "k6GurG0wmHVyiZGzmxs8eQ"
  },
  "BVR6VTXAtf87yREJM10o4g": {
    "date": "4/26/2011",
    "text": "Great authentic Cantonese food. Now, dont compare this to back home, NY, or SF. It's as good as it gets in Pittsburgh and a regular haunt for me. My favorites are beef stew with daikon or tofu, claypot eggplant, and peking ribs! Chinese greens are superb as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "8D5MJgRwSPuueb_acdtpNw"
  },
  "P1gBSVOD2xF1Jp9xSCP7-A": {
    "date": "7/15/2007",
    "text": "5 star cuisine anywhere.  Fresh, tasty greens.  Sweet, succulent dishes. Fresh, firm noodles.  Great service too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mR2P6XpEdbp0EjNsic721Q"
  },
  "b2jJOIwkkzEitB3jaRVgtw": {
    "date": "8/11/2010",
    "text": "I've only been here once, but thought the food and service were both excellent, and the portions were nice and generous. I wish they'd given us the authentic Hong Kong menu to choose from (there are two menus), which was the only disappointing part. I guess it just means we'll have to go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m1t-VIV0PCM3EIj821W1og"
  },
  "MxGWKr4_J8ZX5a0QeVisRw": {
    "date": "12/18/2011",
    "text": "I have been there for at least 5 times. Really great food. One of the best Chinese restaurant in Pittsburgh! It is a quiet place. The parking garage behind the restaurant is very convenient. Some people may think the foods are not so \"flavored\" as other Chinese restaurant. But that is because they are authentic Chinese food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xR6eAQXZ_5iojP524oohGg"
  },
  "Ci0r_Ob7UUVCo23xOxeFyA": {
    "date": "1/14/2016",
    "text": "Very authentic, fabulous flavors and cooking style. Wide variety! One of the best if you're looking for the real deal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "glaOFt5-Z-TwZZ4shBOceQ"
  },
  "DZZqMVxiuyw0asFw-vlimg": {
    "date": "8/13/2012",
    "text": "This place is good. Really good. Ka Mei is the only authentic Hong Kong cuisine in Pittsburgh as far as I know.  The place has two menus, the authentic menu and the Americanized Chinese menu. I highly encourage you to pick from the Hong Kong menu for the full experience. The food here is clean, and not at all greasy as you might encounter in Oakland. And by the way, the portions are huge! It's definitely a place you want to go with all of your friends, and you'll still probably have leftovers for tomorrow's lunch.  My personal favourite item on the menu is the Salted Squid. When you eat the pieces of deliciously battered squid, make sure to get a piece of jalepeno pepper with it for maximum flavour! I also want to say that their shrimp wonton soup is really, really good. The broth is clean, not overly salty, and so very tasty.  Ka Mei is definitely favourite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "6IbdaV9Pgc-YMViWfm80Xw"
  },
  "nh3AVLkY2RsUzLUalMEYUw": {
    "date": "6/23/2013",
    "text": "This place is awful. Bland food, rubbery meat, atmosphere is disgusting (everything is incredibly dirty and definitely turns you off from eating), service is lousy, and prices are outrageous. I seriously cannot name a single thing that I liked about my experience.  There's really no reason to come here, given the wide selection of authentic Chinese food in the area. Listen to the quick tips and skip this place entirely.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P81YNqyBLoyTu8wo1nFTWA"
  },
  "cZJN_ki11w_umepdfj_Mfw": {
    "date": "9/29/2015",
    "text": "This is a review I could not even imagine I would be writing. At least I know this will make for a good story later on.  I visit Ka Mei a few times every month because the Cantonese food is subtle and really tasty. It's the real deal. Her congee is good, her noodles are good, and her snow pea greens are good. I love the food. I even appreciate the lady behind the counter who takes her business and food very seriously.  Today when I went in to pick up my order, there were two other customers waiting for their orders. The place was very busy, and the owner was handling a lot of stuff in the kitchen. I paid for my order, grabbed the bag, and as I was walking out, I heard the other two customers talking about the picture menu the restaurant has on its wall. They were trying to puzzle through a dish that was there, and I offered one idea since I had had chinese broccoli before. Out of nowhere I feel (and hear) a smack on my butt! I wish I could say I was joking here, but obviously the owner thought I was saying something wrong, because she had run past the counter and smacked me square on the ass (I guess as if you would spank a child?). She then pointed to the bag in my hand, the door, and only said \"your order is ready.\" No other explanation. Dumbfounded at something I didn't ever foresee happening while I picked up some takeout, I just left.  I am a frequent customer, but I don't think I've reached a level of familiarity with any restaurant owner such that I would be comfortable being spanked. If it was done in jest, it was done so in very, very poor taste. I am sad now because I really enjoy their food, but don't ever feel comfortable returning. It goes to 0 stars for the battery, but gains 1 back because the food really is delicious. Good lord.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "q_mUhmiCR9IWh32Vwb8YgA"
  },
  "6TRpwTlS8tZyuf38_xB6qA": {
    "date": "6/26/2011",
    "text": "The somewhat fiesty and harried person who waited on us and who will likely wait on you is owner Carol Cheng, whom you can read up on in this 4 year old article...  <a href=\"/redir?url=http%3A%2F%2Fwww.post-gazette.com%2Fpg%2F07046%2F762122-242.stm&s=7751a4942e2ad72b4e790f28121aa2d5d8c495a47da49534adaa65b276602f15\" target=\"_blank\" rel=\"nofollow\">post-gazette.com/pg/0704...</a>  Like the author of the above piece, I too enjoyed the decor, although I didn't pay much attention to the pictures on the wall.   Kay wanted Asian food Friday evening, and when Kay wants Asian food, she gets Asian food, so to Squirrel Hill, Pittsburgh's current Asian cuisine hotbed, we went.   The word \"authentic\" is one I keep seeing  in many reviews of Ka Mei and ethnic restaurants in general. I'll say as I have said in the past that I really don't know much about ethnic authenticity and have learned to care less and less about it over time. To me, If it's good, it's good, and from my gustatory perspective, Ka Mei's food was just acceptable.  It's funny how Chinese food has become so commonplace in my life. What were once exotic delicacies have now become as traditional as spaghetti to me.  Consequently, when I go to Chinese restaurants these days, I find myself at a loss regarding what to order, so on this evening I chose my meal at random.   Crab Rangoon's usually a safe bet for me, but Ka Mei's take was a little disappointing on my end. We ordered it for our appetizer and were slightly let down by its waterly, nearly crabless filling and the somewhat tough wonton that held it.   My Kung Pao Shrimp was loaded with bright, thickly chopped veggies and was not without an ample helping of portly, juicy shrimp. Something was missing, however. Aside from being sufficiently spicy, I felt the dish was deficient in savoriness. The portion was rather hearty, yet I had to force myself to finish it despite arriving with an angry stomach. It was passable, I suppose, but it failed to excite me enough to devour it in my usual ravenous fashion.   Methinks I need to institute a personal moratorium on Chinese food. Am I gettin' burned out on it? Is fatigue to blame for me being underwhelmed by Ka Mei?",
    "rating": 3,
    "rated": {
      "funny": 6,
      "useful": 6,
      "cool": 7
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "N746flfv8qjxvA6NDK4a_w": {
    "date": "4/1/2015",
    "text": "I love the food here... every single time. The general tso is the absolute best around in Pittsburgh. The owner is very kind and the resturant us well kept. I always recommend Ka Mei!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zzDN7KhMfU5UPbTUSfYSyQ"
  },
  "ypngwy548Vc7kJoV7-7ynQ": {
    "date": "4/13/2014",
    "text": "I'm surprised this place is still opened. the waitress was very rude and thought that we were just high school student stopping in to eat after school ended. ordered the fried pork chops and was overcooked, not my cup of tea!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZFeSFlfrQASkdojcxrZWBA"
  },
  "fBX3HUnbSR8gCGlyTUnGvQ": {
    "date": "6/25/2014",
    "text": "I came here awhile back with a group and tried the cold chicken, since it seemed very similar to Singaporean chicken rice (I spent several months in Singapore).  Although that dish is typically served warm, the flavor and texture of the chicken was very similar to it, and it was an enjoyable reminder of that cuisine.  I don't remember details of the service except that it was a bit confusing at one point since they were out of something and had trouble communicating that.  I'd come back here to try the cold chicken or another Cantonese dish again! 3.5 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "D-ffUHShP-Ukfqxe2xqGhA": {
    "date": "4/21/2014",
    "text": "Best Chinese food I have had around Pittsburgh. Braised pork feet, white radish tenderloin are amazing! The restaurant is a little small, sometimes we have to wait for a while until serving all the dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2BjwuAkbj29jdCuWLBnPcw"
  },
  "qnmTcXQzBiu1WFY0FFFBVg": {
    "date": "11/3/2015",
    "text": "If you're looking for authentic Cantonese food, Ka Mei is for you! .... Because it's your only Cantonese option in Pittsburgh. So if you're judging based solely on Pittsburgh, it's the best. But otherwise it's actually rather average.  Cantonese cuisine relies heavily on fresh ingredients and not necessarily spices... So yes you can get a Cantonese styled steam fish here... But it's made from a frozen fish. So i don't blame the chef or Ka Mei, it's just we're in Pittsburgh. I only come here when I'm feeling homesick otherwise, if you just want some Chinese food whether it's Cantonese or not, I recommend Rose Tea.  As for service, I don't usually recommend a Chinese restaurant if your main objective is service. I believe the owner is from Hong Kong. And True to the style of Hong Kong servers, she speaks to you in a familiar tone but can also be curt sometimes. Which is ok with me, like I said, I come here if I'm feeling homesick.  Ka Mei's preserved egg and pork congee is pretty decent.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GBAo2LTUFGmofLZpp_X6bQ"
  },
  "On9cQsCfrZw0hvXpu599cg": {
    "date": "8/9/2013",
    "text": "I was so disappointed by this place. It is overpriced, dirty, and the entire atmosphere reeks \"cheap\". The decor would be acceptable if I were paying $5 for my entree, but at $15 and up it is ridiculous. We struggled to find a clean table, though the place was not very busy, and when we finally got our food I was very underwhelmed. Basically, if they cut their prices in half  (and wiped their tables more frequently), I might consider going here again...but until then, stay away!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NftdZP8_WCfYtt7HukemPw"
  },
  "3-ezvCwfoUwmK6-7pf9Gig": {
    "date": "2/9/2013",
    "text": "The food is decent and the wait staff is good. The owner is rude. She asked our party of 4 to move to a smaller table to make space for others even when there was no one else in the restaurant. She also scolded me for taking the lid off the teapot to signal I wanted more tea.  I won't be back here again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Pn-EmWO-pFPFg81ZIEiDw"
  },
  "HX91xq84vShb58Ijy1-C8Q": {
    "date": "9/19/2010",
    "text": "Definitely a solid 3.5 starts for Chinese Food.  We went in for lunch yesterday, probably around 2pm and it was pretty dead.  The waitress was very loud, friendly and helpful.  We ordered 3 dishes, and took leftovers home for dinner.  Everything was solid- the ground pork and eggplant was definitely our favorite.    To be fair, it definitely wasn't as authentic as the San Gabriel valley Chinese food that we had pretty much lived on for the last 3 years, but it was solid and pretty good!  We will definitely go back, price was ok too.  PS CASH ONLY!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zc5FU9abS7EJe-P_rj3dJQ"
  },
  "-HsZHKO4MDa1eCxm3cPwOw": {
    "date": "9/3/2013",
    "text": "My favorite go-to for home-style, light, not overly salted Chinese food. Almost always orders the Chicken Steamed with Chinese Mushrooms, Steamed Spared Ribs, and also one of the only restaurants you can get Congee in Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3n0O3V438yIqHbe-j-UcPA"
  },
  "NLoJB7NXmBp07GPob4KKLg": {
    "date": "8/22/2012",
    "text": "The food here i found to be quite tasteful however i found it to be overpriced  and the service was bad for that reason i am docking it stars.  Plus across.the street is another resturant that is more of a sit in resturant with great food and better pricing.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gSUU4Kq_Xm09cnmBkqj8Ag"
  },
  "UlDGFca64EJpCbUySZMwXQ": {
    "date": "10/31/2012",
    "text": "This place is great!!  They have a standard americanized menu, as well as an authentic Hong Kong style menu.  The authentic menu is the way to go!  I especially love the shrimp wonton soup and beef with chinese broccoli.  I also tried the special once, which was a whole steamed fish with fresh ginger -- delicious!  The food is always piping hot when you get it, so you know it is made fresh.    The restaurant does not have great atmosphere (I usually get take-out), but the food is delicious.  It is by far the best Chinese food I've had in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3vI08ozXdL231g-elq8UUw"
  },
  "4LsNIJC47_nXf_nlK6rDVw": {
    "date": "4/6/2015",
    "text": "Sadly, I will have to give it a so-so review, overall. I have had take out from them twice, and never dined here, but it did seem fairly clean and bright, mixed with a lobby that has pictures of many of their specialties adorning the walls. Though a bit tacky, it was very nice to see what the dishes looked like. The vegetables were very fresh, and that was the best thing about this place. However, both times (I got about 7-8 different dishes total) the meals simply lacked flavor. When I have to apply fair amounts of salt and soy sauce to enjoy the meal, I am disappointed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ia2dQGFt3djNAw_QbCj9gg"
  },
  "s7-cL0XiWXWbHMUpCYBLNQ": {
    "date": "5/8/2011",
    "text": "Literally, the only authentic Chinese food I have ever had outside of China. If you look through the reviews, all the Asians love it, and the non-Asians just don't get it. I was born in southern China and Ka Mei tastes like home.  My favorite dishes (i forget the exact names) are eggplant with ground beef, the pork short ribs, and the sour cabbage soup.   the owner is really nice, and she usually remembers your favorite dishes and  her husband, who I'm never seen, is deep in the back making all the food.  Everything is cooked fresh, so if you intend on ordering one of the dishes that require steaming (like the ribs) make sure to say so as you enter the door instead of later with all the other dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JTiB2UjkJ9ZoyV3UQ1VqHQ"
  },
  "HjAftBeL8uyflx5Pmcxc-w": {
    "date": "3/2/2009",
    "text": "First off, I will admit: I have never been to China.  So I have no clue if Ka Mei is authentic or not, and I really don't care.  My boyfriend was kind enough to pick up Ka Mei for me on Yelp's recommendation.  I said, \"get the cold chicken, some beef soup, and the pea sprouts.\"  And he did.  And the cold chicken was this: an unseasoned quarter chicken, white as a bare ass, and hacked into pieces.  The beef soup was edible but not noteworthy, and the pea sprouts were good, in the way that every vegetable is when you stir fry it with garlic and oil.  I'm an adventurous eater, so I ate a full meal that night, but the leftovers hit the garbage.  Authentic or not, no thanks.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xqqrx0b1JNILmgwSwEy_bQ"
  },
  "Yzj8emfYyVZKAfWThQUSTg": {
    "date": "2/11/2008",
    "text": "For those of you familiar with those Hong Kong style cafe/restaurants that have great prices, good food, and a ridiculously extensive menu... this restaurant is just like that, but cleaner and friendlier.  This is indeed the most authentic Cantonese food in Pittsburgh. They also do take out. For those unfamiliar with the menu, there are large colour pictures of everything when you walk in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "dHKq-j3rNwNDKQ0xGXRCdw"
  },
  "29gaOZtyBwTtlSLQRfFyJw": {
    "date": "8/14/2016",
    "text": "Ka Mei is definitely the best restaurant in my heart. I like having congee and dumplings here in the morning, and eating cold chicken, toasted duck, water spinach with friends for dinner. Most of the foods in Ka Mei are delicious. Tastes like original Cantonese food. It is great! I will miss this place when I leave Pittsburgh oneday.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "iCoGAWL9OPCTkuwbiA6lAw",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Best Dumplings in Pittsburgh!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iCoGAWL9OPCTkuwbiA6lAw/o.jpg"
      },
      {
        "img_id": "tk9JSsdicD4EwV4WdVnDGw",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Fried Tofu, with different sources. Crispy outside. Tender inside the tofu.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tk9JSsdicD4EwV4WdVnDGw/o.jpg"
      },
      {
        "img_id": "SnBDsVjWJIQgKwLYJZgDXA",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Steam Chicken with Mushrooms, tastes very good.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SnBDsVjWJIQgKwLYJZgDXA/o.jpg"
      }
    ],
    "user_id": "dSSw6nxT3j_NRmH8535n_Q"
  },
  "nBYDAvkZpW_iaJzxosdILw": {
    "date": "6/20/2014",
    "text": "Came in 10 minutes before closing on a Saturday night & got takeout. 10 minutes later, I was (politely) rushed out the door with steamed spareribs w/ black bean sauce ($13.95) & combo pan-fried noodles ($13.95). Bag was heavy & hot. Got home happy as hell, showered, fired up the MacBook & gorged myself on this lady's cooking. Spareribs were perfectly tender knuckles of meat that reminded me of a home cooked meal & the sauce was delicious. Noodles were a little clumpy in some parts (I forgive them cause they were in a hurry to close) but very edible & filled with generous portions of meat (chicken & that Asian red pork) & seafood. The other \"Awww, man\" moment besides the minor noodle clumps was the small carton of rice that came with the ribs. I wanted more to soak up that sauce. The dish was that good.   Like some of the other YeIpers, I had reservations about the prices but the portions are big enough for 2 (& the morning after) & it cost real money to be in a nice neighborhood like Squirrel Hill. It is well worth it to make the trek down Murray Avenue to eat at Ka Mei. Yes, the lady is eccentric in a kindly immigrant way. She kept sticking her head out of the kitchen to see if I was still there(?) or maybe she thought that I was hot(?!?!). I would have sex with her just for the food. It was that good.",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "u8fy9Au9l5WXWQzHmaRInQ",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Thumbs up for cool authentic places like Ka Mei that serve fresh delicious food with a smile!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u8fy9Au9l5WXWQzHmaRInQ/o.jpg"
      }
    ],
    "user_id": "PNZQjoln6oJVzQkbaX6BaQ"
  },
  "aWZ2eMx-nm-Ou3oD-0gs6g": {
    "date": "6/7/2018",
    "text": "Since I'm Cantonese, I was so excited to find a Cantonese restaurant here, but was left with nothing but disappointment with a splash of disgust. If I could give this place zero stars I would. It started with a rude server. Since I could not speak mandarin she spoke exclusively to my wife with a tones and gestures that seem like she didn't want to be there. My wife did confirm to me afterwards the server was rude to her. I could have at least given them a better score if the food was good, but it wasn't, in fact I'd consider it borderline inedible. I ordered the Peking style pork ribs. Normally it is thin slices of pork with bone-on, battered, and fried to a crisp with a sweet and sour glaze over it. At this place, each piece was as thick as four pieces you would find elsewhere, it was soggy and I pretty much just ate a sweet and sour pork chop. I've had some bad versions of these before but this is by far the worst. I ordered the beef brisket hot pot with radishes. It's pretty telling when the only thing I could stomach were the radishes. I'm not big on wasting food but I didn't even bag the food home, it was that bad. I'd rather just wait till I can go to Philly or NY to get some real Cantonese food.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cqow-0HOv5A40Oh0m3YSQw"
  },
  "4kjN6segaIWUGAVZVohJgQ": {
    "date": "1/7/2016",
    "text": "Ka Mei is not for me.  As amazing as Hong Kong cuisine is, the only Hong Kong restaurant that I can compare this to, was a cheap, late night, fast food dive where most of the patrons were drunk enough to choke down the bland preparations of low quality ingredients.    Nothing tasted fresh or fully flavored, and the seafood tasted like it had been frozen.  All the textures were soggy.    The inside of Ka Mei is stark, but inoffensive.  Even though there were only a few other guests when I ate there, the waitress was terse, inattentive and slow, and never refilled any water or tea.  After I paid, she returned my credit card back to guests at different table.  I feel lucky they didn't walk out with my card since she only brought it back to me once they alerted her of her mistake.  The food and atmosphere were mediocre and the service was some of the worst I've had.  Squirrel hill has too many amazing Asian restaurants, not to go a few blocks over to somewhere more deserving of your taste buds.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "MDeA-Gx8NScCyAdziq7IeA"
  },
  "bWQdoo6mg57MFEeEd9o3RQ": {
    "date": "11/10/2017",
    "text": "extremely bad service, the waitress yelled at us just because we asked whether we could our dish after waiting for more than 30 mins. Come here if you want to get humiliations!!! Horrible!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ElT1ONDFPEHL7WNzbM6bKg"
  },
  "-2x1CdVTUKivIT4clKMSpQ": {
    "date": "6/2/2013",
    "text": "Love this place. The food has a home-cooked feel to it. Don't order from the Americanized menu. Even the owners recommend to order from the Hong Kong menu. The portions are really large so go with a group or with a family. My favorite is the Salt and Pepper pork chops.  The restaurant is a little bit small. I tried to make a reservation there once for a group of 18 people, but they turned me down saying we would take over the entire restaurant and they couldn't handle a large crowd like that at once.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "DC1hfeeSaYr2E1xwiEL81A"
  },
  "Ea-510FyRVE1mT8uCqyfxw": {
    "date": "8/3/2014",
    "text": "Recently \"rediscovered\" Ka Mei after deciding to eat here again in a long time. I still think that it is a tad pricey overall, although for certain items the quality and/or quantity is rather worthwhile. To me, it also now seems to be less comparable to Oriental Kitchen; there's a bit of overlap, but this place feels more homely and is okay for a small quiet meal, while Oriental Kitchen is better for groups and seafood.  In particular, many of their rice plates and noodles seem to be fine choices. Their fried rice noodles with beef () is a Cantonese staple, and it was both tasty and sizable for the price. We also wanted a noodle soup but it was late and they apparently ran out of soup. Wasn't too much of a problem, so changed it to a black bean pork rib rice plate order instead. While this one could've used a little less sauce, the bell pepper and onion were fresh and the rib meat was plentiful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "7NDAfk1RojvIMmnLNmnI8w": {
    "date": "5/1/2015",
    "text": "This store's service is really really slow, it takes at lease 40 mins after you ordered (for average of more than 5 visits). And the attitude of the owner is really bad, very rude.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "PzVb4w-AT9M1LqjbUDPnZA"
  },
  "z6fuhoaNkgbrez8gErHtJw": {
    "date": "8/9/2016",
    "text": "I used to eat at Ka Mei's every week when I lived in PIttsburgh.  I've been away for 3.....almost 4 years now.  First I moved to Dallas, now Seattle.  There simply isn't any better Cantonese cooking than Carol's coast to coast!!  I went back for a visit last month and it was just as good as I remembered!   Carol makes the best Tofu dishes around!  Her sauces are magnificent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NC2j8KH4L8J4LaJgP5ipCw"
  },
  "il7pT6ocisARVEO9jkPURw": {
    "date": "1/11/2015",
    "text": "This is one of the few Chinese restaurants that seem to be primarily concerned with catering to their Chinese clientele. And I respect that. In fact, the reason I ventured in to Ka Mei was on the recommendation of a Chinese friend... A very picky Chinese friend, at that.   Like other restaurants, Ka Mei offers both American-Chinese food and authentic dishes. I've opted for the latter and have not been disappointed. Their food seems lightly seasoned and notably fresh. You can taste the different elements. I admittedly tend to prefer stronger flavors, but I appreciate Ka Mei as a change of pace. And it's the only place I know of that serves dou miao (snow pea greens) when in season.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "xwlKaJbUbZf4x8tkowDNOA"
  },
  "K4W7QYJ1TMRcyMMyFaansw": {
    "date": "9/9/2016",
    "text": "Very friendly lady boss. Recognizing that we are Asians, she quickly pointed out dishes that she thinks we'll prefer. We ended up ordering beef noodles both the fried and the soup and dumplings. All the dishes were pretty authentic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kEP1IokLiZgrLWVgBJJWtA"
  },
  "eelUl4p3fhjj6cZLpArVcQ": {
    "date": "8/18/2016",
    "text": "Before I moved to California,  I used to live in Pittsburgh and eat at Ka Mei almost every week. After living in California for a few years...I have to come back to write this comment that Ka Mai is the best Cantonese/Chinese/Taiwanese food that I have ever had in USA. Miss it so much...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OZJ3LS9pdDTnh77ysb5uJw"
  },
  "EgOJdIVrnvj9QEx5Cx8HOQ": {
    "date": "9/10/2014",
    "text": "I love small family run restaurants like this. It's always the same people so service and food is consistent.   We usually get salted ribs, combination seafood noodles (the crispy noodle kind), pea shoots (do miao), and sometimes their pork and thousand year old egg porridge (although now that alot of thousand year old egg producers are being shut down, they may not offer it anymore).   Great place for takeout as well. They also have Asian drinks which is nice (grass jelly, cold chrysanthemum tea, Apple Sidra, etc).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "5wVLW7EhvHaKoYy3tRhfrg"
  },
  "bf9bxoCvQThs1kwwyUNpAg": {
    "date": "6/3/2014",
    "text": "If you prefer milder flavored Chinese food (unlike those Sichuan style you find at Sichuan Gourmet and How Lee), this is easily one of the best Chinese food in Pittsburgh area. Too bad I didn't find out earlier.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "lXO4cqdjjA7hMQFrr91MfQ",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. short rib green bean",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lXO4cqdjjA7hMQFrr91MfQ/o.jpg"
      },
      {
        "img_id": "kBwa1IdEyxcg7j3AymknMA",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Beef radish",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kBwa1IdEyxcg7j3AymknMA/o.jpg"
      },
      {
        "img_id": "54xlbnBKyqZqhC0B28HLJQ",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Cold chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/54xlbnBKyqZqhC0B28HLJQ/o.jpg"
      }
    ],
    "user_id": "3OYdtpf71kx5JNZD5Swh6w"
  },
  "AxA-bLe4sjFikAlUzdqJDg": {
    "date": "7/2/2017",
    "text": "I think some people rated it low because if the moody boss lady. But to be honest, the foods are soooo good, especially for Cantonese cuisine fever.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fWtZxwTEonQgzWw9kE_lsg"
  },
  "ir3zp1a1W80sV49lKcltBQ": {
    "date": "6/25/2014",
    "text": "Got Take-out here last night , and although expensive , My Dinner was very good. Lotsa food. I ordered the beef & broccoli with sweet & sour soup and egg role ....total cost was just under $20.00. I was treated very quickly and with friendly service. I was surprised at how much beef was included. usually this dish is mostly broccoli. Hot & Sour soup ( one of my favorites ) was excellent. Egg role was good but average. No room for desert! Next time , I'll try the dine-in experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "67IMqiMGTTlobnDMEWszmw"
  },
  "KeTU-Caf9dp8dq_PpBPnpw": {
    "date": "7/29/2015",
    "text": "Only the Asians eat here.  You know what that means?! It's got the most authentic Hong Kong dishes here! Hands down the most authentic Chinese restaurant ever. Best homemade hot 'n sour soup with amazing tofu! The lady that owns this place is the sweetest ever! It's quite irritating to read the past reviews on the slow service. If you think the food is supposed to come out fast within 10 mins, DUDE get yourself a seat at McDonalds instead! Authentic takes time Yo! Aka complainers go elsewhere hint hint.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "nlzePIedvOb1GfR9926tsQ"
  },
  "91esltT8FzWY_g_TfpChdw": {
    "date": "1/15/2013",
    "text": "I stopped in here last in night to pick up some Chinese food for me and my brother Paul.  Bro had just been released from a two week hospital stay and I figured he could use a little cheering up.    Ka Mei has some very good authentic Hong Kongese dishes, but we went for more Americanized Chinese fare.  I guess you could call it comfort food.  We both opted for some vegetable eggrolls and some hot  & sour soup.   Paul went for shrimp with Chinese eggplant whereas I went for the chicken and garlic.  My chicken wasn't overcooked nor was the garlic overpowering.  So Ka Mei's regular menu isn't all that inspiring.  Who cares?  When you want comfort food, it fills the bill.  But I'm going have to try the Hong Kongese menu sometime.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "UtkjXTiMfGRz4R1zDF3Kxg"
  },
  "Hm4JAWdAzMX5rDO0rMYAvQ": {
    "date": "2/13/2011",
    "text": "As of 02/13/11, this place now accepts Credit Cards!  Discover, Mastercard, Visa, and I think American Express.  This place inside is not that big, but the decor is nice and simple.  I think the owners are Cantonese, but everyone can speak Cantonese, Mandarin, and English, so language shouldn't be a problem.  Hot tea is free, but there is also a variety of Asian drinks (Apple Sidra, Guava Juice, Super Supau, etc)  Our waitress was really nice.  She was able to give us recommendations on what to get.  She even took us to the front, where there is the wall with all the pictures of their dishes and explained what's what.  She also checked up on us frequently, asking if the dishes were to our liking (since she ended up recommending them).  My boyfriend really appreciated the customer service here.  We ended up having dou mei (vegetable), spare ribs in black bean sauce, and cha-sou pork with tofu and bok choy in this special sauce.  Dou mei was decent, a big plate of vegetables doused in that light oil sauce that you commonly see on Chinese vegetable dishes.  Spare ribs wasn't bad either, definitely had the black bean flavored infused in the meat.  Note that you're going to have to do a lot of sucking/ripping off the meat from the bones (something I'm not fond of doing, but that's what you do with spare ribs!)  I liked the pork/tofu dish!  The brown sauce was a bit thick and very flavorful.  The sauce is perfect for the tofu because the tofu just absorbs whatever sauce it's sitting in.  I thought it was funny that there are actually two separate menus.  The first one has your typical \"Americanized\" Chinese food (chicken with broccoli, etc.) and NO Chinese on it.  The second menu had the Cantonese dishes, included the Chinese names on it.  I guess you know which menu to order from!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "taPq7IxYskEWH7Vfc261pQ"
  },
  "UNXi8ZpsJdSWFSOyoyV69w": {
    "date": "2/15/2014",
    "text": "The first time we got take out here we thought the food was ok and so we wanted to try it again.  The second time was horrible. I got the chicken and broccoli and the chicken tasted funny.  My husband got the sweet and sour chicken and that was even worse. It had no flavor or taste to it. It was bland chicken with mushy breading around it.    The prices on the menu pictures here are also outdated. Their prices are too high for regular Chinese take out. I mean $12.95 for sweet and sour chicken? And $11.95 for chicken and broccoli?   It's save to say we are never going here again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vrB2Ae6-fX0ZRBx7HBIskQ"
  },
  "XPh10ENzhYnajppeUEv1AQ": {
    "date": "6/6/2019",
    "text": "The ingredients are super fresh and if you want some non-spicy Chinese food this is the right place to go!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6HU8-q20YaDaq-IVdR8Now"
  },
  "8LRS-HTb2d_qOYkdgGUSbA": {
    "date": "8/25/2019",
    "text": "Not cheap.  Packed without even fortune cookies and paper towels.  The smooth-skinned beef rice is full of water. It is completely different from what I eat in China. I have never seen it done and there is no side dish at all. Beef is especially rare.  Will not go again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2BW64JAiAx9bEgHs6fuehw",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2BW64JAiAx9bEgHs6fuehw/o.jpg"
      }
    ],
    "user_id": "ad8Q1Sceh9fVq1kc2d7zDQ"
  },
  "GMJlpVyOykvGHjmSm2Lk4g": {
    "date": "4/21/2019",
    "text": "As many have mentioned, do not expect service to be good. When we first entered, I thought that it was a take out place only but there are tables on the left. We quickly got seated but the service and food was sooo slow. We ordered pork dumplings with chives, a chinese donut and two bowls of preserved egg with pork congee. The food was good and the most authentic that you will find a Pittsburgh. However, it's pricey for the portions. Definitely try this place for your cantonese cravings!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nIxWOby1uGqKni2V3aFKFg",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Pork with chives",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nIxWOby1uGqKni2V3aFKFg/o.jpg"
      },
      {
        "img_id": "UU1d8uhHOVUKo8k0WnaV4Q",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Chinese donut - goes well with congee",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UU1d8uhHOVUKo8k0WnaV4Q/o.jpg"
      }
    ],
    "user_id": "gmCK2ARSx22S_4_RQF9Jwg"
  },
  "Zg6oiwV3v2MDJ0zbhXAHlw": {
    "date": "9/1/2018",
    "text": "Great find. Authentic Cantonese food. Hard being a mom and pop shop but the food comes out fast and the waitress does her best to keep up. Go early to avoid a long wait. The food is good when there is a line. I had the Steamed Fish, Pigs Feet home style, salt fried pork, and Chinese broccoli.  Cooked everything to perfection and no need to add any other ingredients.  Definitely a great find and will be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OtxgEaD5jZyNa65L0KyMQQ",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OtxgEaD5jZyNa65L0KyMQQ/o.jpg"
      },
      {
        "img_id": "mxYhm0u4ZaN2GclLm_hyAg",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mxYhm0u4ZaN2GclLm_hyAg/o.jpg"
      },
      {
        "img_id": "XovdQh504LL8RbmocBHYYA",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XovdQh504LL8RbmocBHYYA/o.jpg"
      }
    ],
    "user_id": "unIoQaYMe26vYyfB8JkE4Q"
  },
  "cP1S8DW0e9njfsnQJywM4Q": {
    "date": "8/8/2019",
    "text": "Good Cantonese food.  Simple, no frills decor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ScVOFbrtMikkBOfCKwsQA"
  },
  "kAJh7SxAZNj7LtQQfC22hw": {
    "date": "6/12/2018",
    "text": "Since we come to Pittsburgh 15 years ago, Ka Mei is the only Chinese restaurant keeps their good tastes. We had couple favorite Chinese restaurants in addition to Ka Mei but others' food become unpleasant may be because cook were changed. Proprietress of Ka Mei told me that we don't change taste of our food because I have only one husband.  Their Yang  chow is the best.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "mWlBVoaR0ukT3JDsF_rbnA",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mWlBVoaR0ukT3JDsF_rbnA/o.jpg"
      },
      {
        "img_id": "4v2j-czLULD9_nHxiWmYCw",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4v2j-czLULD9_nHxiWmYCw/o.jpg"
      },
      {
        "img_id": "YCzNa8tkqbbL1lSFbo5OYA",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YCzNa8tkqbbL1lSFbo5OYA/o.jpg"
      }
    ],
    "user_id": "cAtMmGkdfMJvSRveJsijLA"
  },
  "HRm-ojk9oH9pry_rmIf5fQ": {
    "date": "12/15/2018",
    "text": "Very good taste of food. But the service is not  Good enough. The waiter miss hearing my order turns out the Manager here she was mad at me!! Even I said it ok,I don't mind. She said you have to take this dish, and speaking Cantonese to her waiter, really rude.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1bGSG4ekSIgR5-zpoWZWaQ"
  },
  "o6JyNQy8BItmLR8vxeSHnw": {
    "date": "1/8/2018",
    "text": "I am upgrading the rating based on the last visit.  I was happy to report that when addition ingredients were added, the flavor improved tremendously.  I love ginger and green onions and it made a big difference.  I went on to order their special steamed fish (Bronzini) and to my benefit, it was quite good.  I am not a big fan of the sliced pork in the congee so I may ask that to be swapped out next time.  The steamed rice I wish was fresh, maybe it was closer to the end of the night?  I will come back again and tweak more to achieve the desired result.",
    "rating": 4,
    "rated": {
      "funny": 33,
      "useful": 57,
      "cool": 53
    },
    "photos": [
      {
        "img_id": "I12Yin8iLrv1pzAcxReOPg",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Thousand year egg congee w Chinese Doughnut",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I12Yin8iLrv1pzAcxReOPg/o.jpg"
      }
    ],
    "user_id": "6tbXpUIU6upoeqWNDo9k_A"
  },
  "yOftPgo72p0uqSZU7nLy4A": {
    "date": "8/22/2017",
    "text": "It's between a 3 and a 4.   Legend has it that this family-owned restaurant was run by a couple immigrated from Hong Kong years ago. The chef used to cook in hotels in Hong Kong, and the wife is often seen bossing around.   They serve authentic Guangdong cuisine (south China) that is different from most Chinese restaurants (Sichuan, West China) in the Squirrel Hill area.   Guangdong cuisine is not spicy. I would only compare Ka Mei with Cafe 33 in this neighborhood (Taiwanese, South/East China area).  In Pittsburgh, Ka Mei is most comparable to LuLu noodles.   Food-wise, they have dine-in, take outs, entrees with rice, noodles, and even CONGEE.  Their Beef Chow Fun ($12.95, today) does not disappoint. It is as Hong Kong as it can get, but rather expensive compared to Lulu ($8, yelp photo 2015).   Other recommended dishes include \"Beef Brisket w Radish\", \"Squid w black bean sauce\", \"cold chicken\", \"Spareribs w Bitter melon\" (they certainly did \"bitter melon\" right. However, not all Hongkong ppl like it, my dad and my brother hate better melon, and my mum and I love it. so... it is authentic, but you might not like it.)  Area-wise, it's decently clean, kind-of small.  It's certainly NOT dating-materials. Good for students. NOT GOOD FOR GROUPS. NOT GOOD FOR GROUPS. NOT GOOD FOR GROUPS.  This family-owned diner CANNOT handle big groups. They almost turned our group of 10 away once. 2-4 ppl per table is ideal for them, after all, there is only one chef and most of the time 2 waitresses.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ewvBBZowNJC5OsPQ4J9KdA",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Beef Chow Fun. Take out.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ewvBBZowNJC5OsPQ4J9KdA/o.jpg"
      }
    ],
    "user_id": "YQvXj_PfSEw2bccbLNop-w"
  },
  "2m046pBl6a1wDvQb7oKaHQ": {
    "date": "11/10/2017",
    "text": "Food is okay but you gotta wait for more than 30 minutes before you can get anything you ordered. After waiting for about 35 mins, we asked the waitress if they can bring us the food sooner The female owner got angry with us and literally yelled at us for being rude? Rude? Said by someone telling me that if I can't wait I should just leave the restaurant? Even tried to humiliate us by judging our school.  Can't imagine someone will run business in such a disrespectful manner.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 2
    },
    "photos": [],
    "user_id": "4uqu0-4YGAMDnK4eRFDD7g"
  },
  "2OBFVXDsxDr8X8HJbqW8MA": {
    "date": "9/30/2018",
    "text": "Very bad service but.. it's authentic Cantonese food. steamed chicken w mushrooms is my fav.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jOMbcoik7_mYaXzL01nmxQ"
  },
  "pAUf3MRVXLzMIpZis-WTPA": {
    "date": "8/31/2018",
    "text": "My friend and I went in this place to have lunch. They were very ignorant!!! When my friend told them what she wanted they told her she wouldn't like it. Then they said \"the place next door has American mushrooms\" How rude!!! Why don't you just say get out? Will never go there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GEBBkV91cVhfUEgA_5hNlA"
  },
  "Dh44KNt8ZDK8ncGwi4mVTA": {
    "date": "12/17/2017",
    "text": "OMG. The scambled eeg is the best egg i've ever had. I never expected a scambled egg could be this good! And the brisket(beef?) and tofu is also really good. I will definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FmyYSodHuwK-x7cw4atA4Q"
  },
  "62Qmircpaa6W-Visb4NL9w": {
    "date": "6/17/2018",
    "text": "For me, it's the best Chinese restaurant in Pittsburgh. Taste really good and never change. It is worthwhile to wait the food. We usually call ahead to order take out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MoR1pFBnxZeO-A890hsfOw"
  },
  "0akt575xT6c6MmjapXJ4Yw": {
    "date": "11/10/2017",
    "text": "The food is just OK, but the service is honestly the worst I have ever received. We just asked to maybe get the food earlier after waiting for 30 minutes. The boss come out twice and arrogantly told us that that don't come here if you don't want to wait. Also, don't come if you are from Pitts. When we were about to leave, the boss asked which school we go to and we answered Pitts. Then she asked everybody else which school they go to. With the answers, CMU, she tried to humiliate us by making the statement that people from Pitts are more arrogant than those from CMU.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "RAgXy05ELxxUdzDyuqVC3Q"
  },
  "PJSZ3EMuFiMjl00vRjhUbQ": {
    "date": "11/10/2017",
    "text": "Toooo bad! Never come back again! We waited more than half hour and they even didn't let us complain, never had worse experience",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "U_yxiZgZ-NANie0W2w850A"
  },
  "u800bdXFfIZLZWJwLjo4gA": {
    "date": "11/10/2017",
    "text": "The service is horrible! After waiting for 35mins without any food served and being attended, we checked with the waitress wonder how much longer we need to wait. The owner of the restaurant got mad at us and literately said in a rude manner that 'don't come here to eat if you do not wait.' I cannot believe my ears and wonder if I could not even check my food after 35mins waiting without any notice!!! Even worse, the owner humiliated us in front of other guest after we pay the check!!! Never ever do I have such terrible experience!!! Will never go there again!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "63Wz0AFUWCm8yGxYFAfGKg"
  },
  "7RhfQd7_wSzv4oJSiAL3qA": {
    "date": "6/29/2015",
    "text": "I had a very \"ok\" experience.   I went to Ka Mei with a Chinese friend and I was not spoken to once. Little did the server know, I speak Chinese. I did not engage in conversation, I just felt as if it was pretty rude not to even address me.   The food felt like it took forever to come. I was constantly looking at my phone to see what time it was.   The food was very good once it did arrive. Although, we were weirdly never served ice water.   There were mostly Chinese people eating, however there was 1 table of Americans.   I will give Ka Mei a second chance one day, but for now, 3 stars.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wSVR2kopiQF6DjJT-Gc8Fg",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. 鸡片粥、炸油条、豉汁蒸排骨、甘蔗汁。",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wSVR2kopiQF6DjJT-Gc8Fg/o.jpg"
      }
    ],
    "user_id": "Pe5eoZvuQYif9-jPfrFSTQ"
  },
  "RTIzFZ5Ai6-fu8yrR5BqyA": {
    "date": "2/26/2017",
    "text": "Great place to eat Hong Kong food! Usually the wait is slow because it's family owned, but the food is good. The price is a little bit more expensive than other Asian places around the area, but the food options is incredibly diverse. They have a part of the menu that is dedicated to foreigners, and another dedicated to people familiar with Hong Kong eatery. What's nice is they have the cold chicken, roasted duck, steamed black bean pork, steamed pork, and seasonal whole fish! If you come around lunch time, they also have  (soy milk) and  (you tiao)!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L_To2dXExyyIKJRu9vOe0Q",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Steamed black bean pork. This time, they added too much dark soy sauce and didn&amp;#39;t steam it long enough....",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L_To2dXExyyIKJRu9vOe0Q/o.jpg"
      },
      {
        "img_id": "wWJNZVzoXNaoNE4k973emQ",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Ma Po Tofu and Dou Miao",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wWJNZVzoXNaoNE4k973emQ/o.jpg"
      }
    ],
    "user_id": "3bs5yS7O7262QcARGfGU8Q"
  },
  "l7HrkjX41bQSSTKZnLKSew": {
    "date": "10/7/2016",
    "text": "The service here is pretty good and the restaurant is not that big. I can't speak for other food items, but their congees are very delicious and I would definitely recommend everyone try them! Their prices are a bit more expensive than what I'm used to for a Chinese restaurant, but they aren't unreasonable. Judging by their delicious congee, I'd probably come here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ud4SVpYduVg-TnRKQF7ZmA",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Storefront",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ud4SVpYduVg-TnRKQF7ZmA/o.jpg"
      },
      {
        "img_id": "ouAU6-WgEndLLoZm0PKu8Q",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ouAU6-WgEndLLoZm0PKu8Q/o.jpg"
      },
      {
        "img_id": "WcmKCgJeliGbqSddX-P4Ww",
        "caption": "Photo of Ka Mei - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WcmKCgJeliGbqSddX-P4Ww/o.jpg"
      }
    ],
    "user_id": "9MU6L4v83qo9jmutekcWMQ"
  }
}