{
  "ZEzUfp0uVR7TJqepNVKwgQ": {
    "date": "6/17/2015",
    "text": "I was really excited to try this place, but was slightly disappointed by my meal of perch tacos. They were dry, lacked sauce, and were served on cold tortillas. I would give the tacos 2 stars, but I also realize that I went to a fish and chips place and got tacos, so I'll also take into consideration that I should have tried the fish and chips instead. My boyfriend thought his thai chili chicken tacos were four star worthy.  The only thing here that I would really recommend was the mac n cheese. It was delightful. Sometimes you get bland sauce and overcooked noodles, but this was not the case this time. The sauce was pretty special. It was creamy and very flavorful. I had to physically move the cup it came in, so I would not eat my boyfriends half *accidentally.* I would go back just for the mac n cheese. I might even be interested in trying the fish and chips.  Oh, also, the boxy tots seem to just be mashed potatoes dropped into a fryer. They were herb seasoned and pretty unique.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqQ3apyUYUIY_-wCzX989Q"
  },
  "txP2Q82c_8O2RG_SAvjz0w": {
    "date": "7/31/2015",
    "text": "Fish n chips are this close to the stuff I had in London. Soooooo goooooooood!!! Now if they only had the 5pence ketchup they sell w/the fish n chips - like crack! Nom!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ARcxtEmnzuMDcmPJBUFM-Q",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Late nite date nite with my honey",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ARcxtEmnzuMDcmPJBUFM-Q/o.jpg"
      }
    ],
    "user_id": "Ei-xuVCGAcqgKEw15nehcg"
  },
  "0IybH8HVfza8tEK0u4WdpQ": {
    "date": "3/20/2016",
    "text": "I love having the Pub Chip Shop just around the corner from our Southside apartment. My husband and I both loved the fare in Ireland, and while this food is of Scottish influence it has similarities and really hits the spot.  The boxty tot boxes offer savory breakfast options. The scotch eggs are tops and are definitely worth a try! Their chips (fries) are to die for. Broad, golden and crisp - these potatoes died for a reason...to make your taste buds dance a delightful jig of appreciation. Bonus if you try the chips along with their delicious fried haddock. Usually fish and chips offers cod, but the haddock is so much lighter and flakier. Mmmmmm. Wait, there's more - they have treats too. The paczki is amazing. They always have a large offering during lent, I'm not sure if they are available year round. This is like a cream filled, sugar coated doughnut. Wow.  Bottom line : give this place a go, they have a lot to offer, and it's all delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-0-hVEpwWEcJLJoGq3rE3g"
  },
  "9oC4OYotYJzGwpOXVpKqbw": {
    "date": "11/30/2016",
    "text": "One of my favorite spots in Pittsburgh. Good, quick, stick to my ribs comfort food. They have delicious boxty options, amazing brekkies sandwiches, and spicy Thai chili chicken tacos.  They offer daily donuts at 6am--these are the kind of donuts you pay someone else to make so that you can eat them...deliciously extravagant without being ostentatious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ok-LfPGjtdVRSS1P1ZLcEQ"
  },
  "-rf2fkoj0VSze2vC2ll69A": {
    "date": "7/18/2015",
    "text": "Oh my this is an awesome place to grab some lunch. I went with my husband and toddler we ordered a variety of foods mac n cheese my son loves the steak n gravy tot box was so great the breaded mushrooms probably the best tasting I have ever eaten. My husband got the bangers tot box. We got the scotch pie and the steak and ale pie Togo yummy. we will absolutely be back and most likely quite often. I highly recommend this place even if your not on the area it's worth the drive",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UQU-1cnyGgPabslCOkkWGw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Mac n cheese and steak and gravy tot box",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UQU-1cnyGgPabslCOkkWGw/o.jpg"
      }
    ],
    "user_id": "d5D9eOFybFnmoD7UbkYNLA"
  },
  "_JOTb1CAeYIAuwQLFj-O5g": {
    "date": "8/18/2014",
    "text": "This place was so delicious.  I've been to Piper's and enjoy their food immensely as well, so I was excited to try their smaller, faster neighbor.  I got their special, which was chicken fingers and fried crimini mushrooms on bread.  The mushrooms were stuffed with a heavenly cheese/basil/deliciousness.  I still don't think you could have eaten it with your hands as an actual sandwich, but I don't really care, because it was very tasty.  I can't wait to eat there again, and I've been recommending it to everyone I see.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "tfs-CSaJuQtnEsdBm7fVnw"
  },
  "7UV9CpiIse5BpulKCQ2FNQ": {
    "date": "6/12/2014",
    "text": "My dining companion was on a pescatarian diet for Lent.  One night in Mar., he was originally planning to have me over for dinner at his place, but he got stuck at work late.  This gave me a good excuse to suggest that we check out the Pub Chip Shop, which my labmate had recommended to me, when he texted to ask if we could just eat out somewhere instead.  Both of us ordered the fried haddock.  Trying to make a somewhat healthy choice, my dining companion substituted cole slaw for the chips (fries).  I, on the other hand, decided to enjoy the fried goodness without shame, and ordered the mac and cheese in addition to the chips.  Although it was more fried goodness than I could consume in one sitting, I certainly did not regret this choice!  The fish was excellent; crispy on the outside and flaky on the inside.  My dining companion, who'd visited the UK as a child, said that it was very much like the fish and chips he remembered ordering in Scotland.  The chips, however, were the highlight of the meal.  They're of the thick-cut variety, and were crispy on the inside and soft (like a baked potato) on the inside.  The one part of the meal that disappointed slightly was the mac and cheese (score: 6.0).  Although the sauce was thick and creamy, the white cheese was just too mild for my taste.  I tried a sample of the mushy peas, and they were delicious--next time, I'll order them instead.  I washed all of this down with a can of Irn Bru, a Scottish soda that tastes vaguely like a carbonated orange creamsicle.  I couldn't stop there, however--oh, no.  I had to try the fried Cadbury cream egg!  And once again, I had no regrets.  The egg, which is battered in Irn Bru, melted in my mouth with an explosion of chocolate and vanilla cream flavor once I bit through the crispy outer fried shell.  I'm sure I gained at least a pound that day from consuming all of this fried goodness, but boy, was it worth it!  We ate in, which was fine since it was late on a Tues. night.  The guy at the counter was very friendly and conversational, and explained how everything was made from scratch, pointing out the bags of potatoes for the chips.  I look forward to returning once I've melted off the weight, particularly so I can try the pasties.  This is definitely one of the most unique eating experiences in PGH.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0DTv0oWWx0bbZ4fL-pI8bw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Half of the leftover fries--just as good the next day after a brief stint in the toaster oven!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0DTv0oWWx0bbZ4fL-pI8bw/o.jpg"
      },
      {
        "img_id": "4WKkFDIyGwm9bUqoZuyirQ",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Steak and ale pie",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4WKkFDIyGwm9bUqoZuyirQ/o.jpg"
      },
      {
        "img_id": "ELSQq6-xikx8DnVdIfkrvA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Close-up of interior of fried Mars bar",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ELSQq6-xikx8DnVdIfkrvA/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "4ehh1Av3wyNAVSfQvhi_3A": {
    "date": "1/3/2015",
    "text": "A great find while visiting Pittsburgh. Portions are huge and very creative. I had the White Chapel and it was enough for two. The sausage roll was delicious and more of an English sausage than an American. Seating is a bit limited but tables turn quickly. If your a fan of food trucks you'll love this place. All the taste of a gourmet truck without the uncertainty and eating in the wild.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kcc6qDyoxLZjSbYgKSJGOw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kcc6qDyoxLZjSbYgKSJGOw/o.jpg"
      },
      {
        "img_id": "g2DjYMxTU_A0tErW9D5z8A",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/g2DjYMxTU_A0tErW9D5z8A/o.jpg"
      },
      {
        "img_id": "dFYoLwk8jcdTQa_EQHPLxw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dFYoLwk8jcdTQa_EQHPLxw/o.jpg"
      }
    ],
    "user_id": "_v7pf2-SI5w22ENb6eVjMg"
  },
  "Ncn0w5XLceG1kQwZAfzzOg": {
    "date": "7/31/2017",
    "text": "I had the loaded baked potato tater box. The cheese sauce was so good. The tater \"tot\" are amazing. Plus I added a glazed donut after someone at the store was raving about them. It was good. A somewhat heavy cake but still so tense. And not overly sweet. Can't wait to try more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zi6KHGbA4dEHxsHHCLAFLg"
  },
  "z7s3UrdT1M-Wj5JMTHh02Q": {
    "date": "12/12/2014",
    "text": "This place does no wrong when it's time to loosen the belt a lil bit.  Hands down best fish n chips in the city.   Scotch eggs are worldly and the fried candy bars are a perfect end to a meal.   Every time I've been here (I think 5 times), nothing has been even close to just average,  just amazing. Now maybe my yinzer comes out when I stop by, bc of all the fried food. But I bet on Donnie Iris's musical talent that you won't have a bad meal. Unless you hail from SoCal.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "73mPy0pv3grD5uq_6oRGzQ"
  },
  "6gd_lxrnswnTLiRxVpEgkg": {
    "date": "11/16/2014",
    "text": "Chris and I visited late one cold Friday night. There are not a ton of spots to sit and eat your food, if we lived in the south side I guarantee we would be getting takeout on the regular. I tried the Thai chicken boxty and Chris had the fried oysters with chips. The chicken boxty was delish, the biggest surprise was the tots! These were homemade balls of almost mashed potatoes that were then fried. They looked almost like hush puppies and were amazing! Typically when people talk about tots I envision the tubular potatoes that nearly caused a riot on Glee. These were grown up tots and they was fantastic. Chris's oysters were fantastic, the breading was super flavorful. The fries! Lord the fries! They were thick cut babies that I normally sigh at because I expect mealy centers. Not so with these chips! They were thick and perfectly crispy! Odes have already been written about these chips on yelp, and people aren't lying!  They also have beers (for dine in only) or 6 packs to go.  I will definitely return! On an off time so that we can get a seat because I'm afraid if wreck while trying to eat those fries!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tmvYYqXiz3I235x-SSOeTw"
  },
  "a-rroSOLo0OkDG_3fHL6iw": {
    "date": "10/6/2014",
    "text": "This shop is so cute, from its butcher-block communal table to its old fashioned brass cash register. And the menu is full of tempting choices. The gentleman at the counter was kind, funny, and provided excellent insight on the food. My friend and I had the mushroom risotto and seafood pies, and split a side of \"boxty tots.\" Both pies were very good-- clearly made from scratch and with care-- but unfortunately they arrived to us barely lukewarm, and the seafood pie was under-seasoned. Can we talk about those tots, though? Oh my Jesus, they were incredible. Crispy on the outside, tender, flavorful, and creamy on the inside. With just a splash of malt vinegar, they sang. The pies are certainly good, but the tots alone are worth the trip. Next time I'll try their fish and chips!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wDd-cUPaaOkwkNlM8bIT8w",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Love the logo.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wDd-cUPaaOkwkNlM8bIT8w/o.jpg"
      },
      {
        "img_id": "_zU6syeAmK8iher9eDOo6A",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Seafood Pie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_zU6syeAmK8iher9eDOo6A/o.jpg"
      },
      {
        "img_id": "cc0WSjUUDdhcThBjGEWfFg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Pub Chip Shop",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cc0WSjUUDdhcThBjGEWfFg/o.jpg"
      }
    ],
    "user_id": "z4BMDd4Ymgjjw6KY80tlFg"
  },
  "g6LK0LrOcyS91KYcqvYzTA": {
    "date": "12/12/2015",
    "text": "Call me uncultured but I had no idea what a boxty was. And after doing some research, I don't think what they serve here can be called a traditional boxty, but it was delicious.  The boxties (boxtys?) here are basically lunch skillets that aren't served in a skillet. They include a potato base (their version of tots) covered with all kinds of toppings, ranging from beef and gravy to an asian chicken.  Their savory pies are worth a shot as well, although, if I were to criticize anything, it would be the amount of crust in their pies. But the gravy helps wash it down.  If I'm ever back in the Steel City, I'll definitely stop by for their fish and chips.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cHosCNV53hqSUkmgm_f7Iw"
  },
  "sNPxiWq_SfIToGaKqt9FxA": {
    "date": "6/15/2014",
    "text": "Went to the Chip Shop on Father's Day with my boy at around 5. Not a soul around. We each had the fish and chips. Witnessing the guy in the back hand dip the fish is always good. Plenty of sauces to order, along with the old standbys on the tables. The orders came out each in their own bag, with two enormous pieces of fish on top of abundant fries on top of a paper basket. Did NOT see the basket until halfway done.   Gotta say - one of the best examples of this Brit standby I've ever had, and one of the few that actually needs no condiments. The fish were so frigging hot and good - crispy but not over battered, with a delicious taste. I set one of the two meaty fillets on a napkin, and the oil did seep out, but you wouldn't say it was too greasy while eating it.   And the chips were crispy perfection. Just rightly salted, nicely crusted with a soft, buttery interior. Again, no tomatoey condiments needed here. Glad I don't live closer! Will definitely return to try some of their tasty sounding savory pies!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IOYbJgL67pkodqDGr1rIXg"
  },
  "XbwTIS3QecC4ZX3SBGLqXA": {
    "date": "8/30/2015",
    "text": "My daughter and I found this place. We've been tired of eating at the popular chain eateries for quite some time so we've been exploring places nearby with high Yelp reviews. This place is amazing! The staff is attentive,the food is excellent & the view is phenomenal. Going there is an experience for all the senses. It seems as though everyone who works or eats there are all like family.  I highly recommend this place on your eating journey.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rx6MBPtlqNWCuMD640B7Gw"
  },
  "yuJYYpJu71_8XhV8Wzp_rg": {
    "date": "6/24/2016",
    "text": "If you want to load up on calories (and flavor), try out the Boxty Tots. Just about every flavor sounds like it would be amazing. I've tried two so far and they were both excellent. Great hangover food or rainy day food. I wasn't a huge fan of the scotch egg, but that may have just been me - I hadn't had one before or since so I'm not one to judge.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NTbxTNuym726JinGdr3m0Q"
  },
  "WzWgATPMuR5NedvRKh-X8g": {
    "date": "12/27/2013",
    "text": "I've visited the Pub Chip Shop twice now and I have had two different experiences. On my first trip I had a Fish Bap and an order of chips. The fish was cooked very well, however its was on greasy side and could have used a stop on some paper towels before making its way to my bun. The chips were great, and the portion of a single order is definitely generous. The food on this trip was good, but not great.  On my second trip I ordered the White Chapel which is essentially a cheese steak topped with their English cheddar mac n' cheese. It was awesome. In my opinion this is the best mac n' cheese in the city, it's \"go out of your way to stop here\" good. On this particular stop mine and my friends food was all cooked excellently and not greasy.  My only criticism is that the prices are on the steep side. You're not going to leave here without spending at least $10, but $15 is more like it.   These guys have a winner in The Pub Chip Shop!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "DOajn8AtMjNtCZ87YoIlwA"
  },
  "teK5PPj6tf7eNFZCsYL4zQ": {
    "date": "12/1/2013",
    "text": "As a fan of Piper's Pub, I was truly excited to see what other British treats their new spinoff had to offer.  Upon walking into the chippy and looking over the menu, all seemed to be going well.  They have a bit of a Sweeney Todd theme going on, and all categories of fried wonderment are covered (from meat pies to Cornish pasties to sausage rolls, baps, even doner kebab.)  As an ex-expat in the British Isles, this seemed to pass muster.  However, once the food arrived, the expectations fell flat.  The pie and pasty crust was good, but flaky and something was not quite on with its texture.  A salmon pasty was stuffed with bland salmon and mashed potato, with no hints of the promised caramelized onions and Welsh cheddar sauce.  The meat pie fell apart and required mustard to glue its pieces into some sort of food sphere.  The chips were nice, no complaints there...  However, after ingesting the salty and greasy food I yearned for a simple cup of water but was informed that they did not offer cups.  Whether this was due to limits of the space (which also has limited seating options) I am not sure, but really feel that providing patrons with access to tap water is not too much to ask.  In summary, I would go back to try the fish and chips or ice cream sandwich and bring my trusty water bottle in hand.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "2iD_yIdPmwbVdrlcr5loVQ"
  },
  "Zgs61ZXMZ5fYKq8xNqf_Tg": {
    "date": "7/14/2017",
    "text": "I had the banger boxty tot! Excellent... sausage, scrambled eggs, homemade large tots, and covered in gravy. Omg! So good. This place would be dangerous if we lived closer. I wish we could try more things.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jZ52Cq8JZVb-Q-8_vj7ZAw"
  },
  "NRx4fft4W25ABVvJGJJ5rQ": {
    "date": "4/14/2015",
    "text": "The Pub Chip Shop was an aaaaaaamazing place! Their food was BOMB!! I had a boxty, which is a potato pancake, with scrambled eggs, juicy steak, and a fresh white cheese sauce  on top. It was made fresh to order and was only 7 bucks! I just can't believe this place exists, I can't wait to go back--- hidden treasure! It's more of a grab and go place but there's a little bit of searing inside. Highly recommended, I WILL be back for more",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oiThRZCL69b_6GiLX-CB7w",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fresh chips!! HOT",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oiThRZCL69b_6GiLX-CB7w/o.jpg"
      },
      {
        "img_id": "kiKLroAXuxl37OtnA3-0Ww",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Bacon Mac &amp;amp; weenie",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kiKLroAXuxl37OtnA3-0Ww/o.jpg"
      },
      {
        "img_id": "Obo0k2g39PDJ3R2XC7NgLA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Steak Boxty Tot Box, $7 steak is juicy and the cheese is bomb",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Obo0k2g39PDJ3R2XC7NgLA/o.jpg"
      }
    ],
    "user_id": "A8WHBko_aULQGokvcFm9Gw"
  },
  "vigbs06igz0hXtmIIPnQjA": {
    "date": "6/25/2014",
    "text": "When I heard about The Pub Chip Shop I was ecstatic. As a study abroad alum I'd been craving True English fish and chips on a regular basis since I returned home several years ago. Now I wish my schedule and the South Side's parking situation weren't always getting in my way, because otherwise I'd stop in here a lot more often!  The moment I walked in I knew I was going to be happy - the smells of the fish being cooked and the pasties for sale immediately reminded me of my time overseas. In fact seeing the pasties made me happier than the knowledge I'd be eating fish and chips again - I lived off of those during my travels and knowing I could leave with a Cornish pasty or even a Pittsburgh-theme pierogi pasty made me happier than I can explain.  But that would have to wait, as that first visit was about once thing and one thing only. I sat down with my lunch companion after we got one order of fish and chips. Holy heck, those fish and chips! They were enormous. They were one of the freshest samples of haddock you can find in western Pennsylvania. And all of the fried breading tasted light and practically melted as I ate it, and best of all, it wasn't dripping grease everywhere as I ate it. Yep - that's English-style fish all right! And the hand-cut chips (french fries, for the uninitiated) were cut into huge portions and tasted like potatoes. Yes, this is a big deal. How often do you really get chips/fries that taste like potatoes when you go out for lunch or dinner? Not often enough in my book.  Eating that meal after so long was kind of perfect, although in True American style our order of fish and chips was so massive that we had to take some leftovers home - sadly we didn't take a pasty or dessert home with us as well at that time. Really the enormous portions are my only complaint, as I'd love for a smaller option to be available. But still, who am I to complain about delicious goodness?  I'm dying to come back and sample their desserts, as I've heard good things. I've had some pasties at events around the 'Burgh and yep - they're delicious too! So all around, I approve of this place and I am extremely happy that this shop came to Pittsburgh. Definitely stop in if you haven't yet!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "baoGCpSmzWgf8-xRi65Lag": {
    "date": "3/17/2016",
    "text": "Like many spots in Pittsburgh I followed this spot on social media forever and longed for the day I'd get to try it.  Today was that day. I was in the area and I stopped in to finally try it.  The menu wasn't overwhelming but it sure was tough to figure out what to get.  I finally picked the Thai Chicken Tacos and a Scotch Egg. I bugged the gentleman behind the counter a bit as he prepared my meal. He was very friendly and welcoming. My food was outstanding and looked as good as it always has on their social media posts.   I'm extremely tempted to go back again after my show if they are still open.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hM1rKLJjIPe_Ciykxv98ww",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. The Scotch Egg",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hM1rKLJjIPe_Ciykxv98ww/o.jpg"
      },
      {
        "img_id": "pNggjlI5_8ucWPBCYk9HJg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Thai Chicken Tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pNggjlI5_8ucWPBCYk9HJg/o.jpg"
      },
      {
        "img_id": "_cyXKWeXwOBq0PxT0vjbdA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Their interior and menu.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_cyXKWeXwOBq0PxT0vjbdA/o.jpg"
      }
    ],
    "user_id": "2B1Ng0gcWysdrN7JD-py-w"
  },
  "awPWNlzpd6y2ELC1BJh5qw": {
    "date": "7/30/2016",
    "text": "I stopped here to try something different. The staff was friendly.   The food is based off of British pubs and their fried food.   They had an interesting selection. I chose the Thai chicken tacos which I  loved. Then I tried the chocolate chip and toffee ice cream sandwich which I liked. They have great prices on good food!  There was other British inspired food I want to try, would like to go back and do a taste test!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XIB33sK3bBLT-K-IBYsd3Q",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Chocolate Chip and toffee ice cream sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XIB33sK3bBLT-K-IBYsd3Q/o.jpg"
      },
      {
        "img_id": "UEFC_4VfETXcVoR6l-fYiw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Thai chicken tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UEFC_4VfETXcVoR6l-fYiw/o.jpg"
      }
    ],
    "user_id": "HgeE8guC565OELCyWLmY6w"
  },
  "wSawrVfXw0RIH-wk6vV54A": {
    "date": "5/25/2017",
    "text": "Being of Scottish and English decent, we had to try The Pub Chip Shop. For years we would travel to find Scottish and English pub food. We do like Pipers Pub, and Clauddah. Finding good Scottish pastry is hard to find. The local Scottish bakery went out of business years ago. Traveling to the Highland Games each year for just the pastry was getting old. Our daughters are no longer Highland dancing. A drive to Ohio isn't always possible either for Scottish pastry. We did find the same vendor at the Highland Games is in Ohio. We do follow a Scottish Rock band - Seven Nations, but they don't always have a venue with Scottish food available. The Burns Dinner in Bethel Park isn't always on a night that we are able to attend. Okay making a long story short...  We LOVE The Pub Chip Shop. The serve and food was awesome !!  We ate in and also took some home with us to have on another day. Highly recommend !! I LOVE the Sausage Rolls, The Steak-Ale Pie and the Sheppard's Pie. The Fish/Chips was great. The Scottish Eggs are to die for. Repeat customers for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dnnwLQ6BpKMvB0zLYkYRLw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Pies &amp;amp; Sausage Roll from The Pub Chip Shop !",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dnnwLQ6BpKMvB0zLYkYRLw/o.jpg"
      },
      {
        "img_id": "J7xDyKNzZmsbpeFkqK3vQw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Boxes to Go !",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/J7xDyKNzZmsbpeFkqK3vQw/o.jpg"
      }
    ],
    "user_id": "3egcdazws_x1wW35jgXfNw"
  },
  "QykYaE5BY6yqih1AaSLbbw": {
    "date": "8/23/2018",
    "text": "Absolutely love the hospital and friendly staff there! He greets everyone with big smile and warm welcome. I was surprised by the different kinds of food options they have there that are unlikely to see elsewhere. But the fish & chips tasted just okay to me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1RSn9PZuh8MisNKMCvYhkw"
  },
  "c-lfBdRsJozYHzj0hyAL6Q": {
    "date": "3/5/2014",
    "text": "If your looking for comfort food that's priced right and the flavor is even better than you imagined, that's the Pub Chip Shop.  Oh and you better come hungry because the portions aren't tiny!  The BF and I decided to treat ourselves to some post Valentine's Day belly lovin's and stopped in to try the talk of the Southside - The Pub Chip Shop.  We walk in not knowing what to expect:  Its similar to a deli counter - the menu is on the wall and you walk up when you know what you want to order.  Decisions, decisions.  The BF chose the Fish n Chips (one of us had to) and I selected the daily special of Brisket Tots and Mac.  Since we were feeling especially indulgent, we decided to try their Vegan Mushroom Risotto Pie.  All of this food, plus a few NA beverages and tip, around $35.  Not bad at all!  When it arrived - Sweet Lord where are we putting all of it!?!?!  I had to try the pie - Flakey and buttery crust with amazing flavor of mushroom risotto inside.  I could just eat this and be happy.  But no - I have a whole meal to consume.  Up next the Brisket - I couldn't even see it ... It was covered in mac n cheese!!!  Under the cheese was brisket, THEN tots!!!  HOLY MOLEY!!!  So creamy and flavorful and delicious.  It's everything you loved as a kid, adultified.  That's right - a new word - adultified.  The BF said (and I couldn't try the fish and chips because I was burried in cheese and beef) the fish was crispy and fries were delicious... But it too was huge!  Next time we have decided that we will SHARE a meal and a pie because our stomachs were incredibly full - but OH so happy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "1qdW0JsvuL0AywOVG8ktvA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fish n chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1qdW0JsvuL0AywOVG8ktvA/o.jpg"
      },
      {
        "img_id": "4TuqozxkS8RskirKwLIjRQ",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Brisket Mac n Tots, otherwise known as heaven.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4TuqozxkS8RskirKwLIjRQ/o.jpg"
      },
      {
        "img_id": "P4syIpVSAMQh0_FPqdHRow",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Vegan Mushroom Risotto",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P4syIpVSAMQh0_FPqdHRow/o.jpg"
      }
    ],
    "user_id": "g23xx_BkRti4H-zmbhnEKg"
  },
  "eWpzDQoA9E1W59PgkrD8Fg": {
    "date": "2/7/2018",
    "text": "Delicious food! Not a lot of space to eat in unless you're lucky, but i was please with everything I got!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Z26i4Awq1_cRMw35LmX9Q"
  },
  "e_SL_Jp9DqQArk5MFpj54A": {
    "date": "2/11/2016",
    "text": "So far I've tried the sausage rolls, the bloody hot boxty tots, the chips, the fish and chips, the chicken and chips, the welsh cheddar mac and cheese, and their scotch egg.  I've held off reviewing until I had tried quite a few things.   First of all, I've not yet had anything that has let me down. All of it was very delicious. I definitely recommend Boxy Tots to ANYONE!   I've eaten in, I've grabbed take out, and I've ordered delivery. All with about the same results. I would say the delivery is a bit more disappointing because the food goes cold and soggy (from being trapped in a box with hotness and condensation). Not their fault, and it all still tasted good. However, that's the only reason I docked a star, though they can't help it, or at least I don't think they can. Is there a way to stop things from going soggy? I'd say maybe package the leafy greens separate from the whole boxty tot business, it would prevent them from wilting too.   C'est la vie! It's great food, decently priced though it's a tad expensive so I rarely order from there or visit. Also, being that I'm not a drunk 20 year old with a fake ID and a stomach full of jager bombs...I HATE the south side... so that usually keeps me away as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EWkQxKg-KOzujC38Z_40wg"
  },
  "NPv4lTAg9Uc406y9BePefA": {
    "date": "10/22/2015",
    "text": "Why 4 stars? Because we had a hot dog topped with mac-n-cheese.     ---   ---   ---  Despite the fact that we had dinner plans, we could not help but grab a snack just before heading over to gorge ourselves at Fat Heads. What else do you do on vacation, supposed \"normal\" people?  We were semi window shopping through the south side, when we stumbled upon this gem of a shop. My fiance was obsessed with the menu and decided we had to order something. Who was I to argue with that proposition? Pick your battles.  We ended up with said hot dog dressed with mac-n-cheese. It was delightful. She would have given it 12 stars, but she doesn't Yelp, because she's a weirdo. I enjoyed it, but just not as much as she did.  Next trip to Pittsburgh, we'll do it proper here, and not just be walk-by shoppers.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 5
    },
    "photos": [],
    "user_id": "pou3BbKsIozfH50rxmnMew"
  },
  "FxbbudhmB_CBkMNCt9GFuQ": {
    "date": "6/8/2017",
    "text": "Friendly and helpful services.  Enjoyed the fish and chips -really well done!  the steak and ale pie was also pretty amazing.  I wish I was staying in town long enough to try the donuts.  Next time I come back, This will be my first stop for a meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7AZSiqYlpW50RNOKdx1Xfw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7AZSiqYlpW50RNOKdx1Xfw/o.jpg"
      },
      {
        "img_id": "kRVAzdJnQ7lG28bPQ0XCzw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fantastic fish and chips!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kRVAzdJnQ7lG28bPQ0XCzw/o.jpg"
      }
    ],
    "user_id": "r9nSjQiPdenvbcO2URejog"
  },
  "ZzB3yt9t-Erm6_mHWQwkqQ": {
    "date": "8/12/2018",
    "text": "Fish and chips were absolutely good. Fried well and season was good. Let's just say the fries had salt on them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wQ89DTbhSwmg-n-lYJAaeQ"
  },
  "k5WKC9KqPJWIdd9D14-wBg": {
    "date": "10/29/2013",
    "text": "Sweet baby Jesus was I sinfully gluttonous today! But it was well worth it for all the tasty morsels of food I devoured!   I have been waiting and waiting and waiting for this to open and the day has finally come... AND YUM! I love me some fish n chips and this hits the spot. It's not across the pond (well maybe a river or two), but right here in good ole Pittsburgh. You may get great fried fish during Lent around these parts, but now it's year round here!  I had to go with the classic order for my first time. The fish was undoubtedly fresh and the deep fry was crisp and surprisingly not greasy in the least. I really enjoyed the fries too. You know those fries you kill for? The ones that are so crispy and perfect, you almost don't need to dip them in ketchup? Almost. These are them, yo! I had a couple bites of the mac n' cheese as well. Love the big noodles, but it could have been a little bit creamier.   But I didn't stop there! Remember, gluttonous? So I tried the oatmeal toffee chocolate chip ice cream sandwich. Do I even need to say how amazing it was? And with freshly baked cookies? AND ICE CREAM.   And the apple pie tasted straight outta yo momma's oven. We got crafty and scraped half the ice cream off the cookie and made ourselves an a la mode pie. Desperate fat kid times, you know? The fried mars bar was a warm melty fried mars bar. Was it delicious? Yes. But the other desserts are just made with homemade goodness, they'd be hard to avoid!  Yep, this all happened. You read it here first. I wasn't hungry until 9pm that night. When I ate an apple. Which was boring and lame.",
    "rating": 5,
    "rated": {
      "funny": 16,
      "useful": 11,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "2Zab7XnXs3IcIp8VFE9qig",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fried Mars Bar",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2Zab7XnXs3IcIp8VFE9qig/o.jpg"
      },
      {
        "img_id": "s4nbPNRnYOhBSHhIWARS7Q",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Apple Pie",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/s4nbPNRnYOhBSHhIWARS7Q/o.jpg"
      },
      {
        "img_id": "4sfcbp_zCE3husUyWxM-5Q",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Oatmeal Ice Cream Bar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4sfcbp_zCE3husUyWxM-5Q/o.jpg"
      }
    ],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "6J6ZblyXStwRLeNJAaOcug": {
    "date": "10/8/2015",
    "text": "You really have no idea.    NO IDEA.  This is not *just* a fish'n'chips place.  It's bliss'n'batter.  It's porn-in-a-pie.  It's a frickin' MOUTHgasm.  <a href=\"/redir?url=http%3A%2F%2FOH.MY&s=e51333289de4d89694c660117daae82bcacef02fb0bc5ff261a720d9db5b7652\" target=\"_blank\" rel=\"nofollow\">OH.MY</a>.GOD, you have no idea.  As usual, I go on a business trip...what do I want?  Something the wife wouldn't allow.  I want fried chicken.  Cut to me yelping like a hungry, rabid dog...wild in the eyes, empty stomach and drool hitting the hotel room desk.  Wait...there's the Pub Chip Shop.  Oh, but it's almost half an hour away, into the heart of the city.  Traffic, crazy drivers, etc...Awww, what the hell.  Let's go.  30 minutes later, I'm driving down a main drag in very trendy South Side, taking in all the sights.  Tattoo parlor, tattoo parlor, bar, tattoo parlor...WAIT...there it is.  I park and walk to the PCS.  The place is pretty small...maybe seats 30.  But the dude at the counter is cool.  He makes a recommendation:  \"Man, if you want a bit of everything so's you can try us out, get Captain Andy's Platter.  Can't go wrong...\"  So I do.  I get that with 3 sauces...The Thai Chili Sauce, the Beef Pan Gravy and a Bleu Cheese Sauce.  Sip my beer and gaze out the window at all the college kids and hipsters walking by......  ...whistling a happy tune in my mind.....  ...then the food comes.  I shit you not, it's like a carnival of AWESOME in my mouth.  All three sauces were outstanding.  The counter dude said the Thai Chili Sauce is off the hook good and one of the most popular.  Sooooooooo good.  But my Nirvana was the Beef Pan Gravy sauce.  I don't know what they put in this, but it's like having your grandma's best gravy for mashed potatoes but with an eruption of \"spice garden\" as soon as the gravy hits your tongue.  It's not overpowering...it's just enough to have you find your \"O-FACE\".  This whole MEAL had me finding my \"O-face\".  I think I'm ready to meet my maker, because I've been to the promised land.  The chicken tender was incredibly moist and the batter was perfect.  Two oysters...SAME.  Outstanding.  The fish......YOWZAA.  Aaaaaaaaaaaaand, all this was sitting on a bed of \"chips\"...fries that were just a religious experience.  Moist and flavorful on the inside but just the perfect crispy bit on the outside.  I wanted to sing \"Amazing Grace\" at the top of my lungs, but the place was too small, the other patrons would feel a bit uncomfortable.  Did I mentioned that when I walked in, the place was empty, but it got packed as I ate?  PACKED.  As I said, I'm on a business trip.  I've had some crazy good meals this week...Meat & Potatoes, Nine on Nine, Eleven, The Commoner......but nothing, and I mean NOTHING came close to comparing with THE PUB CHIP SHOP.  Thank you, inked dude, for recommending Captain Andy's Platter.  Thanks for being so gracious to me, too.  You made the experience even more rewarding by the great service with a smile.  If you're thinking about coming here.......STOP THINKING and do it.  You won't be sorry.",
    "rating": 5,
    "rated": {
      "funny": 8,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "GeQkO7gF0pa5Duk9EE1sUA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Captain Andy&amp;#39;s Platter with Thai Chili Sauce, Bleu Cheese  &amp;amp; Beef Pan Gravy.  Yes, please.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GeQkO7gF0pa5Duk9EE1sUA/o.jpg"
      }
    ],
    "user_id": "RhoUvLtOpakWGHt5WQKEiw"
  },
  "gjY-FN83SNqBF3LXzIACiA": {
    "date": "3/18/2017",
    "text": "This place has an interesting menu. I had the regular fish and chips, fried chicken, Thai chili chicken boxty tot and chicken tikka masala pot pie on multiple visits. For me Thai chili chicken was outstanding. Boxty tots are traditional Irish potato pancakes but in this shop they are like fried potato balls which are very tasty. Coming to the chicken tikka masala pot pie, it is the first time I have seen something like that on a menu. I found it interesting and I tried. It is slightly less spicy than the traditional chicken tikka masala but still it tastes good and I ordered it again on my next visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bmSuFvdMyF66PDUZr9VfoQ"
  },
  "KRlNA_xmWeqOXopWxni9fQ": {
    "date": "10/31/2016",
    "text": "I went to London last year and had the pleasure of trying some real English fare. To be honest the food here beats out most of what I tried in London at comparable shops.      The crusts are nicer, the filling are more flavorful and the pricing makes everything worth the money.      My favorite was the Tikki Chicken Marsala Pie. Lots of rich flavor and just the right size.      The Scotch Egg is loaded with sausage and was very enjoyable.      The Ham and Cheese Pasty had lots of flavor. The only improvement would be to make it bigger with more filling and up the price. I should have bought 2 of them. I like them big and hearty.      The people are fantastic. If you get the chance eat next door at their sister Pub. A very nice place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "mE1s4m1_vaVPY-pMu7gHvw"
  },
  "ogq8Zb8VPpA3U_Zbt6iCTA": {
    "date": "7/22/2018",
    "text": "Great service, great food, cool menu. Will definitely come here again. Did I mention they have gourmet doughnuts? Casual",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a0NgnJLcl8NBiU4Xj98wyg"
  },
  "pBIy3GfQ5hLNXqLA5PKYiA": {
    "date": "2/21/2018",
    "text": "I loved this place. I got the fish and chips even though their menu had tons of things I wanted to try. The fish is big and the batter they use is delicious. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CMjvO_igPk0qPap3GRICbQ"
  },
  "fR2pjkQK3-t5AGgupoYm_w": {
    "date": "11/7/2015",
    "text": "Really wanted to love this place just based off the menu. Took almost 20min to get our two item order...and when they called our name, the food was just warm.  Scotch egg was pre-made and didn't have a yolky center, as most scotch eggs have. Had decent flavor though.  Steak and gravy boxty - potatoes were awesome, steak was almost cold, gravy mediocre, onion rings tasty but super salty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bjpCvNiVQZ0lZcbNqMPrMA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Steak and gravy boxty",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bjpCvNiVQZ0lZcbNqMPrMA/o.jpg"
      },
      {
        "img_id": "O9nebB4r8SDoIQQJbAkl-g",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Scotch egg",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O9nebB4r8SDoIQQJbAkl-g/o.jpg"
      }
    ],
    "user_id": "yTN_K39u2KAHbfe7T0J5hg"
  },
  "pV3rML6AombCpW40Z0gFEA": {
    "date": "1/13/2017",
    "text": "Almost all the food I've had from The Pub Chip Shop has been taken home for dinner, but that doesn't keep it from being delicious just the same. I love to have the Oysters and Chips (pic) and for breakfast it's always a treat when I get to have their Sausage Roll (pic) with HP Sauce (which I'm hooked on). My husband loves to get the The Ripper Box whenever we are getting their food to bring home. Sometimes I just get the Steak & Ale pie, which is also very good. The guys in the shop area always cool and treat us like we're in the club - no snobby attitudes. It's just a cool place with great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dFN-49xJ7Sn8Vg97dbAicA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Exterior Pub Chip Shop",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dFN-49xJ7Sn8Vg97dbAicA/o.jpg"
      },
      {
        "img_id": "Ev0XWNuOA2WW0IJBli5Tgg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. The Ripper Box crispy fried hotdog, meat chili, welsh cheddar sauce &amp;amp; chopped onion",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ev0XWNuOA2WW0IJBli5Tgg/o.jpg"
      },
      {
        "img_id": "_GmK-OcZQx9uKkztqH_Blg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Antique Cashier Register",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_GmK-OcZQx9uKkztqH_Blg/o.jpg"
      }
    ],
    "user_id": "OcFwWG6Mmx66-BmAqLWwUQ"
  },
  "fmmoF7PLgiiE0APpPhdJoA": {
    "date": "2/24/2015",
    "text": "Love this place!  If you're in the mood for pot pies have I got a place for you. I love the Pub Chip Shop! This cute little store front on E Carson Street in South Side Pittsburgh has an amazing selection of pies to pick from. Today we tried the mushroom risotto pit pie, the flavors are amazing. I love the cute size, just the right sized portion!   Along with the pot pie I also ordered the oysters and chips combo. Five fresh oysters battered in cornmeal breading and served with a hefty portion of fries. Served in a white paper bag that's fun to tear into. Loved this dish too. Very tasty! They have a large selection of sauces to top it off so the choices were difficult but I settled on Thai chili sauce and was very pleased with my selection.  My daughter and I placed our order and had a seat at the community table. The wait was reasonable and the food was hot, everything was delicious. I would definitely recommend this place if you're ever in the South Side of Pittsburgh.  I've hardly done the menu for this place justice; you've got to try this place for yourself. You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 12,
      "useful": 15,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "ScCDIOpsXqXV0V6hIdO2UA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Combos are served in a bag, just rip it open and enjoy!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ScCDIOpsXqXV0V6hIdO2UA/o.jpg"
      },
      {
        "img_id": "ESFX0PTR2PbS8iO6IBkV9g",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Open up for a yummy surprise!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ESFX0PTR2PbS8iO6IBkV9g/o.jpg"
      },
      {
        "img_id": "_a2W8psHb1uQJcleOT7Bgg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Cutie pie!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_a2W8psHb1uQJcleOT7Bgg/o.jpg"
      }
    ],
    "user_id": "dnCE0O3DvsmxBysa-TdYRA"
  },
  "rUgQUJqPJLhjiwUMP0a5JA": {
    "date": "2/19/2016",
    "text": "Leave your diet at home and revel in the world of all things flaky and fried. Ultimately one of my guiltiest pleasures in all of Pittsburgh. The Pub Chip Shop has quite simply elevated the deep fryer game.and I don't mean greasy, I mean perfectly seasoned, crispy outside, moist and delicious inside.  The fish n chips is of course a staple, the baps are melt in your mouth soft, but the scene stealer in my mind: the boxty. Think potato pancake meats hush puppy. And with a myriad of side sauces to choose, I just can't resist them.  They do a big lunch crowd, so expect to wait or call in your order ahead. Seating for only about 12 people so there's always a good chance you won't have somewhere to sit. The staff is always pleasant and the prices are cheap. Really, you can't go wrong here in my opinion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oMkw1GMdLUmphyb0KemFFA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Thai chili fried chicken boxty",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oMkw1GMdLUmphyb0KemFFA/o.jpg"
      }
    ],
    "user_id": "dhQOA8-FdpA6D0hNhXEYIw"
  },
  "6sIdWi_aJuDLiOGTAeyHjw": {
    "date": "8/26/2018",
    "text": "Got the Buffalo chicken Baps & a strawberry shortcake donut. Let me just say I had a very happy stomach when I was done",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clzBBdrhjQaRz2l2aWCdsA"
  },
  "A-7U8p7a_MFCGvHYt8hRzg": {
    "date": "8/22/2018",
    "text": "We stopped in for breakfast and were so glad we did! My wife got an order of boxty tots with cheese and bacon on them. These tots are INSANE, they are potato perfection.  I got a biscuit with honey butter which was a simple time done to perfection. I'm a vegetarian so my options are little limited but I was thrilled with my biscuit.  The staff is friendly, the food comes out at a reasonable speed and they are VERY reasonably priced. We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b0hS-Qi95kEH3qNVmy1bhw"
  },
  "mXdPJIe8SiTpD3efQID52g": {
    "date": "8/26/2018",
    "text": "This is probably my top recommendation for anyone looking for something good to eat who doesnt know what they want. Pub Chip offers a unique selection of food that is sure to be a hit with any palate. Prices are reasonable, the food is fantastic, and your tastebuds will thank you. The Thai Chili Chicken Boxty Tot Box is a favorite amongst my friends and is a cant miss item.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P2mciIYImAyiQwxCjy3JJQ",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Thai Chili Chicken Tot Box",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P2mciIYImAyiQwxCjy3JJQ/o.jpg"
      }
    ],
    "user_id": "6VlK6isLHTH30PqjGGdAzw"
  },
  "3zi2H6VPOHYdL7FOPQ0yZg": {
    "date": "6/17/2015",
    "text": "Fried is the name of the game here. I'm pretty sure if you were to have done a cholesterol test on me pre- and post- eating here, the results would have been frightening. No amount of exercise is going to undo what the Pub Chip Shop did to me, and I am totally okay with that ;)  This is a good ol' fish and chips shop reminiscent of the ones you'd find in the UK. They do fried and they do it well. Since I don't eat fish, I tried their chicken and chips (fries).  The food was outstanding! The chicken was breaded in a well-seasoned, light flour coating that gave it a nice crunchy, crisp bite while keeping the meat moist on the inside. Fried food can sometimes be too heavy or greasy, but this chicken managed to be light (well, relatively speaking -- it is still fried, after all!) The fries were a home run as well -- thick cut and striking the perfect balance of crisp on the outside and tender on the inside. My husband tried their specialty BBQ \"boxty tots\", which were phenomenal. Basically these are homemade tater tots smothered with a bunch of delicious toppings.  The employees were super friendly. There isn't a ton of seating inside, but there are a few communal-style dining tables for you to eat in if it's not busy. Next time I need a high-calorie fix, I will definitely be high-tailing it back here to try the rest of their menu!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HuyN-H9d2zoZCIXBAOth9g",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. BBQ boxty tots",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HuyN-H9d2zoZCIXBAOth9g/o.jpg"
      },
      {
        "img_id": "TC9rbJPTpYxZQi0P-pBKBw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Chicken and chips.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TC9rbJPTpYxZQi0P-pBKBw/o.jpg"
      }
    ],
    "user_id": "0EhPIlDozxGKpbbHRr6vZg"
  },
  "_FuZLJb_BRY1jYmYXXII2Q": {
    "date": "7/23/2016",
    "text": "We stumbled upon this place by chance while looking for the Milkshake factory.  My friend read a sign that said \"donuts\" and dashed inside, we all followed suit.  It being late on a Friday night they were no longer serving fresh donuts.  But the boys behind the counter were all too happy to share about their outstanding donuts!  Us girls had just finished up. Bodybuilding competition and we're looking for good finds. These guys were super generous and let us try some of the donuts from earlier on the day and promised they were even better when fresh.  I couldn't imagine because they were pretty stellar as they were.   The place is small but the menu looked great, if we hadn't already eaten our way across Pittsburgh we probably would have spent more time here. However I will be definitely making it a point to come again next time in town.    To the guys working last night (7/22). You made our night! Thanks for being so friendly and fun! See you next time!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "jdeKcm7mWVM3QLz-yUL17w",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Donuts!!!!! Come early and get them fresh! P.s. Get the filled ones, they&amp;#39;re epic",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jdeKcm7mWVM3QLz-yUL17w/o.jpg"
      }
    ],
    "user_id": "Y-vT3TuOTeyLuvg76yYpQQ"
  },
  "01vmTuJeHbF01pc1fWXmFQ": {
    "date": "5/19/2018",
    "text": "Bomb ass fish and chips! Staff was rad and atmosphere was great. Hair Metal playing while I eat. Excellent experience and if I'm in Pittsburgh again I will definitely be eating here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xsgCmfLvRGAxWOcTkJ9Ckw"
  },
  "JWA_zvthDRabKL7fH28r7A": {
    "date": "3/11/2018",
    "text": "I have only ever had breakfast delivered from here.  However, every time the food has been phenomenal.  Plus, it's ready quickly and still hot once it hits my door.  My go-to is a chicken, egg and cheese on a homemade biscuit with sausage gravy on the side.  Plus, you don't want to miss the amazing donuts they have that are truly decadent and worth ordering any chance you get.  I realize reviewing their breakfast is probably unusual, but it leads me to believe their lunch/dinner menu will be fantastic, once I get around to trying it.  Kudos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zufotgRGbbyVYeQ65y6DeQ"
  },
  "nsqtRjb4QRsX1-LqKPci4w": {
    "date": "7/14/2016",
    "text": "OMG I love this place!  Best British food I've ever had (and I've been on extended trips to London on business- twice)!  The food is great and the restaurant (like the proud freaks and weirdos of Pittsburgh's South Side) is interesting, eclectic, thoroughly unique and juuust big enough to eat onsite (but not huge enough to lounge).  Actually, the same could be said of the food!  LOL!  People-watching while snarfing down interesting combinations of well-made food?  Yes, please.    #omnomnom",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nlKFcgvZm_KYTjZXUF-d0g"
  },
  "VYi62rerKU5BBlH3yxF-GA": {
    "date": "3/17/2018",
    "text": "How have I lived here for almost two years without knowing about The Pub Chip Shop?! Since finding it, I've returned three times. I love the boxty tot boxes, especially the Thai chili chicken. The pot pies are so homey and delicious. I love that you get to eat the bowl! I will keep coming back to try everything!!! Oh yeah, and chips are what we call fries, so stop asking!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rYWnTtL6Y5I_FQC91n9FcQ"
  },
  "1qWQqebdJtU4uAfefNqEyw": {
    "date": "6/14/2018",
    "text": "Far and away the best fish in Pittsburgh!!!! All you need to know. Always the freshest fish, served with authentic English chips. The fried shrimps also amazing. It's not low-cal, and the batter is a bit heavy. But that's what you get with English style fish and chips.   The pies are also terrific. And don't leave without trying one (or two) of their homemade doughnuts. They have great flavors, and are freshly made. Friendly employees too......Everything about Pub Chip shop is fantastic!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvRx9X1ZWsY4AIsDutphaQ"
  },
  "FZGbCcRvQ6eKp9bLKXAfDw": {
    "date": "4/16/2015",
    "text": "This was the first meal we had when we arrived in Pittsburgh after 5 hours of driving and we were starving!   Took ~10 min for most of our food to arrive (seafood pie was delivered later) but we tried the following:   Fish and Chips - Haddock hand dipped in our house Beer Batter w Chips $8 with the spicy thai chili sauce. This was my favorite.. delicious flaky beer batter. The chips were perfectly done. well, my favorite was actually the spicy thai chili sauce. I wanted to bring a bucket of that sauce home. nice kick with Asian flavors.  Seafood Pie with boxty tots $9 - haddock, salmon and shrimp in a creamy sweet corn shrimp sauce. We had a similar dish while traveling in Ireland last month and while it was good, it was nothing outstanding. What are boxty tots? Well, they were like a combination of hush puppies and potato hash (in a ball shape).  It was ok... not sure what else is in it since it wasn't all potato.. some kind of binding agent to hold it together which made it feel doughy to me.   We were stuffed with the other foods so ended up taking this to go after two bites.. We got a side of Mac and Cheese $3 - tender pasta in creamy Welsh cheddar sauce. It was really nice when warmed up again in microwave the next morning.   All in all, it was good. I'd probably only come back for the fish and chips.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "j4xwuERIyJaW_8_1eoANIw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fish and chips, boxty tots and a side of mac and cheese. and the amazing Thai chili sauce!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/j4xwuERIyJaW_8_1eoANIw/o.jpg"
      },
      {
        "img_id": "ks7bDuM9wE3tVb-N2H9TCQ",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Aww a little heart in the middle of the seafood pie~",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ks7bDuM9wE3tVb-N2H9TCQ/o.jpg"
      }
    ],
    "user_id": "X2QU1SNnpIOwGH0umVyuKg"
  },
  "xfy5rQQ5TJQtdnt6IvVzuA": {
    "date": "1/15/2017",
    "text": "Thai chili chicken tacos are amazing, a 10 out of 10.  Breading on the chicken was amazing and the sauce is to die for, plus the portion size/price is amazing.  Fries were good and I opted to go traditional with malt vinegar.  Boxty tots are amazing.  Deep fried shrimp were good but the beading did fall off a bit.  Everyone else loved their food.  Cook and register guy were great and nice as could be but food does take a bit.  Still, definitely worth it and we will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2N0M_Sb3iW8zKn6eP-bAug",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2N0M_Sb3iW8zKn6eP-bAug/o.jpg"
      }
    ],
    "user_id": "1-WVaosTuwwYglNTl8CViA"
  },
  "X5hV8EYVRyzpiEBS_wEFWQ": {
    "date": "12/1/2017",
    "text": "I got several items:  1. The White Chapel was as dry as gin. Not to mention, it was hugely underwhelming. I think they know this, and that's why they top it off with the Welsh Macaroni. I'd recommend the HP sauce for this, it made the meat bearable.   2. The Welsh Macaroni is great!  3. The mushy peas aren't quite my thing, but tasted good & fresh. They got weird though when I asked for vinegar on the side. Most Brits that I know eat these with a liberal splash of vinegar mixed in.   4. Eh, I have mixed feelings about the chips, because while they're decent when hot, they soaked through the bag when on the way home. And once the grease sets in, they taste chalky & stale. I tried to disguise this with the Sweet Curry dipping sauce, but no to avail; which also tasted lackluster  5. The Scottish egg was amazing! Now, the crust didnt exactly stay stuck... but the taste was there. The only unfortunate thing about this was that they neglected to provide Blood hot sauce with mine.  Overall, I wouldnt recommend the place unless you're already in the area & want something \"different\". And even then, there's another British-themed restaurant nearby anyways.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P5179hGYZsDu3ps8sIkHuA"
  },
  "GEfyvttgn0PstPrAhak8qQ": {
    "date": "5/11/2016",
    "text": "I've been to the UK several times and I consider myself to be all knowing when it comes to the  cuisine. With that said let me tell you that The Pub Chip Shop makes the grade. Scotch Eggs are really good. The seasoning makes them super tasty. I'm so in love with the boxty tots that I often dream of them and wake up wanting to get to the South Side immediately. You should, go there, NOW!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "B8FKkwJRMe2V2c0YSjPM4Q": {
    "date": "6/19/2016",
    "text": "DONUT GO ANYWHERE ELSE FOR DONUTS!!!!! Literally beyond amazing. Your tastebuds will thank you and beg you for more. My favorite is the buckeye donut!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DpwQr9MY3oo_7RGqRsJxYA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. I donut know which one to choose",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DpwQr9MY3oo_7RGqRsJxYA/o.jpg"
      }
    ],
    "user_id": "RkLluG0LGXiJgf2i9dGmDQ"
  },
  "9O-LKF9NVpB7HetGcvsahg": {
    "date": "6/11/2017",
    "text": "A gem in the South Side Flats!  We saw the amazing donut menu in the window and decided to stop in for breakfast.  I started with Scotch Eggs, which I absolutely love.  They were delicious, and the house made hot sauce was a great match.  I also had one of their extravagant donuts (the Butterfinger), which is a breakfast in itself.  And still, I forged onward.  One of the things I had to try on their menu was The Irish, which was a box meal of their play on a number of United Kingdom classics:  In this case, Bangers & Mash.  Imagine sliced sausage and ham, scrambled eggs and provolone cheese smothering their version of boxtys, seasoned hash brown balls.  It was amazing.  I couldn't resist slathering the entire thing in some of the hot sauces that were available on the table, since I'm a whore for such excess, and it was absolutely delicious.  Washing it all down with a Boddington's made this one of the better meals I had in Pittsburgh.  My friend had the fried chicken and sausage gravy, and when she wasn't looking I stole a few bites.  It was fantastic.  In addition to the aforementioned amazing food, the staff was very cool and helpful.  We had a great time and I highly recommend this place when looking for a quick breakfast, lunch or dinner with great value.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "weSXj3x3_Eej8DT5WfYINg"
  },
  "xV4PKs6qrbYt8XDW0i620A": {
    "date": "9/14/2017",
    "text": "Had awesome egg and cheese sandwiches along with donuts for breakfast. The biscuits were amazing. They had a bunch of diff donuts n all were really good. Got a chicken tikka pie to go. Like the biscuit the crust of the pie was outstanding. It comes with heating instructions. Go here asap n try everything on the menu!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "THAmpNE4_d7bTtqa94WpWw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/THAmpNE4_d7bTtqa94WpWw/o.jpg"
      }
    ],
    "user_id": "Ia9bIkkZ3_JnFF7PyqRDXQ"
  },
  "11xnoZn0KHpfedGj4c7o8A": {
    "date": "11/11/2018",
    "text": "I give Pub Chip Shop a 4.5 . It probably has the best fried food in the city. Fish and chips, Scotch egg, and boxty tots all hit the spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BIBmidn3fhRzLvYMZLshEA"
  },
  "N-ajPXqAKu3a8fhKYbQ0gQ": {
    "date": "9/17/2018",
    "text": "Tasty crispy fish, perfectly salted chips.  I got a side of the mushy peas, which were also delicious.  I've been here 3 times and have also had the meat pies and the thai chicken, and they are all wonderful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V_QUB1rSphi_n3drf1fUzQ"
  },
  "h9CUlnwbrnDeDXaX-KFFAg": {
    "date": "1/13/2017",
    "text": "run by cool people, they provide some perfectly fried delights. now with doughnuts!!  When it comes to fried food and ignoring your diet this shop fries it to perfection and to order. My go to is the Thai chicken boxy tots, if you like sweet and spicy and flavor then my god this box is perfect! Their pies are swell and their shrimp and chips, man those shrimp are the bountiesT juiciest little buggers. I swing by here often and never once had it failed me when it came to fried food delights.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ObFg3cZX6wexRBlAXE_G7A"
  },
  "uHdan9z8uXrKlE5bfkJNug": {
    "date": "2/13/2016",
    "text": "Best fish and chips ever! Tons of character . Authentic meat pies. Really enjoyed. Staff was friendly and helpful. Really want to go back to try more menu items.  This is really a take out store and there is very little seating. But we did eat inside and really enjoyed it. A small selection of craft brews but nothing on tap, but you go for the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0I_LKhLMzQWebBCnWY-9ww"
  },
  "P6tJC8QwwcXW0Jgfig929Q": {
    "date": "10/27/2015",
    "text": "This is my favorite place to hit in the mecca of greasy deliciousness and alcohol South Side. My trashy roots are over on this side of the river so I appreciate the quick, cheap, and tasty. I can order chicken fingers with ranch dressing like the adult I am, pair it with a Strongbow or PBR, and be in and out of there within a half hour.  The space itself is cute. Exposed brick, counter with a flashy-faux old register, a case of pies and desserts I have never had room for. Walk in, tell the young gentleman behind the counter what kind of meat you would like them to fry, and sit at one of the big chopping block tables until your boxty of steamin' planks (or whatever you're into, they have a more extensive menu than you'd expect) are up at the counter.  I typically have tons to say about restaurants around here, but I'm pretty content on just stating it's awesome and easy. My opinion is also limited as the chicken and chips is prime eating for me. And at $7(!!!!!!!!!), that leaves a lot left in the budget to go towards the rest of your night on Carson. Not sure if that is a good thing, but it's definitely a great idea to start here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cUq1UjPVSJxTZgVFe9raUA"
  },
  "tOeULJ3FQ4mlYcyUrjwLJg": {
    "date": "9/9/2016",
    "text": "The best place in Pittsburgh. Boxy tots, breakfast sandwiches, and THE DONUTS. It's a must stop in South Side.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a-M0LYVX-wfDWxy9s0EsXg"
  },
  "br--Y_jXTgV3F30MYGZpVQ": {
    "date": "3/4/2016",
    "text": "Ah, the lenten season in Pittsburgh, repentance and fish sandwiches all around. Myself being a fan of both fish frys and supporter of local businesses, I made a stop here for fish and chips. I wanted to love this place, but instead to me it's just, meh.   Upon entering the shop, you are hit with the aroma of your local Long John Silvers. I walked up to the counter and ordered the fish and chips with a side order of boxty tots. After waiting for half and hour and a trip quickly next door to another establishment, my food was finally ready.  Upon arriving home I unwrapped my food and there was only two pieces of fish that somehow defied the laws of physics by being  greasy and dry at the same time. There was a decent amount of fries that were just ok. The tots were tad bit on the bland side and needed hot sauce to improve their taste. Needless to say, I will not be going back.  If you are  in the mood for fried fish, there are many tastier options like Wholeys fish market or the always great Oyster House.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EmY2UJ15tmF-nMg9qs-hIQ"
  },
  "4VVYXWhAYFTshecHtm2X7w": {
    "date": "5/18/2015",
    "text": "What in the world in a boxty tot?   I ordered that. \"Steak and gravy\" caught my attention--that and the specialty \"White chapel\" (\"flash fried rib-eye steak with Welsh mac & cheese\").  The White Chapel - the mac and cheese was nothing like I've ever had before, and I really liked it. It was a different, but really good, a taste that I can't describe. The steak part was good too, but even better were the crispier, greasier pieces. (Side note: this is also my fries preference: greasy, crunchy, or both. I won't eat normal-looking/tasting fries.)  Steak and gravy boxty tots - The steak was similar here, but with gravy, obviously. The gravy was good, a little salty, as gravies are. But the potatoes that it came with were... also something I've never had before. I took a picture of it--I can't describe this either, but I liked it--a lot.  I still don't know what a boxty tot is.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5-p1E5J1t9G3wHq4KgC2tg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Potatoes from the boxty tots",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5-p1E5J1t9G3wHq4KgC2tg/o.jpg"
      },
      {
        "img_id": "78go9TDTMzKFDS5AXhg0Ww",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. White Chapel: flash fried ribeye steak with Welsh Mac &amp;amp; cheese;\r With Steak and Gravy boxty tots",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/78go9TDTMzKFDS5AXhg0Ww/o.jpg"
      }
    ],
    "user_id": "PlGOItOtSgiiHvwpIM__Sg"
  },
  "MT9FzwLnI1I8SLY7TMX_CQ": {
    "date": "8/24/2015",
    "text": "This past Saturday I had a grandiose plan of drowning my sorrows in high brow fried foods, so my husband and I headed to the pub chip shop. (Did I say that right? ) Any who, we placed our order. I got the special which was general tsos chicken fingers. I also ordered the bacon & cheese boxty tots. I don't remember what my husband ordered because I was so goddam hungry I didn't really care what he ordered.   We were the only two customers at the time, and it was taking a really long time for our food. There were two guys in the kitchen and they were chatting it up with each other and another guy who I think just stopped in. I think we waited for 25 minutes. I was ready to go bitch ass crazy at this point.   Then our food came.   The General Tsos chicken fingers were un-fricken believable. I mean chicken fingers are usually a crowd pleaser, but these were on another level. Crispy breading, juicy white meat, perfectly fried. The dipping sauce was sweet and flavorful. And the tots  (which I've had before) were a great guilty pleasure, as usual.   The food was so good I forgot, and didn't care how long it took to get in my belly. This isn't a place my waistline can afford to indulge on the regular, but every once in a while...MMMMMMM good!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hApedwwHRvn8ay-QjYDZnQ"
  },
  "GTaWAQBZ3N4U4ZlIUP0-zw": {
    "date": "6/17/2015",
    "text": "Great value for your dollar. Being rooted from the Emerald Isle, the chips here remind me of home. We ordered boxty tots with cheddar and bacon, fish & chips as well as a chicken bap with Welsh cheddar. In my opinion, the boxty tots were the weakest dish. I would have liked them to be more fried. The fish was huge for the price, and the chicken bap was enormous. Completed my meal with a Strongbow English cider. Would definitely recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DzfJEk0r4zKWaF94WjEh5g",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Boxty tots, fish &amp;amp; chips and chicken bap.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DzfJEk0r4zKWaF94WjEh5g/o.jpg"
      }
    ],
    "user_id": "Pe5eoZvuQYif9-jPfrFSTQ"
  },
  "lJIXkaVUAh7qOYnYO7kNZA": {
    "date": "9/8/2015",
    "text": "I really have been looking forward to trying The Pub Chip Shop for a while now. I was really excited that they were open on Labor Day. I did like the shrimp and chips I ordered but I think with certain preferences, I would have enjoyed a different option more. The shrimp were big and tasty but the batter kind of fell off of the shrimp. I still enjoyed it and the chips were crispy and perfect. But I think the next time I will try the fish for sure!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OWtzJMlqA7cY559O80nqQg"
  },
  "bLgUw1bUhfo4PUlIXpeiMg": {
    "date": "11/26/2016",
    "text": "Chips, chicken and pasty were all pretty good.  Problems:  Ordered chicken tikka masala pie and what was delivered was the steak/ale pie.  Ate it anyway, didn't want to wait, it was good.  Also, cole slaw had a foul taste like it was starting to ferment.  So, why 4 stars?  You would have gotten 5 if not for problems.  The food we were eating was good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Ct5EXCvnDOzJKXzgOj8pQ"
  },
  "uAstGl4UzqpOy5QypXgm-Q": {
    "date": "8/5/2016",
    "text": "\"We were expecting really good food and we got really good food.  So says my eleven year old.  I second that emotion. Great Chowhound place. The atmosphere of a real chip shop. The food of real chip shop.  But not on Tottenham Court Road.   Hard to believe.  If you're after cheap and good search no more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ufppLR3KeiF9EwjRUTNP5A"
  },
  "S2gnYbxAlqgTZsxCrC98bA": {
    "date": "12/26/2014",
    "text": "I love this shop and was so happy when I spotted it on East Carson Street near my workplace. The fish & chips here is the perfect thing to order...the batter isn't too heavy and the fish seems very fresh. The chips are thick-cut and stand up well to the hearty two pieces of fish that come with each order. Since fish & chips is the basic premise of shops such as this one it's the only thing I tried my first time, but I'm dying to come back and sample the pies as well as the Thai fried chicken tacos or the tots that have received such rave reviews. I'm glad The Pub Chip Shop is in Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zPwZQEVmFg9cbmsEwLpA6g"
  },
  "z8iHe9QUFzXM-ibAo1eixA": {
    "date": "9/27/2016",
    "text": "Great place to go and grab some take out or eat a quick meal in.  The fish and chips is great and the breading practically melts in your mouth.  Also a great alternative to Pipers if you don't have the time for a sit down meal as they are owned by the same people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "35RyoPGV6El0AaJwNsGCBg"
  },
  "SgFFYU0TcxklyJP4YCGpAw": {
    "date": "2/29/2016",
    "text": "Bookmarked this place and was so stoked to try it.  Got there and they didn't have Lucozade, didn't have soup and didn't have a lot of food on hand in the case it seemed.  The side of curry (which I paid extra for) was literally cold.  Right out of the refrigerator cold.  I was told 15 for a Scotch egg and 10 minutes for a steak pie.  Seems like everything here is just kept in an icebox and just heated up when you order it.  Just seems like they aren't even trying.  Chips were overdone and the delicious COLD curry sauce didn't help.  In the UK chip shops are fast -in-and-out places you can stop for a quick (hot) bite and keep on seeing the sights.  If I wanted to sit and wait around I would go to a sit-down type place.  Steak pie was good but yet again the cup of gravy was cold.  All the while we were waiting for our food and sipping on a Yards we hear the manager chick talking shit about Ohio people.  Those Ohio people might be the same ones that write reviews on places they eat.  Stick to heating up cold food and maybe lower the volume, sister...",
    "rating": 2,
    "rated": {
      "funny": 6,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "xl6rh1O9MTPCMY-TIEbbtA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xl6rh1O9MTPCMY-TIEbbtA/o.jpg"
      }
    ],
    "user_id": "hy4uEHgITEfzxrXzyDhCRg"
  },
  "9HBcaNwKXOIh__rTtx_xTA": {
    "date": "10/28/2015",
    "text": "I wish I would have salted my food while it was still hot from the oil!  Chicken and chips were perfect with the sauces but without I would have definitely needed salt. The chicken breading was very very lightly salted but the amount of pepper was just right.  The place was almost empty with just one guy standing at the counter when I walked in tonight (Wednesday night around 9pm.)  The cook/cashier stopped his convo with the gent at the counter to take my order and I took a seat. Food was up in under 15 minutes and it was clearly cooked to order. Took a bite of the chips and was a little under whelmed until I tried the dips, of the array available  I tried both the pan gravy and Wisconsin cheddar.  Both were AWESOME!!! The cheese sauce was prefect on the unsalted chips and probably would have been overkill with salted fries.  I thought the chicken was super juicy yum! It could have been seasoned a bit better and it wasn't trimmed well so I had a few bites where the fat/gristle had to be pulled off and trimmed. I'll definitely return to try a pie!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BpM3EDzxrA8iLIWM9t6n7A"
  },
  "6rUTeUlmyHPbQYR9-HpJ9A": {
    "date": "11/17/2014",
    "text": "We were trying to figure out where to have dinner when I read Sarah K.'s review if this place. Hot fried food on a cold snowy night sounded wonderful.  I ordered the Shrimp and Chips. It came with 5 huge battered shrimp. It had a bit to much breading for my taste but they were still delicious. I dipped the shrimp in the house cocktail sauce and dipped my fries in the Baja sauce. The Baja sauce is like a thick ranch dressing. I'm not a huge ranch dressing fan but I loved the Baja.  My hubby ordered the Fish & Chips. It had two huge pieces of fish. The fish was tender and flaky with the crust that was the perfect amount of crispy batter. He dipped it in the Thai Chili sauce which was creamy and spicy. He also had the tarter sauce which was good but a smidge mayonnaisey.  I wanted to try the Grandma's Apple Pie but I was too stuffed. Guess I will have to come back . Actually there are a lot if things in their menu that I would like to try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yNdnSFa8IxNigd8M4us7Qg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fish and Chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yNdnSFa8IxNigd8M4us7Qg/o.jpg"
      },
      {
        "img_id": "T5NkMbGPEzGj7kj_Bampmw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Shrimp and Chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T5NkMbGPEzGj7kj_Bampmw/o.jpg"
      }
    ],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "OyRgeAre4N_GZRShDRVI2g": {
    "date": "3/6/2015",
    "text": "Full disclosure I've never been inside this establishment. We've always ordered to go and my husband has picked up and brought home. But, man everything I've ordered from this place is amazing and authentic to similar items I've had during visits to Ireland. Fish n' Chips, the Shrimp n' Chips, the Seafood Pie, the Scotch Pie, and Mushy Peas I would highly recommend all of these items! I'm looking forward to exploring more of the menu.  In terms of portions, it's a lot of food and I have on occasion ordered the Kid Boxes which are scaled down version of their Mains, which is a great way to enjoy this menu.  Also, their portions are great for sharing, so orders of their mains are more than enough for 3 people.   But again, I've never eaten in-house which is why I didn't rate the full 5 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EFfQZFfWWlxZ4ckTJdBLtQ"
  },
  "qAR4ql4BX3MdbGfyB0mDSQ": {
    "date": "12/15/2016",
    "text": "Even if you dont quite know what you re ordering its gonna be good. Places like this that last in pgh are rare because the population enjoys the same old bullshit covered in cheese sauce. Its nice to have something different thats quality.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7LwSrAsueQnkh75OndZ7bA"
  },
  "HiIrWi2ruOIPhWnUSFFw6A": {
    "date": "7/3/2015",
    "text": "As a long time fan of Piper's Pub, I was anxiously awaiting for the Chip Shop to open. And it was worth the wait! Luckily the shop opened while I was pregnant and I gladly took advantage of the whole \"eating for two\" thing! I love everything, from the classic fish and chips, to the Cornish pasty, to the sausage roll and the banger bap. Oh the baps! I love the baps-basically a bun, but SO much more!   I went again tonight with my family and it was fantastic. I had a bap and the welsh Mac and cheese on the side. It's all just as good as it was when the place opened.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hAR2Znsh-_hpaS4PbV1yGQ"
  },
  "r5PcVSJ7szNzbbM4_u-y6A": {
    "date": "5/19/2015",
    "text": "As far as fish and chips go, this is part of the elite",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eG1Tur78lGPRLPysNSzadQ"
  },
  "gXJ58iF41FtPQ57fnDVTAw": {
    "date": "10/13/2018",
    "text": "Sooo good! I've been here three times since discovering it a few weeks ago and from the donuts to biscuit sandwiches to their baps and chicken and chips you can't go wrong! Enjoyed chatting with their fun staff too!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "XmpVi2ogXY9MxOZUF0LD0A"
  },
  "atZvWOpu18gUAgULzN0Qiw": {
    "date": "4/2/2018",
    "text": "So wonderful to find British food in Pittsburg. Such a fun shop, the people were very friendly and helpful. Not a lot of seating. We got fish and chips and bangers and chips. I wasn't into the flavor of the sausage, they were very well made and fried, just not my kind of flavor. The fish was very good and the chips were perfect. We also got the Welsh cheddar mac and cheese that was so wonderful. They had donuts that looked amazing but we were to full to try them this trip. Highly recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "hxgfcIAPs_cGZvgpA95WnQ"
  },
  "y7y3Y3UaQB3DNaNen6C5Vw": {
    "date": "5/23/2018",
    "text": "I tried the Thai boxty tots. These aren't traditional tots and I sorta wish they were more like traditional giant tots. They were still good. I think I should have tried a different flavor because I got a couple of ginger bombs.  While the Thai sauce was good, I thought perhaps it didn't pair too well with potatoes.  Chicken was good. The cabbage was a good addition. My man had the special boxty tots: sausage with bacon and white gravy. Service was good. We were there around 3pm on a Thursday and there was plenty seating. Glad I was able to try the boxty tots but wouldn't crave it again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j7ht9YSvEbcqLRehRjOR2g"
  },
  "jzCOlcrafwvaVOkMQKn3WQ": {
    "date": "2/27/2018",
    "text": "I haven't had a disappointing thing here. The boxty tots are amazing and I could eat them daily. The sauces are flavorful, and it's great for a quick breakfast or lunch stop. The scotch egg boxty tot box was my favorite, but they've recently taken it off the menu. I look forward to seeing their daily breakfast and lunch specials on social media. Bonus: Just Good Donuts is located here too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vP2jVTIbxU6uRJIa6pbSlQ",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Thai Chili Boxty Tot Box with a Bell&amp;#39;s Two Hearted",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vP2jVTIbxU6uRJIa6pbSlQ/o.jpg"
      }
    ],
    "user_id": "NA5xWmkVODVcOI5VccebUQ"
  },
  "Z4FOzfGrsGSsCm9QMtYQyw": {
    "date": "7/3/2017",
    "text": "Wow, this place is great!  Everything on the menu is priced VERY reasonably. We were able to get a variety of things for two people, and the total cost was around ~$24. Its a very small restaurant, there are long tables for community seating. You order at the front and then pick up your food once they call it out. I was a little disappointed that the service was kind of slow. It felt like we were waiting a really long time for the food, and no one was in line before us, but at least you know everything is freshly made.   We got fish and chips, scotch eggs, and the thai chili sauce tacos. My favorite was probably the thai chili sauce tacos--SO good. I wish I had the whole order for myself, honestly. The scotch eggs were really good too, and my only complaint about the fish and chips was I wish the fish was not as thinly cut and not fried as darkly as it was.   Overall, the food is literally so good and I wish I could come back soon. Especially because their donuts and pies look really as well.  You can't beat the price for the quality of food that is served.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "ph-VgFxSp2TtHSwDPk55hg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Scotch egg",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ph-VgFxSp2TtHSwDPk55hg/o.jpg"
      },
      {
        "img_id": "Amx0ivCcxiqnTMUxKhXNHw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fish and chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Amx0ivCcxiqnTMUxKhXNHw/o.jpg"
      },
      {
        "img_id": "zR7HQQVZKp26wzwBOSceKg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zR7HQQVZKp26wzwBOSceKg/o.jpg"
      }
    ],
    "user_id": "3EN4rQgpR8cR1NxuJNzi9Q"
  },
  "xiBVELyioyTv4M4FQWkgTg": {
    "date": "2/23/2018",
    "text": "PERFECT place to go when you need breakfast on a weekend morning! Especially if you need something fried or heavy. It is one of the very few places open on Carson St before 11, and the food is great! My friends and I only discovered it recently, but have already been back a few times, and everything we've eaten has been great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KuImB8xcQ5lJCrsbB9vCvw"
  },
  "Ubf0qF44YJQVkqLUHu31bg": {
    "date": "4/29/2019",
    "text": "So have been getting their fish and chips for years which is excellent. Tonight I had the fried chicken salad and my husband had the shrimp and chips, both of which were delicious and will definitely re-order!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E2eK9E3qpCJ9wmvij2RciQ"
  },
  "_MfT_I0ckfYSxvMes-cG_Q": {
    "date": "12/13/2018",
    "text": "Always great food and nice service! Would definitely recommend! Fantastic Thai chili sauce!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ggy1LkmZP7JEmqxUoGog0g"
  },
  "5-phGR0hLXu5y1GlEwVGhA": {
    "date": "7/22/2018",
    "text": "How in the hell have I missed this place?!?I've lived close to downtown for three years now and didn't even know it existed! Maybe it's because I hate the douchebag, frat boy vibe of the South Side during the evenings and weekends. Anyway, this is hands-down the best fish and chips I've ever had. The fish itself is amazing. Big, thick filets coated in a perfectly mouthwatering and crispy batter. The chips were very good as well, even though they were soggier than I would have liked.  Also tried the scotch egg and coleslaw and both were also delicious.  This tasty and affordable eatery is a hidden gem in Pittsburgh and I can't wait to go back and try other items on the menu.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "LafxexE_35vqhbMxshDvPQ"
  },
  "Sexbc0OzZgqZMh2Xnas8Hw": {
    "date": "10/20/2018",
    "text": "I love a good fish and chips and this place really delivered. The price point is unbeatable and the nice crispy bits of fries and the batter on the fish are delicious. Plus they serve donuts!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XSdP1qnQiyoK6vIrn_m9-g"
  },
  "HSUyl6SC0DJxl_caUMtH1g": {
    "date": "9/15/2017",
    "text": "We first tasted The Pub Chip Shop at a #YelpElite event - and couldn't wait to go back! Lucky for us, the PCS has a food truck now that we found at a recent event (Grand Opening weekend of Hitchhiker Brewing in Sharpsburg).  We ordered chicken strips and chips for our son (MASSIVE pieces of plump, juicy chicken); fish and chips for my hubby (he wolfed it down); and, a Scotch egg and mac & cheese for me. The Scotch egg was perfect thru and thru - and so fresh and hot (not greasy at all). The mac & cheese was delicious as well, with what tasted like an extra sharp white cheddar and fresh cracked pepper. I was a happy girl!  The staff was super friendly. I also liked that the truck takes credit cards, which was very convenient. Even with a large crowd, we had our meal in 15 minutes.  Take the time to visit the actual shop or find the food truck - it's worth every bite YUM!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NB8o0XAOICDOfrfhlz--oA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Mac &amp;amp; cheese; Scotch egg; Hitchhiker Brewing saison",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NB8o0XAOICDOfrfhlz--oA/o.jpg"
      }
    ],
    "user_id": "YNkbvkPhLMFlOFYH2PLMwA"
  },
  "7E4pkjtTvl5YmalgqzNSnA": {
    "date": "7/7/2016",
    "text": "Came here thanks to Yelp!  Ordered the basic fish and chips, but I thought it was a bummer you only got to choose 1 sauce.  The fish and chips were made fresh, so they were nice and hot (that means you DO gotta wait though!!).  Kind of wanted to try a scotch egg, but they looked like they had been sitting in the case for a while, so I passed.  Also, street parking only, which can be a bummer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ExiGizx1g5EYL7qftNepkw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Menu/inside",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ExiGizx1g5EYL7qftNepkw/o.jpg"
      },
      {
        "img_id": "mcEMOXdtnqOddmtDvSJJ9w",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fish and chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mcEMOXdtnqOddmtDvSJJ9w/o.jpg"
      }
    ],
    "user_id": "0xYHrm3Eq2jt4Yc4wT4TsQ"
  },
  "j0G8FnJtOO4sE4yzW7W6gQ": {
    "date": "9/25/2018",
    "text": "I'm just visiting in Pittsburgh, but had a taste for fish and chips, so I checked The Pub Chip Shop out, and am so glad I did. We ordered fish and chips, a steak and ale pie, a boxty tot box, and Thai chili chicken tacos. Everything was exceptional, fresh, tasty, with little delicious surprises, and completely reasonable prices. Happy happy happy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rj7h0U3Qm8NABv7IdBremg"
  },
  "sDiqTAJScKjtIMxrhce_Pw": {
    "date": "6/8/2017",
    "text": "It was my first time going here and just the smell alone makes me hungry.  I got the kids fish and chips and a side of oysters, and my daughter got the chicken and chips.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "avVCkktwQFsKVxzuGncvnA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Chicken n Chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/avVCkktwQFsKVxzuGncvnA/o.jpg"
      },
      {
        "img_id": "QkbfUKXriK4TVBuzRG7fxg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fish n Chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QkbfUKXriK4TVBuzRG7fxg/o.jpg"
      },
      {
        "img_id": "HiEpqsUOa7ZrxrOPFcmFrQ",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Oysters",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HiEpqsUOa7ZrxrOPFcmFrQ/o.jpg"
      }
    ],
    "user_id": "W40B1zLVNT8dnNZQt90mpw"
  },
  "oz6oI9vDyoxSV9tfHvjq6A": {
    "date": "5/5/2017",
    "text": "I came here to try the donuts because I saw them on instagram. I imagined them to be regular-sized but they were bigger than the size of my hand! There are a variety of toppings you can choose from. We got the Coffee Cake and the CookiesNCream donuts. The donut dough itself is denser than most - must be because of the large size of the donut. But the donuts overall aren't too sweet so I think it was just the right level. The cashier who was helping us seemed a bit impatient with us when we were trying to choose the donuts. I'd like to try the food here next time though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "p9qQmNQdm8GNxcE3L0ZEbA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Coffee cake donut (left) and cookies and cream don&amp;#39;t (right)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p9qQmNQdm8GNxcE3L0ZEbA/o.jpg"
      },
      {
        "img_id": "Quia7AKMeC1_uPIByJLO2Q",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Just Good Donuts",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Quia7AKMeC1_uPIByJLO2Q/o.jpg"
      }
    ],
    "user_id": "bryAPtwnnMYjbzoOWHzbWg"
  },
  "hCrwJ4CKHSOesmnMmwcL3g": {
    "date": "8/24/2017",
    "text": "This is a review for the food truck only.    My partner and I are regulars at Pie and Pint Night at Roundabout Brewery.  The Pub Chip Shop supplies the savory pies, and they are absolutely delicious.  There are two offered:  Potato and Lamb.  I can only attest to the potato pie.  If the lamb is even half as good, you're in for a treat.  The crust is light and flaky and the innards are perfectly seasoned.  If we could buy the pies ala carte, we'd easily be 3-4 pies deep by the end of the night.  In lieu of this, my partner was very excited to try The Pub Chip Shop food truck.  Since their primary offering was fish, I was only able to have some fries and mac n' cheese (I'm a vegetarian.).  She thought the fish and chips were very tasty, and I really liked the fries.  Although I wish they offered the pies that Roundabout does during Wednesday night's, we definitely weren't disappointed in our eats.  We'll certainly hit up the brick-and-mortar restaurant as soon as possible.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_RXkaI4MhBYraYmckHh6zg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fish and chips from the food truck at Roundabout Brewery. Thumbs up from the peanut gallery!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_RXkaI4MhBYraYmckHh6zg/o.jpg"
      }
    ],
    "user_id": "8x6xjNCbYKeXvyvgNwBpZA"
  },
  "Vgv28VESmFOwtDofJfHuFA": {
    "date": "2/8/2017",
    "text": "Don't waste your time and money going anywhere else for your cheat day, go here!  Best fried fish, chicken, and fries I've had in a loongg time. Oh, and they also have donuts in the morning if you are blessed with working near this amazing restaurant.   So, so glad I finally came here, it's been on my list for a while. The service was also very welcoming and surprisingly quick since everything was fried to perfection.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 7
    },
    "photos": [],
    "user_id": "BkMqpJikNc3r5itc-ui6ww"
  },
  "Nbrl4aRss_c9didVaPpxVw": {
    "date": "11/17/2017",
    "text": "Oh. My. God.  Seriously.  It's that good.  I have been wanting to try this place for years and realize that 1. they do take out and 2. they deliver to me via GrubHub.  Yes, delivery.  I might gain 300 pounds, but it will be worth it.   We ordered a bunch of different things and each was better than the next.  First, we got the chicken and chips for my daughter.  For five bucks, you get 3 huge chicken strips and a ton! of fries.  They were perfectly cooked and even still good by the time we got them.  Amazing.   Then, I got the scotch bap.  The bap - the bread - was perfect - floaty and heavenly.  The scotch egg was awesome - good tasting sausage and a perfectly hardboiled egg.  It came with cheddar, spring greens and a great mustard.  Z got the chicken tikka masala pie - but what he actually got was one of the steak ones. Normally that would cause me to ding a star, but it was super delicious that he didn't even mind.  The crust - omg, the crust.  Amazing.  Buttery and flakey and obviously made with lard and heart.  He also got the fish bap which was awesome and the tartar sauce is on point.   I will be going again.  And again.  And again.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 8
    },
    "photos": [],
    "user_id": "2JjI8DCyrpabtg36iL5lrw"
  },
  "tXSk897xR41ldg7mbI9HHQ": {
    "date": "12/5/2017",
    "text": "This is a great place to eat if you're looking to indulge. They have lots of different pot pies, sandwiches, and AMAZING donuts. Everything is made in house, so even though they're mostly heavy dishes, you can tell that it's fresh. I really enjoy the Not so Grilled Cheese sandwich. It's a panko breaded slice of provolone cheese with greens & a delicious aioli. They don't have a whole lot of vegetarian options, but the ones they do have are good. I'll definitely return here time and time again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "JeIVRtZiwUnSP9qR4AmfEQ"
  },
  "Wl0Va71VoBgdBa37tC62vQ": {
    "date": "2/3/2018",
    "text": "This place is so cool with delicious food! Very few seats but worth the stop if you're in the mood for some good comfort food! I had the loaded potato boxy tots and added delicious fried chicken! I was disappointed that the twitter page had something that was only available that day but didn't say that. Oh well we improvised and created my own boxy tots!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7KKKimQHBb8BVCN249SZIg"
  },
  "MoIOHscta29hQOlekX3lzA": {
    "date": "1/9/2014",
    "text": "This is a wonderful place. Great food. So very good and fresh! Prices are good but it's the atmosphere and the friendliness of the staff. They make you feel right at home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DWwfJFLe1Xn6BkjwaA_TcA"
  },
  "_73gadMSWpHkPD845NwkMw": {
    "date": "12/26/2013",
    "text": "The little meat pie was delicious, though it could have been warmer inside. Soup was delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4d7W2OXWMAH3YfIKgbAPBQ"
  },
  "iUu8asiLF6SejWIDVWWVdw": {
    "date": "1/22/2014",
    "text": "Steak&Ale pie was flakey and oozed gravy nicely. Fish 'n' serious chips were fried up proper, with a crisp light batter, fresh coleslaw and a fresher fried Mars bar. All is right at this joint on Carson St. We left with a Scotch egg and another pie for later and feeling pretty darn happy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "acmmHvRGrIfPabxZG0D8zA"
  },
  "0WOEfjJxqNwB0pqJqZtmSw": {
    "date": "3/12/2014",
    "text": "Excellent selection. The fish bap was perfect. I'll be back again to try one of the pies.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YFQ2NB2pOFGJG4pJVXoLPg"
  },
  "edQWL0RA19X4369IeOy2ZA": {
    "date": "3/1/2014",
    "text": "Awesome place! Fish and chips is delicious, and the portion is huge. Mac and cheese is amazing. Way too many tasty things to come only once. I'll definitely be back for a scotch pie and boxty tots.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rL8JGwu_Cj1k97GJzm8R2Q",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fish and chips---huge portion",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rL8JGwu_Cj1k97GJzm8R2Q/o.jpg"
      }
    ],
    "user_id": "9ROx8_SMW8b9WAQBbuNWmg"
  },
  "gc10ewizwfdHJTJ6zppjyA": {
    "date": "4/5/2014",
    "text": "I want to like this place more than I do. The food is tasty all right, but the service has been weird to me and it's kind of off-putting. The first time I was here I had to wait and wait and wait for my chips, turns out that the dude taking orders had requested \"salt-free\" chips for me. I have very low blood pressure for a chubster, so I want ALL the salt. That was just weird and nothing I said would have sounded remotely like \"May I have the chips without salt, please.\"  I like that there are vegan/vegetarian options, but again with the service consistency. The first time I got a vegan mushroom risotto pie, it came with a vegan gravy that made it A++++; tonight I order the same food and I guess I was supposed to ask for the gravy? Next time I will know to ask for it, because I got home with my food and was sad. :( It was kind of dry without the gravy.  Maybe these are minor issues, but it adds up to me being kinda meh on the place, even though I enjoy the idea and the food for the most part.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R5sDDIv_SQp9E5AU_sSYoQ"
  },
  "VStKHVpFaMYD1kwNE2L63A": {
    "date": "11/15/2015",
    "text": "Best fish and chips in the Burgh. Their fries are always super crispy. Great beer special on Sam Smiths stout this last visit. Limited seating but people move through quick.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l87daniimtJ-7S_FQDB51Q"
  },
  "Vi7l1WBp02R3SJYjbpgIMQ": {
    "date": "1/13/2014",
    "text": "Great food, great service, great price. Most things are either deep fried or covered in bread, so don't expect a lot of diet options.  They do have vegan ranch! And a seitan option too. Try the try the perch tacos, they were our favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Bn6yPFW5WeX_nYFd1UBVw"
  },
  "3huD805SG1btlOyIsgP0cw": {
    "date": "6/20/2015",
    "text": "I came in here just looking for something to eat at night and they were so rude to my friend. The cook said fuck my friend he will be here week after week and continued to cuss him out until we felt uncomfortable and left. It was so unprofessional and rude. I would never recommend this place to anyone. Food is okay and service is awful. I honestly hope they close down. He wanted none of our business and messed our order up and laughed about it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gBEE05hEZVMIdfT2juVuvg"
  },
  "0YnZNSrlR9AOBN_y3-JuWQ": {
    "date": "3/26/2015",
    "text": "One of the worst experiences ever! The food is delicious the first time I visited however the service was terrible the second time. For a late night restaurant they really dropped the ball. My friend and I visited The Pub Chip Shop to get some food at 1:00 AM on a weekend. One of the employees who was the cook was screaming about how he doesn't care, it was his birthday and was going on about how drunk he was, flicking people off in the restaurant! I can't make this up. It was like a bad scene out of Gordon Ramsey's Kitchen Nightmares. My total was around $10.00 and he charged my credit card for .68 cents and started laughing then walked back to the kitchen. There was only one other employee who was working very hard trying to keep up with everything yet nothing was getting done. We waited for over 45 mins, the person behind me was waiting for over 30 mins with no food. The out of line cook said something along the lines of \"you might as well leave because no person here is going to get food\" We waited and waited for almost an hour with no food as the cooks friends visited him in the kitchen to talk about whatever was happening that night. Totally ridiculous so we ended up leaving. I will not be giving The Pub Chip Shop another go. Maybe it is the south side hipster mentality or just bad management overall?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ywdOzRlIwvWnR1vWC03Lw"
  },
  "17vbRN8nxNF-dfPkyfr67g": {
    "date": "7/10/2014",
    "text": "Fish and chips are the best I've ever had. I also had the homemade tater tots, they are crispy outside with a creamy center.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rTEOsN05dFYIIYCUhkUITA"
  },
  "mIr61w3-8HKQrdQH8KMy0Q": {
    "date": "9/8/2014",
    "text": "Awesome. I have lived in England and the food here was just perfect. Sister & I both had the fish & chips, son had welsh cheddar mac & cheese. Huge, hot delicious portions. We'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RhVJgYmSKJVl2b9v5GjEEg"
  },
  "YU2fa43azul2eAhS5pGbQQ": {
    "date": "7/25/2014",
    "text": "The food is phenomenally amazing! The best  thing that has happened to southside. I have not had one bad meal at Pub Chip. The staff is always fast, friendly, and  accommodating. Try the fish and chips, pierogies, and the Thai chili sauce--you won't regret it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ahn7fhGcnL7VruCejYekEA"
  },
  "u0QZdBzD8pW8x1wBlOkzNQ": {
    "date": "5/3/2014",
    "text": "Very authentic and wonderful atmosphere. Some of the best fish I ever had in Pittsburgh.   Went on an early Saturday afternoon before the craziness on the south side started. The staff was very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rAYo4kUrQMytV_U6wj9eJg"
  },
  "lkIG3lta6vI1DZgDMRboRA": {
    "date": "2/9/2014",
    "text": "Great food, friendly service, very clean.  Small, not too many places to sit...so might not be great for a group of people who wish to sit and eat their food.  Recommend: Deep fried mars bar, pierogi, lake erie perch taco, doner kebab, sausage roll, chip bag with chili yogurt sauce for dipping.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lZnmbDxXa4CkzNujMy2-OQ"
  },
  "wOpq9MFmo8WWBLbzEi_S8w": {
    "date": "5/9/2015",
    "text": "great little shop with perfect pub food. super friendly staff and everything came out faster than expected. communal seating may not be for everyone but not a  big deal. will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gHyePV7DI2TGkSJJCOad4w"
  },
  "IYKJnEt6ACfJ42BPcvmm0g": {
    "date": "1/28/2014",
    "text": "I spent 20 years living near an award winning chip shop in UK, and made it my mission for longer than that to seek out good chippies throughout Britain, so was very excited when this place opened. It is an American take on a British chippie, albeit a very good one. Where in UK do you get pierogies or hot sauce or tacos or chowder in a chippie? The Scotch pie was too large - you would get it half that size in Scotland - and the filling was more like sausage meat than is usual. It was heavy on sage - that's an English favourite, not Scottish. And it came out several minutes before everything else. The chips were plentiful, hot and crispy - too crispy for a British chippie, but I liked them anyway. The fish was hot, fresh and tasty, but the batter was a beer batter (in UK beer batter is used in pubs, not chippies) and a bit greasy. We asked for brown sauce for the chips - an east coast Scotland thing - and they had HP sauce, which is a decent alternative, as well as proper malt vinegar for the chips. So - not good enough for me to make a special trip when I'm wallowing in nostalgia for the homeland, but probably the closest to a proper fish supper (ie fish and chips) I've found here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dn-hJ6PbEy0RwvmpY3Tcgw"
  },
  "eWsJoKlAGIEREVRCTDak1A": {
    "date": "6/9/2014",
    "text": "WOW...WOW!! Delicious Fish and Chips! This place is pretty new so it is CLEAN! The guys behind the counter are super nice and the food is spot on. We have been going to a place in our hometown that we thought was terrific but now we know what we have been missing all these years. Fish and Chips; yes but you have to try the Scotch Egg with PAN GRAVY. We had one (at the place next door when we lived here a few years ago) but this place turned us into huge fans of a Scotch Egg! (YOU HAVE TO GET THE PAN GRAVY) If I lived here permanently, I would def go here frequently! We are leaving Pittsburgh in a few days and we wanted to visit this place one more time before we left so we are on our way there now! We stopped in last Saturday LATE night on our way back from walking down Carson Street and got a Oatmeal Ice Cream Sandwich that was perfect. We sit in the front of the window so we can watch the people go by! YOU GOTTA GO.....Day or night :) Good food, nice staff and great location!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bbucvMWQyMP6EFF5CdqM-Q"
  },
  "zzl2G76ip22mzROeLXYDMg": {
    "date": "9/6/2014",
    "text": "This place is quite a bit smaller and quieter than the boisterous Piper's Pub next door, which is great if you're not looking for a bar atmosphere. The items are very straightforward; signatures are of course fish (or various other seafoods) with chips. The chips are fantastic, salty, and crispy. The fried fish is very fresh and tasty. We also tried a bap, which is essentially a sandwich, although with no other fillings. They have a number of other food types as well, like tacos and beef patties, which may be my palate next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "N0EAP_3tiSDN8wlUdbQbug": {
    "date": "6/7/2014",
    "text": "Unreal how there is a proper chipper right here in Pittsburgh.  Hat's off to you boys - in all seriousness this was better tasting and higher quality fare than the last chip shop I'd ever been to in th EU (Cork, Ireland to be exact). I'm actually glad I don't live in Southside anymore,  I'd be morbidly obese by the end of the year :-D Rock on Pipers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "2tavxf3qmdLY1n1BjmU_YQ"
  },
  "LWQ_ntgUs3oZ2wU7YdaXjA": {
    "date": "6/18/2015",
    "text": "We had fish and chips.  The.batter was amazing.  It was not the thick gooey mess  it was light and crispy.  The ice cream  sandwiches  tasted homemade. It draws a good crowd and patrons were friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BYCft1XcHJ3yokGRyva_JQ"
  },
  "s5JUkZe0Ftgcy13C08pdDw": {
    "date": "4/12/2015",
    "text": "This place is pretty good mostly, but don't expect anything decent during the night shift. We waited over a half hour for our order to come up, and when we finally got it, it wasn't very good. The tots were burnt, bacon undercooked, and the burger (mctavish) was cold and overdone. Way overpriced for the quality, obviously.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uf-IuQviLkxyBUnC5wAbqQ"
  },
  "Y_qhUlURUyAU1kIc_y_CHA": {
    "date": "8/12/2014",
    "text": "If I could, I'd give Pub Chip Shop 10 stars. What a great addition to the south side. Quality, tasty, artisanal food done quickly! I chose the special of the day which included pulled pork in kraut with bacon accompanied by potato bliss. Imagine a hash brown and a hush puppy had a love child and dressed him up in sour cream and chives. That's what I call potato bliss.  I also purchased the ice cream cookie sandwich special which was a peanut butter cookie with chocolate ice cream. It was the size of a softball! My only criticism is that the cookie was a bit hard (even after letting it thaw a little) which made it difficult to bite into sandwich style. Overall, the world needs more places like this!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ftUrNSpxUr8eWCyOlsZVgg"
  },
  "WLwO1g3hAtYxs-Vplh4OLA": {
    "date": "1/6/2014",
    "text": "I really enjoyed the simplicity of this place, order your food off of the menu on the wall and take it with you or grab a seat at a communal table and enjoy your meal while meeting someone new.   We kept our first visit simple by ordering fish and chips. I feel that they really did it right here. The fish was silky and flaky and the batter was light and crisp with no spongy pockets of oil. Probably the best fried fish I have had in the city if Pittsburgh. I was raised on Fish Fry don't cha know. The price was right and the lady at the counter was kind enough to answer a number of my questions about the menu since there were many things I have never heard of. The only thing that sort of irks me is the TIP jar on the counter of these places, a place were I irder at the counter, retrieve my order an than clean up after myself. Have I missed the point????",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "vNbr4JUZtIDB34xT-1n8ew"
  },
  "ehNU91xXwZjn3jod_yzY6g": {
    "date": "9/9/2015",
    "text": "Apparently the boxty fixins ran out which I can understand, but the attitude of the guy in the back leaves much to be desired.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9_xya5fc12U_qt4eEwbGPQ"
  },
  "_V8wdV1K7c5H1PXN32GrQg": {
    "date": "5/25/2016",
    "text": "The best fish and chips I have had in Pittsburgh to date. I have tried a couple of pies and they are also good. You should defo try it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V-FY5zG20RRJxMV2p_QKGQ"
  },
  "Jw4AcV6_a-bY2-JyNSUMSw": {
    "date": "4/30/2015",
    "text": "I LOVE MEAT PIES.... That said, I don't understand why this place is not open past 11 o'clock on a Thursday evening when everyone knows that everyone goes out on Thursdays in the south side... ALSO, the fried potatoes and GRAVY are mmmmmmazing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ckvVHQ0f5yPjUgyQx30hA"
  },
  "VaZNme0Ja3xHyytLpc6cdA": {
    "date": "4/25/2015",
    "text": "Stopped here for lunch before heading back to NY. So happy we did! The fish and chips were absolutely amazing and my husband loved the perch tacos. Will definitely return when in the area again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QRYrIbBfXJZU9Kf2YO_ABg"
  },
  "m5GClmzaMCXnknwuUTXliw": {
    "date": "3/12/2014",
    "text": "I want to give this place another try due to the reviews. I got the fish tacos and the fish was not de-boned making the whole taco disappointing. I will try the pasties next time I think since they look amazing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "d6JltKIeAbPj415bwSm7eA"
  },
  "5XuSsEsN_RfLyDz-yVYGOw": {
    "date": "1/11/2014",
    "text": "The pies are a little dry, but the tater tots are worth the trip on their own.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6iNo3orcpWBYXLbL5XN8hg"
  },
  "vV7Cd611GfhMhruSnmTtqg": {
    "date": "8/16/2014",
    "text": "Great food! Love this place. Best Chicken and chips I've had. Super friendly people as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q1Vi-rgFb34crha1BbLPAA"
  },
  "A2jkN_uUy0SBLg9JBMljCw": {
    "date": "9/6/2014",
    "text": "Was at Pipers next door and the food came from here. I had the Bangers and Chips and my girl had the steak pie. Both were delicious. The chips were actually fries, but very good fries. The good was very delicious and worth it. If only I had known, I would have just went straight here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IT_RtmTH-163g1Zo1J5UNw"
  },
  "ulhjp0532vfwXMkcxbxl3A": {
    "date": "9/13/2014",
    "text": "The whole menu is pretty righteous.  The Ripper is a sweet hot dog.  Perch taco is pretty awesome too.  All of the fried stuff is really good & the boxty tots are awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_0TKEDIcuWW5Y4BHo1t24g"
  },
  "beAQ59_PHzJ-XYKhKGh7Uw": {
    "date": "6/30/2014",
    "text": "One of my favorite spots! I had the steak boxty box and was not disappointed. Only complaint is that I ordered the Welsh Mac and Cheese to go, and they forgot to give it to me :(.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8IcKHujRTes3k4-ig5iogg"
  },
  "0opKkPLVtnFTBVoDfcCBeA": {
    "date": "10/20/2014",
    "text": "This is the place to go if you want English style food. Their potato salad and mac and cheese were great! The shepherd's pie had a little too much breading. The staff was super friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CMjjwZ43THQpVS9VwbpWOw"
  },
  "LxdOcuyhlHi76oz4WUQuog": {
    "date": "9/19/2014",
    "text": "The decor & seating is minimal BUT the portions & flavors are huge & delicious!  We both had the the Fish & Chips & we shared a Bacon Cheddar Boxty Tot Box.  The haddock was fresh & crispy.  The tot box was ahhh-mazing!  The staff was friendly & very knowledgeable of their menu.  I'm looking forward to trying their brunch in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "msBSUVBB1GCgb72uINjsCw"
  },
  "30IgV_CiOpq4boQq6A5sGw": {
    "date": "12/8/2013",
    "text": "Darren and friends brought me home some fried chicken, pasty, and a little apple pie from here, and it was all delish not to mention cheap. Recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7AGLlj5YzqdBfCPiZCa1mQ"
  },
  "Fh2nT4Ja1VUt2CXODstPEw": {
    "date": "4/5/2014",
    "text": "Not a lot to add to the accolades here - deliciously unhealthy fried food here, with great pies too. My only gripe is that I wish there was more seating and maybe even served beer? Piper's next door gets a little crazy with football matches sometimes, and I'd love to have a pint while downing my fish & chips.  Bonus points for the deep fried cadbury egg for Easter.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wSyyIXD587rqo4Ep_DPFaQ"
  },
  "D2gYmbFWFm8GFh78UGG3Vg": {
    "date": "11/27/2017",
    "text": "Excellent fish and chips, appreciate the fair price, 8 bucks. The chicken pot pie was luke warm, heating oven needs to be turned up, it's not great cold. Nice addition to Carson.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4IkfYZA-vWL3J9mzF72t5g",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Inside",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4IkfYZA-vWL3J9mzF72t5g/o.jpg"
      },
      {
        "img_id": "fSFq0my__U7gYGhkMI6TFQ",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Interior",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fSFq0my__U7gYGhkMI6TFQ/o.jpg"
      }
    ],
    "user_id": "ic-tyi1jElL_umxZVh8KNA"
  },
  "l1qgDlLL8jLs1unmaqL08A": {
    "date": "5/17/2019",
    "text": "The most perfect piece of fried chicken with an incredible biscuit....crazy good.  The Thai Tots were an unexpected bonus. Delicious and full of flavor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "62bJp_FNJHOBTlsUgtW9xw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/62bJp_FNJHOBTlsUgtW9xw/o.jpg"
      }
    ],
    "user_id": "ldBuTmwy7koJq8456Wayrw"
  },
  "ewznKNnxZdc5PEHdjNJShQ": {
    "date": "5/15/2019",
    "text": "The fish and chicken were both excellent. The chips tasted good too, even if they looked a bit overcooked. They have the full sugar Irn Bru, for anyone wanting to try it without artificial sweeteners added in.   A minor gripe I had is with the Lucozade. It's listed on their website under drinks and they had them in stock when I stopped in, but only after I paid did I see that it was actually the orange flavor Lucozade. They told me that's the only kind they had.  Lucozade and orange flavor Lucozade are not the same thing, they taste very different.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D7UdT5h7A5bEu7o9NPKIPA"
  },
  "TA9VawA959Cazvc_CD-S_Q": {
    "date": "8/1/2017",
    "text": "I'm so sad I waited so long to try out the Pub Chip Shop! I had had their doughnuts in the past but never ventured in for an order from there menu... well, after going there on an early Sunday morning I told my friends how good it was so they sent me back for a takeout order that afternoon.  A group of us all got different items and everything was amazing. My favorite (and what I returned for later in the day) was the Thai Chili Fried Chicken Boxty Tots.. O.M.G. Spicy, delicious, magical, all that...  Others in the group got a cinnamon roll (yummy and huge), a bacon, egg & cheese biscuit breakfast sandwich (very. good.), a scotch egg (first time I'd ever tried one, but she said it was the best she'd had), and the sausage and gravy boxty tots (his comment was \"I don't usually do white gravy, but this is fantastic\").   They have so many options it was difficult to choose -- seating is limited to the window bar with 4 seats and a block table that would seat somewhere between 7 - 10 people probably. Their drink selection includes coffee, bottled soft drinks, and a small selection of beer from what I saw.  Looks like I have a new breakfast / brunch place... and maybe a lunch and dinner place too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "GwywvINeQK9Z98uG65Rclw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. simple and delicious breakfast biscuit",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GwywvINeQK9Z98uG65Rclw/o.jpg"
      },
      {
        "img_id": "yjQ3TIc6Hmnw8Fl8GKpn8g",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Thai chili fried chicken boxty tots! AMAZING!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yjQ3TIc6Hmnw8Fl8GKpn8g/o.jpg"
      }
    ],
    "user_id": "MXE5dJEqzzfKDLEGkHbdVA"
  },
  "BMm4Y5poiZCAElIfnl7I6Q": {
    "date": "3/30/2019",
    "text": "Delicious breakfast sandwiches! I got the fried chicken and honey butter on a biscuit. Service was also really great!! Fun, cool spot. Will be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zIo9cjWcCASnU9v49_Nxiw"
  },
  "7QCyN5VFq0h39benB4EGbw": {
    "date": "7/1/2017",
    "text": "Wife and I went here the other night for dinner. We sore the reviews on Yelp and decided to give it a shot. I had a chicken pot pie and a salad. The place is on the small side and has enough seating for maybe 15-20 people tops. You go to the front counter pay for what you want then they call you to pick it up when it is ready. The food was ok, The salad was nothing special at all and the Chicken pot pie was cold and too me at least just ok. I do have to say I did ask the guy which was better the chicken pot pie or sirloin pot pie and he did say the sirloin. Maybe Ill go back and try that instead. The prices were excellent and the meal was very inexpensive. The guy behind the counter was very friendly and helpful with the menu. I would probably trying it again and give the place a 2nd shot as the prices were very inexpensive.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Sslme_x0NrwouYVwXE8nsA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Sslme_x0NrwouYVwXE8nsA/o.jpg"
      }
    ],
    "user_id": "hg71CGHy9bwpgY8cGVVg4w"
  },
  "m_zlj6oHAqoRzz6oWWas0A": {
    "date": "1/14/2018",
    "text": "The Steelers game made me sad but thoughts of this food, and giving this positive review makes me happy! I saw some previous reviews about this place and decided to try it out myself. It is the heart if the Southside of Pittsburgh that is loco but always a great time.  I was planning to eat there but it was so small, I preferred to do takeout instead. I ordered multiple items because one (chicken pot pie) I planned to eat later.  I did order the infamous fish and chips and it was totally amazing. The fish was perfectly flaky and the chips (fries) were so good. I asked for tarter and ketchup but didnt use it because I didn't want to disrupt the flavor. The Scottish egg was good as well. The next day, I ate the chicken pot pie. It heated up well in my microwave and still tasted so good!  This is a great place to go to during lent or any other given time. I am already planning my next time to go and bring friends and I might eat in and grab a beer.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 8,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "Y9wYzvz5U8ar-g0Wbyvwng",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. I got a chicken pot pie to eat the next day. And it is super delicious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Y9wYzvz5U8ar-g0Wbyvwng/o.jpg"
      },
      {
        "img_id": "Vp_94x93SeBDuwliAsY5bA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Delicious fish and chips!!!!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Vp_94x93SeBDuwliAsY5bA/o.jpg"
      }
    ],
    "user_id": "W0YPUUT-1jxzv0hjUi5mLw"
  },
  "8AdxNkkZs6due3G1kqK4SQ": {
    "date": "2/11/2019",
    "text": "Reminds me of my travels in England stopping at various chip shops. The fish and chips were excellent and I'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0fq238YFVW5qWcWwebQaQA"
  },
  "XfMJXTEZkfwBgQiltpxSDA": {
    "date": "7/6/2019",
    "text": "Family of five on a summer road trip. We were looking for an affordable place to eat where everyone could find something they liked. The kids loved the atmosphere the Mac n cheese and my hard to please 9 year old was all about the chicken tenders. The scotch egg was fabulous and the staff was even better! On the way out we got an unexpected treat some free donuts. Thanks for an awesome stop!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wCIEI2T1yretq2_tz_wQ1Q"
  },
  "EvzMjaqKfbEYy9BQ46EWvA": {
    "date": "12/29/2017",
    "text": "As I'm English I couldn't leave Pittsburgh without visiting here!  We went for lunch after exploring the South Flats and we were very happy with everything. Decor wise, it's not like a typical British chippy, it's more of a British chippy with an American twist, there is counter seating in the window and a long communal bench/table, all pretty basic. You order food and drinks (they have a small selection of British canned beers and sodas) at the counter and collect your food when they call your name. The sausage roll and scotch egg we tried were both very good. The chips were excellent - a little more well done than a chip in England but I prefer them browned rather than soggy - they were definitely chips rather than fries though! We also ordered two steak and ale pies which were good but not great - the pastry was very tasty but I thought that the filling was a little skimpy and on the dry side. Service was a bit slow but everyone was very friendly and this feast of more food than we could eat came to only $27.00! We have two British chip shops in NYC (one good, one terrible) and we would pay at least twice this amount for lunch in either of those so for us it was an absolute bargain. Next time I'm here I want to try the fish and chips - then again that sausage roll was bloody good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "FaTidK033JepnA6yCJc9-Q",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Chips, sausage roll and scotch egg. Authentically delicious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FaTidK033JepnA6yCJc9-Q/o.jpg"
      },
      {
        "img_id": "Qc1pJ2kucldxL4-9kQI4_A",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. CHIPS! A tad browner than a traditional English chip but they were so good - not at all soggy or greasy.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Qc1pJ2kucldxL4-9kQI4_A/o.jpg"
      },
      {
        "img_id": "A6cngyoY0DinklbD72CEEA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Steak and Ale Pie - very good pastry!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A6cngyoY0DinklbD72CEEA/o.jpg"
      }
    ],
    "user_id": "yga0sAW9eC7bAZsJeyogcQ"
  },
  "qhtCqfLydVP4hgPzx3MmEg": {
    "date": "1/4/2018",
    "text": "This is hands down one of my favorite places to eat in Pittsburgh and absolutely my favorite spot in Southside. The food is wonderful- it's cheap but high quality and packed with incredible flavor. My family loves this place too and so does my boyfriend. Sometimes I find myself here multiple times in a month and sometimes even in a week. My favorite item they sell is their Thai chili chicken tacos ($6), however everything else I have had is delicious too- their fried mushrooms, sandwiches, salads, sausage rolls, breakfast sandwiches.. everything is outstanding. The wait is never that long, and the food is always fresh. No matter how busy they are, I'm always greeted with kindness and friendliness. I love this place SO much!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "nRSPJaGlj7gGrx7Kp1M-Ew": {
    "date": "2/23/2017",
    "text": "I stopped over here for lunch since I've been anxious to try it out. They offer an extensive menu for very reasonable prices. You can order pot pies, huge donuts, sausage rolls and of course fish and chips or fish on a bun.  I decided to try the fish and chips. For $8.00 you can't go wrong! I choose the standard haddock filets and I had my meal in no time! All meals are bagged whether you eat in or take out. They have a condiment table with utensils. I just had plain tartar sauce for my fish. Two huge fried filets sit on top of a mound of French fries! They were good but very greasy. I'm not used to greasy food but if you are then I guarantee you that you won't be disappointed. I managed to devour both pieces of fish with bits of breading and fish that came peeling off as I try to cut it.  I figured I'd just use it for finger food. Went though a ton of napkins but enjoyed it. It was the lunch hour so the place wasn't overly crowded and most people were ordering take out.  So if you are a fan of greasy food this place is for you. Believe me I did enjoy my meal. Couldn't finish it since there were so many fries. Fast service and good prices make this visit worthwhile.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 10,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "kZ2a-KiWkZN780qPg4aFNQ",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Traditional fish and chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kZ2a-KiWkZN780qPg4aFNQ/o.jpg"
      },
      {
        "img_id": "SFLiYTrzY5bYQY1voVWszg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Choose your pot pie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SFLiYTrzY5bYQY1voVWszg/o.jpg"
      },
      {
        "img_id": "LsWGTbYWzHWGTIGa1Z0mMg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Donuts",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LsWGTbYWzHWGTIGa1Z0mMg/o.jpg"
      }
    ],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "78A1zM5Ozm96CnaO7s_YUQ": {
    "date": "3/12/2017",
    "text": "What?!?!  I have never had such a great cheddar pie in my life  Pie is crispy.  Cheese is the main flavor but the u found the cheese flavor is reinforced by the juicy pork at the bottom of the pie.  Greasy?! Not at all!!! U cannot stop from eating it",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-Pgch-Kj4MGS4xBoEaoO3g",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-Pgch-Kj4MGS4xBoEaoO3g/o.jpg"
      },
      {
        "img_id": "Ox_-MHXrQZ8JkAUiNxwA4A",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ox_-MHXrQZ8JkAUiNxwA4A/o.jpg"
      }
    ],
    "user_id": "qlTwCtl1aqctl-Kw2CRQ5Q"
  },
  "YxxyGpZ_ne89-SyHXpk2zw": {
    "date": "3/20/2019",
    "text": "Can't stay enough good things about the Pub Chip Shop.  If you haven't tried this place I would recommend any of the boxy tot boxes or the chicken and fries they are so good!  Don't forget to save room for dessert their donuts are amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-qQsfHI7nLRBqzAOaqlfeQ"
  },
  "1rAyzY0E3uQ_jr24vab-yg": {
    "date": "11/16/2017",
    "text": "Nice little place for a quick and inexpensive meal.  Have had the Fish & Chips and decided to try the Banger & Chips on this visit.  The Banger and Chips were good.  Received a little cup of gravey to go with the sausage.  The Chips are really good, too.   The staff is super friendly. There is one communal table that seats about 9 and a counter in the window that seats about 4. So not a place to eat in if you are with a large group.",
    "rating": 3,
    "rated": {
      "funny": 6,
      "useful": 16,
      "cool": 11
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "vHpNC3kpkzguoxNHj3w5Qw": {
    "date": "3/28/2019",
    "text": "British style food in Pittsburgh. Probably the only one. And thankfully they do it exceptionally well.   I highly, highly recommend them to anyone who enjoys fish and chips, because you won't get it better anywhere else in Pittsburgh.   Besides the incredible fish and chips, they also serve scotch eggs, baps (sandwiches served on their amazing homemade rolls), meat pies, and more. Everything they serve is made fresh to order, and comes out piping hot.  The people working here are also very, very friendly, which is something that can be rare in the South side. But they put a lot of care into their work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sFvLW68M8Z5MCaWvLj1PPg"
  },
  "uEAn4j0oyE0OGddeGQJ-rw": {
    "date": "3/15/2019",
    "text": "My favorite spot in Southside early or late night to grab some grub. Everything they make is delicious, I recommend anything on a biscuit and if you're in luck hopefully you can grab some warm donuts.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ELmDuJ8gLCBUiAvofWEH_w"
  },
  "gTljQFR_F_yxrW6xWh8iIQ": {
    "date": "3/24/2019",
    "text": "We loved the food here. The food was served hot and the fish and chicken were crispy. I got the thai boxty tots which were just yum. The serving size is pretty big as well - in retrospect, I should have shared my boxty. I was a little disappointed with the buffalo chicken bap, it wasn't as amazing in comparison to the rest of the food. There isn't a lot of room to sit, but we didn't have a problem  for the 4 of us on a Sunday evening. We also had the donuts - they are delicious. Do not leave without trying them - my favorite was the raspberry jelly filled one. Must go for a quick bite or if you're in the mood for excellent fried food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1SbLXfEhObYGiUVyrS2ZEg"
  },
  "mxkbBTL6-y-ba2g7v64aRw": {
    "date": "6/27/2018",
    "text": "When you just want fried fish and other amazing fried foods, this place is just too good to pass up when you're in Southside. We got the surf and turf meal (one piece of chicken and one piece of fish) and the bloody hot totty box. The bloody hot sauce is like the child of buffalo sauce and ranch, it's so good. I also have to admit that I was a little jealous of the totty box and will definitely get that the next time!   The service was friendly and kind. It took a while for the food to come out since they also were filling orders for their UberEats delivery (yes they deliver!), but well worth the short wait.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6BlTKLLNGztOkhObfHLCw"
  },
  "L4qJn8eUzG78gQqRInQ6CA": {
    "date": "1/23/2018",
    "text": "The thought of lamb and chestnut shepherd's pie is usually strong enough to lead me into Piper's, but I fought my inner Scotsman and made a trip to the Chip Shop... after all, it had been a while.    Always a great spot for pies and fried fare, I decided to stray to the more creative end of their culinary spectrum.  The gray and brown Sunday afternoon made me desire more of a punch to my senses because let's face it... this city is depressing in the winter since it rarely snows.  I was disappointed when I inquired about the doner ke-balls and was informed they were no longer offered (strike two for any Lebanese craving, since Kassab's is closed on Sundays).    As a backup plan, I easily chose the thai chili fried chicken boxty tots since I could feel the drool reservoir filling up as I read the menu.  Boxty are great on their own... but when formed into balls and deep fried to a crispy golden brown exterior and tender center, it's really the best possible approach to an Irish staple.  The chicken was simple, but well executed... crisp,well coated, tender, moist, and kept its integrity with the generous drizzle of spicy thai sauce throughout the box.  The sauce itself had a nice mellow heat and sharpness from the vinegar that played nicely against the richness of the fried layers below.  A topping of shredded cabbage and scallions provided a fresh crunch and contrast when combined with all of the other elements.  A great combination of flavors, textures, and resourcefulness of ingredients for a small place with a limited but creative menu.    I don't know if it's technically self control that I didn't also get the White Chapel (ribeye, welsh mac and cheese, chopped onion on a bap) to accompany... but there's always next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8XeVj-8kIOcqBqQFdVRUJg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. thai chili fried boxty tots.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8XeVj-8kIOcqBqQFdVRUJg/o.jpg"
      }
    ],
    "user_id": "70P8kYcQES7EhV7Uqg_CIA"
  },
  "8xhaYJZt7JjxDiLPg89stQ": {
    "date": "1/9/2014",
    "text": "LOVELOVELOVE The Pub Chip Shop enough to try to remember how to log in to Yelp so I could write a review.  That's love.  The Pub Chip Shop makes me wildly happy.  All the foods I have tried there have been wonderful, but the new addition of (weekend only?) brunch items has rocked my world.  Boxty tots with eggs and bacon on top?  And Welsh cheddar sauce? Pure perfection!   When I told friends who live in England about this place they sort of scoffed and said, \"I doubt it is authentic. I mean, one would need to be able to acquire mushy peas in this alleged chip shop to be authentic.\"  It was with great satisfaction that I was able to tell them that Pittsburgh's Pub Chip Shop not only has mushy peas, but they are, in fact, fantastic.   Only way this place could possibly be better is if it had the ability to run my food out and throw it in the car after taking my order and cc info over the phone or internet.    Warning:  Follow them on Twitter for the daily specials only if you want to immediately change your lunch or dinner plans.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TNtmpEMdWIAf5ljhbbubQA"
  },
  "ipCqTzdSpHOXVyFr2LKnnA": {
    "date": "3/10/2017",
    "text": "First time at the shop tonight and I loved it. I tried the guppy tots since it's Lent. The fish is unreal and the handmade tater tots are unlike anything I've ever tasted. Check this place out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W6U2IUf5aaVRC-KSlizzMA"
  },
  "dK6fiaGu39YNH2kSXJSr-g": {
    "date": "5/19/2017",
    "text": "Hands-down the best grab and go in the city of Pittsburgh. Fairly priced generous portions and very fast service. If I'm in the mood for a quick bite in the southside this is my go to every time. Also when I was a younger kid I used to wash dishes there and their kitchen is immaculately spotless. If I could give this restaurant 50 stars I would",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_7lmuMJ3Kyremmm742xYBQ"
  },
  "2RGt7Vt1qaSK_SzT8KOIcQ": {
    "date": "2/17/2014",
    "text": "This place is divine. We got a pasty, pie, soup and a dessert.  Everything was fresh, flavorful and DELICIOUS. Not expensive either! I recommend going for the pies- they are more filling and a little more bang for your buck. The soup we had- seafood chowder- was freaking incredible.  I also recommend going for the specials: -brisket/cheddar pie -Irn Bru battered Cadbury egg  This place is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aOKFxiYcOFFn9Tox3sc-4Q"
  },
  "BT5ggBYbQUvPR9mQGBB9Ug": {
    "date": "11/1/2013",
    "text": "I was really excited to try this place because I'm a savory pastry person at heart - if it's a choice between a meat pie or apple pie, I'm always gonna choose meat pies!   Checked out this place during their soft opening. The inside isn't all that big. There are probably seats for about 8-10 people at most. Most of the others waiting in line with me were doing to-go orders. I really like the theme they have going on - you should check out their cash register (I see someone has already taken a photo of it), it looks cool!  On to the food - I really wanted to like this place and overall I do. It's just that they got my order wrong. I read that one of their signature meat pies is their Steak & Ale pie, but unfortunately they told me they were out of that. So I ordered the Chicken & Mushroom pie along with their Steak & Oyster pie. Both pies were warmed up for me and placed neatly in a box. However, when I got home, I realized that while the box was properly labeled with my order, the contents didn't match. It turns out my Steak & Oyster pie was actually the Steak & Ale (which I  found out because instead of finding oysters inside, there were mushrooms). And instead of Chicken & Mushroom I got Curry Chicken (which I found out because there were lentils inside, instead of mushrooms).   Of course, it wasn't a complete loss. The Steak & Ale meat pie (5*) was delicious - I love the gravy sauce inside, as it makes the meat pie very flavorful. The Curry Chicken pie (3*) wasn't as good though. Inside it wasn't soupy at all, so I found it a little less exciting and the chicken a little less flavorful compared to the steak. But one thing they both do well is the dough - the pie crust is excellent, flaky, and not soggy at all.   So food was a solid 4*. And while they did get my order wrong, their service was friendly and fast. I could see how someone else might being more upset at the mix-up, but since it's their first week opening, I'm willing to give them the benefit of the doubt for now and give them 4* overall. I'll definitely come back to try their fish and chips and perhaps some of their other pies. Maybe next time I'll actually get to try the Steak & Oyster one.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PBzpX23U8Y5CTLs_foS8HA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. large curry chicken pie (left), large steak &amp;amp; ale pie (right)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PBzpX23U8Y5CTLs_foS8HA/o.jpg"
      }
    ],
    "user_id": "juxeERlmcWMqS4HeFdxIgA"
  },
  "9h8d7oD_2m30c69iFoliRQ": {
    "date": "2/24/2014",
    "text": "I love that you can get vegetarian and vegan options at this fish and chips place. I only wish you could order their pies from next door at Pipers so you could enjoy a beer with your meal.  Delicious and unique in the area. I don't know of another place like it in Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "74UCB3QqU9ZiWW8fT5sVKw"
  },
  "9ScAsObgtNrE9F0oBSnNVA": {
    "date": "6/23/2015",
    "text": "When this chip shop advertised the magic ingredient - curry sauce - i scoffed. Curry sauce is hit and miss in the the UK, where I am from, so no way did i think it could be replicated 5,000 miles from home. I didnt even order it, but my friend did, and one dip convinced me! The chips were golden, the pies flaky and this is the best chip shop outside of the British Isles i have eaten in. Chamone! Owww! Double michael jackson",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ll7sJJr_vrfynAOoaB97NA"
  },
  "-7pDKmd0NsneAO7yO7EzBw": {
    "date": "2/16/2014",
    "text": "So gooooood. Had the steak boxty tot box for \"breakfast,\" so much heaven. Eggs, fried taters, cheese, so much bacon I couldn't ask for more. Their cinnamon rolls are delicious. I risked the snow storm for their Saturday brunch offerings on account of hunger. Go try it. I had to take mine home to enjoy. :D",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QECqXbUhFa3d8npSviIthw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Cinnamon roll deliciousness in bag en route to casa. :D",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QECqXbUhFa3d8npSviIthw/o.jpg"
      },
      {
        "img_id": "bhaSzF6XqTyRvbYYcSHqfg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. In the bag steak boxty tot ready for devouring at home.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bhaSzF6XqTyRvbYYcSHqfg/o.jpg"
      }
    ],
    "user_id": "ozO-5ZxPT07pXyCdxRFhug"
  },
  "XSHsj6iaE0d8s10MzQzs4w": {
    "date": "6/21/2015",
    "text": "Very sad day last month. The food smelled amazing but the packaging could be improved. Spent like $7 on a meat pie thing to-go, and when I walked down the block I dropped it. Of course it ended up upside-down and the folded box opened to spill my pie on the street. I'm sure it would have been amazing. Maybe BYOB: Bring Your Own Bag if you get some thing to-go since it's not provided. Food here is worth the extra protection!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XEAXHnONOoR8xeRoNP5EtQ"
  },
  "EPb31N7o3K7OPthcmwf7VA": {
    "date": "2/20/2016",
    "text": "Had the Pork and Stilton pie, Bangers and Chips, and tried the Fish and Chips..... I cant tell you which I liked best because all 3 were fantastic.....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DHMnyEGE8cJ0VfeW9WvpQg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fish and Chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DHMnyEGE8cJ0VfeW9WvpQg/o.jpg"
      },
      {
        "img_id": "fdbid9RAEHcXNWTzekRGag",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Bangers and Chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fdbid9RAEHcXNWTzekRGag/o.jpg"
      }
    ],
    "user_id": "TMzafCSwg7aYAqu42zN6UA"
  },
  "-6siZvDJGVSfICIXvf4o_g": {
    "date": "2/15/2016",
    "text": "I must be missing something.  People on here giving this 4 and 5 stars?    I have been eating Mushy Peas my whole life and these are the first I couldn't get down. There is a peculiar taste to them that I can't identify. The chips have a funny taste also.  The pies are average at best.  Service is shaky at best.    I have tried this place at least three times and I am a regular next door at Pipers so it's not like I haven't given it a chance..  The people giving this multiple stars have never been to England apparently. Although one night I heard some people talking about Downton Abbey......maybe that counts.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Ogn_oM1QovgJJfRhMf4Mw"
  },
  "eVb1Q99BReEHKL63lKEcnQ": {
    "date": "11/28/2015",
    "text": "If I could give this shit hole zero stars I would. Worst place in the league. Took 45 minutes to get food. They have three motions; slow, slower; and slowest",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BiDiw4LF5QcNbC-Ne0liBg"
  },
  "hpcFuQWR9gnQdS-78Q0vBg": {
    "date": "2/4/2016",
    "text": "My boyfriend and I both had the fish and chips, which we enjoyed. The fish fell apart a little too much to enjoy fully, but the fries and tartar sauce were great. The place also had a relaxed and fun atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yrRcno5vFGQhsbQu5rWk2Q"
  },
  "VitWo--OTy3sMI6OaMOnBw": {
    "date": "5/9/2015",
    "text": "I ordered fish and chips as takeout. The chips were awesome and I really loved them. But the fish was just okay. They weren't tender enough for my taste. I'll probably come back to try other items on the menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JjDR060LJQcNNVWKuU64fA"
  },
  "FTcBWaGpD2-oWDC1q5I85Q": {
    "date": "2/18/2014",
    "text": "Best new thing on Carson Street!  Everything I have had is so good, I cannot really narrow it down to a favorite.  The savory pies are delicious!  And the Sausage Rolls make for create snack!  Excited that they offer catering as well, no more boring lunch&learns.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uUkDO1jFEVriWpTfG2a_AQ"
  },
  "hkgXEH8mhqQQaL-5ntAn9w": {
    "date": "10/21/2015",
    "text": "Captain Andy's platter.          The food was great. the guys were awesome . The place was cozy and friendly. the Captain andy's platter was pretty enough for two persons.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M-HXSpfPOgsM31f4CSZNNA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/M-HXSpfPOgsM31f4CSZNNA/o.jpg"
      },
      {
        "img_id": "4WIbWvzGcB1JiYVl5197_A",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4WIbWvzGcB1JiYVl5197_A/o.jpg"
      }
    ],
    "user_id": "44iK_lfH3TroSmG13nF8Lw"
  },
  "RbtLQkjWc4mlFERhItANWA": {
    "date": "9/19/2015",
    "text": "This place is amazing!  After not getting a waitress for over 10 minutes across the street we left there and decided to try here. So glad we did because this place is a hidden gem in the south side of pittsburgh.  The food is delicious and you get a lot for the price. Make sure u stop in",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s9xVmBbAwVh8y6xLL3W2UQ"
  },
  "ex-Ui7q-IeCIRkzRd6v9VQ": {
    "date": "12/10/2015",
    "text": "I've ordered delivery from here a couple of times and it has always been extraordinarily fast (20 minutes tops even when the estimate is usually around an hour). The food is delicious but only if you're in the mood for something pretty heavy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uc5Fba6ygQdMTtkcNoolDQ"
  },
  "oSHoelmtsed_yujVx4PMbw": {
    "date": "1/3/2015",
    "text": "Living less than two blocks away, I can't count how many times I have been here. Whether it be for breakfast, lunch, dinner, or after a few too many zima's; Pub Chip shop does not disappoint. I've tried a lot of the menu but always go back to the fish and chips or any of the boxty tot boxes for breakfast. My new intoxicated go-to is the ripper (chili cheese dog) and chips for less than $6. You do typically have to wait a little bit for your order but it is well worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hiCD-qwqN1ZHVuMOpu08eg"
  },
  "3oT1mVsYEvF1CUJVvd451w": {
    "date": "8/25/2016",
    "text": "The best fish & chips place in Pittsburgh. Approved and recommended by a British friend as a truly authentic (beer battered) fish recipe. The chips are amazing as well. And so is the tartar sauce. The serving is large enough for two small people or a big one. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H6b815p3QkCdsp5zbpux8g"
  },
  "GY68nJgvrDFdZMPOLY_jhg": {
    "date": "9/7/2019",
    "text": "Seriously some of the best food we have ever had. One person in our group said the Corned Beef with Cream Sauce and Egg on a Biscuit was literally 'the best breakfast sandwich I have ever had'. Everything was amazing, you can't go wrong. Our group had:  Tots with Welsh Cheddar sauce Corned Beef with Cream Sauce and Egg on a Biscuit (daily special) Chicken Pot Pie Donuts (maple bacon, chocolate sprinkle, plain glazed) Fish and Chips with coleslaw Sausage roll with mac and cheese",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oxZLL_CdAGneP_GijZbUhw"
  },
  "KDAkCehc5DhWG22zOqYIPQ": {
    "date": "9/2/2019",
    "text": "i will not be ordering form this place ever again...not only do they not follow their own website...they dont follow the customers specific request.  i called to complain that this is the second time my odrer has been medded up...i call and i get an\"um im sorry\"...explain to me how sorey is goin to fix this error..again...  will not get anymore of my money!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g1zltMl6MHgIcuPbT8o_UA"
  },
  "sh3xgkYKDiwk_sM6AUC8Fw": {
    "date": "5/3/2019",
    "text": "Stopped at the Pub Chip Shop on my way back to Cleveland from Fallingwaters thanks to a Yelp search and I was impressed.  Just a small mainly takeout place in a cool section of Pittsburgh.   The shop is just a small kitchen, a counter and a couple of tables, but it has attitude.  I ordered the Fish and Chips, which was a great deal for $9; for that I got 3 good sized halibut fillets and a large portion of fries.   The food took a bit of time, but it came out very hot and fresh.  The fish was fresh and well  cooked, if anything a bit too hot to eat right away.  The batter was good, although it had a tendency to not stick to the fish.   The fries were excellent, crisp and hot as well.   Overall an very good example of fish and chips.  I also got 2 doughnuts on my way out, a cinnamon roll and a mint creme doughnut.  Both of the doughnuts were nice, with the dough a little denser then most examples.  The cinnamon roll was nicely balanced, not too sweet and with a subtle cinnamon flavor.  The mint creme was rich and subtle as well, with the chocolate topping being a bit bitter.   Pub Chip Shop was good and the value was good, well worth a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RC8LJhbov46Z95CDZMAKRg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fish and Chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RC8LJhbov46Z95CDZMAKRg/o.jpg"
      },
      {
        "img_id": "4quJMI8_KgKXjkyekdqneg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Order here",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4quJMI8_KgKXjkyekdqneg/o.jpg"
      }
    ],
    "user_id": "dD5vTDPzv_79m8_zZhc9hA"
  },
  "tnGaLaCR00Nv9uqFmVlpTA": {
    "date": "8/19/2019",
    "text": "This place is great!! We go here a lot for breakfast and I love the honey butter friend chicken on a brisket! We also go for lunch/dinner and I just tried the Big Mctavish on boxty tots and it is delicious! It reminds me of a Big Mac. They also have awesome donuts and the service is always great when we go in there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PX-Q5yw7H6s4FwKqfFdpFQ"
  },
  "Uq-kIOctm7_SpVLk0w7uNA": {
    "date": "6/28/2019",
    "text": "Pub chip has always been my go to! On this particular occasion I got the bangers and chips, which is a beer battered fried sausage with fries! Food was great! I'll definitely keep coming back to this spot on southside. Any Yinzer should give this place a try if you haven't already!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f9O6cJbhHyJA7DfQY3zVSA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Bangers and Chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f9O6cJbhHyJA7DfQY3zVSA/o.jpg"
      }
    ],
    "user_id": "GP-gty-H00dLysmKLGXMCA"
  },
  "NOZO1WNuw1Zbls3TH3acpA": {
    "date": "5/1/2019",
    "text": "Came here for a quick bite before a concert, and I honestly don't get what all the hype is. I ordered the FISH AND CHIPS, which were $9. Granted it's a lot of food, but $9 for 2 pieces of fish and what seemed like half a pound of chips (fries), I wasn't sure if it was worth it. The two pieces of fish were pretty decent sized but the flesh and the fried part kept coming apart. And if I was in the mood for a fry only diet, the fries amount would be amazing. They give a lot and the fries taste pretty good, though could take me seasoning after the first few bites. All in all, the fish and chips were decent but felt a major grease food coma even before finishing eating.  The timing took about 5-10 minutes with only three other customers in the restaurant.  And the service was friendly but it seemed like it was out of obligation.   tldr; food 3/5 price 3/5 timelines 4/5 service 4/5",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "i2HY1rVGbwC5grXzzbPZdA"
  },
  "tQEzaZkReCarxfVahsGLRw": {
    "date": "4/11/2019",
    "text": "I love this small chip and fish shop!  I have been here a handful of times and am never disappointed.  I normally ordered the fish and chips. The fried fish crispy and delicious. The \"chips\", which are fries, are also pretty good. They are on the thicker side. Their fried shrimp is also worth the try.  They also offer Just Good Donuts, which are huge creative donuts.  As I said before this space is pretty tiny. They have two picnic tables and an counter against the window with seating. I tend to get take out from here and it normally only takes 10-20 minutes.  The staff is also incredibly friendly and helpful, even during their lunch rush!   If you're looking for good fried fish this is definitely a spot to check out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzCQo7SVZe8mWC7t72DKNg"
  },
  "Bvt-QlyQ2eskPUHaEbWstQ": {
    "date": "8/4/2019",
    "text": "Stopped in for lunch in a Saturday. 4 of us enjoyed ourselves immensely. Had fish sandwich and fish and chips. Both of which were amazing, hot and fresh. The perch fish tacos were ok as was the Thai chicken wrap which was super spicy. We also took a box of donuts to go and they were delicious. We will definitely return for a breakfast sandwich.  Highly recommend the fried fish as it felt were were back In London.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QXXqp9SplGzmtRYFyYZx7w"
  },
  "qihTTeMCDbW_9g7au23LSA": {
    "date": "12/28/2018",
    "text": "Came here to order one thing: The Scotch Egg. Scotch egg has been on my food bucket list for quite some time. I was incredible full from lunch, but if I weren't I would have loved to try their fish and chips. However, my stomach did not allow that and so I was just going to focus on my sole mission.  The scotch egg was hot and the perfect afternoon snack. It's basically a hard boiled egg wrapped in sausage then deep friend. It comes with a spicy sauce that resembles a buffalo sauce. Only thing is that I personally don't care for buffalo sauce, so if they had a more creamier sauce option that would've been perfect!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L7BotM61IKxS4CUBX7Mlqw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Scotch egg",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L7BotM61IKxS4CUBX7Mlqw/o.jpg"
      }
    ],
    "user_id": "-A7wqNBMClbU6Y8NNLdMvw"
  },
  "EFA5_Y77eTrbRUhN9vXKfA": {
    "date": "12/30/2018",
    "text": "Hubby is a HIGE fish and chips fan, so we needed to make a stop here on our way out of town. I mean, you kind of have to go to a place that claims its specialty is fish and chips, right?  Right. I had the steak and gravy boxey tots, and he, of course, had fish and chips. My meal had plenty of meat placed on top of their homemade tots (think puffy potato latkes...SO GOOD), and then some flavorful brown gravy on top. Oh, and throw in some crunchy, flavorful onion rings on top. Delicious and so filling.   Hubby loved his fish and chips. The fish was moist and flaky while beautifully coated in a flavorful, crunchy batter. The chips were so good, crisp and golden brown.   I'd be at this place once a week if I lived here just to have more of those tots.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "PofV0kt0RYTWtHQueAWoZQ"
  },
  "ciKlydTIEkXjiZOYzrnqyg": {
    "date": "6/1/2019",
    "text": "My husband and I are visiting Pittsburgh and we were looking somewhere within walking distance from our Airbnb where we could get some brunch. After sifting through yelp this one stood out the most! We made the short walk and were met by this quaint little food shop! The inside is small, only about 10 seats. But it wasn't busy and we found some seats at the high top facing the outside window - so it was nice to eat and enjoy the  view of the hustle and bustle of the city. The menu is small - but that's fine because their selections are awesome! My husband and I both got Breakfast Tot boxes and OMG - so good. Their breakfast is made from scratch and you can absolutely tell. The tater tots are home made. They are not your typical store bought tots, they are clearly home made battered balls filled with home style potato's. SO GOOD. They also have amazing gourmet donuts for $1.50 that we got to go! They have coffee and your standard side/water/beer to choose from. If you are in the area you have to check this place out! We plan to go back for more tomorrow morning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NyRvqsNApEDk06tV5kMYnQ",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fried Chicken &amp;amp; Sausage Gravy Breakfast  Tot Box",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NyRvqsNApEDk06tV5kMYnQ/o.jpg"
      },
      {
        "img_id": "-wG4Emlt8Rlv5UvDWspw2Q",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Maple Bacon and Cinnamon Bun",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-wG4Emlt8Rlv5UvDWspw2Q/o.jpg"
      },
      {
        "img_id": "at554PSo5kuj-QNQqJ_PWA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Inside area",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/at554PSo5kuj-QNQqJ_PWA/o.jpg"
      }
    ],
    "user_id": "A3cxdux-GkW-o8vJECXIwA"
  },
  "PlnBL3znJmSKTbp5zTsJJQ": {
    "date": "8/12/2019",
    "text": "Been here half a dozen times since it first opened. Numerous people have told me it's as authentic as being in London. The fish is the best! Lots of 'different' things to try unavailable anywhere else in Pgh. Baps, boxty's and pies. Try a scotch egg, weird & wonderful!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rkkUOuBOHuVrPui1vLC_IQ"
  },
  "USFdXvGQhol2lRJogaUQ9Q": {
    "date": "4/27/2019",
    "text": "Soooooo good. We visited this nice little pub/cafe/dinner place. It was great! There was limited seating but it all seemed to work out. We ordered the perch tacos, the chicken Thai tacos, and the surf and turf, which was fish and chicken and chips. And I also had Mac and cheese on the side. They all were soooo good. We split the chicken and perch tacos. The perch tacos were soooooo good. They were made with a breaded cornmeal batter, it was delicious. It had some cabbage in it and this awesome sauce on top. So good. The chicken Thai tacos were awesome too! The sauce on it was awesome! The chicken was veeeeery tender. It just melted in my mouth, which most chicken doesn't do that. I was impressed. And the Mac and cheese was of course awesome too! And then my dad had the fish, chicken and chips and he loved it too. And doesn't normally tell us that he likes something unless it is good. But so if your looking for some good fried food in Pittsburgh, come here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IEIPka1WV6UhXBcPfjTp_A",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Perch Tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IEIPka1WV6UhXBcPfjTp_A/o.jpg"
      },
      {
        "img_id": "Xstb4IjmqBarq0liIdkdow",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Mac and cheeeeeeese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Xstb4IjmqBarq0liIdkdow/o.jpg"
      },
      {
        "img_id": "29GfwLwzPMbNpFKWI3BQzg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Chicken Thai Tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/29GfwLwzPMbNpFKWI3BQzg/o.jpg"
      }
    ],
    "user_id": "HLSdvLpaSDZ1JPoIASHniA"
  },
  "RM2t6JKRTwQod457kOh4Uw": {
    "date": "11/11/2018",
    "text": "My favorite \"fast food\" in Southside or ever! They do fried food so well! I've had a ton of the menu and my favorites are Thai chili chicken boxty tots, the white chapel bap, and chicken and chips. Everything I've had has been delicious. Best hang over cure or when you are craving fried foods. It's always made to order which can cause a bit of a wait but well worth It! Love pub chip !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LGAbfjZkFwGhZjQZ0u1P-g"
  },
  "fgiXCfREalppdGjWvsSZrQ": {
    "date": "3/12/2019",
    "text": "Made a special trip to try out their fish and chips and was really pleased with the quality of fried fish. The fish was flaky and had a fresh kind of feel. The batter was crunchy and added good contrast to the interior (although it did kind of fall off from the huge chunks of fish - perhaps the batter would hold better on long pieces of fish vs. breast-like chunks). Overall not too salty, so I highly recommend using their sauce (tartar) or drizzle on your own favorite. Will definitely return to try their pies and doughnuts!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "wRtDGmMriHBQSfqW15szJQ"
  },
  "jFFFPYF22SOi6Mr91SSKeQ": {
    "date": "4/10/2019",
    "text": "Stopped here cause I was feeling some fish n chips. When I say to ignore the inside I mean it!! The taste of the fish will surpass any ill feelings toward the gritty inside! There's only about 10-15 bar stools in the whole place so not much room to sit. Those bar stools belong to two long tables where they expect everyone to sit?! If you're a germ freak I would only order take out. If you get the fish n chips THATS ALL YOU NEED the fish is HUGE. I highly do not recommend any sides I got the coke slaw (horrible decision) it was just dry cabbage with barely any sauce. My partner got Mac n cheese and it taste like they use cornstarch to thicken it. Did not taste like Mac n cheese not one bit. Def worth the fish n chips though",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LEXdsjyq3xbHtJ-6Hj0DtQ",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LEXdsjyq3xbHtJ-6Hj0DtQ/o.jpg"
      },
      {
        "img_id": "Aznlkj6FBY9XwS218mivLg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fish n chips with my horrible cole slaw",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Aznlkj6FBY9XwS218mivLg/o.jpg"
      }
    ],
    "user_id": "BQJp0zg-3vW69opTYMBRZA"
  },
  "XYvpMT9OCWBrrsBrx3Y-mA": {
    "date": "8/1/2018",
    "text": "Amazing. I've been coming here for several years now, and I have yet to be disappointed. The prices are so cheap, and the food is quality and delicious. I always go for the boxty tot boxes because they're like $7 or $8 and so filling. The thai chili one was my first try, and that's when I knew I'd be back time and time again.   They also have some cool dessert options if you have a sweet tooth, not to mention, they serve awesome donuts if you get there in time. One night my friend and I stopped in for a quick bite, and we were given 2 donuts on the house just because. Service is quick, food is great, staff is nice...not much more you can ask for.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jhm1OR3WVUpk_hBTi4Fh3g"
  },
  "WpYkrRxLz9wCBIY3gacmeQ": {
    "date": "3/21/2019",
    "text": "Very solid fish and chip shop on Carson. Prices are great, $9 for a big portion of fish and chips. They sell donuts and other small savory pies. Wish I had more time to try the other things such as Scotch egg. Parking is tough in this area but worth it for this.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-ul9XddtUbc_7m-NQHtgkw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fish and chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-ul9XddtUbc_7m-NQHtgkw/o.jpg"
      }
    ],
    "user_id": "KcV5vtjabrr-On0i9BU5eQ"
  },
  "9P3Sq-P1IksNX5t2eqd6Fw": {
    "date": "12/16/2018",
    "text": "The Pub Chip Shop is amazing. I went as a late night snack trip with friends. I got a small order of fries. I paid less than four dollars, excluding tip. The order of fries was far from small, which was amazing! The fries were hot and delicious. I ate my food inside of the restaurant. I left feeling full and satisfied.   I highly recommend The Pub Chip Shop to anyone looking for a late night snack on the South Side. I look forward to go back. Further adding to my experience, the staff are very warm people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TiiVWUPoYY3KGUJ66awPwA"
  },
  "_EORveJ-xxbqWHBYmT0K6A": {
    "date": "12/22/2018",
    "text": "I enjoyed the fish and chips here more than actual fish and chips meals I've had in the UK.  Fries were perfectly crispy and soft and not too thick.  Coleslaw also good.  Susan had the fish tacos and they were a bit salty.  Look forward to trying their chicken pot pies and their breakfast sandwiches on their homeade roll which is excellent.  Yeah, it's my new go-to for fish & chips.  It's take out and delivery mostly.  A few counter like eating spaces in this very small shop.  Service excellent.  Very friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M6pvHFQmVCZkImRnzYbv1w"
  },
  "p3BRsQiB1McaSD1kxT0NbQ": {
    "date": "6/27/2015",
    "text": "I took my kids here, because I was excited about their menu, and I was craving fish tacos, the crew at pub chip are awesome and the food was off the charts, my tacos were super fresh and my kids loved their food.  I plan to make many future visits.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j9UiVn52nPnQqxeavPK7Gg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Boxy tots",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j9UiVn52nPnQqxeavPK7Gg/o.jpg"
      },
      {
        "img_id": "k87l9kgBMochS1V3JQ1z8A",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Chicken sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/k87l9kgBMochS1V3JQ1z8A/o.jpg"
      },
      {
        "img_id": "EU6Vy2xLCoRasmYBE0X2Bg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Lake Erie perch tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EU6Vy2xLCoRasmYBE0X2Bg/o.jpg"
      }
    ],
    "user_id": "ZaN_gdRNcixoocfnldhiVg"
  },
  "FeFH891mo3Rqi8rlLP_NrA": {
    "date": "3/25/2015",
    "text": "It's unique, tasty and exactly what you'd expect. You're not going to out-cardio what you order and everything is brown. Brown as in fried, but isn't that the point? Scotch egg was great and this place would be perfect late at night stumbling in between bars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aoG5VWIQ8MCMuit4j4tMfg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Scotch egg.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aoG5VWIQ8MCMuit4j4tMfg/o.jpg"
      },
      {
        "img_id": "r1dfNqA5aZERO3XAAZGmtw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Nothing. Is. Wrong. With. This.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/r1dfNqA5aZERO3XAAZGmtw/o.jpg"
      }
    ],
    "user_id": "au7FVtivg_OKZmkvhmSAhQ"
  },
  "8A4m6PLnNnb2OHr378X0rg": {
    "date": "11/11/2013",
    "text": "Yum yum yum yum.  This place makes me wish I was born a Brit! I say five stars just because they have deep fried Mars bars (and I haven't even tried one yet)!  However, I did taste the boxy tots, chips and pierogi pasty and they've stolen my belly's heart. (That's a thing).  I plan to go back and drink buckets of Welsh cheddar sauce and try everything else on their menu.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "fFPc6xeOebK1ns8qYuUfew"
  },
  "csfFqOcEHBjBaC-t_FM6og": {
    "date": "9/27/2014",
    "text": "Amazing! Food is really good, you can't go wrong. The shop is tiny but they are going for the English style take away chip shop vibe.  Their meat pies are fun but I am a big fan of the tots and the shrimp and chips!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L2_5dUNYDI4USpGSCsH_2w"
  },
  "sOYNhdpYgcSKF1Dl-cChpQ": {
    "date": "3/24/2016",
    "text": "Really nice little menu.  Always changing the specials.  The mac and cheese is some of my favorite I've ever had.  Wonderful fish and chips.  Fish tacos are also super good.  The fried shrimp is only okay.  The staff can be a little surly.  Great prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K-nJvlZKQOHp1R5CkHh0Eg"
  },
  "5GaLvrDREFsdEUYBP9m7qQ": {
    "date": "1/27/2014",
    "text": "The Chip Shop is on a mission to change English food's bad reputation.  You won't find bland, overly salted, or soggy fried food here, only freshly prepared UK soul food classics with creative twists.  Will the food here take years off your life?  Will the food here add life to your years?  To both questions I emphatically answer, \"Yes, absolutely!\"  I'd like to start by saying that I lost track of time and accidentally skipped my gym class to eat fried food here.  My original plan was to workout for 90 sweaty minutes of pain and gain.  Instead I lost track of time and space, sampling the various beautiful battered bangers that the chip shop proudly purveys.  In hindsight, while many would be ashamed of such behavior, I regret nothing!  The chip shop is worth skipping out on important life events like anniversaries or possibly even your own wedding (If it's meant to be, they'll elope and conduct the ceremony at the chip shop)  If I'm running late for a triple bypass operation, safe bet you'll find me here, scarfing the best crispy fish and chips I've ever had outside of London.  Pittsburgh does fried fish well in general, but no one does it better than the Chip Shop.  They offer all the fixins' from heinz ketchup, to grey poupon, to sriracha, to malt vinegar, and tons of extra homemade sauces in between, like thai chilli sauce and ranch dressing.  The mac and cheese texture and flavor were excellent, pro tip: add the provided malt vinegar for a little hint of tang that perfects it!  My wife got the Scotch Eggs which are hard boiled eggs, wrapped in sausage, then deep fried.  When you polish off that artery assassination, you can finish off with apple pie or an over the top oatmeal toffee chocolate chip ice cream sandwich.    Friendly fast and knowledgeable service.  Extremely reasonable prices.  Attractive wooden butcher block tables and window views.  An epic vintage cash register to ring up the best UK comfort food you'll find outside of the isles.  It don't get no better!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MDeA-Gx8NScCyAdziq7IeA"
  },
  "aqd4mWVCTlryVOXY4RGdEw": {
    "date": "12/18/2013",
    "text": "Shit here be bangin! It's so nice to get authentic chippy food.  If you loved the fish and chips from next door, try them here. The different fryer, etc gives it a whole different experience. Also, I don't care what you order, but get a side of pan gravy. That stuff is so thick and delicious that I may order up enough to fill a kiddie pool and have a pan gravy wrestling party. I love it! Only complaints I've heard were from morons who were upset that the food wasn't 'Merikan enough.....because, you know, chips should always be loaded with a pound of salt and the fish should always look like the crap you get from the VFW over Lent. Of course, those types of people will never be satisfied (unless eating disgusting food from the VFW apparently)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yiFA-ciVMZlS3i0_OVqLsQ"
  },
  "MqTcqIs8xrAEjOCDeX27iw": {
    "date": "11/27/2013",
    "text": "The fried fish was huge! You get two giant pieces of fish and \"chips\" with your order for $9.  I would have to say the fish tasted very fresh and was cooked just right. The fish was a bit oily (which is expected because it is fried) but had a little too much batter also. It was still very tasty.  The fries \"chips\" were very good. They left the sins on when they cut them, which I love.  There is very limited sitting in their shop. It is primarily used by guests that are waiting for their food to be ready. Do not expect to have a spot to eat here unless you are alone or with one other person, but be prepared to take your food to go.  I would eat here again without hesitation. By far one of the best places to get fish and chips on the Southside.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-pi-twvDI08ubRth9q0kw"
  },
  "hYXRudcp0HQizrDlT-_fNA": {
    "date": "3/6/2014",
    "text": "This place is absolutely da bomb. Fantastic food of all kinds and the British/Scottish is as good as it gets.  Go for the fish and chips. The battered cod is quite fresh and the batter that they use to coat the cob is heavenly. Their daily specials are also quite a steal. Just be sure to ask what they are when you go or just hit up their Twitter for that info updated daily.  Their pot pies are amazing (great combinations). Their Clam Chowder is yummy (warm & creamy, full of flavor). And the Scottish Eggs are quite the transcendental experience. Prices are quite reasonable. You can't really go wrong with just about anything.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MLf4JUa1uzQkDLrBJ5yJHA"
  },
  "QJmx2A7ysU2ZTHTSCCW8pw": {
    "date": "10/21/2015",
    "text": "Definitely a place to check out. Perfect drinking food and everything I've had has been tasty. The club with fried bacon, boxy tots steak n gravy. And fish and chips.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PypkjqKiBy97ajcXZ9oSPw"
  },
  "naQjhs8BuDsPP4uNgfqoHg": {
    "date": "6/18/2017",
    "text": "Shop serves very tasty food. Was in town 3 days, and managed to stop in 4 times. A good variety of food choices. Fish and chips, shrimp and chips, White Chapel steak bap, Thai Chili chicken boxty tot were all thoroughly enjoyed. The fresh donuts are awesome. Everything seems to freshly prepared, so give yourself a little time or call ahead. A lot of impressive food comes out of a pretty small establishment. Prices are more than fair for this area and the staff is friendly and accommodating. This place is a keeper",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IZsTRL4L0Hob6EqxO6AGtA"
  },
  "5PIk_0V0TXw9rUd6jOPI1Q": {
    "date": "3/27/2015",
    "text": "I love this place. This is one of those South Side joints that I can't get enough of. The staff has always been extremely friendly- one time the gent working the register shorted me a dollar in my change. I completely didn't notice and was pleasantly surprised when he walked over to me after realizing the mishap and returned me a buck. Sadly, not too many places these days can I say for sure would do the same thing.   The perch fish tacos are great. The Scotch Eggs are great.  The steak and ale pie is great.  Notice a trend?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kT-yh4-9OB0yIMenzcsKjg"
  },
  "N3gK35nuNfuEqV-JWC4j0A": {
    "date": "3/18/2014",
    "text": "Yummy!  We stopped in for a quick meal during our St. Patricks Day adventure. We had been to Pipers Pub, and had really enjoyed it, so when I saw that the Pub Chip Shop offered crispy seitan and other vegetarian and vegan choices, I knew we had to stop in.  Very clean and the service was very friendly. We chose to eat in, and were able to watch the Patty Day revelers walk a stumble by. We got an order of the crispy seitan and chips to share, and the one order was enough for both of us. The seitan was DELICIOUS! Nice and crispy, full of flavor, and enhanced by the many different sauce choices. The chips were as they should be, hot, crispy on the outside, properly saltedc and nice and fluffy inside. Needless to say, we gobbled it up. We're already looking forward to going back, and trying some of the pies and the toffee chip cookies. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sAguDf_GGRqoILqnAAaiKg"
  },
  "J6VuMElQcS-wXIiAr8xq2g": {
    "date": "2/20/2016",
    "text": "The Welsh Mac and cheese is ok, I wouldn't buy it again.  I love the Thai chili chicken tacos. They held up well on the ride home and the sauce didn't make the taco shell soggy.   It kinda grosses me out that the donuts or whatever are just sitting there with no covering and they hand your food to you over them. I can't wait to go back and try more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hXQs_mhB7gAmPJV-5ieXgg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Thai chili chicken tacos and welsh cheddar mac and cheese.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hXQs_mhB7gAmPJV-5ieXgg/o.jpg"
      }
    ],
    "user_id": "ZU0gNiYjVJbrqQzyEjlYrw"
  },
  "kl4EX0_IPWwoVIH6vdRXag": {
    "date": "1/7/2014",
    "text": "The Pub Chip Shop opening was the most anticipated South Side opening of 2013 (and possibly 2012), and it was worth the wait.   You really can't go wrong here from everything I've ordered (or watched others order). The baps (sandwiches), pies, and fish & chips are all outstanding. The only problem is you can easily order way too much food if you're not careful. No, you do not need a side of fries with that bap (if you're me). Try the mushy peas which actually taste like they have fresh peas in them.   It's best if you are taking your order to go as there are not many seats (and the seats that do exist aren't the most comfortable), but they do have more condiments on the counters than you can shake a stick at including the dreaded staple of pub food - malt vinegar.   Service is quick and pleasant at lunchtime, and they are also open for late-night Carson Street munchies post bar crawl. Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S1cjSFKcS5NVc3o1MkfpwA"
  },
  "lAZ1dKa2RdIYUgiD21FV_g": {
    "date": "2/24/2016",
    "text": "The steak and ale pot pie was tasty as was my girlfriends chicken and chips. Will be back to try other items",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CR0D39AqYLrClEpLU31OkQ"
  },
  "o1jD-frig5VkZU4N30QpsQ": {
    "date": "5/22/2016",
    "text": "This place is superb! We ordered fish and chips and a scotch egg and they tasted amazing! Easily the best I've had in Pittsburgh. We had to wait about 15 minutes for our food because they literally cooked it to order. Nothing tasted frozen or precooked- all very fresh! The indoor eating area is quite small so I would imagine it would be difficult to find a place to sit if we would have come when they were very busy. Great food and atmosphere overall.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5fhJbGROCakn8mCSwcFiwg"
  },
  "b1cKGgop2c84mV8c-m1ENQ": {
    "date": "10/17/2014",
    "text": "This is one of my new favorite places in Pittsburgh. It's very affordable and the quality of the food is amazing. We had the thai chili boxty tots, fish and chips and apple pie. All of these were good, but the thai chili boxty tots were my favorite. The combination of the heat from the chili and the juiciness of the chicken, plus the tots was outstanding.   The only problem with this restaurant is having to choose only one or two items. There are so many things on the menu that sound just as good. I'll definitely be back to try more of them.  One item of note: there's only seating in the entire place for roughly 12 people, so plan accordingly. The food is all packed for take-out, so if you can't find a seat you're still in good shape.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KVAUhlVG6OZ2lR2O5lomXw"
  },
  "HFnsaoLke1EAFL_YJICXNw": {
    "date": "11/20/2013",
    "text": "This place was great.  Went here for takeout the other night.  We ordered a bunch so we could try a lot of different menu items and even had some for breakfast the next day!   What we sampled: Cornish Pasty My husband adored this and I thought it was really delicious.  The crust was really amazing.  Fish and Chips Delicious.  Flawless.  Non-greasy.  Boxty Tots So good.  I know it is blasphemy, but even better than the chips.  Full of flavor!  Breakfast:  Scotch Egg Not for me, but I don't like eggs.  My husband on the other hand loved it!   Sausage Roll Delicious even the next day!   Dessert the next day: Apple pie Delicious even heated up!  I can't wait to go back and have more of those fish and chips and try some more of the menu.  Also you must get the Thai chili sauce!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kXt6tPSGLWhWTiXO7XPjuA"
  },
  "GSKV6DPk8kc-WTruiTudug": {
    "date": "2/3/2016",
    "text": "My friend and I tried this place on a whim. We were greeted by a very friendly women who was working behind the cash register. She took the time to describe the menu to us and offer her recommendations. I tried the Beef and Cheddar pot pie and my friend had the Boxty Tot Thai Chili Fried Chicken Box, both were excellent. We also tried their homemade fries and mac and cheese and were very impressed. Definitely would recommend this place to anyone looking for some quality comfort food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YFyV9ebkqFoMb65xsUcIhA"
  },
  "hyBQicaRRE8t4chGMkABdA": {
    "date": "6/3/2016",
    "text": "I had the perch tacos , very nice size and tasty and worth the price for sure. Had the mac and cheese and was disappointed with it. Fries seemed to be the hit for sure. Pretty good size portions for the price. Tots are awesome and very unique. Will definitely go back to try some different things. Solid choice in grub.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tpLWXsk3Uyx_qyxcN_tEA"
  },
  "txyJt2QxOtlV5PIEZI4sRg": {
    "date": "6/25/2017",
    "text": "Just as good as if you were in London! The scotch eggs and steak and ale pies are my favorites.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JRwacA7kVVeP_L42hM8hlQ"
  },
  "5d_v6zAgjxJ_OXgkaZShwA": {
    "date": "3/22/2017",
    "text": "Great food if you want a heavy, fried, delicious meal. The pierogi pasty was heavenly, as were the boxy tots (believe we had bacon/cheddar). I got both fried fish, and fried chicken. The fish was a little drier than I would have liked, but it had a good crispy outside. The chicken was your classic fried chicken. Also, the Thai chili sauce was amazing, I would love to know what was in it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YMpDzxGN-0lmbaaoMbZ8OA"
  },
  "7WcMWFQN2yn3rp3hN4ldPg": {
    "date": "3/5/2016",
    "text": "I treated myself to Andy's Platter to go and it provided a great sampling. Everything was cooked to perfection: * 2 large oysters with an herb breading * 2 large shrimp with the shell off * 1 large piece of chicken * 1 large piece of fish - there were some large bones so be careful * And a generous heaping of thick cut fries  With this, you can choose some dipping sauces and I was recommended cocktail for the seafood and cheese for the fries so opted for both. However when I got home, I saw that they had given me tartar sauce so make sure to check your order! Aside from that service was great and my order came out in ten minutes but I went during an off peak time. The Pub Chip Shop had put all of the food in a paper basket lined with paper at the bottom of a paper bag. This was great because all of the steam from the food made the top of the bag soft and thus ripped ever so slightly when I grabbed the bag when I got home. Everything was good and still crunchy after 20 mins of driving though my favorites were the shrimp and oysters. I found parking on the side street near Primanti's. It was indeed a very gluttonous meal for me and will be back any time I'm hankering for some oysters and shrimp!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "57tf_RmT5o3BiFj2gpV-Jg"
  },
  "P9MY_TfhoKAOT_Zye_eMRg": {
    "date": "4/1/2015",
    "text": "We were famished after a concert and needed some late night eats.   So we headed to the Pub Chip Shop and weren't disappointed!   We spit an order of the Thai Chili Chicken Boxty Tots. Amazing. If you like heat order them!    I had the seafood pie, it was both filling and delicious. Pittsburgh is lucky to have such a unique eatery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e-_DOsAqDX798Rgogv_v9g",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Front window counter at Pub Chip Shop",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/e-_DOsAqDX798Rgogv_v9g/o.jpg"
      }
    ],
    "user_id": "wkokiWbTL9yf-NJUK6cb8Q"
  },
  "p8qCfRfDFCzkdYkS2yocjw": {
    "date": "9/25/2014",
    "text": "Bravo! This is hands down my new favorite food joint! Nothing beats the prices, portions, and excellent customer service! Everyone here is super down to earth and friendly! It's so relieving and it makes me want to continue coming back.  I recommend the bloody hot seitan wings, best in town for all you veggies! Also the FRIES!!! Seriously, amazing. I've had a lot of fries in my time, I'm sorry, chips, chips in my time and these are hands down the best I've had! Moral of this review, you will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aNJogHW8kFn0_ynQrz-lkg",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Bloody hot seitan wings and fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aNJogHW8kFn0_ynQrz-lkg/o.jpg"
      }
    ],
    "user_id": "kRrmx1ArhyIyOcO1Fts2mg"
  },
  "_SXJYba6b-A7Ge4jIcn1Ag": {
    "date": "5/30/2016",
    "text": "Disappointed to have to say last time we ate here my boyfriend and I were fighting for the bathroom for two days. Too much info I know but I've warned you. Dirty hands handling it I assume. Sucks because it really was good, used to lovee this place. Never again though.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T3KNEZWQIsohf7kI-t0bGw"
  },
  "45IMcY6pjsOjMhMJQ7sIQA": {
    "date": "1/1/2016",
    "text": "Quality unmatched! These peeps r serious about the food that leaves their kitchen. And you can even get delivery thru grub hub!!Little storefront with cool tables that have a foot level- and stools - nice picture window: great people watching in SouthSide! Been here a bunch of times- used to work around the corner. Smells like love in here, warm cozy. This time i ordered myself a chicken salad w ranch ( alll dressings homemade :) ) and the man loves fish n chips so I ordered him those plus chicken n chips, sausage roll, and scotch egg.... We've had all before, and hey why not - no need to cook the rest of the weekend - I love the honey mustard sauce too.. Mac n cheese is so delicious they're sold out. Not surprising for a national holiday of hangovers!so friendly and nice too!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9cHwoFocl2YCsg9mg7MCw"
  },
  "HmTZwCz3PF2d2Z13UcaC3g": {
    "date": "11/23/2013",
    "text": "The Pub Chip Shop serves as a model for that which is novel and affordable in modern urban dining.  Nothing on their menu is above $9, and everything they offer is either a twist on the familiar or something uncommonly seen in this city. Furthermore, much of what's on the bill of fare can be eaten without utensils, and all of it is easily portable. A week or so ago, a couple of friends from out of town and I took a Sunday evening drive down to the South Side to see what was causing such a stir and found that the buzz is justified.   Brick walls, an antique cash register, a case full of odd-looking pastries, and a gang of young gents with tattoos and hip facial hair met our gazes as we passed through the Pub Chip Shop's doors. Dining space is limited to some stools, a counter, and a table, but luckily this part of town wasn't brimming with binge drinkers at the time.   Considering the shop's incredibly reasonable pricing, we elected to take on damn near half the bill of fare, which ranges from purely Scottish delicacies such as pastys, boxty, and baps to more worldly eats like pierogi, Doner kebabs, fish tacos, and fried drumsticks. The three of us stood with fists upward and stomachs roaring, our appetites guided by the spirits of freedom-fighters long fallen. We knew that a horde awaited us, the outnumbered...  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DuUoyRCgyOYs&s=8abd6eb1425620315d1a9715c8dbb44dc436dc50e068f040dadd20e46111e92b\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=uUoy...</a>  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DWvI8Ll62fPU&s=667185bdea31dd90606666194e9e18d13dbb727a9d0e4ce5ffa5f4d5a8a8e2cd\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=WvI8...</a>  The army of food we faced included battlers from both the British Isles and The States.  Two weighty clucker legs, brined, flour-coated, and christened in hot fat, not all of which was drained, charged forth first. The poultry within the brittle, seasoned jacket was dewy, fragile, and full-flavored, displaying that the UK has its own mastery of Southern cooking to contend with. I would spare one of the warclubs of protein for Kay to devour later at home.   A squadron of fried oysters stormed forward next. Coated in armor of cornmeal, each mollusk bled heavily. Juice and saltwater rushed down my throat as I conquered each crunchy, slippery, brackish minion. An honorable cole slaw that was creamy but not overly so would cleanse my palate for what was to come.  While Matt and Renee clashed with bangers, rashers, and vegan vindaloo (!), I had a goliath of a pot pie to challenge. Round with walls prison-high, the Seafood Pie was a circular panzer of bronze, flaky dough that contained within it a milky yet hearty stew of haddock, oysters, and shrimp. The \"creamy sauce\" as described on the menu made its presence known, but did not coat the tongue so much that the seafood's robust flavors were missed. I split it open, destroying the craft and vanquishing its inhabitants. Onward...  \"Chips\" accompanied the chicken and the oysters and may as well have been golems of gorgeously saffron-colored spud. Forged from a union of mashed potato and potato chip, the exteriors were hard, but when punctured revealed lush, fluffy interiors. As they mindlessly, obediently marched towards me, I crunched and munched through these tuber soldiers with the ruthlessness of a tyrannosaurus.   A terrifying trio of desserts would conspire for my final test: Grandma's Apple Pie, Oatmeal Toffee Chocolate Chip Ice Cream Sandwich, and The Deep Fried Mars Bar.   Craggy and long like a scaled sea serpent, I've long tracked the Deep Fried Mars Bar like Bernard Heuvelmans did the Loch Ness Monster. I had seen it prepared on television. I once tried to recreate it and failed. The True nature of my mission had been revealed. For too long, I'd been...   <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DUEpcS1r9-m4&s=16d6728425b0a98d10092f40a06d2b0905a7a627f9287a7e37bc602b4acae11b\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=UEpc...</a>  Before it would allow me a duel, it would first put a pie and a cookie in my way. The ice cream sandwich was captured and detained, but the apple pie was overstuffed with shards of tart, caramelized, cinnamon-dusted fruit and a sort of \"cream\" as PCS calls it,  the crust remaining essentially the same as that of the seafood variety. The cookie sandwich had a rocky, candied, frozen exterior, but the power of my jaws and canines proved too great to protect the chilling, vanilla-flecked dairy product.   The Mars log had no more beasts to second it. Hissing, it lunged, I sidestepped, taking a huge, telling chomp out of it, nearly burning my mouth on its molten, luscious innards of chocolate and caramel. To feel the sugary and crisp give way to the honeyed and luxurious is one of dining's greatest pleasures.   With this trial complete, we headed back home with prisoners of war for Kay to have her way with.   The Pub Chip Shop is the worthiest of restaurant experiments for it is directly taking on the fast food hegemony with horns out.",
    "rating": 5,
    "rated": {
      "funny": 12,
      "useful": 12,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "ii9tAbfKNkMr6MEWJkK8PA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. old fashioned cash register",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ii9tAbfKNkMr6MEWJkK8PA/o.jpg"
      },
      {
        "img_id": "9_i6fgn3N7BhfV3LPc_g-w",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fried Chicken Legs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9_i6fgn3N7BhfV3LPc_g-w/o.jpg"
      },
      {
        "img_id": "R9XInuDJSqK2yGhFb2_B-g",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Fried oysters with cornmeal breading and tartar sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R9XInuDJSqK2yGhFb2_B-g/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "0G6TnET1FmULTkx4x6-gww": {
    "date": "3/9/2018",
    "text": "One of the best places in south side. The place has some character and everything is delicious. Good prices, awesome food, highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "87zDv4Dau3cHUJtkwl9ZWA"
  },
  "gqyLmllUed12qRS-gMG6IA": {
    "date": "10/31/2013",
    "text": "Have you ever woken up in the morning and said, \"Gee, self, I sure do wish there was a place I could swing by for a good old-fashioned Scottish meat pie, or maybe some shaved roast beef with mac-and-cheese on top, and finish it all off with a chocolate-chip-oatmeal-toffee ice cream sandwich.\" Have you ever been on your afternoon stroll, taking a break from work, and thought, \"Oh, gee, self, if only we were in Edinburgh, we could stop in one of those quaint little shops and grab a deep fried Mars bar...\"  No? Well, maybe it's time you did.  The Pub Chip Shop has meat pies. And chicken pies. And vegan vindaloo pies. And sausage rolls. And Scotch eggs (hard-boiled egg, coated in sausage, breaded).   The Pub Chip Shop has sandwiches. Chicken sandwiches. And fish sandwiches. And a shaved roast beef topped with mac-and-cheese sandwiches. And chili dogs. I'm not even kidding.  The Pub Chip Shop has desserts. Home-made apple pies. And home-made ice cream sandwiches. And deep fried Mars bars.  The Pub Chip Shop has mushy peas. And fries. And tater tots (done their way). And cole slaw.  The best part? It's all mouth-watering, saliva-inducing, tell-me-what-I-need-to-do-to-get-you-to-deliver-to-my-house-every-day delicious.  The best UK food I've ever had happened right here in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 7,
      "cool": 6
    },
    "photos": [],
    "user_id": "xhVlmdU1sPVH6GBJw6AZtQ"
  },
  "1kUIEzxNBWndELpz8a2SWg": {
    "date": "12/30/2013",
    "text": "Not going to lie, this place was a little underwhelming.   We came here late at night to try some greasy fried food and watch drunk Yinzers stroll the strip. Drunk Yinzers? Check. Greasy fried food? Check. But good grub? Ehh.   We had the sausage roll and french fire sandwich. The sausage roll tasted a little off to me -- maybe too much spice? And the sammy was literally just two pieces of bread and french fries. That's it. What?  Then there was the deep fried Mars Bar, which anyone who has respect for their body should avoid completely. It was soggy and greasy, not a novelty worth eating.  The only bright spot in a sea of fried food were the tater tots. These homemade balls filled with cheddar-y goodness are the best thing I ate here. Worth getting some to go next time you're in town.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "QxirJzUqvYJ7l0pMQu4vXw"
  },
  "TMyfmYaIdo6pSPTN4wWA9Q": {
    "date": "7/26/2014",
    "text": "Gotta give it to them for bring creative. The walls are covered in menu items. The restaurant was small. There's like three tables in the whole place. I'm surprised there was nothing out back or upstairs to sit. Maybe some outside patio stuff would help open it up. It's the same owners as pipers pub which is also delicious.   I got the fish and chips. It came out quick and piping hot. The batter was crispy and the fish. Oh my. It was so fresh and absolutely no fishy taste whatsoever. The problem with coming hot out of the oil was that it was unedible. Even after waiting ten minutes the center remained tough to eat. I snacked on the chips while I waited and they were somewhat overcooked and oversalted. I wish they wouldn't have salted it so I could control how much I wanted on it.   I'll have to come back to get the fried desserts. I'm surprised the cashier didn't recommend that when I asked him what I should order!   Overall I'd say I'd recommend this. Definitely something different in the southside.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pwpKFY_WRFddFj7B_w578w"
  },
  "lcow30IkZVV-uUYTmWTDog": {
    "date": "8/14/2016",
    "text": "Friendly staff fast and yummy British style pub food.  I had a Scotch Egg and a Sausage Roll really hit the spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9gd-eaevOvZXnMSjujKQlA"
  },
  "sV5ZVdfDyjzeD5idDdr9Iw": {
    "date": "7/13/2015",
    "text": "This place took my expectations, put them in a box (a BOXTY to be exact) and gave the boxty back to me leaving me asking myself why I haven't come here sooner.  Located on Carson Street right next to Primantis in Pittsburghs South Side, The Pub Chip Shop's food is the perfect blend of a quick meal and a delicious sit down dinner.  The atmosphere has that Irish Pub feel (naturally) a bit like Claddagh if you've ever been.  The Pub Chip Shop specializes in THIS & Chips.  The THIS could be anything from Oysters to Shrimp, Chicken and even Sausage served with Chips (actually Fries).  The other thing they do well are what I was speaking of in the beginning, meals in boxes.  This all is much more appealing in action than it initially seems from the title.  I specifically got the THAI CHILI FRIED CHICKEN BOXTY.  I was concerned if this would be enough food as my dinner and the guy assured me the portion would be pleasing and sure enough, it was above and beyond.    The chicken in these boxes is unlike any breaded chicken breast I have ever had.  Juicy melt in your mouth all white meat chicken with the right amount of spices but, that's just the start.  The box has home made HUGE tater tots in the bottom as the lining with the chicken next topped with a heaping of Tri color cabbage and green onions with a sea of sweet Thai chili sauce on top.  If you are concerned about spicy dishes, don't get this cause it had some serious heat but, being someone who doesn't usually eat spicy food, I couldn't stop eating it!  I also got a side of their house made mac and cheese that's made with white cheddar cheese sauce.  I was on the verge of sleeping under the table to wake up and just order here again.  With a huge Honest Tea and the food my total was about $12 but, I didn't even finish my meal because the food is very filling and the box is filled to the top giving you every dollars worth.  The location was clean, the staff was nice and on Friday and Saturdays they are open till 3AM!!!    What I got didn't even scratch the surface of what this place offers.  I plan on going back to try one of every Boxty till I've had them all.  Don't skip over this place just cause all is Pittsburghers preach Primantis, if the wait is too long next door, I'd say visit THE PUB CHIP SHOP for an equally respectable meal.",
    "rating": 5,
    "rated": {
      "funny": 9,
      "useful": 15,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "nN1tZO3s27qDN0Zr_HTnQA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. I always choose the window seat when available.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nN1tZO3s27qDN0Zr_HTnQA/o.jpg"
      },
      {
        "img_id": "kQhsvUGRDkA4GhQ7tCpNXw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Black and White menu, so punk.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kQhsvUGRDkA4GhQ7tCpNXw/o.jpg"
      },
      {
        "img_id": "eGARvykSRa1oBZDxF7TEWA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. The front counter.  I wonder if this is what the gates of heaven smell like?  I hope so!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eGARvykSRa1oBZDxF7TEWA/o.jpg"
      }
    ],
    "user_id": "zUQVfRIwoDJb_-8qiWUNwA"
  },
  "OQBbqvyRhDDp_HfffdHMyA": {
    "date": "2/2/2014",
    "text": "I was quite satisfied with the quality of the food. I really enjoyed the White Chapel which is a sandwich with fried flank steak, macaroni n cheese, and chopped raw onions. I would have prefered sauteed onions to raw onions, but that is the no qualm I can muster. The Mac'n'cheese was fantastic! Overall, the sandwich was a very interesting take on a cheesesteak sandwich. I also tried a piece of pie from my friend and thought it was quite good too. Oh, and I didn't see any mashed peas on the menu.  I liked the seating here. There is a communal table that seats about a dozen and a counter which seats another half dozen. The restaurant was empty when I stopped by, but I could easily find myself talking to another patron here. Though, it's kind of difficult to talk because they play very loud music. I suspect music was being blasted because it was a Saturday night (hopefully, another reviewer can confirm this occurrence).  Lastly, the name of the restaurant is a bit misleading as they do not serve any alcohol. I think 'The Chip Shop' is more appropriate. If that name is already taken, then maybe 'The Pittsburgh Chip Shop.' For me having the word 'pub' in your restaurant's name signals that you serve alcohol (particularly beer); however, this isn't the biggest problem because the restaurant is located in Southside where you can easily find an establishment serving alcohol.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SqVUNVeYJblyoUz4e-Fiqw"
  },
  "zQ4gwa4ou1KnGgTT2b46og": {
    "date": "10/5/2015",
    "text": "My husband and I were attending a show at the Rex Theater and wanted to go to Piper's Pub during the sets in between our friend's band and the headliner. Piper's was packed and it looked like there was quite a wait, so we decided to have the counter ordered British food instead! I've always heard great things about the Pub Chip Shop, but have never had the chance to stop in, so I'm glad we did!  I had a Goat Cheese Chicken pie an my oh my was it wonderful. I also got the welsh mac & cheese as a side, which calorie wise I probably didn't need at all, but it was delicious. My husband had the italian pasty (i think it's called a pasty? forgive my ignorance). He got small chips as a side. I had some of the chips, and they're also great. If you're in the need of quick comfort food this is definitely the place to go.  In addition to the great food, the staff is very friendly, orders come out quickly, and if you want to have a drink with your meal they serve beer! There are a few tables in the shop as well as a window counter, so if you can get your meal to go or stay and eat. I can't wait to come back and try a bunch of other things on the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "B3fVQWx-gb3ZEMwbjOjBrQ"
  },
  "Zqiq654orWEAdK7HAfGrsg": {
    "date": "12/9/2013",
    "text": "Oh man. Pipers pub opened a chip shop?!?! You bet I'm in! I love Pipers, if I could eat there everyday and not spend all my money and weight 800 lbs I would. Here however, I think I will pass. My partner and I ordered fish & chips, seitan & chips and mac & cheese. I love me some mac and cheese but this was sub par.  The seitan was good (with the hot sauce) but the chips? There was 0 flavor. Maybe I set my expectations too high, but any which way we were the only people there and it was not tasty. And I was burping all evening. Yuck.   I'm going to pass. Nice try, but unless I\"m drunk I'll go next door or find something else better on the South Side.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eiiS0rrIN6orvf4PmsKe-Q"
  },
  "VnuE2uqqWvfyee0PjWErbw": {
    "date": "6/15/2015",
    "text": "I am in love. I'm so excited about this place that I am writing this review while I am still eating the pie because I feel the need to share the awesomeness. Like right now.  I love savory pie, and the Steak and Ale pie is an incredible rendition comparable to the pies that I've had in England and Wales. I decided to make it a binge and went for the scotch egg, too, which was (no lie) my favorite food when I was growing up in England.  The atmosphere is lovely - big communal style tables if you want to stay to eat and the staff were unreasonably friendly.  You can hot pies to eat in or to go (which is what I did), but apparently you can get them to heat up yourself, too. I can't wait to sacrifice my waist-line to try the rest of their menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "cDlPrFkMDXYqVzzjaerHSA"
  },
  "BUZjF5sQkuGnBKRDvepvXQ": {
    "date": "5/19/2017",
    "text": "One has it once and it was take out but good! I love pipers and this is joint so can't go wrong!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J9An8BT-KlKSZdiyKoRWUA"
  },
  "IssJKCCI4fEtM_a2y8LCWg": {
    "date": "11/6/2017",
    "text": "They use Haddock rather than Cod for their Fish and Chips. Haddock has a firmer texture and not as flaky as Cod. Terrific Reuben, great beer selection and service is always top notch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A5NSs4GjWc0PideI8Hw9xw"
  },
  "TLFcmgUtZnitlRBgItJvKQ": {
    "date": "9/11/2015",
    "text": "Great food. Friendly service great atmosphere.   The chips, regular fries, are great. The shrimp, which was my meat/seafood of choice, were good but were hard to get cooled down and were a bit too big.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6LK8019L37_snmMv0UkvBg"
  },
  "T8rruXTKaO-xYKSYIpEO9g": {
    "date": "7/30/2017",
    "text": "Pittsburgh is not a city with deep English ancestral roots. Indeed, while it's common to find people of Irish, Eastern European (primarily Polish), and Italian descent (along with the accompanying eateries to match), Pittsburgh was not home to a lot of immigrants from England. So naturally, of course my great-grandfather settled here in 1907 coming from Devonport, England...  I was excited to try this place given my own English roots, and I've always been curious about English food. My own grandfather loved Scotch Eggs, so when I showed up here, I decided I had to give it a go. The prices here are very low, and seating is limited here, so I thought best just to get my order to go. I picked up my scotch egg along with a Pork and Stilton Pie (I love blue cheese and I made sure to ask that no onions be added as I simply can't stomach them. I was assured there would be none). Picked up my order and ate it on the go. The scotch egg was great and if you add a little hot sauce to it, it's even better. I was a little bit disappointed in the pie, as there seemed a lack of Stilton in it when I hoped for a greater amount, but perhaps next time I'll ask for a bit more cheese in my pie. Still, I would definitely come here again and I'm very curious about their breakfast offerings, of which there seem to be ample. Food is good, but my advice to you is just order it to go and continue exploring the city because only about 15-20 seats exist... While I don't think English traditional fare will ever supplant some of our fair city's other food passions (especially pizza), this place is a well worth the effort stop in exploring Pittsburgh's international fare.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ry4atEgXsi28sKFDGiVVw"
  },
  "FgX9PjfTZUuvwqf0WsGznQ": {
    "date": "6/6/2018",
    "text": "What can I say. This place is AWESOME!! If I lived on the South Side I would eat here everyday. I was at the Food Truck Festival at the Meadows last weekend and I was excited to see that The Pub Chip Shop food truck was there. I was disappointed that they weren't serving tots but oh well. I did get the Tai Chicken/Fish tacos and they were so good. I love this place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yhB2CmSkHhmpPN1cRm0zmg"
  },
  "fTnsLZl06okkgW3qzLzl0w": {
    "date": "10/22/2016",
    "text": "Great food, excellent service, another fabulous experience. I got the steak and ale pie with an order of boxty tots. Fresh, hot, flavorful and the guys even threw in a Canadian donut with maple cream filling and bacon crumble on top!   Highly recommend this spot in the SouthSide for good eats and friendly folks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pD_URrASN38VIween6V3Sg"
  },
  "hFbbFhUfXfk8Y8sTToK-MQ": {
    "date": "1/7/2015",
    "text": "So I have decided to update because I've been here since my last review and actually tried  stuff off of their menu rather than Pecan Rolls (amazinnnngg) & sausage rolls.  My go-to here is the chicken and chips- which to my surprise arent chips.. they are french fries. Am i the only person who didnt know that, lol. It was a great surprise. I ordered my chicken strips (3) with the welch cheddar dip. The chicken was tasty and you can tell that its hand-breaded. I did really like it-- but I have had a few times where i find it too salty.. whether its too much seasoned salt, garlic salt or regular salt im not sure.. but it tastes a tad toooo salty (same with fries) The welch cheddar is a GREAT dip, but i wish they gave you more :( its those tiny little cups. I could scoop half a piece of chicken in it and use it all. Im a condiment person :D  One time, Bobby ordered the steak pot pie and added mac & cheese on top (munchie food at its finest) That was reallllly good! Great pot pies from this restaurant. Oh, another time bobby had the oysters and chips. He really liked it. I'm personally not a fan of oysters. i tried it and the breading was tasty :p   They have nice hours too.. I've been here on a Saturday at 1:45am. They informed us that they closed at 3am- kudos to those workers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "aJWaK3me92BZhPDHpru12A": {
    "date": "1/5/2017",
    "text": "For the price and decor , it's a good place to get a savory brunch . Though seating space is limited , the food is cooked fresh and is flavorful despite being a tad bit salty.  It's definitely a place to nibble on food while drinking good beer !",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FtoLzUwA3OCIJtzx1OgZaw"
  },
  "qMh_E9pkeQZjRpQ8Jg7Y7Q": {
    "date": "8/9/2017",
    "text": "UK inspired comfort food in quaint hole-in-the-wall setting; walk-up counter with a couple bar seats, but works well with their menu, as much of their menu is quick and easy to eat on the go, including handpies, small sandwiches (bap) and donuts. Can be a bit heavy, but delicious - perfect for grabbing a few different new things to try and sharing among friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vo2GzuR6kOFL8wGEpJYS3g"
  },
  "9DwfgBw1I2_TwuwNZYowCg": {
    "date": "7/10/2016",
    "text": "Best chips I've ever had in a fish 'n chips shop.  They've got bags of taters in the hall - everything is peeled, double blanched and fried fresh.  Kills over those soggy things one normally gets in London.  The fish - haddock - was firm and wonderfully battered - just enough  to be yummy without a thick greasy cakey coating that gets nasty as it gets cold.  Altogether a highly satisfactory and superior experience over any English fish 'n chips shop my wife or I have ever tried - and she's from freakin' England!  Go there!  NOW!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nyFNhZokCoLirjcqiXgwJQ"
  },
  "PQPzdDwGGeG3wtOn-vtFoA": {
    "date": "11/9/2014",
    "text": "Now don't get me wrong, I like the Chip Shop... I just  not a grease laden fried or filthy food lover overall (with the exception of French fries) and that is where my 3 stars come from.   If you definitely don't want a healthier or balanced meal- you are surely to be in a gluttons paradise here.  Sausage rolls, scotch eggs, fried everything, and hand pies galore... I like the shrimp and chips, BLT Bap, and thai chicken tacos - when I'm craving something like this, this is a great option.   The staff is always nice, helpful/willing to make a recommendation, and the space is really cool.  I guess if you want something healthier, go next door to Pipers- some great salad or veggie options :)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "hLVq7VSJBHZwqurwWoCmpg"
  },
  "KB2mwpPrg7xSsC8WacbE1g": {
    "date": "1/13/2017",
    "text": "The boxty tots are incredible. We tried both the Welsh cheddar and bacon tots, as well as the Thai chili chicken, and to be honest, it's hard to say which is better. Friends got the fish and chips and raved about it. The staff is really friendly, and the prices are incredibly reasonable.   I give this place two solid thumbs up, and highly recommend stopping by if you're in the South Side.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uLCiugsLA8Q0aa0k147xYQ"
  },
  "tfcJ1o8srCkkY9ipyHPdUQ": {
    "date": "6/14/2015",
    "text": "A-MAZ-ING!   Super helpful staff and fresh out of this world food.  Definitely want to limit this to days when you've got a good workout in since most of the menu is fried or bakes bread happiness.   Everything came out in less than 10 minutes- fresh and hot! The fish was out of this world. Simple, fresh- not too greasy and not too much breading.   Loved the Thai Chicken Boxty with box tots- the box tots are morsels of heavenly potato and herb happiness- and the cabbage and thai sauce over everything is nice and sweet/spice.  I HIGHLY recommend either (or both.)  We also tried the mac and cheese and thought is was just so-so.  I could see how some folks love it- just wasn't our favorite.  We happily washed down this delicious food with Strongbow Cider.  I recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SHyWxJxb-mKiNgHPUSu3_g"
  },
  "p3Rkrvl9yKoPtc7g3TiSow": {
    "date": "7/6/2017",
    "text": "The worst tasting fish and chips that I've ever had in life. The chips are soggy and stale, and so is the fish. The fish was not evenly seasoned. Delivery was fast though. The order didn't come with any utensil neither.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E4QmU5Q1KcCdtAgvq9j3Ew"
  },
  "L2CPM4lY4lHTNXwqvskGoQ": {
    "date": "12/28/2014",
    "text": "A little bit of home!  I have been dying to try this place.  I'm from Australia and there's nothing like a good meat pie to comfort the soul.  I ordered the Steak & Ale pie and couldn't wait to start devouring it.  I asked for it to be extra hot and they kindly obliged.  The pie itself was very tasty but unfortunately, for my preference, the ratio of filling to pastry was out - 1/3 filling, 2/3 pastry, making it difficult to taste the delicious filling. Surprisingly, the star of the show turned out to be the Perch Tacos - these were amazing!! Coated and fried to flaky perfection, placed within a Reyna tortilla and then topped off with cabbage, Baja sauce and fresh cilantro.  An absolute winner!    The Pub Chip also has a small selection of beers and cider available. The space inside in quite small - fitting maybe 10 or so customers but more than adequate for turn over. Perfect for a pre-movie meal or quick meal out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hilc39fKD1KISZe9HiAbbw",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Cornmeal crusted Lake Erie Perch Tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hilc39fKD1KISZe9HiAbbw/o.jpg"
      },
      {
        "img_id": "az1UMNQ1cQXaaFpAgVTv7Q",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Steak &amp;amp; Ale pie with gravy on the side",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/az1UMNQ1cQXaaFpAgVTv7Q/o.jpg"
      },
      {
        "img_id": "7lFWkwfDIdWreyFaIHXYxA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Welsh cheddar Mac &amp;amp; Cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7lFWkwfDIdWreyFaIHXYxA/o.jpg"
      }
    ],
    "user_id": "ZgdnPwzjIeFwWrhNZrVGcw"
  },
  "anzp92Z2vrWjsLQMd_zzjg": {
    "date": "5/24/2015",
    "text": "Fantastic fish and chips, absolutely perfect and piping hot!   The breading has the right amount of crunch without being dry and the fish is very juicy, tender, and succulent! This was a steal at 8 bucks. The fries were exactly like I like em- fat, stubby, fresh, and crispy and golden on the outside while hot and tender on the inside.   We also had the gulf shrimp as well which was marvelous, but the fish edges out on this one. The curry sauce was absolutely divine as well. If I had to knock one thing, it'll be the boxty tots. I subbed my fries for tots and I found them way too dense (the binding was a bit gummy for my taste) and I could have done without it. Thankfully, they give you an INSANE amount of chips so that you can pretend you're eating in moderation while you share / steal other people's fries.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hR6dUJqimBHwIKssts6VOQ"
  },
  "cQwgUb9qG7qw2pUJ679lmQ": {
    "date": "7/4/2017",
    "text": "Traditional English fish and chips. Really great. Takes me back to England. The crusts are nice of the pies but the banger fillings fell flat for me. If I lived here I would go get often.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xQw9BHwpG8oxnJlUurrEyw"
  },
  "s5HXzp-OEL0_K35AbgtWYQ": {
    "date": "5/26/2016",
    "text": "I planned an evening of exploring South Side, and included this shop based on the reviews. I ordered the Scotch Egg Bap with a side of chips. There were a few people eating in the store around 5 on a weekday, and many more drifting in and out for carry-out. The staff were friendly and knew the regulars well. Overall, the environment was inviting and welcoming.  My best description of the bap is a moister, flatter Kaiser roll. The sandwich was filled with provolone, a Scotch egg, and baby greens. I should have put some mustard in the sandwich; it's very dry without any condiments. The Scotch egg was nice and crisp on the outside, and its heat melted the provolone and wilted the greens nicely. The chips were good, but the exterior of the fry wasn't as crisp as I prefer.   Overall, I enjoyed my first British meal. I'd love to return to try some boxty tots.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pilsgI8pTKO4wAJ9ugWfQQ",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Scotch Egg Bap (Scotch egg, provolone, baby greens) with chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pilsgI8pTKO4wAJ9ugWfQQ/o.jpg"
      }
    ],
    "user_id": "Figs8mO8s_aPRq2W7W0cYQ"
  },
  "1WYmixHhRXgdErqCR5pO8A": {
    "date": "2/23/2017",
    "text": "This place has great fish & chips! The portions are large I easily had enough food for 2 people.. the staff was friendly and efficient.. the atmosphere was laid back and inviting.. all in all great place to get a quick bite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "q10wq9_eqXDGBbuFuRy_Qw"
  },
  "0CiJwZKrbIILCaIk2PA46w": {
    "date": "1/16/2016",
    "text": "I would give the Pub Chip Shop 4.5 stars. They really picked a great location to serve up deep fried, greasy goodness. And they are super affordable! I'm glad I don't live too close or I'd be here everyday and gaining 200 pounds each year. The fish and chips are their specialty and that's truly where it's at! And for only $8, what a bargain! The fish is flavored well and fried to perfection; the fish is always moist and the batter extra crispy. I've also tried the scotch egg, the thai chili chicken tacos and a couple of the boxty tot boxes. All have been so delicious, mainly because everything is fried to some extent. The reason why I docked a half star is mostly for one item that they ended up removing from the menu. When I first went here, my husband ordered a hot dog that was topped with chili and their mac and cheese. It sounds amazing but it was incredibly salty and was kind of difficult to eat because of that. And another downfall is that it's really small here so I recommend getting takeout. If you're eating in, you're very likely to end up sitting really close to a stranger. All in all, the best place to go after a night of bar-hopping in South Side.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JnZTxjtsxO7veV864fogBA",
        "caption": "Photo of The Pub Chip Shop - Pittsburgh, PA, United States. Thai chili chicken tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JnZTxjtsxO7veV864fogBA/o.jpg"
      }
    ],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "ngBqT2IWQgWSlT4yKea66A": {
    "date": "7/8/2017",
    "text": "Probably the best place we ate at during our recent weekend trip to Pittsburgh. I had a great breakfast biscuit sandwich - huge! And the biscuit itself may have been the best I've had. My wife had one of their boxes, the spicy chicken one - STUPENDOUS! We also got a couple of their giant donuts to go - only $1.50 each! They held up well for a few hours too while we went to a couple of museums. This place is highly recommended for a quick bite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XbrgwqwKyCUAVeQMSE7Lvg"
  }
}