{
  "WFLggMcu_NRlbOvkw03bPQ": {
    "date": "1/8/2014",
    "text": "LOVE that this gem is so close by!  Their food is ALWAYS spot on, and the service is usually pretty spot on as well.  The only problem I have with this place is that it is typically so busy that if you don't make a reservation...you will likely need to wait for a table.  The upside of that is that the bartenders are pretty good and so bellying up to the bar is a good way to wait.  Update: 5/1/2015 - Review of Mount Lebanon location (1 Star)  I'd like to say that the Pleasant Hills location exceeds on every level over the original location in Mount Lebanon...TWO FOLD!  It's a shame that the flagship of this chain is the worst of them all...they service was awful, and the food was not nearly as good.  They should send their management over to this location to get some pointers on how to do things right!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TjGSSS4MlsP0LCNYztvysQ"
  },
  "Q15bnr82y8HCDDvxqE5BQg": {
    "date": "5/12/2014",
    "text": "My boyfriend's family and I went for dinner on Mother's Day. We made a reservation for 7:15. We were not actually sat until about 7:35, which we understood since it was a very busy day for the restaurant. That in itself was not really a problem, but in combination with the rest of the evening, it was kind of annoying...  Mother's Day features an abridged menu. Meh, the choices were blah. No entree salads, no burgers, only one pasta dish.  Once sat, the waitress came to take our drink orders right away, which were all waters and sodas. We did not actually receive our drinks for another 15 minutes, sans straws or lemons (which we asked for). Then she did not take our food orders for another 15 minutes after that. We had some bread, and someone came over to ask if we wanted more bread. We said yes, and we never ever received it. When we got our food, she asked me if I would like some tarter or cocktail sauce with my crabcakes. I said I would please like some tarter. I never received it. After waiting to eat for over five minutes, I decided to just eat them without the sauce. She never once came to check on our table or I would have politely reminded her. My boyfriend's sister, who was eating ribs, needed napkins. She only had one, and the waitress never gave her extra. If the waitress/server assistant had stopped by or even made herself available near the table, we would have asked for extra napkins. My boyfriend and his sister never received refills on their sodas even once, even though they asked multiple times.  Afterwards, we asked for some boxes. Some of the food was dropped on the floor, so we had to wait for the kitchen to make more to take home. It was nice to offer replacement food, but it meant we were waiting even longer for a dinner that had already taken 2 hours.  The waitress may have been conscious of the fact that she gave terrible service because when she dropped off the check for signature at the end of the meal, she said nothing. No acknowledgement or thank you whatsoever. We never once complained or acted unpleasant to the waitress or anyone else in the restaurant.  Seriously the worst experience I have ever had in a restaurant. And I recognize it was a busy day. I'm extremely patient about that, being in the service industry myself. But holy crap was that service horrible.  Update: atrias has since contacted me to apologize.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6z9ERfBvRF3HOXLNTNkdpg"
  },
  "Q94jlmnzH2PSzc_Tj5ep2w": {
    "date": "2/3/2013",
    "text": "The Bird and I have been wanting to try the new Atria's since hearing about its opening.  I have never been to any Atria's but have heard good things.  We were able to get a 5:45pm reservation but arrived 30 min. early and was able to be seated after a 10 min. wait.  (Reservations are recommended).  This was NOT the old Brass Rail with a new sign.  The inside was completely remodeled with warm and a chic interior.  Very nice.  The Bird started with the Crab Bisque which was really good after she let me try a spoonful.  I had the Chopped Salad that was a True chopped salad.  I was pleased with the nice portion.    Our waitress was very nice and provided great service.  (Love it when my drink is almost empty and a newly filled glass appears.)  The Bird ordered off of the winter menu and went with the Beef Stroganoff.  It came in a large bowl and she said was very flavorful.  She thought it could have had a little more beef or less noodles to make it more balanced.  I of course went with the steak.  Twin 4oz. Fillets with a crusted horseradish topping.  They were tremendous.  Perfectly seared, flavored, and cooked (medium was a True medium.). The meal came with mixed vegetables and potatoes.  Not a fan of the vegetables and the next time would ask for broccoli or asparagus.  If you know the Bird, then you know we had to try a dessert.  The dessert choices were limited but they did have carrot cake so we got a piece to go.  It was not a huge piece but big enough to share but we both could have eaten our own piece and not felt too much like a pig.  The cake by the way was delicious.    Our bill came in under $60 which I thought wasn't that bad considering the meal, service, and atmosphere.  (No alcohol this visit.)  Less than two miles from our home I see this becoming a regular place.  (I just happen to have a lunch meeting there on Monday and am looking forward to trying the large chopped chicken salad.)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3vSXjsICxTPTLhTDC9BoXA"
  },
  "T0TRmjsudsL9MYD7w0puhA": {
    "date": "9/9/2014",
    "text": "Typical bistro style menu but come hungry because the portion sizes are massive. Everything seemed fresh and hand made. Wait staff seems friendly and conversational. The manager offered us a fried zuccini sampler because we were first time guests.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jQgzL3_p6jJnpI7f-2o7Xw"
  },
  "tQuQbmRxAP8oxEbaMYvgtg": {
    "date": "7/27/2016",
    "text": "I my experience the quality of Atria's is entirely dependent on who cooks your food. I've ordered the same dish there on multiple occasions and it's been the worst I've ever had and the best I've ever had.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qpcEm7kP20JGc0yreXmeTg"
  },
  "JqhGH_XDBXkCkI_HvjoLtw": {
    "date": "2/12/2015",
    "text": "Went here while I was in town visiting my Grandparents and my gram, my son and I went here for lunch! Outstanding from the minute we walked in! Hostess was generous and made sure the 3 of us were happy. Our server, Jessica was awesome! She was very sweet, tentative and knew the menu! The bread, wedding soup was delish! We got marg flatbread which we devoured and the cod sandwhich which was served with cocktail and homemade Tatar sauce ... Soooo good! Everything from the atmosphere so friendly staff and menu options was great! Will absolutly go back next time I visit! 5 stars all the way!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZXR8cJ8H5HnAfuX5bRR5zQ"
  },
  "vaDda3UOa8ydf4DAYz7cyw": {
    "date": "8/6/2014",
    "text": "My wife and I live in DC and were visiting family in the area.  We took advantage of the free babysitting to have an evening out.  With nothing but chain restaurants and mediocre food in the area, we decided to try this restaurant.  We were definitely surprised.  It seems, this restaurant has the quality of downtown eating in the suburbs.  Service was good - we had a newer waitress, but she was great.  Food was fine - nothing really noteworthy, but no complaints either.  Everything was fresh, cooked properly, and tasted great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QW11_6RZaNp5G1oGdsOd_A"
  },
  "aSLn7UrjoJXaiien8cplyw": {
    "date": "9/23/2016",
    "text": "We needed to find a place to dine after a burial service at nearby Jefferson cemetery for our family and friends. I called two days before, and The manager handled us very promptly, professionally. While they already had a group in their banquet room, they set aside a separate area in the back corner which fit our 20+ sized group perfectly. They menu was varied enough to suit all food types such as vegan gluten freee, in our group. The staff was excellent, gracious, prompt. Our entire group was very pleased with the arrangements, menu, food quality and setting. We sat in a quiet area where we could all be together during our sad time and everyone commented how perfectly it worked for us. Thank you Atrias.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j0sXX2a319XojiZxyovFoQ"
  },
  "4abRLzU0xndH0iTdtjc28A": {
    "date": "5/27/2016",
    "text": "Went cause close to hotel after long trip. Waitress told us burgers were half off on Thursdays so gave it a go. Burgers took 45 minutes to get. But wait it gets better. Fries showed up 15 minutes later after I was done eating. Overall the burgers were average but the wait was ridiculous.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d_2azqXxTG5bpGlNdHdttA"
  },
  "oUrpc0XKgVxD9A4PhzM2oA": {
    "date": "7/31/2015",
    "text": "The food tonight was as expected but the service that we received from Sydney was fantastic!  What a wonderfully personable and friendly young woman!  Explained new items on the menu, had beverage refills instantly, always checking to see if anything was needed and always had a smile!  The five star review is for the outstanding service from Sydney!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LNZrQtiZLVvCNJ6SAK3fSA"
  },
  "iBUHpvLx3lakTEczb5qH9g": {
    "date": "12/3/2013",
    "text": "2.5 really and thats only for the food. Service gets 0! So decided to give this place another try and went for thanksgiving dinner. The food was much better but the service was horrible!!! We waited about 10 min for our waitress to come and get us our first round of drinks and when she arrived i realized she saw us being sat because we were right next to the servers station and she was chatting with another waiter. We were suppose to get bread and didn't and when my fiance ordered a beer when our main course came it didn't come until  he was done with his meal. I might have been a little more understanding if the restaurant was full but there were at least 6 open tables around us at 630.  And at dessert she offered my son ice cream which a 4 year old will choose anytime and then charged us even though his meal came with a dessert that did say pumpkin or apple pie but if that's the case he should have been given a piece to take home. Now onto the food which is the only reason this isn't a 1 star review. I ordered the mixed green salad that had cranberries, apples, pecans and goat cheese. It was much better the the salad I had the first time. The main course was very good. My fiance got ham and I got turkey and we shared. The stuffing was good and I liked that there mashed potatoes were the clumpy kind. My son had the same thing we did just in a smaller portion. The dessert was lack luster. I wish they would have done something other then just pumpkin and apple pie. And they were out of whip cream so that's always a downer. But over all the food was great. The service however was just horrible!!!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "U92V-gp13uMZL-sl_naTHA"
  },
  "PmhQyUC6cttOPQ_PA1y7mA": {
    "date": "7/18/2015",
    "text": "Spectacular Atmosphere.  The food is Good But, definitely Overpriced.....   The workers are very nice.  Only bad thing is if you go there and order To Go, you have to wait a Very Long Time to receive your order.....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YyejGFYH24Jlbgd5hbhAMQ"
  },
  "qHK8kTSl1QJ6x4Cx3idoPw": {
    "date": "7/7/2015",
    "text": "A bit overpriced, but generally good food.  I've only not liked one thing so far which was their dressing on their southwest salad.  It was like watered down brown sugar, which doesn't belong on a southwest salad.  Their Caesar salads and meat loafs are great.  Other items I've had were all pretty good.  The one thing that disappoints me, is their one bartender's over selling of their menu.  He talks about how great a menu item is, but then when I get something and it is only above average, I feel let down.  That inaccuracy and selling mentality leaves me feeling duped.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QMf-uity7_ox85hjLNmb2A"
  },
  "rEhIhvDk4FitV4LAzr8G-w": {
    "date": "6/10/2016",
    "text": "Called and requested a carry-out order.  I've done this several times prior here but this time was ridiculous.  They have a bartender take and process your order and it usually works well.  This time I was put on hold.  After 6 minutes, I called on my cell but did not hang up the land line and was put on hold again; after another four minutes with both lines still on hold I gave up.  May call there again since we go there from my workplace",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vb1FCD9iKUeDSnawLXnHBA"
  },
  "_HWyhKi5x8wU4nzDeL2Yag": {
    "date": "10/26/2013",
    "text": "With about 8 locations, Atria's has a restaurant that probably close to you in the Pittsburgh area. This one in the Bill Green Shopping Center just opened within the year. It is swanky as hell inside, and our server Keith was really cool. For some reason, the menu at this Atria's is a little different from the others (we've also been to the original one in Mt. Lebo. we tried to get into the one at PNC Park, but it was too crowded). Anyway, we had the pot roast nachos for an app, and they ruled. Combined with a salad for each, and a dessert to share, this was big enough to feed two. My Pork filet gorgonzola was as beautiful as it was delish. they're 3 medallions wrapped in bacon, topped with cheese, bbq sauce, and placed onto potato pancakes. dessert was a \"chef's whim\" in the chocolate mousse crepes that darren and I shared. awesome! the service was tops too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7AGLlj5YzqdBfCPiZCa1mQ"
  },
  "9ZsakUAueC2M9NgqF3Bsyg": {
    "date": "5/13/2013",
    "text": "I write a food blog sharing positive dining experiences in Pittsburgh, but I feel obligated to share my recent disaster story here. I've eaten at many Atria's in my life and have never had such an awful experience.   1) both my mother-in-law and PID got filets. they asked for medium, and both received COMPLETELY raw filets. Mama's was actually cold to the touch, so we sent it back to the kitchen. 2) the manager returned with it, moments later, not remotely fixed. it was still mooing. cooking steak is kitchen 101. returning a \"sent back\" steak with zero improvements is unacceptable 3) PID's \"fire grilled\" asparagus tasted like lighter fluid. 100% chemical. it actually made me NERVOUS that he had eaten one. 4) Mama wound up giving up on the steak and ordered a reuben sandwich because she wanted something reliable. when the manager brought it it had no russian dressing on it - basically the defining ingredient of a reuben. 5) the moment we sent our steak back, our server COMPLETELY disappeared. gone. never game back once. the manager took care of bringing mama's new meal's and PID's new asparagus, but we never once saw our server again. REALLY!?!?!?! it wasn't her fault the cook was incredibly off his game. she didn't need to disappear.  really incredibly disappointed and will never be going back. we were literally concerned about the quality of our food and if our server found it acceptable to disappear after a poor experience, i can't imagine how she'd be if we had a good one.  so sad. please reconsider before coming to the pleasant hills location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "GW6bFrSbhJyMOF5fqEJFvA"
  },
  "9WAPeKVRyyTh8hrevG6FcA": {
    "date": "2/13/2016",
    "text": "Had Chicken Marsala very good.... Wasn't a lot of food for the money ...salad or soup was additional $3.49.   Nice decor... Overpriced to me!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bz9XpvXMAc_D1n2DjW_-0A"
  },
  "XiMhAOAcDCyXoSFZFFTuDw": {
    "date": "2/24/2013",
    "text": "The food was good but the service killed the evening. We sat at the bar and that's where troubles began. There were some placemats,straws, and napkins left over from the people who were sitting there before us. After waiting about 10 minutes the bartender finally acknowledged us and I ordered drinks. I asked the bartender if it was possible to clean up the mess that was in front of us (bus the table). The bartender looked at me and was obviously inconvenienced by my request. The bartender stated that they put mats down for people who eat at the bar. I explained to her that was all good and well but since the mess in front of us wasn't ours, it would be great of somebody could clean it up. The bartender was kind of shitty. She moved everything and left the dirty sticky placemats.  I then moved the placemats myself. What was left was a giant sticky area directly in front of us. I asked again if it was possible to have the sticky area directly in front of me wiped down and the bartender just kind of ignored me.  I finally just asked her for a bar rag and cleaned it up and wiped it down myself.  Once at our table the server was nice enough, but obviously had way too many tables assigned to her. The service was slow.   The food was okay, and I'm sure I would have had a better experience with my meal had the service been better.  If you're going to give this place a try do not do it at any time when there are anywhere near busy.   I have eaten at the Mount Lebanon location numerous times and I've never had a bad experience. From this point on I will not return to the Pleasant Hills location and I will only dine at the Mount Lebanon location.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "d7Gy-ydv645YyGZdVcn8PA"
  },
  "DsGe3xbFlnPx-UtwkZNgSg": {
    "date": "12/4/2012",
    "text": "It's good American food---what more is there to say? American cuisine isn't my favorite by any stretch, but for those who love it, this is good. Here's a breakdown of what we ordered:  Tuna appetizer - Tasty tuna, though the portion was a bit small. The sesame ginger dressing on the salad that comes with it was tasty, though I'd ask them to skip the fried noodles.   Crab Cakes - I don't usually crab cakes anywhere because no one beats Monterey Bay, but these were good. Light on breading and heavy on the crab, just as they should be.   Twin Filets - The filets are very tender, but cooked over wood. If you like a smoked, campfire flavor, you're in luck. If you don't, order something else.   Swordfish - Tasty with the pineapple chutney. Order it medium rare.   Limoncello - Light, airy cake with a whipped lemon pudding filling. Very tasty.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ROx8_SMW8b9WAQBbuNWmg"
  },
  "9rvzz-mwd03xnlhEt-6KTQ": {
    "date": "4/5/2014",
    "text": "I went to Atrias for lunch yesterday. I ordered beer battered fish and chips and a cup of Crab Bisque. The soup was lukewarm. I told the server who went back to turn up the heat on the pot. Then my fish arrived. The first bite was mushy but I thought it was my imagination. I continued to eat, the fish was cooked by put the batter was not. I should have gone to Arby's, my stomach and my wallet would have been happier.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YOfS6P3bXLNfBd178RsRJQ"
  },
  "Rc2uLrSlO7PqyxuGbkS3Lw": {
    "date": "6/4/2014",
    "text": "Disappointing experiences here.  I was pumped when Atria's moved into the neighborhood for a place to grab a decent bite and beer but I have recently crossed it off my list.  I was taking lunch appointments here for a good period of time but I have started to go elsewhere. It is over priced both in the restaurant and at the bar.  The bar is very inviting but always has a nasty wet towel smell that just makes you not want to spend any time at it. This is a shame too because it is a nice looking bar. The best thing on the menu is the Reuben if you are trying it but the last one I had was so bit it ripped through the bread.   I will probably try it again in the future but my expectation is low.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "m31tBONQLxKLdPytY2Q75w"
  },
  "4bQr_5h-wiTg9QiBGW2WoA": {
    "date": "9/8/2017",
    "text": "We had a group of 12 tonight and we had 2 waitresses.  Neither of them knew who ordered what we had to raise our hand every time someone got a drink!  She even asked \"um, who ordered the water\"?  We were so confused, by the time everyone got the  food and drink, I think we just said it was ours so they would go away. I don't know if they aren't uses to big parties, but 12 people is hardly a crowd. You don't even want to know what happened when the bill came...totally the worst service ever at Atrias!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cdRhclk9uKHkiOdyHL7Pmw"
  },
  "humodSKABdf8C2tYVAs99g": {
    "date": "4/8/2015",
    "text": "I arranged for a business networking luncheon at Atrias. I arrived late and the staff had already seated my colleagues,  got their drinks,  and covered for me. The menu is simple and efficient, though the prices are about 10-20% higher than I thought was justified for salads, sandwiches, and burgers.  The decor is tastefully done in an upscale manner, which added to the ambiance provided by the low light and low music. No issues with the food. I will likely try to have dinner here soon and see what else the kitchen can produce.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3k532ShC8-IOtUTv0Ud5Hw"
  },
  "XccX6IH_TazuVajSmYLn-w": {
    "date": "11/10/2015",
    "text": "Martinis are great food is overpriced and a little bland.  there are a handful of goods seats. The rest are more reminiscent of a dimly lit dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XmfdWFH6hbICqjDHz-Z0mQ"
  },
  "Z2_S9rg8DoK3it1Az0BNvg": {
    "date": "11/6/2016",
    "text": "Great food, good service. I had the pork medallions and they were great and the Mac and cheese was to die for.    I often fail to find something unappetizing on the menu.  You have to make a reservation because they are always slammed, but for good reason.  4 stars!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t0enY74j7zfHh6tigzO2lQ"
  },
  "g909VRH2GO_xsIesyy1I3g": {
    "date": "1/22/2013",
    "text": "We used to enjoy going to the BRASS RAIL over the years, and we were quite disappointed when it closed.  It's an excellent location for us, so we were very happy when ATRIA'S opened in that same spot in the Bill Green shopping center.  Personally, I remember when Atria's was a hole-in-the-wall place on the Dormont/Mt. Lebanon border where you went to pick up a six pack of yellow beer, but over time, that original location turned into an upscale sit-down restaurant with excellent food.  Well this NEW Atria's location did not disappoint!  Our party of six was greeted nicely and seated promptly in the glass-enclosed front room.  The location of our big round table was a little awkward for the wait staff (they really couldn't get to a third of our party, and things had to be passed to them) but the seats were comfortable, and the wicker/rattan table with the glass top was handsome.  I don't usually notice things like place mats, but I really liked how these ones complimented the table nicely.  The youngest folks in our party were impressed with the decor of the place.  The room we were seated in turned out to be a little on the noisy side, because three sides of it had very reflective glass walls.  We remarked that a room with that much glass should have some plants or some attempt at sound dampening, but ownership went with a very clean and modern look.  We were served by Sarah, a lovely young lady who appreciated a large table on a slow Sunday night and who seemed very sincere about making our first visit a good one.  She succeeded, and I would ask for her specifically upon my return.  Sarah had good support from other staff members who assisted her, and we even received a visit from the executive chef, who mentioned that he'd only been out of the kitchen five times the whole day.  He was funny, and when our friend asked him if the fresh salmon being served that evening \"had a name,\" he responded, \"Tom Brady.\"  The first thing we noticed was a rather limited tap selection.  Guinness was available, but we opted for Southern Tier 2X IPA, thankful that there was at least one really good beer on hand.  Why upscale restaurants waste their taps on multiple \"light\" beers is a mystery to me.  The first thing that came out of the kitchen were our soups.  The tortilla soup was richly seasoned, thick, and excellent.  The sherry crab bisque must have been really good too, based on our friend's \"mmmmmm\" sounds.  I was intrigued by the \"winter warmer\" selections on the top of the menu, and so I opted for the \"char-grilled meatloaf stack.\"  It was excellent.  The meatloaf slices were grilled to perfection so every inch had a nice crunch on the outside with nice moisture on the inside.  The barbecue sauce was sweet and unique.  My dining partner immediately helped herself to some of the jalapeno cornbread on the bottom of the stack. It was firm, but moist and delicious, with just the right amount of sweetness.  The smashed redskin potatoes with onion straws topped off the stack, and their flavor was just what I had hoped for.  This was a wonderfully conceived and executed dish, and I even took a picture of it.  (I will attempt to re-create this one at home, giving all credit to Justin, the chef at Atria's.)  Fortunately for me, my dining partner followed my friend's lead an ordered a dish with a fresh salmon steak.  She got the flame-grilled salmon salad.  Not only was it a very nice salad with a very interesting poppyseed dressing, it came with a nicely-sized and perfectly grilled piece of very lightly smoked salmon.  It was so tender and moist, with just a little bit rare in the middle, the way salmon is supposed to be done.  Kudos to the kitchen for not overcooking \"Tom Brady.\"    Around the rest of the table, everyone was all smiles.  One of our party ordered the petite filet with crab cakes.  She said her filet was the best she'd had, and the color in the middle was just right for medium rare.  The crab cake was a good size, and she ended up saving most of it for later.  I wish I had gotten a taste, because she raved about it and a good crab cake makes me smile too!  Her partner got an interesting pasta dish called \"fra diablo,\" with sausage, chicken and banana peppers.  He likes the spicy things in life, and he was quite impressed with this dish.  My foodie friend has a miso-glazed salmon, and he thought it was among the best-prepared pieces he had ever tasted.  I am looking foward to returning to Atria's soon, as there were several menu items that intrigued me, and I thought the prices were moderate for food this good.  Maybe I'll even try the hand-breaded cod sandwiches in honor of the old Brass Rail, which had my favorite fish sandwich in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3r7gJzSvJrEd0zMftppSYA",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. The salmon salad at Atria&amp;#39;s is pretty special!  Strawberries, almonds, goat cheese and poppyseed dressing on mixed greens.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3r7gJzSvJrEd0zMftppSYA/o.jpg"
      },
      {
        "img_id": "bOef9tz729BeT2iEY5tdoA",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. This is the Char-Grilled Meatloaf Stack, part of the winter warmer menu at Atria&amp;#39;s.  Excellent creation!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bOef9tz729BeT2iEY5tdoA/o.jpg"
      }
    ],
    "user_id": "gdJasOzvva2NxSpNjVXwvQ"
  },
  "Oj3gTa5qowptW8tEC64YNw": {
    "date": "5/15/2016",
    "text": "After a not so spectacular trip to Atria's about a month ago, the wife and I decided to give it another go after speaking to one of the managers and getting stuff straightened out. Long story short they've won our business back. The crab cakes were outstanding, her chicken picatta was on point and did we mention 1/2 price bottles of wine on Fridays? Our server Robert was amazing and the MOD Rocky is one of the nicest guys ever. Thanks for a great date night!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ABbmYYaN3zXbM9KTckDnXA"
  },
  "n_pSPeYsdPyqRaG1JUws8w": {
    "date": "6/9/2014",
    "text": "After having been at this Atrias several times since opening they have gotten it spot on!  Service and food rivals the original and our other favorite Murrysville location! Chef came out to see how we liked our dishes which were amazing and perfectly prepared! So happy that this convenient location got it together!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LPWSfa9mGf59P7KZg_eOdA"
  },
  "enC3ZlDDEn5PlCkIg9V8Lw": {
    "date": "2/3/2016",
    "text": "I love Atria's! My friend and I met for dinner here on Friday, January 29th. We had a lovely waitress, Robbin! She was an absolute delight. We ordered happy hour appetizers and shared a half off bottle of Pinot Noir. Dinner was amazing. Robbin went out of her way to be personable towards us and was a delight! She was knowledgeable about the menu options and how entrees were served. She also did not rush my friend and I to leave, which I appreciated! How many restaurants can you think of where you are rushed to order, eat and get out?? Again, dinner was amazing. Robbin was wonderful and I will most definitely return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2uBTOV1Y6yJ18kmMpPh-gg",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Filet with asparagus and risotto I stole from my friend&amp;#39;s plate!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2uBTOV1Y6yJ18kmMpPh-gg/o.jpg"
      }
    ],
    "user_id": "qIvNjET2-tTR_1cQRGjZ4A"
  },
  "Szgrbed90smGmvQrTxKGow": {
    "date": "10/31/2013",
    "text": "People on and off of Yelp often claim that I never eat at home. If they only knew me from reading of my gastronomic exploits, they'd appear to be correct. For example, last Friday night, a then culinarily-challenged Kay needed to do some running around in the 15236 zip code, and knowing that the good old Bill Green Shopping Center houses an Atria's franchise, we decided to dine there before \"putzying arahnd\" in the dollar stores of the South Hills as us 'Burgh folk say.   This newest (?) location is rather glamorous, making it the opposite number of its homier Mt. Lebanon progenitor. One might think Michael Buble could waltz in at any moment for drinks and caviar on crackers. Instead, fare made famous by larger, nationwide chains comprises the gist of the menu. Expect steaks, pasta, meatloaf, burgers, sliders, and nachos to challenge your decision-making skills while putting in an order.   Kay and I began with an order of Pot Roast Nachos. The bed of sturdy, crunch-mad tortilla chips were garnished with jalapenos, sour cream, tomatoes, cheddar jack cheese, scallions, and of course were topped off with that luscious, steaming shreds of the exquisitely braised beef. Our serving was so greathearted, it could have made for a shareable, pizza-like meal in its own right combined with my fine, bountiful ranch-dressed Cobb-ish \"House\" salad (hardboiled egg, cheese, croutons, diced tomatoes, greens, and bacon were on the plate) and dessert.   Alas, I was unable to finish my full rack of Baby Back Ribs, something I probably had no business ordering at a chain restaurant, an act that and will likely incur the wrath of the barbecue orthodoxy.   I have to apologize to the Southern Death Cult for committing yet more heresy, but it must be said that the sticky, honeyed pork pulled off its bones without coercion while hickory whispered in the winds. Perhaps it wasn't the zenith of BBQ, but damn, if this is the worst, then God owns a smoker and uses with regularity, holding massive cookouts for all the dear departed souls in Heaven.   The dessert we double-teamed was a \"Chef's Whim\" or \"special\" or something along those lines titled the Chocolate Mousse Crepe. Fluffy, grey, cocoa-infused foam filled thin, slightly crispy and tortilla-esque pancakes that were embellished by the standard whipped cream. hot fudge laces, and caramel streaks. Filling the crepes with mousse smacked of excess. Spooning the mousse from a goblet or tall glass with chantilly to roof it would have been an exercise in simple, pleasurable elegance. Nonetheless, no one heard us grumble over this more than acceptable confection.   It took me a good number of years to consider Atria's, and now I'm left considering a visit to all of their restaurants. After all, this crabcake lover's gotta see if they truly are \"The Best in the 'Burgh\" as stated in the bill of fare. I almost asked for that in lieu of the ribs too...  P.S. Keith, our server, was class personified and made no missteps during our dinner.",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 12,
      "cool": 8
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "FvQzlp1ANgeIuj-O3RJhHw": {
    "date": "5/25/2017",
    "text": "The first time I went here I had an amazing experience. The manager brought our table a free appetizer and the service was incredible. I got the Baja Tacos and I could not finish all of it. A tad expensive but worth the money. The second time I went here the service was not as great but the food made up for it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MqQpSOe0PJFVG6EgTE2uwQ"
  },
  "3ePea-QkUwjo7bStoT5FDw": {
    "date": "12/7/2015",
    "text": "I always eat at the bar and often times I take clients in for lunch. They do a nice job of keeping the menu fresh and the prices are on the heavy side but the portions are generous and the food quality is much better than average. Parking in the Bill Green shopping center can be challenging depending on what time of day you decide to visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CC8CjFzY8YjqFsFoCmp69A"
  },
  "saqGqEojpTosVL0X5vlfdw": {
    "date": "4/3/2016",
    "text": "Most of the wait staff at Atria are fantastic. John the bartender is awesome!  My favorite is the salmon salad and I get it almost every time. Friday nights at Atria are super. Half priced appetizers in the bar area, $2 Sangria and half priced bottles of wine.  It's a nice place for a date or to just catch up with a friend.   They have frequent menu changes to keep things fresh, and some nice events so be sure to join the email list!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HpWdzPPCu0-fc6tG5PjGnQ"
  },
  "tnU2Bwha4GResZyl423x_A": {
    "date": "12/30/2016",
    "text": "Normally I'd give this place 4 or 5 stars but this is based in our last dinning experience. Made reservations for Christmas eve. I know not the best time to judge a restaurant but we've been here before for Christmas Eve and have had good experiences. This time when we got there 10 minutes early we were told our table would not be ready and we could sit at a high top. Not what we made the reservation for - sitting in the bar at a high top. About 40 minutes later we were finally seated. To their credit they offered the 5 of us a complimentary drink from the bar but since most in our party don't drink we declined. They did give us free appetizers - zucchini and calamari. Not one serving each but two! And our waitress, knowing of our situation, was over-the-top polite and willing to serve us in any way. Everyone else's meal was good but my NY strip steak was tough and didn't have much flavor. I'm glad this wasn't my first experience here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8VaCl2D4ihKnMWVx3flq1g"
  },
  "h-CPdzxkN5oCAs__O086SQ": {
    "date": "7/20/2015",
    "text": "For the price, I would rather go to Olive Garden, sorry i feel mean saying that. its so nice and beautiful there, but the chicken Alfredo was weak, taste like water and noodles and for the price, eh. not worth it. Service and atmosphere was top tho. too expensive for me.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5BCPQ0TyfOe656bM2uW7bQ"
  },
  "HFNZFRKlnc9AeX11X4cv9A": {
    "date": "11/28/2012",
    "text": "A nice new Atria's.  The atmosphere is split between the front with a patio type feel that has large glass windows and a lot of sun light, a big U-shaped bar in the middle, and a more upscale darker back room.  It was crowded and a little noisy.  The parking lot for the shopping center (Bill Green) was pretty full with Atria's and the other stores clientele.  The food is typical Atria's.  The Sherry Crab Bisque was OK...a little to cheesy.  Have found the pasta's are pretty good and ordered the Nonna's Sunday pasta, which has some sausage and slow cooked beef.  Very tasty, the brisket really added some nice flavors to go along with the sausage.  Our waitress had trouble answering a few questions but a waiter helped out and said the Nonna's pasta was his fav.  Service was pretty good and the meal came out before some other tables that were seated before ours, maybe they ordered after us.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "K_bGPMWAb-LHyLX2QzgjMA": {
    "date": "1/12/2017",
    "text": "It was my first time at Atria's last evening with my boyfriend and it was all around one of the best dining experiences I've had in a while! Very unexpected! They kept it classy. The servers worked as a team and since it was my first time, the manager gave us a free sample of their fried zucchini appetizer. The zucchini was cut very thin, which I prefer, giving the dish a nice balance of tastes. My boyfriend ordered the crab bisque, crab cakes, and I ordered the pot roast along with a 1/2 priced bottle of wine (wednesday special). Everything was very good. We were very impressed with the overall experience and will be back. Great job!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RefBYElmTIhfQpzKYykivQ"
  },
  "8L5e4S3p86T__DWCJT6oYg": {
    "date": "5/8/2016",
    "text": "Food was delicious, service from Shauna(shawna) was terrible. Right after being seated and acquainting my son our server shawna approached our table, threw down drink napkins, made a rude side comment about the mess my son was about to make and walked away. She was obviously not in the mood to deal, service or wait on us. So after making a few rude comments to a coworker Shawna sent Lori over to wait on us. Lori was more than pleased to make up a lie to cover for her coworker and take our order. We then had to \"enjoy\" our meal while not feeling welcome with our son. The crab cakes egg Benedict was delicious. So were the ham and obrian home fries. Lori received a nice tip for positive friendly service!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zsj2_qlJcVvTJ0S8gWRwbQ"
  },
  "onZP2K5D8myaE8hSpxIHyA": {
    "date": "8/11/2014",
    "text": "Love this place. It is well maintained/recently remodeled and the food is always good. Zucchini strips are spot on and I often get the Reuben sandwich which is huge and comes with well seasoned homemade chips. Also have had the crab cakes before which were also very good. I have never had a bad meal here. The service is also always quick and friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XWEbLpANMuEajGXWZ3_CEQ"
  },
  "cOzT84D_MYdCa4rOemZHdw": {
    "date": "8/30/2015",
    "text": "I hosted my sisters bridal shower here... They did a great job and were very helpful. I would highly recommend hosting a dinner party or luncheon with them. Service was great and many guest commented on how they enjoyed their meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yjt92sUKNHiVX4bqsEaWmg"
  },
  "3Cdj2aWnNsEYmR7Z4KPQBA": {
    "date": "4/8/2018",
    "text": "Stopped by for lunch and was promptly seated. Started with the zucchini, a little thicker than I preferred but was decent. Ordered the sliders with a cup of crab bisque. The bisque was very good, but the sliders were overcooked, almost hard. My dining partner had some of their chips, which were crispy and flavorful. Good service and overall not a bad lunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zfkF4wF7QCaTydMa4pRIkA"
  },
  "ttsjulNc58EzXERNJ1NoYw": {
    "date": "4/28/2015",
    "text": "First visit to this place and it was AMAZING -- on business travel and so hard to find a place to eat well in West Mifflin.  This place is good enough for client -- without having to drive to the waterfront.   The Zucchini was light and super tasty, the staff was great and all the food was succulent!      We were planning on a light dinner and after have a 5 course meal!  In case you are wondering felt good the day after.  Highly recommend this place.   They even cooked a dish that was not on the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nMvA9BAjX1hc2CC_xWIT9g",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. They made this on demand! Not even on the menu!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nMvA9BAjX1hc2CC_xWIT9g/o.jpg"
      },
      {
        "img_id": "nfEFojy3h345DA3g2zgNNw",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nfEFojy3h345DA3g2zgNNw/o.jpg"
      }
    ],
    "user_id": "-u4b0bAIYxfOfzXYBJ8GdQ"
  },
  "hnWAcQdPFyb1BZabf-sQqw": {
    "date": "9/16/2017",
    "text": "The cheese soup was awesome, she crab soup was good, a little to spicy for me.  Spinach bacon salad had hardly any spinach.  I dont recommend it.  Ribs were good,but the fries were soggy.   The pot roast nachos are really good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kLLjtwneIaTjnzNb1SkPeQ"
  },
  "E0_JLqW82Vxbaa438lIOrw": {
    "date": "9/14/2017",
    "text": "Absolutely great food. They got rid of this fabulous gouda macaroni and cheese which is why I only gave it 3 stars bc that was one of the best things on the menu. Nice atmosphere & phenomenal carrot cake",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BfaBzvRak5dF61YnHyVV6A"
  },
  "Ef9ODdYhUJlC8Y8qzwDipQ": {
    "date": "5/1/2014",
    "text": "OK - really 3 1/2 stars but Atria's is the best thing to come to the south hills of Pittsburgh in recent years.  In a culinary wasteland, south hills such as it is, Atria's stands out as a pretty classy joint.  Very decent upscale bar with two females providing nice and friendly service.  A couple of burgers on night one with house made potato chips and slaw, delicious.  Second night tilapia dishes just okay.  Overall you could do a lot worse, and you usually do in Pittsburgh.  But, with Atria's we have now found our hang out when going back to visit friends and family in the Burg...",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2FFV6At1U8w2nefNiI15vw"
  },
  "aolmkKkeXrMgpogp4gL25w": {
    "date": "2/19/2017",
    "text": "This was one of my favorite places.  My husband and I would go there once a week not anymore.  I got chopped salad and it was 90% carrots.  I ordered meatloaf stack and the underneath of plate had dried stuck on food made me wonder what was under meatloaf.  Manager was very apologetic and removed it from bill since I didn't eat meatloaf and offered another dinner or desert.  Seem like standards are dropping at this location.  Service was very slow and poor from Ali she was much to busy taking care of bar and other tables.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eiE2ix_dXjvgfEBN4QYq5A"
  },
  "Zi9t65Fn-UjCLkMO8OkZ1w": {
    "date": "6/16/2017",
    "text": "After a bad experience at a different chain, we decided to go to Atrias due to its location. It started off with very polite and outgoing hostesses and a next to nothing wait. Our waitress was Robin and she was fantastic. Not only was she an amazing server but also a very nice person. As it was our first time, the manager brought us a free appetizer (zucchini) and it was great. She was also very warm and welcoming. The food was incredible and I highly recommend the chicken piccata. Add on 5 dollar Moscow Mules and you can't beat it. Very impressed. Will be back for the food but also for the staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "osN3A7Xtg-ucY8exAsdODA"
  },
  "igHigf1gq61Kt3N2hlPMnw": {
    "date": "6/16/2016",
    "text": "I've eaten here twice. The first time, Atria's was recommended by someone. They said to let them know it was your first time. We did, and were rewarded with a sample of their fried zucchini, which is delicious!   Both times, the service was excellent, the food was fresh, hot, and tasty. This last time, I had a brunch platter, with eggs and potatoes, pork, and salmon. It was all amazing! Loved it!   Looking forward to my next visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cMk9Pkmpbn0iD2POqR_VLQ"
  },
  "TQ4IU-svKSzEhVQkInsFag": {
    "date": "3/2/2016",
    "text": "2 of us pilots in for lunch again. Having salmon salad. Was real good. Nice salmon filet, warm, on bed of lettuce and goat cheese with really good dressing. Friend had a chicken dish. Kinda small portion compared. Mashed tators. Says was good. Brownie sundae dessert very good. Another good choice here. I lowered the star rating only because of what I considered a small portion of the chicken dish. Maybe not fair.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZRnsUs9q6DbeJbOLjCY4ZA"
  },
  "l1PaDx6h8LDOPWv7xvUCPQ": {
    "date": "12/21/2015",
    "text": "Had appetizers at the bar while watching the Steelers.   Nice glass of wine served by an efficient bartender.  I had the pork roast nachos and my husband had the coconut shrimp.  I LOVED the nachos.  Never had anything like this before and they were wonderful.  The coconut shrimp were large and well flavored, served with a sauce.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AXBsPgSbyjGkAqPLSwiTYg"
  },
  "9tZbV_izIWA8MUKhM9Of-w": {
    "date": "3/27/2017",
    "text": "Had a salmon salad. Delicious taste and done to perfection. Not overcooked like so many restaurants do. Waiter was attentive and really nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9r4qhQiZPxBEjj92aiOvSg"
  },
  "Mk7dwlqUFKrNpQRgSGTHNQ": {
    "date": "3/11/2017",
    "text": "There were 4 in my party and we were seated right away. Each liked what they ordered. One had a Moscow Mule and liked it. Waitstaff was outstanding. The only negative for me is they are pepsi products only. I'm a coke fan.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ap488mQMPTTWoJV-vlMGMw"
  },
  "PKvc7A0SDe5HaZOS0cKRRQ": {
    "date": "10/24/2015",
    "text": "Love the Fall Menu!  Had a fantastic Thanksgiving dinner at Atria's last year and considering returning this year.   Good drinks at the bar too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Z3vmPWEMzvzvY-OPLnIMLg"
  },
  "pEC-mEoLWN374jw1umidBA": {
    "date": "6/17/2017",
    "text": "Unfortunately, the hostesses ruined our experience and the adult supervisor said we've been busy. We waited 10 minutes but never saw a waiter.  The hostesses were extremely immature and very unprofessional.  It's a shame that customer service is not important to this location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SmvwPZtB-hgpJa3evT3WVA"
  },
  "c4AXguHiFTAw6aRqDLqDiA": {
    "date": "7/24/2015",
    "text": "I have over 100 check ins here.  I have watched it grow and evolve into a much needed classy yet comfortable restaurant bar.  I love this place!  The food, the professional bartenders, the atmosphere.... It is a great place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "el9rzpVvYLk-3tU1n088Lg",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/el9rzpVvYLk-3tU1n088Lg/o.jpg"
      },
      {
        "img_id": "i44JV-C9BzjPJRJB3CsvMQ",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i44JV-C9BzjPJRJB3CsvMQ/o.jpg"
      },
      {
        "img_id": "DfQbcYs1bwztL4yj8HP3Hw",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DfQbcYs1bwztL4yj8HP3Hw/o.jpg"
      }
    ],
    "user_id": "0xBrS_K7dxTB8kBRgTmPTw"
  },
  "WFBBXlQYQQSEYl5BJje3-w": {
    "date": "7/21/2016",
    "text": "It's so wonderful to have a place this close to home that is so good.  The service is just outstanding.  Had the salmon special and the chicken piccata.  Both were very good - fresh tasting and served with delicious fresh roasted asparagus.  Lisa, the bartender was very helpful and knowledgeable.  We need to go there more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "duaJxYWc5pxKuYll6L7sOg"
  },
  "81S8OMrRfRFtN_QCbTAYfg": {
    "date": "4/16/2016",
    "text": "The hostess are the face of the restaurant! If they are not personable, it becomes an issue for me. We proceeded to our seat and we were served by, Jess. She was absolutely phenomenal.  If you come here,  ask for Jess. She was very personable and knowledgeable about their menu. She helped us pick our food because this was our first time here.    I had the rachel. It is a turkey sandwich with coleslaw, thousand island dressing and cheese. On the menu it stated it was the best in town and i have to agree. Ot was a great size portion. In addition,  it came with homemade chips. I am a potato lover of any form. They made it fresh and it had dry ranch seasoning. It came in a nice size bowl to share for two. I was overall impressed with my food.   The prices are reasonable for how elegant this place is. I heard they have other locations, but i just may stick with this one.   Staff are friendly as well as management.  Its a great environment.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "thjpuRdgQaiGlIT6kX0vbg"
  },
  "6ERdUgDhTy-ohzTU7zyIlg": {
    "date": "3/20/2017",
    "text": "My family have on a yearly basis a large celebration for our elderly mother at this restaurant. Each year we have had a wonderful experience with both the food and the service.  Last Saturday we had 19 dinners, 7 children from the ages of 4-11. The restaurant did a fine job and the two men serving were excellant, particularly with the children (treating them with respect, having conversations with them).  The selection of food will meet any palate with delious well presented plates.  We recommend this restaurant for large affairs like ours or a nice meal for a couple.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qidd2uLd-ieaSsEKUg8OkQ"
  },
  "LOAV1yBvrfM79z8t8WAV9g": {
    "date": "11/11/2016",
    "text": "I absolutely cannot say enough about the amazing experience my boyfriend and I had here tonite!!!  The hostesses greeted us promptly on arrival as we checked in for our reservation (which I highly recommend).  We first considered sitting at a table in the bar but it seemed noisy and said we would wait for another.  The very polite and accommodating hostess asked if we would consider sitting at the chef's counter.  Best.decision.EVER.  We got to meet the executive chef and watch as he conducted the symphony that is Atrias kitchen.  Everyone that came by was gracious, incredibly welcoming and added to our experience.  We started with a fried zucchini appetizer (incredible).  I had a chopped salad and my bf tried the sherry crab bisque.  Both were absolutely delicious.  For entrees, we both had the bbq plate and substituted the ancho chicken for an additional bacon wrapped pork and gorgonzola medallion.  Every part of the plate was amazing on its own and all worked so well together.  For dessert, we shared the turtle brownie amazingness...SO GOOD!!!  The staff here obviously cares about their guests and that feeling is clearly evident thru the entire experience.  Long review but very well deserved.  PS...Jessica is quite possibly the best server we have ever had the True pleasure of meeting!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q3zZQ6Iu9a1jBNdC7W8sUA",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Turtle brownie sundae...make room for it.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/q3zZQ6Iu9a1jBNdC7W8sUA/o.jpg"
      }
    ],
    "user_id": "sQgx4EM1RgUcdsGg6mWFEA"
  },
  "pmwDitjF_mORnIfW2bGyEw": {
    "date": "9/24/2017",
    "text": "Very disappointed.. Always look forward to the Octoberfest menu. The pork shank is usually melt in your mouth delicious...Not tonight, under cooked and sides were mediocre. Consistency is lacking..and not worth the money.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rQEvkPxU6Ck00ZA-p8f_CQ"
  },
  "_bUYfO2k_rTvxbm8f-DMqg": {
    "date": "6/28/2018",
    "text": "I was staying in the area for work, was recommended to Atria's by a coworker. The food was absolutely delicious! Robbin our server was great! All around we were more then pleased with our experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iNAE0R5LSUZ9KhoCNcR1eg"
  },
  "L-49C6VCQ328wTzACGv1Rw": {
    "date": "11/8/2018",
    "text": "We love going here for a date night.  The team members are always friendly.  They have the best happy hour.  We love to get the nachos but instead of the pot roast we get the grilled chicken.  Once we order it everyone starts to order it.  They are delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ULbqZgurQMxXW_2QLQydQ"
  },
  "lBeT2-8l2ZGjUlnjwrCa8g": {
    "date": "2/20/2015",
    "text": "I'm somewhat surprised Atria's didn't get better reviews. I don't think I had a meal her he that I didn't enjoy. Maybe I have just gotten lucky.   Staff has always been friendly to us and the restaurant is very clean. I don't recommend eating on the patio in the summer when the windows are open though, there is an excessive amount of flies!   At our most recent visit, the waitress was extraordinarily helpful. She got me extra sauce for my left over pasta and extra pita chips for our left over cheese dip - I am not sure this is routine although it should be.   I do love Atria's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WViO9W7f8llotD_sV2fmmw",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Grasshopper pie! Loved it!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WViO9W7f8llotD_sV2fmmw/o.jpg"
      },
      {
        "img_id": "qiVztnX8Z6KGu1120oUSrA",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. The &amp;#34;Dublin Lawyer&amp;#34; - special for st pattys day - just ok, don&amp;#39;t recommend it",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qiVztnX8Z6KGu1120oUSrA/o.jpg"
      },
      {
        "img_id": "HFjBatroZSi7LPqE2-LggA",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Scotch eggs - special for at patty&amp;#39;s day",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HFjBatroZSi7LPqE2-LggA/o.jpg"
      }
    ],
    "user_id": "mm9WYrFhiNqvHCyhQKw3Mg"
  },
  "vzgJf1rQF_Q7THqNsBMghg": {
    "date": "1/29/2017",
    "text": "Although I have never been on an even night (New Year, Valentine's Day, etc.) I must say that every visit to Atria's on Old Clairton has been an enjoyable one.   FOOD - I have never tried a dish at Atria's that I did not at least enjoy some. There are a few items on the menu that I would rather get somewhere else but when I say a few I mean 2 or 3 out of 40-50 items on the permanent and seasonal menu. - Chicken Parmesan: This is by far my favorite item on the menu!!! You get 2 large pieces of butterflied chicken breast breaded perfectly over a bed of delicious linguini and homemade marinara to die for. Served with a large piece of garlic bread, I am so tempted to just get this every time I go. ALAS! Atria's is so good that I must expand my experiences and try something new every time. - Bread Service: They give you complementary bread although I highly suggest not filling up as you will regret not being able to fit more of their delicious entrees in your stomach. The bread is served cool/cold but soft and with only a slightly chewy crust. The butter is delicious BUT you have to ask your waitress to bring you out bread or else it will take forever! to get out to you. I would like it better if they were to bring it out with your drinks or at lease ask you during the drink order.  - Sherry Crab Bisque: This unfortunately is one of the items I suggest passing up or asking VERY CLEARLY for a sample to try it because while the bisque flavor is not bad, I've definitely had better. I may just be spoiled but I enjoy when there are a few chunks of crab pieces in my bisque. The flavor alone is not enough to please my taste buds.  - Other Soups: The other soups I've tried have not been anything special. All I remember about them was they tasted like they were supposed to taste. Not enough to order again for $5. -Fried Zucchini: I recommend this! Although it's $11, it was just enough to get out pallets in gear and it's very tasty! I - Caesar Salad: The salad is a nice size for $5. I like to add a side of anchovies, which is something I had actually never tried before Atria's, but it pairs so well with the salad. They are not mushy but a bit firm and easy to chew. This is still the only place I will eat anchovies.  - Award Winning Cheddar Burger: My husband is the one to order burgers but I have to try everything on the menu so of course I stole a bite or 2. The burgers here are decent: juicy and large but I don't go to Atria's for the burgers.  - Blue Cheese Burger: This is the burger to try before all others here. It may just be my love of blue cheese talking but I may have half my poor husbands burger when he ordered this.  -Fries: The fries are definitely real potatoes but this means that when fresh they are dripping grease and a bit on the soggy side. I personally don't like natural potato fries but if you do, you'll get a huge basket to munch on. - Steaks: My father-in-law had nothing but amazing things to say about his Filet. It was cooked perfectly and full of flavor according to him. - Bourbon Braised Pot Roast: Freakishly delicious but can be very salty just the way I like it. - Dessert: All of the deserts are crazy good. Try them all!  SERVICE - The service here is okay but 4 star review would be unfair to their chefs. All of my waiters and waitresses have been nice but I feel that adding just one more server would allow the tables that bit of time that lacks. To be fair, my food comes out hot, dishes never pile up, and my drink is never empty. There is just something I can't put my finger on that doesn't show a 5 star wait staff.  AMBIANCE:  - Atria's is loud! I mean, hard to hear the person next to you loud. The front sun room is the worst. We always ask specifically not to sit there because it's just a large glass bowl filled with what sounds like yelling people. They definitely need something to downplay the noise, this is not a divey sports bar filled with millennials. The bar area is slightly less noisy but still hard to hear your party then if you can get the dining room I recommend that. The only down side is now you have to deal with the kitchen noise. There really is no where to go in that restaurant to have a nice normal indoor voice conversation with other members of your tables.   ATTIRE:  - the crowd is older but I still feel comfortable going in jeans and a cute blouse. No one is going to care about how you dress but you may feel out of place in a Hawaiian shirt and flip flops.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "bX1VHFVy5S23BtSxGxhHSw"
  },
  "p3B3Uagc5007xNr3uB3kqg": {
    "date": "2/4/2018",
    "text": "I like the decor more than the food. The food is okay. Fill up on bread because the portions are small. The staff is sometimes rushed and their professionalism can read as insensitive. I've never been there where the server wasn't hurried and seeming impatient. But still, it's probably one of the top five restaurants in the area for finer dining.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7c5sKyQk30DX2mK5tHbOkg"
  },
  "RACOWuXVOcYJimpOyB9New": {
    "date": "8/6/2018",
    "text": "This is (was?)one of our favorite restaurants but our recent experience there was very disappointing.  The service started off well, but went downhill from there.  I think our server may have actually forgotten we were there.  There was a problem with my husband's food that was never addressed despite our asking several times.  Fortunately, it was only one part of the meal and he was able to eat the rest.  Long wait for drink refills.  LONG wait for check.  The worst part was the manager kept rushing past our table and didn't seem to notice that we were sitting there looking unhappy with nothing on the table but dirty dishes.  However, the food, for the most part, was very good, which is why I gave it 3 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fpz8Ygnl5wRE5fxjtrEw3Q"
  },
  "kJgHdY3_KqkCHbKyO2VM9g": {
    "date": "5/10/2016",
    "text": "Atrias is usually always a solid 4 stars for me and this time exceeded it! The only downside to this trip is consistent with this location, the area where you are greeted and speak with a host is overcrowded and confusing. I always have to make a point to speak with a host/hostess even with a registration. Organizing this area or repositioning the computers and counter would be a great idea.  Outside of the past comments, this trip was amazing. My family and I came to this Atrias location for mothers day. Our server, Jessica, was absolutely amazing and very polite! Service was wonderful!  The food was solid! The cocktails we ordered weren't anything special, but were brought in a timely manner. Appetizers were the pot roast nachos which are always a win, and the fried zucchini that certainly hit the spot! I ordered the seafood cobb and it was the BEST cobb salad I have ever had. Shrimp, mussels, and crab should always be included in a cobb!!!! Dessert was wonderful. The key lime pie was so-so, however the carrot cake was the best I have ever tried!!  Overall, Atrias is always a win in my family's book and we would recommend it to anyone!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8Hck-YADDhhZjJLPpm8bIg",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Fried zucchini",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8Hck-YADDhhZjJLPpm8bIg/o.jpg"
      },
      {
        "img_id": "iwOxsV_YVugwZ40UDxta2A",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. The pot roast nachos that we couldn&amp;#39;t even wait for a picture before diving into!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iwOxsV_YVugwZ40UDxta2A/o.jpg"
      }
    ],
    "user_id": "nEHlNG1JrwiGTXjOHwMAuA"
  },
  "lPPAcQSCAWfZZa30fql_mw": {
    "date": "12/20/2017",
    "text": "Don't got to the Clairton location after 930 PM if you want to be allowed in and have a chance to eat. This chain needs to get its act together! I saw great pictures of their food and was excited to try them out. Unfortunately when I showed up at 1015 the door was locked despite a dozen or more people being visible inside at the bar and eating. A woman outside smoking asked me if the doors were locked and when I replied yes she said well that's crap I need to go back in and finish my meal. I knocked on the glass doors and was ignored by staff. Finally a group was leaving so I entered as they left. Upon entering a staff member charged up to me aggressively as if I had broken into the place. I said do you know your front doors are locked as if it was a mistake, he said \"Yeah we're closed!\" I said \"your website says you close at eleven.\" He walked off to complain to the manager saying\"Yeah we need to get that changed\", dismissing me like a scolded child. I walked out very frustrated and annoyed. I propped the door open for the smoker and she said \"They told us the same when we walked in just before ten and ordered food.\"  Time to get your website and Yelp updated! While you're at it teach your staff some manners, don't lock your doors, signage your entrance better with your hours and coach the staff on how to politely explain the kitchen is closed, the bar offers last call at 1030 and your 'Tavern' closes at 11.  Need some examples try Applebee's up the road. Two great experiences in two days. A national chain beat you! Oh better yet, stay open until 11 serving food and bar closes at 12 and you \"might\" get some of their traffic. Bummed I didn't get to try your food! Good luck!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SnNQBRVlaLnkenal3xAJ_w",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SnNQBRVlaLnkenal3xAJ_w/o.jpg"
      },
      {
        "img_id": "f04jRWduOiyGtmJD13jFaw",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f04jRWduOiyGtmJD13jFaw/o.jpg"
      }
    ],
    "user_id": "5Mjmnwffwi09ClzdHZYPaQ"
  },
  "jNTv7Q_lI_3lMOPIJZnEfw": {
    "date": "3/24/2017",
    "text": "It's not amazing but it's also not horrible. Better than some Italians restaurants I've been to. It beats Olive Garden. Could stand to be updated.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jet0QZQqYFQkvyzLZbFBQQ"
  },
  "aJZTxRKybRkYCOgEsR-HdA": {
    "date": "1/23/2017",
    "text": "Came here for a quick lunch on New Year's eve day and the service was a bit odd. The hostess took several phone calls before acknowledging our party, and then seemed confused when I asked for a table as opposed to booth, to better accommodate a highchair. Everyone in our party ordered burgers. They were fine, but yeah I've had better. The fries were also okay. Overall, it was the atmosphere at this location that was off putting. Maybe the fact that it was New Year's eve, or part of the restaurant was booked expecting a large party later in the afternoon, but things just seemed off with the staff, they were friendly, but also appeared anxious.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wvjzBsm6trJ_fM5X2UsteQ",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. The Award Winning Cheddar Burger!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wvjzBsm6trJ_fM5X2UsteQ/o.jpg"
      }
    ],
    "user_id": "EFfQZFfWWlxZ4ckTJdBLtQ"
  },
  "vlzVIiME4P0AKhB9UoqBoA": {
    "date": "9/2/2017",
    "text": "Just okay for the price. My husband got a filet, ordered medium rare, it was borderline well done, which server admitted. He ate it because it's awful to waste good food like that, but not much of an accommodation for the mistake. The wine list was extensive and excellent. The salads and soups were very good. Service was excellent, we really liked our server. Just though the food was mediocre for the price.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cWhFAf52fqB_KdpAYlwSMw"
  },
  "d1gCdrNMRU6RL7ACQiEJDQ": {
    "date": "5/31/2015",
    "text": "The hubby and I hadn't been to Atria's in awhile so we decided to go there for dinner. They had several Italian dishes they were premiering. My husband decided to try the Trii-Color Tortellini.  I chose an old favorite-Crab Cakes.  You were able to get the Tortellini with chicken or shrimp but my hubby ordered it just as it was. It some of the best tasting pasta we've had. I'm not sure what the sauce was but it was delicious. You really didn't even need chicken or shrimp. It was great the way it was.  My crab cakes were delicious. They are mostly lump crab with just enough filler to hold all of the crab together. It was served with Parmesan risotto and asparagus. The risotto was cooked perfectly but a little bland. The asparagus was cooked perfectly.  Our server was very friendly and gave us great service. The restaurant is a nice environment that is welcoming and relaxing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "9mXic43TCyGUjY8YITGwlw": {
    "date": "7/18/2016",
    "text": "Atria's was a wonderful dining experience, for one shining reason for me. They went above and beyond to make sure my food sensitivities were handled easily.  I went with my husband and my parents.  We had to wait for our table so we ordered some drinks and sat at the bar to chat and peruse the menu.  Once we were seated (the wait wasn't that long although the restaurant was busy as it was a Saturday night), our waitress came over to take our orders and see if we had any questions.  As soon as I began to ask her about some gluten free options, she put me right at ease.  She suffered from Celiac's disease so she knew all about the ingredients in dishes and what on the menu could be prepared gluten-free. ( I also have a pork allergy that I need to work around).  She made many suggestions and even went back and spoke with the chef to make sure she was giving me correct information.  She said that they take food allergies very seriously and that gloves would be changed and my meal would be cooked in new pans/on cleaned surfaces to make sure cross contamination would not be an issue.  Our meal was delicious, but, honestly, the wonderful treatment by the staff was the most important thing to me.  We will absolutely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NI-afTSx0bYYv5KBu55VVg"
  },
  "xbiRTzfAMxYV16_CfHjkCw": {
    "date": "7/1/2017",
    "text": "Very tough to review. Service was fantastic. Food was very good .... But not memorable. Have you ever had a meal that everything was done right but it still missed? My steak and crab dinner was perfectly cooked. The mashed potatoes nice. It was like going on a date with a really nice girl that you just knew that it wasn't going anywhere.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xQw9BHwpG8oxnJlUurrEyw"
  },
  "DKR3OBfvWBxtVCNa2nJAYg": {
    "date": "6/5/2018",
    "text": "Stopped here for dinner with my husband.  I wasn't very hungry and the waiter suggested I try the \"Best Crab Cakes around\".  I did.  The crab cakes were very good.  Not the best around...but very good.  The waiter was really good, attentive but not pushy.  Overall great experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AS_A6M3aNxmxkPwmwd3dJg"
  },
  "58ZTu5_3D2bbG1HknPfx1A": {
    "date": "5/22/2015",
    "text": "Lunch with a coworker. We ordered the crab bisque which was very tasty, but a bit on the salty side. We shared 2 lunch entrees which were the bbq meatloaf and fish tacos. Both were good choices. Our server was very friendly and chatty. Our service was very efficient and we enjoyed our meals. The house made peach sangria looked wonderful and would have been ordered if we weren't headed back to the office. Maybe next time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KamkdPrXoCPiq0hNaIq7og",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KamkdPrXoCPiq0hNaIq7og/o.jpg"
      },
      {
        "img_id": "MEqhyOEkI2oVUsvuN5GUcA",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MEqhyOEkI2oVUsvuN5GUcA/o.jpg"
      },
      {
        "img_id": "Sa4CwcFNiOfN3_Kv9FhvKw",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Sa4CwcFNiOfN3_Kv9FhvKw/o.jpg"
      }
    ],
    "user_id": "c9rHIdsZLfCgDyYaPnPg0w"
  },
  "Bxlr49BlbWhs63hvj9wcfw": {
    "date": "5/11/2018",
    "text": "One of the best restaurants in town. Always consistent of great food and service. The only complaint I have is the hostesses. Whether the place is busy or full, they are never pleasant. Anything you say or ask for is a hassle. When you call for carry out or to make a reservation they even sound rude on the phone. The hostesses answer with some long bit of information, none of which you can understand. So glad it doesn't carry throughout the rest of the restaurant but the dining experience begins and ends at the front door.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7nzK8uMK3ruVogTSGNLytg"
  },
  "IkcAGo62-1aOgcAk9GzABA": {
    "date": "8/3/2017",
    "text": "Just had lunch here and I had the seasonal special scallops with avocado and corn salsa.  It was good but they skimped on the avocados  in the salsa.  My party also ordered the Rachel sandwich and the pasta with vodka sauce.  Both were very good as well.  The food here is consistently good and we would happily return  again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tDb-EDd6MV26tGwk6U8QOw"
  },
  "9Exxb0_olrRFytTp2oNxpw": {
    "date": "8/5/2016",
    "text": "Upon arrival we were immediately greeted and seated (we had a reservation just in case it was busy).   Service was pretty fast, within 2 minutes I had a cold beer  and my girlfriend had a martini . The beers were pretty small (I prefer a 16oz or 20oz draft). She said her martini (strawberry bellini) was really good.  I ordered the BBQ meatloaf stack and she got the chicken piccata. Before we knew it they were bringing out our food. Literally the best meatloaf I have ever had in my entire life! Everything on the plate was delicious! The chicken piccata was a large serving, she had to get a to go box for the rest, she said it was really good as well.  Really fast service, great atmosphere, and amazing food, definitely will be coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zHHfb4sap9FNavFN_33rqg"
  },
  "G2y1tW3NxWa_kqlb1cInjA": {
    "date": "2/25/2016",
    "text": "Dinner: fish and chips with coleslaw - disappointing. Fish was all puffed coating not enough fish. Fries were terrible! Rubbery and old. Coleslaw lacked character, no tang or flavor. Omnipresent tv had women and men beating each other...not my eating environment. Is this a sports bar or a restaurant? Rock music made conversation even more difficult.  In the past, at lunch when it seems quieter and more conducive to conversation, we have enjoyed excellent Reuben sandwiches. Hope they can change and build on this.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JPI-ElC0N1yPY_y-aqpGbA"
  },
  "pjAX5lQ43pD-TtYd3DO8nA": {
    "date": "7/22/2019",
    "text": "Fine dining and atmosphere in a restaurant located in a strip mall? Sign me up! We were in town and staying nearby for a family reunion, and Atria's proved a great find for dinner. The atmosphere is nice, the hostess and server were both great, and the bar seemed welcoming.   I could have eaten anything off of Atria's menu, that includes burgers, steak and a few salmon dishes, but both of us chose a Quinoa Bowl, since we had been eating horribly on the road.   The Ahi Tuna Quinoa Bowl with firecracker sauce was amazing, and had just the right amount of spice. The tuna was nicely seared. If I lived in the area, I'd be here every weekend. Since the family reunion happens here every two years in this area, I see an Atria's return in 2021!",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 12,
      "cool": 11
    },
    "photos": [],
    "user_id": "_cUtxCvCccwgNJzD5I0cDA"
  },
  "bd967P0vO7PtrDtex65c2g": {
    "date": "9/16/2019",
    "text": "Came here by myself on a business trip and the food was out of this world. The oktoberfest menu is incredible. Had the fried zucchini, chili, and the special braised pork shank. Staff were helpful and generous with their recommendations for a first time visit. 10/10 would come back every night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4FF2IcRvmPOP6awWwqFZIA",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Fried Zucchini with horseradish and marinara",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4FF2IcRvmPOP6awWwqFZIA/o.jpg"
      },
      {
        "img_id": "ckZErFxnsjUigQEuybEnEA",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Braised pork shank with mashed potatoes and red cabbage",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ckZErFxnsjUigQEuybEnEA/o.jpg"
      }
    ],
    "user_id": "1b-uJUV5J3GQyZnfLB5bfg"
  },
  "fI-x7N--ZxSalrovkNA67Q": {
    "date": "8/13/2019",
    "text": "Well well well - the food is pre-packaged - the atmosphere is loud and confusing - the staff needs help - what an overpriced pos - please don't waste your time",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VWmox-R0b2-RaWxkctlzJw"
  },
  "cXyX6t2MOQSgkKziQuZNfw": {
    "date": "12/19/2018",
    "text": "If you have the chance to attend one of Atria's dinner wine pairings... do it! This five course meal included some of the best wine and best food I have ever tasted. Everything pairs together so well, and it was a great opportunity for me to try foods that I normally wouldn't order or think I would like. The atmosphere is fun and the food is to die for. What more could you ask for?!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pnFfmp3UxSDkNbFddZVUew",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pnFfmp3UxSDkNbFddZVUew/o.jpg"
      },
      {
        "img_id": "yy3JTShOD-nQ_N_mZ7WWWQ",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yy3JTShOD-nQ_N_mZ7WWWQ/o.jpg"
      },
      {
        "img_id": "dAD3fUms6yap-j6uQ1jLCQ",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dAD3fUms6yap-j6uQ1jLCQ/o.jpg"
      }
    ],
    "user_id": "oosXR1ENqMWC18Y1yRJxOg"
  },
  "pJ3kxX3jfMc3ENEjNKH4QQ": {
    "date": "9/19/2019",
    "text": "I've eaten here a lot lately.  I have to admit, this is one of the best managed restaurants that I have seen (yes, I know it is part of a chain).  The food is always spectacularly prepared.  Although this chain is on the higher side price wise, it checks all the boxes that one would need.    Eating there last night, we had Carl as our server.  Not only was he positive, friendly, and accommodating;  but he also did all the \"little things\" right.  He saw my wife's iced tea was low, he refilled it without hesitation or being asked.  He didn't \"push\" me to get a second beer until my current one was 3/4 gone.  His timing was perfect on delivery from apps to dessert. You can also tell the management here runs a tight ship.  We basically had a \"chef's table\" style view from our table. The chef who ran the pass and the runners and wait staff coordinating together was truly a beautiful thing to see.  The food itself here is to die for.  Whether its just a steak, crab cakes, or something else; I have yet to have a bad meal here.  In a time where mediocre customer service is the norm in this world, these people shine.  5 stars!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dSpzTX8hYRKGyVWPucB5Pw"
  },
  "JW_ULoQj29Unys_cuoCDLQ": {
    "date": "7/21/2019",
    "text": "Atria's PH is a great hometown bar and restaurant with great food and exceptional service. Last night I hosted my husband's 59th birthday party in their party room. We had such a great time. We chose appetizers and drinks and the food was perfect. Thank you Sydney and Gary for making us feel so comfortable and supplying us with the most delicious food and service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Me9-urvg71TSQOIsHdPYA"
  },
  "lLi6iBGwhF7u9119jS2d-A": {
    "date": "7/8/2019",
    "text": "Never disappointed by this place. If you have a chance to do one of their specialty dinner events it's a must to try something new! We went for the jazz wine dinner. The wine pairings with the food were amazing. My husband and I live close so we come here pretty regularly. The service is always good and the food is consistent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NWGfpIj3E4CZL3H0pjXwrw"
  },
  "mh4TTgE1u51rmUcvcIRzcQ": {
    "date": "7/18/2018",
    "text": "The food was good, but their menu is extremely limited.   Can't a girl get some chicken tenders and fries?",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TeCu4zf1aPEPk96oReqpkQ"
  },
  "_w6GToS7_8btEE6P26yzww": {
    "date": "5/14/2018",
    "text": "I had a delicious southwestern chicken salad at atrias tonight. The chicken was perfect and the salad had a nice blend of lettuce, corn, black beans peppers and dressing. I like the ambiance of the restaurant. At first when I walked in I thought it was loud but after a minute it was ok. Our waiter was awesome. Attentive without being annoying. Definitely want to come back and try out something else on their menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ekHcAAh6MxlzgS7ndpXyXQ",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ekHcAAh6MxlzgS7ndpXyXQ/o.jpg"
      },
      {
        "img_id": "bAlB1CvR8HTEotrDdTfi5Q",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bAlB1CvR8HTEotrDdTfi5Q/o.jpg"
      }
    ],
    "user_id": "W8EAuJDTuy9foHWGvoyGxg"
  },
  "Y2w5wUdad4HVbKvu43-c_Q": {
    "date": "10/22/2017",
    "text": "We had a wonderful late lunch here and everything was perfect.  The service was extremely attentive - server checked back several times to make sure the food and we were OK.    The food was just terrific.  All I had was a turkey bacon club sandwich but gosh, it was delicious.  And it was served with a basket of homemade potato chips that were like crack - couldn't stop eating them.  So tasty.    I visited the bathroom and it was clean, which is appreciated.    I would go back here in a heartbeat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EovbW0SoMdyb7FPSe0Z2yQ",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Turkey bacon club sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EovbW0SoMdyb7FPSe0Z2yQ/o.jpg"
      },
      {
        "img_id": "u7QylnZSb5jQs1n8oQOESw",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Homemade potato chips - so delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u7QylnZSb5jQs1n8oQOESw/o.jpg"
      },
      {
        "img_id": "XMjtrRtFueOGhWVt2GtoHw",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Special German menu for October.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XMjtrRtFueOGhWVt2GtoHw/o.jpg"
      }
    ],
    "user_id": "Su2kadHdmAVhM-_1TIlhSQ"
  },
  "9YTKSvMFuYdwdbkO4sVTNg": {
    "date": "2/26/2017",
    "text": "I don't often get to Pleasant Hills but was in the area so decided have lunch here. This is one of at least 8 restaurants in the Pittsburgh and tristate area. When I arrived the place was practically empty but filled up quickly while there.  Upon entry the hostess offered to hang my coat up for me which I thought was a plus. I sat at a booth and was warmly greeted by my waiter. The menu I saw is very similar to the one I ate at a little over a week ago in Fox Chapel. Still on the back edge of my cold I ordered a cup of the beef and barley soup and a salmon salad which came with blue cheese and strawberries.  The waiter told me how the salmon was prepared and I was pleased with the fact that it is served medium. I got my soup and it was very good. Later I got my salad and loved the way it was arranged. The salmon was a nice sized filet and tasty. The staff was very attentive to my needs and was quite pleased with my service.  This Atria's is located in Bil Greene's shopping center in the area once operated by the former Brass Rail restaurant.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 8,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "OuYk9zVrYO3CETFB4-892g",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Salmon salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OuYk9zVrYO3CETFB4-892g/o.jpg"
      },
      {
        "img_id": "Dtaut3SqXiYwxUGZMt2Z2w",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Beef and barley soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Dtaut3SqXiYwxUGZMt2Z2w/o.jpg"
      },
      {
        "img_id": "BYhQNyleXbigMSFEkOuKOA",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Nice interior",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BYhQNyleXbigMSFEkOuKOA/o.jpg"
      }
    ],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "GlHLkpjE7-B1tpTP7c2odg": {
    "date": "2/4/2019",
    "text": "I Love atrias! I think it's a great addition in our town, considering we don't have a great option of semi fancy places to eat. I feel like we are plagued with mainly worldwide chains and fast food, so having somewhere like atrias that's nice and has good food and some more delicacy items without being super fancy or overly expensive is nice. I like that their menu is always changing with the season, they have a great oktoberfest menu for the fall and are coming out with lots of fresh light new options for the spring time. Their menu has a lot of different options to try - from Italian (come hungry, their chicken Park is huge and delicious) to steak, seafood, and their award winning burger (it really is easy to see why it's award winning.) they have a bit of something for everyone. The service is always very kind and you can be in and out very quickly despite there usually being a bit of a crowd.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EOxmDIA_t5lcBWeYyOv9vw"
  },
  "TnVMwaeIsSFMFOyJzaYlBA": {
    "date": "3/27/2019",
    "text": "Just great food and eating experience all around. Very attentive wait staff and clean atmosphere. I had the bbq pork medallions with potato pancakes and everything was cooked right. Appetizers were also on point and food was presented well. One of the better eating establishments in Pitt. Great selection of wine and drinks too. Highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0wJ0NUV9fZvLYmjf22eW0w"
  },
  "eB119JwmAc3N6ITZSsMGqg": {
    "date": "2/22/2019",
    "text": "Decent food and a great Arnold Palmer. They can't cook a steak to save their life so be careful especially if you like medium rare. Order medium. When it's on a steak salad and just pure blood running everywhere it's not what I ordered. Order the pasta fra diavlo it's great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "daVGGqJb8oJC_azW5Cx4XQ"
  },
  "zEEeHlXjK3LhsXsH0dPIEQ": {
    "date": "9/28/2017",
    "text": "While I generally hate a chain, Atria's is still small enough that they don't feel like a chain.     Service - always good and friendly service.   They are helpful with suggestions and always smiling and pleasant.    Food - yum!   My current favorite is the miso glazed salmon, since I have been trying to eat healthier.  The rice, of course, isn't exactly the most nutritional choice; but it is a good sized serving of fresh veggies that aren't laden in butter or oil and a satisfying piece of salmon that is always cooked just right.   The bacon wrapped pork medallions were delicious and even the salads are a winner.     Happy hour - they have decent happy hour specials and a full bar.   $4 house wines?   I'm in.     Atmosphere - this is where the place looks a little chain-y.   It's got a nice ambience, but there is something about it that seems cookie cutter to me.   It's comfortable though, so I'll take it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "h9LPugJk2cpIh0gmQb5LnQ"
  },
  "NL2XzlutqYSiNRts3SV-2g": {
    "date": "4/20/2018",
    "text": "Great place to go.  Food is great.  Happy hour apps and drink are fantastic.  Bartender Jon is the best, very friendly and always remembers my favorite drinks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PTDejAL0PPuczs2bjZ6NKA",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PTDejAL0PPuczs2bjZ6NKA/o.jpg"
      }
    ],
    "user_id": "zzGUiwY-emOE0dkTRV0ztw"
  },
  "7PVQYGZOhjhM0fnDQTClIg": {
    "date": "4/7/2018",
    "text": "This is the closest restaurant to my house, so I eat here often, I get take out mainly.  I love the crab cake sandwich.  The wedding soup is really good too if you get a bowl it's only a dollar more than a cup and you get like double the amount.Always check the flat bread bc sometimes it's good, and it's good reheated.  Always check your take out order they mess something up like 75% of the time Or maybe it's just me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vFhj9ns-RduUnUOMKqimVA"
  },
  "RT7P18n675wZd7AXvPBo6A": {
    "date": "10/26/2017",
    "text": "Make a reservation if you plan on coming for dinner, just to play it safe. We visited last Friday night and I was able to make the reservation easily online with Open Tables. It's a rather small restaurant, and I do wish that they had some type of divider from the entrance to the tables, because we were pretty chilled with the draft, as we were seated by the entrance. The service was phenomenal- our server and the hostess were incredibly nice and attentive. I also saw many managers walking around, checking on tables, opening the doors for patrons, etc. Really impressive. The prices here are a bit overpriced in my opinion, but we had a gift card which made it less painful. Brendan went with the cheddar burger and fries as well as a side salad and I had the southwest chicken salad. He really liked his burger- it was quite big and the portion of fries was really large. The fries were super tasty. His salad was also really good, he described it as \"the perfect side salad\" (he gets side salads at a lot of restaurants). I really liked my salad. It was huge and really delicious. Overall, we had a really great experience and I wouldn't mind returning.  **Be mindful of parking, we got lucky and found a spot right away but there weren't many spots left on the Friday night we visited around 6:00 pm.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "X1AcLDqy6xl0zw0DJiai5A": {
    "date": "8/2/2018",
    "text": "We couldn't recommend this place enough. Their Sherry Crab Bisque is the best we've ever had. It was our first time there and their service was phenomenal. We can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZogjYDwv5Cso7QGcjAbZNQ"
  },
  "QAtujMpBbtk3SflM4UmjJg": {
    "date": "1/27/2017",
    "text": "Atria's has this funny reputation in Pittsburgh. Some people think it's just the best thing since sliced bread, and others, like myself never really understood.   I finally was afforded the opportunity to go and found it to be passable. Mind you, this review obviously pertains only to the South Hills location. Maybe the other(s?) are very different.   We had lunch and I was able to photograph 4 entrees and personally try the soup (beef and barley) and a salad (seafood Cobb).   The soup was good but unimaginative. But then again, it's beef and barley. I think it's kind of the point. Actually the beef itself was quite good but there were only a couple pieces in the cup. It reminded me that the one consistent thing I've heard about Atria's is the pot roast nachos. So maybe next time. The beef certainly gave me hope.   The seafood Cobb salad decent but not great. The dressing I chose (light balsamic) was weird and gloopy although it tasted ok. The seafood was ok, and relatively fairly apportioned. The salad itself was basically an American mix primarily consisting of iceberg.   Neither of the two dishes were anything to write home about. However, one of my lunch-mates had the meat loaf and he stated unequivocally that it was a 4 out of 5 stars. And I have to admit the plate did look delicious.   The other two had fish tacos and chicken piccata respectively. The fish tacos were well received although not memorable, while the chicken piccata was decidedly unappealing.   Conclusion: Meh, I guess there's a reason why I haven't ever gone. Pretty much exactly what I expected.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rmPRDJiu1F7AeXrwxrKEyQ",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Chicken Piccata",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rmPRDJiu1F7AeXrwxrKEyQ/o.jpg"
      },
      {
        "img_id": "E9u45H6WrXYFDZGOo7dyjQ",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Fish Tacos - Good.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E9u45H6WrXYFDZGOo7dyjQ/o.jpg"
      },
      {
        "img_id": "uzHBVbB4oA5cKWoHyjfurA",
        "caption": "Photo of Atria's - Pittsburgh, PA, United States. Meatloaf - Excellent!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uzHBVbB4oA5cKWoHyjfurA/o.jpg"
      }
    ],
    "user_id": "CIKD9oMj-qTZ3zDdgFW5_Q"
  },
  "0DZi-gQ8-r6dhUjtRhyu1w": {
    "date": "8/12/2013",
    "text": "I thought this was my new place to hang out, but not so. It's a pretty good place with a lot of potential, but they just seem to miss the mark.   The male bartender, I believe his name is Jonas or something, actually threw a tantrum and a glass into the sink and then pouted the rest of the time we were there.   I gave the place a second chance and the kid was up to the same antics. I've noticed a few bad attitudes from him and a couple of the waiters that really kill the mood. Its a shame because the place has decent food and the other staff seems pretty good.  The manager just needs to start paying attention to detail and the place will be really good.  The bugs/flys were really bad too. Again, just an attention to detail issue.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "472l9ayR-nwtixnE1p79oA"
  },
  "CIjpGzji5jDKo0j2-LscwQ": {
    "date": "8/7/2015",
    "text": "The restaurant itself is extremely clean. The staff seems to pay attention to detail. Each food item that was ordered had supreme presentation. It was also tasty. This included the salad, zucchini appetizer,and pasta dish.Compared to similar dishes in the area, the prices were a few dollars more here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zz0dv3MgXz93gDOooW9JcQ"
  },
  "pCBxK5jynrrUmzXEjUCWzw": {
    "date": "7/7/2014",
    "text": "Tonight my aunt treated my sister Vi and I for our birthdays. The ambiance was nice, very friendly and attentive waitress. The bread serving they provided was one very small piece, definitely not enough for 3 people. The whipped butter was good though and the Italian bread was chewy and very good, but not amazing. I had the beef medallions with shrimp and fries. The quality of the food was excellent, the beef was perfectly cooked medium well as I had requested and the shrimp was moist and flavorful. However there was one big problem with my food, the portion size! I got 2 beef medallions the size of a silver half dollar and 3 medium sized shrimp. For $21 I should have gotten significantly more. I know they have to make a profit, but the portion size really left me disappointed. My aunt and sister also complained about their portion sizes. If it weren't for the portion size I would have rated Atria's 4 stars, but now I must rate it 3 stars. At this point I do not plan on returning to Atria's, there are far too many restaurants which provide high quality food at a better value.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3_oOvKDxkASn51PBn2ZI_g"
  },
  "OsXX6UpRXA4dmFuFBeYimA": {
    "date": "1/9/2013",
    "text": "What can I say...the service was AMAZING the food was wonderful and the atmosphere was perfect. Good service is hard to find nowadays but not one time during our meal did we need to ask for anything! Our drinks were filled and we were not asked 10 times what we were drinking. Our server was very knowledgable of the menu and helpful in making suggestions. We ended up getting an appetizer and dessert in addition to our meals (which we didn't plan on doing) but the food was so good and the atmosphere was comfortable. We can't wait to go back again!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tpmTbOXSFs_RYVxLnW--Sw"
  },
  "VfjsdqJEuOAoXkjgrXRfEA": {
    "date": "10/10/2013",
    "text": "Wow!  Can't believe there is a stylish restaurant like this in Bill Green's.  This is more pierogi and shot and beer territory. Nice wine list, intelligent wait staff and decent food. Try the chicken piccata.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_4b6aTR2K4d4sncV3xF3ZA"
  }
}