{
  "P-Cm_BrnWsHK632IXTCqwg": {
    "date": "8/16/2015",
    "text": "Yummy. Had the carne asada tacos with a nice warm (spicy but not overwhelming) tomatillo sauce.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WnGG1oyfizG7EZMDkwoHvw"
  },
  "ATXvuYyBmxeBEg5v3QXlEQ": {
    "date": "6/7/2015",
    "text": "Have never had a bad experience in the 2 plus years I've been going here. Great food at low prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B7obVDrRUaWW59Z7aQGUvA"
  },
  "6MoTByRTy1vY5XaxY_LcWA": {
    "date": "4/11/2015",
    "text": "I have never been disappointed at this location. The food is amazing and they get your order correct if you are doing take out. A+",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lBDcvE_Kk1ZE0YBLx7QNjA"
  },
  "a-6fkjxNLsr4Qe4z-GlKcw": {
    "date": "10/28/2014",
    "text": "First time here and it's pretty good. I had the enchiladas poblanas and the mole sauce was pretty spot on. They even have Negra Modelo on tap. I'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vSuME2bsJvYkJ2kyznGuWw"
  },
  "75ZOmr7JXFhX1ra16SGjdw": {
    "date": "7/24/2012",
    "text": "I can spare two stars because my 5-year-old liked his food, the salsa was good, and service was fast... but other than that... awful.  We went on a Friday at dinner time and there was no wait at all.  My husband & I each ordered a different vegetarian selection and found both to be a notch below mediocre. The potatoes tasted like they came from a box, (though I didn't ask) the sauce on my enchiladas was overcooked, sticky, and a little burnt-tasting, and the beans reminded me of the ones they have at Taco Bell. The margarita was overly sweet and sort of tasted like Kool-Aid. Our server was rude (she tossed our guacamole onto the table as she walked past from enough distance that it actually slid to the other side of the table) and unpleasant.   Judging from many positive reviews and friend's recommendations, we must have gotten them on a bad day, and will likely give this place another shot and will update the review at that time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1iRt8WdffrzQ44zCZt9alQ"
  },
  "FoYgHgGh2uaTLjDStEXWeA": {
    "date": "6/14/2014",
    "text": "This has become our go-to place for a quick bite.  Food is consistently good, drinks are extremely reasonably priced, but best of all--waitstaff is super friendly, knows the menu and very attentive!  Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "70sSlkooEgL_TEjWDQbr3A"
  },
  "4yL9Esxa-HJu6ywUWiR1fw": {
    "date": "3/9/2012",
    "text": "My husband and I first went to Rey Azteca because it was right around the corner from us in Penn Hills.  I am so glad we tried it that first time because in my opinion it's one of the best authentic Mexican restaurants in the area.  I had been to the Frankstown Rd location numerous times and most recently I dined at the new restaurant.  I was thoroughly pleased with the new restaurant - same menu, same prices & fresh decor.  They have a huge selection of dishes and the portions are great.  I also love the original margarita on the rocks (large size - of course).  The service is attentive, efficient and friendly.  The food is top-notch.  I have never had a bad experience here.  It was sad to see Rey Azteca leave Penn Hills.  However, they definitely made a good decision in relocating to Penn Center East.  All in all, Rey Azteca has a lot going for it, and I'll be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bSl2qmOI75CSqBYXiZRuqQ"
  },
  "NZpArtJibXXqRtJafZXYkw": {
    "date": "1/7/2015",
    "text": "A perfect lunch spot during the work day.  The service is quick and the food is good. Plus, who doesn't love free chips and salsa before their meal?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BqfnJAhT1yUWbErLvQ7TXg"
  },
  "gEYO6L1tSxNqPnWEz4cDLw": {
    "date": "9/1/2014",
    "text": "Extremely clean with an attentive and personable waiter, large menu, generous portions and low prices make this a great stop.  My chicken mole enchiladas were excellent and,  at $10, a great value. Not an upscale place but definitely a place to go!  Recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fEo1C7GJlK8HlfRfNouLbw"
  },
  "ZkAiDFkqZdc5ByTodpDuBg": {
    "date": "2/26/2015",
    "text": "The best Mexican food in Pittsburgh for the price! It reminds me of being back in Texas :-) fantastic food and service. Pleasant people. Great prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EGpj_iip2ECbQn2mTwK_5A"
  },
  "d-QCAcSB7DPd38HULM6h_w": {
    "date": "1/31/2012",
    "text": "This is a wonderful place for good, fast and authentic Mexican food. I've eaten here many times and haven't been disappointed. Very large portion sizes for the price. I think I've had a bit of everything from here.  My favorite is the Pork Rancheros. Very tasty mole sauce. Also has a selection of bottled Mexican pops to try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfiujQu8HUd7aHP4Aie_RA"
  },
  "BOoe3oDIGLniJLhbaLDfkA": {
    "date": "7/24/2014",
    "text": "My husband and I eat here almost every Thursday night.  We love the food and the people that work here are so friendly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "owv4dQlehVtBLpqFv9Cv3A"
  },
  "hlk7paOdQYDLEx-eqI_96g": {
    "date": "5/22/2015",
    "text": "Been here over 10 times in the past year. My go-to for quality Mexican food at a great price with very friendly staff. Favorite dishes: Enchilada supreme and Vegetarian mushroom enchilada. Food comes out quickly and they serve the best rice I've had! Guacamole is also very fresh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y53NwX6rT8VCqpKLSy-Srg"
  },
  "e75KZ-B-ZduobyMhPAErnQ": {
    "date": "1/5/2014",
    "text": "Awesome Mexican and great service! The guacamole is creamy and delicious, and their salsa and chips (free - dropped off at our table within seconds of us being seated ) are spot on. The mole ranchero sauce has a great spice to it, and the pork dishes are great (Slow cooked, fall apart awesome pork). We want to try the desserts next time but we are always full after the big-portioned entrees!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BiscGdcHdqveU7sJgZzf5w"
  },
  "fvvMDCdn6vPJe495XfIReg": {
    "date": "9/14/2012",
    "text": "Of the Mexican restaurants in the area, this ones prob my favorite. Being a vegetarian, this place has the best variety of veg foods on its menu. The foods also great. The sauce on the enchiladas has a unique smoky BBQesque flavor. Their spinach quesadilla is also bomb.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EOCo7T5cNcNK9jgBKkegzw"
  },
  "GTRom_fpYQrLxO0oFQWi2w": {
    "date": "3/3/2012",
    "text": "Okay, had to try this place. Heard it was good from some friends who had dined there when it was in Penn Hills. They are now in the Penn Center East Complex. I think they have four other locations widely dispersed outside of the Pittsburgh City Limits. Three of us went on a Friday and all were pleased with our meal. I would say the atmosphere is a little plain, nothing fancy, but not bad, pleasant enough. We were seated at a booth for four, but there are smaller booths, larger for 6 booths and some tables. We were greeted at the door immediately and swiftly taken to a booth in the center of the restaurant. A server brought us salsa and chips immediately. The chips were warm and crispy and the salsa was a good medium spicy style with good body.  We had a little bit of a hard time explaining we wanted a pitcher of Margaritas so he got the 'manager' I guess and we discussed the margarita situation. The had plenty of various flavors but only sold the 'lime' flavor by the pitcher, so that was or order on the rocks. I would say certainly not near the best but the mix was okay with a very lime taste and not much complexity. Food-wise they have a pretty good size menu with Chicken, Pork, Shrimp and Beef sections. Also Burritos, Fajitas, House Specials, Vegetarian specials, Combination Platters, Al La Cart, a Children's menu, Salads and some deserts; plus a good sized Lunch Menu. Very complete with so many choices for your tastes. For the unfamiliar they have a section with descriptions of about 20 Mexican dishes.  For example Taquito - Fried Corn tortilla rolled Chicken or Beef.  We ordered 3 dinners: Shrimp, Pork and Chicken dinners. For Shrimp we ordered the Camarones Al Mojo de Ajo, which is grilled shrimp with Mexican Garlic Sauce and lettuce, guacamole cheese, Rice and Flour Tortillas on the side. The shrimp in this dish were plentiful and cooked to perfection they were good size not tiny and very delicious. Would certainly order again. Almost every place of this nature overcooks shrimp so this was so nice to see the proper cooking attention.  For our Pork meal we ordered the Pork Carnitas. This was a very ample portion of fried pork with Tomatillo Sauce, Rice, Beans and flour tortillas. The pork was very tender, juicy and well seasoned. A real hit. Order again.... heck yes.   On the Chicken side we ordered from the Especialidades (specialty) menu and got the Enchiladas Verdes which is three shredded chicken enchiladas with Green Tomatillo Sauce, lettuce, sour cream tomato and a piece of steak on the side. Steak on the side was a pretty unusual accompaniment for me. The chicken was highly flavored inside tender wrappers topped with the aforementioned adornments. Now the green sauce is not my favorite, but the flavor and tenderness of the chicken made it a real winner.  I can't attest for authentic, but my one of our companions who has been to Mexico several times says this food matches up pretty well. So on his word and my taste buds I would recommend a trip here. We will certainly be back to try more of their very good food.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "AyYKTOCL5qM8589oBsqbfA"
  },
  "ezIDQvPL25bQul7Zk5oAHQ": {
    "date": "5/11/2015",
    "text": "The staff is wonderful, quick service, delicious affordable food, and most importantly it's so clean!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V4qJySBOQGB3VffDDQEIqw"
  },
  "TfQxFoxe7uSYjC4NuWlvzw": {
    "date": "3/31/2012",
    "text": "Great food great price. Not as flashy as madmex but very nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-BaKOgO1cAWXELj2qYX2Tw"
  },
  "uEnAQJX6lmMgVjH5tNlmNw": {
    "date": "3/3/2012",
    "text": "They give you allot of good and the price is right. Very good menu items that had me come back twice in one week. This location use to be in penn hills. I'm so glad they are now in monroeville.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5YZVYIoW6QI-h6mQKU6hEg",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5YZVYIoW6QI-h6mQKU6hEg/o.jpg"
      },
      {
        "img_id": "mFVz0FbK3B1ccS_-wVcKCw",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mFVz0FbK3B1ccS_-wVcKCw/o.jpg"
      }
    ],
    "user_id": "Q_Jb1GP_KoIdiR8-lfNwag"
  },
  "HpTf5-Xt3gb6TBG_mKmvVg": {
    "date": "3/31/2012",
    "text": "Chips were not very fresh and Agave has better salsa.  Entrees were very good. Service was good. Definitely worth a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2cYTy7YlmlS9uuuQI1Trzg"
  },
  "u5WSt5ujk8XzPwvC8LzlfA": {
    "date": "10/21/2017",
    "text": "Great food and attentive service.  The Green Chicken Salad is my favorite.  We have eaten here 5-6 times and it has always been a great experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iTUed73BTX1XhDXrLzZz3Q"
  },
  "E7Dc5A_oJxiW3zA21IvL-g": {
    "date": "3/6/2016",
    "text": "I have been here a few times. Out of all the Mexican restaurants in Monroeville, Rey Azteca is the best. They have real homemade refried beans and good salsa. The staff is friendly as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6gaxwVD2d1C0_qIBOkDkJg"
  },
  "dSM8TCii8H_ZblJh7kX6yQ": {
    "date": "4/18/2012",
    "text": "When Rey Azteca first opened in Johnstown during my 3-year stint there 8 or so years ago, the restaurant introduced me to some of the best Mexican food I had ever eaten, so my excitement when they opened a location closer to Pittsburgh was through the roof! I had made the sometimes-annoying drive out of the city to their old location in Penn Hills quite a few times, but recently stopped in to their latest location while in Monroeville. What an improvement!  That's not a comment on the food, though. The food was excellent, as usual, but the new restaurant is much larger and cleaner than the old fast food joint they were in before.  My favorite dish is the enchiladas rancheras. It's the one dish that no other Mexican restaurant in the city can come close to matching. Their ranchero sauce is awesome! Other than the enchiladas, Rey Azteca gives you a ton of delicious food for a reasonable price, and the service is fast and pleasant.  It's nice to see that Rey Azteca hasn't lost its touch with the additional locations that they've added over the years, and I can't emphasize enough how happy I am that they have a location closer to Pittsburgh. It's worth the drive!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "JiPMk9WmbJu-VfTRAKpZpw"
  },
  "hlQBNN6TeMA7_3K6fjyRgQ": {
    "date": "4/25/2012",
    "text": "My husband had been raving about this place, so awhile back he finally took me to the old location in Penn Hills off Rodi Rd and Frankstown.  I think I was less than impressed as the location looked like an old Denny's, Rax or something.  The food was good, however so when they moved to the Shopped at Penn Center, we decided to make a trip from the Southside over east a bit.   The new space is great, much cleaner and nicer.  Speedy service, cheap prices and yummy food makes it all even better,  We live near Emiliano's in the Southside so we have a lot of Mexican options near us, however, in Pittsburgh, if I want Mexican, at this point, Rey Azteca is my favorite place to go.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hLVq7VSJBHZwqurwWoCmpg"
  },
  "Jc3gn2UPIXRCSUiWlLopDw": {
    "date": "10/26/2014",
    "text": "This Rey Azteca is as good as most in the West Central Pa area. Quality Mexican food at a decent price. Everything we had was fresh, and delicious. One star loss due to lack of service. Primarily empty restaurant but left siting for about 10 minutes before our order was taken, and just an overall lack of service. Decent food though as normally found at Rey Azteca.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vho30rrzLIVLza4qWy2Z1w"
  },
  "3Y4b68aA9heY_qtl5aevSQ": {
    "date": "5/27/2017",
    "text": "I was served the worst margarita of my entire life here. It was a huge goblet of red sugar water. No lime flavor, no tequila flavor, nothing. It was basically koolaid. I took one sip and couldn't drink any more. I planned to ask for another drink (I wasn't going to send it back or ask for it to be taken off my bill; it was my mistake for ordering it) but the waitress never came back to check on us. She actually avoided eye contact for the rest of our meal. When I finally flagged her down after we ate (food was decent but nothing special) she never even acknowledged my untouched drink. We won't ever be back, not with so many other Mexican options not far away. It gets two stars only because the food wasn't bad.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NALCVcvMB3l-VCz5gnaw4w"
  },
  "bJlYXvwVUKioIQxN1vcKQQ": {
    "date": "3/12/2012",
    "text": "Me & my wife love mexican food, so we figured we would try Monroeville's newest Mexican delight. Though I am a strict El Campesena guy when it comes to Mexican in the area, I am starting to veer towards Rey's. I mean this is crazy for a kid that LOVES El Camp, especially after only ONE visit to Rey's.   I don't if it's my selfishness, that I don't like new places or environments, but the new El Camp is missing something that it had at the old Pappin's. So after only one visit I am willing to brake my loyalty to El Camp and give Rey's a run.  My recommendations at this joint are very rough & limited. But the sauce on there Enchiladas is fantastic. Don't know if that's what there calling there mole, but it's rich in smokeyness. This must mean there is Adobo sauce involved which is NEVER a bad thing. The right amount of heat so no hot sauce is needed (well, for me).  The chips and salsa aren't even close to the quality of El Camp. Though I do like a thicker chip, these were just bland. The salsa is very jar tasting to this jedi.  My meal made up for more than what they offered in chip & salsa department. So I have to give it Rey's for stepping into the ring with other Mexican restaurants in the area.  Jedi Recommendations;  * Enchilada * Burrito  * Taco (WAY better than El Camp)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zBx4l0yCZY4TgPvHL0oVfQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. 28 - Beef Enchilada, Cheese Quesadilla, Beef Taco, Mexican Rice.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zBx4l0yCZY4TgPvHL0oVfQ/o.jpg"
      }
    ],
    "user_id": "hMry-aR2iJMC6OdLosr31w"
  },
  "IzOjSeumesK7yt4EiIE0tw": {
    "date": "12/9/2013",
    "text": "I agree that this is the best straight up Mexican / tex-mex place on the east end.   The staff are always friendly, and the service is so fast, it's actually funny.  Seriously, go order, and start a stopwatch.  Your food will be there so fast.  You'll giggle.  Anyway, the guacamole is always fresh, the tortillas are hand-made on site, and the beef and chicken dishes are great.  They have several vegetarian options.  I've never tried any of the fish items, because the chicken flautas are deep fried ecstasy.  In retrospect, I never want to see calorie counts for this place.  They are good with kids, and will usually give little ones a sealed container for water (smart people).  While they don't seem to have the high lard content one will find in South Texas, I'm not sure that's a bad thing for those of us over 18 years of age.  (Oh, I miss you metabolism).  The only caution I would extend is they seem to add jalapanos to their refried beans, which can be an issue for the northern palate.  Those of you who love hot food will find this note amusing, but those of us who are total heat-wimps should be warned.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "foaOkIfdxsYBY0Ukrw4E4Q"
  },
  "wYuykhmNY6xKhhaaItE8qw": {
    "date": "5/17/2017",
    "text": "The food is always good. I usually get the chicken flautas and those portions are nice. The wait staff could be more attentive, we had to go find a waiter multiple times just to refill our drinks. Also, the first chips and salsa are on the house...after that you pay for more. And, they don't bring you a small bottle of salsa like most places, they give you a dipping cup...for $1.00 extra per cup. Also, the cheese dip is $5.00! So not only do they give you small portions of salsa, but they charge you $1.00 each for extra salsa and $1.00 each for extra chips.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ce-3MPZ78Sh_zFwC2lHRhA"
  },
  "zwOlW9zUSeFUItj0zmEO5w": {
    "date": "7/16/2017",
    "text": "Have been going here regularly since it was originally in a location in Penn Hills years ago. It has consistently been excellent, both in food and service. Love the carne asada tacos in particular.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VpaqY0ZF3Jp8OAyt7oKKXA"
  },
  "VgROINzSQEAKMIARIKIlfg": {
    "date": "11/20/2013",
    "text": "Nothing special, but green verde salsa is wonderful. Food is presented well.   Red salsa tastes like canned tomatosno flavor or heat.  The bright lights above our table were annoying.  They use artificial sweet sour syrup in margaritas and no fresh lime juice so we didn't order one.  Pittsburgh makes awful margaritas, bastardized  Rice isn't worth eating, beans needed salt.  We won't return  Emiliano's is much much better",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iH_fFp5HO4DI1DmZM4vQcA"
  },
  "h8VYV7qQMchkdCOrrcJOwQ": {
    "date": "3/15/2014",
    "text": "Best Mexican we have had in Monroeville hands down! Came from an area that had lots of little place, so we know good Mexican and this is it.  Only negative is salsa was for wusses!   Service was fast and attentive.  Very clean inside also.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "slnfCY4YdUt3Go_Ywl1xzw"
  },
  "B5uq4HMjmcAcqNTBjg7y6w": {
    "date": "6/21/2017",
    "text": "Walked into the restaurant. My fiancee and I both had long days. We have eaten here previously and it was decent. We were excited to sit at the new bar that they recently built.  As we walk in the door, ALL of the chairs are turned upside down and sitting on the tables, except for the ones that were occupied by a few patrons. It was 8:30pm. The posted restaurant hours, which I didn't realize, say that it closes at 9pm. So a full 30 minutes before closing time. I don't know what kind of place that spends money to put in a FULL BAR closes at 9pm on a Wednesday. I am sure they do a killer lunch game given the proximity to Penn Center. But seriously, having the chairs up on tables 30 minutes before close is a bit much. We couldn't even go to the bar to sit to have one beer, while we decided where the heck else we had to go because this place closes at 9.  I admit I am writing this review in a state of hanger. All I wanted was a cold beer and Mexican food. Probably a burrito.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MYXsoOaA4kSMYeS5d5waVA"
  },
  "HZmv4UQHBWjn_fIadHY_SQ": {
    "date": "7/11/2013",
    "text": "Great reasonably priced Mexican food.  Definitely try the Enchiladas Verdes if you're into spicy.  You won't be disappointed!!!    Service here is great as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "tOMztypmq06beq-zncxjiw"
  },
  "lZncznCf2CWXlPQlXx-VFg": {
    "date": "8/23/2014",
    "text": "Very good! My husband and I were looking for something more substantial than fast food while staying in Pittsburgh, PA. And boy did we find it! Both of our meals were delicious. I had the combination dinner with beef taco and beef enchiladas, he had a vegetarian combo with cheese quesadilla and bean burrito. We shared a lime margarita on the rocks that was good, but a bit too sweet for me. He ended up finishing it. The chips and salsa was very good. We got a cheese cake chimichanga for dessert and it was the perfect ending to our meal. Our waitress was very nice and courteous. We will be back if we ever get back to Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6ldoSBsVQLesRAMaXRmCTA",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6ldoSBsVQLesRAMaXRmCTA/o.jpg"
      },
      {
        "img_id": "Xe-ZEO95UitPk_GhKiyEaQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Xe-ZEO95UitPk_GhKiyEaQ/o.jpg"
      },
      {
        "img_id": "487jC0uB7imso1rXii-DDQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/487jC0uB7imso1rXii-DDQ/o.jpg"
      }
    ],
    "user_id": "yT2qnPwDgZQGBqWaA7ix0g"
  },
  "xb3YYiO4AfpX5MajZHZHwg": {
    "date": "11/16/2014",
    "text": "This restaurant is great! They serve fresh warm (and free!) chips and salsa once you sit down. Service is prompt! There were other staff members bringing us our drinks, food, and chip refills like thirty seconds after we asked for more. The menu has pretty much everything you need from a mexican restaurant. I give this place 4 stars because I don't think the quality of the restaurant is stellar. But it's great if you want to get away from the Americanized Mad-Mex-esque places. Last night we had a chicken burrito, chicken fajita, and a beef soft taco. There was some confusion on the single beef taco and they had to fix it twice, but were super kind and patient for my picky cousin! I tipped a little extra for their effort, it was greatly appreciated. The fajitas were straight forward, the chicken pieces were smaller, but overall they were good. The refried beans and rice were actually really delicious as well! The staff graciously brought us extra sour cream and cheese when we asked and didn't charge us extra. Don't miss out on the margaritas!!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "YLoziFQmYS4Bwwb2E70SGQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Chicken burrito",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YLoziFQmYS4Bwwb2E70SGQ/o.jpg"
      },
      {
        "img_id": "r1aXhlt_H1cZbDuAtbIyqQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Chicken fajita, corn tortillas, refried beans and rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/r1aXhlt_H1cZbDuAtbIyqQ/o.jpg"
      }
    ],
    "user_id": "cKeMks0yFeItSlkUKnZW0w"
  },
  "wAQXpboQHsZk6rkGC6gNnQ": {
    "date": "8/3/2015",
    "text": "Since when did Mexican food get so expensive ? We arrived at 2pm and the place was completely empty. Mediocre food and lack luster service. I had been going to this place when they were up at the top of Rodi Road in Penn Hills about 3 years ago and their lunches were delicious and only $4.50  Since the move the menu has changed twice and gone up to $7 and $8 for the same amount of food which is almost double. I bit down on my taco and got a big sharp chicken bone that almost punctured my mouth. After that the whole experience was a turn off. All 3 of us in our party said we will not go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YmZb7nsmeufYcsjhg84zcw"
  },
  "A62z1Tm0ls4ztNpcotOiwg": {
    "date": "8/16/2013",
    "text": "Easily the best Mexican in the eastern suburbs of Pittsburgh.  The service is fast, attentive, and efficient. The portions and prices match up perfectly, especially for lunch time.   My favorite dish here has consistently been the camarones mexicanos. It's a huge plate of no less than 10 plump grilled shrimp with their delicious cheese sauce over it, beans, and guac salad for between $6-$7 during lunch time.   I've also haid their tacos, fajitas, carnitas, and salads and every time I have been. This place has so much actual flavor in their food and nothing tastes like it was from a can and reheated.   Can't wait to get back here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mLDC0DjkT2IJkoppBze4eA"
  },
  "uLl3_G6HRfrlchAfbLzigA": {
    "date": "10/1/2012",
    "text": "After a meeting with a client, we were looking to grab something quick and cheap, and Rey Azteca totally did it. Actually, it exceeded what we thought we were going to get.  First thing I notice when we're seated: their beer is crazy cheap (finally Pittsburgh! ;)! Under $3 for domestic and Mexican imports. Kudos to you, Rey Azteca.   We split a fajita for two, which came with the usual toppings and sides. I was a little bit disappointed to see that the food wasn't really authentic (cheddar cheese and lettuce? Boo.), but the fajitas were delicious as was the chips and salsa.   Service was really good, though we were one of two parties in the restaurant at the time lol. My only complaint was that for majority of our meal the music was way too loud! Someone eventually turned it down, but it cracked us up, honestly.   Only thing they're missing, imo, is a bar. I think that place would do great with a small bar in it, but what do I know? :)",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "ahBUJmFUedHoFfgtcfzqSA"
  },
  "QV62P4CRexcCiHQzwnfmmg": {
    "date": "9/21/2015",
    "text": "Best Mexican food in Pittsburgh! Service is amazing. The food is SO good! All the stars. It's lucky too!! I went on my first date with my husband there :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "spDOBFkuKYBI_CDOt7Jd7w"
  },
  "N8KQ6DYq3O7KGT9yIq63tw": {
    "date": "6/16/2017",
    "text": "The food was amazing and so was the margarita  Already planning my step back and I haven't left yet",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XSjZcd--NWvDl4x83UrY-Q"
  },
  "C-8v_HSuQtldFixDzcd7Ww": {
    "date": "7/18/2017",
    "text": "Hands down my favorite Mexican restaurant in the area. Service is always polite and fast, and the food is far better than El Camp and Patron combined. Wide tequila and Mexican beer selection since the bar is open. Avoid the shrimp. Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KUV5x7qX327PtcjHPPJbBA"
  },
  "h8SINjmOelVIiulaSSSUSA": {
    "date": "8/16/2017",
    "text": "Terrible service combined with average Mexican food is the reason for this rating.  There was only one other table here while I was eating and there were four people working.  I had to bring my bowl to the bar to ask for more chips because the four employees were too busy hanging out and talking with each other at the bar.  It took forever to have my drink refilled and then sat at the table for 10+ minutes before they asked if I wanted the check.   Completely unacceptable.  I wouldn't waste my time or money at this restaurant.  I could deal with service if the food was special but it tasted like any other mediocre Mexican restaurant that I've been to.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0W1eGdT-l1jOrP5n6Xqkpw"
  },
  "qrWYf0-MNQXvV1uq830AZA": {
    "date": "8/11/2017",
    "text": "This place is phenomenal! Be careful though, because you might eat too much. Try the verde tomatillo sauce, too. It's excellent on just about everything.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PlLOK68l36iDjYFMQsEHlQ"
  },
  "vDlMfiHUrxrtu9CXzgBkZg": {
    "date": "3/2/2018",
    "text": "My husband and I went this evening....LOVE LOVE LOVE THIS PLACE !!!!!!!!!!!!!! Everything was incredibly AWESOME !!!!! The place is visually calming and soothing......nice easy lighting, colorful artwork and decor.....the booths are big, tall, comfortable and private and the place is arranged perfect.....the servers are GREAT ! Very polite, friendly....just PERFECT.  All our food was SUPERIOR.....just perfect. Warm tortilla chips and salsa, Nacho Supreme was soooooooo good.....the Beef Burrito, Beef Enchilada, Beef Taco was delicious......perfect!.....The Fried Chicken Chimichanga was awesome, EVERYTHING we got was soooooooo good.....we really enjoyed our dinners.....BTW, my Husband IS Latino and we lived in Texas a while with his family....and I never had Mexican food THIS good ! It was just really great. This was our first time visiting and I can't wait to go try some more stuff.....and HOPEFULLY save room for Fried Icecream !!!!!! Go try this place, it's such a nice, friendly, calm atmosphere.....romantic, private....so nice.....we just loved it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zaj9NP5U0D62l_QtH4ipjw"
  },
  "ccSQoS3uUz7JleShiJr49Q": {
    "date": "1/20/2014",
    "text": "I work in Penn Center and this is one of the favorite spots for lunch in our office.   The food is fresh, tastes great and the service is happy and quick. Lunch never takes a full hour and you never feel rushed. Plus, portions are big so it's great that there's a short walk involved!!  Look for the specials and enjoy your meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9X_w0NNGuSch8Zj8UdrOWw",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9X_w0NNGuSch8Zj8UdrOWw/o.jpg"
      },
      {
        "img_id": "8PBGZQhkS6Nl-WhTxMdVdQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Quicker than you can put away your gloves, the chips arrive with a smile!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8PBGZQhkS6Nl-WhTxMdVdQ/o.jpg"
      }
    ],
    "user_id": "PZNMPWCViVX8JLsn10MSnQ"
  },
  "gXtGLZYNy4k80-7xYbqf8g": {
    "date": "4/11/2017",
    "text": "Food was mediocre... guac was good. Service was awful... wouldn't make it a point to come back..",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ieIBRew44USZgP-XsOXJ4g"
  },
  "Xh2m3aqLU8NA0jtuLfA4Vw": {
    "date": "9/7/2016",
    "text": "Went for the first time today. It's was very inexpensive and the service was good. I will return. Toco Tuesday is going to be my next visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tjoOS2WviFKRrOyQqwwXnA"
  },
  "QX8uSmrMggTtiRfrw03-5w": {
    "date": "11/18/2016",
    "text": "My husband and I love Mexican food,  and this is our favorite place.  I've had several dishes here and never been disappointed.  The refried beans are the best and you'll not find a substitute in this area!  Love the margaritas too! The staff is always friendly and seriously the cooks are faster than McDonald's. Fast fresh and delicious!  Can't recommend this place enough!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YDrzNReGuqunaWp4GS9aJg"
  },
  "Ue5ED66OnZVlWFAvxIyY_g": {
    "date": "1/20/2017",
    "text": "Moved to Pittsburgh from the southwest 2 years ago and this is the first Mexican place I've liked at all. I got the enchiladas verdes and was pleasantly surprised at the spice level of the green sauce. My boyfriend got the special dinner sampler so I got to try the guacamole, tamale, and relleno as well. All good, though the relleno style was not at all what I'm used to. I was also a little disappointed that the \"sopapilla\" on the dessert menu was a fried tortilla and not an actual sopapilla, but oh well. It is definitely worth a try - I know I will go back next time I'm in Monroeville!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ckXmarY0QfTGVVADeprzg"
  },
  "NbkjuX6oKXOQFVV15KTT_A": {
    "date": "8/1/2015",
    "text": "Fantastic authentic Mexican food. Not American food with a Mexican flair as I've heard other establishments claim. The lunch menu is extensive quick and inexpensive. Dinner is varied, and delish. Not the made up Spanish sounding names that the big chains give to pseudo Mexican food, but real stuff. This would not be exceptional in California or Texas, but for the Pittsburgh area it is mind blowing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QfqF0AQcrOs63Bsdbc0k9g",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QfqF0AQcrOs63Bsdbc0k9g/o.jpg"
      },
      {
        "img_id": "CSdOZC5kUeOlstgPX6uDbQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CSdOZC5kUeOlstgPX6uDbQ/o.jpg"
      },
      {
        "img_id": "KkHshMWhTaBBn8f3kS2Vmg",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KkHshMWhTaBBn8f3kS2Vmg/o.jpg"
      }
    ],
    "user_id": "uxsuZGh02J0t2dWdZZpb2A"
  },
  "sQRZzRlBPhqC8lcwMSlcrQ": {
    "date": "6/10/2013",
    "text": "I'm not sure why the old location on Frankstown Road in Penn Hills closed, but I'm glad they moved to nearby Penn Center East in Wilkins Twp. They offer huge portions at cheap prices. Everything is homemade so you'll have to wait a little for your food. You get rice, beans, salsa and chips with every order.    The new location is much nicer than the previous location which was a Burger King before it was turned in Rey Azteca. I wish I could tell you more about the food , but I always get the same thing. The Burrito Texicano. It has steak, chicken and shrimp and is absolutely amazing! Why mess with perfection, right? The margaritas are huge and not to be missed!   They also have a kids menu for the little ones. The service is always quick and with a smile. I highly recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BjtJ3VkMOxV2Lan037AFuw"
  },
  "MYmwYw0wM0g3C5uXBzNyLw": {
    "date": "5/17/2015",
    "text": "Delicious food at a good price. My negro modelo draft came out in a frosted mug. Quick, friendly service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2SixiQv8k6Ta1ZebRlrsMg",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2SixiQv8k6Ta1ZebRlrsMg/o.jpg"
      },
      {
        "img_id": "YFA0aPRzInlpYK1v9eTucQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YFA0aPRzInlpYK1v9eTucQ/o.jpg"
      },
      {
        "img_id": "5CPzl_mIneU6R3GisZQtaw",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5CPzl_mIneU6R3GisZQtaw/o.jpg"
      }
    ],
    "user_id": "fBZmEe_OkLwK3RCnYwFVzw"
  },
  "DyBcY4qnUsBG8Vlc7BoEYw": {
    "date": "10/24/2016",
    "text": "I've been an Aldi lover since the 80's when I lived in Germany. I was elated when they opened stores in the States. I trust their brands and labels. And I love the finds of lower priced household goods they find. Uncomplicated, easy to find what you need quickly, and you're on your way. Their pizzas are quite good and their prices cannot be beat, anywhere.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZTCXcPDXnHdbj_dKZT4jbQ"
  },
  "PZM9r95_Qh9Ym1D18SsbjQ": {
    "date": "11/15/2016",
    "text": "Amazingly good and delicious food! Great service as well,  we ate a really good shrimp burrito, it was the Cancun shrimp! It was really really really cheap! Please go there and enjoy real Mexican food! Gracias muchachos :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xpm_g8PcLqBsCVGd8FofRA"
  },
  "INOmWhg2LGZWj5KjUBJBmA": {
    "date": "6/5/2015",
    "text": "The food at this location is fantastic and it's close to the penn center buildings. They were able to accommodate a group of 9 with no problems and the food was delivered fast, and hot .  I personally had the spinach and mushroom burritos with rice, and it was super great!! I was super impressed with the taste, quality, and presentation.  I will be returning again if I am ever in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yglz4rZmu2aA_3NNZZsTlA"
  },
  "cFphANq5FtbW_C_UY6dJhQ": {
    "date": "10/10/2017",
    "text": "My husband got the shrimp dish with queso, which was good and tasty.  My shrimp quesadilla was quite salty.  I initially thought it was OK, but the salt-lick effect kept building in my mouth.  Because I was so hungry, and I couldn't finish my meal, I decided to eat some of my husband's dish.  I also took a much-needed Zantac.  When the waitress checked on us, I told her my food was too salty and that I could not eat it anymore.  She said that sometimes the cooks change shifts and some like to use a lot of salt.  I asked if there was a way to discount my meal, since I could not finish it and since I was eating some of my husband's dish.  She said she would check with her manager.  Moments later, she returned and said the manager said I should have complained sooner and that there would be no discount.  I thought this response was lame.  She asked if that was OK and I said nope.  I didn't feel like complaining beyond this effort since I was pretty tired.  I would not return to this place.  They don't seem to care about whether or not the customer is getting a good meal and whether or not they will come back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zV6Gf9UheBQ7mcFf7sPn9Q"
  },
  "I83eavSYaZeKKgzN4vAxmg": {
    "date": "7/18/2016",
    "text": "Food was adequate but greasy. Beans and rice lacked any flavor. Chips and salsa were good. Overall, disappointed in this restaurant. Better bet is Reyna Cafe in the Strip.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uCKISrzUcpIpn2cxgE4XZg"
  },
  "l26UZYpcAjTfQqYoTZ8VrQ": {
    "date": "3/1/2017",
    "text": "Worst Margarita ever. Could not taste Tequila,when I questioned the server, he did not understand, so I returned drink and had water. they charge you for 2 dollar for additional chips. The food was okay,but friendliness of staff lacking. Will not be back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Yy09h2CjTh5u6Ts64KL6g"
  },
  "nZfyDR8MGjdSTOVPMIGz7Q": {
    "date": "8/29/2016",
    "text": "I have eaten here several times and I love it!. The prices are more than reasonable. The flavors of the food are perfect to go along with fast and friendly service, whether you're dining in or taking out. Specials every night as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RFFmAqgTPR0_kQLhhkjBPA"
  },
  "62NwOGXrPaqJS0VB-YqiTA": {
    "date": "2/21/2018",
    "text": "Our server was excellent and very friendly. The restaurant itself was nice and clean. Unfortunately, the food was terrible. I got a few soft tacos with different meats, they were all very bland and were soaked and dripping with so much grease that I lost my appetite and didn't finish my food. The service was great, but because of the food I will not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "B-fxkDVfKzsJwK8IcFgXgw"
  },
  "vEqiXole0mGYHP4jCooB5g": {
    "date": "1/4/2019",
    "text": "My favorite mexican restaurant anywhere east of the city of Pittsburgh since Cozumel's in Greensburg closed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q1QMN-rL3lSowgTfPPDJ4w"
  },
  "VvDsfxWr3--Ai3jfG2jtQQ": {
    "date": "10/3/2018",
    "text": "Place was completely empty at 3:00, tried to get lunch but they said I had to get dinner, ok.....ordered the same steak sizzling faihitas Except no cheese and like a spoonful of sour cream. Asked for cheese and more sour cream and I got mozzeralla (where's the cheddar?) and charged 2.50 for the cheese and 2.00 for more sour cream! Service was ok,food was fast, (again no one else there, no reason for any delays) food was tasty. 40 bucks for 2 was not what I was looking for Mexican food....sorry would not recommend because I was never told of the upcharge for cheese and more sour cream, I basically paid for everyone's sour cream on their plate that day...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AdmqLXhiY4LOfmixnnYvLw"
  },
  "e51k67aLz-1RHtG4HAiTPg": {
    "date": "11/30/2018",
    "text": "Horrible service. Horrible food. Place is in need of fixing , walls etc. Will not return. Margaritas taste like virgin drinks. Overpriced. Ice had dirt in it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B3n9VZiK7lgm8200VffNjg"
  },
  "re8Rx5H5wBz3nHMhIivcQg": {
    "date": "2/19/2018",
    "text": "Was in town for a hockey tournament, restaurant close to hotel.  Good food and service.  Nice vegetarian choices.  Would go back again if in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-def9DGOYd1JOrwkW1S07w"
  },
  "kW4k1dnFoIGiopjRKMFkUw": {
    "date": "4/20/2017",
    "text": "No, No, No, do not do it!  We saw the 4.5 star review and made a point to go, even going a little out of our way on the way back from something after work.  We arrived there at 8PM, and it looked like they were already putting the chairs up.  Really, 8PM is late to arrive?  We went for it anyway.  Next we noticed that they have two house margaritas, the regular sized for like $6, and a double-sized for just $2 more. Having had a hard day we order the jumbo (save the waiter and extra trip as well).  Here's what you get for your extra $2: twice as much generic margarita mix,  sickly sweet, and no extra tequila. Bad.  We were not off to a good start.  The food was equally unremarkable.  Flavorless beans, the standard iceberg lettuce salad (OK the guac is decent, but it should be, right?), and a  veggie burrito where the vegetables were practically raw and hardly seasoned.  I ordered the Mole Poblano because I love Mole and it was supposed to be sweet and spicy.  It was neither.  The Veggie burritos weren't finished, no box please, and (and this never happens) the margaritas were also not finished.   You'll notice that others have mentioned how ridiculously many items are on the menu.  That's usually a bad sign, and in this case it sure turned out to be.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UzS1tUzCpGAiDABomFsXoA"
  },
  "_uIgYxXawclkyRlFJ0N4oA": {
    "date": "11/26/2017",
    "text": "Just about the best Mexican food you can find in Pittsburgh. A very diverse and extensive menu that never fails to deliver.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 6
    },
    "photos": [],
    "user_id": "GCPqVtEl6_52n1UmzDhCuQ"
  },
  "wb-zmMvKW_R16bIvntPDhA": {
    "date": "5/26/2016",
    "text": "Great place to get Mexican if you're in the Wilkins/Monroeville area. Good food delivered hot, and good waitstaff. They are friendly, the place is clean and well maintained. A good stop for lunch or dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rs3pq6wRmaSIADCInQXp9g"
  },
  "prDBZnAC64fk1nmpXaX4Bg": {
    "date": "8/28/2018",
    "text": "Good food but need more waitstaff during lunch. Our cheese dip came out with our meal instead of before.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CLtm_502HiwQjscg0jWylw"
  },
  "gXWGQlMhi7wZ_if6qqX4fg": {
    "date": "3/29/2017",
    "text": "Checked Yelp while in town and decided to try this place! The waiting area was full of folks waiting for take out. I was quickly seated and ordered a margarita while I looked over the extensive menu! While looking I was served warm chips and salsa, which was very good! I decided on the Burrito Verdes which is two burritos, one shredded beef and on shredded chicken covered in a chile verde sauce! The margarita was very tasty. The burritos were both delicious! The service was good but the place looks pretty beat up. The booth I was seated on had a split open seat and the \"bar\" was covered in black plastic and non-operational! Bottom line is the food was very good, but the atmosphere was not really warm and inviting!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6-xlxc_UwaBs5B1S3UyMDA"
  },
  "eWQNg3YQlfwIeMRuAAkauQ": {
    "date": "8/12/2017",
    "text": "For starters, I'm from out of town. We decided on tex-mex.  The previous place we went to, was not impressive. So we came here. Oh my gawds! We should've returned to the previous place.  No endless chips and salsa!! WTH? How am I supposed to eat my dinner with no chips??  The menu is huge! Nice variety and the prices are reasonable. The presentation is nice on small plates. :(  The food is BLAND. We had to add an entire lime to the guacamole to even make it edible. It also had too many onions and very little cilantro. Then we had to ask for hot sauces. I don't have to tell you how much of that we needed to use.  So, in the end, I do not recommend eating here.  There's other places in town.  When we come back to see our friends, we will not come back here for anything!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3cD_-1LPYuSORZJYt26dPg"
  },
  "cNWXYHKE19YyANt6XD3o0Q": {
    "date": "12/2/2016",
    "text": "I was dying for a good mexican place two weeks ago, and I'm pretty glad I found this place. For a sunday, it was ominously quiet, including the rest of the locations in the shopping cul-de-sac thing. Staff was good and attentive. Chips and salsa were good (how can't they be?!). The menus are a bit too much. It was a little hard to navigate and pick one thing. Anyhow, the wait was amazingly short. We got our food in ten minutes, at least. I'm an enchilada guy, and they didn't disappoint. My mom's a huge fan of chile relieno, and she said her's was perfect. Prices weren't even bad, either. If you're in the area, check this place out.   P.S. they were working on the bar when we got here two weeks ago, not sure if it's done it not. If you want to OD on margaritas, be sure to check first.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WYUgyIiIEdZ-70jktGj7mw"
  },
  "Tm8QLZTsDEG4HYT6JquZeA": {
    "date": "12/30/2015",
    "text": "The food is always so very good here. We will never stop coming just because of the food, however, I have to say that our waitress this past time was forgetful. I ordered a glass of wine and it did not come until almost the end of our meal. I think there were some minor communication problems, however once things were straightened out, we enjoyed a very very delicious meal as usual. We were also seated right next to the door, which I did not like at first but I let this go because I didn't feel like making a fuss. I did get a draft the whole time we were eating, which was unpleasant.  I know that sounds petty, but to me where you sit has a lot to do with the atmosphere while at the restaurant.   I ordered a cheese quesadilla which, had so much filling in it I didn't know what to do with myself. It was so delicious and steamy hot and the cheese just melted everything together. Usually quesadillas are thin, but this was more like a sandwich in thickness, and tasted so good I could go for one right now. My husband got a burrito with steak, chicken, and shrimp inside. He did not have any complaints and it was finished in no time.   One thing I wanted to mention was that the guacamole was such a small serving and we paid over four dollars for a side of this. I know avocados are expensive, but geez for that amount of guac and knowing the price k paid for the little tiny bowl (see photos), I could have picked them myself!   The complementary chips and dip are always a hit.  We had churro's for desert which, despite as being so incredibly full, we always make room for them and they hit the spot for sure. Other than a few small housekeeping things, we have few complaints.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HVzaYz4iCMQwb-Bj65xxEQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Chips and salsa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HVzaYz4iCMQwb-Bj65xxEQ/o.jpg"
      },
      {
        "img_id": "vTsJmWGG_1nQuenEhWSzsg",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Rice and beans",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vTsJmWGG_1nQuenEhWSzsg/o.jpg"
      },
      {
        "img_id": "lVNQwOVZnaTO-Zo-D4eU_Q",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Side of Guac",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lVNQwOVZnaTO-Zo-D4eU_Q/o.jpg"
      }
    ],
    "user_id": "bqPFHeXp8OkAGixJ_Pi3jA"
  },
  "hKJArOYK75WOOavb-xm7wQ": {
    "date": "11/11/2016",
    "text": "A little hidden place in Monroeville that serves great Mexican food. We've been two times, and both times left satisfied...maybe a little too satisfied.  Portions are generous. Ask for the green tomatillo sauce to accompany your salsa and chips, you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_IkAs-uJFg0KC-RVY_kZKA",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_IkAs-uJFg0KC-RVY_kZKA/o.jpg"
      },
      {
        "img_id": "2gv68WnaViwhRp083Uhlqg",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2gv68WnaViwhRp083Uhlqg/o.jpg"
      },
      {
        "img_id": "4sOT4GMlomai5hZIKbRGPw",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4sOT4GMlomai5hZIKbRGPw/o.jpg"
      }
    ],
    "user_id": "Y2Yu0wI4s9kRXb-ZHFyc_Q"
  },
  "BRr5Eog8k0fOB2uGT58s0A": {
    "date": "1/4/2018",
    "text": "Friendly attentive service... salsa is runny but tasty, chips are good... ceviche appetizer was very good. Fajitas Texarna  for 2 was was good sized but could do with chorizo to give it some more spice and variety. No hot sauce on the tables?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iQ6TtnAxxMC_s4vtPQg4ow"
  },
  "816qpaAtXJuf_ZXG_X_RVw": {
    "date": "5/12/2018",
    "text": "I had the  Camarones a la Diabla which was excellent. It was a spicy red sauce over the shrimp that wasn't insanely hot. I was expecting the typical 6-8 pieces of shrimp but to my surprise they gave me 10-14 pieces on top of the rice. This was the first time eating at the restaurant and will be back in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y30lxxDg0AlzdbeWLzHedw"
  },
  "RLpTbR0TQBVGleMJEpPheQ": {
    "date": "5/9/2016",
    "text": "Conveniently located,Ample parking. As we walked in,were greeted with a smile and immediately seated. Free chips and salsa were nice! Wait staff was very polite and professional. Mini tacos from the appetizer were not that great avoid ordering those. Entrees were awesome and delicious!! Drank jorrito,tasted refreshing but 56gms of sugar!! (it was a cheat day) overall,highly satisfied with the service and food! Highly recommended!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Px0NoFDxh1_xXyXP7l7XbQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Fajitas texanas",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Px0NoFDxh1_xXyXP7l7XbQ/o.jpg"
      }
    ],
    "user_id": "YWlq-EykNc2OK4fYzR25DQ"
  },
  "5zacfNkhrcKpKQAKZxNE6g": {
    "date": "6/28/2014",
    "text": "After having an interesting time at the car dealership we found ourselves in need of food and drink. I checked yelp and found this place. Walking in we were greater by a friendly hosted who showed us to a booth. Not 5 sec later we were brought out chips and salsa. The chips were fresh and the salsa had good spice and a smooth consistency.  The menu is large with lots of different combinations.   To drink I ordered a large margarita and Bry had a negra modelo on draft. The margarita had great flavor. For dinner I choice chicken and cheese flautas. They were delicious. The chicken was moist and well seasoned and the guacamole it came with was also very good. The other half had a fajita dish with beef chicken and shrimp which is his staple and he enjoyed it. The little boy had a quesadilla and French fries. He ate almost all of it. Once it cooled down enough for him to eat it.   This was a great place for a meal. The staff is friendly and very attentive. The food is hot, fresh and comes out fast. Not much more I could ask for at a place like this.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "bYho1Aok2fNe3U8Y7YTckQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Chicken Flaunts. Every time.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bYho1Aok2fNe3U8Y7YTckQ/o.jpg"
      },
      {
        "img_id": "i65vJdba3x1VEK2goARRlA",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Piña colada.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i65vJdba3x1VEK2goARRlA/o.jpg"
      },
      {
        "img_id": "23-J3nMb9XO4ci-kGM66Gg",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Big enough to share and still feel like you ate to much.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/23-J3nMb9XO4ci-kGM66Gg/o.jpg"
      }
    ],
    "user_id": "U92V-gp13uMZL-sl_naTHA"
  },
  "lt66wJ0ZYBGv3gzxqEHMkQ": {
    "date": "5/5/2016",
    "text": "Quick solo dinner tonight when traveling for business. Cinco de Mayo and they were well staffed and the food was very good. I'm not sure I'd call it authentic but it was good. I've had better Mexican before but that was out west. If I'm in Monroeville I will come back.  Had the shredded chicken soft tacos with rice and retried beans. Service was excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c6rs9Byxpbl-bPDggify8Q"
  },
  "jzY8VZS-jH1B4jAaXIwLnw": {
    "date": "3/6/2018",
    "text": "Yikes.  Not sure how this place warrants such magnanimous language in some other reviews.  Me, I thought it sucked.  Salsa was a weak, bland tomato sauce perfect for the local palate.  We tried the fish tacos.  Places like Bakersfield in the city charge $4 for a decent fish taco.  Those come with an awesome spread and squirt bottle salsas.  These were $12.75 for 3 and were literally tilapia on a soft tortilla.  No frills for my coin.  Mexican food in this city is such shit.  People can validate by claiming to have lived in such a mexican food mecca before and how this place is the Greatest of Them All but people are generally idiots.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yTdaR2Kk2t5AIE72rOigyw"
  },
  "JgbGejb9grCNL7WXMYbWjw": {
    "date": "6/26/2019",
    "text": "This place...yes. This is the only good mexican food I've had since living in Pitt. This is the quality I'm used to back home. I've never been  disappointed ordering from here and I love to order from them when I have a big appetite because I want to eat as much as possible while it's fresh.   One of my favorite orders is the Guadalajara especial...1 chicken & 1 beef taquito, 1 chx tamale, served over a bed of nachos topped with ground beef, shredded chicken, beans & rice, all topped with cheese sauce, sour cream, and guacamole. For $14 it is a hell of a lot of good food. It was at least 2, usually 3 meals for me and I eat a lot.  love it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UerPqhZ6bvcb3enQvEB1Yw"
  },
  "XnIza92zBl9fArqtE6cAuA": {
    "date": "3/22/2019",
    "text": "Really delicious food and good music. Service is fast as well. Portions are big so I had to get the rest to go",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rNgEimEQimXumdJ66oMBMw",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Pollo Adobe ttake home. So good and filling. This is what&amp;#39;s left. I also added shrimp to mine",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rNgEimEQimXumdJ66oMBMw/o.jpg"
      }
    ],
    "user_id": "4FvrM9S76kkP5u50G81Nhg"
  },
  "xqQi_6sQj4-a6FoawEuYwA": {
    "date": "7/16/2019",
    "text": "This is a really great authentic Mexican restaurant. The prices are very reasonable for the portions. I have had every type of enchilada on the menu and have sampled the steak and shrimp, which is probably one of the best items on the menu as well as, the steak fajitas. Everything is incredibly authentic and delicious. Their happy hour offerings are fabulous as well. I'm a fan of the blue margarita.  This place is worth traveling to for a great Mexican meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YA8lIofJ5-mRnDFbdNDChA"
  },
  "164oJeyZ9k7ayFXOvBnq_A": {
    "date": "5/7/2019",
    "text": "Great service. I have been to this restaurant a few times and they have okay food. Great deals on Tuesdays, $1 hard shell tacos with beef or chicken, and $2 off margaritas during happy hour during the week. To be honest, it's not the best tasting authentic Mexican food around - same with margaritas. I keep coming back hoping it was my imagination as I have heard excellent reviews, but unfortunately I am left disappointed in food & drink taste each time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "75y8UxEyJ-ys0uuTj1DeqA",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Jumbo Margarita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/75y8UxEyJ-ys0uuTj1DeqA/o.jpg"
      },
      {
        "img_id": "AHrTW4ZUFXnL5h75gannUQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Chorizo, Hard Shell Beef Tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AHrTW4ZUFXnL5h75gannUQ/o.jpg"
      }
    ],
    "user_id": "oOe59hO0X2503ES4_4qmVQ"
  },
  "IYG8j6FRytH8cv9o5yYJqw": {
    "date": "5/18/2019",
    "text": "I just moved to the area with my wife from California, it has been hard to find really great authentic Mexican Food.  Rey Azteca is now our go to favorite restaurant for Mexican food, the food is very good and the staff is very friendly.  Would recommend this restaurant to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o8WZuB__uchTsko0lj4gpg"
  },
  "qMer8bueFxvBbJfFjn55Tg": {
    "date": "6/24/2019",
    "text": "This is my favorite authentic Mexican restaurant in and around Monroeville. The food, service, and prices are all great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v7YccvuzY0zicVo8RL1qzA"
  },
  "Vfg8D2dwQmMCfVxn7lvv_A": {
    "date": "3/15/2019",
    "text": "Worst mexican I ever had, chicken breast was not fully cooked. Food was bland. Quesidilla was just flavorless.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rdtd6Vf9GxH8M1QxdYd_0Q"
  },
  "2r6BmEGzNr5Vcx17Gr91JQ": {
    "date": "8/6/2018",
    "text": "Great, inexpensive Mexican food. Taco Tuesdays are $1 tacos. Big, sugary margaritas along with a full bar. I typically order either the tacos or a nice wet burrito. The service is prompt and courteous. Seating is widely available due to recent renovations and parking is no issue. Standard fare but above average for the area. The atmosphere is very laid back with a wide range range of customers and waiters.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOgL6eh0pwNfk6M6wv8vVA"
  },
  "RY7gJLwV9-RGfHdbHv-Zaw": {
    "date": "7/6/2019",
    "text": "No way. Don't do it.  With the reviews being pretty split and Rey Azteca still having a slightly higher star count than our usual Mexican spot, we decided to try it. The first basket of chips  and one small dish of salsa is free but refills are a charge of $2.50 according to their menu. The margaritas were on special for $2 off but tasted no alcohol and I'm fairly certain based on a quick glance when it was being made and the taste that it had one shot in a frozen jumbo. When I asked about this and told them I didn't taste alcohol I was told it was two shots and sent back to my table with the same drink. Our food wasn't good with my Yogi special being bland and my husbands $16 chicken shrimp and steak fajitas being burned and almost jerky like, completely over cooked. When I was received the check the margarita wasn't discounted and it had to be brought to a manager's attention. We feel ripped off and will definitely not be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CyMk2mAGicP6RnjxYl-22A"
  },
  "baT0BXhh-tAYmdQ8fGCnwA": {
    "date": "12/12/2017",
    "text": "After shopping, who would turn down a Mexican meal? Not I, said I!  This is a nice little spot that sits in a small strip area.  There is ample parking with easy access in and out of the lot.   The staff here is super friendly and they greeted me and everyone else immediately upon walking in the door. The dining area isn't huge but it was large enough that you didn't feel like you were a part of your neighbors conversation.  The menu, my goodness, is massive. I almost got a headache after trying to figure out what I truly wanted to claim for my meal that evening. Options are good so no complaints there. We were served the usual chips and salsa but, quite honestly,  the salsa was the only thing I did not like. It lacked flavor and it was room temperature, not cold, not warm just not a good temperature for salsa,  if that makes any sense. It lacked any real flavor and just tasted like pulsed canned tomatoes to me...meh.  Our meals were very very good. We had a shrimp burrito and shrimp.....and they were amazing. The shrimp, cheese, beans, rice and side of guac were the real deal. Shrimp were cooked perfectly and seasoned well.   This is a great spot to add to our list...can't wait to try more of their menu!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 11,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "4FNgzauca_Lc3T8L9Dn6Mw",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4FNgzauca_Lc3T8L9Dn6Mw/o.jpg"
      }
    ],
    "user_id": "B_4cl4IGRqYb0wQSe-rYjQ"
  },
  "HVW0Xd6xL4J20nL8fzPfcA": {
    "date": "8/28/2018",
    "text": "I have been to Rey Azteca many times. It is located on the back side of the little shopping center. So if you are looking from william penn highway you aren't able to see it. What is surprising to me is that this place is never busy. We are always in and out. No complaints about that, I just hope they stay in business.  Upon being seated you are served chips and salsa. The salsa is mild. I have ordered a few different things but I almost always get vegetarian #1 which is a cheese enchilada, bean burrito and bean tostada. It is traditional mexican and unbelievably good. My husband always orders the pollo adobe which is very thin chicken with lots of vegetables. They have a kids menu. We ordered my daughter a beef taco, rice and beans for $4. Super cheap. Speaking of, everything is very fair in price on the menu.  With fast and friendly service there is no doubt I will keep coming back as long as it is open!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HvDBT2whHCalPX7eWgmrqw"
  },
  "6f41iz7o1j_YU8Ht2SbNhA": {
    "date": "7/6/2018",
    "text": "I am 1st generation Mexican-American, so I know what properly prepared Mexican food is.  I just experienced a disaster listed on the menu as a pork burrito. The carnitas in the burrito had the proper consistency and texture but were so over-salted they were practically inedible. I had to pull half of them out of the burrito in an attempt to be able to eat it. Highly disappointed with restaurant management's apathy, as I brought this to the attention of two of the floor/serve staff. I am writing this from my table, to see if anyone from management comes to speak with me. Apparently, management does not value customers or repeat business. I still left the server a 20% tip, as she was pleasant and served me with reasonable service. As for El Rey 3, BAD NEWS!  I definitely recommend avoiding this establishment unless you like overpriced salt and bad customer service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "exhrgbVhkteo30ffL0xTzw"
  },
  "66bpOUCQsO5TT7mci-V3nA": {
    "date": "4/5/2019",
    "text": "We have been here before and liked the food and service.  Tonight it was terrible.  I ordered a Paloma, a common drink in most Mexican restaurants and was told they wouldn't make it. Even after i told them what was in it, 3 ingredient....they refused.  Ok...so i ordered a margarita off of the menu and it was terrible! Pretty much a glass of sour mix.  So bad I sent it back and ordered a diet coke. The waitress was not friendly.  The food was edible but not great. My shrimp was mushy and I am a little afraid that it may not have been cooked all the way.  So unless you like a terrible margarita and rude service,  stay away from this location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ij8lByrnNLYyhazeht52-g"
  },
  "zkdCw1o4PPyQ_tuyS-nBKg": {
    "date": "6/20/2019",
    "text": "Very authentic food mixed with great and friendly service. I've only been there once but intend to go back soon!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lDnGkcCwQMZUeq79eobf3A"
  },
  "lrFZ6Xsz6k9X3ebkDseLcA": {
    "date": "4/30/2018",
    "text": "I don't have much to say about Rey Azteca. I'll keep it short and sweet, just like my visit there this past weekend!  It is your traditional Mexican restaurant in Monroeville. Upon arrival, we were quickly seated and greeted with salsa and a warm basket of chips. We placed our lunch order and it was served about 10 minutes later. Everything was fresh and hot. Our drinks never went close to empty and neither did our chips and salsa (we  asked for seconds and they didn't charge us!) A lot of patrons around us got dessert (the fried ice cream). It looked so good, but we were so full that we passed on dessert. This is definitely a place you'd want to visit if your hungry, but in a time crunch. The service was great and the food was even better!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "K515IDRsyrZskeKl0ydtYg"
  },
  "_IxQE7PeDHb7j9ZqANdC-w": {
    "date": "3/31/2018",
    "text": "Yum food ... nice staff the food is everything a hidden gem  come check this place out my yelps !",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Q5KHBlFiyq2XanVyRDbqEQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Yum",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Q5KHBlFiyq2XanVyRDbqEQ/o.jpg"
      },
      {
        "img_id": "o8_u1_1lXt4JtOkgClDmvQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. The condiments",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o8_u1_1lXt4JtOkgClDmvQ/o.jpg"
      },
      {
        "img_id": "-obGS-JCcW1vCrMGVgJTaQ",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Sizzling plate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-obGS-JCcW1vCrMGVgJTaQ/o.jpg"
      }
    ],
    "user_id": "uLWWpi62JJLnTh7UciJFHg"
  },
  "iWXr8ViJ5GXkRkFoII4Ctg": {
    "date": "6/26/2016",
    "text": "First thing I will say is that their menu is extensive but tiring to read.  There are too many combinations listed which specifically say \"no substitutions\".  I'm not into taking more time to peruse the menu than it takes to eat the darned meal so opted for just selecting a la carte -- one beef soft taco, one chicken enchilada, and rice.  Fortunately, ordering a la carte wasn't too expensive -- only coming to just under 12 bucks for the meal, a diet coke, and tip.    The food was ok; about the norm for a good many of the Mexican restaurants.  Service was prompt, friendly, and efficient as expected with chips and salsa brought to the table immediately.  Salsa was ok; not stellar.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "uTPDnjcSeVra6lZ4GmEBPw",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States. Chicken enchilada,  beef taco and rice a la carte because reading menu was tiresome. Too many combos that say no substitutions.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uTPDnjcSeVra6lZ4GmEBPw/o.jpg"
      }
    ],
    "user_id": "GMKoemATfrXg1deaXxt2jA"
  },
  "MVp_hUPzJn5bCVP4CT1h6w": {
    "date": "2/8/2019",
    "text": "I'll give it two stars but there was hardly any (if any at all) alcohol in their $10 margaritas. The chipotle chicken was terrible. Sauce was gross chicken had no flavor. Service was sub par.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4yGa1hA2xCQVjT1-73l_aA"
  },
  "V6kvaedlA8lIXJNs7cIgcw": {
    "date": "9/7/2018",
    "text": "My wife and I have been here a bunch of times. The food is always good to great. Tonight I had the Mark Burrito which is chicken, steak, shrimp, onion and peppers and it was really nicely cooked. The salsa is great, the chips are fresh made. They recently started having live music and I have to say the guy who plays is really talented. He does a mix of jazz, flamenco, and fingerstyle. Overall we had a really nice time tonight at a reasonable price with tasty food. Great place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vXoExRrDNFd0GzzrWdaxeQ"
  },
  "WQZ7-MREvCFz1iqXruSA9Q": {
    "date": "12/29/2017",
    "text": "If you are in Monroeville and looking for Mexican this is the place to go.  Friendly staff, reasonable prices, and great food.  Warm chips and salsa were served when we sat down.  Picture shows grilled shrimp chimichangas on far plate and on the first plate it was dinner combo #29 shredded beef quesadilla, ground beef taco and ground beef enchilada.    While I was not there for Happy Hour they do offer Happy Hour specials.  I would definitely return if back in this area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xrZ4Ze6whTehL6t9BHFKmw",
        "caption": "Photo of Rey Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xrZ4Ze6whTehL6t9BHFKmw/o.jpg"
      }
    ],
    "user_id": "DD9WJv4xMl7dCzP-B54HKQ"
  },
  "ICUeGHWAlkVFvVWmpS6K3Q": {
    "date": "2/4/2012",
    "text": "Good, fast and cheap!  Check one out if you are in the mood for a decent Mexican meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "36OMbxtQ_1m4fvrR9hHUpA"
  },
  "_Qm9gKeM3fuOxWlGbA-XdQ": {
    "date": "12/4/2012",
    "text": "I've been eating at Rey Azteca since they were in their Frankstown Road location and I have never had a bad meal here. The food has always been very good and very, VERY cheap. I've been amazed at the dollar to food ratio ever since I found this place. If you're looking for great food at a cheap price, this is it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eXK2SP1ZiILwoqmtF0vc2w"
  },
  "UAg4RzF9SiX86Sxppdly-w": {
    "date": "3/1/2012",
    "text": "Can't say that I've sampled the menu extensively, but I grab food there frequently since I work close by.  What I get is always delicious and the staff is very friendly!  I would definitely recommend it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hj9Ls-7MRbzJ4TaFM27ZXQ"
  }
}