{
  "4ez3DS38Q0n-RjgESEDkAQ": {
    "date": "9/7/2010",
    "text": "GREAT drinks!!! They are strong and good! Ask for Brandy the bartender! She will do you right!!!  The food is also amazing as far a Pittsburgh mexican is concerned. It had a lot of flavor and they give really big portions! I have the steak burrito and my husband had the combo platter and mom had the chicken chimichanga and I would recommend them all!  The only downfall for me is that there were not more combo platters, and that I like fajita burritos and that was not on the menu.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "tj9TliU6Y4vFOhK8Oy1nBg"
  },
  "E7GYNFEXFh9TtYynrCok8Q": {
    "date": "2/13/2014",
    "text": "Easily one of the best Mexican food I had in recent times.  Pollo Compadre & Chipotle Shrimp  were too good.   We are planning to have dinner on valentines day here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "63aao-QQFLkAyBnzS1UapA"
  },
  "FA-t-7J1kD3u-j7eeUOHTw": {
    "date": "5/24/2015",
    "text": "Maybe 3.5 stars. The first thing that you notice upon entering the restaurant is the colorful chairs, tables, and streamers. We waited for a few minutes at the entrance for the seating host. A man finally showed up and directed us to a table. The server took our drink orders and asked us if we were ready to order food. My husband replied that we needed a few more minutes to look at the menu. The server thought that he said that we wanted tortilla chips and salsa. Well, OK. The server returned with two waters although my husband ordered a soda. My husband again requested a soda, and the server brought it out with the chips. I ordered the Patron Quesadilla Fajita, which says in the menu \"filled with your choice of marinated sirloin strips, marinated chicken strips & shrimp.\" I actually did not get to choose among those three because they are all included. My husband ordered the Patron Fajita. We both enjoyed the taste of the food, and his fajita generously contained very large shrimp.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FW5F5QzzMoeRdIib1OyNOw"
  },
  "Sl24OfIj4TST-1VHZGvVxQ": {
    "date": "3/29/2015",
    "text": "After hearing good things about the place I thought we'd give it a shot...disappointing at best!! Not sure what jar they get their salsa out of but putting it in the little glass bottles doesn't hide the fact that it's terrible...her order came out and it was as if they forgot to cut the meat up...huge, dry chunks of beef & chicken...I ordered the patron fajitas and while the shrimp was large & tasty I bit into a piece of chicken with BONES still in it...yummy!! The lime margs were passable...we ordered pico and got the smallest plastic container...you couldn't even get a chip into it??! Plus it was not fresh at all...we also ordered some chipotle queso and got pink watery stuff...zero taste!! Will never return!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VLXJcSvtlmCyrTrRxiT3aw"
  },
  "5GZDJkTcBfPt8tX_ld7iqg": {
    "date": "6/30/2010",
    "text": "If you've read any of my reviews, you already know what a huge fan I am of Mexican food.  What's better than meat, cheese, chips, and roasted pepper sauces?  Nothing I say! A few months ago, a Mexican restaurant opened in Monroeville by the name of Patron.  I had heard from several people that this was an \"authentic\" place.  Well, I'm always speculative when people tell me that they've finally found real Mexican food- I've been disappointed before. Five of us arrived at Patron with our appetites.  From the outside, Patron's sure seems like a chain restaurant; there's a huge sign, double swinging doors, and a big hostess table as you walk in- these things are usually absent from smaller, privately owned establishments.  The decor at Patron's is BRIGHT.  Neon colors abound... everywhere.  The tables and chairs are painted with sombreros, fiestas, and the walls were covered with plenty of Mexican paintings.  Picture lots of lime green, and you'll know what I'm talking about.  We were immediately seated and served chips and salsa that were quite tasty.  While reviewing the menus, a few blended, flavored (peach and watermelon) margaritas were ordered.  It was happy hour, so they generously only charged us $5.95 per drink.  The drinks were refreshing, and had plenty of tequila in them- they quickly disappeared. Amanda Marie, our waitress, arrived with fresh chips and took our orders.  We chose a Carne Asada Plate, Chicken Chimichanga, Fiesta Burrito, and Carne Asada Tacos.  One of our party wanted soup, but they didn't offer any.  No tortilla soup in a Mexican restaurant?  Yikes!  Our meals arrived (be careful the plates are really hot!) and we began to dig in.  My Carne Asada tacos were excellent; the meat was juicy and tender, and the Pico de Gallo was a nice accompaniment to cool down the heat of the tomatillo sauce.   The Fiesta Burrito was tasty with chicken, and flour tortilla and plenty of refried beans and jack cheese.  The Chimichanga was the only dish that disappointed- it wasn't a Chimichanga at all; it was merely rolled like an enchilada, and deep-fried... it was also SMALL. We received excellent service at Patron's.  Amanda Maria told us her life story (she was 1st generation Italian, and born on an airplane) and kept the drinks and chips coming.  The food was good, but not great.  Patron's needs to work out their \"Chimichanga\" problem, and get some soup!  Would I recommend Patron's?  Absolutely.  It's a fun restaurant, perfect for family outings of special occasions.  Ole! Happy Cooking! Chef Chuck Kerber",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "upcuNjYBXPLrbcEpmMSKXw",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States. Patron&amp;#39;s!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/upcuNjYBXPLrbcEpmMSKXw/o.jpg"
      }
    ],
    "user_id": "nHxQfB9CRettoPKJmkDx_A"
  },
  "zYV8JBdpmieMcVnPckXM0A": {
    "date": "5/3/2015",
    "text": "Great place for mexican food awesome decore and extremly friendly service. I ordered amigo pollo for lunch and didnt look like much but when i was done i felt comfortably full. My wife ordered the toco saled it was bland with cheese souse ar the bottem of the toco. We even had there fried ice cream and i cant wait to have it again. We will definitly be dining there again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fmGB5bwEQEopuuc4Hd2ExQ"
  },
  "IO9Ok99zbamyL0l8fyAwtw": {
    "date": "3/28/2011",
    "text": "After living in Phoenix for 5 years, I have developed a strong idea of Mexican food. Sure not all Mexican food is authentic, but that doesn't mean it cant be great food. Patron's is most definitely not authentic. I would call it \"authentic style\" Some of the ingredients are all wrong.    Patron is located inside of a Chili's that went out of business.They redid the interior, but it still has the Chili's feel inside of it.   The chips and salsa are incredibly mediocre. The chips were fresh and correctly seasoned with lime and salt. However, they were all cooked a little different. Some overdone, some underdone.  The salsa was just plain bad. Very little flavor. One of the biggest misconceptions about salsa is that it needs to be fresh. While this is partially True, a lot of the flavor that salsa has to offer needs to be built up over a few hours. The texture was poor, and the taste was that of the walmart brand mild salsa.   Getting on to the entrees...  I had a chicken burrito. Holy mediocre. The tortilla was dry and nearly stale. The chicken was far from noteworthy. Rice tasted like it was a few hours old and kept out. The beans may or may not have come from a can, but they sure tasted like it. In fact, I have had better beans from a can.   The service at the restaurant was poor. The server barely knew anything about mexican food. He must have been knew. Seriously, he worked in a Mexican restaurant and didnt know what lengua and cabeza were...   Drink selection is the same as any chain restaurant. As an avid whisky/scotch/burbon drinker, I didnt find anything that interested me. I will drink a good tequila (beyond patron), but their selection lacked anything special.  If you want mexican food in pittsburgh, there is only one place (to my knowledge), El Campesino.  I would rather go to taco bell than eat at Patron again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "3mdvR4skfSTTbOrZS5X41g"
  },
  "I0RtAGaUVf1pluAQPTjJKg": {
    "date": "2/29/2012",
    "text": "It was good,I'm not a real Mexican food eater. Just got the patron fajitas. Meat was seasoned very good(chicken). Definitely not Taco Bell,the person I was with had a burrito that looked like a loaf of bread",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5VNvWC4xG19wFCQfauEPig"
  },
  "_LIb0yyFlCRFnP-H24ED6A": {
    "date": "8/1/2014",
    "text": "I wanted to like this place! The decor was colorful and whimsical, the service was decent, and my husband dug the fish tacos. However I was very disappointed in the vegetarian fajitas, which seemed to consist of frozen veggies from a bag - no amount of grilling could change their watery blandness. For a $12 meal, fresh veggies and little seasoning aren't too much to ask for!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0zEZj6jzK24NGf1-mdJsLw"
  },
  "QvVxOzNAnN-IxtxXgaopyg": {
    "date": "1/30/2011",
    "text": "I was born in raised in Chicago, a town with a much larger Hispanic population, and I've been complaining since I moved to Monroeville 5 years ago that there really isn't much good Latin food in the area.  Patron was the answer to my dreams.  I don't know why so many people are complaining about the bright colors or the race of the wait staff.  The reason for the non-Hispanic majority of wait staff is most likely since these guys this new restaurant on the other side of Pittsburgh, but still run the original place in Wexford.  Just because they opened a new restaurant doesn't mean that they spontaneously multiply their numbers.  As for the decor, if you're not into the bright colors, I suggest you never travel to the southwest, or for that matter Mexico.  My family has been to Mexico numerous times, and this place is about as authentic as you can get.  I forget the name of the province that the chef is from, but it is somewhere near Cabo San Lucas (baja california), and they're actually known for their tasty cuisine.  My wife and I go into Patron at least once a week, and I've managed to try many different items off the menu.  I think their tamales are just as good as the ones I used to get from my good friend's grandmother every Christmas.  They most certainly will let you substitute rice for beans or vice versa, but I recommend both.  For those that measure a Mexican restaurant by a burrito, I suggest you read up on the origin of that food.  It is an American invention, so it's the last thing I'd use to judge a place.  The Chile Relleno is great, as are the enchiladas with red sauce.  Something I had never heard of, but thoroughly enjoy is the Chipotle Chicken.  Oh, and be sure to check out their specialty Fajitas, some have chorizo & carnitas, and are wonderful!  If you want real authentic Mexican cuisine, go to Patron.  If you're looking for a giant burrito and the simple standard yinzer fajitas, go to Don Pablo's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JOokUpLpP1ghQzsPfmu2Kg"
  },
  "xGEoGD5MoMNE1zEs6Gqkgg": {
    "date": "2/19/2012",
    "text": "Went on a Saturday evening at prime dinner time...6 pm...and only had to wait 10 mins for a table. Staff was pleasant, but service was very, very slow. Chips and salsa are excellent and refills were plentiful! Fajitas were super yummy, portions are huge, and prices are very reasonable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jlv56gDY89ImrHkc5nIFsg"
  },
  "pYwvs4-J2vL13agJTf1aag": {
    "date": "10/17/2012",
    "text": "Food good service excellent!! Very entertaining especially if its your birthday! Margaritas excellent price and flavor!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QBEZsA7W5vtvn-B_-j9EzA"
  },
  "VRoQ4llUet9ixmt7oQ-AVg": {
    "date": "5/13/2013",
    "text": "Advertised a Mother's Day Special $20.00 for 1 app. 2 entres and a shared dessert. The free app. Was a bowl of guacamole, entres were okay, but they wouldn't honor the advertised free dessert. Did get a nice rose. Margarita was pretty good. They should have given us the dessert!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XvBfFoDwIUgvgxRG5sSazg"
  },
  "nVXmORDXN_zynCtQ3FhO9Q": {
    "date": "1/9/2012",
    "text": "Bright friendly atmosphere, cheerful staff, quick service, hot food that tastes good. I do not have anything to complain about with this place. Free fresh chips and salsa brought to the table as soon as you sit down is always a plus and the way it should be. Go for lunch and use one of the Enjoyment Coupons and you can both eat for $4 plus tax and tip. The place is clean and the temperature inside is always just right, not to hot or not too cold. What else do you need ?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YmZb7nsmeufYcsjhg84zcw"
  },
  "bAWKKKufNgQE10TglWQ6xQ": {
    "date": "7/28/2011",
    "text": "Food tastes great to me! In comparison to the phony wanna-be Mexican restaurant that resides across the street, this place is delicious. fairly priced, hot food everytime, helpful staff, delicious drinks! Loved it from the apps to the desserts.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f6kC5mrf6v_4D_T0Z3_R7g"
  },
  "XCUZXIC_L023P8eOlRa0XA": {
    "date": "10/19/2013",
    "text": "The Monroeville Patron is one of my favorite mexican restaurants when visiting the area.  The service is great.The chicken burritos are delicious.  The chicken is flavorful and juicy. I usually do not enjoy the rice and beans at other restaurants but these were probably my favorite. The restaurant is clean and atmosphere is pleasant. We will definitely return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UNEfycxt5LSO9RdNbaB0GQ"
  },
  "bWQIWMuB3OaSQCZfVkvE7A": {
    "date": "9/15/2011",
    "text": "Really mediocre.  Nachos for appetizer.  Mix of some bland cheese sauce and some shredded white cheese -  zero flavor - and not in the oven long enough to melt the cheese.  Fish tacos -- corn tortillas wrapped around tiny pieces of fish with lots of fried breading.  served with a creamy sauce and some boring salsa.  No cabbage.  Nothing worth eating.  My friend had a chimichanga.... doused with that same bland flavorless cheese sauce.    Service was fine.   Food was terrible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8GuO82YNOXmtuI77Sq8DA"
  },
  "o6gtX0WGJszxuzwD1M1vAw": {
    "date": "7/19/2012",
    "text": "I went here for the first time on July 16th with my wife as a birthday present. We were greeted and seat almost right away. Sat down in a colorful booth with one side a design of a small village. The other side a Aztec mask. All the tables and chair were very nicely design like this. The design of the Patron, and the menu felt like a authentic Mexican restaurant. The menu had a lot of different variety of burritos, tacos, quesadillas and other Mexican foods. I got the Fiesta burrito with steak and my wife got the Fiesta burrito with chicken. As we were waiting for are meals, they gave use nachos with salsa. When we waited 10-15mins and then got are food. The burrito came with bean dip, rice and sour cream with the burrito. The burrito was so great, taste very flavorful, very big too. For the amount food you got for the price was a good deal. About 11 dollars per meal. There was no problems with Patron. The service was average. I can't wait to come back to Patron.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1lVG_tmJE5Sj8iB7z2y_LA"
  },
  "nSZdYRIyZSxHLi4S-7xF9g": {
    "date": "7/31/2012",
    "text": "I've been to patron several times and have always had a good experience. Service was fantastic and staff is friendly. The first time I went my friend got the grande burrito which was HUGE....we could have split it and both been satisfied. I got the enchiladas which were good too. Chips and salsa are free and chips are served warm. They have the thin salsa which I Iike, but after going there several times, I always order the fiesta dip which is made of queso, beef, beans, and salsa....So good!!!! Only been there for lunch once and got the $6.99 chimichanga...;done to perfection and I only ate one of the chimis and had the other leftover. Monday and Tuesdays I believe they have $5 margarita pitchers. Let me just say- they do NOT cheap out on the tequila just because it's a special....me and my friend (regular drinkers) were definitely drunk after half a pitcher. Definitely recommend- oh, and the chicken nachos are amazing.....enough for two people to split and be full.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pk6luaZFDoCitpJ7U3XNJg"
  },
  "0KIkMlCJJBa6QXocG5Blyw": {
    "date": "1/19/2014",
    "text": "My husband and I came here at 5 on a Sunday night when we were trying to use a Darden Restaurants (Olive Garden, Red Lobster) gift card that we had received, but found that all of those restaurants in Monroeville had an hour wait! Why anyone would wait so long to eat somewhere lacking in character, when this place was directly across the street, with ample open seating, was beyond me!  The relative early timing of our visit meant that Happy Hour pricing on margaritas was in effect. They were $3.50 and STRONG, great for washing down the spicy salsa that came with the chips. Service was attentive and the food was good. I got a chimichanga and my husband got the vegetarian fajitas. All tasty, well spiced, and in very filling portions.  The TVs were not a big distraction for us. There were mostly families there eating, and we didn't observe a gross, sports-bar-esque atmosphere (which tends to annoy us very much as well). It's all in the timing, I guess, but we had a fine time, enjoying the kitschy decor on a grey winter day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-c_t-8ORqOZBuKE-jdY8aQ"
  },
  "0JTz3KHXQe7u3CELHPR5Ng": {
    "date": "11/16/2013",
    "text": "The food and drink have been good but the loud sports bar atmosphere with glaring large screen tv s distracted from the Mexican atmosphere.  They used to have a Saturday special entree that they discontinued to our disappointment.  No matter how good the food is, loud tv screens just aren't relaxing. The bar and entire dining room seems like a sports bar..  We went down the road to el campesino and had a quiet awesome dinner. I will miss patrons food but I guess management likes loud sports channels instead  of providing customers with a peaceful  environment   The service was good here, but so is el campesino",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iH_fFp5HO4DI1DmZM4vQcA"
  },
  "sQ5vdqj6mNpRP2ToHjeo8g": {
    "date": "5/7/2016",
    "text": "This was honestly a horrible experience. I took my mother here for mothers day as well as my two younger siblings. Customers be aware! This place Nickel and dimes you whenever and however they possibly can. First, they up-charged my mother for asking for red salsa instead of green salsa and then proceeded to not give her the correct order anyways. Next, they tried to charge my brother 1 dollar each for any additional \"small\" tortillas for his left over fajita meal (meal only comes with 3 tiny tortillas). This is ridiculous consider our meal was well over $100 not including tip. When speaking to the manager, she simply said \"it's all about making money here\" which immediately made me furious since one would think the customer is always right, and they would want our repeat business. They 100% lost me as a customer and I hope anybody who reads this will think twice about giving this greedy company any of their hard earned dollars.  Sincerely,  N.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2N3H9uxMdzeYivSgCL2Q-g"
  },
  "qFrs_YoxmvwwcHD9l2pw5Q": {
    "date": "4/28/2017",
    "text": "Not really a big fan of Mexican cuisine, but tonight I had a great experience. The food selection was extensive and different than what I'm accustomed to eating. Great staff, when I entered I felt welcomed and never unnoticed. The food was delicious leaving me wanting more to take home for later LOL. My wife had a Margarita and was more than satisfied with her drink. The only problem that I came across was the choice of only Ranch salad dressing. Overall one of the better experiences that I've enjoyed, not only for Mexican cuisine but food all together. I will return and maybe become a regular PATRON. (Pun definitely intended)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K60kxaq9CYfqJj7xalmqeg"
  },
  "Po0Ff0N56DUVfOHZ1YSE4Q": {
    "date": "3/27/2017",
    "text": "Terrible service today. The bartender named Monica was very angry and rude from the start when I sat down told me I should sit in another person section without any explanation period she stood in front of me and stared at me like I wast or there or something on my face... After that I was a little bit upset but I didn't say anything I was with of Buddy of my own a business meeting they're not continue to talk and can't have a casual conversation with my friend but she kept coming over and saying what do you want what do you want and I told her that I want to some tacos and she was like are you going to sit in someone else's suction or what. Then she took a nacho chip it was laying on the dirty bar picked it up and smash it into my whole tray of other nachos. She didn't even offer or replace it after she presented the dirty chip off the bar into the clean bowl of chips. After that she made a spectacle out of the whole situation turn around with her back to him walk away and everybody at the bar just looked at me like I did something wrong so I picked up my food the bull nachos that have to dirty chip inside of it and proceeded to another section of the restaurant. I always like going there but lately the pregnant Monica bartender has been very rude and unprofessional. I will not be returning to that bar unless she's not serving me",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w1XhqikSTMvSpe9xUw68yQ"
  },
  "GboFOlUT1CGOUL7ulKtMMw": {
    "date": "8/17/2014",
    "text": "Our third visit to this classic Mexican restaurant in Monroeville.  Although we often go to MadMax 'cause I love the fish tacos and margaritas, tonight we wanted classic Mexican fare, and the atmosphere and decor seems fun in Patron.  I decided on the Enchiladas Mexicanos (I believe, since I'm still a bit upset by the experience). I asked for a bean enchilada and two cheese enchiladas with onions, further specifying I wanted the onions inside.  The Asian (since I did not get his name this is my only way to identify him for you) bartender/waiter seemed put off about the onions inside the enchiladas.  Why, I thought, as I've gotten onion and cheese enchiladas lots and lots of times in other Mexican restaurants.  When our bartender brought the order he said 'This is the last time you can ever order these like this again!  The cook said it was really, really hard and he'll never make it again'.  The he muttered 'he was really mad.'  I was shocked and humiliated.  I was scolded for what I ordered and for what reason?  Didn't he know such a statement would most likely keep me from ever coming back?  My husband and I just looked at each other and said 'what was that?\"  I decided to keep my mouth shut since the Pirates were winning on the Root channel and the salsa was good enough.  As I dig into my enchiladas I discover the two (oh, so difficult to make onion and cheese enchiladas) were in fact just a couple corn tortillas wrapped around a couple slices of onions.  That did it.  When our very missing bartender finally returned, I sort of lost it.  I confronted him about scolding me and low and behold look how difficult these were to make I pointed to him on the plate!  No Cheese even!  He told me to 'calm down' and I said how dare you, after the scolding you gave me about how tough the enchiladas were to make......The manager came out and I told him about it.  He was nice, and removed my meal from our check, but it was too little too late.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "2C65gTSaNk6YTLtC9p5Dqw"
  },
  "HKQwh41zj1BSDft4TvT53g": {
    "date": "8/28/2014",
    "text": "very beautiful decor. friendly staff. greeted at the door with a smile. waiter was attentive and helpful. menu is massive. many choices. food is good. very nice experience",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uhzZ_Rz4EkCHOCUliMDMfA"
  },
  "UR8-BZQTIYfsKDXj8ONt8w": {
    "date": "5/26/2015",
    "text": "Came here and immediately regret it! The guacamole was the same cheap pasty kind you can get at any hole in the wall mexican place, the prices are insanely overpriced! I paid 6 bucks for a tiny kids size quesadilla! They also have zero customer service! So mad i wasted my time and money here!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I7pIMaBhNkhBDrq7TPJjCg"
  },
  "caM3qXb-Me1rXVhq15ShGA": {
    "date": "3/29/2015",
    "text": "Had Lunch no. 1 consisting of soggy taco with tasteless beef, bland chili relleno, and record beans. Wife had shrimp tacos, said shrimp was tasty but also a soggy presentation. Lots better food down the street.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PuPWzbQJ6P_tax-holDgSQ"
  },
  "-uufkqW78o4TKfvX0_9QHA": {
    "date": "1/12/2015",
    "text": "I had an amazing meal there. The drinks were on point and so was the staff. Instead of going to the McDonald's next door stop in here . I see a lot of reviews on here about pricing and I can say personalIty I think its perfect pricing for the serving size you get. I took so much chicken home from my fajitas I made two more for lunch the next day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "stgtKNLuh6w0sHujcEfNFQ"
  },
  "EFeA4Yb0O_LSuUl7Az4e0Q": {
    "date": "12/9/2014",
    "text": "The Monroeville location is much better than Fox Chapel.  attentive service,  colorful atmosphere,  good margaritas,  good portions of good food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OM7G4pA1H1VKr92CCS6meg"
  },
  "4MLZ6wKp2ipC3zJHAb6IVw": {
    "date": "6/1/2013",
    "text": "Some of the best authentic mexican food around,  hands down I have eaten food in Cabo, Puerto Vallarta,  Cancun  and this is as close as it gets.  Great job",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dDWIcEIZIDQHtK561zt7rQ"
  },
  "DCMqKxJd9Z4MHDKuqBa5WQ": {
    "date": "1/6/2016",
    "text": "Got takeout and all went well. Shrimp and chicken over rice was good. Came w chips and salsa. Reasonable prices. I'd eat here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MphUSrkuxDrO-Vy4htCT4g"
  },
  "S9FKkBI0sGEacLbihuXHAg": {
    "date": "5/9/2015",
    "text": "First time at Patron. The restaurant is very nicely decorated, a very festive place! Our server, David, was excellent and attentive. The food was good, but not as flavorful as you would expect from Mexican food.  The chicken fajita was huge, but no cheese was served with the fajitas.  The enchiladas in 4 different fillings, chicken, beef, bean and cheese could have had more flavor, but I do not get the shredded lettuce and tomato slices served on top of the enchiladas. The chips were warm, crisp and delicious.  The salsa was awesome. We will definitely return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LNZrQtiZLVvCNJ6SAK3fSA"
  },
  "3Y8bQfbqxMO8DXRojHe2qg": {
    "date": "2/20/2015",
    "text": "Delicious and GREAT service! Coffee was horrible (I know, who orders coffee at a Mexican restaurant? But it's 1 out!) Fast service, nice menu selection, and reasonably priced.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CVug7QqwK6lSYn9Qgv_Tqw"
  },
  "uDocfHhsScPC5yJqXY8o0A": {
    "date": "3/11/2016",
    "text": "The service was good it has a bright decor that seems welcoming and the food was excellent. I can't wait to go again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "utAjxDNqlKe_1TqnnXxkPQ"
  },
  "cIb0Drz7aArzqNH-dNg9QA": {
    "date": "6/4/2011",
    "text": "This place is great!!! Excellent service, atmosphere and above all FOOD! Get the Queso Fundido!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZFeKcYJOTMu6b65zB5Y4SQ",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States. Queso Fundido",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZFeKcYJOTMu6b65zB5Y4SQ/o.jpg"
      }
    ],
    "user_id": "v9FNuKC47qHs5yGbA1O2cQ"
  },
  "csqey1M_bXl0h7iAScDQ9A": {
    "date": "10/22/2011",
    "text": "This mexican grill is excellent! I must say every time i have came here, it has been great! They have drink specials, the food is cheap and delicious, and you get a ton!!! you will not leave hungry.. i promise you that!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "joCcHNyvjrwEg_6KX6MMPg"
  },
  "Vrehakye-gl8V5o9AACj5g": {
    "date": "12/4/2013",
    "text": "Loved this place! Went to dinner with here on a business trip in Pittsburgh, I ordered the chili colorado. It was the most authentic Mexican food I have had in years. The service was great, prompt service and our glasses were never empty! The decor was very bright and fun. I would recommend going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4gZVrtGRi0HjvVuCfehqng"
  },
  "1krl6qcgNCHLoO5-2h-OXA": {
    "date": "1/17/2014",
    "text": "We come here a lot.  It's one of our favorite go to places.  The food is authentic, quick service and great prices.  One of my favorites are the enchiladas suissa.  They have the best salsa I have ever had which is free and comes with endless chips. The entire waitstaff it's friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4r4FbvLM3gkFwF2HHVD1PQ"
  },
  "6L2y-gN_SZ2ByGl_4v9ZRg": {
    "date": "10/28/2018",
    "text": "The food was great, the service needs some attention.  Soon after we were seated, a waitress stopped by and said she would be right with us to take our order.  Then less than a minute later, a different waiter stopped by to take our drink order. The initial waitress then stopped back to take our drink order and we told her a guy just took it.  She was confused and then upset with us because we didn't tell the 2nd guy that she had told us she would be our server.  We overheard them arguing about whose table it was and then the guy showed back up saying he had just come back from his break so it was his turn and the hostess didn't speak English so everything got messed up.  From then it was smooth until the food was dropped off and we both asked for a refill and he only brought one. Then we never saw him again until after we were finished our food and my husband still never got his refill so I got up to tell the manager and the hostess that we hadn't seen our server in awhile. He reappeared and apologized saying he got busy and forgot about us and took care of everything after that. The server was very nice but my biggest complaint would be the manager who was sitting on her cell phone the entire time. We didn't see her circling the tables to check on them and when we walked out, the hostess said have a nice evening and the manager looked up from her phone and then right back down at it with no acknowledgement whatsoever, despite the fact that she was aware of the service issues we had. My husband is an executive chef and has been in the industry for over 20 years, so we are very well aware of basic service protocol and how important it is to the success of a restaurant. 4 stars for food, 2 stars for service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HBp8upjNOxcXKdsvI-GM7A"
  },
  "JBR2SZtPWwO3FLi4Nm2Pmg": {
    "date": "6/30/2017",
    "text": "I'm looking for a mexican restaurant to rest my cravings, and this one had a great fajita salad with complimentary chips and salsa. I would given four stars, but my waitress just kept \"forgetting \" to give me a lemon for my water. But I'm still happy with my lunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gHdix8Opt_cb3ncb46mslQ",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gHdix8Opt_cb3ncb46mslQ/o.jpg"
      },
      {
        "img_id": "tA5S79kM9NjRGok0XtGkSw",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States. Fajita salad, i got chicken, tastes awesome!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tA5S79kM9NjRGok0XtGkSw/o.jpg"
      }
    ],
    "user_id": "ZTCXcPDXnHdbj_dKZT4jbQ"
  },
  "H-td8ebXeND1QdvecViJNw": {
    "date": "11/13/2017",
    "text": "I normally love Patron. Huge advocate. But this recent visit has me questioning what happened. The food was good but the service has dropped suddenly. My waitress never came to the table once to get refills. Like WHAT THE HECK! I live for liquids! Why did you not once come to the table to see how you table was doing! I literally sat at my table and watched the waitress play on her phone while I was dying of thirst. Normally the service is great but this shouldn't go unnoticed. I call earlier before my visit to ask if it was \".99 cent\" taco night and the response I go was \"no they're a dollar\" like 1.00. Not a big deal but what's the difference?! I think this lady needs to go so my heart can give it 5 stars again. R.I.P OG Patron",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7UpxziNRjGnjyTghXaxMew",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7UpxziNRjGnjyTghXaxMew/o.jpg"
      }
    ],
    "user_id": "dT4zd-DHw6Ilt2b3ogZ2xQ"
  },
  "YrXXhpjVdLJBZndA1xefDw": {
    "date": "11/19/2014",
    "text": "16$ for burrito.....?!? I've payed 16$ for burrito that was disgusting. Bartender was s cool guy, i've ordered chicken fajita burrito and the guy told me straight that \" kitchen \" doesn't wanna put papers and onions in the burrito,i can get it on the side....WAUUU!!! REALLY???....like a sad guy was cool so i sad ok,they can put it on the side. Worst meal ever, chicken had no taste, rice was half frozen w no taste as well.....beans were fine thats a plus.  For the money i payed my meal was terrible!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "V_6adkDUvD5-hkTck782ZQ",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States. 16$ burrito....WTF!!?",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/V_6adkDUvD5-hkTck782ZQ/o.jpg"
      }
    ],
    "user_id": "zHZcpzfsOcq49y9hM4qOYg"
  },
  "cJJptauC31XDizHfUFybmA": {
    "date": "10/24/2017",
    "text": "The grilled steak in my burrito was incredible! Service is excellent.. highly recommend for the Mexican food critics.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y2padS_H220Obem6zb_PVA",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y2padS_H220Obem6zb_PVA/o.jpg"
      }
    ],
    "user_id": "0yRFwvPt06ZveECVkRMnwA"
  },
  "GDIGxl6DP-zeV2xjqRKOrw": {
    "date": "4/13/2017",
    "text": "This place..THIS PLACE!! So good! I decided to randomly come here on a Monday night for dinner and a drink. Low and behold, Monday night they have the best specials!! Low price tacos and margaritas (that taste WAY better than Mad Mex) which I'm not surprised because it is truly an authentic Mexican restaurant. We will surely be back, everything was amazing! I always gets the house margarita on the rocks anywhere we go and it's one of the best he's had, I also had the strawberry frozen margarita which was also one of the best I've ever had! The tacos were to die for they really hit the spot :) and I can't forget the fact that they have fresh, hot chips and home made salsa as soon as we were seated which were (you guessed it) seriously the best I've ever had!!! We'll be back :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ue5IBkVSDnXZ7s5t9QbOmw"
  },
  "iol35ub7MjyKX1KtG1PE3w": {
    "date": "12/27/2017",
    "text": "My husband loves Mexican food and we eat at Mexican restaurants as much as possible. This is one of the better ones I have been to. Traditional atmosphere and very pleasant. Food came out nice and hot.  Cheese dip was the best and the tacos where excellent. Thank Carolina for wonderful service",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tptAOL66RmJQMtguhE_6_w"
  },
  "sUAtdrY6hX8jDS9lhgTzMQ": {
    "date": "10/21/2013",
    "text": "2 for $20 deal going on here! Not that i ordered it because it was lunch and i had a coupon only good for $8 but this is a pretty awesome deal anywhere you go, just make sure you order water to keep the cost down. So on to the review...  This place is popping with color and decorations of authentic mexican life and culture. So many reds, oranges, blues, yellows you name it, they had it! Our booth was decorated so festively with one back rest being a mask with what looked like feathers and the other was a man working on a farm during the day. The designs were so outstanding you almost forget your at a restaurant. It was practically a hispanic art gallery aside from few sculptures.   So, we were greeted instantly upon entrance. Seated at the table of our choice and given menu. After we ordered our waters a young man brought up a basket of chips and salsa for munching. They have great salsa too, not too spicy not too mild but perfect for my taste buds. The chips were crispy and fresh witha slight buttery taste from the oil they are fried in. After a few minutes we ordered from the lunch menu.  They have lunch specials i might add for $5-$7 which is a great price but unfortunately we couldn't use the coupon on any of the specials. No big deal though. The lunch menu has plenty of items under $8 so it wasn't hard to choose. I ordered the taco salad and and chicken corn taco. My friend ordered a enchilada with extra onions and beans. Once the food came it was perfectly hot and nicely organized. The Taco salad was way bigger than I thought and i was a little upset that I ordered the extra taco. I thought it would be smaller, like the size of a burrito but this shell was about 8 inches long and 3 inches wide and 5 inches high..It was full of plenty of shredded chicken, lettuce, tomatoes and sour cream. It comes with melted cheese but i decided to save on the calories.  Her dish looked good as well. It need a little extra sauce but it was just as hot and fresh as mine was. The taco shell was so light and crispy. I would break pieces off and top it with the salad mixture as if it were a dip and boy was that great. I ate my taco first which was a bad idea because I didn't have enough room to finish my taco salad :( Anywho, i managed to finish most of it but was sad that I had to throw some of it away. I was eating rather slow so the bottom of the shell got a little soggy by the time i got to the end of it.   The service was well too. Our waiter always brought us whatever we needed in a timely manner and never showed a hostile face. We made him run back so many times for water, napkins, extra sauce, extra chips you name it. But all in all he made us very comfy. I would recommend this place to anyone looking for a fast, cheap meal with lots of flavor!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4nF2qSYQVJqa_UQWRmrd9g",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States. Huge taco salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4nF2qSYQVJqa_UQWRmrd9g/o.jpg"
      },
      {
        "img_id": "Z9DNZNGzSBkxI0zHFu2EGw",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States. Chips and salsa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Z9DNZNGzSBkxI0zHFu2EGw/o.jpg"
      },
      {
        "img_id": "Z1DnyTxdmAvMlxGp_1ggwQ",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States. Booth artwork",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z1DnyTxdmAvMlxGp_1ggwQ/o.jpg"
      }
    ],
    "user_id": "vInhYl7i3v9UsYkmcm_ZUA"
  },
  "QqJuYeTRh5Vu_D_HtI298w": {
    "date": "1/27/2016",
    "text": "Patron is a pretty standard Mexican restaurant. Nothing super special, but the food is good and the service is alright, although I will say they brought out the food pretty quickly.  I love how colorful the restaurant itself is. Lots of brightly colored things all around. And of course, you get free chips and salsa. Great deals throughout the week too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O-KFgzU6Z-diGhe-cNQecg"
  },
  "9SgYqrWUp4KaNqxMSHOagA": {
    "date": "1/15/2015",
    "text": "What a far way from the Chilis this location this use to be. Don't confuse this with El Patron. What I like about this business is they always have some special going on. A happy hour, burrito Tuesday etc. Definitely going during happy hour, the drinks are such a great deal you can get a couple for the price of one. They have their own parking lot which is nice. They do get very busy so get there a head of time to catch a seat!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Gb_t83qLA1126SlTovTWg"
  },
  "if-OknzWKRGoY7_79j45Fw": {
    "date": "1/29/2015",
    "text": "We have a Patron near us in Wexford but we happened to be in Monroeville so decided we would stop in.  The service was excellent!  I wish I could remember the server's name but he was really good.    Then came the surprising part...the food at this Patron was so much better than the one in Wexford.  I had a chicken burrito that was outstanding!  The chicken was tender and had wonderful flavor!  My wife had a steak burrito which was not a good as the chicken (we both agreed) but it was very good as well.  I highly recommend this location and will eat there again when in the area!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aGz-KHKIMJHcOlZs0K4C6Q"
  },
  "rDFN6Gc0VKoaE0sKCPmEnw": {
    "date": "10/21/2017",
    "text": "Great service and well above average food.  This is our favorite for Mexican Food in Monroeville.  These folks really care about the customer experience.   Food is delivered piping hot and is delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iTUed73BTX1XhDXrLzZz3Q"
  },
  "UYCGT-WswOtiaUfu6kuq-w": {
    "date": "9/14/2012",
    "text": "Me gusta Patron's!  Just so happened to drop in on a Sunday for the buffet at Monroeville.  Ample selection of tex-mex on the buffet line.  Very reasonably priced at less than $9 per person.  Friendly staff and a never ending glass of sweet tea as the staff are very attentive.   Fox Chapel has the same service but I don't think there is a Sunday buffet.  But service is great, very little wait time to get your food, and it's piping hot and fresh!  Wash it all down witih a margarita!   If they had homemade tortillas, this places would get a 5.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_Eu_9lumAGZ1HHf3OP3hag"
  },
  "oexzfqP-Yng0_0rKeZDp4w": {
    "date": "8/16/2012",
    "text": "I LOVE Patron Mexican Grill.  I love the food and the service doesn't get any better.  Everyone is beyond friendly and always ready to get you anything you need.  You are greeted with salsa and chips, and I suggest getting the fiesta dip.  My mouth is watering just thinking about it.  My favorite entree is the Patron fajitas.  It comes with shrimp, chicken, beef, and grilled green peppers and onions.  The dish comes with rice, beans, lettuce, etc on the side.  I am usually at a Patron's at least once a week to get my fix.     The Monroeville location has a buffet on Sunday, not sure of time, but it's a chance to sample most everything on the menu.    The decor is very bright and Mexcian oriented.  This is a great time for a party, a family, a date, or just to eat.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uVTPW4LLHtcxtaRn-GNQ-w",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States. Churros",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uVTPW4LLHtcxtaRn-GNQ-w/o.jpg"
      }
    ],
    "user_id": "JE2qFjL4BaUbiI-cT5MSBw"
  },
  "dT2EY26GAFxfhB6z_bWABg": {
    "date": "7/20/2015",
    "text": "I wish would could remember the server's name; she was excellent! The ambiance in the restaurant was good, too.   We got a pitcher of the house margaritas ($25 for 60oz - not bad!) and found it really delicious. I ordered the Patron Fajitas and my husband chose the Carne Asada. His meal came with what was essentially 3 petite steaks, while I was given what amounted a full piece of chicken, a petite steak, and 6 large shrimp. Plus all the extras. For the price, we were really happy with the portion size.   Both of us thought our meats were seasoned really well and all of the sides were delicious. We were given chips, salsa, and guacamole and enjoyed all of these as well.   In all, it was a great stop for lunch and we're really glad we tried it. Next time we'll bring the little one and see how the kid's menu holds up!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_vB8IzmLZM4koGjBODOweQ"
  },
  "ZNdde7BC_ISy0V9RNIgFDQ": {
    "date": "4/14/2014",
    "text": "I'm surprised to see SO MANY 4-star reviews for this restaurant.  While the service is very good, as is the pure quantity of food, the actual food itself leaves a lot to be desired (in my opinion).  Maybe folks are purely interested in price-point with this spot - but I don't get it...and this was a Saturday night.  The chips tasted \"blah\" and stale, the salsa was watery, and the entree was bland.  That said, the staff was over-the-top friendly and the decor of the restaurant was fitting for a fun, lively, Mexican restaurant.  All in all - as I'm new to the Pittsburgh dining scene, I only hope there are better alternatives out there for good, fast, cheap Mexican food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0BxF-X_WBAoL6Zk46RzhYQ"
  },
  "a7DLN0TKYU_8508PjTYFFw": {
    "date": "12/27/2011",
    "text": "Late lunch the day after Christmas. Ordered ala carte soft chix taco, beef enchilada & refried beans. Decent but not flavorful enough. The queso blanco cheese is very salty so if you serve it without vegetables or salsa or something to cut it, it tends to overpower the dishes.  The liberal use of queso blanco is reminiscent of El Campesino.  GF ordered fajita chix salad w extra guac. Again, decent but a little bland. Guac was limey and flavorful.  Free basket of chips/salsa was very good too.   Service was really good.   Ladies room was one of most disgusting I've seen in a restaurant. They need to clean really well - including the walls & fix toilet leaks.GROSS!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "X7mVSZxStPxD4GbN_29pYQ"
  },
  "lySleFxfhZWIJRRmnx3W3w": {
    "date": "6/11/2014",
    "text": "Went to Patron for lunch and was surprised by the bright festival atmosphere.  Great lunch vibe that I'm not sure would translate well to a dinner vibe, it's THAT colorful and playful.  Service was excellent and attentive.  Friends both had chimichanga and reported that they were flavorful and tasty.  I cannot remember what I had, but know that it was good, no complaints.  Here's what I definitely remember:  The taco salad that was served to our neighbors looked fantastic.  So I was suffering from menu remorse.  Next time I'll certainly try the taco salad.  Due to the daylight decor, it will certainly be lunch and not dinner.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PZNMPWCViVX8JLsn10MSnQ"
  },
  "nRItMKcc0TGSKZbmpIeV7g": {
    "date": "1/9/2017",
    "text": "We stopped there on Saturday for lunch.  Our lunch was awesome.  We go the fajita taco salad.  While you may be thinking yeah okay it's a salad.  It was not your normal salad.  It was served in a fried flour tortilla in the shape of a taco.  The filling was your typical fajita fillings.  However the chicken was great!  The marinade was flavorful and the chicken was grilled just right.  This is a must try for anyone that likes Mexican food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rsULTNtHth_AkB0_4hoJHQ"
  },
  "bxNqEl6o3MTx5hsnBX0RoQ": {
    "date": "6/28/2014",
    "text": "1st time to this restaurant . I should have known this was not going to be a good experience from the get go. The menus have things marked out my marker. Ok one item I get. Numerous items I do not.The sign with the hours was digital but have a paper over one of the time instead of changing it. These little things point to if a business takes care of the small things. Ok one item I get. Numerous items I do not. The best part was the queso. The tacos were bland. The rice ..... Bland. The decor was nice but past that not much else, 1st and last time to this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kEtVOmQDxjijMdiwzMTc0w"
  },
  "2wCEmwl_gaSTCjLQFNgVqA": {
    "date": "9/20/2019",
    "text": "Stopped on way into downtown before going to theater and not feeling like fighting crowds. Service was decent and friendly.  Happy hour margaritas great. Food was reasonably priced and tasty. We really enjoyed the fiesta dip. Only negative comment was condition of restroom. Place was busy but service still good. Will definitely try again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2kf_CpyBEvEJQdac_DobBA"
  },
  "GUpWZEqLcy86PV3vof-hbA": {
    "date": "7/9/2018",
    "text": "This place is really going downhill. Its noticeable when you pull into the pockmarked and potholed parking lot. When you walk up to the door, and see the condition of the building and signage. All in need of repair. If they can't maintain appearances, what is the related effect on the service and food quality? Hard to say...the server was...nice...and the food seemed...okay...but even inside there are broken window blinds and not much traffic coming in. This place is standard formulaic Mexican fare...nothing stands out...its just regular.  They need to decide to get this place straightened out or just give it up. Appearances are convincing.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rs3pq6wRmaSIADCInQXp9g"
  },
  "uJZf7sjxIIB8NfLtQCWVpg": {
    "date": "6/21/2019",
    "text": "Staff was easily overwhelmed by our team's visit. The food was relatively bland, especially the frijoles which were essentially a tasteless bean puree.  Carne asada was decent, but my son's shrimp quesadilla was a hot mess.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w5ts6K7rx1C22VceR0TjgQ"
  },
  "Me2g8dT_C7h2VYPVzmgWfg": {
    "date": "12/14/2018",
    "text": "Love the seating and they have very quick service. It's comfortable and has low lighting, which I love. The waiters are very kind and patient. They did mess up on our drinks but they gave us free patron to make up for it. The food was hot and delicious. I am definitely going to be back here to try other things on the menu of wide variety.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "etjtBm3JTCKuC8r9QCfkVQ"
  },
  "z8LXD5LiZhKz3wZDzLIxEA": {
    "date": "5/9/2019",
    "text": "Service was poor. We were sat next to a party of 16 on a rather empty Thursday afternoon. Our waiter totally neglected us and payed attention to the large party. Needed refills, needed sauce but he was nowhere to be found. The food was just okay. I left underwhelmed to be honest. It's a definite two star place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yWrGdmKxq1k854j7vwl7mg"
  },
  "ltCBoJu9cHEgvI0s3I_wCw": {
    "date": "6/4/2019",
    "text": "The food was good. Other than our waitress being a little slow at times, the visit was great",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A9rhswLviCJoDR56UtgNKg"
  },
  "87f0hRq8oIidNpQ4ZJnuvg": {
    "date": "4/19/2019",
    "text": "The service was really bad. We came at 930, 1 hour before their close...yet the waiter was very rude and sarcastic with us. I had to ask for water since they didn't serve. And when I asked for hot sauce, very rudely he was like anything else...food was okay, had to re order quesadillas since cheese wasn't even melted. I would never come again and try other Mexican restaurants in the area.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L7UmMo_Stx4I8eUNm2Z-YQ"
  },
  "974RmJ7RkFgler3bWuRqCw": {
    "date": "12/23/2018",
    "text": "The end. Won't be going back there. Closed just cause they feel like it. It's 2 days before Christmas, people are out doing things. They decided to close early. Like I said, the end",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FI_7vGh8RUlYBIg3sP2t8Q"
  },
  "ox-vLx1xTH-bd1EmiQddyQ": {
    "date": "6/23/2018",
    "text": "Being a first generation Mexican-American, I know the difference between authentic, Tex-Mex, and make-believe (like Taco Bell) mexican food. Unfortunately, only the ambience at Patron Mexican Grill (furniture and background music) had any Mexican flavor. While the quality of the food was fairly decent, it was bland and in no way representative of  Mexican food.  Good Mexican food is flavorful (without being  necessarily hot). The Salsa accompanying the chips was flavorless canned tomato with very little and unidentifiable seasoning. The chips were warm, but unsalted. My GF had fish (Tilapia) tacos served with finely chopped coleslaw and a strange vinegar based tartar-like sauce. She had asked our server if the meal included rice and beans and was told yes. This was not the case.  I ordered the Steak Mexicano, which was a decent but under-seasoned bone-in rib steak smothered in sauteed bell peppers and onions, accompanied with ok rice and beans. Again, decent food, but definitely not identifiable as Mexican cuisine.  After the food was delivered, no one ever came back to check if our orders were satisfactory. I had to flag down a server from another table to ask for some hot sauce. He quickly brought me two bottles of Habanero sauce, one hot green, the other brownish yellow xxx hot. Apparently the options are to suffer with bland tasteless food, or destroy your taste buds with ridiculous heat. Nothing in between. The positives in the experience were the cheerful ambience, and the friendly and hardworking wait staff. The food, not so much.  We will continue our quest elsewhere to find out whether the Pittsburgh area has a decent Mexican restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "exhrgbVhkteo30ffL0xTzw"
  },
  "5jk2XUoAhv9zEdl28_twVw": {
    "date": "9/20/2018",
    "text": "We came here last year when we were in this area and made a note if this restaurant because we liked it so well. I like the colorful decor inside and that it's locally owned.  Tonight, unfortunately, I selected the downtown location and we drove 1hr round trip in stressful horrible traffic when we could have driven 10min from our hotel.  Hubby was not about to try city, on street parking, so we searched & found this correct location.  Our hostess was so friendly and after telling our frustrations she cheerfully suggested margaritas.  Our server was a Mexican man named Fernando. He was excellent! Our orders all came out as requested & boy was he a hard worker- happy to chat with us anytime we spoke to him, but as soon as we were finished, ready to dash to be sure he was taking care of his other customers.  We really like the salsa! Many places don't have good salsa to us. This salsa is smooth, rather than chunky and just the right amount of spice for our taste- not too much.  I had a frozen raspberry margarita which was delicious.  Hubby had the beef burrito which was so large it filled the whole dinner plate and he couldn't eat more than half.  I had the Pollo Patron- Chicken cutlets with a little cheese and enchilada sauce- brought on a hot skillet and delicious!  It came with the typical lettuce, salsa, guacamole, sour cream with a side of rice & beans. I also could only eat half of my meal.  The next time we're in this area, we'll be back!  Great service, great food and fun atmosphere!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qq-GEcJb3uQUoQP2yiDHeg",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States. Raspberry frozen margarita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qq-GEcJb3uQUoQP2yiDHeg/o.jpg"
      },
      {
        "img_id": "IqGB7Dcx73oCcao10TSs4Q",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IqGB7Dcx73oCcao10TSs4Q/o.jpg"
      },
      {
        "img_id": "30NmVaYnnBUC5UERaQjORg",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/30NmVaYnnBUC5UERaQjORg/o.jpg"
      }
    ],
    "user_id": "zkbPq-GBiTAc3-jkQfQ9uQ"
  },
  "-w9gqL2qNSj8KN-anghkJg": {
    "date": "12/6/2018",
    "text": "Tried it for the 1st time tonight......I loved it, but I'm a 'white dude' hahaha My hubby is Latino and he compares all Mexican food to his Mothers......and he said 'eh, ok\"......so, hey, I guess it depends on what you are used to.....  when we 1st met, 11 years ago, he asked if I liked Mexican food......I said \"Oh ya, I'm a Taco Bell fanatic\".......the look on his face was priceless hahahahahahaha :) He and his family don't consider Taco Bell even remotely Mexican :)  Anyway.......I really loved this place !!!!! The beef burrito and beef tacos were great, the rice was great, refried beans......I thought it was all great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zaj9NP5U0D62l_QtH4ipjw"
  },
  "s8LRElYaUGlnASRRc5kbvw": {
    "date": "4/29/2018",
    "text": "We sat at the bar and were greeted immediately asked our drink order and if we needed menus, also promised chips n salsa , unfortunately it went downhill fast from there. Bartender took our drink order which we received 20 minutes later ( bar only had 5 patrons including us) still no chips n salsa.  She was very busy socializing with her apparent regulars.  We than waited an additional 15 minutes for her to take our food order still no chips n salsa...I was starving and getting \"hangry\" , we asked about them she said oh sorry I always forget them?  Comes back again 10 minutes later to get us another drink , we than reminded her chips n salsa? I explained this time I wouldn't be able to drink my beer without some food... lol  The bar itself was messy and bartop was sticky and unkept. Needless to say food was underwhelming and we left immediately after eating.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "batsa-m2JfnVLJfqqmwYtA"
  },
  "C3flGLNFxiEPtcoDiRGC3g": {
    "date": "7/29/2018",
    "text": "I'll start off by saying my food was delicious and our waitress was kind and excellent. They are the only reason I give 2 stars instead of one. I was extremely upset by the hostess today. I was there for lunch with a group of friends, and when it came time to pay the bill, she came over to our group and announced to everyone that my card had been declined. Now that wasn't a problem necessarily, but I was understandably surprised as I had believed I had plenty of money to go out to eat. I said something like \"Oh it should have worked!\" (I'm sure I wasn't being rude) The hostess then announced to the rest of the table that I had only been approved for $5.75 or some such amount, which was completely unnecessary, rude, and unprofessional. It was no one else's business what I had in my bank account. I don't believe there was any excuse for this, even someone on their first day should have realized how inappropriate it was. I gave her my credit card instead, which of course was approved.  Now this was partially my own fault because I just recently got a new debit card, and I forgot to update it with paypal. I had some payments that were sitting on paypal that I didn't realize weren't transferred to my account due to the new card. I made a mistake. I don't believe this is justification to have my mistake announced to the rest of the restaurant. She could have just as easily said NOTHING and allowed me to just pay with whatever else I had, I was getting out my wallet. I would feel terrible for any low-income people who might come to try to enjoy a meal out who might dare make a similar mistake. Your personal business will be announced to all.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "t41CLyZ83iFM3m2YMBISSA"
  },
  "Y9zM_kCJaUwANCZOSUafmw": {
    "date": "10/9/2018",
    "text": "Horrible horrible horrible for 3 tacos I paid 32.00 Alejandro what's horrible disrespectful and nasty attitude.....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TgwgJovwuFqZiP5qiJE8vA",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TgwgJovwuFqZiP5qiJE8vA/o.jpg"
      }
    ],
    "user_id": "VYt8rAt4o5-V0GdV98p_Pg"
  },
  "O8DKQtHM45gHPIEEVs_h0w": {
    "date": "7/11/2018",
    "text": "First time here and wasn't impressed. Margaritas weren't strong at all, they tasted like there was no alcohol in them. Ordered a chicken burrito and the chicken and rice inside were dry and bland. Very sloppy looking. Only plus was that our server was really nice. Won't be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Cs6sTIAU1J20AVzCH8l9dQ"
  },
  "gnUgX4ov4luQe44ioIkpSA": {
    "date": "12/31/2015",
    "text": "Free warm chips and Salsa (good salsa by the way)  Friendly service, plenty of food for your money, chili relleno was decent, burritos are good, tacos, tamales were  good too, everything was average... Atmosphere was festive. I will go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v0Qf5B5Fgfa2LNfuZVblBA",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States. $30 worth of food...",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v0Qf5B5Fgfa2LNfuZVblBA/o.jpg"
      },
      {
        "img_id": "277h5RStYuGXqoLQQXcbLA",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States. Chips and salsa",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/277h5RStYuGXqoLQQXcbLA/o.jpg"
      },
      {
        "img_id": "g4AQh2VH4S1Msi9md-Bw7A",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g4AQh2VH4S1Msi9md-Bw7A/o.jpg"
      }
    ],
    "user_id": "ulQ8Nyj7jCUR8M83SUMoRQ"
  },
  "699QYfdAEi8Laejk4iFGew": {
    "date": "4/13/2018",
    "text": "Really nice place happy hour here is amazing, but when it switches back to normal prices it gets a little pricey. I would recommend going and trying it out for yourself ! Monday is the best day !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ySAjXyCJIcpR2wxTsFmBSQ"
  },
  "zUFPip5Pf1Svy0JZ6EYyiQ": {
    "date": "7/9/2018",
    "text": "Always seated right away. Big fan of $1 taco night. Receive chips and salsa as soon as we sit. Tacos are out within a few minutes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FVOR2D07Rv9zvhV_3tEsHA",
        "caption": "Photo of Patron Mexican Grill - Monroeville, PA, United States. Blue mango margarita on the rocks. One chicken, two beef hard tacos.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FVOR2D07Rv9zvhV_3tEsHA/o.jpg"
      }
    ],
    "user_id": "ohSFvBvM6Q49Am3LiF-d_g"
  },
  "HR4Rvs3QkyXHa5A0SOWVcw": {
    "date": "5/17/2014",
    "text": "I love the decor -- bright colors all around and the table and chairs are highly decorative.  The staff was polite, friendly, and efficient.  The menu, while looking extensive, was missing any pork enchiladas.  Drat!  I ordered steak fajitas instead and a margarita.  Both were good but, honestly, how could you mess up a fajita, anyways.  The sides were the standard rice and refried beans.  It comes with complimentary chips and salsa.  The salsa was run-of-the-mill salsa.  So, all in all, I liked the decor the best.  The rest was satisfactory, just not stellar.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "GMKoemATfrXg1deaXxt2jA"
  },
  "vxe2utTO336g9c90Xn23jA": {
    "date": "10/9/2018",
    "text": "If I could give this place no stars I truly would! The customer service is ridiculous! The waiter Alejandro (Alex)  was so nasty to me and my friends. He was so unprofessional and rude to all of us. He also questioned whether we had enough money to pay for our food! He was embarrassing us. We came for a going away dinner and he messed up or experience. We will never be back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_zBznw-0wA1KuB8WEYGWTw"
  }
}