{
  "F4Xg6P9sDHDekiKDnsJb9Q": {
    "date": "7/15/2018",
    "text": "Very good Italian place in the heart of downtown. I had the Ricotta Gnocchi and it was outstanding. The gnocchi was perfectly cooked and the sauce was unique -- pomodoro with smoked brisket and chili. Delicious. A colleague had the flank steak and it was also perfectly executed. The service was friendly and attentive. Definitely worth a try if you are in the mood for some Italian.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k1KK76_XQfjTLYRadLg_yg"
  },
  "V8licTUs4wqo9BbRLzBdNA": {
    "date": "1/14/2018",
    "text": "I was underwhelmed by my food. My romaine salad was dull and the pasta with eggplant lacked depth of flavor. Everything was under-seasoned and bland. Bread was an extra charge which always seems chintzy to me. Not a steak eater so this isn't going to be my place. Expensive for the food sampled.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "68Eqyb1KqfUastx61IQBog"
  },
  "70X9Elve53GqSzV-qxDdEQ": {
    "date": "5/7/2017",
    "text": "We had a party of 12  Excellent bartenders. Very attentive and they sample the drinks to make sure they are good.  Very good food.  Awesome wings. Good pasta.   Reasonably priced and nice atmosphere.   Questionable service.  Forgot to bring one of our friends food.  Took him 10 minutes to bring it to the table. We also had to wait a very long time for the check although there was hardly anyone there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpgJ7LWd-vre38u3NiTpug"
  },
  "Fk7DYnMPx33ijkVkG0sxWg": {
    "date": "9/25/2017",
    "text": "I was leery about trying Talia after reading the reviews on Yelp. I'm glad I gave it a chance. I dropped in by myself after work downtown. It was early and a week night so the restaurant was not crowded. The service and food were good. I would definitely give them another try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oQBrfRN0QyO4nrwnKH1wdg"
  },
  "0oNgTwfzr2e7eEL0SnPZxw": {
    "date": "9/1/2017",
    "text": "Incredible service! Damian took such good care of us. One of the best waiters we've had in a long time. Cocktails were good and food was amazing! Definitely will be coming back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i8jWd_oDdvaS1V5OOsEy1A"
  },
  "dqrkMp7Haq53tEhksnfDtA": {
    "date": "9/9/2017",
    "text": "Things to like: the cocktails are good, the pastas are yummy, the roasted olives are the perfect bar snack, and the service is friendly and helpful. Why I won't go back: it's INSANELY loud, the atmosphere is akin to an upgraded Denny's, and the entrees were really average. My husband's $40 steak was just ok. I apparently got the porchetta on an off night - it was dry as deli meat left out in the sun and I did not find a speck of pork belly in my serving, it was all overcooked tenderloin and my guess is it was sliced thin in advance and left under a heat lamp - another reviewers comment about dripping with pork fat couldn't have been further from my experience. The servers couldn't have been nicer about and took it off the check and offered to bring me another entree but after picking through the mess on my plate I was done. If you want a scene with good cocktails and pasta, it may be for you!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hHqH_E9FCI_B6WubV0jPYA"
  },
  "_hljXw6pWWEQ-TS2WSqA_g": {
    "date": "9/12/2017",
    "text": "Had the fettuccine bolognese - very good. Wife had the evening special - lamb shank which was really good. Great Italian wine selection and the price is closer to $$ than $&$ - they have a couple entrees that are barely $$$. Wife's lamb shank special was 30.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IXeUwBPIThu5chFVSE-GlQ"
  },
  "Xbho7gwLCy3cSvrqQ507JQ": {
    "date": "11/21/2017",
    "text": "Came here 3 or 4 times while attending a conference at the Omni Hotel, and ate/drank at the bar each time. The food was fabulous, as were the drinks. There was a new bartender at the time--on the younger side, wish I could remember his name--who made excellent drinks and was very welcoming to my colleagues and me. I'm giving 4 instead of 5 stars because I didn't experience table service. But the bar experience was wonderful. I'll definitely return the next time I'm in Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jMNbi2ap9K-4q1_uaxX_JQ"
  },
  "U5gpGp8UHbPpLLE67IrdTA": {
    "date": "3/20/2017",
    "text": "Oh dear. This new place has tons of good intentions: lovely hosts and servers who enthusiastically explain how they are presenting \"authentic Italian street food\" and that you should feel like you've \"walked down a small alley in Tuscany\" (note: Tuscany is a region of almost 4 million people, not a small town). The menu includes an extensive list of amari (after-dinner cordials, including many that are hard to find in the US), a good selection of Italian wines, and some really appetizing-looking dishes.  The problem is all in the execution. Basically, everything - the food, the decoration, even the presentation - feels like someone went to Italy for a week's vacation, made a quick note of everything they liked, and tried to replicate it at home without any further research or training. Some of the appetizers were very good, like the salumi plate or the whipped lard with truffle; but there were also missteps, like serving the aforementioned lard with a dense, strongly flavored, seeded bread that would be more at home on a German or Danish table than an Italian one. The mains were even more problematic. The porchetta, announced as the house specialty, was basically a pork roast wrapped in a ring of fat. The outside of a porchetta should be crispy and crunchy - and scored, to loosen the fibers of the meat - and should be cooked so that the fat renders into the meat inside. In Talia's version, the pork skin and belly on the outside are rubbery, fatty and inedible - something to be removed and discarded before eating the insides. Also, porchetta should be thinly sliced and is usually served on a bun (this is, after all, street food, even at $26 a pop). This version was a big thick slab, closer to a massive pork chop - which again made it rubbery and hard to eat.  The worst culprit, though, was the \"pizza.\" I've traveled from the Alps to Sicily, and never once had pizza that looked like this. The crust seemed to be made of phyllo or some kind of savory cardboard. The sauce was caked on, and the cheese was greasy and rubbery - all sure signs that the oven is not hot enough for pizza. Even my kids wouldn't touch it...  I'm genuinely sorry that this review comes off as snarky. I admit to being an Italian purist, and maybe my expectations would have been different if this place hadn't been so loud about its \"authenticity.\" My suggestion: hire a real Italian for a month as a consultant, and have him/her put your house in order. Have them correct the spelling on the menu and teach the waitstaff how to pronounce the names of dishes. At $120+tip for an underwhelming dinner, I don't plan on going back anytime soon...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 0
    },
    "photos": [],
    "user_id": "fdXmqUOUYFLRX3Qp5oO-zg"
  },
  "UIpG7jfIKe9ADckMI6ZLRQ": {
    "date": "9/12/2017",
    "text": "Lamb shank was really good, but the reason the restaurant got 5 stars was Jennifer F our waitress. Yes, she was that good. She pulled a 4 up to a 5. Because the really good is still not awesome and it takes awesome to get a 5 from me. So service fast friendly, super knowledgeable. She steered me to both an excellent dinner selection but a new wine choice as well. Not fancy but solid. I'd say more more on the $$ than the $$$ range.The lamb shank was actually at the high end of the menu $30. My husband and I would both go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MIXaNxMohR_-b47Fw5myPQ"
  },
  "hpR5Oki7wBEyCTs4bsIRcw": {
    "date": "3/15/2017",
    "text": "Talia is a great addition to downtown Pittsburgh's culinary scene. I stopped in for lunch yesterday and I was surprised at their selection of menu items. The Italiano pizza was great, more than enough for one and spicy! The drink menu looked really good with lots of different Italian amaros/digestifs. I'm looking forward to trying more of what Talia has to offer!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "D0_EDhZvO5z3UEPszmxiYg"
  },
  "o7dvysVg3V8ssas5RVl0hw": {
    "date": "7/13/2017",
    "text": "Went in on a Tuesday night with my boyfriend. When we arrived, there was one booth available around 8 pm and that is where the hostess sat us. Everyone was nice enough but the service was very slow and the food took a long time despite it clearing out rather quickly after we sat down. We shared the wings, olives, pizza, steak, and gnocchi. While nothing was particularly bad, we were not particularly impressed by anything either. Definitely in no rush to return, but might consider in a few months. On a side note, music was random and I felt it did not fit with ambiance.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b9rkB7U8IH3jSfIZDOUbhA"
  },
  "A7ypaXYHFXRWPv61fyThtw": {
    "date": "9/30/2017",
    "text": "Staying in the area and stopped by fairly late after walking around downtown Pittsburgh. I was flying solo so opted to eat at the bar, which is beautiful and has great ambience.  The gentleman working the bar was engaging and service was great.   I opted for the lasagna special, which was very good.  The lasagna, topped with meat sauce, had well-balanced flavors and was served elegantly with crusty garlic bread and a nice salad. The portion was huge.   I was in the mood for some whiskey and found their selection limited but carefully thought out.  Started with a nice pour of Laphroaig 10 before dinner and then Angels Envy bourbon with dinner. The bar had some unusual whisky glasses, maybe the Glencairn Canadian snifters, that really enhanced the enjoyment of both whiskies.    Definitely would return.  Cannot comment on how service is when the main seating area is busy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W1dr_22J_oaur7bxn1xScQ"
  },
  "tP8lxEmDQqXaJ0oOr0_Tnw": {
    "date": "9/25/2017",
    "text": "The bartenders and wait staff are very accommodating and offer up suggestions if asked. They make an effort to get your name and address you personally throughout your stay. The food is absolutely delicious. I got the porchetta with carmelized onions, corn cob, and creamed kale. I never imagine creamed kale would be so delicious but theirs was amazing. The flourless chocolate cake was to die for. I will go back often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YB7JmVufE4A5y9eOfCzGXg"
  },
  "gbs7gWWu7vlvH6iYhGVODA": {
    "date": "3/30/2017",
    "text": "This place is great if you like eating rolls of fat. Don't fill up on bread cause they serve a whole red potato as a side. Just save your money and swing thru the Boston Market drive thru. I rate this place as BUTT",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bcpVPgbU0t8u0qboKQ_K1A"
  },
  "lVzIwP0WZk4VFV0adivkBA": {
    "date": "4/7/2017",
    "text": "This was a terrible experience the porchetta house special was terrible. Out of five people no one had a positive comment on their meal at all the check was a little higher than expected but not of seen for downtown.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BlNB6RJvmeKYD2W8l6TkDw"
  },
  "AxHcJLq69mroG2_sVS3bAA": {
    "date": "4/10/2017",
    "text": "Struggled whether 3 or 4 stars, ideally would have given a 3.5.  Not bad, not great.  Very nice interior design and friendly staff.  I started with the $8 Italian salad which was adequate, nothing memorable but fresh.  The entree was a 1/2 order of pink peppercorn linguini for $10.  Not bad, not great...just ok flavor.  If you'd like bread to go with your salad or pasta, it'll cost you $5 and is basically an oversized brick oven roll.  Wine of choice was chianti Classico at $16....pricey.  All in all not bad, but nothing memorable.  I was in the city for work and will likely try someplace different next trip.  There has to be better Italian in this city at a better value.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D9TLBN0SyY8Izq5WbAKGFg"
  },
  "wOC2Rs7wnpdf516o2kzd7Q": {
    "date": "8/23/2017",
    "text": "The food here is fantastic. Scott behind the bar was friendly and helpful. Place rocks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d3m2RwyIMXqHEmMlU1yFpA"
  },
  "F-ZFYr4K_DIAzftCRGDPPg": {
    "date": "3/5/2018",
    "text": "My husband and I were staying at the Hotel Monaco across the street, and heard very good things about Talia. We made a reservation for 6:00 PM dinner and were not disappointed with the food, service or atmosphere. When we arrived there were several empty tables, but by 7:00, the place was packed. We started with the margherita pizza as an appetizer. It was a little on the salty side, but we liked that and found it to be delicious. He had the Kale/Arugula salad with balsamic instead of Caesar dressing and I had the Romaine salad with beets and olives, both were very good. For dinner I had the 40 day dry aged rib eye and it was AMAZING. He had the Ricotta gnocchi, and said it was the best he's ever had. That's saying something because he's Italian and his family makes the stuff from scratch! The server was very attentive, even though he was busy. He took time to answer any questions that we had, and if he didn't know the answer the found someone who did. I would definitely recommend Talia as a date night or to celebrate a special occasion, and if my hubby and I are ever downtown again, we'll probably head back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "blfIeDvRuCZyS1WOfGpsDg"
  },
  "ayDQhnhcNDThJHytlvhgxQ": {
    "date": "8/9/2017",
    "text": "Really good dining experience. The highlight was the US-made Tamworth prosciutto that Talia uses: it's almost as good as the Spanish acorn-fed Jason Iberico De Bellotta   - well done US!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cpp0rG-2vVZYJQVTqjlG4w"
  },
  "Ba2k_-qJ054IcbuWQPIXJw": {
    "date": "3/10/2019",
    "text": "Sat at the bar and had an excellent dinner. Bartenders were very knowledgeable, attentive, and nice. One sold me on the cheese pasta because he liked cheese so much. Very good! My only complaint- how could a place with such good food fall so short in the dessert arena?  We tried three and all three were a little off. Will go back though",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hN3oGLmW1wZo61W9XnIdHw"
  },
  "hky2OPtVlu71KN53HwcV2Q": {
    "date": "4/4/2017",
    "text": "Came here with a friend for lunch. Have to say the interior is very nice and the drinks are very exciting. We both read reviews and got the gnocchi. Which is very good. The sauce was so good. Kind of wished that it came with some bread to scoop it all up. The gnocchi was really good. They were bigger than normal but not that many in there. We also had the chocolate flourlesscake. More like a brownie but still nice. The only thing that was 10 bucks and really not worth that piece. But the quality out ways the quenity. Overall definitely come back and try different dishes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "srnbI5UNuu0yc8DrpfTGWA",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Chocolate flour less cake. Really good tasted like a brownie. They use almond flour instead.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/srnbI5UNuu0yc8DrpfTGWA/o.jpg"
      },
      {
        "img_id": "c-76pFHAQgVLm80MyhNNkA",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Gnocchi. That sauce was excellent. Give me a bowl of that.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/c-76pFHAQgVLm80MyhNNkA/o.jpg"
      },
      {
        "img_id": "IwyFgvyEe8XMPtDr_XhNHQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Itlian green drink. Ask for more of those olives they were delicious",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IwyFgvyEe8XMPtDr_XhNHQ/o.jpg"
      }
    ],
    "user_id": "IdbaRCFtRUzmu3AZjNc_rg"
  },
  "Ph-7A-BIx-_m8TQm5_VAsw": {
    "date": "2/17/2019",
    "text": "We decided to give Talia a try and what a fantastic experience.  I was a little concerned, since we did not have a reservation.   We were seated at the chefs table and really enjoyed talking to the Chefs and seeing them prepare the food.  Everything is delicious from the porcetta, sausage meatballs, salads, fettuccine and nice selection of salads.  I must also add that the servers were ALL amazing and were extremely knowledgeable of all the food and wine.  Certainly a hidden door gem.   We will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cuyv45ufoeDPFyBZwARxxA"
  },
  "S7oXA6wu4e1aU3O_Qvpe1A": {
    "date": "11/6/2017",
    "text": "Gonna have to go middle of the road on stars. It is a pricey establishment to say the least. Didn't have time to try the food, but the beer prices are high. Looking at the menu, the food follows suit with prices. Posted and update menu. Bartender said they have been open 7 months or so and on their third menu I might go back and try the food just to do a better review",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YUYPsmDwVO736FSdArRNGg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Menu as of 11/6/17",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YUYPsmDwVO736FSdArRNGg/o.jpg"
      },
      {
        "img_id": "5gXVPqRp-5xulUrAm4OFjQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Roasted mixes nuts - Italian herbs and garlic",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5gXVPqRp-5xulUrAm4OFjQ/o.jpg"
      }
    ],
    "user_id": "AKqMnr1bEFIZDG_zQzX8sA"
  },
  "ueD0SzPmlXfQzgribOyqDQ": {
    "date": "6/23/2018",
    "text": "Atmosphere was great and gave a great people watching perspective from the bar. Had the meatballs which were HUGE and the Brussels Sprouts. Those Brussels sprouts were amazing. I was craving them the next day. Bartenders were super attentive and friendly. I really enjoyed this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rjWq3U0Y_k5mvfiHlAY4Gg"
  },
  "1Z2qhL0XynkrRLkhUxvO5w": {
    "date": "11/5/2017",
    "text": "Our waitress was great and we were seated right away. Couldn't be more convenient to the event we were going to at Hotel Monaco. The meat & cheese charcuterie boards were decent. On par with others we've had short of Europe. Our waitress recommended a great red wine for two of us to share and it did not disappoint. I was the only one to order the tuna and it was decent. A little overdone, however not charred and it was warm inside. If I rated solely on what I ate I would've given 4 stars. However, the 3 other people I dined with all ordered the ribeye which came over a red sauce (?) and all three of them were disappointed. I've never known my husband to not like a steak that was done to his preference (medium) and he didn't even finish it. Given that all three of them didn't like it, I wouldn't recommend anyone order the steak, especially not at $41/plate. Good atmosphere, decent starters and wine list, but disappointing preparation of the main entrees.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "phsDm7coAiXBV4rCEURedA"
  },
  "GTM4r2OuKWMjLNGWf9FMBw": {
    "date": "11/4/2017",
    "text": "I came here with a friend visiting from out of town and we both really enjoyed our meals.  If I was rating simply on the staff and service, I'd give it a 5.  We had an awesome waitress who was helpful in deciding which meal to order and also some of the highlights in the city to check out after we finished!  I went with the lasagna special and ate every last bit. We also shared the cheese board as an appetizer and really how can you go wrong with cheese?  Went for the flourless chocolate cake, which was scrumptious, but I may be biased that my Dad has the better version!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "by9WgccrFe3DNxUkwJUkOg"
  },
  "HS5n_qJptn39v0C2-mcy3w": {
    "date": "5/14/2018",
    "text": "Excellent service,  really good IPAs,  very generic salads and pizza. Across the street from Omni and other Conference Center hotels.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WuNPH7jG_vjQa65ww1CGWQ"
  },
  "V3OcpaKSuAMt_G1kOSr22Q": {
    "date": "12/31/2018",
    "text": "I have been here many times before. The meals and service are always impeccable. This visit was for New Year's Eve. Ordered off the holiday menu and couldn't have been happier. The salad with gait cheese and green goddess dressing was great! Second corse was risotto, third was Arctic char with greens and beans, finally an Italian cake for dessert! I got all of this for 45.00.  The portions were huge. I eat a decent amount and I left stuffed. Great job done by the wait staff, and cooking staff. I couldn't have asked for a better meal!! I feel like I have stolen something, because of the amount of food I got for the price I paid!!  Happy New Year!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3DlLiUHhV-QuMmVaFgaQwg"
  },
  "VWRIFVPt0_lRC_cRoxwUBw": {
    "date": "6/25/2018",
    "text": "Service was poor.  Seems they can't handle when the restaurant is crowded.  The food was just average.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LWoXmMqUPDdnkU6L0MVccA"
  },
  "FpuUH4F-Mbx64_ZCxN2ptA": {
    "date": "5/14/2018",
    "text": "Was just walking by and this looked like a cool Place...food is yummy.  Would definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OOTybQ_h-s8N11xOBj1gCA"
  },
  "31z5jMvPHGL9vLGgbO2ohQ": {
    "date": "6/21/2017",
    "text": "We dined here because it was literally across the street from our hotel.  The food was delicious; I had gnocchi with a glass of Montepulciano, and some bread. The atmosphere was pleasant, and not excessively loud.  Cons:   (a) prices: $23 for a plate of pasta. FOUR DOLLARS for bread (outrageous; this should be complimentary). (b) service: not great; a little too aloof, and little eye contact. Water was not re-filled once in two hours. (c) dessert, a ricotta cheesecake, was bland & disappointing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "raqsw_nrmt4FWsRCXexkNA"
  },
  "MEt9te8nkmH0YroyTwfYmw": {
    "date": "4/15/2017",
    "text": "Mediocre at best.   We were excited to try this restaurant. We thought it would be a welcome addition to the foodie scene downtown Pittsburgh. Sadly, we were wrong.  The hostess was very nice and we were seated in a very comfortable booth. The Pinot Grigio was delicious. Their gin martini was on point. That was pretty much the only good thing that happened.   Appetizers: one of their special was a stuffed artichoke. The intention must have  been  to only serve the filling. They must have fried the artichoke to the point where it was inedible. We had one of their pizzas. It's not really a pizza. It's more of a flatbread with crispy dough. Not bad. But nothing to rave about. The beef tartare was plated over some tomato sauce that totally overpowered the plate. That's all you could really taste. It didn't even come with any crostinis or anything to pair it with.   Now the entrees: I ordered the leg of lamb. I am a lamb person. This was by far the most chewy inedible piece of lamb I've ever been served. It was awful. Amongst the other entrees: the duck was over cooked and served with farro that was way too salty it made it inedible. The porchetta had way too much unrendered fat. The prime rib was good.   Service: it is obvious that there is a wide range of knowledge between the waiters. Our waiter seemed not to be knowledgeable beyond reading a list of specials off a small piece of paper. The other waiter working the nearby tables was making recommendations and seemed on point. To add to the misery, the entrees appeared while we were still finishing appetizers. The manager was very nice. He tried his best to remedy a terrible situation. Free dessert and dessert wine.   In summary, for a new joint in the current market downtown Pittsburgh this place misses the mark by many miles. Do yourself a favor and go somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "kFk_TTqamK4a118Wk5HGdQ"
  },
  "TZeCNCjiLQ3v4aSFt_6WcQ": {
    "date": "3/15/2017",
    "text": "Stopped by for lunch.  Service was fast and good. The Manager stopped by to talk and see how everything was.  Nice atmosphere.  Basically one large room with a bar off to the side.  Had the Ricotta Gnocchi that has short rib and calabrian chili.  Very tasty with some spice.  Really a good stop for lunch.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 18,
      "cool": 16
    },
    "photos": [
      {
        "img_id": "QoiZsfXQamb5aX8SskBuvg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Ricotta gnocchi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QoiZsfXQamb5aX8SskBuvg/o.jpg"
      },
      {
        "img_id": "bl6buPIN4LWD3GYVzhdghg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Lunch menu pg 2",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bl6buPIN4LWD3GYVzhdghg/o.jpg"
      },
      {
        "img_id": "yGZLTGzNYb1Im-Nwrft4Ng",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Lunch menu pg1",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yGZLTGzNYb1Im-Nwrft4Ng/o.jpg"
      }
    ],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "4egk6jo7px9uj85cDVBgsg": {
    "date": "6/26/2017",
    "text": "I'm underwhelmed. The restaurant is beautiful and is in a great location. I ordered a cheese board which did not meet expectations. The staff wasn't great. The food was okay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sH0qFz72y0QUdYk9iE9TQQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sH0qFz72y0QUdYk9iE9TQQ/o.jpg"
      },
      {
        "img_id": "hZ02x0agvYNP7Rx2zWTwSg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hZ02x0agvYNP7Rx2zWTwSg/o.jpg"
      }
    ],
    "user_id": "tu4MauAX2HmgX-U3_0xaJA"
  },
  "dX4f2KCo_MMZTmtsuXC9Rw": {
    "date": "8/25/2018",
    "text": "So my wife and I travel a lot of places... we are die hard foodies and hotel enthusiasts. Back to the point- this place is AMAZING.  We take Italian food seriously, and we aren't messing around when we say this place just HAS IT. Not only is the service A-1, but the food is exquisite. Every time we have gone, we have gotten exceptional service and some bomb food. Treat yourself and GO HERE!!! Kudos to Talia because y'all know WHATS UP!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qh4s4cirOrG8MdaIbH6Udw"
  },
  "mVU4YqSkiwmvJb7zqnuP1g": {
    "date": "4/16/2018",
    "text": "Everything was wonderful. Definitely recommend the bread, mozzarella and prosciutto. Desserts were heavenly. Entrees were the perfect size. Sides were bigger than expected and delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_3HHQ0rhgXyfNECZlAbN7A"
  },
  "XUFYF8xub5BhLCObzYiP1w": {
    "date": "6/11/2017",
    "text": "I've been here twice and have had great experiences both times. I live in the building it is in, so with it being convenient as well, it doesn't get any better. The first time I came for a drink & light dinner. I got a rum & coke ($6) and marghertia pizza ($12) one day after work. Very satisfying. I sat at the bar & the bartender was great. The next time I came was for Sunday brunch. I got a peach Bellini (they have unlimited bellinis or mimosas for $15, but I just wanted one) and the fettuccini. Really good. The serving was small, but it was very filling. Very cute place with great drinks & good food. If I had a critique, it would be to have a separate price for people who only want one brunch drink. $15 for 1 Bellini is kinda ridiculous.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q_dZIvQMsaidgHJN_tqfBw"
  },
  "FuPaxgUOJb7V_7z9dnG3hQ": {
    "date": "8/7/2017",
    "text": "This restaurant is a bit on the pricey side. It's food was fairly decent, although I had higher expectations from the price. Their smokey margarita was not as fruity as they had described it to  me, it was more of a smoked BBQ aftertaste which I was not a fan of. They good variety however not too many vegetarian options, which was hard for my boyfriend to find something on the menu worth eating. We ordered a cheese plate as an appetizer which was delicious,  however, they could have given a bit more cheese. The pasta we ordered was fair, but nothing memorable for me. All in all, good place to try Italian food, but probably wouldn't go there again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WxllNK2uovFgZ5JbZdqi2A",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. The Smokey Margarita - I am more into fruity drinks. This one had a smoked BBQ kind of aftertaste which I was not a fan of.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WxllNK2uovFgZ5JbZdqi2A/o.jpg"
      },
      {
        "img_id": "8FNp7DNpuy-w-N5YShkhBg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Interesting cheese board, worth the price if you&amp;#39;re a cheese foodie.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8FNp7DNpuy-w-N5YShkhBg/o.jpg"
      }
    ],
    "user_id": "l3EVjuWjHphOepgE4mpQfA"
  },
  "Ab_4hwghi6JbRc-0ESETzw": {
    "date": "3/22/2018",
    "text": "This place is great too...oh my gosh I am pleasantly surprised at my rotisserie chicken sandwich and the service was great.... our servers name was Mark and he did a great job... the drinks are pretty reasonable and we are very very happy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XUCwnbx-cwauiNmkNY_d3w"
  },
  "_Vc_gPI72SldZsMsrrW4Bg": {
    "date": "6/29/2018",
    "text": "Service was excellent, and the food was amazing! We went at 6 pm on Thursday, afraid it would be too loud, but it just right. We had the scallops (cooked perfectly), meatballs, and mozzarella salad. All were delicious - we would definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "9LqlaPN7xCL4q6SKibXd6A"
  },
  "OcfglwTWg68wlbzfWVPbAQ": {
    "date": "3/18/2017",
    "text": "What a beautiful restaurant - gorgeous bar area, dining and kitchen - really loved the atmosphere.  It is really a nice addition to downtown.    The food was delicious too.  Service was super - our server was very friendly and gave us all the info we needed on the Italian dishes.  The manager walked around to make sure everything was good which I appreciate.    We went on it's first official opening night and things ran very smoothly. Nice selection of food - and loved the variety of sizes too so if you weren't too hungry you could get a half portion.    We started off with the meat and cheese platter - a nice mix of 3 varieties of each.  The mustard that came on the platter - wow - spicy and delicious! I opted for a half portion of the ricotta gnocchi with braised short ribs in a tomato chili like sauce.  It was all I could do not to lick my bowl clean -fluffy and flavorful with just the right amount of heat in there - so good.    Hubby got the leg of lamb that was prepared on the fancy spit you can see in the kitchen.  It was so tender they have to serve it without the bone because it falls off after it's cooked. He really enjoyed it.    After dinner we went to the beautiful bar and had a drink. It was a great time-can't wait to go back and try more dishes!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nUsNK1KyHW0z6ur2W5oAAQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Beautiful bar",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nUsNK1KyHW0z6ur2W5oAAQ/o.jpg"
      },
      {
        "img_id": "NpZ1qeqWiaLcLQlLfnEAFg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Leg of lamb prepared on the spot - tender and perfectly seasoned",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NpZ1qeqWiaLcLQlLfnEAFg/o.jpg"
      },
      {
        "img_id": "wjVIpmzao_PM-ec_Mvgrtg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Half portion of ricotta gnocchi with braised short rib - yum!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wjVIpmzao_PM-ec_Mvgrtg/o.jpg"
      }
    ],
    "user_id": "hjk--8VuDX3479_atPJQ1g"
  },
  "v4APSJgFA-awXBXCpn218w": {
    "date": "12/13/2017",
    "text": "I'm strictly talking about the bar in this review- the drinks are amazing!  This place has become our go to happy hour joint. The bartender is not only good looking but his drinks are insane! They were consistent and I would know....I drank so many! The drinks are creative too- be sure to try the cocktails!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ajvtJjaUcgukamiyCiwuYg"
  },
  "BwB7pSw1QCa50lWfTZH2zA": {
    "date": "5/22/2018",
    "text": "I really enjoyed the lively downtown atmosphere; the small plates including house-made smoked mozzarella, olives with sausage, and prosciutto; and the duck confit. The smart, attentive service contributed to an overall winning dinner experience. The wide-ranging menu had something for everyone in our group - from my keto preferences to my daughter's pizza preference. I recommend Talia for a delicious, easygoing, rich Italian meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "s1ePI9gnNyhZdP1Xfv4zlw",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/s1ePI9gnNyhZdP1Xfv4zlw/o.jpg"
      }
    ],
    "user_id": "boGT9Lh2LBHoJ9t2-PA45A"
  },
  "ZUGHAmZAM6nBaT2vK0b3Fg": {
    "date": "3/28/2019",
    "text": "Extremely Loud, but it's happy hour. Meatballs dry but tasty. Fingerling potatoes were good. Friendly and quick service. I probably should have tried the pizza.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HpGpXlz8JNWNlAnLwntWLA",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Fingerling Potatoes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HpGpXlz8JNWNlAnLwntWLA/o.jpg"
      },
      {
        "img_id": "U4L7CNsb6PFWb8ixTRRE2g",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Extra Sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U4L7CNsb6PFWb8ixTRRE2g/o.jpg"
      }
    ],
    "user_id": "pfQn80aqqkeyeSG0Cu2amQ"
  },
  "1h9BoSzfM6mCK9tqk_ycKg": {
    "date": "2/16/2019",
    "text": "Service was great and the food was delicious. We had he prosciutto, Margherita and  classic pizzas and they were all very tasty. Their house salad was great too!  I highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Xq0HdaCCSXfKQ8EkEQFJQ"
  },
  "5UE0LhgTqIMOIXcHREoYFw": {
    "date": "8/20/2017",
    "text": "This restaurant sits in the vicinity of Hotel Monaco and the William Penn, a great spot. The excellent service started from the moment we walked through the door. Here's how it all went down...  This place has a cool bar to the left of the reception area. Walking to our table, I noticed the open kitchen which I loved. There was hanging pasta and a carved pig leg on display.  The menu provided options ranging from grilled wings and flatbreads to octopus, homemade pastas and impressively dressed rotisserie meats. The menu made it hard to make a final decision but we chose the grilled lemon parm wings, half portion gnocci and the porchetta.   Wings- They were lightly seasoned but full of lemony flavor with a sprinkling of good aged parm. They had the perfect amount of char from the grille and the only thing needed was a small pinch of salt...darn near perfect.   Gnocci- These may be the most delicate morsels of gnocci I ever tasted. The sauce was so fresh with chunky tomatoes and a large portion of brisket added in. Perfezionare!  Porchetta- Pork loin seasoned with herbs and rubbed down with good oil just spinning all sexy in a rotisserie oven. There's fat dripping off of it causing the edges of the meat to become slightly glazed producing a savory sweet concoction.  Once finished, the meat is sliced and laid on a garlic slathered toasted ciabatta half and dressed with creamed kale and caramelized onion.   This was love at first bite across the table. Yes, it was just THAT good!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 10,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "wUSMgC-CDSpid23JmFC1qA",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. This food will make you say their name....",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wUSMgC-CDSpid23JmFC1qA/o.jpg"
      },
      {
        "img_id": "AKUf62BOnnclJyVNVHd_eA",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Porchetta baby",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AKUf62BOnnclJyVNVHd_eA/o.jpg"
      },
      {
        "img_id": "9JTrZF-AeyTQWyNgrOUfDg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Those grilled wings tho",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9JTrZF-AeyTQWyNgrOUfDg/o.jpg"
      }
    ],
    "user_id": "B_4cl4IGRqYb0wQSe-rYjQ"
  },
  "X7itrKWLdGzxu-2sgmpH2Q": {
    "date": "10/28/2017",
    "text": "Fresh made linguine pasta with bottarga. Was ok, just truly, ok. Very garlic-y.  But was a very nice place for a date.  SUPER friendly wait staff!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hZxl4qVjLcaA9b81AbTqsw",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hZxl4qVjLcaA9b81AbTqsw/o.jpg"
      }
    ],
    "user_id": "4HvqOlY0J6Ee4T2QdL8PpQ"
  },
  "5KadYlqkg2vRiwQNLJ0a7g": {
    "date": "11/2/2018",
    "text": "Get the Gnocchi, do broccolini instead of the brisket. You won't be disappointed.  Talia was my go to for Italian while working in Pittsburgh, good food and good wine at pretty reasonable prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JRMgdV0qpnCuJvUYmeBL8g"
  },
  "OEslCx4lrH5xfFkz14nkSQ": {
    "date": "11/23/2018",
    "text": "In from out of town and this place was close by our hotel. The drinks (thyme new Roman & Glasses of red wine)were good. Our server was awesome --very helpful and friendly. My boyfriend had pepperoni pizza and it was so bad he compared it to gas station pizza. Which is upsetting, felt like a nice place like this would have much better quality! I had the spaghetti and it was good just a little too rich for my liking.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ICh73_l-nVQPYjolnCt-bA"
  },
  "Qd3wTxXleGabMRm6PbIJhA": {
    "date": "7/12/2017",
    "text": "The wait staff and food were amazing!! We decided to go out to dinner last minute and went to Talia without a reservation. The manager greeted us as if we were regulars; he was was so pleasant and on top of that, he also offered us free prosecco.   The wait staff was excellent, very knowledgeable and personable and not uptight like most restaurants downtown. They were really easy to talk to and knew the menu top to bottom. We even asked them detailed questions on sides and seasonings in each dish.  Food was out of this world. The flavors that came out of each dish were so surprising. We had the rotisserie porchetta and the gnocchi -- both of which we highly recommend. I also recommend sitting at the chef's table if available -- Chef Steve answered questions throughout our meal and it was awesome to watch him cook! Overall, it was a great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lvoeHHhGXsnrN9UEWBP2rQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lvoeHHhGXsnrN9UEWBP2rQ/o.jpg"
      },
      {
        "img_id": "cMpoVuObmwtVXet1PNW6tQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cMpoVuObmwtVXet1PNW6tQ/o.jpg"
      },
      {
        "img_id": "36LpRYhHzVNt3iq5e_3diA",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/36LpRYhHzVNt3iq5e_3diA/o.jpg"
      }
    ],
    "user_id": "Is-QFoB70BfQY-3rXJT7FA"
  },
  "BeZ-tp7atxZYPODGySg1GQ": {
    "date": "3/24/2017",
    "text": "I struggled to decide whether to give Talia 3 or 4 stars. If I could, I'd give it 3.5. I stumbled across the restaurant on my way to an event. I got the event location wrong, so instead of self correcting, I decided to have a drink. The restaurant is roomy with tufted leather booth seats and the bar is pretty spacious. I cozied up to the bar and ordered a drink. The bar staff were attentive and helpful and I really enjoyed the drink I ordered which was called Moon over the Morn.   I looked over the menu for something light. I was feeling peckish, but not famished. I decided to go with the roasted wings based on the bartender's reco. I'm a big fan of wings so I felt good about my choice until they came out. They were big whole wings, like really big, as if they were injected with growth hormones. I like my wings to look brown and well cooked. These were pale as if they were blanched and quickly pan-roasted. I cut one of them with my knife and it was still a little pink inside. I sent it back.  They were accommodating and asked if I wanted to change my order but since I wasn't super hungry, I passed on the offer.  I really dig the bar and the staff is really nice. It's a fairly new restaurant so it wasn't super crowded. Seems like it gets the corporate after work crowd. I'd give it another shot minus the wings!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vQnncImDaOisxHkrtIoorw",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Moon over the Morn is a thumbs up!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vQnncImDaOisxHkrtIoorw/o.jpg"
      },
      {
        "img_id": "X7fZQUW46n5tmGC4_gEtQg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/X7fZQUW46n5tmGC4_gEtQg/o.jpg"
      }
    ],
    "user_id": "N_LyFYrey_LuxJFkdFwRkw"
  },
  "9wo8XMhSWoJDq9BKwrionA": {
    "date": "4/9/2017",
    "text": "A friend who works near Talia first told me about the place; he hadn't tried it yet, but he mentioned a delicious, hearty smell when he walked by, and the bar looked beautiful. He wasn't wrong. We agreed to meet up for lunch and try it out. I arrived before he did, and immediately gravitated toward the bar. It looks elegant, and it definitely is the focal point in the restaurant. I looked over drinks and settled on the Violet Angelo. As soon as my pal arrived, he went with the Italian Racing Green. Totally worth mentioning: The majority of Talia's drinks tend toward savory, not sweet. Although my violet hued cocktail was fruity, it was not entirely sweet. Very subtle sweet flavor. The Italian Racing Green was all savory... purely herbal. Now, usually when grabbing food at a new place with a friend, we'll both order something different and let each other try our dish. Here we broke the rule; both of us went for the Ricotta Gnocchi with Short Rib after very little deliberation. I'd seen pictures, and it looked and sounded sooo good. We were both very pleased. The sauce was flavorful, the short rib was strewn generously over the gnocchi. The only complaint from both of us was the scarce amount of the delicious, fluffy gnocchi. Lastly, we decided to split a dessert. He chose the Flourless Chocolate Cake with Marscapone. I'm not big on chocolate cake, so it wouldn't have been my choice, but that being said, it was pretty good. The candied berries were plenty, the marscapone was not. I asked about the base, suspecting it was almond flour. I was right. I'd know that crumbly yet dense texture anywhere.  All in all, pretty good! I'd go again, but next time I'll need to try the Italian wines!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ewwxlNkUorWxnYb5VW9_6w",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Flourless Chocolate Cake (it&amp;#39;s made with almond flour) with marscapone",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ewwxlNkUorWxnYb5VW9_6w/o.jpg"
      },
      {
        "img_id": "effFo1I0JG0fVidIuOqIMA",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Ricotta Gnocchi with short rib. I can&amp;#39;t recommend this enough!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/effFo1I0JG0fVidIuOqIMA/o.jpg"
      },
      {
        "img_id": "RZAExAa--XpNRAZMZSfzpA",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. My bud&amp;#39;s drink, the Racing Green",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RZAExAa--XpNRAZMZSfzpA/o.jpg"
      }
    ],
    "user_id": "01bmnye5yXRyDZ5Je6tnKg"
  },
  "8Nn4E-vzo-gx4hrFL79HFQ": {
    "date": "8/11/2018",
    "text": "$6 rose on Thursday's and a yummy lemon cheesecake. I highly recommend for a girls night!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nGbYb49UImUAT3k47wXs-w"
  },
  "RxPcDC0LHJbpxuJwhPYVKw": {
    "date": "12/7/2017",
    "text": "Had no idea this place was here, used to come to this spot when it was the lobby of the Alcoa building for the coffee shop. Would never know it, they did an amazing job building this space!   Cheese plate is stellar, nice bite to the cheeses and the daily bread and butters were outstanding.   We had the fettuccine and the spaghetti. A lot of places are overwhelming with garlic but here you taste the cheese and the peppercorns. Just so satisfying.   Service was friendly and attentive. Great atmosphere. Will definitely be back to try lasagna nights on Thursdays.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "U0yWqxj_eG0DSpprr2RDKw"
  },
  "0jZ4b57lNIls742aQ5XyRw": {
    "date": "3/16/2019",
    "text": "Not good at all. The place is extremely loud, and the food is terrible. It's a nice space, but that's about it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZHGxZNL8KoanZUlZ6merkg"
  },
  "rJoei5PmrjP8FeHxccb08g": {
    "date": "4/1/2019",
    "text": "I have to \"talia\", this place has blown me away.  Their bartenders are experts in the wines and spirits they serve.  We recently tried the margarita pizza and it is absolute perfection. Simple tomatoes, mozzarella and fresh basil on a beautiful fresh dough base.  Try it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qHQGhGluNJtmQUWhSI5L9g"
  },
  "YKNvUeEUFeSYR2QGaTQ53Q": {
    "date": "5/31/2017",
    "text": "A first-timer, I was wowed tonight. I sat at the chef's counter and got to meet both the chef and owner. I can't believe only 15 diners have written reviews.  Get with it!  I had Beef Carpaccio, Pile Rigate and Cannelini Bean. Amazing flavor, presentation and value. I loved my Hendricks and Tonics for $8.  Cheers! Ask for Jayla, my server, who rocked.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nrHU7Xr_k8KnGetl_Lc8LQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. The restaurant has been opened three months!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nrHU7Xr_k8KnGetl_Lc8LQ/o.jpg"
      },
      {
        "img_id": "KWpXQj-L7H4OYCwmYlsEiA",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. The bar at Talia!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KWpXQj-L7H4OYCwmYlsEiA/o.jpg"
      },
      {
        "img_id": "lL_mveUaJrdd_GfpWO-m9Q",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Cannelloni Beans.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lL_mveUaJrdd_GfpWO-m9Q/o.jpg"
      }
    ],
    "user_id": "ibjDVMPei9FuEFS8UMEWog"
  },
  "SOxHaDN8-lXxIMHhpdYWew": {
    "date": "2/14/2019",
    "text": "Great place! Nice Atmosphere! Went for after dinner drinks and dessert, they were very accommodating and helped us create our own dessert! Can't wait to go for dinner!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wOYNT0s5fudvkzP3NdbGCg"
  },
  "54HvmnACT7of4GA3YP1TIA": {
    "date": "7/23/2018",
    "text": "Very disappointed with this place after reading all the reviews and seeing the menu. We ordered the gnocchi and fettuccini veggie dish (forget the exact name). Everything was cooked well BUT the biggest flaw was the flavor....it had little. Everything was just bland. The meat in the gnocchi dish tasted as though it was unseasoned prior to cooking. There are other Italian places in Pitt that are better options and similar or lower price.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D9_2TAka66qKhXaGnzDceA"
  },
  "Ha-ZmI3Y61XZiN-VOJ35Fg": {
    "date": "8/11/2019",
    "text": "After reading reviews it sounded like Talia's would be the place for great, housemade pasta. After being seated we asked for a different table and were told the only other option was the chefs bar, which was fine-but during our entire visit the dining room was never now than half full. Our server was good, very knowledgeable about the menu and drinks. The drinks were very good-had the Italian choke hold and an old fashioned, no complaints there. The burrata also was great, but the main courses-the reason we chose the restaurant- were average. While the gnocchi was perfect, the sauce was not a great match. A bit bland and heavy for the light and fluffy gnocchi, the brisket was more like pot roast. I ended up picking the gnocchi out and left the sauce.  The spaghetti was good, but nothing extraordinary.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cvDkNe_ELAgPubHMkWfzOQ"
  },
  "Ctix7I2LbgvbyYu--PjZ8A": {
    "date": "12/30/2018",
    "text": "My family had an excellent meal at Talia. Just about everything was a hit, from the meatballs to the pizzas to the pastas (gnocchi and strozzapretti) to the roasted Brussels sprouts to the desserts (olive oil cake and cremespresso). Beautiful space too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HA4Gqlv4Z27wmr2RR6o08Q",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HA4Gqlv4Z27wmr2RR6o08Q/o.jpg"
      }
    ],
    "user_id": "P29owxiU_OJTHpoMMnF7dg"
  },
  "atLXzcGIkvU2CiE-3F3xCw": {
    "date": "4/11/2018",
    "text": "Yes, I am a fan! I love the ambiance and decor. We made reservations for the 4 of us on a Thursday night for 6:15 on open table. The host was so cool and nice.   Looking over the drink menu, noticed they had negroni on tap, which was pretty cool. We had that and an Aperol spritz. Both really good.  We started with their daily bread appetizer and their grilled cabbage. Both so good...the olive oil for the bread was very very good! We also had their house mozzarella, which was great too..really liked the tomatoes on there. The white balsamic was a change, which I enjoyed. We split the carbonara pasta and the porchetta dinner. Our boys split the gnocchi, but had spaghetti pasta instead of then gnocchi. That was really good with the brisket in the red sauce... But, the carbonara is to die for!!! It was SO creamy! I LOVED it! The porchetta was ok to me... my husband really enjoyed it, but it's not something I normally eat. It is something they are known for because of the \"rotisserie\", so I wanted to try it. Other than that, everything else was great!   Our server was awesome...very helpful and on top of everything. The whole vibe and staff are really nice. Would love to come back for dinner when back in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p6guPxBW7bP8hilyBQbhQw",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. The amazing carbonara!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p6guPxBW7bP8hilyBQbhQw/o.jpg"
      },
      {
        "img_id": "ZHY-Jv_zXlixGxDDc6LpbA",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Porchetta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZHY-Jv_zXlixGxDDc6LpbA/o.jpg"
      },
      {
        "img_id": "xWXzpl3sdMFc0RZOz4mi7g",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. House stretched mozzarella",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xWXzpl3sdMFc0RZOz4mi7g/o.jpg"
      }
    ],
    "user_id": "sIrRhMAlCf6gxrqO33C87w"
  },
  "ztIFiGPCJN4DolP2Zh4xgw": {
    "date": "3/26/2019",
    "text": "I couldn't be more pleased with my dinner at Talia. I am vegan and gluten free and while there aren't any vegan items labeled on the menu, the chef was totally accommodating. I ordered the vegetable pizza ona gluten free crust without cheese and it was AHHmazimg. The San Marzano tomatoes had so much flavor. They were seasoned with sea salt and pepper which totally complemented the eggplant and red onion. I also ordered fingerling potatoes without the pesto sauce. I love the taste of a plain steamed potato but the quality here was outstanding. Again, seasoned with high quality sea salt and pepper, the simplicity allowed the full flavor to shine through. The location is across the street from the Kimpton and William Penn hotels. The Italian wine selection is out of this world!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8y_ZI-c_x8RIHzd-mbUfEA"
  },
  "TpJQdV1iE73nWGWMJDE3Ag": {
    "date": "2/17/2019",
    "text": "Lady Z. and I got the Valentine's prix fixe meal. Great 4 course dinner for a decent choices for a good price. Additionally,I like this place for a few reasons:  1) They really know how to cook a mean scallop 2) Their entrees come with a decent complement of vegetables which aren't drenched in oil 3) You can actually hold a conversation in this place: noise doesn't bounce around in here and the music is far from intrusive.  I will say this: the salt seemed a little out of control for us. My date's bisque almost tasted like it was made from a brine. Which is a shame because it otherwise had great flavor. Het steak was a similar story. That wouldn't keep me from coming back, nor was it really a buzzkill: just a little disappointing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8_ynsBLLXaxQ-2ge0wZSIg"
  },
  "_brw7qqUKjC6xBR1_qGKVg": {
    "date": "8/30/2018",
    "text": "Anytime a new Italian restaurant opens up I always want to try it out. Well I have had Talia on my radar since it opened and I finally got to try it. My friend and I went on a Friday night and had reservations for 5:30. I walked in a little after 5 and decided to take a seat at the bar until she got there. The bartenders were super friendly and helpful when it came to picking a drink. They also have a happy hour starting at 5 I believe and it includes half off certain wines and cocktails. I ended up getting the Rotari Rose which was delicious! I would definitely recommend this place for a great happy hour spot.   On to the meal. I ordered the ricotta gnocchi and my friend ordered the vegetable pizza. All the pasta is made fresh daily and you can definitely tell. The gnocchi were a nice size and you did get a pretty decent portion. There are a few things holding me back from giving this place a better review and that's the sauce. It was almost flavorless. The pizza also looked very bland in my opinion. I am a girl that eats a lot of pizza and it just seemed lacking/sad. We were in and out pretty quickly and the service was good. I just personally don't think I would return here unless its for happy hour.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mawu3w4wMHcPJKqhX2XOrw",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mawu3w4wMHcPJKqhX2XOrw/o.jpg"
      },
      {
        "img_id": "mHu8vwCZyGQNcjYlMpLtEg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Ricotta gnocchi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mHu8vwCZyGQNcjYlMpLtEg/o.jpg"
      }
    ],
    "user_id": "mYJW4-M4tcRygSwdT3A6Ww"
  },
  "dchd-bi50fbccOWrpnY1gg": {
    "date": "1/2/2018",
    "text": "Pretty decent experience at Talia, we liked it but didn't fall in love. Made reservations for NYE, arrived a few minutes late but the dining room was pretty empty.   We decided to be festive and start out with prosecco which is on tap and chilled to perfection. Quickly ordered the our daily bread to munch on since we were starving. The bread is not to be missed! It's fresh and crunchy and is served with oil, butter, and mascarpone. I ordered the kale salad to start and my boyfriend did the daily soup which was phenomenal. The kale salad was just okay.  For our main course we decided on pastas; the gnocchi for me and the spaghetti for him. We actually ended up switching entrees but still had tons of leftovers. The portions are pretty darn big! The spaghetti was overhyped, and honestly had very minimal flavor despite the winter truffles. Probably would have gone for something else, but the menu was very limited for NYE. The gnocchi was fabulous though; it came in a red sauce with tender brisket.   For dessert we just wanted a sweet bite each, so we decided on the gelato which comes with a splash of espresso on top. It was pretty good, but quite small which was fine for us but definitely not really meant to share.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5LyjPdYzm4mt3IbH5QWB4Q",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Prosecco on tap!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5LyjPdYzm4mt3IbH5QWB4Q/o.jpg"
      },
      {
        "img_id": "8D9-7iWgA7t6x4vts0eJMg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Chocolate gelato with espresso",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8D9-7iWgA7t6x4vts0eJMg/o.jpg"
      },
      {
        "img_id": "BKJfSrFJJAp94II98BnvSQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Spaghetti with winter truffles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BKJfSrFJJAp94II98BnvSQ/o.jpg"
      }
    ],
    "user_id": "nOatY-nz-cUQgZKa9TbHTw"
  },
  "_yqrQnaScM8VMaoFloROmQ": {
    "date": "4/19/2019",
    "text": "The ambiance is nice and we were the first to show up for a five pm reservation at opening. It's small but comfortable with a bar scaled to the size of the overall space, more of a wait for your table than hang out area. The kitchen is open with the rotisserie prominent out in front for display as much at it is for cooking, this is a nice touch and there are a few stools at the Chefs Counter.  Service was outstanding for the most part, our waiter knew the menu inside and out not relying on crib notes for the day so that's a plus. The only criticism would be that as the place filled up quickly while we were dining the service became slower but for me that's okay, I don't go to places like this for \"fast food\" I go for an enjoyable and relaxing experience. The noise level with a full house wasn't bad at all and intimate conversation was easy in our booth.  The food was good and worth the price, I'd rate it above average but not outstanding. We had a fair sampling of the menu starting with Burrata for our antipasto, Fennel Sausage Cannelloni and Porchetta as a main course, a Charred Octopus just for the fun of it, and finished with Olive Oil Cake and Almond Flour Cake as our desert sided with a couple of their spiked Cappuccini. Walked out very comfortable and full carrying a bag with the leftover Porchetta that made a really good cuban sandwich the next day for the two of us.  This was a solid four star on the Yelp rating scale and we'd go back for lunch maybe since it's pretty much the same menu and a little less expensive for the experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A6q7-QOeMlk-2vaCpV7A3A"
  },
  "jlOYhY_A_zcKa7Nu0x9rpg": {
    "date": "12/27/2018",
    "text": "I took a break from work and came to Talia for lunch around 11:30 with a guest and we were immediately seated. We split the daily bread (the olive oil is amazing) and broccolini (cooked perfectly) as appetizers. Great portions of both for two people to split.   For our lunch, we split the classic pizza. It was a round pie cut in 4 slices with cheese and pepperoni. Our waitress added fresh parmesan to top. It was delicious!! Also a great portion size for two people to split.   The service was great from the host to the waitress. The timing of the food was perfect - even though they weren't busy. Great spot in downtown and I will certainly be back to try out more items on the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "A943DK6GgG8oz2k-C4q4hQ"
  },
  "wBQmFXVsCAX3q_VU6_bhEQ": {
    "date": "12/19/2017",
    "text": "I just had my first meal at Talia's and for the most part, it was very enjoyable!  We made reservations for 11:30, walked in and the place was empty. However, around 12pm it fills up pretty quickly! Our waiter was helpful as far as suggestions for the menu, but we didn't see him again until we were all finished. This didn't bother me too much being that we didn't have any issues with our plates, but a check-in is always nice!  The meals are served on a stone-like plate, which I liked because you avoid the scratching with your forks and knives, but they were heavy! The portions were decent in my opinion - I got the pork meatballs over polenta and I was comfortably filled after finishing it. Someone I was with ordered the flatbread and it's a 4 cut pizza, and she ended up taking a slice home. The other two people that were with me had mentioned that the gnocchi dish (w/ San Marzano/Calabrian chili/Brisket) did have a little spice to it, as well as the minestrone soup.  The waiter mentioned that all the food and condiments are house-made, and you can definitely taste it! Overall, the food and the atmosphere are wonderful and the staff was friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9fiK0R_7pLo1s1KSnGR0Yg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Pork Meatballs over Polenta",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9fiK0R_7pLo1s1KSnGR0Yg/o.jpg"
      }
    ],
    "user_id": "aKHmQdmnvN0NHF8MXiA4ng"
  },
  "GW4RHgKWKt3NlBPiyE-wJA": {
    "date": "11/16/2017",
    "text": "I discovered this restaurant walking by on my way to the Double Tree Hotel. It is located in the heart of downtown Pittsburgh. Beautifully decorated the restaurant has high ceilings, hardwood floors, leather seats and a ton of rustic charm.  The menu is limited and pricey. I wanted to order the ribeye steak but it was a huge cut at $41...OUCH! I then wanted to the lamb chop appetizer at $16 for only 2 chops. The chops were braised so couldn't be cooked medium rare. I finally settled on the wild boar chops with sweet potatoes. It was good but I'd rather of had a small size of the ribeye. The restaurant should offer two sizes of the ribeye.  I savored two glasses of full bodied red wine that complimented my meal. There is a flourless chocolate cake that I didn't safe room for but sounds delicious!   Service is good and not too stuffy. The hostess was friendly and multi tasked helping servers the entire evening.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "wCmJKSViblntvCqyCWuJQQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wCmJKSViblntvCqyCWuJQQ/o.jpg"
      },
      {
        "img_id": "nwleyfEPRNlV7avztUomhg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Wild boar chops",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nwleyfEPRNlV7avztUomhg/o.jpg"
      },
      {
        "img_id": "EOh2KUlEOfY9aNbgkrvcNA",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Chefs counter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EOh2KUlEOfY9aNbgkrvcNA/o.jpg"
      }
    ],
    "user_id": "8ue0RiV7NeEPQX07Q6rvlQ"
  },
  "FxvWBjMw09Wvg_oUraEEjw": {
    "date": "6/27/2019",
    "text": "Great restaurant and bar! Awesome service with suggestions right on the money, in other words, they listen.  Really good options for gluten-free food.  Love the atmosphere and if you are town for a convention it's a perfect location.  Definitely a must for locals and visitors alike.  Tip: you probably will want to make reservations Thursday thru Saturday.  They are closed Sunday.  A worthwhile opportunity for an enjoyable evening!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PngggKlYPgkzJAeqXaYTvg"
  },
  "V05luJKee12HkTrRkFjwCw": {
    "date": "8/3/2019",
    "text": "I wanted to like this place so much but the gnocchi with meat sauce was just okay. The space was nice, the staff was friendly and the bathrooms were clean. Unfortunately, I wasn't that pleased with the food. My friend ordered the meatballs sub for lunch and it was large and she seemed to like it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "C-_V41XXXNf-Vp8ZM3QNNw": {
    "date": "10/20/2017",
    "text": "The reviews on Yelp seem to be hit or miss - mine was a miss. The price point was unreasonable for the underwhelming food quality. We started with the margherita flatbread. Nothing really special, but I guess I can't complain too much when it comes to pizza. My main entree was the portabella sandwich, one of the two available vegetarian options. Aside from being pretty bland, it is very awkward to eat with whole roasted vegetables stacked between a (stale) ciabatta roll. The dessert made up for some of the disappointment. I definitely recommend the affogato which comes with a scoop of chocolate ice cream and an espresso shot poured over. So good!  Although the food was lacking, service quality was incredible. Everyone from the host to all the wait staff were extremely friendly and accommodating.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "sT_HzAPkeo3kyR4Hq_1BQw",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Portabella Sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sT_HzAPkeo3kyR4Hq_1BQw/o.jpg"
      },
      {
        "img_id": "-hwvbIm56yr8xnADQym9JA",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Daily bread appetizer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-hwvbIm56yr8xnADQym9JA/o.jpg"
      },
      {
        "img_id": "ksf5EER2McTF8m1HtnxBVw",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Margherita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ksf5EER2McTF8m1HtnxBVw/o.jpg"
      }
    ],
    "user_id": "6KUA3-IfHoAhQ3FL2djQoQ"
  },
  "Xp4TjD1fT5BVxrxhDY69_g": {
    "date": "12/29/2018",
    "text": "We randomly made a reservation for Talia so we could have dinner before the Pens game.  The staff is really friendly and the menu offered a nice array of options.  It is very traditional Italian and the cocktail / wine options were great to pick from.  We decided to keep it easy by each getting a pizza. A Classic and the prosciutto. Both came out hot and delicious!  We will be back again to try one of the entree's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JYyY6jrKz5eh1wkoSVAT8w",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JYyY6jrKz5eh1wkoSVAT8w/o.jpg"
      },
      {
        "img_id": "dwn5oJx5pYE0bSV860AbsQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dwn5oJx5pYE0bSV860AbsQ/o.jpg"
      }
    ],
    "user_id": "saNnorKm_XclY1sQ_zaBtw"
  },
  "iMocZu2uaRLnN9D_RXzfvg": {
    "date": "9/26/2018",
    "text": "Four of us stopped in for a late lunch having just arrived in Pittsburgh. We ordered small plate warmed olives and the roasted Brussels sprouts. Both of these were absolutely to die for good!  We also did a margherita flatbread pizza. It too was delicious. The ladies had a Sauvignon Blanc, I a Chianti and the other guy a draft IPA. All were excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IzEwwDUsgqWrcD80uowigw"
  },
  "QZaEJFtbdPTRnwiddghdGQ": {
    "date": "5/16/2017",
    "text": "Okay, I just left a porka-palooza meal at Talia Cucina and I think that I just completely clogged my arteries with pork fat!  I had to wipe pork grease from lips and make sure that no further evidence of porkiness existed on my face!  Just to clarify, I just came back from lunch at Talia Cucina with my usual lunch buddies and partners in food crime and we were originally going to order different sandwiches, pasta and pizza.  However, that didn't happen because we all decided that we would order the Spiedo \"Porchetta\" (Here, rotisserie roasted pork loin wrapped in pork belly with various herbs and spices) which was served with roasted red potatoes and a fresh herb salad.  We also ordered duck hash with polenta and a bread board which came with a spiced lardo (cured pork fatback with seasonings) spread.  Do you detect a pork theme here?  Honestly, everything was delicious.  The duck hash had pieces of duck, various vegetables, grated cheese and a tomato sauce on top of a bed of polenta.  I don't really care for tomato sauces, but this was delicioso!  Bella, molto bella!  The house made bread with spiced lardo spread was DIVINE!  And the porchetta was ridiculous!  My only complaint and I mean only complaint, was that some of the pork belly fat hadn't rendered or cooked enough so I had a couple of tough bites.  But considering that I received a humongous portion, that is nothing to really complain about at all.  My lunch buddies and I have decided that we are going to eat our way through the menu, so be on the look-out for an updated review.  One more thing, the ambiance of the restaurant is quite nice.  Somewhat intimate and not what I expected.  Sleek, rusticity?  And our service was excellent!  I can't wait to go back and waddle from my meal.  Word of caution, they don't take reservations for lunch, so go early!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5zf48SzBS8FtTrm5bGgwvg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Duck hash and homemade bread! Oh my!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5zf48SzBS8FtTrm5bGgwvg/o.jpg"
      },
      {
        "img_id": "PTyNH-ZfNk6R6AytI68SBw",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PTyNH-ZfNk6R6AytI68SBw/o.jpg"
      }
    ],
    "user_id": "hnVXeRIxCf6CQc1wcRx3tg"
  },
  "cFdn67fvZJ8DTegLZxXe8g": {
    "date": "7/18/2018",
    "text": "Pork on rotisserie drips juice on chicken below. Staff says \"its to add flavor\" Rude staff - servers are pretty much non existent and useless. I felt they have an attitude with any special requests. The staff behaves like the restaurant is a Michelin Star restaurant in a Ritz Carlton but that's far from it. They can't even deliver the food to the person that ordered it.  No consistency in the food. Visited the restaurant twice within a week, the first time the shrimp pasta was amazing, the second time it came out dry with no sauce, and raw shrimp!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2QEI8QQCQk1Og7l9F8F_Cw"
  },
  "5jW2nb9BUaIFXhFLtPq9bQ": {
    "date": "4/22/2019",
    "text": "Four of us had a nice dinner on Saturday night. Our main complaint was the noise level. It was so loud we could barely hold a conversation.  Our waiter was good at talking loud over the noise. We here we sat, the air conditioning would turn on and off, so we we're either comfortable or putting our jackets on. The food was ok. Just ok. We generally don't go back to the same place twice, so in this case, we wouldn't be missing anything.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yaF4uF4x_or-CiC5qK0-PA"
  },
  "SGpFk4gRlvrrDZ3rOFf80g": {
    "date": "8/7/2018",
    "text": "Stopped in for a quick lunch meeting. Treated quickly, given the option of seats. Ordered the quarter chicken with potatoes. Perfect portion with lemon drizzle sauce all over.  Very fresh and tender. Looking forward to return visit to try a few more menu items",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8Cm1tHkYaRHayp-ch4PaeQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8Cm1tHkYaRHayp-ch4PaeQ/o.jpg"
      },
      {
        "img_id": "qiogWi30fj8t_vzcqnu2lg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qiogWi30fj8t_vzcqnu2lg/o.jpg"
      },
      {
        "img_id": "7BZIk5IIwpsyeBu3wiDH0Q",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7BZIk5IIwpsyeBu3wiDH0Q/o.jpg"
      }
    ],
    "user_id": "JnC4Mba7FB2VStcnE6nIpA"
  },
  "vXjUUHAMAjtWxRvEB1ezTA": {
    "date": "8/21/2019",
    "text": "We started thinking that we were going to try for just appetizers, and base whether we were going to expand off of it.   The atmosphere of the place is interesting. I believe it needs to be redone to have a better use of the space. There are three speakers for the music to come out, and they are in a couple of instances, placed too close to the HVAC vents, so it causes bouncing. The lighting is as inconsistent as the artwork, and there's no real reason to put a vespa into a restaurant that is trying to be more on the upscale side of things.  The burrata and the octopus were off the charts good. Both were as close to perfect as I have had. Based on that, we ordered the gnocchi. Portion wise, it was good enough to share based on the double appetizer. It was just OK... when it came out, it was presented to us; however, we had to ask for Parmesan. The sauce was inconsistent in that it was a bit \"watery\" and had places where the acidity spiked. The gnocchi, itself was good; however, blending in a little something would have made it more upscale. The brisket was more of a pulled beef that one would expect in a stew, and not as advertised on the menu. I would have chunked the brisket, and taken advantage of the serving plates, and put it under a broiler after adding some cheese to give it a bit of a crust.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuIQFPcv3DrAvNiNYKG2Ng"
  },
  "jOVRB6nfErLeYC4cfHQP4w": {
    "date": "8/21/2019",
    "text": "Stopped in for a drink and appetizer during Happy Hour. The bartenders were extremely nice and attentive! Nice, open atmosphere with a good wine selection. During happy hour wines are $4 and there are select beers on special.  We went with a cheese plate which is pretty basic but I was not overly impressed. The cheeses were all a bit strong for my liking and the crostini a bit burnt. We ordered a side of bread because the crostini's weren't great and the bread was SO GOOD! I asked what the delicious dip that came with it was, and it was just salted butter! It was the creamiest butter I've ever had.  Overall, a nice place to stop. I would maybe come back for dinner however nothing on the menu really struck my eye.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eY8pzn82zhVO95vBi-mzkQ"
  },
  "XlfJ0DwkG8QUrcKgcgZWHg": {
    "date": "8/18/2019",
    "text": "We literally sent everything back. I felt bad because the AGM/server was so nice, but I'm not gonna eat a bowl of raw sprouts and artichokes just to be polite.   You could tell the sprouts had at least seen some heat in the kitchen, as the outer leaves were black with char. There was a little balsamic vinegar on them, maybe, and a couple of pieces of Macdonald's bacon but without the bacon flavor (I'm serious). However, you can't ignore the fact that you're eating a raw sprout. It's like work. The artichokes were raw, too. They had some strange congealed white sauce-looking stuff beside them, which also had no flavor...maybe some salt? No, nothing.   Anyway, raw vegetables are edible and very good for you. I even like a bit of crunch to my veggies. However, imagine sitting outside on the street in a lovely part of a wonderful city in the evening, having a drink with your loved one. The air is warm. It's early evening. The sun's reflection is visible now only on certain buildings as it sets. You're sipping on your chosen alcoholic beverages and looking into each other's eyes as you both crunch away on your mouthfuls of raw sprouts.   The ricotta stuffed gnocchi with brisket was tasteless. Seriously, it was like high school cafeteria beef in a canned tomato sauce poured onto the gnocchi. The gnocchi were not bad, but that's kinda like pouring a can of beanie weenies on top of a crawfish and calling it gumbo infused crawfish or something. It's just a waste of crawfish. You're not gonna enjoy it.   Sorry. Great location downtown. Again, the poor server/AGM was brilliant. Good place for a drink, but they need to fix that kitchen.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGL5TafxjejSmbCIQqyB8Q"
  },
  "yBjyu-yV88oQK_ji5TgY_w": {
    "date": "7/23/2019",
    "text": "My sister and I came here unplanned and we were delighted. The atmosphere was pretty cool, a very open concept floor plan where you can see the food being prepared in front of you. This place is a little upscale, but still very comfortable. I really enjoyed our waiter. He was really good at helping us pick our wine and answer any of our questions. Being a slight sauce snob (coming from an Italian family) I have to say I really enjoy my entire meal. Portions are a nice size and very filling. Please save room for dessert though. SOO good!  We would love to come back and try some other dishes. Soon Talia....Soon",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8kubqJvKMc7H-Km3dkT6MQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. mmm bread",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8kubqJvKMc7H-Km3dkT6MQ/o.jpg"
      }
    ],
    "user_id": "O2jZS1axr70qyXhjV3YPsw"
  },
  "9RrCvQ-X2b6K48IZ_eSm1A": {
    "date": "6/5/2019",
    "text": "This was my first time to Talia for food, the other times have been for their happy hour - which is excellent for wine!  My girlfriend and I stopped in for dinner before the symphony, and because we were unsure on time were the first ones in the door at 5pm. Oops. Either way, we were greeted quickly. Ordered a bottle of wine, Brussels sprouts, and bread to start. Since it is an Italian restaurant the wine list is weighted heavily Italian. I don't have a problem with that one bit. We got a nice mid bodied red for $55 that I thought was fair.   The Brussels were cooked PERFECTLY, and I love the way the bacon was presented. The bread was divine and it took everything not to eat it all.   For the main course I got the spaghetti with umi sauce and crab. Probably one of my favorite spaghetti dishes I have had since it wasn't just spaghetti with meatballs and a red sauce. The umi sauce was incredible and light, pairing spectacularly with the crab. Just utterly perfect. Thankfully being so light it allowed me to chow down on the whole thing with no regret.   I definitely would recommend Talia, for dinner OR happy hour. (Or both)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9cyhulwbGO9n8dk8fqZ-eQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Brussel sprouts",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9cyhulwbGO9n8dk8fqZ-eQ/o.jpg"
      }
    ],
    "user_id": "hZJW6xdEIaD-gVVRpxuvJw"
  },
  "oAvmco7EInD5P14ijVlgEA": {
    "date": "5/18/2019",
    "text": "Great, trendy Italian restaurant! Not your typical spaghetti and meatballs. They have pasta dishes, pizza (gluten free crust!) and protein dishes. Our server (who was amazing--friendly and helpful!) gave us a great recommendation of adding protein to a pasta dish. It was the best of the both words! I got the orzo with porchetta and it was very delicious. That combo hit the spot! They are known for their porchetta and I see why. It was very flavorful.  Another member in our party ordered the linguini with porchetta. Also very very delicious!  We ordered a bottle of wine (nero d'avola) and had cocktails (aperol spritz and rosemary thyme) as well. All were very good!  Ive heard others say this restaurant can get loud and I agree. The noise level did not hinder our experience though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FijzXhQQ4EW_kMAyveLMJQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Orzo with porchetta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FijzXhQQ4EW_kMAyveLMJQ/o.jpg"
      }
    ],
    "user_id": "qXH33niWN2UxVB-MueCNDA"
  },
  "mAk6EsexwpFTKe32qNqWYA": {
    "date": "4/29/2019",
    "text": "Stopped in here for lunch recently and was really disappointed.  I will say the atmosphere of the place is really cool.  Open cooking concept, modern feel, it has the potential to be a nice spot.  However, the food and the service were definitely below average.  Regarding the service, my group of 4 waited very long for our drinks and meals.  We were here during a non-peak time, so I am not sure what the reason for this was.  I usually have no problem with waiting however, so long as the food is good, but this was not the case.  The menu at Talia is extremely limited.  At some places that is a good thing, because you know every dish is going to be perfect.  Not at Talia however.    I went with the quartered chicken, with broccolini, and roasted fingerling potatoes.  The broccoli was charred and burned for the most part.  The chicken was dry and flavorless.  I had to squeeze as much lemon as possible on each bite to give some juiciness to the bite.  Very bad overall.  The potatoes were probably the best part, but the dish only came with 2 small ones.  The others in my group also did not enjoy their meals.  I doubt I would return here unless they would change their menu.  I don't understand how you can have so few options and not do any of them well.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U4QqQ1Y9GM1O7eKiajbbZw",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Quartered chicken.  Avoid.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U4QqQ1Y9GM1O7eKiajbbZw/o.jpg"
      }
    ],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "EcGQ4R73DgSvci2UC0OaPw": {
    "date": "6/17/2019",
    "text": "Happy Hour here is fun because they have decent discounts on beverages. Food here is ok. I mean sometimes that's all it is, just ok. Other times it's really good. However, more times than not it has been just ok. And honestly the food has been better at places that charge a lot less. I've been here for lunch and dinner and the sub-par quality that sometimes exists is apparent at either time. I have had dried out meats and pastas and it seems to me like the food sits and then is thrown in a microwave to warm it. If I wanted that I could just buy a can of Spaghetti-Os and eat them at home.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "ubA6pl81obQj_YQ6Rvli_A": {
    "date": "7/15/2019",
    "text": "Very nice convenient restaurant. Was staying at the William Penn Omni and this location is super close, We were in a large group and they treated us really well. The appetizers were fantastic - recommend the burrata and arugula salad. Make sure to order your ribeye carefully ours was over cooked. Great meal!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y2aKByHPOMaqkcLdXHBB-w",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Ribeye - a touch over done",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y2aKByHPOMaqkcLdXHBB-w/o.jpg"
      },
      {
        "img_id": "pt2Nuk7PWPkyRwyNuDcGOw",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Delicious meat balls!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pt2Nuk7PWPkyRwyNuDcGOw/o.jpg"
      }
    ],
    "user_id": "9dnYPZsMvfGcSadQFCGz9g"
  },
  "9T38MhxRwOJDRB9N0GnP7Q": {
    "date": "6/9/2019",
    "text": "I went to Talia with a large group of 12 last night so i was able to try so many things here! I honestly would lean more towards a 3.5 for this restaurant, however I think they were having a bad night with one of their signature dishes.  To start, we ordered the bread (I hate when you have to pay for bread.), brussel sprouts, artichoke, meatballs, cheese plate, olives, and kale salad.  All of these were really good.  I really liked the artichoke.  I would think about coming back just for apps and I LOVED how many veg options they had.  I didn't go into dinner feeling overly full.    For the entree, I got their signature pasta, spaghetti with crab and uni cream sauce.  Unfortunately, it tasted like nothing.  I tried adding cheese, so much salt and pepper, even the red sauce... and it just tasted like nothing.  It was so unfortunate that they gave us all free dessert which was nice.    I tried a number of different entrees, including the porchetta, gnocchi, risotto and cannelloni.  Porchetta was ok, I personally didn't love the thin slice and it kind of just tasted like limp bacon.  Gnocchi was pretty good and the cannelloni was delicious... they have a good red sauce here.  For our free desserts we again sampled a lot.  We got the flourless cake, sorbet, olive oil cake and salted caramel gelato.  Flourless cake was more like a donut, it was good, but nothing compared to the heavenly olive oil cake and the gelato.  Would definitely come back for both of those dessert!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cAvlJ-lvBywOjcG1FTC_7A"
  },
  "otId2ZpfLZgxaZcUI2P1uA": {
    "date": "11/24/2018",
    "text": "My family and I got hungry when we were downtown the other day, but we didn't know where we wanted to eat. We stumbled across this place, peeked at the menu, and decided we would give it a try. We went around 2 or 3 o'clock. It wasn't busy at all, so our orders came relatively fast. I ordered the classic pizza; it was a little greasy, but overall it was really crunchy and flavorful. I tried some of my sister's tomato chickpea tomato soup, and it was some of the best soup I have had in a long time. My mom ordered a salad, and she had to order extra dressing because it tasted like there was none on it. If I came here again I would stick with soups, sandwiches, and pizza.  We then ordered some cashew gelato and a piece of the flourless chocolate cake. The gelato was great; not too sweet and very refreshing. The cake was interesting. It was pretty dense and dry like most flourless cakes, but the flavor was a little off to me. They had some really awesome sounding desserts I wish we could have tried. Maybe next time!   Definitely give this place a try. The inside is very beautiful and well decorated. Prices are also very reasonable for such a seemingly upscale place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "i1qoqNkdsDLqWKtBM1y9Ig",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Cashew Gelato",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i1qoqNkdsDLqWKtBM1y9Ig/o.jpg"
      },
      {
        "img_id": "WNjoMKN_WQkyAKdfBfr_og",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Cashew gelato &amp;amp; flourless chocolate cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WNjoMKN_WQkyAKdfBfr_og/o.jpg"
      },
      {
        "img_id": "oXiqyWLJh03h9Twsvdz6tQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Flourless Chocolate Cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oXiqyWLJh03h9Twsvdz6tQ/o.jpg"
      }
    ],
    "user_id": "jhm1OR3WVUpk_hBTi4Fh3g"
  },
  "u1XfgguQxH58VqY1mhRMnA": {
    "date": "9/19/2019",
    "text": "Terrible experience.  We were a table of 12  - clearly too many people fo this restaurant to handle.  Server had to be tracked down numerous times.  It took 1 hour and 50 minutes to receive our food.  It took so long that one of our party had to leave before the food was delivered.  When asked about the issue, the manager explained that the food is cooked to order.  Yes - that is what restaurants do lady!  The restaurant was not busy....most tables were empty..so there was no excuse.  On top of that....food was marginal at best.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KjJ4TDmENSB5Z8kBBNkPMw"
  },
  "UUJvaxerZ4_bdBRV5Bb8RQ": {
    "date": "11/28/2018",
    "text": "We stumbled upon this restaurant while on a shopping trip downtown, and so glad we did! The atmosphere was really cool- awesome rustic/chic decor and laid back vibe. For lunch we had a roasted vegetable sandwich that came with a creamy tomato soup with chickpeas- the flavors were incredible (this was the best part of the meal!), a small pepperoni pizza, and a chicken salad. We all shared plates and loved everything. Of course we had to try some desserts- we had the gelato and the flourless chocolate cake. Both excellent! Planning on our next trip here to see what the dinner menu is like.. Our server was sweet and attentive and seemed really happy to be there- this always adds to a great experience!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Vjhms5sWt0oV9OIRQ_VcBQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Vjhms5sWt0oV9OIRQ_VcBQ/o.jpg"
      },
      {
        "img_id": "ffvcQh10YVFe3nzHftgVjw",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ffvcQh10YVFe3nzHftgVjw/o.jpg"
      },
      {
        "img_id": "GPCNgCUusfMRCflaAryo5w",
        "caption": "Photo of Talia - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GPCNgCUusfMRCflaAryo5w/o.jpg"
      }
    ],
    "user_id": "RDwjMJ-SB3ysZ1p0PRpQkg"
  },
  "h1x3-pKYrYyP7mXgooTkGg": {
    "date": "4/25/2019",
    "text": "Very interesting place  Beautiful modern Italian vibe  Pizza was a great last minute bite but the bread was quite salty  Also be forewarned this is a unique pizza .. kind of more Roman style  We got the margherita. The plum tomatoes and mozzarella and basil were proportionally placed on top.   The olive oil was BOMB  Price was $10 for a shmedium. Normal for a downtown place I think",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fk393wVRoykVCJN9SQnCvg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Margherita",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fk393wVRoykVCJN9SQnCvg/o.jpg"
      }
    ],
    "user_id": "NcYJYpzEqQEfpFTDj0wbGg"
  },
  "SR9RoETgVjMUdODh35s_Qw": {
    "date": "4/5/2019",
    "text": "While in town for a conference last month, my colleagues and I came here for dinner on a Thursday night. Unlike most of the other restaurants in the area which featured a 45 minute wait, we were seated immediately.   The dinner menu had a limited number of options, but there was something for everyone: pizza, pasta, chicken, seafood, etc.  I ordered the roasted half chicken with fingerling potatoes.  I was sticker shocked by the $21 price tag, but there was nothing else that popped out for me.  The chicken was very tender. Not quite fall off the bone tender, but a step above that. It was flavorful and juicy. The portion of potatoes was generous. These were somewhere in between crispy and soft, were well seasoned and tasty.  No complaints at all about the service. We had two servers who made sure that we had what we needed.  It's good, but pricey. So, the $$$ rating is justified.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VuTtLe5aochyGjxjN36IaQ"
  },
  "lmCe2uq7eezHSrR9EmlK-A": {
    "date": "3/11/2019",
    "text": "A great spot downtown. Made a reservation through Open Table. The restaurant space is nice, it's not too loud though it was about at half capacity tonight. The service was good. I started with the \"Thymes New Roman\" which was a gin-based cocktail, it was awesome. We ordered the bread which I'd definitely recommend doing. They told us they make the bread and pasta on site every morning. For my entree, I had the ricotta gnocchi which was very good, the brisket was perfect. It was a pretty big portion. A few folks with I was with had the porchetta which is one of their more popular dishes. I thought it was just okay, it honestly was a little dry. Someone else had one of the pizzas, it was fantastic (especially the crust). Prices are very reasonable. Overall, definitely worth a visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7zZzJALXLy5enZYkcbNfjg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Ricotta Gnocchi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7zZzJALXLy5enZYkcbNfjg/o.jpg"
      }
    ],
    "user_id": "0KhRPd66BZGHCtsb9mGh_g"
  },
  "kkAC4TyDD7ZRZMLvWHwQng": {
    "date": "5/27/2019",
    "text": "Decided to give Talia a try since it was pouring rain and we wanted to eat something before all the restaurants close for the evening near the hotel we were staying. We ordered a classic pizza, octopus and broccoli rabe.  We weren't impressed with the pizza. It wasn't the worst but it wasn't the best. It was underwhelming but sufficient.  The grilled octopus was average. The broccoli rabe was the best of the three dishes. The bar looked interesting but we were not in the mood to drink. Probably a good place to hang out with friends since the area around the bar is spacious. I am only rating Talia on their food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VeiL40Vy3uDDhWsjZawZbQ"
  },
  "sdUHmW0yTwwCg4bGmHeLqg": {
    "date": "8/26/2019",
    "text": "Great food excellent service and a relaxed atmosphere. Really glad we stopped in and had a delicious cheese platter while we indulged in local beers and then a super yum pizza. Great place to visit when in Pittsburgh .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SBejbYhot7JRQPFndVrIQQ"
  },
  "mjjmJm6xYuDhOxAORt3Jlw": {
    "date": "6/2/2018",
    "text": "After work a few of my friends and I decided to walk down to Talia to check out their specials. I am new to the downtown happy hour scene, just because I just started working downtown a few months ago. We heard some good things, looked at some good pictures, and then decided to mosey on down.   The happy hour specials are only in the bar area. So be prepared before you go there. You can get their full menu at the bar and there is a lot of sitting around the bar and a few high top tables near the bar that are included in the bar area. It does fill up, but if you get there early enough usually there are seats aplenty.  The bartender was super nice and suggested one of their Moscato's for me. I usually like a red wine but this Moscato was just what I needed for a summer day. And I am so happy with the selection because the Moscato hit the spot. It was a bubbly Moscato that tasted like orange blossoms. When he first suggested it I was like, well let's just try it. But honestly I was incredibly happy and it did taste so much like oranges and so refreshing that I got a second glass.  They're happy hour is half off glasses of wine. There may be more but I was only concerned with the wine. I kind of want to go back and try their food just because I had such a great time talking to the bartender and drinking my Moscato.  I look forward to coming here again, since it is just around the corner from work. And I would suggest that everyone goes in sits at the bar and tries they're half off glasses of wine. And remember the Moscato is a personal favorite of mine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "4mSZP2Sbq9XXnx1E37Isqg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. This Moscato! Get it!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4mSZP2Sbq9XXnx1E37Isqg/o.jpg"
      }
    ],
    "user_id": "-hietrA8M58asfpyJkCyiA"
  },
  "pDQJ2c9vutMOgeEcFUXQsQ": {
    "date": "6/11/2019",
    "text": "Ok, you know I just don't know what's wrong with Pittsburgh. I got the gnocchi and found them to be bland and unremarkable. The brisket sauce really needs something if you're not using exceptional tomatoes and meat, and these were not. Just something to spark interest, maybe a touch of fennel or a a tiny bit of nutmeg. Anything really. It tasted like it came out of a church basement potluck.   The bread was good. I personally think a good bread is tougher than a good pasta, but man Pittsburgh just sucks for food. It's a shame. It's worse than Ohio.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CnE7LJgUepMRnYI_ne79Tw"
  },
  "U1H_ct7d4FCVuZEaWdCn1A": {
    "date": "5/28/2017",
    "text": "Sunday brunch was so good from the coffee to the meal to the service! Definitely a good decision!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uke2WELXTaWaFZHEbTbmng"
  },
  "kG_FckyIa7UPK-dxZBHXGQ": {
    "date": "8/4/2017",
    "text": "Do not leave your homes to go to this restaurant! The place is nice but the food isn't worth.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZsftFohkB0VkuFxhvPvEPg"
  },
  "wFJ_DJZeNXFGksHEYA8iLQ": {
    "date": "4/10/2017",
    "text": "This is Pittsburgh's worst new restaurant- I could pick this place apart all day... All you need to know is that the server put our checks in her mouth while she was putting her hair in a ponytail",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lJVVvqs9nAa4v82EzR2Y3A",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Beef tartar with tendons in",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lJVVvqs9nAa4v82EzR2Y3A/o.jpg"
      },
      {
        "img_id": "mWhuR16vAIFI-G_4HwjggQ",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Duck hash",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mWhuR16vAIFI-G_4HwjggQ/o.jpg"
      },
      {
        "img_id": "V3ZHBAVv4u1LbB0lbb8Oeg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Fancy $20 alfredo with &amp;#34;strozzapreti&amp;#34; noodles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V3ZHBAVv4u1LbB0lbb8Oeg/o.jpg"
      }
    ],
    "user_id": "Go_8a1mBbAdyt5V87E1p_w"
  },
  "_b9xE-Bd-1bt8klfPG8Maw": {
    "date": "6/5/2017",
    "text": "This is for the newly established brunch service only!  Pros:  -$15 dollar bottomless mimosas. Please do not change or remove this as you continue your brunch service like most restaurants in Pittsburgh seem to do!  -I also caught a sneak peek of the personal bloody mary fixings that you bring to the table.. WOW -Service was pleasant and attentive, both the hostess and our server were great. -Flavors were good in the pasta I ordered, definitely felt homemade.   Cons: -Portion size was disappointing for the price point.  -The menu was limited, but I'm sure it will expand/change as they continue brunch service.  Overall, not my first choice for brunch, but a decent spot to check out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vQVnJkDlKOYhYJqX6v02AQ"
  },
  "X2iz6oW69XRYSyWIab1gYg": {
    "date": "11/26/2017",
    "text": "The theme here is rustic Italian, with rich pastas and roasted meats -- plus pizzas and panini for lighter appetites and budgets. The food is rich and robust, the pasta fresh and cooked correctly, and the service is terrific. The beverage program is a highlight: lots of interesting choices of wine by the glass, creative craft cocktails, and a big selection of amari (Italian digestifs). The one weak spot here is dessert - few choices and no plate of biscotti or cookies to go with your amari. Doesn't look like they have sprung for a pastry chef here. Otherwise, a gem downtown.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xTSXBvLlZM3G0xRSaQmdnA"
  },
  "MAiAbP3AQZVE3QjwQjlDmQ": {
    "date": "3/23/2017",
    "text": "Wine selection is on point and so far I've tried the pasta and pizza. Both were incredible. The owner really took his time explaining the menu and wine which was wonderful also. I'll be back often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "skqqYi4QNtlgIVMQKMT1eQ"
  },
  "ZLHPFRytic1aQ6YEQpm8nA": {
    "date": "7/12/2017",
    "text": "This lovely corner spot with its big windows, open and airy comfortable design and open kitchen is a welcome addition to Pittsburgh's downtown dining scene. With a rotisserie, pizza oven and varied menu that specializes in meats every bit as much as pasta, it's anything but a typical Italian restaurant. The pasta dishes seem rustic in nature and like almost everything else on the menu, the restaurant has clearly made it a goal to offer some menu items or twists on items that you don't find elsewhere in the city. It also offers some interesting cocktails and a nice, interesting selection of wines by the glass, that again seem to be attempting to offer items that diners won't find elsewhere in Pittsburgh. A few minor, yet very odd flaws kept it from scoring a perfect five star rating. While our server was both efficient and incredibly efficient, her mention of dessert and description of dessert items as we were in the middle of eating our entrees was a definite \"first' for me. The Cheese Board is advertised on the menu as \"a selection of imported cheeses\" but according to the person who delivered them and introduced the three cheeses, all of which were of good portion, they definitely weren't all imported. Truth be told, I'd prefer local cheese, the presentation was lovely and the cheeses delicious, but I'd also prefer that the menu isn't misleading. The third and final flaw worth mentioning was the Primavara Salad. Consisting of dandelions, watercress, avocado, asparagus and grapefruit vinaigrette, it should have been amazing, but it screamed for a dressing with a little more flavor and zip to bring life to it. Hopefully, the wrinkles will get ironed out and Talia will become a staple in downtown dining.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rnaFhcCvQyLbSZk0Eflitg",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Strozzapretti with grana padano, parma butter and pink peppercorns.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rnaFhcCvQyLbSZk0Eflitg/o.jpg"
      },
      {
        "img_id": "5qN7LUOeckJ3xS02tcBD_Q",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Primavara Salad with dandelions, watercress, avocado, asparagus and grapefruit vinaigrette (with unadvertised pieces of grapefruit in it).",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5qN7LUOeckJ3xS02tcBD_Q/o.jpg"
      },
      {
        "img_id": "ZRO7vc6T4iZ1F4_slc9pog",
        "caption": "Photo of Talia - Pittsburgh, PA, United States. Cheese Board - on menu as a selection of imported cheeses, but not all were imported.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZRO7vc6T4iZ1F4_slc9pog/o.jpg"
      }
    ],
    "user_id": "IlRmNuOSy9HMoxMMa6zhbg"
  },
  "7uLeDNJ4rg2inyQz8LJ7fw": {
    "date": "4/29/2017",
    "text": "Walked in by chance and really enjoyed this place. We sat at the chef's bar and we were treated to samples of the porchetta and steak tartare. Both were divine. We shared the Italian salad and had the pizza Italiano and the sardines special. Everything was excellent, beautifully served and with wonderful flavors. Will definitely return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lfKn7a6svrDEv37tSyVl7w"
  },
  "HdppZCZNlqM_JQ-SKYb78Q": {
    "date": "3/31/2017",
    "text": "Went for lunch with a friend and we each ordered a pizza. They were exceptional; we'll be back again for dinner",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "njF4gNa5yhx4myVBn3fqgQ"
  },
  "LQy4Wf_CeuEqQJvkhmrH6g": {
    "date": "3/26/2017",
    "text": "It is loud.  We spent most of the time yelling to talk with each other. The wait staff was very friendly and helpful. We paid $60 for a $15 bottle of wine. I don't mind a markup but thought that was extreme.  The meal was not well paced. Our entre came when we were half way through our salad. I don't know if it was due to the inexperience of the waitress or if they were rushing to get us out to open a table. The  porchetta was highly recommended. It was tough and fatty.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ijmRTuVNQQ_S_DjNxO1Q1A"
  },
  "MED086Z2YvykkbuXRsONZg": {
    "date": "3/22/2017",
    "text": "At the onset the menu sounded great, when our orders came we were served with a smile from the very kind waitress, and the tasting began.  The plates seemed too small to house the severely crusty bread sandwich smeared with oil and pesto.  It was very difficult to bite the sandwich it was so crusty, so I tried to cut it, that did not go very well.  I ordered the rib eye ($14.00) it was very fatty.  I asked to speak to the manager as I could see she was making her way around, but did not come toward us.  I would have ordered a different sandwich at that time.  After some time, she came over and I expressed these minor concerns, she explained how they cut the meat from the roast, and sometimes it has fat to preserve the flavor, ok?  Then I noted they piped in Jimi Hendrix music on the speakers, at lunchtime, people were talking very loudly to converse at their tables.  We paid and left.  I was discounted $3.50 on my lunch tab, but not told by the manager, I did send a thank you from me via the waitress.  I don't think I will be coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y_Z79IzC-R-BDtqjOikmVA"
  },
  "zXXWk9GpLE-KMGufqOKc0w": {
    "date": "5/29/2017",
    "text": "For a girls' Saturday night out, my friend and I decided to try Talia because we had heard tge food was pretty good. It started out pretty good-- we were seated right away; the hostess even got me a new menu because the one she originally grabbed was smudged with a little grease; we got our water....and then we sat. And sat. We weren't even given a drink menu upon being seated. We tried to get the waiter's attention but that didn't work. We even tried to get the hostess' attention to no avail. Three other couples sat after us, and were promptly greeted by the waiter, given the rundown of the night's specials, and drink orders were taken. Still we sat. About 20 minutes had passed before anyone had even acknowledged our presence--other than the young man who brought us water. By this time, we had lost our appetite for any food this place had to offer. We gathered our things and headed for the door. When the hostess saw us, all she said was \"Leaving?\" And when we explained what happened (that we had been sitting there for a long time without service, while others seated after us were already served drinks), the hostess simply replied \"Oh, that's too bad.\" !!!! No \"I apologize, let me get someone right over to your table,\" nor \"Let me get the manager to speak with you.\" Nothing! I have no idea how the food tastes because we didn't even have the opportunity to have a drink. They won't have to worry about me walking through their doors again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FifUZGQ6otnYk4w3BaWH0Q"
  }
}