{
  "P3QTgtt-0iqrPxmUhrQDDw": {
    "date": "8/16/2014",
    "text": "Im not from the Pittsburgh area so when we found this place on yelp it sounded pretty good, until we actually got there. It was literally a shit hole. A building on the corner where people go to shit! First it was the service. Some dick with slicked back hair wouldnt even give us a menu. He said todays our crab specil so im guessing youll both be having that. So i argued until he gave us menus. Second, Anyone who says the wings are the best obviously has never eaten anywhere but there. They were undercooked and nasty. Third was the beer. Yeah im sure some of the endless amounts of types are good but my simple miller light was warm and skunks! My advice is DO NOT GO HERE!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Px3xWBolVLFWvpTHllBAvw"
  },
  "stDas2Pd_tPh0pbnSouqsQ": {
    "date": "4/6/2014",
    "text": "Sidelines is stuck between two identities, being a neighborhood bar and a trendy spot. With being said it navigates those waters better than most. The winds are what they are widely known for and for good reason, they're excellent! However their selection of great craft brews and the staff's knowledge of them is really worth noting and excellent. The only reason I don't rate the place as five stars is because it can be a little on the pricey side especially if you are not mixing in a few domestic brews into your night out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qlGJaaHMxRLBYQyMLHk1YQ"
  },
  "7JMvCS_1LpMOMkExObXGsQ": {
    "date": "10/26/2013",
    "text": "Other than the service being a little slow, I have no complaints since the great food makes up for it. I ordered off the Oktoberfest menu, which they may be done with now, but anyway, I had a bratwurst sandwich that was dynamite. Darren and I shared sweet chili wings, a stuffed pretzel with cheese that was like a grilled cheese sandwich, and the amazing funnel cake fries. It seems like a dive bar at first, but they have excellent eats! Recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7AGLlj5YzqdBfCPiZCa1mQ"
  },
  "dT5ziAlEgeXR3sDi_X71Aw": {
    "date": "7/18/2014",
    "text": "Ok so I come here ordinarily as they have an excellent cider selection. Today I came in and they had just that. However, that is where the bad experience started. There are 4 bartenders on. I am typing this as I sit at the bar.  The 2 guy bartenders are pleasant and out going. 1 of the female bartenders acts like she only sees regulars.   I order a cider and hand her my  credit card and say to open a tab as I am ordering food.  She takes my card and leaves my cider. .doesn't leave a menu. Doesn't even look my direction for 15 mins. It was another bartender who asked if I needed something.  Then I ordered the cheese dip. Normally comes in a delicious bread bowl.  Instead it arrived in a Styrofoam container with not enough bread for the dip. I also ordered 6 wings w/ ranch. The wings came out way ahead of the dip (odd right)?  The ranch never arrived at all. The other 3 bartenders made up for the  one bartender's lack of interest in new customers. Sadly, this is the 3rd time this has happened w/this bartender. Think I may have to try another establishment..which is sad as they have great drive o and food selection:(",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UccYaDFeylbRPDY82jxVEQ"
  },
  "-HLCRcNZ8DcgwkVXyaZizQ": {
    "date": "10/25/2014",
    "text": "This is such a fun and unique bar. The wings are AMAZING! And the selection of beers is second to none. However, the service is complete and utter crap. I recently went to this bar and got a Guinness that was on special and I tasted it and almost spit it out, it tasted like straight gasoline! I told the bartender about it and she proceeded to argue with me that I didn't know what I was talking about. I couldn't finish the beer. Guinness for the record is my favorite beer. She proceeded to ignore me and my group for the rest of the night and we had to ask the poor food runner to get out checks for us. Needless to say I will think twice before ever going here again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lvHdRq5w06aDCLhSIHDslg"
  },
  "IX0-uEwXzQ2otg7nNHVGTw": {
    "date": "9/20/2015",
    "text": "What a find this place is.  Four of us meet there for their Sat. Special of all you can eat crab legs.  For $20 you get all the crab legs and fries you want, and it includes this wonderful salad with field of greens, onions, shrooms, tomatoes and peppers.  Shout out to the kitchen staff - Every round of legs were perfectly steamed, a hard thing to find around here.  We never had to wait for a refill of legs, and the table was always kept clear.  The staff last night rocked the whole meal.  Can't wait to come back and try the wings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U0XH9auOPoH7HOGeaZH4UQ"
  },
  "f4L4efrfackMpNZYpJIWKA": {
    "date": "7/17/2015",
    "text": "Best wings in Pittsburgh, Great specials. Service can be rough at times but the wings and prices make this my go to wing spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9k-mUUgRscnQvn1_G7efLQ"
  },
  "5fssF6IZkdNcjfT5a2dtPw": {
    "date": "6/25/2015",
    "text": "Totally love this place! The service can be a little slow...but what do you expect from a dive bar? We do saturday lunches here, and always get their cheese dip (in a bread bowl?!?), the Pittsburgh wrap, and some of their amazing cupcakes. We rave about Sidelines all the time. Great prices, great beer selection, food is A+.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-bRlE4by_0vgF4evB9CUjg"
  },
  "M7N8atwavXj9JoteBB-f8g": {
    "date": "11/13/2011",
    "text": "This is one of my favourite local bars, the beer selection is more than adequate and there generally is a decent special to be had. The ambiance is nothing special though I will say that they have upgraded from the stuffing flowing from the bar stools look, and have upgraded to new stools and a better overall feel. I can't say that it made a huge difference to me because the beer food and service are the real selling points. Though, they are admittedly swamped on wing nights, which negatively effects the service on the whole the bartenders there are awesome, and give you the feel that you are a regular with even a somewhat regular attendance. The food, even though it is pretty normal bar fare, is top notch in the way of quality.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "15tAFpe3XFUSqS9uRjie8w"
  },
  "o5d0E25sMpDZAvaoQbksbQ": {
    "date": "7/4/2013",
    "text": "The wings are good, great beer selection but the all you can eat crab legs are my favorite!! Only recommendation is get rid of the thick fake butter and use clarified. :) will be back sooner rather than later.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vWvl4OLzXiDbyKIqUljeOQ"
  },
  "KaruIRWARYd9daG4SagKHA": {
    "date": "1/29/2011",
    "text": "Hands down, one of my favorite bars in Pittsburgh. They have a vast beer selection, decent prices, and good food (especially for \"bar food\"). Their wings are some of the best in the city, and you can't beat their Wednesday night wing specials. It's not a fancy place by any means, but the drinks are cold, people are friendly, and there are plenty of TV's to watch the games.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IsN-TIcru-yjB8YcIQ84DQ"
  },
  "iYpjrSdK_OS_azVcXek8TQ": {
    "date": "12/18/2015",
    "text": "This place be BAWLIN' YO!  Wings that be outta this world!  I tasted one and was like \"WHAAAAAATT!?  Don't even play with me spicy oriental!\"  Mean chick workin' the register tho--wouldn't let me get them digits or let me holla. I was like \"please u ugly anyway.\"",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "43VjxOlcnjtfI9ht7pfWRA"
  },
  "Km8pYYhPxma-XHdUOl96xw": {
    "date": "5/31/2014",
    "text": "Great beer selection great food lots of specials pretty much every day. Fairly inexpensive,bartenders are very nice.   I'm a big fan of the build a burger night 5 or 6 dollars and you can have all the toppings you want on it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JSFayCcQmOJcXzvY11sPZA"
  },
  "y0m8K_My_ZC4DJIc_G4I5w": {
    "date": "8/9/2015",
    "text": "Maybe a new cook, but the wings weren't great. Sauces seemed different, the PB and J sauce was basically a jar of PB on wings.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QkVR0AXtEdIc1IAbLY5scw"
  },
  "9W2GC9Z7roldxMImR-AK1Q": {
    "date": "12/19/2012",
    "text": "Extensive beer menu and terrific prices. I had an amazing stout (bottle) from Sri Lanka - Lion and it was only $3.50!  Some places charge that for a Coors Light.  Great wings. Loved the dry rub. The bar is nothing fancy, in a nothing fancy neighborhood. But very friendly and hoppin'! Wings night is on Weds but really, a dozen wings are $6.95 regularly so go anytime!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "nOcP-0PIg4REFX4JeR49aw"
  },
  "vjUre3w3_9KS83j-SWXopg": {
    "date": "4/3/2015",
    "text": "I don't know what it is about this place but I love it. The atmosphere is nothing special and the food is your typical bar food but the beer selection is great. I love a place that offers a beer club; Something to work towards and something to make me try more than just my go to choice of blue moon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SKre6GKJAA3FLgb2e875Rg"
  },
  "vh8Sye2oIdHtSXPcQC_Yvg": {
    "date": "4/18/2014",
    "text": "Great beer, wings, and friendly service! What more can you ask for in your neighborhood sports bar? These guys always have tasty food, more than just wings, and an impressive selection of draft and bottled beer. I appreciate the rotating draft selection, which adds variety to the menu and gives you a reason to keep coming back.  They have plenty of big screens so there's not a bad seat in the house and they will always have the Pens, Bucs, or Steelers game on. With no smoking in the bar, it's a great place to catch a game.  Don't forget to ask about their cup cakes!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VMF7pdnU1ffay66SNljadw"
  },
  "EawjTJxmJqBIU8H8D_o0Nw": {
    "date": "2/6/2014",
    "text": "Great wings, awesome burgers, amazing beer selection, friendly waitstaff. True, you may have to wait a bit when it's busy for food, but it is absolutely worth the wait. Of the several dozen times my husband and I've gone there for dinner, I can recall maybe once where one of our burgers was slightly overcooked.   The portions are plentiful and very reasonably priced. It's a typical neighborhood sports bar, so expect some noise or crowds if you're there during a hometown game.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1z3rzcQwuN2p7nGVZCuN0Q"
  },
  "As9Mw8uBfiwcISDVXp-k2Q": {
    "date": "9/4/2014",
    "text": "I heard sooo many good things about this place. I was truly waiting for a let down. It did not happen. Rarely in my world does word of month work this well. The wings were great! The salad was cold, and fresh. The service was quick, friendly. I fully endorse this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cpk_uJGVUtnhLEQHxbLuhw"
  },
  "5hbcn1h-BHCHPZJxqq3O_w": {
    "date": "6/29/2012",
    "text": "One Of my favorite bars in Pgh:) they have a wide variety of beers on tap and there is always specials running everyday of the week... Appetizers are delicious, burgers are well stacked and sum pretty yummy wings! you can buy the sacuses for the wings which is amazing!! I recomend the teriyaki or the honey BBQ wings!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0l9V2VrhdWDgNR-7TpSAdg"
  },
  "6bgzcV-PLRQ59hVVk-NL8g": {
    "date": "8/13/2013",
    "text": "Excellent place for Wings, Burgers or even a fancy flat bread.  The beers flow and the people are all friendly. I love going to Sidelines to get my favorite food WINGS! They make the best Wings, and are always creating new sauces.   The staff is super friendly and knowledgeable of beer!   Oh and the all you can eat crab legs are amazing at Sidelines!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "00I7ls3YJA6vgvsK-Bwekg"
  },
  "O4PM31rXfS1ViF6vCOEfiw": {
    "date": "9/7/2011",
    "text": "If you happen to find yourself in Millvale you will also find yourself surrounded with more bars than you know what to do with. While the population isn't quite outnumbered by bar stools, it's surprisingly high.  Here's why I think that you should pick Sidelines as your go-to Shaler Township bar:  - The beer list is extensive and reasonably priced. The specials can't be beat, like $1.50 pints of Yuengling on Saturdays. - The friendly bartender (yes THE, we believe he may be there the majority of time) introduces himself as Seabass. Seabass is the man. However, please do not ask Seabass or any of his coworkers for a cocktail more unusual than a typical \"and\" drink (jack and coke) or \"woo girl\" drink (long island iced tea). This isn't a \"proper cocktail\" crowd. - The bar food is actually pretty good. The fries are delicious and $3 for a basket. We've seen their good-looking deep-fried deserts too, but we can't vouch for them. If you don't like fried food... well, I think I saw something that sounded like a salad on the menu. - Unlike most divey sports bars I've been to, the women's room was surprisingly not at all scary or particularly gross. Winner!  Sidelines is really a small community sports bar, and that may or may not help its case. This is where I take my friends, not to impress them, but to share comically large mugs of good beer with them for shockingly cheap... and a few baskets of fried bar food.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "6CoMpwA8D2s00RfzpKDuOg"
  },
  "SHOLdDUSJmVlVH5tY2Kecg": {
    "date": "9/22/2011",
    "text": "Nice little hidden gem in Millvale. Excellent beer selection, friendly staff, and great food.   Sidelines was voted as having the best wings in Pittsburgh. While very good and quite possibly #2 on my list, but not my #1 in the city. They have a big list of wing sauces to choose from, the wings are meaty, and reasonably priced. Mr. J thought they were a little over-sauced and messy, but some people like that!   The beer cheese dip is amazing! A big breadbowl full of gooey cheese - you can't go wrong! I also had the fried zucchini. Holy zucchini, Batman - they were huge and probably about 10 big planks in the basket.  Sidelines is small, but was able to accomodate our group of 7 - we had a great time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0Tkq4VV8dD6t8NbBxvBPA"
  },
  "KNsNHpHfc3fxVBBGlLUe4g": {
    "date": "4/24/2013",
    "text": "The reviews for this place are clearly fake and written by the employees. We tried the \"famous\" chicken wings and can only assume that tasting like buttered feces is their claim to fame. You are hereby warned.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "nIYR3jFQQszLM-oJV0YTjw"
  },
  "vqBrUrvjJjwFAILAtH5EVg": {
    "date": "12/21/2015",
    "text": "Great wings, I had the hot garlic ones. The fries were kind of greasy and soggy or I would have given this a five star. Pretty chill place to watch the game.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NyX5Vh36oCc-FkJPjBLMSg"
  },
  "Iu2nfyinttLAry-j7ndc7w": {
    "date": "3/5/2016",
    "text": "I came here for the wings, but the cupcake of the day stole my heart!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kBI4s2cKUoEivIMwQfhzwg"
  },
  "EHgI3wFckfWVHQx9GCbo0A": {
    "date": "6/19/2014",
    "text": "When my wife and I stopped at Sidelines I expected just what most would; a small Millvale bar with a local crowd. The crowd was local, but very friendly. What I didn't expect was that these guys lived up to the \"Best Wings in Pittsburgh\" title bestowed on them by WPXI. The signature sauce is fantastic! Seriously killer wings! My wife had a pulled pork sandwich which I was glad to finish for a midnight snack later that evening. The only reason Sidelines isn't getting five stars is because of noise. The place was clean and service was prompt and concise. Make sure to look for Meredith for your server and you can't go wrong. Go... Eat wings Now! PS Wednesday is wing night; wings for .35 each, yummy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0mvmbhiUfeTMVsUmvBqHxA"
  },
  "hWy95PiNvBGTgwCQWKV2BA": {
    "date": "5/1/2014",
    "text": "Best wings in the 'Burgh hands down. Always a great selection of craft beer on tap. The staff is very friendly and helpful. Try it---you'll like it!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2OmuT7IsUbvCpHLfyra7QQ"
  },
  "U1YnrpOEjbA1sboL7UGH-g": {
    "date": "2/19/2013",
    "text": "Friend: \"Where should I get wings from?\" Me: \"I've heard Sidelines is good but I haven't been\" (2 hours later) Friend: \"Got wings...MMMMM SOOOO GOOD\" (2 days later) Friend: \"Last night I dreamt about those Sidelines wings\" (2 weeks later) Friend: \"Wanna grab lunch at Sidelines?\" Me: \"Yes! I need to try their wings!\" Friend: \"BTW just had them again a few days ago\"  That was a real text conversation with my friend who is now addicted to Sidelines. And, real talk, this divey yinzer bar has taken the crown for best wings in Pittsburgh. At least by my standards!  The wings here are smaller than at my longtime staple, Fat Heads. But what makes them better is their insanely crispy fried skin. I've been longing for a crispy wing that isn't dried out, and this is IT. After crunching into the skin you experience a mouthful of moist meaty goodness. The textural contrast is perfection. Choosing a sauce is difficult because they have so many interesting options, but I went for the honey sriracha. While I liked it, I wanted more heat--next time, I'm going hotter!  Not to mention, these wings are dirt cheap. At $3.50 for six, the size of the wings hardly matter...just order more if you're still hungry! I'm totally surprised this place doesn't have more reviews. If you love wings, or even if you just like wings, you need to get here ASAP.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zFCuveEe6M-ijY1iy23IJg"
  },
  "0l6RhGK78U5wmUiqfnQpow": {
    "date": "3/18/2012",
    "text": "Their food is SO GOOD!! I've never been disappointed. They have domestic and imported beers which is always a plus and they always have the game on....whatever the season. The people that go there are friendly (though a little....interesting) and the bartenders and waitresses/waiters are fun. Parking is sometimes hard to find and the bar is usually crowded but it's worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sn7vLdkthTVE7qiYLZV6MA"
  },
  "HCU5xvzwey7hK2O7bWVjgg": {
    "date": "3/9/2014",
    "text": "Sidelines is a wonderful. A HUGE selection of beer to choose from. Drafts and bottles. The food is also really good. Everyone I dined with enjoyed their meals with no complaints. I ordered a black bean burger and it's served with kettle chips and sirachi ranch sauce. Would recommend for dinner and drinks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XO0UOJGgcm6cx3xKnXBdMA"
  },
  "K0RMScq6Z47-wsuthBelqg": {
    "date": "8/28/2016",
    "text": "My wife and I with another couple went in about 9:15pm last night, there were people but not 'crowded'.  Saw an open table by the front window, walked to it and saw it needed bussed.  Waitress came over, bussed it and with an attitude said \"there's seating in the back too\" (not that the window section was closed as there were people at every other table). We sit down after she wipes the table.  Watched the other tables get served/checked on and never stopped to even bring a menu or ask about drinks.  After 30 minutes of absolutely nothing we left.  I guess you have to be a regular and not someone new trying a new place to eat/have a drink here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "jYLNp-T4Xc6RhV4EJWq9WA"
  },
  "1L5bHgaLnqDSD5CAKZiq-A": {
    "date": "6/10/2017",
    "text": "A great place in millvale to grab a beer. They have a great selection of beers on tap and a huge selection of beers in bottle. Really enjoy their wings but I've been being brace and trying a few of their other menu items and have been quite pleasantly surprised. Friendly service that actually knows about their food and beer which is nice when you are looking to try something new to drink/eat",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oRkWd-xJpVY5X5z78dfF8g"
  },
  "k-OtEz0nuikBJN8HE9k0tw": {
    "date": "10/12/2015",
    "text": "Went to Sidelines on a recent Sunday night for their weekly trivia (at 8pm) game. I had heard that they served up some solid wings, so I was intent on ordering a dozen for dinner. Ordered 6 of their house hot wings and 6 honey mustard sriracha. They were delicious, fat and cooked to perfection. Dipped those baby's in some blue cheese and popped them into my mouth! Between Big Shot Bob's House of Wings and Sidelines, it's definitely a toss up for who serves a better wing. I wasn't too thirsty, but threw back a couple drinks including, Unibrou Blanche de Chambly and an Angry Orchard cider. Total came to around $20 and change.  Aside from the food, this place was pretty nice except for the smelly bathroom. It smelled horrific. Hopefully it's not like that all the time.   Tip: On Sunday night, a dozen wings is $4.99 if you order the same flavor. Otherwise, expect to pay a bit more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dRTZgTVahakFKkQJdyDX4Q"
  },
  "ysl73JoF-x1Unm_Oud0YTA": {
    "date": "8/16/2017",
    "text": "If it is even remotely busy you'll be waiting 40+ minutes for your food. It's unbelievable that they have a lot of tables but such a small kitchen. You have to go there during off hours when the food is subpar. Overpriced for what you recieve",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "KZBlUvyzm_3oM27BMNhPOQ"
  },
  "P1e8uQ7zH8jZrpINbJlrPA": {
    "date": "10/5/2015",
    "text": "The wings at Sidelines really helped it go from a 3 star review to a 4 star in my opinion. I recommend the medium garlic barbecue sauce. It sounds like a lot mixed together, but it's delicious. In fact, I haven't had a sauce there I haven't liked. I've tried a few of their appetizers, the salad, and a veggie wrap once, and it was all good.    The bar is average size, with a table area and a row or two of booths in the back. It could use some general repairs, but overall it's clean. They have a nice beer selection on tap and a beer club which sounds appealing for locals, but intimidating to me lol   The staff is friendly and attentive without being too pushy, when you ask them to recommend a beer, they take their time and really help you choose one you would like.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yo0a5UXcvWt_WxPF_lgiag"
  },
  "yZFqnT-A_HX8G6HvCvBUMQ": {
    "date": "1/2/2016",
    "text": "Best wings in Pittsburgh! I mostly get wings to go but it's always really fast, about 20 minutes from the time I call and I pick up the wings super hot and fresh, The dry cajun is a staple and defintiely worth getting. The Pittsburgh wing festival this past summer opened my eyes to their buffalo ranch, which is a great mild sauce. I was a little disappointed that the Fit to be Thai wing wasn't spicy at all but it was still really good.   I haven't eaten here in a while but their wing night is good, just super crowded. Service is quick and prices are low. They also sell their wing sauces, which is awesome. Can you tell I am obsessed with their wings?   Definitely worth checking out for all of their food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6djyuTKCGCJHMk79AeiFYg"
  },
  "t2P5uND8zjfdwF2k5hgm8Q": {
    "date": "3/1/2014",
    "text": "Went here around 12 in the morning after work with the promise of wings to get me through the night shift.   Their selection of wings was insane, it took me forever to decide, and actually I never did - my friend decided for me. We got the garlic parmesan and the medium bbq wings and were pretty satisfied. I actually liked the dry rub a lot more than the sauce.   The only downside? Be afraid of the grease. The dry rub wings were creating a little puddle of fat and the bbq wings were swimming in sauce. I'm not a huge \"drench it\" girl, so I was a little put off. Otherwise, be prepared for some glorious wings!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BkMqpJikNc3r5itc-ui6ww"
  },
  "rqdbjJZ8lm0FzqkLxMn1gQ": {
    "date": "3/2/2013",
    "text": "After catching a comedy show at Mr.Smalls my boyfriend and I went into Sidelines for wings.  We caught the tail end of the Penn's game and even though it was ending our waitress still gave us the game day wing special.  A dozen wings one sauce for $ 5.00 eat in only.  We also ordered the honey Cajun wings to go they were $6.50 for a dozen.  The wings here are insanely good the garlic parm wings are made with real garlic not garlic powder.    It should be noted that Sidelines has over 30 wings flavors including Sriracha hot wings.   The service this time was like night and day compared to what happened the last time I tried to get served here. It's hit or miss on service but the wings are damn good.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "konNRfmbMWLVTf4_wpsZBQ",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. Over 30 wing flavors",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/konNRfmbMWLVTf4_wpsZBQ/o.jpg"
      },
      {
        "img_id": "7U1f7imI0SOTPTbSZdhKPw",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. garlic parm wings",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7U1f7imI0SOTPTbSZdhKPw/o.jpg"
      }
    ],
    "user_id": "V7uS5US4oTf-S9u36HJQCQ"
  },
  "SchyOPBCjsU_5XRHHUyuiA": {
    "date": "2/12/2017",
    "text": "Had great tacos and my husband had wings which were also very good.  Limited tap selection but great bottle selections from all over.  A lot of people were calling about their crab legs which they don't do anymore.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MfLW6qgg3LfLzsh9K5ZjYA"
  },
  "vvqye59GI9dvcoMW4H-rWQ": {
    "date": "11/22/2016",
    "text": "Found via Yelp and beyond happy with the results. Great service, wonderful food, good prices. Kudos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XLKrjFNvnUhWj-UbmFvd7Q"
  },
  "6Rkvjf0xvmPGxCQMg5_ikw": {
    "date": "1/31/2017",
    "text": "Painfully addicted to the wings here they are pure perfection.  The sauces are amazing.  The beer cheese is so good.  Great selection of beers although I'm a miller light girl.  It's also very family friendly they have a little back room with a big screen TV and we take our baby there with us often with no problems.  I would love to eat here all the time but my waist doesn't appreciate it!   Love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kNMtMMIKtiyx1eBnizH3cQ"
  },
  "KEOK_bCWJs2L3qkzHojt5Q": {
    "date": "3/23/2016",
    "text": "This place used to be our go to bar, I'm not sure what has changed. The last three times we have gone the service and wings have been terrible . I don't think we will be back .",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "lr4Fvhd-EEd5HSk82s60yA"
  },
  "nbwSNoWci9rWsXqP9bZ24A": {
    "date": "8/20/2014",
    "text": "It's not that their wings aren't great. Because they are. It's not that their food isn't good. Because it is. I can go on about how they have a varying and eclectic beer selection but I'd have to point out that they are EXTREMELY overpriced for most of their drafts. You can find much of the same drafts throughout the city and even downtown for MUCH cheaper.   And then there's the service.... Oh boy.... I guess if you're in the \"click\" and you are BFFs with the staff it may be a different story, but every time I go there it's a struggle to get anyone to acknowledge me. I'm not asking for a lot - simply a nod, a smile, a \"I'll be right with you\". I'm in the industry and I pay attention. Unacceptable. You lost a customer tonight. Maybe that matters to you, maybe it doesn't. I can guarantee my friends and I won't be coming back any time soon. Too bad. But then again, I can find similar wings elsewhere and, when it boils down to it, that's the only reason I ever came.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "pmnhXavpIPdd3DqyGPuomA"
  },
  "HWsIxbCiTBYtZaNHP8MOKg": {
    "date": "6/7/2015",
    "text": "Sidelines is definitely the go-to spot for wings in the city. I took my wing loving husband here because he just moved here for the first time (I grew up here). He was very very very happy with his ranch buffalo and hot garlic wings. The service is rather slow and the place is very simple, but it's worth the trip over if you are in dire need of some good wings, which are often hard to find in Pittsburgh. Give it a shot but be prepared to wait even when it isn't busy. We waited about 45 minutes for wings but would still come back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u3OCn-7UTb2g_zIRXwrJdw"
  },
  "xxmkFef2Bb7ne_vcHZ_c7Q": {
    "date": "9/30/2016",
    "text": "Bourbon blaze wings...ridiculously good...my lips are a bit tingly, but them's wings was goo-oood",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SmkbMBZdA8YRHPw_Ts5KOg"
  },
  "8Ur1PTjc0_PsFxW_-yfNNw": {
    "date": "12/29/2015",
    "text": "Went on Wednesday Wing Night and the place must have been understaffed. Barely got service from the waitress, and ordered blue cheese for 12 wings and they give you a little plastic ramekin that was only half full......COME on! for 12 wings. It was only enough for 3 wings and no way to ask for more.  Oh did I forget to mention the wings came with NO where to put any of the bones? Kind of riducluous",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xb7Iiwy0UGizyr1oG8XC3g"
  },
  "nfm5WRPqt1FqCZ4i4KEpcQ": {
    "date": "1/1/2016",
    "text": "They used to have really good food... Then got rid of their best menu item ever!!! Thier po' boy was amazing.. Really the only reason i went there. Amazing beer selection as everyone knows. Staff is hit and miss.. And its always too crowded... They need a bigger place or an add on. Good wings too, they cook em right. Bring that po boy sandwich back !",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "_h4UlHXy5pTJpetOl6tWxA"
  },
  "wdtOC1UOvhNvoo0-vKAItA": {
    "date": "1/27/2016",
    "text": "The beer selection is one of the best ones in the North Hills, they have a menu with multiple beers from all over the world and are always changing up the draft selection. Wings are big and the sauces are amazing. We order them all the time and even take them to go if we're having company over or a tailgate. I recommend stopping in on a Saturday for all you can eat crab legs, too.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vBKdEJxjQlFw3nU_VLP-QQ"
  },
  "a3Vjxx6B0NnYcuMEEUiLUA": {
    "date": "9/12/2014",
    "text": "It is a dive bar so do not go their expecting anything else. There are many many different specials throughout the week and have a regular happy hour from 4:30-6:30 which is half off appetizers and a dollar off drafts.   The wings are amazing and pretty cheap. They have at least 30 sauces and dry rubs to choose from and one day I will try them all. The wings are perfectly crispy on the outside and juicy on the inside. I also got the provolone sticks and they were pretty good as well.   Not only is the food and drinks good, but this place is incredibly affordable and the service is good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d6JltKIeAbPj415bwSm7eA"
  },
  "bNvCfcQpAUm_rMdQSVLfxw": {
    "date": "12/30/2015",
    "text": "Some of the best wings I've ever had! The sidelines sauce is excellent! The prices are also extremely reasonable and there are specials on a dozen wings on Sundays.  I was also impressed with the variety of choices and flavors of wings.  They were so good I had to get an order to go for later!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UfDfTJAYugo-_d1ULfdYdw"
  },
  "qwFewPfNwKhkCZmna27u0Q": {
    "date": "5/24/2016",
    "text": "I've been to Sidelines several times now, as it's nearer to the side of town where my family lives. It's also one of the only bars in the area in which your vision isn't completely obscured by a haze of smoke and bad beer. Yes it's a sporty dive bar, but it's really clean, the food and drink options are insanely good, and the service is always friendly. I'm a fan.  Sidelines is owned by the same people who run the Swickley location as well as the wonderful Fireside Public House in East Liberty. This is evident from the menu full of well-executed, quality food and deep beer list with plenty of options to suit every taste. The prices are reasonable for any time of day, however happy hour is where it's at! It's 4:00-6:00 seven days a week. Recently I went on a Sunday afternoon with my boyfriend and two of my siblings, and there was a generous wing special as well as half off all drafts under 7% abv. Everyone raved about the wings, and I lost count of how many drafts I ended up with for less than $15.   Overall I really appreciate the care and attention that goes into making a place like Sidelines nice. It's a real gem and far from a standard dive bar. Since I just joined their beer club, I pretty much have to keep coming back...oh well :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zPwZQEVmFg9cbmsEwLpA6g"
  },
  "F1DX6hurj_awcvgD0H9ZEA": {
    "date": "4/7/2016",
    "text": "I am speechless! How I have not talked about Sidelines on here is insane! I go to this bar more than any other place! Why? It is my bf's most favorite bar in Pittsburgh and favorite spot to catch a Steeler's game!   The wings are truly special! They are cooked nice and crispy and every sauce I have tried has been superior to most! I usually get the hot garlic or chipotle. This place isn't only for wings though! The entire menu is good! Plus, they do a monthly rotating menu in addition to their everyday menu! Grilled chicken is nothing to write home about usually but Sidelines knows how to make a sandwich! I love the ultimate grilled cheese with gouda, tomato, bacon and grilled chicken! It should also be noted that they have one of the best burger nights (Monday) I have ever gone to! Not only are the burgers cheap but they are always amazing!  I should also mention the beer! The selection is broad and they also have a beer club (I don't want to brag but the bf is at the 500 level).  The only reason why I did not give 5 stars is because sometimes the service can be slow! It is worth the wait though!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "OWtzJMlqA7cY559O80nqQg"
  },
  "OvJMSfEwErvmOJoUVvHXCg": {
    "date": "1/5/2018",
    "text": "The wings are great and the prices are very reasonable. So many flavors that you have to find a few and stick with them. My husband really liked the hot wings (very hot) and I enjoyed the BBQ. We also tried to ranch hot wings but they were a little spicy for me. The only complaint is that the wings could be crispier, and not drenched in so much sauce that it weighs down the take out container. The wings are very hearty, and have a ton of meat on them. We will definitely order food from here again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gKU45Tq9JJ9Z7HiZChu3ew"
  },
  "ZghYGceHPniqZiQ0_XarSA": {
    "date": "9/9/2018",
    "text": "I love their food, I am disappointed with their service. Three times now I've tried to call to place an order so I could pick it up. Three times, no one answered the phone. Today I called repeatedly. I understand things get busy, but when I went in on a previous order (and had to wait over a half hour for my food) and complained, the waitstaff shrugged it off and said sometimes they don't answer the phone when they are busy. That's horrible customer service. I would go here more often, because I really like the wings, but I'm tired of no one picking up the phone and waiting in the bar when I'd rather be at home with my family.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "szzV0HTwAw2MTgstKBcyTw"
  },
  "hSilzfgwDZQ3GbbLCmxw9Q": {
    "date": "11/14/2016",
    "text": "Where to begin....I was going to write a long review of the terrible 3 hours that I spent at this place - without ever actually recieving food. But, I have chosen instead to make this short and to to the point.   - Extremely rude and petty waitstaff who choose who they will wait on and who they will not. (HINT - we were not the chosen ones, as we were not regulars and were ignored and lied to about why our food never came to us in the 2 hours we sat in the restaurant)   - Staff who do not provide menus, water, seating, and who basically are working to take smoke breaks and end their shifts as quickly as possible.   - No parking (hope you have time to circle the block 5 times before going in to eat)  - Servers and staff who have no idea what they are doing and answer simple questions such as \"do we seat ourselves?\" with responses like \"I dont know, I guess so\"  - Cold and disgusting \"freezer to fryer\"food  -the food we did receive was like a bag of frozen food I could buy at Giant Eagle and make in my oven (doing that myself would have been better).   We ended up leaving after waiting over 2 hours for any food. Once someone decided that we were \"worthy encough\" to get some of our order, our crappy appetizer that was practically THROWN AT US by our waiter,  came from a bag that they couldn't even bother to make sure was hot. We never received our actual orders. I will never step foot in here again.   Spend your money elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "5qAQt0mFuM8uWmymF-6iPQ"
  },
  "0r22GQAvxtK0n-TGI8b2Qw": {
    "date": "1/26/2016",
    "text": "If you're looking for good wings and a great beer selection, than this is a great no frills bar. It definitely has a home town feel. You can order from their draft list or they have multiple refrigerators of bottled beer you can feel free to peruse and make a selection from. The staff has always been very nice any time we have gone as well.   The big draw for some people in the area is the \"Rebecca's revenge\" food challenge. Which is basically multiple pounds of food comprising of a huge tall stacked burger and a pound of fries. If you can eat it all in 30 minutes it's free.. And maybe you get a t shirt. But it's painful to watch! It's so much food.. We've seen praise try and fail on multiple occasions.   I'd recommend sidelines if you want a very casual evening with some wings and beer.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SZOdhu_-4uFQfIbzU0qeFw"
  },
  "u_LOCJf3gRQ2h5hd6X5vhA": {
    "date": "4/9/2017",
    "text": "Wings were good. Service was ok. But it's dirty. The outside rear entrance stinks. The floor is slippery from grease. The one tv doesn't work right. And for God's sake buy some new chairs.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "niSdw8_zwVcI7OTd1B4O3g",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/niSdw8_zwVcI7OTd1B4O3g/o.jpg"
      }
    ],
    "user_id": "Jy2roL_evdNoPZlXx44Xvg"
  },
  "PwdjhgtgkwZz57s7BISNkQ": {
    "date": "5/16/2017",
    "text": "Food is always a 10.  Had the Build a Burger. Fantastic.    Enjoyed some wings also.  Shawn at the bar is also on point.    Always a great call this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ct6iAROQzD-a1K4vMzsJXg"
  },
  "hHl-IHUw2VVnRxMaZnsndQ": {
    "date": "9/16/2016",
    "text": "I stopped in here for the first time the other night around 10 with a girlfriend of mine. We were just looking to grab a beer and some wings.  I had the Peanut Butter and Jelly wings (yes, they exist!) and the Bourbon Blaze wings. Both were good, but not great. The chicken wing itself is the best part; so, I'll definitely be back to try other sauces. The PB&J tasted like it was missing the J, but still pretty good and definitely unique. The Bourbon Blaze had a nice flavor and a spice that builds rather than sets your mouth on fire right away. My friend got the Honey Cajun and said they weren't spicy at all, FYI.   Great beer selection, although a bit hard to read from the other side of the bar when it's that dark in there. For the slightly visually impaired, a draft list would be so great.  Service was ok, average for a busy bar. Beers came quick, but it took some work to get someone to take our food order.  Definitely will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mHMQyq4QV2gTEO4qNRNDYA"
  },
  "704BHTJ9p1mJA5kXwJ_gbA": {
    "date": "7/31/2017",
    "text": "I am not an out to dinner person. When my daughter said let's go to Sidelines, I cringed a bit but went anyway. I could not have been more pleased!! The wings were the best wings I have ever had! I had two orders and probably could have had more. I saw lots of my friends and it ended up being a great night. Will, for sure be back... soon!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NOR93THAvtPUrJlzP9a3pA"
  },
  "xzp4dhCncuh7V1kh7lx7CA": {
    "date": "1/8/2017",
    "text": "Came here with a friend for food and bingo night. I've never played bar bingo so I had no idea what to expect. The bar was packed but there is other seating which was just far enough away to still be able to talk each other without yelling.  The food was amazing. We had wings and tater tot nachos. Both were fantastic, the wings edging just in front. Cooked perfectly and the sauce was great.  Bar bingo was fun although it got off to a late start because the Penguin game was on. Can't fault them for that though as it would have been impossible to hear of the game and the fans.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fVAr-9ICfZMfJk9ow95cBg"
  },
  "rlf5MqevdgXyxuHOpTzZng": {
    "date": "10/29/2015",
    "text": "Great wings and burgers, lots of beer options join the beer club!  Wing night Wednesday Night Burger night Tuesday night",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n7nBvs1MfQn3MnSVKY-N8Q",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. Burger night every Tuesday!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/n7nBvs1MfQn3MnSVKY-N8Q/o.jpg"
      }
    ],
    "user_id": "1yf-PScjXs9mdagubKpBNQ"
  },
  "iCHFlvWw4EuDxGFAd0aP5g": {
    "date": "4/13/2017",
    "text": "A friendly little joint in Millvale. I had heard about it first for their wing night Wednesdays. It does get packed and you may have to wait for a table. I'd suggest coming on another night, and they do have specials and activities throughout the week. We came one night and they had Bingo going on. The food is bar food, but I've never had any complaints. The salads are well prepared, wings are normal sized and there are so many flavor options.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yJRx7eLfrErj8jOSK-FeFQ"
  },
  "VUMkIWIN4AEvXnzrl8byAw": {
    "date": "3/2/2014",
    "text": "When dining here with a friend before yet another recent concert, I went off the burger rails and ordered their French Dip. A toasty, luscious masterstroke of a sandwich, a crisp Ciabatta bun magnanimously contained slices of chopped sirloin, Swiss cheese, and onion. A bowl of profoundly savory jus that recalled French Onion Soup was provided for dunking each half of the sandwich into, softening the crisp bread  into a spongy consistency with its rich broth.   Rounding out my pre-gig meal was a sourdough breadbowl of their flavor-wealthy, beanless (the way God intended it to be), perniciously, deliciously piquant chili that was topped with obscene amounts of cheddar and loaded with heaps of ground chuck, Yuengling soaked onion straws, and diced tomatoes.   Sidelines is making bar food their own, striving for a final say on what is considered lowbrow by effete foodies.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 13,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "0OB_YgB906rTGiFEdUHdPg",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. French Dip sandwich with au jus and housemade potato chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0OB_YgB906rTGiFEdUHdPg/o.jpg"
      },
      {
        "img_id": "Jv9dBpwcFcqTN-W80row5w",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. Chili in a bread bowl",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Jv9dBpwcFcqTN-W80row5w/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "36r520e2nL4BFyP40BY8tA": {
    "date": "1/17/2016",
    "text": "The beer selection is great and so is the wing selection. They have a wide variety of wing flavors and I have never had one bad flavored sauce on my wings(you must try the peanut butter & jelly sauce). I have yet to find another bar or restaurant with better wings than sidelines, nothing has come close.  The manager, Erin, is awesome and so is the rest of the staff.  It's a very busy local bar, sometimes you can't find a seat depending on the night/ special but it's worth trying out regardless. Side note, Wednesday night is wing night! Great specials!  Highly recommend.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KV50BAZ04f0lW7jSTpspTg"
  },
  "7oXe4xcsZ3biq1Z9faO2VQ": {
    "date": "1/5/2015",
    "text": "A few things are really great at Sidelines.  For one, the food.  Great burgers and wings.  Second, the beer selection.  They have a number of beers on tap (including some local brews) as well as bottles.  They also have a mug club for those who choose to be adventurous.    The food prices aren't bad, but some of the beers tend to be pricey.  The service, too, can be hit or miss.  I wouldn't call it bad service but some of the bartenders aren't very attentive.  However it's not frequent enough to keep me away.  There's a great neighborhood bar atmosphere here if you're looking for a good place to hang with some friends.  Excellent place to catch a Pirates, Penguins or Steelers game.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WoKCLSctS7G2547xKcED-Q"
  },
  "3n2LMxTEsZoqEmzNzW7X8g": {
    "date": "11/21/2015",
    "text": "I've visited Sidelines on multiple occasions. This is a terrible bar, which only caters towards regulars. You'll hear people talk about their wings, but you're better off grabbing some from Frank's.  During my last visit, the server completely ignored us. We were sitting directly in front of her at the bar, however she was too concerned with when her shift was going to be over. I tried to get her attention multiple times, but she was too busy on her phone. She paid plenty of attention to the regulars though, which I'm pretty sure we're drinking for free.  When I did manage to get an order in, she proceeded to order a second drink for my girlfriend, without asking. When I confronted her about this, she stated that she \"assumed my girlfriend was having what I was having\". We got charged for the drink.  We waited 45 minutes for two sandwiches and an order of wings. The Pittsburgh sandwich was missing the coleslaw and fries, which made it a regular cheese steak. The wings were cold (probably from sitting in the kitchen). They also failed to give us napkins or ketchup.  Our server then proceeded to leave without informing us her shift was over. It took forever to get our check.  I dont recommend this place to anyone. You're better off checking out E-Town instead. It's a much better local bar.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "fl65HZc8cnbOWuWbYNjPjg"
  },
  "IGa2yMJZv0z3OTL5QjfpyQ": {
    "date": "5/5/2012",
    "text": "Blown away!  That's the only way to describe my experience at Sidelines.   This place rocked me like a hurricane.  Seriously, lace up your shoes really tight because this place will knock your socks off.  Since I was visiting town and didn't rent a car (I'm very green that way), I took the #2 bus to this place.  It drops you off right by the bar.  The lovely bartender couldn't have been more helpful answering all my questions about the beer and the wings.  She started me off right by recommending I try a  Cheeky Yinzer, which was described as a British IPA.  The fact that I had three equals me liking it.   She also suggested I try a Curious Traveler, which was also good even though I'm not a huge shandy fan.  Now onto the wings...after much discussion, I went with her recommendation to have the hot garlic BBQ.  Great Caesar's ghost, they were delicious!  Hot enough to make my nose run, turn my face red and make my eyes water, but not so hot that I felt my lips would blister.  Crispy and saucy, a True delight.    I also had cajun fries which were equally awesome.  When I got the check I thought there was a mistake because it was so reasonable...I would pay twice that in NYC!  Oh, and their Beer Club is awesome.  If I lived here my only goal in life would be to get a black mug.  Special thanks to Yelpers Rob I and Jaime J for recommending this place.  I loved it and am adding this to my GYATTP* list.   Wings, beer, service....truly outstanding.     _____________________________  *get your ass to this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F996acIKtnQGtBb3nCVwgg",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. Wall of fame",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/F996acIKtnQGtBb3nCVwgg/o.jpg"
      },
      {
        "img_id": "-Sp-uvI7-U5HzwafcUs7NA",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-Sp-uvI7-U5HzwafcUs7NA/o.jpg"
      },
      {
        "img_id": "Axp9TKDwvKkcirVrJrtiaA",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Axp9TKDwvKkcirVrJrtiaA/o.jpg"
      }
    ],
    "user_id": "wzyGNvArcpUjZauRWFrKHA"
  },
  "-pAPgGEzhF7sAoXEIVds_A": {
    "date": "12/6/2015",
    "text": "Today was a miss. Went there for lunch. Waited an hour for boneless chicken. Only one bartender and the poor girl was getting slammed. Food is hit or miss lately but it's close and they have a great selection of beers so I'll put up with a bad say every once in awhile.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tpLWXsk3Uyx_qyxcN_tEA"
  },
  "cdIdqCOBo25IbrqgRGQguw": {
    "date": "5/3/2017",
    "text": "To eat a great selection of wings and sample an amazing variety of beers, Sidelines was perfect for a hockey game. The staff was attentive and friendly. Even got a little local flavor with patrons running a victory lap when the Pens won game 4 of series 2 this year, 2017. I can't express my glee with Rusty Rail IPA on tap and honey sriacha  wings and many Tv screens of hockey, bliss.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AA4bRnHfC-fMzO4y2AGrIQ"
  },
  "pTwVVzN7Wj1DrehJJada5A": {
    "date": "1/26/2019",
    "text": "WINGS WINGS WINGS WINGS WINGS WINGS WINGS  I don't even really like wings all that much but these are incredible  The Grand ol hot pry sauce they have now is out of this world and currently my personal favorite.  Do yourself a favor and come on one of their many trivia nights, make it a thing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8FbnfMDyB_nGXIzU0-Y2xA"
  },
  "CgOG--0thcWGj818pqfOsg": {
    "date": "6/19/2019",
    "text": "I always like this place, staff is nice, food is good. But tonight I get my bill and it's higher than I expected.  I came to find out that the last 2 beers we ordered were $9 each!  If you're in a neighborhood bar and they're selling a beer that's $9 for 10oz - they should tell you that, period.    No prices on the beer list...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HACs2rzYo3zb3zn2NS59Gw",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HACs2rzYo3zb3zn2NS59Gw/o.jpg"
      }
    ],
    "user_id": "NiUHJ0VsJ3WpIHd2WSyeuA"
  },
  "MyTEQD66Qec25JoYKn4GuQ": {
    "date": "7/1/2019",
    "text": "1st time going. I loved the fries. Wings were good. The parking sucks. I would come again just for the fries.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S96S60fyXLY2jc4crUwqSg",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. Happy Hour Specials",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S96S60fyXLY2jc4crUwqSg/o.jpg"
      }
    ],
    "user_id": "NR_ZWCpha1vZEB7wSIqu0Q"
  },
  "wQHmyrtdcbP4wE4r0I6xIQ": {
    "date": "5/6/2018",
    "text": "A decent but somewhat small neighborhood bar with a good amount of street parking.  There are about two or three high tops up front, I long bar down the middle with seating on either side and then 4 tables in the back. There is also a side room with two high tops and a few booths. In this room there is a large projector but you'd only be able to see it if you are facing that direction. So half the people in booths won't get to see a game in this room. In the main bar area there are several TVs of various sizes and you'd be able to see one or more from anywhere you sit.  It's non-smoking which is a plus but you can go to an outdoor gravel area with picnic tables outback if you like.  Or just on a nice day.  They have a large selection of beer on draft and in coolers in back that are self serve.  I was impressed by the amount of craft beer they had available until I found out about their beer club.  You basically drink 50 beers of various styles and mark them down on a sheet which is kept by the bar for return visits. After completed, you get your own Beer Club Stein. I believe after 100 you get a black stein.  It's a pretty cool idea and I ticked off seven last night!  The menu has a lot of bar type options but the wings seem to be the highlight.  They have a couple dozen sauces to pick from. I opted for boneless wings with Jamaican Jagoff and their signature Hot sauce.  The sauces were excellent but I would not get the boneless wings again. They are just thin strips of chicken with a light breading and very tough.  I was disappointed by them but a friend got the regular wings and said they were fantastic. Since it was Cinco De Mayo and Saturday, they had gourmet taco $4 each or 3 for $10.  I went for. Pittsburgh Gringo, Fish and Chicken.  These were awesome!  I grabbed an order of Fried Pickles during the game and highly suggest them.  The service was my least favorite part. You didn't have just one person helping you. Basically anyone who came by would see if you needed anything or you'd just ask. It just wasn't very consistent and orders got mixed up a little. Everything worked out fine but I think one person taking care of you is just easier and more clean.  Most of them were pretty friendly and attentive. One guy was fairly dismissive and gruff but hey, it's a bar.  Overall this was a good experience and I think my next visit will be better with regular wings. Just wish the Pens could have won!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5cFhpArmUNOi_TY17V8r4A",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. The sauces were amazing but these boneless wings are far from it. Not very good at all. Stick with regular wings!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5cFhpArmUNOi_TY17V8r4A/o.jpg"
      },
      {
        "img_id": "oKkY7T91m3E0hzX6jCQh4w",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. Gourmet Tacos were great!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oKkY7T91m3E0hzX6jCQh4w/o.jpg"
      }
    ],
    "user_id": "wzItnkHTHKNqJESMSTEYJg"
  },
  "I-OL6-E7O4t8NZE4zGLKog": {
    "date": "9/6/2018",
    "text": "Came here on wingnight Wednesdays where the wings are $0.50 each.  I was very impressed with the wings and the crazy amount of flavors they had to offer.  I ended up trying the hot garlic, Thai, and Jamaican.  My favorite was prob the Thai but the others weren't bad either.  They also have hundreds of drinks to choose from so everyone can get what they want.  I'll definitely be coming back here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_hsruQCw6UTnjlQiuSpScg"
  },
  "TiQrk5qk2wDgBuh-nt8AOQ": {
    "date": "12/30/2018",
    "text": "The best wings!!! Good typical bar menu. Place is small so it could get quite crowded.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e4V4WN6wSbCWl6BzyGBEuQ"
  },
  "asz_6ag-V8kJxzCK9XZnrg": {
    "date": "12/2/2018",
    "text": "We came hear after a show at Mr. Small's and discovered it was wing night. Got to try some great flavors, including the house specialty recommended by our waiter, the peanut butter and jelly. Everything was excellent. You can't go wrong with any of the wings. My boyfriend got a burger that was pretty good too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rjNDkqyRUydS955pvJWrTA",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rjNDkqyRUydS955pvJWrTA/o.jpg"
      },
      {
        "img_id": "5Zcsok-_dRLv6Qr9DZadGw",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5Zcsok-_dRLv6Qr9DZadGw/o.jpg"
      },
      {
        "img_id": "5fy6jwawKEzqEHrZnN1nvg",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5fy6jwawKEzqEHrZnN1nvg/o.jpg"
      }
    ],
    "user_id": "DdB6_7HYzwWPOjdGUR19PA"
  },
  "dCDrmQj1BwI6BHsOQTdGLA": {
    "date": "11/25/2018",
    "text": "One of my favorite bars in pittsburgh! I absolutely love Sidelines. There is always such a great assortment of beer there!! You can instantly feel at home here, it's a nice crowd. The wing specials on sundays are always my favorite, they are really great. Definitely the best place to come before a show at Mr Smalls!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pZuK6cMZoQlvjNojbOBJIw"
  },
  "9C9mO3LIas9qqhzRuSAFAQ": {
    "date": "1/6/2018",
    "text": "FINALLY got around to stopping here, and kicking myself for not doing it sooner. It was uncomfortably cold outside and their temperature control wasn't top notch, but it's an old building so what can you expect?  We decided on some tots and some wings. The wings were as good as everyone makes them out to be, especially the garlic parmesan. Big, crispy, delicious. I didn't love the Hot wing sauce, as they almost tasted like hot BBQ, but they had the right sauce ratio. Tots were decent, nothing special.  Our beer was a little more pricey than I would've expected, but the bartender was friendly and we'll definitely visit again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhQOA8-FdpA6D0hNhXEYIw"
  },
  "p0kZ7koFvZCmQv92nnEupg": {
    "date": "1/6/2019",
    "text": "My favorite wings in the burgh! They do wing night on Wednesday's which everyone knows but they were doing $7 dozen wings when I stopped in today(Sunday), which I did not know. Hot garlic bbq is my favorite sauce but I've never had one I didnt like. They recently added some new sauces like \"insanity\". While super tasty, the craziest thing about it is how mild it was for their hottest flavor ha.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iEZHFtv4DTAZxUxluMj8yQ"
  },
  "IaPicLKjGah0fG7gadhXJw": {
    "date": "1/1/2019",
    "text": "Great wings, open late and can pick up.  New Years Eve has a late night craving for wings- kitchen was open til midnight.  Some of the best wings in Pittsburgh. A local bar with a great vibe and atmosphere, good draft selection, but have a refrigerator filled with craft beer.  A Pittsburgh bar that you can buy beer to take home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "npxkBE7PIas0K5jXCOLdXA"
  },
  "JpN2hiuVkufh-UtA9YhloA": {
    "date": "5/9/2018",
    "text": "Best Little Dive Bar around.  The Bartenders are amazing. (We miss Erin of course). Gary and Nicole are the bomb.  The wings are great, and the boneless wings are super great IMO.  Chipotle and Garlic Parm are the way to go. Sidelines tots and pickles are great appetizers! The kitchen is comically inconsistent but definitely adds to the charm.  Go easy, it's millvale! The drinks are reasonably priced, Long Islands are tasty and there is a beer club if you're into the beers.  Bingo on Thursdays, trivia on sundays, and pens games always. Jukebox available, and lots of seating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A43IClICYyJ7Fcg1cEyquw"
  },
  "uCx7RWMO1HTJJLdbIMSd3Q": {
    "date": "9/14/2016",
    "text": "You don't know what love is until you've had wings at Sidelines.  I'm usually not much of a wings person, but this place has made me a believer. The garlic parmesan and PBJ my favorites. (Yes -- there's peanut butter and jelly chicken wings on the menu. It sounds so wrong, but tastes so right.) It's the sauce combined with the crispy, not overcooked fry that makes the wings stand out.  Wednesday nights is the most promising time to go out for wings since they're on special for 35 cents each or so. You have to dine in to get the discount; if you get takeout you will pay the normal rate. I made that mistake once.  While wings and large selection of beer are the highlights, other items on the menu are decent too. There's a tater tot supreme app that's sort of like what you'd put on top of nachos except they're taters. That's pretty tasty. And of course, you can never go wrong with burgers and fries. A lot of the bar menu stuff is half off after 10 p.m. or so on weeknights.  My only caveat? The service is slowwww, especially when it's busy. I can't blame the servers themselves, but the place seems chronically understaffed.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HmUyAVQFQXs-WSBiJszYsA",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. When wings take up half of the menu, you know they have to be good.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HmUyAVQFQXs-WSBiJszYsA/o.jpg"
      }
    ],
    "user_id": "0JIiQelaItruoV6F9pWHvw"
  },
  "QvLkyxBV58Ky4QbNWwC-NA": {
    "date": "4/18/2017",
    "text": "For this review, I am going to start by saying you don't always get what you pay for. In this case, I come regularly on Wednesdays for 40 cent wings and very reasonably priced beers on tap and I definitely pay less and get WAY MORE. Few things to start off, wing night starts at 7, and if you want to eat at 7 you should go earlier for a table. I usually end up waiting till about 8 when the first group of wing lovers clears out. However, if there's a Pens game on, get there early or go around 9.   I also have found that the wings are better when they aren't as crowded. But honestly, 2.40 for 6 wings with an array of different sauces you just can't beat. I have not had many other things on the menu other than a few appetizers like fries and provolone wedges, but I am really never disappointed. It's a typical neighborhood bar so don't go expecting bells and whistles. Just go and get your wings and beer and enjoy the people around you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tJiWkQtxSmr4UdfEp-EYHA"
  },
  "uzc6n8DHwtgdCnfsKS2q3g": {
    "date": "4/23/2016",
    "text": "Of course I loved this bar! It's everything a sports bar should be and more. Plenty of TVs, good service, and wayyy above average bar foods. I couldn't come up with anything negative. Even the patrons seem like good people.   We went for burgers and to watch the Pirates game. 1/2 off food after 10pm. For real. I think I'll honestly just start going there all the time. They have some sort of beer drinking challenge, where you earn a mug after drinking 250(?) different beers... or something like that. Basically it's like wearing a beer drinking crown, so you know I'm in. Definitely another hidden gem in Millvale!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vGZEdywMg3nULGI1LLjJ5g",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. Heatinator! Burger with a kick!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vGZEdywMg3nULGI1LLjJ5g/o.jpg"
      }
    ],
    "user_id": "s9cI2U6kyJj8yTFNvmfveg"
  },
  "GWbGeWV_aWdOfX5lud_TMw": {
    "date": "6/27/2017",
    "text": "We came here this past Fall before visiting Scarehouse. I wasn't too hungry, so we just had fried pickles and french fries and I had a couple of the thai wings. Brendan also had a burger. We had great service and liked the set up of the bar. They had a great selection of beer and their food was really good- solid bar food. The wings were tasty and the fried pickles were good. We liked the fries as well. I am looking forward to coming back for a game or for their wing night!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0EXAefvoHoONwUOpZAhN1Q",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. boneless wings &amp;amp; fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0EXAefvoHoONwUOpZAhN1Q/o.jpg"
      },
      {
        "img_id": "lwNGdg-Jy46xp2ExdwZkbw",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. boneless wings &amp;amp; a salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lwNGdg-Jy46xp2ExdwZkbw/o.jpg"
      }
    ],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "Kgf5-o5R-K0yQByRNmcmNA": {
    "date": "1/13/2018",
    "text": "I live within 5 minutes of Sidelines but tried it tonight for the first time. After noticing such variety of wing sauces on there menu, I had walk down to it in freezing cold (felt like 1 degree) and it was all worth it! Wings were so fresh that the walk back in cold weather didn't make the wings lose their heat. I will be going back there again to try other flavors. I am not a beer drinker but they have tons of selection and with televisions on every wall.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8XgHd4jwz-t2ek-EOY3sCw",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. Hot GARLIC flavor was amazingly tasty and very nicely fully cooked!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8XgHd4jwz-t2ek-EOY3sCw/o.jpg"
      },
      {
        "img_id": "wm6z8GETp9hYE2kcZGrEag",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. Wings were flavorful &amp;amp; drenched in wet CAJUN sauce!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wm6z8GETp9hYE2kcZGrEag/o.jpg"
      }
    ],
    "user_id": "w3sdY5x0HiXB7OMkslbhlg"
  },
  "LSI6XLBhhIx7U_x7fJDp5w": {
    "date": "6/19/2016",
    "text": "After a simple Yelp search of what's around our new apartment, I noticed Sidelines seemed pretty promising. Bar food? Check. Late hours? Check. Beer? Check. I had it saved as a bookmark for awhile, but we finally had the chance to check it out this weekend.  I'll start with the positive-- the food! Very very good. I got the chicken club on a pretzel bun with fries. The sandwich was great! Wonderful mix of flavored and the chicken was seasoned perfectly. They give you huge portions as well! My boyfriend and I also split wings since that's their specialty. Good, not award-winning good, but good. Maybe I was just expecting more from the hype? The fries were incredible! My boyfriend got the garlic Parmesan seasoned and they were out of this world! I went with the traditional.   Another thing I loved was the prices! Funky beer was on special for $3 and I also noticed both of our meals were half off once I got the receipt. Not sure if it was a mistake or an after 9pm price, but either way was a huge score!   Now onto the negative-- atmosphere. First of all, the place is in the middle of a pretty dark street. We had to turn around and really search for parking. If you're not paying attention, you'll miss it. When we arrived, the crowd was pretty rowdy. Not really my style, especially when I'm trying to eat. Not sure if it was just an off night, but everyone from the staff to the patrons were obnoxiously screaming at the top of their lungs. I noticed there is a dining room that sits by itself in the back. If we decide to go again, I'd sit back there.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "K6MOBKq_RV84_G9CUm77wg",
        "caption": "Photo of Sidelines Bar &amp; Grill - Pittsburgh, PA, United States. Chicken club with pretzel bun and fries.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/K6MOBKq_RV84_G9CUm77wg/o.jpg"
      }
    ],
    "user_id": "pkpzIhX1mNzLLEEyj4syKQ"
  },
  "0fhhbMvQ8yw7Qs_QD8WxgA": {
    "date": "6/14/2018",
    "text": "Best wings in town! Sometimes you'll be waiting a while for food, and I mean almost an hour, but the food is never not amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rSLd_puCR3UcP3dXiOxBMQ"
  },
  "KNvsAaAiFPnA0UlwFYNRDQ": {
    "date": "10/1/2016",
    "text": "We hadn't been back to Sidelines in a few years. I was craving wings so we headed over to this Millvale Bar to see if the wings were still as good.  My four star rating is for the wings - very delicious - and the service - which was good even after a long Steeler game crowd preceding our arrival.    The chairs really need to be recovered (holes and stuffing coming out on most which is sort of off-putting because you wonder what the kitchen looks like) and the table was a mess as was the floor but I can say this was after a Sunday Steeler game so it's somewhat to be expected.   The bartender cleaned up our table and waited on us for the most part and another waitress came by a few times to make sure we were doing okay.    Okay, so onto the wings!  Yes!  We ordered six wings each (well done) in three different sauces.  The house sauce (medium - although it also comes in mild or hot versions too) was really a nice balance of spicy, sweet and salty; the fit to be thai'd wings had this delicious green hot pepper (thought maybe serrano?) sauce with a nice slow burn; and the garlic parmesan were drenched in butter but totally delicious because that's how they are supposed to be.  The three wing orders came in one basket with basket liner paper separating them which, unfortunately for the fit to be thai'd wings, created a soggy vapor lock around them and took the crunch away - the other two orders on either end were TDF crunchy.  Even soggy, those thai wings were pretty freakin' awesome!  Great beer selection in the cases by the bottle or lots of draft options.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "X7mVSZxStPxD4GbN_29pYQ"
  }
}