{
  "cfZxxliHRHoJfpx5BB-mvg": {
    "date": "6/16/2018",
    "text": "We were so happy with our breakfasts!  Fiance got the American Breakfast and raved about the homefries and also his Intelligentsia coffee.  I enjoyed a Paposeco and Meia Leite.  I'm so excited about the food offered here and can't wait to visit again to try another item off the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sGg9bKILP0K-r2iTz6yg7g"
  },
  "q-8hxyGd3lQAhXYZ5awrLA": {
    "date": "7/31/2018",
    "text": "Delicious lunch! I had the polvo guisado and was so happy I did. Quaint, quiet and quick! Felt the service was great and attentive. I'd recommend to anyone to try if you enjoy Portuguese or just in an adventurous mood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V4700102KIH68J0weBJBng"
  },
  "y9GooeLatzWaETvekIozPg": {
    "date": "7/16/2018",
    "text": "New cafe in the neighborhood. Great spot, really nice owner who is clearly very thoughtful about the dishes she creates. There are lots of homey touches of local foods from her hometown so lots to explore. I got a breakfast omelette and my husband got the pork loin sandwich. Both delicious! Would definitely go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e0YELSY5t6qapZUzu0I-ug"
  },
  "wHhe8piU2lnotenlrJRwwg": {
    "date": "7/8/2018",
    "text": "The food was delicious and priced well.  Served by a friendly staff and owner.  The flavors were amazing I recommend the American breakfast for something familiar. The potatoes were awesome.  So glad to have this place on the neighborhood and can't wait to try everything on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGAzg3eD07AKbQLX_psfbQ"
  },
  "zmXbRYAOLl5d8hiQ9fCbpw": {
    "date": "7/13/2018",
    "text": "Great place! Wonderful breakfast. Not least: Piri Piri hot sauce on the table. Excellent omelettes, one green omelette, one with chorico. Very tasty potatoes with, and bread with sweet butter. The 'exotic' nature of a Portuguese restaurant might make some folks hesitate, but don't let yourself get into a rut here, you won't regret a thing--you could even order the usual 'American' breakfast, but don't do it. Coffee first rate. I was planning to explain to them that they shoud be selling bottles of the Piri Piri hot sauce when I noticed a barrel full of many bottles right beside the counter. So, stocked up on that. Not able to resist showing off I mentioned that we had become fans of Nando's bbq while in Qatar once. The owner dumbfounded us by saying that she would be bringing Nando's bbq chicken here, soon. Can't wait. Can't wait to go back to The Azorean Cafe for lunch now, that menu looks terrific.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hEWqqxDfIdANbG00R9auAA"
  },
  "wMCjgGmx22VzD1H8igpcRw": {
    "date": "8/1/2018",
    "text": "Beautiful space, love that they source from our local Mediterra Bakery, a variety of seating options. I thoroughly enjoyed their cod bites, the butter and cheese breakfast roll (with blackberry jam!), and ice tea. Wanted to buy the sparkling mineral water and a jam variety to go (fig, pumpkin and others), maybe next time! Wednesday lunch time had tables to spare (12:30pm)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Maw1KQDwIvszQAnxwNLu0w"
  },
  "2EkCjeYmWD6UQHreg2Os2w": {
    "date": "6/18/2018",
    "text": "4.5 stars!  I have to freak out about a place to give 5 stars and Azorean Cafe was close.  Ordered the American breakfast with presunto, which was similar to Canadian bacon in terms of texture but it is cured and sourced from Portugal.  The home fries were light with a hint of red pepper and parsley.  The portions were moderate. Not stuffed, not hungry, perfect for a hot summer day.  The owner came by our table and could not have been nicer.  This will be a regular spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rS_HQdKb5xmh_kXM1prCjw"
  },
  "_ty11YgUC1pPo2ZU4Lrppw": {
    "date": "7/23/2018",
    "text": "Azorean Cafe -great spot for Traditional Portuguese food and beverages before the Benfica game at Heinz Field!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xlzm9n7rQjARAmNkTDXsrA"
  },
  "9SUDwq3yOpPEq4Vl3tpQug": {
    "date": "7/18/2018",
    "text": "Just stopped here for breakfast. It was great.. Good scrambled eggs and prosciutto but the hash \"browns\" were tremendous. They're made with peppers and have a lovely red color and really rich taste. The coffee is also really good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yn9eC8H0-eRkWjrs2fDhqw"
  },
  "Y5tvsfwsNA_eiRtlHEelsw": {
    "date": "7/15/2018",
    "text": "I came to visit Azorean Cafe on a Sunday at 3 when my boyfriend found it on yelp listed as \"hot and new\". We were both excited to visit and liked the look of things based on yelp reviews and photos. When we arrived, it was almost empty, but the decor was really cute. The cashier/barista was very nice and accommodating. I ordered a frios (cold brew with whip and chocolate syrup) and an American breakfast (scrambled eggs, bread, prosciutto, and home fries) and my boyfriend ordered a cold brew. Both of the cold brew drinks tasted extremely watered down, which was the most disappointing part of our stay, since we are big coffee lovers. The breakfast was mediocre: eggs and bread were fine, home fries were not cooked all the way but had some good flavors. I did not try the prosciutto as it looked like thick slices of meat rather than the thinly sliced prosciutto I'm used to. Overall, extremely disappointing, which I'm sad to say since I was excited for this place, but perhaps it was just a bad day for the employees. 2 stars for decor and friendliness.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gaO6LWuepct2aeVqjf3ZVA"
  },
  "scgg0vFPR0yPniwH5Z1GVA": {
    "date": "1/12/2019",
    "text": "I can't recommend this enough!  We recently moved to the area and were excited to finally give Azorean Cafe a try!  We went for dinner on Friday night (a recent addition to their hours).  They had a live singer who was FANTASTIC (Donna O.) and the whole experience was great.  We we warmly greeted, the staff were all extremely attentive and helpful, and the owner/chef made sure to visit each table to ask about the meal and chat.  We started with a bread basket and shrimp appetizer.  The shrimp was cooked and seasoned perfectly.  We also had the kale soup and galinha with esparguete and chrouico (chicken and chorizio in spaghetti with a saffron sauce.)  Each came with a side salad.  Everything tasted wonderful.  I'm not too versed in Portuguese fare, but from what we've heard it's extremely authentic.  They did have a dinner menu, but you are also able to order off the breakfast and lunch menu at dinner.  They even brewed a special pot of decaf just for us after dinner.  Definitely worth a trip!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lk96MoeRhITvDqFqMMHS5w",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Sauteed Garlic Shrimp",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lk96MoeRhITvDqFqMMHS5w/o.jpg"
      },
      {
        "img_id": "ujMHYzCZO67kRVtmJQh3QQ",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Caldo Verde-Kale",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ujMHYzCZO67kRVtmJQh3QQ/o.jpg"
      },
      {
        "img_id": "WvF4rO_l4KnRtGM-NfmFEw",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Interior and breakfast/lunch menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WvF4rO_l4KnRtGM-NfmFEw/o.jpg"
      }
    ],
    "user_id": "kmuh4BCDYvVNibwc-9ihlA"
  },
  "QDVeOj6g6xAabNOkHBh4mg": {
    "date": "7/25/2018",
    "text": "My nephews birthday celebration was my reason to get me into the Azorean Cafe at his suggestion.  I was impressed by the decor and the thought put into it.  Very restful and calming. The food was new for me.  My nephew had the cod casserole which came with roll and it must have been great because I never heard a word out of him and only saw the top of his head until he was finished! As a new-comer, I opted for the American breakfast which came with a side of Chorizo sausage which is never a bad thing.  The eggs were perfectly cooked to order and I had those great homefries which have a bit of spice to them with the onions and the spicy red peppers. The coffee came in huge mugs and was always filled.  The service was pleasant and courteous.  They spoke about their cuisine and explained the origins and resources for their dishes.  It was a great experience and a first time exposure to food of the Azores.  I will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "_2V8aiV6EdrOMi3ilTlTPg"
  },
  "A_Pj3Tix4xtG8QeXE0mstA": {
    "date": "12/4/2018",
    "text": "Chill and friendly casual vibe. Got the bean stew and one of the \"skillet\" omelettes. Both were great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TE9etS7hScX4ZhMWWqwZ0w"
  },
  "h1yk4jOEkLMWRjUbgPEI4A": {
    "date": "8/19/2018",
    "text": "service was great. staff was really friendly and the owner was very out and about. the home fries that came with the sandwich were good. the steak sandwich itself was ok. the meat may not have been cut right so it was hard to bite of a piece and it was super chewy and pretty tough. would probably not get the same dish and try something different when i go back. atmosphere/space was really nice. good amount of seating and the area in between the kitchen and bathroom is a great little area with the big table and tv.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8v7B13PHyFsqFsj0VAChNA",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8v7B13PHyFsqFsj0VAChNA/o.jpg"
      }
    ],
    "user_id": "XRyejiJdetCsOQIY88jFdg"
  },
  "tM0kEnYI_5TETRECe_RcWg": {
    "date": "7/8/2018",
    "text": "Abrigada!!! We loved this cafe! The bifana sandwich was delicious - spicy & juicy on a crusty Portuguese bun! The nata tart reminded us of the tarts in Belen (near Lisbon). It was so good that we placed a to go order after we ate to take home to my Portuguese Italian Mother. The staff were all so friendly & helpful! I had never been to this neighborhood, but now I want to return for the Azorean Cafe & to check out the other shops.  I highly recommend a visit!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "B6cebDsY_HhAPmyr3iZBHA"
  },
  "jyuv4JP9T3rZOW5UBoXedw": {
    "date": "11/11/2018",
    "text": "I really want to love this place, given how much I like Azorean / Portuguese food.  But I have to say that the food is mediocre.   The space is very nice.  I would come back for a coffee or beverage to hang out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ASOJSBvDEN97TJWJz-4gug"
  },
  "q2JFxyaOe7aNiYIG_2PpMA": {
    "date": "11/11/2018",
    "text": "Fantastic addition to Bloomfield! Yummy food, friendly customer service, adorable interior. We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-_slTSnXPqkWPEYQshN96Q"
  },
  "FoGPNOddu2wrO8SbtfGwtg": {
    "date": "9/1/2018",
    "text": "So happy to see this place open! Order the baccalhau! Oh yea,  is great here. Excited to come back. I hear they serve dinner of Friday's. A great neighborhood addition to Liberty Avenue.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DbBIBn-HaNUROgAnpoJT5w"
  },
  "KKTw-JWDojiCIAVrYeHcEw": {
    "date": "7/26/2018",
    "text": "Skip the big fast-casual chains in the East End and hit up Azorean for lunch. It's also fast, also casual, and chances are you'll get a much more fresh, house-made, and delicious meal for the same, or less, money. Service was very friendly and the portion sizes were generous. I had the tuna salad (which was phenomenal), but everything on the menu sounded delicious. Definitely check it out. Street parking along Liberty and the side streets usually isn't too bad at all, either.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KlDVwjPGoo-FDQunJLch0g"
  },
  "kS948dQFVx7XoNbBGQw5Zw": {
    "date": "9/7/2018",
    "text": "I stopped by for a quick bite in between appointments at West Penn. The food was delicious, staff was super friendly, and I was able to purchase some of their amazing hot sauce for my own kitchen right there. I couldn't wait to brag about the amazing eats to my foodie husband. We will be returning together!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OF8-olwZK5dqZ12RHPmJkw",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Best. Tuna sandwich. Ever.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OF8-olwZK5dqZ12RHPmJkw/o.jpg"
      }
    ],
    "user_id": "DZ15vvS9PaVVcI4FVkG9aQ"
  },
  "g5JrT8a8GwtupIAfUXzeTw": {
    "date": "9/29/2018",
    "text": "So far I've been to the Azorean Cafe twice and it did not disappoint. The atmosphere is calm and it's a nice place for brunch/lunch. The staff there was friendly and the food was good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O7sI40vBXeO30t7u8J7blQ"
  },
  "P6uyG-VtBMfm7OZ9x_C83g": {
    "date": "1/7/2019",
    "text": "The chorizo and egg breakfast sandwich is outstanding, mainly because of how delicious and buttery its roll is. Strong coffee and very friendly, helpful staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jBNrsQoi6WFO-hjzTjbFug"
  },
  "8U-PE_M_q5OrkwVj1DowlA": {
    "date": "3/4/2019",
    "text": "My new favorite breakfast place in the Burgh! Great coffee, flavorful food and good service. The owner is lovely and the spicy red peppers are amazing! Love this wonderful addition to our burgeoning food scene",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sw_rjrANKW4YYJouweyU3g"
  },
  "ZzbPIwtN9w2P2kt-tH8MnQ": {
    "date": "5/28/2018",
    "text": "Excellent Pasteis and Octopus.  It has a coffee shop atmosphere with delicious food.  Authentically Portuguese.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4sqj5bfKE8WHicjFWIm6Pg",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4sqj5bfKE8WHicjFWIm6Pg/o.jpg"
      }
    ],
    "user_id": "8Pjb5UXyS5XmFvdTTNJnSA"
  },
  "pTcjW0ltUhS1ahFl2xKEHA": {
    "date": "1/19/2019",
    "text": "Food was flavorless and very overpriced. I paid $30 for mediocre food at best. Don't even waste your time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1cLsV3rtVyJQOHJ-GEST5w"
  },
  "U-2s46H2TBNd3TE7dOLl6w": {
    "date": "8/20/2018",
    "text": "OK. I came here for breakfast since most of the usual Bloomfield breakfast places were closed in preparation for the annual Italian Festival. Wrong move. Well, I'm the only one in the place, and I waited a long time for my food. I got the American breakfast which consisted of eggs, ham, potatoes, and a roll and coffee. I hated the coffee, but I am a \"coffee snob,\" so I'll give them that. The eggs were not flipped over, as requested, and the roll was bordering on stale. Good potatoes, good ham. Overpriced? You bet! Not coming back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1X4wsG8XOyam89CEdoRTYg"
  },
  "oB4Avs6Fs0adZv642XpSQA": {
    "date": "8/1/2018",
    "text": "Great American Breakfast!  Very reasonably priced, and the service was spectacular!  The only reason I didn't give it 5 stars was because the home fries were a tad cool at the center.  But the flavor was flawless, and everything was was spot on.  I recommend you give it a try.  You won't be disappointed.  Kudos to the restaurant!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "grMVAzegay35qkhITeFrYw",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/grMVAzegay35qkhITeFrYw/o.jpg"
      }
    ],
    "user_id": "KdGXfFMzgJ4nKX721L5O1g"
  },
  "xWOJWpHxlBVWre5-pBerlw": {
    "date": "6/24/2018",
    "text": "Stopped in for breakfast. The owner was very helpful and friendly in explaining the food. She's clearly passionate about her food and keeping in the tradition of her home. Great food and experience. We'll definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SYr8GwpmSfyiYjtJlA-bOw"
  },
  "deP5Hjyw6JPt_KY8U2c97g": {
    "date": "12/20/2018",
    "text": "An amazing place to grab breakfast. Some of the best and smoothest coffee I have ever had. The breakfast sandwiches are filling but feel light on your stomach while eating. It's a great place to start your day off. Love the staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JVDjyNzfRp5oXapMohUUgw"
  },
  "ATMnCwm43268sGtUkwjIcA": {
    "date": "6/10/2018",
    "text": "This place is great. We've been wanting to try it since it opened and stopped in for breakfast today. We had breakfast sandwiches and home-fries, both of which were delicious. I also had one of the best lattes I've found in bloomfirlf. Very chill vibe and super friendly staff. Will definitely come again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xcx3Gq0yDBXgm5MhZBh7yg"
  },
  "kfEyudWCvUv8TJBnSaejEQ": {
    "date": "5/31/2018",
    "text": "Have visited twice.  Once for a late lunch and once for breakfast sandwich take out.  First, the staff is very friendly and will explain the items on the menu.  Elsa the owner is very sweet and checking on you and your satisfaction with your food.  The Egg, Cheese, & Presunto, breakfast sandwich is very good with a salty Presunto, cheese and a well cooked egg.  My order of home fries were so tasty!  The home fries include red pepper, onions and nicely cooked potato.   Really enjoyed the Feijoada for lunch, a Portuguese stew of beans, pork, & chorizo.  A very large bowl of deliciousness.  If you are interested in coffee and pastry, or breakfast, or lunch.  Stop by and welcome your new neighbor.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 25,
      "cool": 16
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "5uBoLpiYQLlAmWh7thb_QQ": {
    "date": "2/5/2019",
    "text": "Azorean Cafe is a great example of the growing food industry in Pittsburgh. This Azorean/Portuguese cafe is located right on Liberty Avenue in Bloomfield and offers a very unique menu for breakfast and lunch. You have the option to order classic American food, but there are also a lot of great meals for those daring enough to step out of their comfort zones. I decided to try a traditional Azorean lunch and ordered the Polvo Guisado, which is a baked octopus dish that resembles a sort of stew. The flavors were very foreign to me but I really enjoyed it and appreciated the quality of the food. My friends ordered omelettes for their meals and were all very content as well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c6QuFIpeAZgziUN7biCz8A"
  },
  "7iyTjfFIu3msMmHwpbeg7A": {
    "date": "7/23/2018",
    "text": "I wanted to like this place, but I just didn't.  The staff were all very friendly and the little nata that I got was good, but I really didn't love any of the rest of it.     For starters, they have those terrible chairs that are popular everywhere now - you know, the metal ones where you have to be tiny or suffer though the back support digging into your butt and sides.  Even the smallest in our group (who might be a size medium) was uncomfortable.     The food didn't wow me either.  I love all types of cuisines and was excited to try everything.   We sampled the salt cod and octopus casseroles along with the chicken and pepper sandwich.  I also got a shrimp fritter and the nata from the case.   The salt cod casserole looked great with a cloud of egg whites on top, but under that was a bland and soupy mess.  The octopus was the best dish of the bunch, but was mostly potato and sauce - very little meat.   The sandwich was 80% bread with a thin piece of chicken and a few peppers.  The side of homefries were partially undercooked.   The shrimp fritter may have been good, but it was unevenly warmed (warm outside and cold inside).   The nata was delicious.     Between the uncomfortable chairs, the incomplete menu (none of the stuff in the case was listed on the menu and they were out of several things that were listed on the menu), and the food not being great - I just didn't love it.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h9LPugJk2cpIh0gmQb5LnQ"
  },
  "oNE3CE_-S0esfaF7C6-RkQ": {
    "date": "6/26/2018",
    "text": "I cant wait to come here again and again. Just stopped in for breakfast. It's so freaking CUTE. I got an egg sandwich and an ice coffee. Their bread is the best that I've had in a restaurant, a crusty roll that is so soft and flavorful in the inside. My iced coffee was delicious. Usually when I go out for breakfast they give me more food than I can handle, but the portions here are perfect. I'm excited to go back and see what they have for lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZrB9HYLluhEUKsLv3oChHA",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZrB9HYLluhEUKsLv3oChHA/o.jpg"
      },
      {
        "img_id": "MU9QrLhruugGflhI4-uejg",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MU9QrLhruugGflhI4-uejg/o.jpg"
      }
    ],
    "user_id": "JeIVRtZiwUnSP9qR4AmfEQ"
  },
  "MZrxoiQIUhQJsQCp6tKOTQ": {
    "date": "5/29/2018",
    "text": "When I stopped in here, I did so without realizing they had just opened two days ago. The atmosphere is casual which I liked. You order at the counter and if you are eating in, they'll bring your food to you. Since it was a hot day, I ordered a cold brew coffee which was very good. There were quite a few coffee and tea options. I look forward to trying the casserole and hot dishes, but today was a scorcher so I ordered their tuna sandwich with a side salad. The tuna was delicious and not heavy with mayo but included tuna, eggs, potatoes, olives, and vinegar with a touch of mayo. I had it in a croissant which was delicious. The side salad simply had cucumber and chopped onion. While there was oil and vinegar at the table, I would have preferred it dressed up a bit with something flavorful.   It was quite warm in the cafe though and since it was so hot today, I was looking for some respite from the heat so in that sense it could have been a little better.   The service was so nice and friendly and they were very happy to answer any questions! Looking forward to trying more!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "g2txWPa-CjE0Aebbu530bg",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g2txWPa-CjE0Aebbu530bg/o.jpg"
      }
    ],
    "user_id": "3AZMZDx9hA7tABJvCSacaw"
  },
  "97wxzGcl-inmeHaygKqtVw": {
    "date": "12/29/2018",
    "text": "Great place!  Workers were nice and food was unique and delicious!  Coffee was described as \"bright\" and kind of acidic.  My latte was good.  I also ordered a custard-type Dessert to go which was ah-mazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "btCdVn5-1k6KK26v2eVUAA",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Azorean French Toast- yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/btCdVn5-1k6KK26v2eVUAA/o.jpg"
      },
      {
        "img_id": "HpifKTwHZEAE6W-MD4dpnw",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Cute set up",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HpifKTwHZEAE6W-MD4dpnw/o.jpg"
      },
      {
        "img_id": "Dyy-Qo9tSJiFaWYVdjvZ0A",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Egg, Cheese, and Chourico Sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Dyy-Qo9tSJiFaWYVdjvZ0A/o.jpg"
      }
    ],
    "user_id": "lijIRCkem3GH0r74wkU_qg"
  },
  "POzgv1wshuvXvnc3BpFbuA": {
    "date": "9/30/2018",
    "text": "Great sandwiches, fresh bread, and delicious desserts.   Excellent espresso and the kids thought they made  great eggs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g0m1SX4mxT8XMsWynhYnug"
  },
  "Lc5L5qR64l1qmb6dSWle9Q": {
    "date": "12/6/2018",
    "text": "Meh, it was alright. The service was great but the ambiance was just okay. The food I tried tasted like it came directly from a can with some spices added. I was underwhelmed by the whole experience. We had dinner plates for brunch and serving sizes were appetizer-sized. I think this might work as tapas, but for me it wasn't good enough to recommend or go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "t_khB2KSRrWMQ1wWWwE8MQ"
  },
  "M9applBmZ1HZ__lHybPQKA": {
    "date": "5/26/2019",
    "text": "Amazing food. We got all of the mains and shared them as a group. Incredible salted cod dish, tender baked octopus. Spotless restaurant with impeccable service. Definitely a must-try restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8UBeyGyfYlpwky1OIvZm9A"
  },
  "6O5nUXucdtAxeRhuclEgbQ": {
    "date": "8/13/2019",
    "text": "I've always had such great food and service at Azorean Cafe. This isn't just a coffee house or breakfast place...this is definitely where you go to expand your horizons and find new things to fall in love with!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yt3RK_eQV_8FnaIKr4jpsQ"
  },
  "CjY1CW-J3U0xDQtVM7dYww": {
    "date": "10/6/2018",
    "text": "Cute place with soft welcoming decor. Felt welcomed as soon as I walked in. Dishes were simple and delicious. Seating was a bit limited but we found a seat in the back facing the television. I picked up a pineapple chocolate to go for the road.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UaHFrZGcWbkr2A_G8I_iUA",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UaHFrZGcWbkr2A_G8I_iUA/o.jpg"
      },
      {
        "img_id": "jHTiGy6QpsoMblxG0RjYSQ",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jHTiGy6QpsoMblxG0RjYSQ/o.jpg"
      }
    ],
    "user_id": "JnC4Mba7FB2VStcnE6nIpA"
  },
  "Sn6DxQcrmFCDHzqzIwnV6g": {
    "date": "4/28/2019",
    "text": "Incredible food pastries and coffee. Nice location. Nice employees. Going back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KIMyrN-3z6TlW4jXOqtg5g"
  },
  "YCojTg_7zy28qm06QbOIiw": {
    "date": "7/15/2019",
    "text": "I had brunch here yesterday. I'd messaged them through Instagram on Saturday since I wasn't sure if there was outside seating available and I wanted to take my dogs. I'm one of those people. Turns out they have 2 cafe tables. They thoughtfully reserved one for me and had a dog bowl of water ready for them. So kind. Staff is kind, attentive and eager to answer questions about all the selections. Had the French toast. It was delicious. Not soggy, like some places, but creamy texture. Perfect amount of cinnamon. It was served with island jam which tasted, to me, like fig, maybe with some berry mixed in, and maple syrup. Both the jam and syrup were served warm so they didn't adversely affect the French toast. I had the ginger plum tea to drink. It comes unsweetened and is so good that it doesn't need anything added. I'm coming back for lunch very soon because the sandwich all sound delicious. The gentleman at the other table had one of the breakfast sandwiches and he said they're great. He comes every weekend for one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dyHFsIS9Ft-TLYTpOAvWyw"
  },
  "HzJD14Ze83YPOsLNptIDqw": {
    "date": "7/17/2018",
    "text": "Wow! What a great find. Authentic Portuguese food cooked by the owner. Her childhood recipes to boot. Obviously she knows what she is doing. The lunch we had was amazing. We had the cod casserole and a octopus casserole. Both exceptionally delicious. My favorite was the Cod. Great prices, great service, an immaculately clean restaurant. Must go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "047nXYmCNpcQozEYJDXEow",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/047nXYmCNpcQozEYJDXEow/o.jpg"
      }
    ],
    "user_id": "54e80yq9nBTaDLig4AnusQ"
  },
  "U_adFlD6B2HdpreTYe1A6g": {
    "date": "6/10/2018",
    "text": "Excellent prices for quality, fresh food. The food was very flavorful and the coffee was delicious. If you like spice, try the hot sauce!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wmBrrxamK2Dud-VVM_zw8g"
  },
  "Gl5irkVUxBrk_U0iXK8a3Q": {
    "date": "5/27/2019",
    "text": "I went for lunch here on a holiday. It was a little too busy for the amount of staff they had but not too bad. I tried the feijoada, which is a black bean and carrots stew with chicken. It was hearty and flavorful, with a generous chunk of bread a lot like French bread--crispy on the outside, soft on the inside. I had a cup of regular coffee, which I thought was really quite good. This is a nice change from everyday food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lEmOm6OwiyO30YbFjpgu5A"
  },
  "SwkpNuqSxTbU6VpoSiDhCw": {
    "date": "6/27/2018",
    "text": "I was super excited to try out this new spot in Bloomfield - It looks cute inside and also has a couple outdoor tables. But - I don't think I would go back. It is a Portuguese restaurant, however, the food really just tasted American to me.. It just wasn't 'different enough' as lame as that sounds. Maybe it's what we ordered, but it was a let down.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7RsuhiXzzv1QSfPnDfjpnA",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7RsuhiXzzv1QSfPnDfjpnA/o.jpg"
      }
    ],
    "user_id": "IriUViOKC4vfWOhQ6SKX5g"
  },
  "Qkg3C5jX-MU1IsVpbSziyw": {
    "date": "7/22/2018",
    "text": "Very friendly and fast. The atmosphere is very inviting. You can sit inside or outside for brunch. I highly recommend the ham with breakfast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uLeLiAMrmzjP194tJKULZA",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. The American breakfast with twist.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uLeLiAMrmzjP194tJKULZA/o.jpg"
      },
      {
        "img_id": "Lxr-83lbXmLnAbCLRIuSVQ",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Lxr-83lbXmLnAbCLRIuSVQ/o.jpg"
      }
    ],
    "user_id": "A5CDMr5mL82W-VzXRPJhqg"
  },
  "O4AW0EizUJivNOBUwNYo8w": {
    "date": "1/18/2019",
    "text": "I was pretty disappointed. My boyfriend was too. We went here for dinner after hearing good things about their breakfast. We both felt like we were paying $20 for something that could have come from a $1 can (certainly seemed like it). Nothing really tasted like much, there wasn't really any depth of flavor to anything, nothing was interesting. Both of our dishes (the seafood paella and the galinha) were supposed to have sausage in it.  The galinha has one piece (about the size of a quarter of a slice of pepperoni) and the paella had none. Would not recommend, at least not for dinner.  I've been for coffee and they sell good coffee.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3pEz4WL31d7k31GTu3_7MQ"
  },
  "uzLeVkXJEydIPfeNT4MSgA": {
    "date": "2/10/2019",
    "text": "Fast service, great food, cute atmosphere! The coffee drinks are always great! My boyfriend and I stopped by for brunch I had the French toast, so good loved the jam it came with! My boyfriend ordered a meat and egg skillet it was delicious. Would definitely 10/10 recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g_7XK6n_8cnYjWqr-1GoWw"
  },
  "xOr1a5bSXJ2SKFUUeDqcug": {
    "date": "9/18/2019",
    "text": "Kudos to the owners for believing in their product and not masking their origins with some mass product cuisine. Like Portuguese would say - if you like it, you will come again and if you do not like it, you will not come again. The owners give their best with emphasis on traditional cuisine and do their best to explain it. Salted cod casseroles was amazing. It was not just great taste but the texture too. The egg whites give it very fluffy feeling. Octopus casserole had delicious octopus that was chewy but flavorful. You can certainly smell delicious wine in the first class meal. Every item of the appetizer dish could stand on its own, island cheeses were surprisingly gourmet. The whole experience was as if you transferred to these islands, enjoying Portuguese cuisine. I was very happy to support great small Portuguese-American business. You should try it too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "S1E9bAKbnNJVulFfgBiC8w"
  },
  "_gCteJKkP9J71OhrTjj-qA": {
    "date": "5/28/2019",
    "text": "We came for brunch on Memorial Day. They staff were super friendly and communicated regularly as they were slammed with a lot of folks. The decor was all really lovely. I liked the blue hydrangea theme that was held throughout the restaurant. There was also a nice variety of seating options.  For food, we have the egg, cheese, and chorico sandwiches, French toast, and feijoada. Everything was delicious! Their bread was super fresh. The cherico was nice and meaty. The French toast had a nice blend of sweet and fruity flavors. All their prices were super reasonable as well. I saw a lot of tasty Portuguese treats in the bakery care but was too full to try any. Next time! Definitely worth checking out if you want some chill, Portuguese brunch. Keep in mind it can be a bit of a wait if they're busy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Ej82Aol2HwbUUA_4_Vjdiw",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. French toast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ej82Aol2HwbUUA_4_Vjdiw/o.jpg"
      },
      {
        "img_id": "UmdJT3um9rAXf7OULSeqPQ",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Egg, cheese, and chorico on a Portuguese English muffin",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UmdJT3um9rAXf7OULSeqPQ/o.jpg"
      },
      {
        "img_id": "bhIi3vjljxNMalRLP5JAUw",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Feijoada",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bhIi3vjljxNMalRLP5JAUw/o.jpg"
      }
    ],
    "user_id": "e7MEzEQMjqNPZfYthZKhwg"
  },
  "50hh4aw-LpKX2tyMcmqS7g": {
    "date": "8/31/2019",
    "text": "Finally made it to this much heralded cafe in the Bloomfield section of the city. Delicious freshly prepared food and coffee drinks. Pleasant, efficient service as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fw2TPXX4Vli4-UniBlbK4Q",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Azorean style latte",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fw2TPXX4Vli4-UniBlbK4Q/o.jpg"
      },
      {
        "img_id": "qZefXzlkNelOvAMCmA6lpw",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Omelette Chourico",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qZefXzlkNelOvAMCmA6lpw/o.jpg"
      }
    ],
    "user_id": "tR12WeWha2DGhUrKcvTttQ"
  },
  "0gINvvinwCVSuEy4ThOxaQ": {
    "date": "6/23/2019",
    "text": "Very tasty breakfast sandwich with special ham.  The coffee was good.  The potatoes had a nice spice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fwHPacBL4lxA4gO-DUikgg",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fwHPacBL4lxA4gO-DUikgg/o.jpg"
      }
    ],
    "user_id": "_EPzTjxyIths4TOsMogalg"
  },
  "3vyx9d8vvt92MeyosxIJiQ": {
    "date": "2/9/2019",
    "text": "I really wanted to love this place because of the good reviews and how kind the staff was, but unfortunately I did not. The coffee was good, but the food was pretty disappointing. Both dishes were cold and had very mediocre flavor. I'd go back for coffee & pastries but likely not for a larger meal.   There's paid street parking or limited time free street parking in the surrounding area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "N_g_xSN_TOiSqB9kE-J_9w",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Salted cod lunch casserole; $11.75; 3/5 stars",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N_g_xSN_TOiSqB9kE-J_9w/o.jpg"
      },
      {
        "img_id": "zShiN9jGRm1PG8ulnQeHBg",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Salted cod lunch casserole; $11.75; 3/5 stars",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zShiN9jGRm1PG8ulnQeHBg/o.jpg"
      },
      {
        "img_id": "yvxrMHKNdAr1AeS06ExqRQ",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. American breakfast; $7.99; 3/5 stars",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yvxrMHKNdAr1AeS06ExqRQ/o.jpg"
      }
    ],
    "user_id": "vekZnPvP0s9LT8lEvGXnKw"
  },
  "Gv5GufcEe6miXO9ql0ELuA": {
    "date": "9/9/2019",
    "text": "Incredible Azorean latte, best omelette ever, and juiciest chicken I've ever had. Couldn't have had a better experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sZJxc4SvVfLlNLfaZCEutA"
  },
  "kuEiU-XPkZO0YJYn6ngATg": {
    "date": "10/31/2018",
    "text": "I visited about 2 weeks ago with a friend and we ordered a variety of foods to try. Both of us had never had Portuguese food before so everything sounded and looked enticing. I've had a typical Chinese egg tart before but the Portuguese egg tart or the nata was a lot more creamy and soft-tasting. The cinnamon cappuccino was really warming and had a great presentation. The shrimp entree and the sauce that came on the side were well-seasoned and flavorful. It was bit of an annoyance to pull the shrimp tails off, however. The chorizo omelette was pretty standard and straightforward and the home fries are different from typical but was still pretty good.   I would definitely return to try the other drinks on the menu as well as the other pastries.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "S8eSEz7nJBXD76TXjDOQKg",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Cinnamon cappuccino, shrimp entree, and chorizo omelette",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S8eSEz7nJBXD76TXjDOQKg/o.jpg"
      },
      {
        "img_id": "QgXYd1YqOoyohanxmXr5Cw",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Portuguese egg tarts",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QgXYd1YqOoyohanxmXr5Cw/o.jpg"
      }
    ],
    "user_id": "a7-q9Ni3McqzcAHULxgdFg"
  },
  "b_xBznsJbZeTNg05Z0_7lQ": {
    "date": "9/29/2018",
    "text": "If you're looking for authentic Portuguese food this is the place! Located in the heart of Bloomfield's business district on Liberty Avenue it's an easy commute from anywhere. The decor is very reminiscent of Portugal and the Azores with paintings, photos, paint colors, tableware and more. A roomy space with an airy feel. Table and counter seating in front as well as a back private dining area that's perfect for a group of six or more. The cafe is a breakfast and lunch spot that holds Friday night dinners. We've had breakfast and dinner here. Absolutely amazing dishes full of flavor and love. The coffee and espresso menu boasts even more goodness. Some of the best coffee I've had in the city. Portions are sized just right and dinner is served with baskets of breads and spreads. So good we're often there multiple days in a row.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "UaJwD2ALE8mEuEVV6KqEzA",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UaJwD2ALE8mEuEVV6KqEzA/o.jpg"
      },
      {
        "img_id": "rX4wZWGPBQoFKYB5Sml78A",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rX4wZWGPBQoFKYB5Sml78A/o.jpg"
      },
      {
        "img_id": "aLrtBBoW2lEEm1G8Ko9PTg",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Private dining area.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aLrtBBoW2lEEm1G8Ko9PTg/o.jpg"
      }
    ],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "BcC63h_urfRYYRQmQMwXKw": {
    "date": "7/2/2018",
    "text": "I came on Sunday around 12:30 looking for a lighter lunch. Instead, I ordered a feijoada and that was that. It just called to me. I added a cappuccino to the order as well. The place was packed. The only available seats were two chairs meant for reading while enjoying coffee, so I took up a spot there and waited. My cappuccino arrived shortly thereafter, so I was content for a bit. The cappuccino was beautiful and made well. The cinnamon stick was a nice touch, though I wonder about food waste sometimes.  There was a wait for the food and when it arrived, I looked for a new seat as those chairs and an end table wasn't the way to eat this dish well. I moved to the stools up front by the window and people watched as I ate. The dish was quite heavy with mostly black beans. It was slow cooked and with some care. There was pork, but not the chorizo as described. The bread it  came with was good, looks of carbs with this meal. It reminded me of food from my South America adventures, so the cafe's Portuguese description resonates. I ate half and the rest was lunch for the following day.   I found the food good. The service was a bit off. I didn't get a table number, which really perturbed the waiter. He was looking for who ordered the feijoada and was frustrated by that. He also didn't seemed too thrilled when I moved seats upon getting my food. Setting his reaction aside, I carried the plate and mug across the way. Maybe a bad day he was having.  It's an interesting spot. I was hoping to see Portuguese egg tarts. Alas, none here. Good drinks and food still!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "HhiZbz7ahfdExYBcL4giIg",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Mista",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HhiZbz7ahfdExYBcL4giIg/o.jpg"
      },
      {
        "img_id": "UBuuWAZq7pDNlxrcFJ_dbg",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Portuguese egg tart and espresso",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UBuuWAZq7pDNlxrcFJ_dbg/o.jpg"
      },
      {
        "img_id": "VnAThKbeeChd30kNA1QW4A",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Meija Leite: cinnamon cappuccino",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VnAThKbeeChd30kNA1QW4A/o.jpg"
      }
    ],
    "user_id": "2i0A5OoKyiwskqvnkGq7cA"
  },
  "NeJn41oeDk6z298avRVypQ": {
    "date": "1/30/2019",
    "text": "SUCH a lovely spot. Very relaxed inside- seemed like a good place to pick up a quick drink, sit and study, or sit down for a proper meal. I ordered the Galao latte which was deliciously sweet and came with a cookie! I also tried the custard tart and wish I could've tried all the pastries. I've got my eye on the almond tart for next time. I also wanted decaf coffee and the employee very sweetly brewed an entire pot for only me. They had several vegan and vegetarian menu items so I can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "o5WoUxNoAReQw1mdsDyh-A",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o5WoUxNoAReQw1mdsDyh-A/o.jpg"
      }
    ],
    "user_id": "x9nQbcpKEFcs5Q2fCUGDng"
  },
  "bOc5V3cwQfR7laIopjTrkQ": {
    "date": "8/6/2018",
    "text": "A very welcoming and casual environment at this small cafe to enjoy delicious breakfast, lunch, (and possibly dinner in the future!). I saw one of the sandwiches posted here and wanted it so badly that I dropped in on a slow afternoon just so I could try it. I'm pleased to say that I was not let down, but I think a few suggestions could really boost it from great to out of this world.  - When I walked in, I was greeted by the most friendly and welcoming receptionist I've ever met. I basically described to her that I wanted whatever I saw online with little-to-none descriptions, and she reassured me that the kitchen could whip up whatever it was I wanted, which I'm so pleased that they did because who else serves gourmet breakfast sandwiches at 2PM on a Monday? - The sandiwch had a runny sunny side up egg, sauteed onions and red bell peppers, and a shaving of cheese. To say that the bread was amazing is an understatement.   Overall a very delicious sandwich; however, a few bites had only egg. I think a more generous serving of the vegetables would have really elevated the sandwich so that every bite would capture all the flavors that this sandwich has to offer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t2k0Ec7UCjSImM4wKMdghg",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Fairly open and more private seating space toward the back of the cafe. A calm and relaxing place to lounge with a book",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t2k0Ec7UCjSImM4wKMdghg/o.jpg"
      },
      {
        "img_id": "pPpRXiWaBthck4fp-eG0LA",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Beautiful storefront with a few outside tables to enjoy a warm, summer breeze",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pPpRXiWaBthck4fp-eG0LA/o.jpg"
      }
    ],
    "user_id": "wRtDGmMriHBQSfqW15szJQ"
  },
  "-QLsBkPE_9hgXOkrnsmbeA": {
    "date": "8/10/2019",
    "text": "Authetic portuguese food just like my vavo used to make! Friendly atmosphere, quick and capable service, delicious coffees and great prices. It's a regular stop for my husband and I. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7pGe0_bCwWfMKJGVU9Htcg"
  },
  "sx3LVw1xCSeVrhUPozwqwA": {
    "date": "1/17/2019",
    "text": "I met a friend here for beverages on a Saturday around lunch time. It was highly recommended by one of my patients and had been on my list of go-to places for awhile. Parking in Bloomfield can be difficult but it was not overly crowded and there was a side lot about two blocks away that charged $1.00/hour.   We were greeted by an employee the moment we walked through the door. She took us up to the counter and began taking our orders. My friend had the coffee passport and had three options to choose from. They were out of one option however the employee was willing to customize one of the other two to serve my friend. I went with my usual coffee shop purchase but with a twist - a chai latte with almond milk. I could not tell if there was an upcharge for the choice of milk but for a classier, \"higher end\" shop, the price was not bad. Though we only purchased drinks, there were several food options such as pastries, breakfast items, sandwiches, and they were advertising that they are now open occasionally for dinner.  When scouting for a place to sit, most of the tables in the front of the shop were filled. We continued walking towards the back of the shop and man, it went on and on!! We found a cozy corner beside a high top table that had two lounge chairs with a TV mounted above. It was perfect for privacy and for us to have a chance to catch up!  If you are in the area and need a beverage to warm up or a light lunch or maybe even a cafe styled dinner, this is a place to check out. Friendly employees, clean, orderly, and quaint, and reasonably priced.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rFeUNmWzV2sERSTc7-5Ujw"
  },
  "OI0hx8rADPK0LqZPh0MVMA": {
    "date": "4/22/2019",
    "text": "Love Nata! Last day in Pittsburgh for this term. Online order is really convenient. Good place to enjoy your breakfast and try new style of breakfast. I ordered Nata and the Ezgg&Cheese in Azorean Speciality Breakfast Category. Portugal roll was so soft and tasty, blending with medium eggs and melting cheese. Recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "_oFaihJVG0J1gAOFzHwnwA",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Nata",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_oFaihJVG0J1gAOFzHwnwA/o.jpg"
      },
      {
        "img_id": "k_NL9BkgfOUfRiDIwcpHLw",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Nata and Egg&amp;amp;Cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/k_NL9BkgfOUfRiDIwcpHLw/o.jpg"
      },
      {
        "img_id": "UtcvhJoITQotaaB-h3MKew",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UtcvhJoITQotaaB-h3MKew/o.jpg"
      }
    ],
    "user_id": "WowhLAOgB_YIT4PYQogTdA"
  },
  "QnIna6B2B4io-_nsKF_Fyg": {
    "date": "8/5/2018",
    "text": "What a lovely experience!! Good service, child friendly, good food, good portions and   They open early jejeje  Good coffee",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mTwxZmGw7vj_2jFeJkJuwA",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mTwxZmGw7vj_2jFeJkJuwA/o.jpg"
      },
      {
        "img_id": "-fT1REB2eQABB-C15Sifwg",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-fT1REB2eQABB-C15Sifwg/o.jpg"
      },
      {
        "img_id": "sUJ4n3kPb0uP-2oUPVktSA",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sUJ4n3kPb0uP-2oUPVktSA/o.jpg"
      }
    ],
    "user_id": "tJUlZAOBzWu39gXK0gEjJA"
  },
  "itgl5rj96TCn3kQqOmwfhw": {
    "date": "7/16/2019",
    "text": "Love this spot! Instantly transported to Portugal! Wonderful, authentic food and coffee. Such a gem in Pgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8He73wKwBY74gAJncSV2Ug"
  },
  "N-EYq3MJnIcyXIb1ymGjsw": {
    "date": "1/9/2019",
    "text": "We were killing time before lunch in Bloomfield and stumbled upon the Azorean Cafe and decided to stop in and grab a coffee. Well, all I can say is what a good find! It may not look like much from the outside, a long room, with small tables down one side, but it's spacious and bright, very clean, and there's a community room at the back with a big TV. (There was some sort of birthday celebration going on while we were there in the community room).  The owners are lovely and very hospitable, I went to order at the counter but they insisted that we sat down and that they would come to us. In addition to very good coffee (Intelligensia roast and mix a special blend for the cafe) the cafe has a small market that sells Portuguese products such as preserves and canned fish as well as bread and baked goods to go. There is also a kitchen that prepares sandwiches, breakfasts, omelettes, lunch specials and meat or fish casseroles. We didn't stay to eat as we had other plans but all the food that I saw looked delicious and was attractively presented. Everything was very reasonably priced and we will definitely be back to eat that wonderful looking food next time we are in the 'burgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "yga0sAW9eC7bAZsJeyogcQ"
  },
  "7jN3tUfXffzTEO5l31QNAg": {
    "date": "9/8/2018",
    "text": "A limited menu but a stellar showing on the items we tried. The coffee was mellow and tasty, and offered a pleasant accompaniment to our breakfast. We shared a shrimp croquette (creamy, shrimpy, crunchy), cod bites (tasty potato and cod morsels), and the bacalau. Everything was very rich but also quite tasty. We aren't big pork eaters, but their menu has lots of pork options. Also, with an obligate GF diner, they were extra careful and checked on all of the menu items (the shrimp croquette wasn't GF, but everything else we ordered was!). I'll be back when I'm craving some tasty Azorean fare.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WJC_B83CtSISKfXhRP73XQ",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Bacalau natas, coffee and cod bites",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WJC_B83CtSISKfXhRP73XQ/o.jpg"
      },
      {
        "img_id": "srSkLGDty2OFADvDn3sCiA",
        "caption": "Photo of Azorean Cafe - Pittsburgh, PA, United States. Shrimp croquette and hot sauce...mmmm",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/srSkLGDty2OFADvDn3sCiA/o.jpg"
      }
    ],
    "user_id": "xHvXI-rNuk52jehqnQS0eg"
  },
  "aagk0nRlYDZFQCsBuzXGWA": {
    "date": "1/12/2019",
    "text": "Lovely little place for Portuguese food - not to be confused with Brazilian food. We had the lunch entrees - shrimp in tomato sauce and the vegan feijoada (different from Brazilian). Wonderful service and great tasting food. Varied menu with soups, traditional Azorean and American breakfasts (with an Azorean touch). Great coffee and hot chocolate! And did I mention great service!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ySgudi16-WEjBdagdFTQkQ"
  },
  "iM59VKi9kJBhcdFTcE-GIg": {
    "date": "12/12/2018",
    "text": "Came here to meet a friend for coffee. She had a specialty latte and I enjoyed a traditional latte. We both really enjoyed our drinks and loved the atmosphere here. The customer service we experienced and saw with other customers was phenomenal. Truly, the woman working could not have been kinder or more patient with the customers she had. We had a really great time here and can't wait to come back to try their food next time. Their lunch items sound delicious! This is truly a new gem in Bloomfield!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  }
}