{
  "G2mu7IlNurA5M4E5xkfGlg": {
    "date": "5/7/2011",
    "text": "The best food from any bar I've been to in the 'Burgh!  Everything I've had on the menu has been fantastic and I've eaten there quite a bit. My favorite is a tie between the Chicken Quesadilla and the Bavarian Club.  You wont go home hungry...a lot of food for a good price.  The wings are awesome and the beer selection is absolutely top notch. Over 30 beers on tap...if you like beers that most bars don't carry, you definitely want to check this place out.   Definitely worth checking this place out. You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vvdye6RgE5Ak2IjBxIDvRQ"
  },
  "vpdsy-SKfsaiseS-TuNlfA": {
    "date": "9/24/2011",
    "text": "I Just found Cain's about two months ago - love it! Great service, very friendly and the best food I've had in the south hills.  Their draft beer selection is good and tastes great (hate flat draft beer) Bloody Mary Bar on weekends is amazing! Good seating and a nice mixed crowd. We didn't know what to expect when we tried their breakfast, but it is as good as Grand Concourse - no exaggerating - we will definitely be regulars. Cain's truly is family friendly, which is why we first tried it and we love it.  The chef always walks past and asks how your food is - great touch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uDlJUxQ84NW0UQ_7UPpStg",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uDlJUxQ84NW0UQ_7UPpStg/o.jpg"
      },
      {
        "img_id": "4O1KZx3vOyHNPe4udB9WkA",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4O1KZx3vOyHNPe4udB9WkA/o.jpg"
      },
      {
        "img_id": "4QqvZZ172GuunMVtxyWOSw",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4QqvZZ172GuunMVtxyWOSw/o.jpg"
      }
    ],
    "user_id": "gFhY1kCfkl6JSBEMSt1m2w"
  },
  "SxYJOQrHBBg3j9IGn_tRrQ": {
    "date": "11/17/2013",
    "text": "Love the smoked salmon! Excellent. Nice craft beer selection. Fresh food each time I dine. I do wish they had more vegetarian options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mIyOekSeriEs7kZ9UHGF6Q"
  },
  "GAcvfBswyinTfMsPuLBDsQ": {
    "date": "7/7/2014",
    "text": "Just brought home a \"steak hoagie\". If you like bad steak in a bun with nothing else on it then this is your hoagie. No lettuce, no cheese, no nothing. I am shocked and surprised and totally disappointed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iLbQVpe54zw99lEzZCu5Tg"
  },
  "367c2DsXsI0KY7Gc5WXqVw": {
    "date": "1/31/2016",
    "text": "We've been here a number of times and I still don't know why we come back.  Anything dealing with food is a train wreck.  The wait is always an hour or more, and the last 4 times several of the people at the table had to return their food because it was not cooked, or over cooked (burnt is what it was).  Today after waiting an hour and a half the food came out cold.  We sent the fried chicken back because it was so cold, and when the new plate came out, it was hot but raw in the center.  I'm done eating here.  I may come to have drinks, but never to eat.  Eat here at your own risk.  You've been warned!  If I could less than a star I would.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z8sDIGM_mUr2efR4kHSUvQ"
  },
  "JbmpjUuBz5X39t9KGX0BfQ": {
    "date": "6/12/2014",
    "text": "I ordered a burger and sweet potato fries, my burger was pink on the inside..not how I like to eat them.  Our waitress was initially very helpful and took it back to the kitchen to have them cook it longer for me.  25 minutes later my date had finished his meal and my fries were gone.  Our waitress never returned to let me know what was going on, when she did I ended up asking her to just box my burger up for me to go thinking I would eat it for lunch the next day.  When I re-heated the supposedly re-cooked burger the following day it was still pink on the inside.  So I am not sure what the kitchen had been doing for 25 minutes but it was not cooking my burger.  We will not be returning here!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bzPqZZvmBdCKOpz33QensA"
  },
  "dzfZrr3M3El2LvvzUDAG8Q": {
    "date": "5/25/2014",
    "text": "Stopped in for breakfast today.  Pros:  -we were seated almost immediately, and it was crowded!   -the meals we got were great!  Cons: -service was super slow. We waited over 10 minutes for a server to take drink orders after we were seated. I had told my wife that we were going to leave if someone didn't come over in 3 minutes more. It wasn't just our server, it seemed like many tables were waiting a long time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2rfasOe2P9jwTdLlKseRLw"
  },
  "gBkc5EHiOPnNBJQVNqsp0g": {
    "date": "10/30/2013",
    "text": "We go here quite often for lunch. The food is excellent. Service is friendly, but spotty. If your in a hurry for lunch, I would advise you call ahead. I think perhaps the time it takes is because food is made to order. A great thing for the quality and taste but not so much if you have a limited amount of time. The lunch specials are a fantastic deal, and no matter what else I get , I get the spinach salad. It's scrumptious. Definitely recommend this place. Dinner I have had a couple times and the food was good, but the lunch deals are awesome!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RL7HLEBCuD5a-qFneAigeA"
  },
  "ZTbVlQJTviS3XIvYhN5DZA": {
    "date": "5/27/2015",
    "text": "I really wish I could give this shit hole a zero but I have to give something. First we get in at 7 pm and after where seated we wait a good 15 mins for our waiter to show up to take our beer orders. Another 15 mins later and still no beer, another 5 mins we finally get the beer and of course everyone's beer is flat. Another god damn 15 mins later still no beer or waitress to take our food order. Finally after about an hour we get set with our beers and food, our damn food is ice cold. At this point I'm fed up along with everyone else and we call over the manager. This little dick head comes over and starts yelling at the four of us saying we either have a choice to eat or get out. We were more than happy to get the hell out of there with the shitest service and cold ass food ever. The long and short of it is that if you want to have a even good or a sorta good experience at diner without being told by a manager that I should stop talking, do not ever go to this place. Never ever go to this place if you even want to have a meal, or a hot meal if I should say, because this place will bend you over, grab the broom by the handle and sweep your ass out the door with it.   I've never had someone esp a manager tell me to eat or get out. That's all I have to say.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z8JLTeCBlSXWslttYzrELw"
  },
  "kij1XDWcHeObJ7q5VEnR6w": {
    "date": "2/26/2013",
    "text": "My husband and I love Cain's Saloon. The food is great, the drink selection is quite good, and it's a great atmosphere to watch a football and/or hockey game. We come here quite often.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GvYzuy5nwG9QWC7Mp11dHg"
  },
  "0UuD2JuydpM4H215JExbJg": {
    "date": "12/20/2015",
    "text": "Very delicious meal! My husband has been here before, but it was my first time. The food and service was wonderful. Very nice, casual, and inexpensive place. We'll definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r6zKHPmJmlPaND5LnMBEtw"
  },
  "o2i2fJ9MSVeF0QD1lfqqTQ": {
    "date": "7/3/2010",
    "text": "So yeah the wings are good just know some sauce choices are a dry rub. The fries are fresh cut, not hot when they came out   Oh ps no losers here, good atmosphere!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "9D2qJgX2D05hX7LmcyVMjQ"
  },
  "amRNDj8hhE2-6cxdCAqJbQ": {
    "date": "6/15/2012",
    "text": "Cain's Saloon has very good buffalo hot wings and sandwiches.  It gets a little noisy and crowded on the weekends, but the food is great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "yPyXt3P7KPxdlXTzuHonpQ"
  },
  "3s30e9pp2IEFxeQqlHnD6A": {
    "date": "11/19/2015",
    "text": "I love Cain's. The night time staff is the best. Especially John. Great food. They made me and my girlfriend regulars there. I am very happy everytime I walk in. If anyone reads this and you decide to go then please get the Brisket Sandwich. It is amazing. I have never moaned while eating, but while eating this sandwich I did.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "raI4gfR9fwuDIoRqcEAEYA"
  },
  "LX720IUmEX8A_nF8gNZQ0g": {
    "date": "5/21/2012",
    "text": "It was our first visit to Cains and we were very pleased. Food was very good and reasonably priced. We will be back if ever in Dormont",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "8LFMu4jD2njqbViXZ0iZYw"
  },
  "yRjyU1z7T-rgvnS5Xg9K7A": {
    "date": "1/1/2014",
    "text": "Good local bar with lots of TVs, good draft selection, and better than average bar food. Definitely a step up from the Saloon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "owsX5JI9cHzkCiTvuVGhVA"
  },
  "NEC7s8Y41KSTufg7KMTDZA": {
    "date": "9/1/2012",
    "text": "Draft selections are good...service is lousy...food is sub par. Not in a hurry to return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PAhdPwAR6iJnBKcF9iP-fA"
  },
  "2x_W6DhSuAD3FTbVc-HupQ": {
    "date": "11/2/2014",
    "text": "I would give this place half a star if I could. The service was the most appalling I have ever experienced. We ordered sandwiches and fries and waited a FULL HOUR for our food. After 30 minutes of waiting we had to glad down our waitress to find out how much longer, she laughed it off and said there were three tickets in front of us still. Our veggie burgers and fries came out cold but by that point we wear starved and not about to send our precious food back to that black hole of a kitchen, where apparently time doesn't exist. The waitress gave us our check, stated that the manager would not do anything for us for the long wait and she \"did what she could\" and discounted $5 from our $55 bill. HA! We requested to speak with the manager who avoided us for 10 minutes before she came over and made excuses about it being busy and other people ordering specialty items. She continued to make excuses and said the best she would do is discount 10%. What a joke. I would never go back here if someone paid me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MmpwaSR0C2kk1pgP0Pnx4Q"
  },
  "RtFnoTDwfO1_3EHy97Zp3w": {
    "date": "4/18/2013",
    "text": "The food is mediocre. There is nothing special about this place. It's in Dormont, trying to be Mt. Lebanon and a lost cause. It's like every other sports bar, and there are several which I prefer to this one!  Go there if you want to leave sorry that you wasted your money.  Most of the staff is also rude (complaining about making Irish Car Bombs, or accusing patrons of being \"shady\" if they join a table).  The staff that isn't rude is indifferent. And none of them are aesthetically pleasing enough to have this attitude.  Two weeks later and still NO response from the business and Yelp! won't post my review because they are bias and political.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qH9RGZoWONIgMX138HW4VQ"
  },
  "2NCqxMavCYcHZXpxdSUyBg": {
    "date": "9/30/2013",
    "text": "My husband & I have been here probably a dozen times.  Never once have we had a bad experience.  The menu has a large variety, and everything we've tried has been excellent!...best wings I've ever eaten!!!   Portions are huge and very reasonably priced.  Huge beer selection.  Bartendars are quick & friendly.  Great place to watch games....tons of TV's.     Only con:  The bar area isn't that big, so it fills up quickly.  Oh, and the parking lot that was across the street, is no longer there!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C7pVJtxnqReTjs7Gz7gjcA"
  },
  "SPmIwmxQHBnDNG6mpuEyMw": {
    "date": "4/16/2016",
    "text": "Rising prices here have made my review drop. The menu changes on build your own burgers and omelets were basically designed to nickel and dime you into buying a $13-$20 instead of just having something like a western omelet or bacon cheeseburger.   I thoroughly enjoy the build your own bloody Mary bar and 35 wing night here. But prepare to pay 50 for each ranch and $1.50 for 4 carrot sticks or celery, what a ripoff.   Sports events are great here with all the big screen TVs as well as the beer selection and specials.   My favorite side is the sweet potatoe fries and the portions are enormous. Service here is usually very attentive even when the place is packed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TxA2ocSTzfhuwqFNjRkZWg"
  },
  "Aqx_hWgwqbPFgpwUuAS5aA": {
    "date": "8/4/2014",
    "text": "It's a nice neighborhood diner, the food quality was descent and portions are pretty big.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ljI1r1zKMn4DQV6NT5JBqA",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Half a rack, pretty big",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ljI1r1zKMn4DQV6NT5JBqA/o.jpg"
      },
      {
        "img_id": "UAbojGYQkk2Qx8P5IpLk2g",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Open faced steak sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UAbojGYQkk2Qx8P5IpLk2g/o.jpg"
      }
    ],
    "user_id": "ZbJ_IVVjY-k2y4-g273qKg"
  },
  "A4ZEjbFuvWjqW7NxMxBGnQ": {
    "date": "7/2/2016",
    "text": "Great breakfast!  Been going here for breakfast for 3 years and it never disappoints.  The sausages are some of the best around and in general everything from the omelet to the pancakes are tasty and filling.  The bacon is thick and delicious.  Good coffee to boot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YY947NkToiE9W0bVme4n4A",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YY947NkToiE9W0bVme4n4A/o.jpg"
      }
    ],
    "user_id": "mdC03c8sk6PDSvCaVIoIbw"
  },
  "tC3IEUzTL87nHglOD1CZrQ": {
    "date": "6/18/2017",
    "text": "Sad to say I have to come back and edit my review and take it way down. The service here has gone downhill and the kitchen is slow. Holidays are always going to be busy, that's understandable. So we made a reservation last week and requested a high chair at that time.  Upon arrival, we were told we'd have to wait 15 minutes (which was closer to 30) for our table (despite the reservation). They told us the kitchen was slow and they were short staffed. No problem, we waited.   Once we were seated, we were handed menus and silverware and I was told they'd get me a high chair as soon as one was available. Slowly over the next hour and a half we got drinks (thanks to their truly kind bartender), then food. But no high chair. With a squirmy infant, it was very difficult to eat or drink a cup of coffee. At one point, about an hour after we were seated, I noticed that a previous table had left but we weren't given their high chair. So I found a waitress and asked her where I could get one. She said she'd return with one shortly. She never did. What she did do, though, was complain loudly (with her manager) to the table behind me about how the previous table she had was rude to her. Having witnessed the aforementioned interaction, I can say they were rude to her... unfortunately her manager was rude right back to them which only fueled the fire. I feel for her, I do, but to complain about another customer is also rude and unprofessional.   The food is decent. Nothing I can't cook at home. But we've been going to Cain's for years and while we've watched it go downhill, we stayed loyal because we used to have such good experiences there. Not anymore, though. The slow service is understandable and par for the course when dining on a holiday. But listening to a manager give attitude to customers and then shit talk them once they left to other customers.... not cool.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "67ci-zI-Z6ABxAxTJRsd_Q"
  },
  "F_2gF-xFmAsQvt39AgH3zw": {
    "date": "2/15/2017",
    "text": "Love this place. Amazing selection of draft beers. Food is average. The Bloody Mary bar on Sunday's and their breakfast is great! Atmosphere and service is always good too. Plenty of seating and the bar itself is large also.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "91kobM-jjYrLudkrfIPz3Q"
  },
  "J4IES8IZBGv0Gxi4YvBP4w": {
    "date": "3/7/2017",
    "text": "It's hit or miss for me. I used to love their breakfast but when I went the other day it just was not the same. Menu definitely changed. Lots and I mean lots of regulars. They're opening the top floor which will be nice but hopefully doesn't bring even more regulars, but that's what businesses like this thrive off of so I can respect that.   Lunch/Dinner/Apps are great. Wide selection and fair prices. Although when I sit in the bar I would prefer not to have the tables right next to the bathroom. When people come in and out you constantly get the lingering smell of toiler bowl cleaner mixed with your food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2YTAPdnmIhG4MH-voxXx9g"
  },
  "GgNVnpfetpuBzw2D1B3zqQ": {
    "date": "4/22/2013",
    "text": "Cain's is a TREASURED INSTITUTION in Dormont, and of course, it's a neighborhood favorite  It's a lot better for those of us who don't live in Dormont now that there is a parking lot across the street, but do be careful if you are attempting to cross West Liberty Avenue during rush (happy) hour!  I've been stopping at Cain's since I can't remember when, and maybe their tap selection has something to do with that.  I have never failed to find something interesting and crafty on tap at Cain's.  My favorite night to stop at Cain's is Wednesday.  I try to get there early, because later in the evening, the place is usually packed out, even though there is a lot of seating.  On Wednesdays, Cain's has a special on their excellent chicken wings.  They are done the right way, and among my top favorites in the South Hills.  You can't go wrong at Cain's during happy hour.  Half price on all appetizers and a dollar off all drinks from 5 to 7.  But my favorite plan of attack at Cain's is to arrive around 4:45 and order the \"half sandwich and a soup\" deal they call \"express lunch.\"  It is served until 5:00, and you can't beat a half sandwich and two sides for $5.99.  By the time my food arrives, it's happy hour and the beers are a buck off, but you have to be seated in the bar area, supposedly.  My favorite sandwich to get with this deal is the Reuben, served with some volcano chili and slaw, but I've had other interesting sandwiches there as well.  The chili has got some NICE punch to it, and I am definitely a fan.  I remember way back when this place wasn't so pretty, but they have done a nice job with updating the place and you won't be embarrassed to bring a date to this place.  But don't be surprised if you end up having to stand for quite a while before you can get a seat on a Wednesday night.  Chivalry is not dead in Dormont, which is one of my favorite parts of the South Hills, and I have seen young men give up their seats in favor of older ladies at Cain's.  Good people.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SMlvEGKJfniH43T37untWA",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Be prepared to MOVE QUICKLY if you are crossing West Liberty Avenue during rush hour to get a beer at Cain&amp;#39;s!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SMlvEGKJfniH43T37untWA/o.jpg"
      },
      {
        "img_id": "Obe9KGP68ok2K8sS6XpryA",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Plenty of INTERESTING and CRAFTY TAPS at Cain&amp;#39;s Saloon!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Obe9KGP68ok2K8sS6XpryA/o.jpg"
      }
    ],
    "user_id": "gdJasOzvva2NxSpNjVXwvQ"
  },
  "O5_wbjYrxhhgfPJcCoshfQ": {
    "date": "11/9/2015",
    "text": "The service sucks!! My boyfriend and I went to eat a late dinner (after 8pm) and the place was busy but still that is no need for the service to suck! We sat down in the back and waited for someone to come say hi and to get a drink order. Once we finally got acknowledged we ordered and waited well over an hour for our food. After an hour we got fed up and stood up to leave and to complain to the manager. People who sat down after us got their food so we were upset. I went to the bar and asked for the manager and the guy bartending was one. I told him what happened and he said he was sorry we waited and that they had two call offs. The waitress came up and said our food was here but we didn't want it and left. I won't be back. They need to get better service...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Pm38n2uOOu82NGvYj31cg"
  },
  "obOuz18sfanD6WfXbKoz0Q": {
    "date": "11/5/2016",
    "text": "I really should give this 1 start but I hate to do that and their food is not bad. It's the service-they just can't get it right.  We went for breakfast on a Sunday morning around 10 and it was busy but not packed. Well you would have thought it was Super Bowl Sunday with the Steelers winning they way the wait staff was acting. We were seated and a booth opened up right after we sat down so we jumped at the chance to move. Our waitress greeted us and apologized that they just seated all the tables in her section at once and she would be with us as soon as she can. It was a few minutes later that she took our order-ok no problem. We all got eggs of some sort. Well 40 minutes later we are starting to get restless and other tables that came in after us are getting served. We asked our waitress multiple times what is going on and she apologized and said she should have told us from the beginning that it takes a minimum of 45 minutes to get your food. Seriously are you kidding?  That is crazy for eggs even on the busiest of days.  After an hour and ten minutes had passed we could wait no longer and were headed out the door-I have never done this before but it was getting ridiculous.  On our way out the waitress stopped us as our food was there.  I got an egg, cheese and bacon sandwich on a bagel. It was not bad.  My fiance ordered a steak and cheese sandwich with a friend egg and they forgot the fried egg. He was so hungry by this point it did not even matter.  The waitress apologized again as she knew we were not happy. We asked her 3 different times for the manager and he never once came to see us.  On top of all of that they did not even give us a free orange juice, We had to pay for the entire meal.  On our way out the waitress said she hopes this will not prevent us from coming back-well it does unfortunately. We had 2 guests from out of town with us that were appalled by this service.  I was also really disappointed with the manager for not taking the time to settle this-all it would have taken was a free entree or two.  The only thing I can end with is I recommend you stay away from this place for brunch and know going in you will have bad service because the food is pretty good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bu1mtWwxuayzV6b3VScWLw"
  },
  "Zd7oWcYNc_HZ9hkvpmQqLw": {
    "date": "2/8/2017",
    "text": "I used to love this place now its disgusting.  The last 3 times we went we hated it. Freezer burnt, old, bland, food. The cheese balls aren't even the same! What a waste of money on garbage food.  Disgusting! Save yourself and go almost anywhere else!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UJbspirAHj_MuEa4Dwp64A"
  },
  "6t-gaI2NjQBOBi2H7LlILw": {
    "date": "2/7/2017",
    "text": "It was ok. Food was good Service not bad. Didn't appreciate the ceiling fans blowing on my food. Coffee good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ixeALmgJ1aBAYIh0F3cnJQ"
  },
  "fvvroJEmSHhAN-LSc4C6HQ": {
    "date": "10/18/2016",
    "text": "Well, we literally live 2 minutes away and decided to try breakfast. It was myself, my wife, my cousin and his girlfriend together for a birthday brunch. It was about 1/2-3/4 full, not surprising for a Sunday. The arrived shortly before us and when we got there it took about 15 minutes to just to get coffee and water. I felt badly for our server Anita, who was nice but obviously stressed. I ordered 2 eggs fried hard, wheat toast and homefries; the wife ordered a French toast bowl, and I ordered donuts for the table. After waiting a considerable amount of time the donuts arrived; obviously the oil wasn't hot enough because they were soaked all the way through. So between the 4 of us we ate about 2.5 before the grease just became way too much. After another bit, our orders arrived. My eggs were far from the 'fried hard' that I ordered, and my wife didn't even get the right thing. I couldn't eat my eggs because the runnier, the grosser...to me and again not what I ordered. The toast was luke warm and the homefries had clearly been sitting alone in a dark corner asking for forgiveness before arriving at my table. Now my wife's dilemma. She ordered a french toast bowl with apples and pecans...what did she get? French toast triangles with canned apples on top. Seriously. She took a bite and immediately had to excuse herself; she got sick due to the oil in the donuts...as we don't normally eat greasy stuff; donuts shouldn't be dripping in grease. Regardless, the waitress was busy enough that we didn't see her often but once she stopped by I told her to go ahead and take my plate because the order wasn't cooked right, and she took it off the bill. Then when my wife's order was addressed she admitted that it was rung up wrong and what my wife got wasn't even on the menu; she hadn't even taken three bites of it and she didn't offer to take it off the menu....which is what should have been done. My wife had already gone home at this point so I just wanted to pay and get home to make sure she was okay. Never saw a manager, the food was terrible, staff was scant and it was just a bad time. Perhaps it was an off day, but after this I don't know that I will be up for giving it another shot.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lygn3rG3YQvUoQP4u2mNpQ",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Not quite what I asked for",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lygn3rG3YQvUoQP4u2mNpQ/o.jpg"
      }
    ],
    "user_id": "ABbmYYaN3zXbM9KTckDnXA"
  },
  "mlQe06A4vHKb_xznN9SG8A": {
    "date": "3/26/2015",
    "text": "One week night we wanted to step out of the norm and try something different for us. Enter Cain's Saloon. Really... We entered Cain's Saloon. That sounds dirty but you know what I mean.   It was pretty busy in the initial bar area which has a bar to the left and tables to the right. While we prefer to sit at the bar we knew this would end up being a dining room trip based on the ongoing March Madness and the time we got there (Happy Hour). Our wait to be seated was really short and even the tables (rather than booths) feel roomy in the dining room. There are approximately 100 giant TVs inside between the bar and dining room. Well, ok, maybe not 100... but it's close maybe 97 TVs. This is a great place to watch whatever Sportball game your into, even in the dining room.   As soon as we were seated it started to really fill up. The place looks small but it fits a lot of people. While waiting for our waitress to come get our drink order I saw they used an online listing for the over 30 on tap craft beers. I love this because it allowed us to decide before she even got to us. They have a happy hour special of half price appetizers and Wednesday's are wing night.   We both ordered wings; mine boneless and his bone in (it's ok you can laugh, I'm 12 too). They took a while to come out due to how busy they were but they were so delicious. I was so happy with the food and how attentive our waitress was even though it was insanely busy.    The food prices were great, the beer/drink options are awesome, the staff is friendly, and the interior is darker and cozy. We will absolutely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yfK0Od09W_D5jzXBzRgnlA"
  },
  "LkIbCRstuyzLzHU-9YtjhQ": {
    "date": "1/22/2017",
    "text": "Have been going to Cain's for close to 10 years.  Loved their brunch, until today.  Kitchen got backed up, so it took over an hour to get our food.  No big deal.  Understood that happens.  Then when the food started rolling out, we had two separate hairs tangled in our food.  Since we were pretty grossed out, we asked for to-go containers for the food not impacted with hair & asked for the manager.  The manager came & said none of his cooks have hair & comped one of the dishes w/hair.  Will never go back.  Sad cause we've had good memories there over the years.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RtQOFiaNuSGbxaHOVOkMIA"
  },
  "jSIvFOG1nVsSfXmjeq9EFw": {
    "date": "1/15/2017",
    "text": "I've had countless bad experiences with this place... it's a shame because the food is good. It's just poorly managed and owned.   I went to school at south hills beauty academy it is located next door and I would order lunch every week. When you eat in you get good portions for the price, although if you decide to get a Togo order they will over charge you and give you 1/4 of the food you would receive by dining in. For example I ordered a salad Togo and got 8 pieces of lettuce.  Another example.... One day on my lunch break I had 30 extra minutes so instead of picking up my Togo order I kindly asked the owner if he minded if I ate my meal there. He said that would be no problem... so I ordered a drink and when the waitress brought it to me she rudely said \"next time you order Togo food you better not eat it here\" I kindly told her the owner told me it was ok and she responded \"he sent me over here to tell you because he's so pissed that you would make us waste togo containers\"  I then asked the waitress to go get the owner and I saw her talking to him but he never was brave enough to talk to me. I thought this was very distasteful and made me feel really uncomfortable.  Overall a very shady place and the workers are childish/petty!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qCdtX3OwN6kpdkNqPToJqw"
  },
  "Xa9n5ZFjxmQZE7Sk3qKQBw": {
    "date": "5/14/2018",
    "text": "if 0 stars was an option that would be the rating on this review. the second we entered the establishment, we were greeted by an extremely rude bald headed bouncer. made snide comments regarding my license expiring in 3 weeks, which is plenty of time to get a new license IMO. we had a group of 6 people and several of their larger bar top tables available. however, we were then scolded by several workers for blocking the aisle with 2 people sitting at the middle seats at the table and not even all 6. 2 gentleman were nice enough to switch us tables so we could be on the end and not \"block any aisles\". we proceeded to order drinks which were awful and flat. i had to go up to the bar because the servers were not great and not coming up to our table to inform the bartender the drinks were flat. however, both bartenders declined making the drinks and told me there is no possible way that soda water could be flat ever. 5 minutes later i was informed i was indeed correct and the soda water was flat and they asked if we wanted new drinks. by that point we just wanted to get out of there because the experience was terrible. overall cains is not great. go to the saloon or jameson's.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dWUOHmoDba_R97ov0OwnOQ"
  },
  "bbXMuDhKwSyi6e_UUdfGhw": {
    "date": "5/24/2015",
    "text": "We haven't been to Cain's in awhile so decided to give it a whirl. We made our way through the bar and back to the restaurant. I was checking out people's food as we walked by. It looked good and people looked like they were enjoying their food. Our waitress's name was K.K.  She was very friendly and she was very attentive. She showed us the appetizers on the menu as well as the wings and a few other things.  I ordered the Chicken Parm. First my salad came out. It had cucumbers, tomatoes, onions on top of Romain. I had Blue Cheese dressing and it was very good. Then the Chicken Parm came out. Oh my did it look good!  It was two huge pieces of chicken fried to the perfect crispness with sauce, and melted provolone. On one said their were two huge pieces of garlic toast and on the other was Angel hair pasta tossed in sauce. It was A LOT of food! The sauce on the pasta and chicken was very tasty. Sometimes sauces can be too tomatoey or bland but their sauce was great. The chicken was still juicy and the pasta was cooked perfectly.  My husband ordered the Mixed Grill with shrimp. It was mixed veggies that were grilled along with wild rice. It came with 7 nice sized shrimp. The dish was seasoned well and I think if I had not been with him he would have licked the plate.  I ended up taking over half of my food home. Doggie bags are always welcome at my house.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1aafoN5dNJAt4Es0tuUUCA",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Mixed Grill with shrimp.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1aafoN5dNJAt4Es0tuUUCA/o.jpg"
      },
      {
        "img_id": "7lB7VsAl4bFxO6BtcjH9eA",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Chicken Parm",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7lB7VsAl4bFxO6BtcjH9eA/o.jpg"
      }
    ],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "DT1MLbGFCj9RrGufX-MGXw": {
    "date": "7/24/2016",
    "text": "I wish I could give them more stars, however despite the good food the service was horrible. We had to ask 3 times for waters, we had to get up and find the waitress to get our check, she said there was no way that she could split it (but came back with two separate receipts), and we had to go find her to give her our payment. Not impressed. If you work with the public at least fake it until you make it because you depend on those tips girl ;)",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iO12t3Tpvm5e0-gz2PNCoA"
  },
  "FvnFN7ZF4xNsRsDO-eWCUg": {
    "date": "11/6/2016",
    "text": "Food is excellent, drinks are too. But if you're coming on a Sunday- expect to wait atleast 45 minutes to an hour for your food. Just a heads ho",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sq862WW31SQyA2TH5rZpog"
  },
  "R3BhQdzm8Z-ba791T98WKQ": {
    "date": "4/22/2014",
    "text": "Our night at Cain started out as 4/5 stars.  This was my first visit and I was blown away by the extensive menu and attentive service.  I ordered the Shrimp and Strawberry salad - not something I would usually order at a bar.  But I was not disappointed! The shrimp were of a decent size and seasoned well. The salad was huge and at $12 was just right.  My guests ordered a variety of items including Buffalo Chicken dip (amazing); Spinach Artichoke Dip (great); and for their entrees - the Grilled Romaine salad topped with Filet; Surf and Turf ($14 - WHAT?); and a Steak and Egg something sandwich. Everyone seemed delighted with their respective meals and the drinks flowed all night long thanks to our wonderful server whose name I cannot recall.    Unfortunately, as the evening progressed the bouncer began his shift. Sigh.  I'm sorry, but he just wasn't nice. Not that bouncers need to be cuddly, but dang.  We were seated at the table closest to the door, a table which he clearly despises.  He rudely asked us (the two people seated in the outer seats) to move closer into the table when there was really nowhere for us to go; citing that patrons walking in couldn't do so with us sitting there. Lies.  There was plenty of room for anyone to walk anywhere.  He repeatedly got an attitude with one of our guests both vocally and with his body language; going so far as to seat his stool so close to our table that shoulders were touching. Get over yourself, dude.  I'll visit Cains again, but either won't go when there's a bouncer on duty (which is a ridiculous thing to have to do); or request a table away from the door and annoy the hostess. Either way, he's not a great ambassador for what I'm sure is a great place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "-ARdx8hOcEWlMDjzwLYZ_g"
  },
  "EvE95LEtRmit-i4NHD_zNQ": {
    "date": "2/12/2018",
    "text": "Great beer selection and awesome food ! Fun environment for sporting events! Servers and bartenders were all very nice too !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bwjPP2nwL7ucwTWftRJaHw"
  },
  "8I44BJupQFhosF59WS4N3g": {
    "date": "1/16/2017",
    "text": "Great specials from wing and shrimp night to brunch. They have a great menu, very good food, friendly staff and plenty of tvs. The only issue for me was parking isn't plentiful since its on street parking on West Liberty Avenue and the bathroom was a bit run down. I had bananas Fosters pancakes, bacon and a mimosa. They had fixins set up to add strawberries, blueberries and other fresh fruit. I loved it. The pancakes had a rum 4amd it was so outstanding I didn't eat syrup at all. The bacon was crispy and they gave me plenty. I enjoyed the server he's been there 17 years and he was a well versed on everything we asked. I'm looking forward to going back on a Wednesday for wings and shrimp. This place is great for sporting events there was a soccer game on when we were there so the tvs in the back had the game on while there was football in the bar area on the tvs. It was a nice blend and everyone was enjoying themselves. Its a feel good environment and I'm looking forward to going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UKstCj1q-ChEnNP1cOpz8Q",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Bananas Fosters with rum sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UKstCj1q-ChEnNP1cOpz8Q/o.jpg"
      },
      {
        "img_id": "peevxXRfyeybP83A80GJsg",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Mimosa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/peevxXRfyeybP83A80GJsg/o.jpg"
      }
    ],
    "user_id": "pr8_C12oHakeNB4ZPp_dig"
  },
  "KIgClUOPQp0Ib1W2QIgVrg": {
    "date": "3/12/2017",
    "text": "Ok.... Understand this was a prearranged bus bash stop at Cains. So, this was our first stop on St Pattys day with a party bus of 25 highly successful professionals from Southpointe...(ages 30-55). One of our dear friends who happens to be an Indian woman, age 30+ forgot her ID.   The bouncer was the most ignorant bouncer I've encountered in 35 years of visiting bars... A complete lack of professionalism. If he had worked for me I would have fired him on the spot.  Understand it was 15 degrees outside.  The bus dropped everyone off and was to pick us up an hour later.   This young lady had no coat, short skirt and short sleeves and this man tells her to stand outside in the cold.  Not cool. Within 30 minutes we had her ID... then he refuses to allow her in because she flipped him off as she stood outside in the cold...  Screw you guys at Cains.  Uncalled for....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OdPN5BS8rKkmBImB8BbXIg"
  },
  "dvdSTGJ4NdIvXkIJBM5ttA": {
    "date": "4/5/2016",
    "text": "Yelp notified me that they had removed my previous review (perhaps someone complained about it). Alas, I will repost and now it will won't be buried under newer reviews.   I once had love for Cain's Saloon. It was a place where everybody knew my name. I would often boast of the hearty breakfast, accompanied by a make-your-own bloody mary bar on Sundays. I would always suggest it when friends asked me where to go. I was excited to bring family there for dinner.   The beer selection is great, and the specials for Pirates games brought me by almost 162 times a year. I was a brand loyalist - spending hundreds if not thousands of dollars on a place that I believed in.   But something changed. Without warning, without reason, without the Cain's love that I had grown so accustomed to - I was treated extremely rudely by a specific bartender who I will not name. And now those friends who I once brought along, and the family I would laugh with while eating gigantic cheese sticks, and the strangers I would tell to try Cain's for breakfast are a thing of the past.   I cannot speak for others. I only know that deep down in the fragments of my broken heart, I cannot return to Cain's to spend another penny. Such a shame because between the guests I brought and the money I spent - I know it was a lot of money. So much money - gone. Like a big ball of revenue that was so constant and so kind and always huge tips for the friendly staff and I was even thinking about spending more money just because I loved giving them so much money.   All that money spent elsewhere because of one power trip.  Sometimes I drive past Cain's. It still looks the same. I think about the good times had. One day when this particular bartender leaves I might return.... (END)  Oh also tons of TVs great for watching every sports game. :)",
    "rating": 1,
    "rated": {
      "funny": 10,
      "useful": 7,
      "cool": 6
    },
    "photos": [],
    "user_id": "M3by5XPyim_E5v2eoJpR8g"
  },
  "r5m3v2_uRZS01dWuLYB2dQ": {
    "date": "9/30/2016",
    "text": "Came in on Wednesday. We were hoping to watch some baseball and this place delivered. In from out-of-town on business and we were struggling to find a place to watch the games. In a search of places with MLB Extra Innings in Pittsburgh, Cain's was on a short list. I can verify that they do, in fact, have the MLB Extra Innings and they use it to the fullest. I may not have always agreed with the changing of the stations that they selected, but it didn't affect my overall experience.   The had some beer specials, a great selection of craft beers, and Wednesday happened to be wing night - $.35 wings, traditional or boneless. A couple gripes here...they make you order at least 10/flavor. It kinda sucked because it was our first time in and they have a ton of different flavors that we wanted to try, but we were kind of limited. We got the cajun dry rub, the hot garlic parm, and orange ginger. The wings themselves were nice, meaty, not overly breaded...just how I like them. The flavors were a bit underwhelming. I don't know what it was, but they just didn't seem super flavorful. Almost like the flavor didn't stick to the wing. They looked amply sauced and rubbed...it was a real head-scratcher. Not bad, just wanted a little more punch to them. Regardless, can't complain about $.35 wings (even though I just did kinda).   I'd absolutely come back. Oh, it's worth noting that the bartender who worked the other night was awesome. Super attentive. Never went without a drink or a full water the entire night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BK2vmxLojJ0nmuzajDjN5g"
  },
  "VOc4tS43hiJAuU6zzhAMwg": {
    "date": "9/4/2012",
    "text": "HELLO new neighborhood watering hole!    This place is legit!  Moving to the new hood in Dormont means finding a new go to bar.  I need a my hood bar to have a good selection of beer (I accept Yuengling and hopefully a rotating seasonal list) and good bar food.  Good bar food doesn't have to be good.  I mean, it has to be good, but it doesn't have be gourmet poutine, if you know what I'm sayin'?    Cain's totally surprised me because they have a mega beer list, with lots of drafts on tap, and this particular night Southern Tier Pumking was in the hizzouse!  Their menu is HUGE too!  Tons of faves like wings and burgers but the intriguing \"Codfather,\" which I will take part in at some point!  I was in the mood for a Rachel, because well, why not... it's my name!    The Rachel was awesome, with a good amount of turkey, but not overwhelming and lots of coleslaw, which is totally how I like it!  The rye was fresh and toasted and it all came together perfectly.  But the fries, the fries win my seal of approval!  They were crisp and seasoned correctly, which is a winning fry in my opinion.    I'll see you soon Cains, and will be working my way through your extensive draft list and food menu on the reg!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 9,
      "cool": 2
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "ZJz12K8LZWfB32zv3XMfUQ": {
    "date": "5/13/2016",
    "text": "Average bar food, slow service, a nice selection of incredibly overpriced beers. My parents RAVED about this place from when they were regulars years ago, but needless to say when I have a hoagie & decent beer craving, I'll be going elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zv5c6aHGjXs6on1yKCDPfQ",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zv5c6aHGjXs6on1yKCDPfQ/o.jpg"
      }
    ],
    "user_id": "IimhFsSF8G9gTALKBuwQCg"
  },
  "gBrjwehYu17oPZrvhMcJRw": {
    "date": "7/13/2016",
    "text": "Came to Cain's for a business lunch and was not disappointed! My companion selected the location and though I was skeptical, it turned out to be a great place for a meeting and a tasty bite.   We sat at a booth in the back section and it was quiet and well lit, perfect for a meeting. Our waitress was unobtrusive but made suggestions, pointing us towards the lunch special menu, which was awesome!   For 7.99 you have a TON of choices for a combo lunch that includes choices of sliders, half-sandwiches (great choices and a very large half!) and a warm and cold side. You even get to choose the bread for your sandwich.   I had the grilled chicken on italian bread with sides of sweet potato fries and fruit salad. My companion had a similar combo but with mac and cheese as the hot side.   The sandwich was large and filling and the chicken was perfectly seasoned and cooked. The bread was soft but toasted crispy. The sweet potato fries were the waffle variety and were just the right amount of crispy on the outside. The fruit salad had alot of variety and everything was fresh.   The mac and cheese was HUGE and looked really good. The combo was a GREAT DEAL any way you slice it.   I was really pleasantly surprised by Cain's and will definitely return when in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VfD-7Wk7Y1dypmhlo0fhhw"
  },
  "ZhH3i9uu_7Vij18ESMFvrg": {
    "date": "4/7/2018",
    "text": "1 hour wait for apps. Came with another couple. Half the group got their food, the other half got their food 15 minutes later. One of the workers fully admitted that they served the French fries that were \"supposed to be thrown out\" from the old owner. Awkward/gross? Won't be back now that it's new ownership. Our waitress was sweet though!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zsQJLkcZIMpebYgmcjD47Q"
  },
  "oPhyGJ58Yy-aJ5hbOcLJKA": {
    "date": "5/5/2018",
    "text": "I came in this place with my girlfriend and tried to get dinner and was turned down at 6pm because she didn't have an ID. We didn't even want to sit at the bar or order drinks. So I guess make sure you have your ID if you want to get food. I will not be returning",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mIfjJUilICFiVRp7Oxjs_A"
  },
  "bRvaT1tHM3aMrPdKtgf2WQ": {
    "date": "10/11/2015",
    "text": "HELLA SWEET BRUNCH!!  I really like Cains. I frequent this place for brunch. They have an excellent brunch drink menu which is pretty unique I think. Really great service and food to boot. Also , 33 beers on tap makes for a quality selection of brews. Good service and and atmosphere are a plus.   Great stuff",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "osPnhcJ0DX-vnh35KrADcQ",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Brunch!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/osPnhcJ0DX-vnh35KrADcQ/o.jpg"
      }
    ],
    "user_id": "gVwScllhBon-CRK_8KFcdA"
  },
  "vVM5zOKEFlvM6xsR-BbjVw": {
    "date": "2/5/2016",
    "text": "My friends and I heard this place was a hidden gem, so we were excited to check it out for a penguin's game the other week. It is located in Dormont and very close to Mt. Lebanon, parking wasn't terrible for us to find at all considering there were a few parking lots close by. It wasn't too crowded at all and we were seated right away. Our waitress was fantastic and kept a great eye on us the whole time. We started off with three, yes three, appetizers. We ordered the wings (the Cajun bbq), mozzarella sticks and fried pickles. The wings were incredible. The sauce was almost overwhelming because they gave us so much of it, but it was tasty as well. The wings themselves were juicy & cooked perfectly. The mozzarella sticks were huge and veryyyyy packed full with cheese. The fried pickles were pretty standard, but were tasty none the less. I then had the Bavarian chicken club and a side of the veggies that day (sauteed zucchini with tomatoes). The chicken club was awesome- the mustard, pretzel bun & bacon were delicious & the chicken was thick but juicy. Super good. The veggies were decent, but I wouldn't order them again. I stole some French fries from a friend's plate- they were delicious (I heard a lot about them from some coworkers). Their draft list was also decent and was categorized by the type of beer, which is always helpful. I also should point out that the dining area had a ton of tv's- which my boyfriend clearly loved while watching the pen's game.  Overall, we had a great experience & I am looking forward to returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "pxSr-8h_I1oapSXzLEj1YA": {
    "date": "10/12/2017",
    "text": "The wings were top notch, perfectly cooked and crispy. Freshly fried... honey habanero sauce was one of the best i've ever had. Service was also top notch. If you like sports, this place has TVs everywhere. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r42vraXLlKOvEw5icU_pew"
  },
  "N-Tn4XKeBP2t_a7RGG2mMg": {
    "date": "5/7/2017",
    "text": "It's an alright place to drink, but don't order food. The food is always over cooked or burned. The prices are ridiculous for the quality you're getting. The service is decent. I don't go unless it's a last resort. Especially for food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8gGRL-BOQ4P6kRCpAoioXg"
  },
  "bzuRoyVlKpnLAXy2bkLD1Q": {
    "date": "1/13/2018",
    "text": "Awful. Every time I've been here, something has been served ice cold. This could be a great place but their food is mediocre at best. The only redeeming quality would be the bartenders and wait staff but unfortunately it's not enough to earn a return trip after so many failures. Spend your money elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SXia18YeUASg3lbF8Lk-rQ"
  },
  "Ldrv3xxRNqCPvpO0MLO5Sw": {
    "date": "6/24/2018",
    "text": "Being born and raised in the south hills Cain's has always held a special place in my heart. I have been going there since the early 90s and continued to take my family there for Sunday brunch over the past few years. Service has always been slow but the quality and taste of the food has more than made up for the wait. However, this morning we had the worst experience of our life and sadly I can no longer give my money to the new management. We arrived at 11 for brunch with 4 adults and 2 kids. There was a party of about 10 people in the bar area and another large party (8) in the back. After waiting 15 minutes to get our drinks, we started to order. Months ago, the menu was cut to about 12 items (due to new management) but we were told the full menu would be back soon. The menu is still minuscule, the waffle maker was broke, they were out of cranberry juice, and it took forever to get coffee that was lukewarm at best. We ordered our food and so began the wait. After 45 minutes and seeing another table of 4 walk in, order, eat, and leave I asked the waiter where our food was. He told me \"it will be out when it's ready.\"  I then spoke to the manager and explained our situation. He seemed concerned and went into the kitchen. A few minutes later our waiter came to our table and told us they were plating our food. I was in the restroom with one of my children when the food arrived. Orders were wrong (despite repeating them numerous times to the waiter) and 1/2 the food was missing. When my wife pointed out that one of the orders was wrong, the waiter tried to argue with her about it.  The food was mediocre. The home fries once house-made now come out of a bag. Finally our check came (the manager never checked on us). They charged us for every piece of food despite all the issues. Sadly due to this experience and options in the neighborhood we will never go to Cain's again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PbB2vwyfRkzipbWxPdMmBQ"
  },
  "ZMCL80HKWvFMp33IN5x_Kw": {
    "date": "3/25/2018",
    "text": "They are in transition to new ownership. Hopefully it gets better when complete. I have been a Caines patron for years, but today's experience was awful. Food was bad, waitstaff overworked. Not a fan any more",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e4n5dlkaW8mf1LM7TMbqGQ"
  },
  "Dsr5hmUPguqxnZaIAqhIQA": {
    "date": "5/20/2016",
    "text": "I've gone to Cain's a few times and have never been disappointed. Friendly, fast service and great food. The food is above what you expect for your average bar food and the same goes for the prices.  An excellent selection of beers on tap and daily food specials.  I plan to try their Sunday Bloody Mary Bar soon so I can't review that but Cain's has an excellent week day happy hour.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3VSXGpollr0CAee0_BROtw"
  },
  "I4lRcEkgiPiO5sABH-4tGQ": {
    "date": "6/10/2017",
    "text": "Been here a couple times for food, average at best. Everything on the menu is basic. Tried to stop for dinner on a Friday at 6:30 and was carded. My 32 year wife didn't have hers so weren't let in even though we were just eating. Bartender was rude and had no common sense. Cain's advertising as a restaurant but IDing that early in the evening makes no sense. I wouldn't waste my time here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "31vWyBOQK3jEOa7uI5BItw"
  },
  "XW9GEyvxr6_31zVlV-U-1Q": {
    "date": "2/7/2015",
    "text": "Ate here for lunch today. Was really noisy due to two big parties. I ordered the turkey club with onion rings. Rings were awesome!! Sandwich was really good, turkey was really tender and flavorful. The bread was just toasted enough to give it texture without being hard.  My fiance had the 3 little pigs with the sweet potato waffle fries. He loved the sandwich. Also, both portions were huge!! I took home half my sandwich and probably 2/3 my onion rings.   I knocked off one star for service. We didn't have the issues that other people have had, but our waitress wasn't very friendly. I cannot stand when people in costumer service aren't friendly. Even when you're not having a bad day, you cannot take it out on the customer.   With all that being said, I'd definitely go back if I'm in the area again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-pU7LJ069cz8fMTb8qz8MQ",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Turkey club with onion rings. And this was just half of my order that I took home!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-pU7LJ069cz8fMTb8qz8MQ/o.jpg"
      }
    ],
    "user_id": "H_8sBVuooCZ_ZepR_tQL8A"
  },
  "Wr4EMqhhE-CaP4dhI21TVQ": {
    "date": "9/21/2016",
    "text": "We always love Cain's!  Tonight may have been the exception.  I got my usual steak. Very disappointed!  So salty and thin and overdone, even by my expectations.  I've been known to send an uncooked steak back-not necessary tonight!  I grabbed a manager who was more than willing to make amends, free dinner, free dessert, free wine.  NO, I don't complain to get free food.  He gave me a glass of wine and took 10% off the check.  Then the bill comes and the big surprise--my husband's non alcoholic beer is $5.50 a bottle!!! For REAL??  We ask the server and she double checks.  YEP  the bartender said \"ring it up as a microbrew\"!!!!  I guess that makes up for the free wine and 10% off.  We'll be back, but on a Saturday when steak is the special and worth the price and we'll be drinking water!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jinH5QmMXcnUYXDM1CUbWQ"
  },
  "1kL0UyNuzUAKSo2ExMjRPQ": {
    "date": "7/1/2014",
    "text": "The turkey sandwich on a pretzel bun is my go to meal here. So good. Fun people and a good atmosphere to watch a game",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kYhjtKfDTBuzu0bAAE39TA"
  },
  "ApMsfDHW7HniSJA8q9qogw": {
    "date": "5/13/2015",
    "text": "Cains best thing by far is their breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iqVoR4rsrYJEWULprHU1kw"
  },
  "O8dP-s5iO1LWCn2Ao_EMmg": {
    "date": "10/13/2015",
    "text": "Very good food! Friendly staff!  Tons of TV's for the games & a comfortable atmosphere. Always a great time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XQT9AyDay_gFsB-u90m75Q"
  },
  "G0pumVkXjwBJ2Ov9jvvfGQ": {
    "date": "1/31/2012",
    "text": "I've been to Cain's quite a few times, since I live right down the street.  The best times I have had at Cain's consist of myself going into the establishment with the predetermined mentality of spending way too much for drinks ( $7.00 for a Jameson and Ginger!!??) and already being three sheets to the wind.   Don't get me wrong, if you like going to a place that mildly reminds me more of a mosh pit at times than an actual drinking establishment, you would love Cain's. Definitely, avoid going on the weekends.  But, I will admit that Cain's is an awesome place to post up at the bar, drink a few beers, and catch a Pen's game on one of their million TV's.   Bottom line : This place is not a place where you and your buds can go and get poopy drunk at. Cains is, at best, a bar where you stop during a bar crawl for a beer and a shot.   Nothing more, and nothing less.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "WC235EldJD3vxmh7VFnGpQ"
  },
  "xjl2LGFS_podAT0p-udcTA": {
    "date": "6/15/2016",
    "text": "My favorite place in Dormont/Mt Lebanon area. Stuff is fantastic. Food will surprise you: better than most restaurants.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_IOszC9vZ1NHwCsZd8GKag"
  },
  "LT-I560QFgqWfzeoqB_iCw": {
    "date": "6/23/2015",
    "text": "Used to go there weekly when I was in college. When it was just a bar. Went there for breakfast on father's day for breakfast and it was fantastic ! One if the best I've ever had. Huge menu.  They've really cleaned the place up. I would highly recommend a visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nqn7PoFfH36W7921cXNHjQ"
  },
  "-w49EJEVBjaEtBgKKzavlg": {
    "date": "8/2/2011",
    "text": "Yum.   I love when places surprise you! Brunch is my passion so I am always on the hunt for new spots. I love the Pamela's scene but sometimes you need that bloody mary to hold you off until you can dig into your home fries.   BLOODY MARY BAR, O HEY!   Pros: breakfast and booze, huge portions ( I got a side of oatmeal and it was double a meal portion), CHEAP!!!!, Early hours   Cons: Parking is a bitch, slower (a huge party sat before us though)   Def will be back for some day drinking",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "IKnLl7SbuP0u6HS34jwHhw"
  },
  "rgW1ASDNdoipNG5ABW1fZQ": {
    "date": "8/9/2016",
    "text": "I called to see how many draft beers they had on tap, Girl says \"I'm not sure. I'm new.\" and hangs up on me! I called back and asked for a manager and she wouldn't even give me that! Not going here! Terrible customer service!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H2YNq-C5DhzZ5aZviLIkjA"
  },
  "ycuF0HpID8jbCz5sqR8RYw": {
    "date": "2/2/2014",
    "text": "HORRIBLE ALL AROUND!!!!! Came in on a Sunday morning for breakfast around 1045, walked in and the girl said it would be a ten minute wait. We sat at the bar to wait so she forgot about us. After about 25 minutes or so we asked how long and she took us to the booth that was open for about 23 minutes. Went to the table, sat there for about another 20 minutes with our menus folded at the end of the table. After we had a table sit down next to is and get service right away we asked why nobody has come over. The waitress was confused and didn't know why. Waitress didn't write down our order and had to come back and ask what we got. Food was ehhh.....FINALLY left around 1230, so it took almost 2 hours to have a horrible experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3NYfJw26mRHNcX8CUnA-nw"
  },
  "vKejbUSBPCCcZ8CE4Cp2Wg": {
    "date": "9/30/2014",
    "text": "Great place to watch a game. Friendly staff went out of their way to get my game on even though the Steelers were on at the same time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rG9QyCoVvztw2Ky6EtlN2A"
  },
  "lkqrciusvggULRYQObK21Q": {
    "date": "8/8/2014",
    "text": "Great food and atmosphere. Sweet potato waffle fries are the best. Great for Pirate games.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zzanZzhoA3wufshSrE5Q-g"
  },
  "YoRxQuBbt7Gz4IjAM586Ag": {
    "date": "6/18/2014",
    "text": "This place is just average. The service is subpar at best and the waitresses always seem rushed. However, their wings and wing flavors are good, and they have so many tv's there isn't a bad seat in the house if you're there for a game. Now that the parking lot across the street is gone, good luck looking for a spot. I would go back, but only for the wings and the spicy cheese bites.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5_2Wf6jP0b6ZDmABIOliYw"
  },
  "T4ls8oRcWSTJN4yxm5b6UA": {
    "date": "8/31/2014",
    "text": "Has become one of my favorite breakfast spots.  Was already one of my favorite places to watch a game (TVs cover ever imch of this place - just get there early!).  Great bar food, friendly staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wy1ln3DFkADijBr1FPmYGA"
  },
  "brpTdxJvxqSytz8PeVTayA": {
    "date": "8/19/2013",
    "text": "I have been to Cain's several times and had great experiences. Food is wonderful, service is friendly and I love the huge selection of beer.  So disappointed yesterday when I took home my delicious to go order. Got to my last piece of pastrami smoked salmon point and pulled a long piece of knotted out black hair out if my mouth! So gross!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "iCusNB9VglQn4yG-FBdjog"
  },
  "01qybplit7CBqgUoQS-_5w": {
    "date": "4/20/2016",
    "text": "Giant portions and a great selection for breakfast lunch and dinner. Huge beer selection which is a little overpriced but the variety makes it tolerable. Would definitely recommend the Bloody Mary bar on the weekends. Only downside is lunch isn't served till noon on weekends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3TmHLa9V6jUgcj8hRoE4Rg"
  },
  "DuZd0VE4AKF8E7oyfIUWXg": {
    "date": "10/26/2014",
    "text": "From the moment we walked in I knew we were in for in for an interesting experience. Instead of being greeted with a smiling, friendly \"Hi, welcome to cains\" we were greeted with a frantically working, unhelpful, stressed out hostess who had no clue how to deal with the influx of people. We were there during a breakfast rush. When we walked in the hostess told us that it would be 45 minutes for the kitchen to prepare our food. Since we had known cains for their delicious breakfast, we thought the wait would be worth it. But an hour and fifteen minutes later we get our food. My Breakfast burrito tasted like nothing and a our food was cold. The only good thing about the experience was the warm donuts. Poor service, crappy food. Overall not the way a restaurant should be run.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GwlPZO7llllObw2AOKmoXw"
  },
  "i8XLyOjsf_G9Fouaob8Mag": {
    "date": "4/4/2016",
    "text": "Cain's has a great sports bar feel. Lots of TV's to watch all the games on. The food is excellent and the entire restaurant is clean, modern and well maintained. The kitchen is open until 2am so it's a great place to stop late night on your way home to get a pint and some food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oHu7l43Nt37fLNY7L6osrw"
  },
  "Pq-9dGXXs_p6SECx93m2fA": {
    "date": "8/31/2013",
    "text": "By far the best bar I have been to while I stayed at my sisters for my Vacay... All I have to say is the waitress that helped me rocks ... And the bartender that helped me yesterday rocks too... Thanks for the Fire Cracker drink it was awesome. I hope this gets to them. I really do.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "flDQZDzjztCZ2PlVHO06NA",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. The Fire Cracker",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/flDQZDzjztCZ2PlVHO06NA/o.jpg"
      },
      {
        "img_id": "h84a0265FCynruJjiW2uXg",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Good food... Big burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h84a0265FCynruJjiW2uXg/o.jpg"
      }
    ],
    "user_id": "vqMXcA4HMDLpHDO1W6EyYg"
  },
  "3-P6i9hH28hvrFahOl61gg": {
    "date": "4/2/2013",
    "text": "Recently went back to give Cain's another shot. Even though the service was bad the last time I was there, the food was always good. I haven't given the dining room a second try yet, but when I sat in the bar the service was actually good. The bartender was attentive and I never had a problem getting his attention if I needed anything. The food was good, it was served fast, and the portions were huge as usual. Although I am still a bit hesitant to sit in the dining room, I will definitely go back again after this recent experience to at least sit in the bar area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ILNc_8y2w8SGcsSBeg22Uw"
  },
  "F0t9IBVDptnIaumGPvVzXQ": {
    "date": "7/2/2018",
    "text": "My husband and I have been here a few times, but last evening we ordered Grubhub.  The delivery was timely, so no problems there.  I had the buffalo chicken dip which is AMAZING.  It has just the right amount of zip to it.  I also had the fish sandwich with sweet potato waffle fries.  They forgot my tartar sauce which was kind of a bummer and the fries were a tad soggy.  Both were still tasty.  My husband had a chef salad and again, they forgot the dressing.  My guess is that the dressing and my tartar sauce were left somewhere together.  If an also say that my in house experiences have also been positive.  The wait staff are always pleasant, even when busy.  It's a good, local place for some good food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3_lXZmCkafRHM8jOUrlJEA"
  },
  "RcW11yiyiWoOW0zTPK2r2g": {
    "date": "11/15/2017",
    "text": "This place used to be very good. The service was slow and we were given the wrong check. Then they started getting very cheap on the food. No longer offering fresh cut fries and the amount of sauce on the wings is almost no existent.   Looks like they are cutting corners to make more money. Not sure if we will be back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uRthVVLPGGvvYceBa71lLw"
  },
  "vvFqMo3A_fHhaQhKjX7kBg": {
    "date": "11/17/2016",
    "text": "Stopped for something to eat on the way home from a steeler game. They have a pretty large menu but I just wanted something small. I went with the chili and we shared the mozzarella sticks. They mozzarella sticks were great! Actually like really good. They were fresh so it was like a thick stick of cheese. The chili was meh... My fiance got a burger which looked good. I did like the fresh cut fries.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NKOtwFs5vN9uTXde5DNdmQ",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Mozzarella sticks",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NKOtwFs5vN9uTXde5DNdmQ/o.jpg"
      },
      {
        "img_id": "bJQoim1fvJLxJeW-7vdGWQ",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Burger and fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bJQoim1fvJLxJeW-7vdGWQ/o.jpg"
      },
      {
        "img_id": "8fSqzZ2Us-przL_gkIp2eA",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Just ok chili",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8fSqzZ2Us-przL_gkIp2eA/o.jpg"
      }
    ],
    "user_id": "WgEKUJoh5msZlOlTCKnKtg"
  },
  "xL6UosfqiXunJpb8cJ3Aow": {
    "date": "4/1/2018",
    "text": "Well, Cain's is ruined. AMPD Group came in and made changes. Portion sizes are smaller, menu is destroyed, prices increased, and happy hour is basically gone. It was fun while it lasted, just go elsewhere now.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AwLUqnpTo9AC4HcVVb6G2g"
  },
  "SOHatomAlDeBN0KWlkwTUw": {
    "date": "7/9/2015",
    "text": "Watched the Pirates with friends on a Sunday.  The bartenders were great!   The food was great!   I ordered their garlic / parm / hot wings per the recommendation of my bartender.  Great order.  The beer - I mixed up between a hoppy IPA and a 50/50 sour.   They have some beers on tap I have not seen at other bars.  You should check it out.   Sunday - the meters are free :-) - (Don't tell anyone).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JgOcyMF1lTwSVCarSZrrrA"
  },
  "519FygHhScRUdn9ryB3Yew": {
    "date": "6/22/2018",
    "text": "So sad.  Cain's used to be a hoppin' place with great food.  One of the long standing authentically local Dormont establishments.  It has been here for decades.  This new restaurant group that bought it has completely ruined it.  The \"Local\" name - is just a slap in the face.  It's now a bad chain.  I fear that Cain's won't last long now.  The place has no vibe at all - it was dead - nearly empty - on a Friday night.  We were seated, yet after 15 minutes no one had come back to our table.  Service is terrible.  Aside from that, the prices are absolutely absurd.  Meals come with homemade chips now, not fries and cost on average about $13-14.  Sorry, but I am not paying $14 for a French dip, Rueben, or Burger and a side of chips.  Appetizers - how about $11 for fried pickles!!!  Yes, Pickles!!!  I am just so sad that Cain's sold out to this restaurant group - it used to be a great \"local\" place to eat, drink, and watch games.  I don't want to say to stay away because I want Dormont businesses to succeed, but I will honestly never return and I live within walking distance.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "U5JPjCjU6G4Uk3JvAhT5SQ"
  },
  "q2UHjq_utHS5PtfnKn0mwQ": {
    "date": "11/2/2018",
    "text": "Used to be a great neighborhood bar. The new management company reduced the menu and clearly is focused on profit. Their appetizers are extremely small, and the quality of the food has went way downhill. It's a shame because used to be a great hangout spot with great food options, steak nights, etc. we recently showed up on a Friday night for a Pitt football game and there were no other sporting events that night (it was Friday). We didn't get the game turned on until 10 minutes after it started. Is still a great place to drink and the bartenders are great and servers are nice, but it is clearly poorly managed. Head up to some other spots for better options.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LWg8XinOgqFzBVEDi53ToQ"
  },
  "jdVlkI1SMLcATPGKhlcbOw": {
    "date": "7/18/2018",
    "text": "I have always liked Cain's food, drinks, and service. I was excited that there was a new owner, but admittedly hesitant to visit. I decided, what better way to see a great sports bar in its greatest form than to visit during a big sporting event... the WORLD Cup Final. I walked into a packed place with spirits high. They were immediately crushed after waiting at a table with two others for about 20 minutes before my drink order was placed. I was told there was only one server for the entire bar area, again, during the World Cup Final. The beer menu was good, but I ordered a beer that was 4.5% and it was served in a 10oz glass. In fact, most beer (barring Miller Lite, Coors, Yuengling etc) was served in a glass less than a pint. It was 11am and there were only brunch menus on the table. Asking if there were things like fries or wings, I was told that they don't switch over to lunch until 2pm and couldn't make fries. I found the closest thing to a lunch item on the menu which was a burger with an egg on it. I ordered it at half time--noon. Soccer games are 90 mins as you might know, so I had 45 minutes to get my food and enjoy it before the game was over. I asked approximately how long it would take and was told 15/20 minutes. 50 minutes later, my food came. It was a good burger and that's about the only good thing I can say about Cain's. I live walking distance from the place and could be a regular, but unfortunately I won't be. I'll be going to Jameson's down the street for amazing food, drinks, service, and atmosphere from now on.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Jm_rOB-P3w1_EOhvE2yQtg"
  },
  "ZHmCTdK9HXh5sJn_JQs4JQ": {
    "date": "3/24/2018",
    "text": "Went to Cain's today for breakfast and was so excited to pick from the crazy assortment of French toast they have. However, they changed the menu! A friend and I could not decide and decided to order french toast and biscuists and gravy. This did not dissapont. You could smell the cinnamon from the French toast and the bread was just the right amount of softness without being soggy. The biscuits and gravy was fantastic. The salty spice mixture of the sausage combined with the sweet butteriness of the biscuits worked perfectly. Cain's again did not dissapont!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PQHdPRMrWE4GDsMgharJLw"
  },
  "3G_n49cORsx-lNkNM2e_ZQ": {
    "date": "3/6/2017",
    "text": "Cain's is okay, but I probably won't be back unless I'm with others who insist. The prices are absolutely absurd for the kind of establishment this is. I wouldn't be happy to pay $10 for a cheese sticks appetizer at an upscale place, but to do it at a divey bar/restaurant? YIKES. Huge turn off and I am kind of still in shock at how much their cheap food costs and definitely knocked off a star because of this. Not a single appetizer is under $10, let alone the prices of the actual meals. I'll be heading down the road to the many places on Washington next time for similar fare and at least one place that has a similar atmosphere at much more reasonable prices.  Plus, Cain's is LOUD. Too loud.   My food was ok. The loaded pulled pork nachos were delicious, but again, overpriced at $13.00. My steak wrap had very good steak, but not enough of it to actually fill the wrap. Probably about 1/3-1/2 of the wrap was just lettuce and cheese. The onion rings were good, though, and a generous portion. My friend's salmon wrap did not suffer the same problem as mine, and was chock full of fish.  I guess go if you want to overpay like crazy for American style fare you can find basically anywhere?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3rdmwatxNw8YnfAQ9zZZ8g"
  },
  "3sN-erAtqdHSzF9VP_V5Lg": {
    "date": "4/30/2017",
    "text": "This bar was part of the Dormont Bar Crawl. This was one of the last bars we had to mark off on our crawl. I was with a group of people and I was the first one in and kindly waited for the rest of my party to come in. Someone yelled my name and I went to go say hi to a friend I have not seen in a while. While speaking with her, I was notified that one of my friends could not get in because , \" he did not have a valid id\" - My friend is from Aruba and came into town to visit. He was able to get into all the other bars without a problem.   The guy at the door would not give my friend the time of day to explain his Identification. The guy at the door stated, \" You need a passport.\"  - What type of ignorant response is that? For a bar owner to be that rude to a potential customer is uncalled for.   So I am glad that none of us bought drinks in that establishment. I will never step foot into that place again. I will continue to write about this place until it is known for its discriminatory actions.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "thjpuRdgQaiGlIT6kX0vbg"
  },
  "9IXqw4amfXIqmEL5giuwcA": {
    "date": "4/30/2018",
    "text": "Two years after giving Cain's 5 stars, I'm sorry to say that is no longer the case.  One of my favorite places to drink and eat is now off of the list.  This review is NO reflection on the staff.  Each and every one of them take care of their customers and are genuinely concerned about the customer experience.  However, since ownership changed, food quality has tanked while prices remain the same or higher.  $11 for 5 chicken fingers no bigger than my thumb.  $10 for a basic cheeseburger smaller than a Wendys Single.  I understand the need for change.  I understand a large menu and portion sizes can reduce profits.  But reduction in quality without a reduction in price is too big of a change for me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnNyaBBBkeJVS-R7fHEmqQ"
  },
  "nq9omWVdJaSDw_8GbypUtw": {
    "date": "4/7/2018",
    "text": "Great atmosphere for breakfast ! Loved the bloody Mary bar ! Thanks Dana  would love to see Chris and Aaron again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hv_NX1a6RS00QhLwW_WnVA"
  },
  "DcjRqMo1tug5HwozWWzamg": {
    "date": "9/30/2018",
    "text": "Foods okay most of the time depends on the cooks I feel like. I think all the employees are pretty good but So that's why it gets 4 stars foods expensive and most of the time I feel like it could be better I don't recommend the chicken fingers. Come on Wednesday after 7 pm for the wings there not to bad. I don't really leave reviews but I feel like they need more negative reviews to make the place better. Cold food after a 45 minute wait is ridiculous   . A lot of other places within a couple of miles that seem to out due the food. The employees and environment are great tho if your just looking for drinks have to try a few more things but from what I've tried I've never been like wow that's really good. The breakfast is good tho 4/5 I recommend, that can be busy tho.  But enough ranting give em a shot see how you feel about it. \"Corporate bar\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TindoNm0vSaNNQmgBtiFQg"
  },
  "KeMTI3xoPJ6Nf-dvnz5uwA": {
    "date": "2/23/2016",
    "text": "I have been here a few times and in general thought more highly of the place than what I'm going to rate it now (and I would rate it lower if it weren't better experiences prior to my last visit). In general, this is a nice looking bar, with large and viewable, nice TVs, plus decent food with large portions. I especially recommend getting their enormous mozzarella sticks!  My problem was with our last trip this past Sunday. Service was a tad slow, but acceptable. The real issue was due to the fries. They look fresh cut, delicious looking, and just spudtacular. But they were not delicious. In fact, they were flat out gross and almost tasted like they had a strong chemical flavor and odor to boot. I think we can rule out the fryer if it was shared with the fish as it tasted fine. They were possibly the worst tasting fries I've ever had. I thought I was going to be poisoned or something if I ate more than the two I tried.  I've had their fries in the past and don't recall anything of the sort described previously. We didn't eat anymore of them (and I'm pretty sure no one else at the table ate more than a few of the fries tha came with their dishes). Hopefully this was a fluke, but it is concerning regardless.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DN9qVvHo2x8CLkh3Yz07aA"
  },
  "UGlzJlQOPTbmEvt9AWbGsw": {
    "date": "3/25/2018",
    "text": "Absolutely awful. We came here on a Sunday around noon and the brunch was already done. Service was terrible and the food was even worse. The pretzels had more salt than a penndot storage facility. My chicken fingers came out unrecognizable - burnt, flat,  and fish shaped. The nachos had no cheese, the pierogies were overfried mrs. Ts freezer pierogies, and the mimosas were straight orange juice. On top of that Ampd just bought this dump and the new menu has barely changed but raised all the prices.   Stay away and save your money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HerRo9gTjK1hStUbTIswgQ"
  },
  "7roQgtlJlHaf0x0CfouTSg": {
    "date": "9/8/2018",
    "text": "WOW! Amazing service and food. One of the best bloody Mary's I've had in Pittsburgh. The GM was so personable and welcoming, the bartenders and servers were incredibly helpful and friendly. Didn't know what to order and was pointed in the right direction. I find it hard to believe that anything on the menu is bad! I wish I could give more than 5 stars",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1CIt_duzIC1cCUYU4ZxPZA"
  },
  "N4haC5V9Q2uFWSswEv576A": {
    "date": "1/5/2017",
    "text": "Have to dock stars off my previous review for the absurd prices. Every appetizer is $10 now? Burger almost $15?  Wow did the prices go way up. Like a previous reviewer wrote, 20% more than similar establishments in the area. Not a bad place to grab a drink, but avoid the overpriced food.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TqU4nP56jTS7-maNCItykA"
  },
  "OGxEpLX6-jMkxM1_we3fag": {
    "date": "2/11/2016",
    "text": "We had a party at Cain's on a night they have all you can eat crab legs. We had over 20 people show up to enjoy good company and food.  The food was amazing!!  Crab legs kept coming out as we needed them, even with this many people we had no delay in our food. The service was super friendly and the atmosphere in the back room was very relaxed. I was nervous bringing my kids, but there was no problem at all and the  just loved the food also.  When desert came, I have to say I was totally floored with the banana foster, it was just heavenly.   I highly recommend stopping in and getting a fabulous meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Drek2CDexQp_N4Cn28SP2Q",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Banana Foster -- just amazing, you have to try this. It is a piece of heaven.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Drek2CDexQp_N4Cn28SP2Q/o.jpg"
      },
      {
        "img_id": "JgMNxpz3-k6OM0WWGlGifQ",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. All you can eat crab legs. First plate with a potato and coleslaw. Don&amp;#39;t forget to leave room for desert!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JgMNxpz3-k6OM0WWGlGifQ/o.jpg"
      },
      {
        "img_id": "ZYeICmSrRkVHHw4hYIRScA",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Started with a very tasty salad.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZYeICmSrRkVHHw4hYIRScA/o.jpg"
      }
    ],
    "user_id": "IwAzZe3iN9ZBMxW7lKM3Yw"
  },
  "XjWUUGWPtFMNPKXXbpjnag": {
    "date": "2/6/2017",
    "text": "Cain's is a great local bar/restaurant located right in the heart of Dormont. I have been here a few times over the years because it is relatively close to my parent's house and have never had a bad experience. A group of 12 of use went on Sunday afternoon for my grandfather's birthday. We made reservations ahead of time and they were very accommodating to our group and it wasn't too crowded. We missed the brunch (it ends at 12 on Sunday) but still were able to make mimosas & bloody Mary's from the mimosa/bloody mary bar. I made a mimosa and my dad had the bloody mary bar. Both were pretty good!   For lunch, I ordered a cheeseburger with sweet potato fries. The cheeseburger was just OK but I really enjoyed the fries! We also got an order of the hot garlic parmesan wings for the table to share, which were amazing! Next time I come back I will for sure order wings again. Last but not least, our waitress, Kimmy was great! She was very helpful and was so sweet to my 96 year old grandfather! We couldn't have asked for a better waitress to help him celebrate his birthday.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "1ZPnQs-tdvbX8ROjtnzcEg"
  },
  "TJ-GLbZJh3Xz8JOvHrFO7g": {
    "date": "1/2/2019",
    "text": "What has happened to this place? I've seen the ups and downs of Cain's over the last 15 years, the bathroom display I saw on Monday afternoon during the Pitt bowl game, likely could've closed the restaurant had the wrong (or right?) person seen it.  A sewage odor from the front door, rust dripping on the floor from the urinal, two holes in the wall next to the second urinal.  How can you serve food in those restaurant conditions? This restaurant has been under new ownership for months, I fear it won't be around much longer",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "mo5VRNAkuCWh0Jm0JC81fg"
  },
  "EMdnWoyCdIGlsu0Q7QuJZA": {
    "date": "12/27/2018",
    "text": "Really bad food and bad service.  New owners ruined this place. They also ruined the restaurant at cool springs.  Can't  believe they have neen successful with othe establishments. They need new leadership that knows what they are doing",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1xtpwnRA-45AcnBA9stc7w"
  },
  "3MWK29gRhLJj4WyLeCqlLQ": {
    "date": "11/20/2017",
    "text": "I have to admit, when i read the most recent reviews of Cain's, i was skeptical. It seemed like the service and food quality has declined since Cain's first opened. I am here to let you know that i was delightfully impressed with my experience at Cain's. My coworkers and i met here for breakfast last Saturday. When i walked in, the place was pretty empty, but nice and cozy. I was told our group could either sit in the bar area or the dining room. We chose the dining room because it was quieter. Upon first glance, i noticed they had a Bloody Mary and mimosa bar. The Bloody Mary bar wasn't as extravagant as other places I'd been to, but it had all the necessary basics. I got a Bloody Mary and made it to my liking!   I will say that Cain's has a lot of breakfast food options... sandwiches, pancakes, waffles, frittatas, flatbreads, burritos, Benedict's.. and i could keep going. I settled on a bacon, egg and cheese sandwich. I know it sounds basic, but you could get a pretzel bun as an option for bread, so they had me sold! My sandwich had a ton of bacon. The cheese and egg weren't lacking either. It was so good! The sandwich cake with home fries, which were nothing exciting. I skipped those and just ate my sandwich.   Our server Jill was new, but she was prompt and super friendly. I would definitely go back to Cain's again. I had a really great experience!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "K515IDRsyrZskeKl0ydtYg"
  },
  "t7fMhfc8Xt0zgVibIO_d1Q": {
    "date": "2/24/2019",
    "text": "Great little spot. Especially good if you're a Liverpool FC fan, they have a nice crew that shows up for games. Open early to accommodate as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6272pfYkr-FkYwl1hNFx7Q"
  },
  "YCHoqumobFpgzKXZuABBeQ": {
    "date": "12/16/2017",
    "text": "Hidden gem of the South Hills! This is our go-to neighborhood restaurant and bar, whether we want to grab a drink after work, or brunch on the weekend. Excellent draft list - they have a great variety. It's the perfect place to watch a game. Their food is far above expectations from a typical sports bar - everything is homemade and really fresh. Some of my favorite are the fried shrimp (HUGE and very fresh), pierogies (homemade), crab cake eggs Benedict, and the french toast bowls. Always excellent service as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6fdXNC56j1IYm6Mz_3Mxjg"
  },
  "N1AzKQ04G7_OlYJ7adOd3Q": {
    "date": "12/24/2018",
    "text": "Great place to watch a Steeler game. NFL Sunday ticket package as well for your out of town/fantasy games, plus numerous, new, big screen TVs. You can't miss a beat here and you should always expect for there to be at least one TV with your game on it. Bartender was super polite in making sure everyone had their game on. Really enjoyed the extremely lengthy draft list -- one of the deeper draft lists that I've seen in awhile.  Had numerous craft & seasonal winter drafts. Food was also very solid. I had a stuffed banana pepper sandwich with some homemade potato chips. Definitely recommend this. One thing that was a little bit of a downer was trying to split the bill at the end of the night. Server was extremely sweet and obviously busy, but we were presented a bill that was $50 more than what we would expect. Was definitely not ours -- and then staff had a hard time concretely putting together our final bill.  Just need to take better notes or electronically tab as we go. That took a half star away from the day, but I also take a half star away for the overall appearance that could use a little love and care. Bathroom kind of beat. Saw a few booth seats that were torn. Just a few touch up items and little clean up on service, and then I'm a huge fan...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xfFUSMfa7r9Ebz3bhFSg3w"
  },
  "th3lhJKDWhQGrkw-6wl2iQ": {
    "date": "12/31/2018",
    "text": "Go for shots and beers. Skip the food. If you're there later in the evening there is a chance to hear some smooth reggae beats over the speakers",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iEZHFtv4DTAZxUxluMj8yQ"
  },
  "BsYuOxJu-_UwHI8t4zUMtg": {
    "date": "10/1/2016",
    "text": "Meh, I've never had an exceptional experience here.  Some pros are it's location and it's proximity to me and the variety of the menu. I like their offerings and when you look at the menu, it looks fantastic. However, some cons are the incredibly slow service and the food is just not that great.   I've been here on many occasions and it's never really my first pick. But then you look at the menu, and you think for a second it might turn out just fine. It always goes downhill after you're seated. Incredibly long wait times for the wait staff to get your drinks, your orders, and then your food. Plan to be here a few hours.   My last visit was during brunch. Boy does the brunch menu look fantastic, but execution just was not there. I ordered the chicken and waffle. If you like your chicken extra extra extra crispy, you might enjoy their chicken. If you like a dense waffle, you might like their waffles. For me, everything was just a bit too tough to chew on. I will say the flavors were ok, but the texture ruined it for me.   Overall, I'm not a fan. I return for its central location and somehow, the online menu always lures me in to only make a fool out of me later.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "e1zViJbV8w7FkjZUpPZMng",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Chicken and waffle",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/e1zViJbV8w7FkjZUpPZMng/o.jpg"
      }
    ],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "IU8V9Vt5qe3LV-Zm1_2Svw": {
    "date": "11/11/2017",
    "text": "I had some beers and dinner here on a Thursday night. They have a really good selection of craft beers and a nice list that describes a little about the beers to help you make a choice. On Thursday craft beers are $2 off, which is a pretty good deal.   They have a big menu as others have noted, but Thursday was prime rib special night with a choice of prime rib plate or prime rib hoagie. I got the hoagie which came with steak fries. The hoagies was really big and I had to cut it in three pieces. There was a lot of meat and melted cheese, but it was real dry. I was expecting a little more moist and juicy prime rib. The steak fries were ok, but did not taste like they were from freshly cut potatoes.   Service was good at the bar. The food took a little while to get to me, but I didn't care much since I wasn't in a rush.   The place was pretty crowded and friendly. There are a lot of screens playing different games. This is a nice, fun place to relax.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8tdGhx6_xoJMHiDVB5f0Xg",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Prime rib hoagie--special on Thursday for $12.99. A big serving, but a little on the dry side.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8tdGhx6_xoJMHiDVB5f0Xg/o.jpg"
      }
    ],
    "user_id": "dz8CFWEWuR_4S1zlZhWCMQ"
  },
  "pk3dmWO4KAGuObzo-8OVjA": {
    "date": "5/5/2019",
    "text": "Had a brunch reservation via Open Table and they didn't honor it. Told us their dining area was closed. They just looked at us like we were from another planet. Kitchen was great about a year ago but last 2 times there it was a disaster. The nice guy who used to run the place must've left or sold it. Understaffed/ filthy/ rude. Should be 0 stars or about negative -5.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8QzTgrrPrHtEuJtx_RkTUQ"
  },
  "-ZoeN0DCdDvmP7kZ65Xq4Q": {
    "date": "2/16/2019",
    "text": "Cain's Saloon: A once great establishment. I've been a Dormont resident for four years and used to always love visiting this bar. They had great service, great French onion soup, and great wings. Sadly, that is no longer the case. Upon being purchased by Local, this place divulged into utter chaos and mismanagement. Takes eons to get a servers attention, proper utensils are difficult to come by, and the bathroom smells like the Old Mill from Kennywood. I would recommend going to Jamison's bar one block over for a far superior experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "QF3KEqW1bj1sw-VDOOoojw"
  },
  "LzFXQpiM2mMLnik0uI6wTQ": {
    "date": "1/13/2019",
    "text": "What is going on with the bathrooms? They smell absolutly horrendous. I am sitting in the main dining room and the smell is wafting out and it is gag worthy. This isn't a new problem either. It's been like this for months.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "8HAWRvlkm1ZvN0f3iTxjUA"
  },
  "ofmxc077ayYwm51g5m6ZeQ": {
    "date": "1/20/2019",
    "text": "Came for Sunday brunch and on their website it says it is until 2pm. When we showed up at 1:05 we were told they are now only serving brunch till 1pm. Kind of disappointing as it was on their website and on the specials sheet right on the table that is was till 2pm and we were only 5 minutes past 1pm. They didn't even seem to care and we ended up leaving and getting brunch elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "yPHx4gmsrMbTrPlIEvD3Vw"
  },
  "FOxVhLWG-ETI0BxY7bnesw": {
    "date": "1/10/2019",
    "text": "Used to love coming here on Wednesday night for the wings. The place would consistently be packed with people; now it's pretty dead. Since the new owners took over, the service and food quality have definitely diminished. For example, the wing flavors are pretty bland now. And it takes entirely too long for the food to come out. Greg is still at the bar and does a nice job. Also, don't understand how the men's room is in such poor condition - the wall has been busted out for over a year. Cmon now guys.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "IHFhket9d4a2ZS672iigDg"
  },
  "437FCCkylQLGD15itnf-PQ": {
    "date": "4/3/2016",
    "text": "I can barely write this because I'm so dang full.  I'd really give this place 3.5 stars.  Huge beer selection and the food - wow!  are the portions huge and it's really good bar food.    Our waitress was adorable and very attentive. I still can't get over how huge the sandwich was.  To drink I got the leinenkugel grapefruit shandy and it light and delightful it was practically a health drink :-)   For dinner I got the Cain's Club which is turkey breast, peppered bacon, and egg with pepper jack, lettuce, tomato, and horsey sauce served on a pretzel bun. First of all, let's be real - everything tastes better with an egg on it-I just wish there was a little more horsey sauce  on it but it was huge and the bread was so good!    My hubby got the Pittsburgher which is a 1/2 pound burger (he got it as a turkey burger) topped with sauteed onions, 3 pierogies, cheddar cheese and horseradish sauce.  So crazy.    All their sandwiches come with 1 side item - I opted for the onion rings and hubby got the sweet potato waffle fries - both were amazing. I seriously can't breathe because I'm so full.    If you're looking for great bar food - lots of beer selection and a great staff - you should come here. You won't leave hungry ....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NbumMI86nfqo3iNY4ZclfQ",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. The pittsburger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NbumMI86nfqo3iNY4ZclfQ/o.jpg"
      },
      {
        "img_id": "9Nj7SQ1vYVh3yISdrwuAWw",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. The cain&amp;#39;s club - yep that&amp;#39;s an egg in there",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9Nj7SQ1vYVh3yISdrwuAWw/o.jpg"
      }
    ],
    "user_id": "hjk--8VuDX3479_atPJQ1g"
  },
  "p1V3FTn_zJiWPAvo6Jxojg": {
    "date": "9/13/2018",
    "text": "Shopping in Dormont; had to wait over an hour for purchase to be ready.  Needed to eat and Cain's was one of a couple suggested. Very glad we went there for a late lunch. This place is very inviting as soon as you walk in the door. First thing I noticed was how clean and bright it was. Jovan welcomes you and makes you feel very comfortable. He's knowledgeable of all the drinks and menu; and helpful to new customers...like us! Food was very good. We have a large family and will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B4lKFXaLk6BsRgGik5btKw"
  },
  "HFnMFW6bwyaAVHVhzrZzoQ": {
    "date": "11/12/2017",
    "text": "I'm actually sad to write this. Cain's was the best brunch in Pittsburgh. I reviewed this place at five stars four years ago. Since then I've seen it go downhill pretty drastically. Our service today was incredibly slow - 25 minutes to get drinks! We asked to order 15 minutes after that and were told no, as out server had to take other orders first. The once-famous bloody Mary bar was barely stocked and had much fewer to select from.   Our food arrived in advance of our silverware and was cold. Ever have cold eggs? It's awful. The server dropped the food and never once checked on us again. 45 minutes later we finally managed to flag him down and pay for our cold food. Although we had our cards out and ready to go, he still kept us waiting after dropping off the checks.   Tl;Dr: used to be the best. Now among the worst. Go somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "AWCgv1iapDxKGeMa7m1JVQ"
  },
  "GWZrbtE1x5a0NzhXFkiZ9Q": {
    "date": "6/25/2018",
    "text": "Went tonight for a quick salad. Ordered the Caesar salad with salmon. The salad came with maybe 3-4oz of salmon. I didn't pay much attention to the price but when my bill came it was an $18 salad. It was good but not worth $18.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PvZO_wZNM9gPVclJrCff5g"
  },
  "VI2EX5lXjxSx_b7v9mvnyg": {
    "date": "1/18/2017",
    "text": "Always love this place! One of my go to favorites. Tonight was a build your own burger with grilled onions,  pepper jack cheese, and cappicola, loved it! Especially with Ranch dressing!! Family had gourmet Mac and cheese with pulled pork, bbq sauce, fried onions, creamy greatness!!! Parents had the Cuban sandwich, with roasted pork, ham, Swiss cheese, pickles. Both loved it, a must try if you haven't had one. Dad had French Onion Soup for an appetizer, 5 stars for that!! The broth was so aromatic, onions were delicious, topped with melted provolone cheese! Cain's is always a winner!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pv1A8LXYKJlBV6f-QBx0Vg",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. The Cuban!!!! Delicious!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pv1A8LXYKJlBV6f-QBx0Vg/o.jpg"
      },
      {
        "img_id": "7xYDRWCDMvuw8QoAfUfcQA",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Mac and Cheese with bbq pulled pork, fried onions!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7xYDRWCDMvuw8QoAfUfcQA/o.jpg"
      },
      {
        "img_id": "etdOse-oBjd3wokZWOm5-A",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Great burger with grilled onions, cappicola, pepper jack! Yesssss!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/etdOse-oBjd3wokZWOm5-A/o.jpg"
      }
    ],
    "user_id": "rOW7GDjnOkz1lbIWzFlsOQ"
  },
  "WDZgSa5bl896aGB5_7DpzQ": {
    "date": "6/1/2018",
    "text": "Gave Cain's another try with new owner -made reservation for Friday June 1 at 7:00 for my mothers 82 birthday .got their only to fibd out they had no clue what I was talking about- they put tables together and gave us one waitress- needless to say she was overwhelmed by us - appetizers - no zucchini on a Friday  come on- half of the food came out cold undercooked and let's just say it was bad - manger Courtney came over apologizing saying computers were down-- everyone knew she was lying - gave us 15% off our bill  but she could have given  us free food would not have matter - The only good thing I could say is the bouncer open the door that's the only good thing about Cain's",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kC9y4-RVLusVN8SfzS3ysg"
  },
  "s-iB4IRhhiTVqVrxKymqnQ": {
    "date": "9/19/2019",
    "text": "Always love stopping at Cains for Happy Hour. Stopped in a month ago and food was great as we had a few appetizers and wings. We did have an issue as on their website it said wing special started at 5 but in Cains it said 7. The waitress said yes it is incorrect and people complain about it all the time but then just let it drop. So when we went last night it was nice to see they moved it to 5 to match the website.    Wings were great as always and stuffed banana peppers always hit the spot a d are very filling for the price. My wife got the fried zucchini and we couldn't believe the portion size. 2 hours sitting and drinking with friends for 35 bucks. Great deal and a great time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N6IV6GC-0h-20lJspimdRg"
  },
  "dFphTfXZHtB00q_5pd9iLA": {
    "date": "6/25/2019",
    "text": "I've been going to Cains for a very long time. This place used to be filled with good food, good people, and good music!  Went almost every Wednesday with friends for wing night. Everyone loved it (especially me because they had a fab volcano sauce super hot!!) Since the ownership changed it is terrible! The servers come around with grumpy attitudes. You kinda want to leave because they suck so bad. The salad dressing (used to be homemade and awesome) now straight outta some bottle that they over freeze because it comes out solid. Gross. Then the wings seem cooked well and not much changed there, but the sauces are horrible. Disgusting watered down, no flavor....how does this happen.  Note to new owner...if you're going to buy something great, then make it suck, change the name of the place. Your attempt of following in the previous owners footsteps is far lacking. The only decent thing you held onto were a few bartenders who are always nice.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "92otPncl6b8jrHZ_hhCDag"
  },
  "qpWMufEKhQFNeN9HttdYKg": {
    "date": "5/5/2019",
    "text": "I would give less than 1 star if I could. Definitely the worst restaurant I've been to in Pittsburgh. It's hard to mess up a simple breakfast but they did it. Wait took over an hour and a half.   Don't bother coming here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "wAeYcAPgCyOXnEweeNW9Aw"
  },
  "c6MEN41PLOC7XrlRuy7lpw": {
    "date": "9/15/2019",
    "text": "Went to Cain's for an after party with work friends and it was during the Penn State Pitt Game which they had on a few TVs which we liked! Bunch of tvs for sporting events which was nice. The drink list and lost had a lot of nice surprising items and a good selection. I ordered the buffalo chicken dip and it came with tortilla chips and pita bread-a bunch of us shared it and thought it was really good! I didn't have time to try anything else on the menu so I will be back in the future to try some more items! One bartender was very friendly and polite and another seemed overwhelmed and a bit annoyed with the amount of people in the bar that afternoon. Overall it is a decent place to stop at if you want to watch a sporting event and try some tasty food and drinks with friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XVTqV_zHUWC6BOfOsq3nRg"
  },
  "AMmRRDe_s5C9Qq023Frgpg": {
    "date": "5/27/2019",
    "text": "They have a brand new appetizer they're doing, Pub Eggrolls! They are fantastic! Ham, Swiss and a pickle in an egg roll with whole grain mustard goes together wonderful! Great job Cain's!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "f8icqbQg60Ezrka_6vJqQg",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Bloody Mary with horseradish and pepper vodkas!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/f8icqbQg60Ezrka_6vJqQg/o.jpg"
      },
      {
        "img_id": "eehum-xtS2gMHHZqBlTQRg",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Farmers Breakfast with a side of sausage gravy",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eehum-xtS2gMHHZqBlTQRg/o.jpg"
      },
      {
        "img_id": "yysgbltXgn1h6c7ZjFNmCQ",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Bloody Mary Bar!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yysgbltXgn1h6c7ZjFNmCQ/o.jpg"
      }
    ],
    "user_id": "s7FBtkGnOX27D7mojaXmCA"
  },
  "QBjmgQPOkvRPtIdnHJV8TA": {
    "date": "9/5/2019",
    "text": "I have had a few good experiences with takeout so I suggested Cain's when  my dad said he would take me out for lunch. Thank heaven my pop is a forgiving man.  Food was ok. but how in the world is the food hotter when I get take out?  So at first service was good, accommodating us to sit in the back as my dad is disabled and can't sit at the high tops and helping him select a beer.  My dad ordered the Codfather which states on the menu that is comes with chips and a pickle spear. He just said the sandwich when the server said, \"It comes with chips but you can get another side instead\"  My dad showed interest and asked, what side and the server showed him on the menu the list of sides and he choose Mac and cheese.  As I ordered my burger, I asked if it was also eligible for a switch out for a side and was told yes so I got the Brussels sprouts; which were okay. Btw the mac and cheese was just sauce over rotini and was lukewarm at best. Still better than the homemade chips. And, to be clear, there were no chips brought to us.  Turns out, the only switch was a bait and switch. $42 for a bill and each side was charged! $6 for the Mac and $4 for the sprouts.  My dad said nicely, \"what happened? You offered the side as a switch. \"The server's response? \"Oh no, you choose to order the sides and the price is on the menu\"  If this was the case, we should have been served the chips that came with the sandwich. Also, remember, my father only even saw the sides AFTER the server told him he could have them in lieu of the chips.   so they got an extra $10 and lost our office's take out business too.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iq_-UfNcdi7xi9oVjGfwnw"
  },
  "ubsjNV1o5GcIQ-rTbHyzJg": {
    "date": "8/26/2019",
    "text": "We were hoping to sit on the roof top bar but it wasn't open.   The bar and restaurant was not crowded at all We were there on a Monday night.  Food was just ok but mixed drink mojito was awful.  Switched to beer to be safe.  Service was not good either.  Apparently the waitress and bartender didn't like each other and we had to hear all about it.  Parts of our order were forgotten and we had to keep asking for things.  Maybe I know why it was practically empty??  I don't care to go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oWW0fI-n9PZ_kS8gQReISg"
  },
  "azvh7frx8eBgHHUGpPgoMw": {
    "date": "10/9/2018",
    "text": "I love Cain's! Always have. It's walking distance for me, so I'm always stopping by.  The menu is pretty extensive, and although It is directly on Liberty it's no way close to being a dive bar. It's always clean, the service is normally spot on as well.  I love, and I mean love the sweet potato fries. They also have killer flatbreads, and (my favorite)...salmon sandwich.  My complete go to is the sweet and sour Brussel sprouts. Last time I came they somehow had butter on them which was a bummer, so next time I'll be sure to specify!   This place gets pretty busy for games, and they usually have $2.50 miller/bud specials during those times. I kinda wish their beers were just a wee bit cheaper all the time, I never like paying $6 for a beer but it's nice to just stop in and relax for a bit.  They have brunch, which I have yet to check out.   They have an Instagram which posts all their specials as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AYf976K-TrNu6bF4FN1rlg",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Salmon Club Sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AYf976K-TrNu6bF4FN1rlg/o.jpg"
      }
    ],
    "user_id": "q7kb0GVCWOdORhOrRfkxbw"
  },
  "cVUEjsYPssE1PzPVuyLmIw": {
    "date": "8/30/2019",
    "text": "Went there to watch the Steeler game and bartender refused to put the volume on for the game. Being in sales and ordering lunches for offices daily  it was the worst and rude experience I  have ever witnessed. The food was marginal at best and the service was pathetic. There are alot better places to spend your money on west liberty ave. I wish there was negative stars.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0mCuRvZEqeOgcQ6kK43Bnw"
  },
  "vV57Id-mApn-dz7J8SGeGg": {
    "date": "12/15/2018",
    "text": "After PSL basketball games, we like to grab a bite or drink here. They always have space for us and always bring over pitches of water for us to just drink down since we just ran for an hour. We never come for happy hour, so the daily special for beer is normally modelo , I don't like it so I just get an angry orchard or something .  I always get wings here . They are super filling but also lite enough after the game. This refer is based on when we come after the games. The wings have great flavor and they come with ranch and celery and carrots  too . I haven't had anything else to be honest . My boyfriend had the flatbread and it was not enough food for him but with wings, it is plenty.   Again the services is always good when we come in with a big group and they always joke with us so it's a great damn time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AKMRMIIPSHzp4KD76Z9Tgw"
  },
  "yBnq557TwvbhoWRM5jUWyw": {
    "date": "6/29/2019",
    "text": "Awful bland mediocre burgers. Messed up my order and refused to make it right even though it was their mistake. Incredibly rude. Terrible service. Will never patronize this establishment. Jamison's is just a few steps away and infinitely better !",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aqd30dnWlwN3Zs8bXDb4Zg"
  },
  "Kk4cFq7VbwW9KcyaGB_WHA": {
    "date": "9/7/2018",
    "text": "Cain's is a nice location hangout with some decent food.  The inside is in need of some improvements, but still makes for a good gamespot.  If you go on a game night be sure to get there early, as it can get pretty packed.  The food is pretty average overall.  Many of the items they have are just missing a little bit.  Their buffalo chicken dip is good, but needs more hot sauce for some heat.  Their cheese sticks are one of their signature item because they are enormous.  While they make for a good picture, the size makes the cheese overwhelming.  The French dip, Reuben, and cheesesteak are 3 of the better things I have had here.  The burgers do not taste fresh and are never cooked properly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "ta_ZqVJpWySAu7hn3ktQiA": {
    "date": "3/19/2019",
    "text": "Sorry to say.... But we've been back to Cains a couple of times recently...both times for dinner-and it's not the same.  From a five star to a three. It's not bad. Still very nice waitresses. But not crazy about the new menu selections, prices, and wait time for the meal. It's not bad. But now it is 'average'. It's not bad....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l1n_55QxX5p8XLeykbCJxA"
  },
  "RrpPwlVzkh0ZvOAb2p_zkw": {
    "date": "12/5/2018",
    "text": "I came here recently for a social event, and it was okay. Thoroughly average bar food.  A decent happy hour (1/2 price appetizers and $1 off drafts), and in a lively part of Dormont.  Unfortunately, lively also means tough parking. By some miracle I did get one right out front, but if you don't enjoy parallel parking on a busy street or finding side street parking, buckle up.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "3FjdHwnoz-vfw6hBBtckqg"
  },
  "H-fc-1eokfYV43SCRqBZ7w": {
    "date": "11/10/2018",
    "text": "Total disappointment, again, always. I don't know why I keep trying to give Cain's another try but this time I'm done for good.  I'm not sure what the AMPED group is doing to this new venture of theirs but they need to get it together stat.  Attached is the Irish coffee I was served during brunch today. I don't even know how to describe it other than the worst tasting gritty drink I've ever had. Food also eh. Erasing this place from my mind and will never step foot in here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WRyfimBHZRaNoTZUbM4PUA",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WRyfimBHZRaNoTZUbM4PUA/o.jpg"
      }
    ],
    "user_id": "Wb-8NlO9uAMP0wgyVJVD1A"
  },
  "ipRP5YRttK8YBbvjWR-SzQ": {
    "date": "10/30/2018",
    "text": "Bottomline up front: new management took over, did not honor the gift card my cousin bought, server was great but food was slow.  You can get a burger, beer and entertainment many places in pittsburgh. Not honoring gift cards is a quick way to one star reviews",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ERskdga90GvEF0Bf0LJ4Jw"
  },
  "cIk6JEC3C9m8MRmmHOqs_w": {
    "date": "11/7/2018",
    "text": "This is a place for good food. However, it's not cheap. I wasn't expecting a $70 bill for two people with two beers each--I add. So that's why I'm giving 3 stars. We haven't been back since the first time we went and I doubt we will. The service was good though, and the waitress was attentive. I'd say they need to lower their prices a bit...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LC1N1SFW-MaLWiq6Du1oCQ"
  },
  "YiQXR1oC7lkd6idgOJIKDw": {
    "date": "2/16/2019",
    "text": "Such a shame! Back before new ownership took over, this place was my absolute favorite! The French onion soup, jalapeno cheese poppers, and wings with a few Guinness's were always my go to. (French O isn't the same, and Poppers are gone.) This place still has decent food at best. Focus too much on presentation over speedy service. The service has gone down hill in a hurry. I waited for at least 20mins for my server to come back after my drinks were empty. Maybe if she didn't bring beers to tables one at a time service would be faster. Also, the largest TV they own is \"Just meant for bar advertisements\". We weren't even given proper utensils to eat our food. My friend ended up walking up to get his own spoon since our server was basically ignoring us. Very very disappointing. RIP classic Cain's.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "w5X91s84EUV3EPAKDnC7GQ"
  },
  "6mVAwvxCnqHyXYgswLktdw": {
    "date": "5/5/2019",
    "text": "Came here for brunch and the wait took about an hour and a half to get a simple meal of eggs and pancakes. Food extremely underwhelming and not worth the wait.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l8QiLVL71u-_Xz0djp53Ew"
  },
  "Jr1YjON1bkKcAo8gIC5D5w": {
    "date": "3/2/2019",
    "text": "The bathrooms are extremely small, you can't open the door while someone is washing their hands. I ordered the same food at the same time as a friend, his took 1 hour and mine took 1 hour 30 minutes. Otherwise he food was mediocre, they didn't even have desserts!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KL_1npy6eJawRO2bmchNRQ"
  },
  "XRbgK6JWWu5XNvUxaGRTgQ": {
    "date": "9/23/2015",
    "text": "We have been there twice in the last month and both times the orders were brought out wrong and this past time there were items missing and instead of taking responsibility for messing up the order the waitress blamed it on the kitchen. When the missing items were brought out they were cold and inedible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0NYJkuduW9MAJY0rgbnsQ"
  },
  "RHBlq5KvosF1zIqpos84rg": {
    "date": "5/17/2012",
    "text": "Cains had great wings and good service. The Jamaican jerk wings were very crispy as I did request them to be extra well done. The jalepeno cheddar could have been a little more crispy. The sweet potato fries were delicious, but they could have been warmer. Service was great, overall a great atmosphere and experience and would go back again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-qSB-gmfSdQ1DgLay367ww"
  },
  "7Sd2ceVJrXpKjQ6w8550zg": {
    "date": "3/3/2012",
    "text": "I hadn't been to Cain's in a few months but re-visited the establishment last evening for a quick happy hour.  I was very impressed with interior revision.  It went from old school boring bar, to upscale neighborhood bar.  The beer selection is ideal and the new tap wall keeps it simple.  Southern Tier IPA is amazing!  And you can walk out of the place not smelling like smoke.  I will return...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "EI-GbSLbQuqvMQ-WlZVeXA"
  },
  "1RJyV0wkXOEuS5j3ePCO-g": {
    "date": "7/19/2015",
    "text": "Best breakfast in the city! We come here every weekend to get the famous Bloody Mary bar and the food is awesome too! Rhett and Selena are awesome bartenders and will make your experience here unforgettable!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMLgDO-JHOxWhjavOqPQuw"
  },
  "thKtTojnWEtN7TjCyGmtAg": {
    "date": "11/21/2008",
    "text": "I can't believe this place hasn't been reviewed. If you are thinking about going here know this:  If you grew up in the South Hills, all the people from high school that turned out to be real losers will be hanging out here. (Hey, I've been there, so I am not throwing stones.)  It is otherwise your typical South Pittsburgh yinzer bar. There is always a seat, and there are free pretzels.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mi9M-3WmxgtZJ6M-Hu9inw"
  },
  "kKELfZ46-7jHZRCufPft5g": {
    "date": "7/19/2011",
    "text": "Note: Cain's Saloon serves breakfast (!) from 8AM to 12PM on weekends. Yeah, breakfast at a saloon. That's a new concept, eh? Usually ya go get breakfast after ya hit the saloon. Anyway...  I'm so thankful that the building where Jamie's Restaurant (our original destination the other night) was demolished or else I might not have ever stopped by this blustering bar/restaurant that I keep forgetting exists.   Disclaimer: Maaannnn, is this joint clamourous. It was so much so, that I asked Kay if she wanted to go somewhere else when we walked in, but she stuck it out, much to my relief. The food here is good enough to overcome the noise. Not that it was a rowdy place Nor were we subjected to any foul language, fights, or fatuous behavior. It's just LOUD but jovial nonetheless. There was a party going on in the dining room, which is where we were seated, and the folks didn't seem to mind at all despite not knowing us -- they were cool with it, so we were too. The people in the dining room and bar did not appear to be derelicts in any sense of the word. As a matter of fact, the clientele ranged widely in age. I saw an elderly couple, a middle-aged woman with her two teenagers, and of course many 20 and 30-somethings, all of them dressed casually without slumming it,  everyone seemingly enjoying themselves in a civil manner. To me Cain's did not come off as a dive or pick-up joint but rather appeared to be a friendly neighborhood watering hole and eatery. Bear in mind, however, that we stopped in between 8 and 9PM on a Friday night. Perhaps it gets a little wilder as the night moves along. The name Cain does have some Biblically ominous weight to it after all. Luckily, I wasn't named Abel!   Two appetizers lifted us off the runway: Honey BBQ Wings and Fried Oysters.   The supple wings had a mildly sweet, mildly rich sauce that coated them lavishly. The oysters were the culinary school example of apt deep frying, retaining their salty, seaborne flavor and juicy, slick constitution after a plunge into the hot fat, the crispy breading staying in place.   Cain's offerings include the usual sandwiches, burgers, wings and bar food, along with 14 different salads, all of which really sounded interesting (hello Watermelon Feta!). If that's not enough, they also have steak (T-Bone, New York Strip, aged sirloin tips) seafood (calamari, cod, crab legs, shrimp, the aforementioned oysters), pasta (fettuccine), hot turkey, and a Dessert of the Day, which we didn't partake in (we wanted to try nearby Carini's for ice cream).   Once I saw the Crab and Lobster Roll on the menu, all of the other choices before me were discarded.   When freshly chopped lobster tail and legit jumbo-lump crab meat are chilled and married inside a toasted hoagie bun... alright, cue that insipid, forced Metallica ballad from the Black *hack* sell-out *hack* Album.   <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DNcbAibPA2yY&s=f5a7042e6040e9b1367612963356fa4c330be793a3f3b9e801a98a1534bf2379\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=NcbA...</a>  I've always HATED that song, but back to the hero at hand..  Ummm...yeah, lettuce, tomato, and red onion are included to keep you regular. I asked for mayo since that's how I get down. There is something quite spectacular about a sandwich that bridges creamy, hot, and cold, especially when seafood is involved, even when it's just tuna salad on an English Muffin. Cain's roll of crab and lobster is the one to beat in my league thus far.   The Warm German Potato Salad I chose as my side could have easily passed for bacon-strewn, onion-laden, vinegary home fries; a deception I would find most welcome. Besides, french fries and onion rings do get tiresome. I still stand by my preferred creamy, cold, deli-style tater salad, but Cain's WGPS made for a fine culinary detour.   Kay's Ahi Tuna Salad was a sight to be seen. A grand cut of grilled Ahi tuna sat arrogantly atop a bed of baby greens, diced tomatoes, chopped red onion, avocado pieces, quarters of hard boiled egg. After tasting a chunk of the tuna, I got the impression that someone back in the kitchen knows their way around the fire.   And the service was terrific. We were made to feel like long-time regulars despite never having been there before.  I know, I know, but resist I cannot. Rock on...  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Db-BwXAGDfk8&s=c810d723cc8510f6e73d2f34213e8fda8a5aa7257501907231c5f32864c5936c\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=b-Bw...</a>  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DESJgKkG-304&s=aae7e0f575dd5ebc1ace0e8cda4061ed73041719945325cd9accd5f5990a8182\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=ESJg...</a>",
    "rating": 5,
    "rated": {
      "funny": 9,
      "useful": 11,
      "cool": 8
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "7k9qGQyytbGxpJTnwxK6Xg": {
    "date": "7/19/2011",
    "text": "I came here for my first time the other day and was extremely suprised at what I found. This has an very nice bar area with an excellent draft beer selection and great tasting appetizers. I had the hot wings which I for one was extremely happy with. I would have given this 5 stars but I did wait a very long time for my wings, and to be honest I don't think I would have received them if I wouldn't have asked the Bartender about it. I was not that disappointed though because it allowed me to try another variety of beers on tap.  I will definitely go back soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "vNbr4JUZtIDB34xT-1n8ew"
  },
  "eyx6i9-6qYaH6UxmAw8NmA": {
    "date": "1/7/2015",
    "text": "Do not order steak or prime rib here.  The prime rib, ordered rare, was medium, dry and extremely salty.  The rib eye was thinly cut, salty and dry.  When I told the waitress, she said the chef said it should not have been and maybe I did something to it, like it was my fault.  I felt insulted.  The bill was $38.00 so it is pricey.  I was very disappointed and would not order anything but wings here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qXLWeNPNcEplWj4meCckdA"
  },
  "mocxWKZI0YiV4R3yAb4L4A": {
    "date": "11/16/2011",
    "text": "I think this placed has been re-modeled or at least that is what my buddy thought. I had never been there before so I had nothing to compare it to. They had over 25 beers on tap which was very nice. The menu seemed good and the appetizers we had were tasty. There were not a lot of places to sit but we found a couple of seats at a table. They have at least 4 or 5 TV's to watch whatever local sports are on. I think my friend will be going back more now that it has been updated and I will only be back on my next trip to Pittsburgh. Parking is street, the service was good, and it seems like a nice local place to hang out for a few cocktails.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sf_zGR8Lu9kf9VYn0tw1CQ"
  },
  "vlfpQ47QP7IG1av9Iixkyw": {
    "date": "6/11/2014",
    "text": "Atmosphere is awesome...food is terrible. No flavor, soggy French fries, over sauces wings. Wanted it to be good but hope they get a better chef cause the atmosphere is really nice.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dpxk3pwaFvqXvmT3h0doYQ"
  },
  "cAEUEZFQz3iGlFFZfGbfiw": {
    "date": "10/10/2013",
    "text": "I wasn't expecting much but they surely over delivered.  I thought it was just another bar.  It had the bar vibe.  I didn't think the food would be this good.  I am impressed that most of the food is made in-house.  I actually don't remember what I got since it was several weeks ago that I went.  All I know was that the food was much better than any bar food I had.  I would come here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vy6bsyGB80NX24wddBb--g"
  },
  "nl0X2w09kE8YHYsEiOT58Q": {
    "date": "5/4/2011",
    "text": "Almost but not quite perfect. Cain's is a well-priced smoke free 1/2 bar 1/2 sports restaurant hybrid. The front has tall tables and chairs (like bar stool height) and the back has booths and 6 flatscreen TV's. The whole place was redone in 2009 when a new owner bought it, who bought Redbeards in Mt. Washington and totally redid it. The chef is from Grand View, a fantastic actual restaurant, not bar restaurant. So you're basically getting, at normal bar food prices, truly excellent bar food. Seems like the truly scuzzy clientele that someone 3 years ago mentioned have been evaporated to cheaper Dormont bars. The patrons here are more of the youngish (under 40) Mt. Lebanon variety.  The vegetable wrap is phenomenal, the burgers are great, and the \"Codfather\" gigantic fish sandwich is simply amazing, the best outside of Wholey's. The \"Codfather\" is prepared 3 ways - \"Part 1\" is tartar, lettuce tomato, \"Part 2\" is coleslaw, fries and hot sauce and I forget what \"Part 3\" is. The onion rings are beer battered (not breaded) and fried to perfection. They taste moderately of beer, the True hallmark of excellent rings. The food you're getting here isn't pushing any envelopes but it absolutely is the best bar food in Pittsburgh. Apparently they have a $5 \"express lunch\" that includes a 1/2 sandwich and soup or salad. Never had it but that's extremely cheap.  Beer is fairly priced; Sam Adams and Blue Moon are $3.50 while Yuengling, Coors & Miller are about $2.50, $2 on special. Everything else is under $5.50.  Wing night Wednesdays the good: 25 cent wing night. Best wings I've had in the 'burgh. Wing night the bad: they charge 50 cents per ranch or blue cheese dressing, effectively making 10 wings (the minimum order, which they DON'T disclose) $3 rather than $2.50 which makes it more like 30 cent wing night. Nor do they include celery/carrots, as they do on the menu for regular wing orders. This is the first Wednesday (wing night) they've done this upcharge. I don't mind 30 cent wings, I just like honesty up front. They also don't let you take the wings home that you don't finish. Sorry, but I want two flavors and don't want to weigh 300 pounds so I'm only gonna eat 12-14 wings. We threw away at least a dozen between the 2 of us. People go hungry in this city every night and that's a crime.  The mild buffalo wings are more like medium buffalo wings and are excellent, as are the orange ginger wings. The bbq and honey bbq are what you'd expect. The jalapeno cheddar is fake nacho cheese and pickled jalapenos on top - NOT what we expected and not what we'd get again but still very good.  Service is good 4/5 times. It's slower with wing night; only 2 servers for the whole place.  Definitely go here for the Codfather and the veggie wrap. Get onion rings as your side. Oh! And get a salad too; they use spring mix and baby spinach and make almost all of their dressings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "VKrXZY_OjTZ1yg7a3HH_4w"
  },
  "cFDnhmp3acb6AcT7YPYlKA": {
    "date": "4/29/2011",
    "text": "It's nice to have a local resturant/bar that you can walk to. Cain's is ours. The service is always friendly and good. The prices are fair and it is always clean. I would have given it five stars instead of four, but some nights the food is better than others. I think it depends on who is cooking on a given night. It is never bad, sometimes it is great. Thursday night's prime rib specials are particularly good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cUKXCDWut80gT1y2Z-4wTQ"
  },
  "puY7Ow-XV16o0fK09JbOZQ": {
    "date": "6/18/2013",
    "text": "We have lived near this restaurant for decades but never visited because my husband and I don't typically go to bars.  Saw their ad in a local paper that listed their new summer dinner specials. What a pleasant surprise! I got the lobster ravioli with spinach salad, broccoli and cheese soup and homemade dessert.  The portions were HUGE!  Never have I had a salad with dinner that I could not finish but I could only eat half of the spinach salad.  The lobster ravioli was unbelievably tasty and came with garlic bread.  I could only eat part of this dish too for I needed to reserve space for the homemade brownie a la mode which was also quite large. Took most of this home too and had another whole meal the next day.  My meal price was only $14.99!!! My husband got the filet mignon and crab cake special with equally large portions with a price of $16.99. The service was impeccable and we definitely will go back.  The only problem was the lighting; the bulb to the lamp hanging in the center of the table was partially exposed and it was hard to look across the table.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TZHQKOjcG5CpCw1CfXP18w"
  },
  "M-MCaKzEgJ6H8DQD5p9dFg": {
    "date": "9/29/2013",
    "text": "Went here because the Chinese restaurant a couple of doors down from Cain's that we were going to was closed. The noise in this place is over the top, so much so that we couldn't have a conversation. We were hungry so we stayed and I'm glad. I got the \"Cod father 2\" with a side of onion rings. This comes served with french fries and coleslaw and hot sauce served on top. I asked if all the stuff be served on the side because I'm picky about coleslaw. This is a great sandwich, even deconstructed. The cole slaw is creamy without being soggy and the fries are fresh.The onion rings were stellar. My companion got a rubin and she said that it was pretty good.I was too full, but she got a brownie with ice cream and she was very pleased.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1TJNKEl2k3NuMLICvjJdUA"
  },
  "ULZ0XKjzl7lLlAOz9-3PYA": {
    "date": "12/30/2013",
    "text": "Awesome fun place!!! The place is always busy, the servers are attentive and the food is delicious.. The wings are cooked perfectly! It's your True pittsburgh bar with seating for dinner in the back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GVPZhQwgvDBni0CQ6F5onw"
  },
  "i2kq9tTjnAuyiQ-u4MCyMQ": {
    "date": "8/29/2012",
    "text": "Best brunch in town! These guys know what's up at least for breakfast. Full bloody Mary bar heavy on the champagne mimosas and mom sooo good breakfast menu- big too. It's hard to find a p,ace that has this great of food for so little money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "D9rSDe1BLIWvqxVW__NcLQ"
  },
  "RKB_i9HVuP-zzXT-Gu7XVA": {
    "date": "6/30/2012",
    "text": "You can't go wrong with Cain's. The staff is friendly and the food is great. I'm a regular guest and I've never been disappointed. I highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GNNT23OQn9xNLJ6O8KL8kA"
  },
  "-76aBEPoQGLLg0Kex_-lUw": {
    "date": "2/10/2014",
    "text": "My wife and I wanted to try Cain's after we got a Yelp email around Halloween that highlighted the best Bloody Mary's in Pittsburgh. We bookmarked the places and figured eventually we'd hit them all. I called on a Wednesday in February one afternoon asking what time they served breakfast on Sunday's. My wife and I were celebrating our 1 year anniversary and wanted to grab brunch after we had gone for massages in the morning, somewhere laid back that we could also watch the olympics. When I called I didn't see the Yelp page that mentioned no reservations so I asked anyway. I spoke to Joe Demarco(sp?) who was AWESOME! When I told Joey that we wouldn't be able to make it there until 12:30 (they stop serving breakfast at noon) he told me not to worry and that they'd make an exception for us. When we arrived on Sunday they had a table cleared and were ready for us. The food was fantastic! I got the Harvest Benedict (sauteed spinach and a veggie burger with a poached egg smothered in hollandaise). As a vegeterian I like to see stuff like this on the menu, creative veggie fare. The homefries were crispy and well done, and the hollandaise was rich and creamy. The bloody mary bar was a pretty cool idea as well. We had 2 each and enjoyed switching it up a little with the mixers and the various toppings. Nice job with pickles and the blue cheese stuffed olives! The wait staff was super friendly and extremely kind. When we got our bill we were told that Joey had gotten our first round of drinks! Way to go Cain's! You delivered a solid meal, excellent service and a great atmosphere. We'll definitely bring friends here and come back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "F80YN1uFIV4EXtifRkAvMw"
  },
  "LSWddbQVNWSEFv3f7eZj-g": {
    "date": "4/22/2012",
    "text": "Some of the food and drink items are overpriced.  After waiting forever to get served, my food turned out to be horrible and was sent back..this entire visit was a disappointment.  No reason to ever go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MOMJQIYzbh1iAjzNTJzIJA"
  },
  "upZ6b7l-niyAskZ5eoCmEQ": {
    "date": "10/25/2015",
    "text": "Rude bartender, asked for ID and when returning my ID he basically just throw it to me. Also didn't seem very nice. He thinks he is cool or trying to impress the waitress. Very annoyed and ignorant! Review base on October 25.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lmEUPIf1nHb0opydm6Rsug"
  },
  "hQOd7TnyN9iJ_u8npJKZUw": {
    "date": "10/26/2015",
    "text": "Great beer list and service is awesome!  No more monday all you can eat crab legs.... Not cool And how do you not have ribs or chicken when it's two of your main things?!!!!! Supposed to be known for your bbq and you don't have it!!!!!  Alright..... Coming back to add to this.... This place is empty.... And for a reason. My family and I got 4 dinners.. 1 salad, a burger which was way over done and dry. and 2 bbq dishes. The brisket and pork.. Only two meats they had. And everything was cold. Not hot at all....  Server Kim was awesome. So apologetic and we know it wasn't her fault. Manager was awesome and wasn't her fault either and they did comp our whole check. But kitchen has a lot of problems. I hope they work through them bc it is a nice place.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IFkfDRCzuY5pxvoAFntTyw"
  },
  "fZoJX7IOcFs-f_HYkC5pqw": {
    "date": "11/6/2014",
    "text": "Ok.  This used to be our favorite spot in the area but the past two times we have been here were not the best.   Today's meal was cold burnt and  rubbery.  We had fish and chips.  Burnt mushy fish and cold over cooked chips.  Loaded potato soup was so thick you could use it for paste.  The app we had was the best part of the meal.     The last time we wets here my fiance got food poisoning from a burger special.     I'm beginning to think we need to go elsewhere from now on.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bdD0fTNUyIQKus-1N4qbvA"
  },
  "hmxrKHkojmkE0Q6nwXUi_A": {
    "date": "1/1/2017",
    "text": "Good brunch spot for the weekends-- very casual, pleasant staff and Bloody Mary/ mimosa bar",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lw87mAzOnCkUOTbgnPA_yQ"
  },
  "ofnHHaRTH2_orTUpDdpKFA": {
    "date": "11/19/2012",
    "text": "Have heard that Cain's serves a mean breakfast.   Sure enough, they do! A large menu to select from and a Bloody Mary bar.   Many big groups and families chowing down.   It was crowded but when we walked in there was an empty table.   Service was pretty good.  It did take a little while for the food to come out but the place as packed and we were not in any hurry.   My fritata was good and the home fries were good too. Just get there before noon, if you want breakfast.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "CHWF10UzkvZXthto2xFSTg": {
    "date": "1/24/2014",
    "text": "I can't review the service because I ordered take out, but oh. My. Goodness my food. I ordered the fried chicken and I can honestly say that I've never picked apart chicken like that before. My only complaint is that there wasn't enough. It was juicy inside and so crispy on the outside.   The fries that came along with the chicken were decent, but the fried chicken outshines them so much. It came with coleslaw as well, but it wasn't anything special. Standard coleslaw mix. Anything that was wrong with the rest of the food I received was immediately forgiven when I started eating the chicken. I also got the cheese sticks which are never a disappointment. I can't stop raving about the chicken, though.... GO. EAT CAIN'S FRIED CHICKEN! NOW!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gSU-mXznxLeoklaLWOUUnw"
  },
  "QJxw6Eq_l8HRrSH9eE1Ckg": {
    "date": "11/15/2016",
    "text": "When you go to a place to eat, you expect to wait but when does the wait go from being reasonable to this is a joke?  I came here with some friends on a Sunday. It was maybe 75% full, we got seated immediately. We did not get to order our drinks for 15 mins after being seated... that was a sign of things to come. After we received our waters, the waiter disappeared for a good 20mins. When he finally came back we put our orders in (pancakes, breakfast sandwiches etc, nothing complicated). The food took a minimum of 45mins with other tables being served well ahead of us though they came in 15-20mins after we did. I went to the waiter 2 separate times to remind him it's been 45mins and we have not been served. I hadn't eaten since the night before and it is Noon now so I was extremely hungry at this point. The food came and was average. What ticked me off was we received no apology or even a \"sorry it took a minute.\" The only thing he said was \"your food should be out in a minute, to which the entire table replied with, I should hope so seeing as we're nearing an hour.\" We also had something to do right after this but clearly the waiter could give two (you know what).  We literally ate in 3 mins time and ran out the door and was 30 mins late to our event.   I would not recommend this place, I would not come back. It's one thing to be apathetic and fake that you actually care about your customers but to not even acknowledge a huge short coming in service is p!ss poor. That was a first for me. Thanks a bunch \"Ross C.\"",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SE6FqfYpxyVDCvsiKHy9Cw"
  },
  "3oSLGFVnPgCH69HUDrENNA": {
    "date": "10/19/2015",
    "text": "Ordered salmon. Fishy smell. Not fresh at all. Had to talk myself into eating it. Hostess not friendly. She asked me what I wanted, made me feel like maybe I should walk out. Should of went with it. Overall dissapointing meal. Good placement of TVs is about it",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OVWTU30QB02vkSgVyT_ZBA"
  },
  "b-S6jmqNLRdnJpPxiqSY4g": {
    "date": "10/19/2015",
    "text": "I have eaten here plenty of times and its usually really good.. But all of the pretzel bun sandwiches aren't that great. I think they need to go.  I got the 3 little pigs the other day and the meats on my sandwhich were all cold. The appz were good but the rest of my meal was kinda aweful. waitress said a new menu is coming so hopefully they get back on track.This place used to be a solid 4 stars but the last few times here have been bad. They do have a great brunch though and a killer atmosphere for games so I'll give them another try once the new menu is here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-rJhqdIx-bK19mVjYMg2Ng"
  },
  "VkD4g1hfyXPl5LFwx9cz2g": {
    "date": "6/16/2012",
    "text": "Good, All-American bar food.  This is J and my go-to spot when we are in the mood for something good, reasonably priced and close to home.  We have been many times, but the last time was especially awesome.   J ordered the full slab of ribs which came with fresh-cut fries and cole slaw.  While there was a bit too much BBQ sauce on the ribs, they were cooked perfectly, fall off the bone good.    I was in the mood for a good beer of which they have plenty.  While I normally would order an Abita Purple Haze, I was talked into some shandy that was on special.  Thursday specials are micro-brews - which means that we should really go every Thursday.  But I am getting off track.  When the waitress told me that there were two shandies on tap, she offered to give me a taste of the one in which I wasn't familiar.  The beer that came out was big enough that I didn't really need to order a full glass, but it was good enough that I wanted several.   We decided to split an order of the pepper jack cheese bites which were served with unnecessary ranch dressing.  The bites were awesome - cheesy, not greasy and excellent breading.  I ordered the California Turkey Hoagie with a side spinach salad.  The spinach salad has feta cheese, walnuts, dried cranberries and warm bacon dressing - all in all, a delicious spinach salad with fresh, crunchy spinach.  The hoagie has fresh turkey - that is featured in several sandwiches and meals and always delicious - avocado, pico de gallo, swiss cheese and lettuce.  I would probably trade out the swiss for maybe pepper jack, but other than that - the sandwich is perfect.    I know that this place is not everyone's cup of tea, but for my husband and I, it's good food, good beer and decent service.   The one thing that for me stopped me from giving it 5 stars is that it is so freaking loud in there.  Apparently, this is the hangout for people that want to get really drunk and be really loud - even if there is no need for it.  You generally have to kind of yell over to be heard, but if you can get past it, the food is worth it.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "2JjI8DCyrpabtg36iL5lrw"
  },
  "_Z52nHJ6tQmaGsMd5CZRNg": {
    "date": "9/28/2015",
    "text": "Sunday afternoon, I walked into this place. Steelers game was game was on TV, the place was packed with fans. They advertise a good selection of beers, but did not have what I liked - Sam Adam's Octoberfest. Com'on its end of September. Fortunately found a place to sit. I was very hungry so ordered food- fish fry or fried fish. A basic salad came along, plenty of green, tomatoes and cucumbers. Not enough dressing. Fish was dry and nothing to crow about, just very basic or less. Not impressed. Fresh fries were soft and sticky. They gave a lot of food but the quantity does not make up for quality. The bartender was great, very friendly. Well one can say perhaps too friendly, given his propensity of using the f-word.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SjBrS0LGudtBx1pkP3PpuA"
  },
  "9vha-lkSKKN0c3ted8rs6w": {
    "date": "2/8/2013",
    "text": "Wow my Mom,husband and I had dinner there yesterday from a ad in the paper with Valentine's specials for the whole month of February. We ordered the Surf and Turf special. It started with a salad I had their classic which was HUGE and SUPER DELISH !!! The classic salad was a generous amount of spring mix,tomato,cucumber,purple onion,peppercini.   They have so many salad dressing choices not your ordinary blahzay boring choices. The spinach salad was also AMAZING spinach walnuts,feta,cranberries. The Caesar is what you would expect generous portion but average.  Then a soup choice of French onion or soup de jour  (soup of the day) my husband had the french onion Wow he said it was prepared perfect and how french onion should be served a nice crock full and nice amount of cheese covering and balance of bread and soup. My mom and I had the soup of the day which was a roasted red pepper mushroom soup this was a soup we had never experienced and boy was it fabbie definitely a soup we shall enjoy again.  Now the main course.  a 6 oz Filet Mignon and 4-5 oz Lobster tail , Twice baked potato, Fresh white asparagus.   The steak was cooked PERFECT my Mom and I ordered med rare my husband ordered his med and there was not an issue with either.  If all this wasn't enough choice of homemade desserts  was carrot cake    or brownie a la mode.we all chose the brownie a la mode. It was HUGE the brownie was like a 4x4 brownie with a HUGE scoop of ice cream.   Service was EXCELLENT our waitress was on top of things couldn't ask for better what an amazing establishment ! A True hidden GEM !!!   All of this for 19.99 !!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tFkebKxUNu6PsDd2d_hskQ"
  },
  "e--JVNjmEzhZNuECMp7kIw": {
    "date": "5/17/2015",
    "text": "It's places like Cain's that are turning Dormont into a Pittsburgh hot spot. Great Beer selection, food is always good and the atmosphere is always pleasant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bleyhN--91eJmPyJpXr9Mw"
  },
  "zKCvcwHFdsc9Ntf-9zvGHw": {
    "date": "10/27/2014",
    "text": "I had heard a lot of different things about Cain's before coming here for the first time around 2pm on a Sunday afternoon. What I heard was True after dining here- food is really good, service leaves a lot to be desired. Two of us were the first to arrive for a party of six. We waited a good 10 minutes at the \"please wait to be seated sign\". No one even acknowledged us standing there until two other members of our party finally arrived. They were semi busy but cleared out quickly since it was a 4:25 steelers game and several tables there looked like they were heading to the game. Anyways, a server came over about 5 minutes after we were sat. To get our drink order. She was pretty slow getting our drinks out to us. The other two members of our party arrived by then and when she came back she said the kitchen was running 30 minutes behind and we should order appetizers now if we wanted any. Ok so we ordered 6 old bay wings, 12 thai chili wings, and 2 orders of the cheese sticks. The cheese sticks were the best cheese sticks I have ever eaten! They are huge-3 to an order but these are so thick and gooey....and the marinara served with them is a sweeter marinara, it's very good. I didn't try the old bay wings but they were quickly devoured by the rest of the table. The Thai chili wings had a very nice sweeter flavor. And they were large wings too. Very tasty. She came to take our food order prior to our appetizers coming out. They did take awhile but she did warn us they were slow. Entrees came out quickly however. I had ordered the BBQ pulled pork sandwich. It had a horseradish BBQ sauce that sounded really interesting. The server came over halfway through the appetizers and said they ran out of the pulled pork. I was disappointed but I ordered a turkey Rachael with sweet potato waffle fries instead. The sandwich came on marble rye with coleslaw Swiss and thousand island. The fries weren't great and we're kind of soggy. The sandwich though was excellent. Real rotisserie turkey and lots of cold slaw which is how I like it. A steak and egg hoagie was ordered with chips-she said it was really good and it was huge portion wise. Another ordered the pastrami sandwich and another ordered the pastrami salmon blt. Both were said to be tasty. The quesadilla burger and the bacon and blue cheese burger were also ordered and were quickly eaten and said to be delicious . 4 of us took home half of our sandwiches - portions are huge! Our server didn't check on us and it was us who had to flag he down for drinks. This is a great place to watch a game, lots of beers on tap, good food. Service needs to improve but I wll still come back again because the actual meal was tasty and priced right",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gFsqraWQfG46ohVFRg_d3A"
  },
  "0wl_EMFW75oom0q54FXbEg": {
    "date": "4/11/2014",
    "text": "This place is dingy and dark and I describe it as a good Yinzer dive bar located in the South Hills.  If you want a crowded place, go there on a Friday or Saturday night or Sunday brunch.   Beer selection is not good- they were out, more than once, of the only decent beer I wanted to order and the imports they have are Fosters and Heineken- not for me.  Mostly the beer is just hit-or-miss micro-brew fad-beer and they are out of the only beer(s) worth drinking.     I've only eaten here a few times.  The breakfast (eggs/ breakfast meat/ toast) is not bad, but don't get the sausage links- no flavor, literally like eating wet rolled up cardboard. (They are competent to make the eggs the way you like them from my limited experience).  Also, the first time I ordered the wings they were really good.  But, the 3-4 times I've ordered the wings since then, they were really bad (dry and cold -as though the order was up but not delivered to the table in time, mostly wings and not drums -only 1-2 of the drums in the dozen, and small).    The service is slow and the servers don't seem friendly and are in too much of a hurry to leave your table.  They also aren't good at checking back (keeping their heads down so if you try to motion to them that you need something, they don't see you).  Because of that, this is a place where you have to get up and find your server to get a condiment, extra silverware, or another drink (I find that annoying).    I can't seem to find a reason to go there again as they are consistently out of my beer, the food is \"Meh,\" the service is not that good, and the place is really crowded with locals in tee-shirts, blue jeans, and ball caps most of the time.  Also, any place that needs to have a bouncer at the door is not my kind of place to begin with.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NVnTspOrXfupRos5RQrhNw"
  },
  "kS4pY5ntcMKijs4GMbN0LA": {
    "date": "4/30/2016",
    "text": "I have been going to bars for 30 years, probably the rudest staff I have ever seen. Will NEVER go back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E6Q59TAOTQ1JVHU1Uwb2rQ"
  },
  "CLaXffh1vqAwMEFi5kL9pw": {
    "date": "7/18/2012",
    "text": "Well, currently I am so bored with waiting on my food that I've decided to write a review. I've been sitting here for approximately 45 minutes and have managed to be served a melting glass of tea in a plastic bar cup. It is so extremely loud I can barely rhink to type so forgive any errors due to my brain being overwhelmed by the amount of sound it is sorting through. I understand it is a bar, however I am sitting in the rear of the establishment thinking it would be calmer, quite the opposite.   The restroom looks like a college bar on a Saturday night, and it's Wednesday, in Dormont. There is honestly no excuse for clogged toilets, paper towels all over and water all over the floor.   Overall, after finally being served, the wings were mediocre, at least they were .35cents because it was nothing to write home about. I think I'll make the short commute to Moon and eat at Wings, Suds & Spuds where the service and atmosphere are wayy better. My Hot Garlic Parmesan wings tasted like they were rolled in Frank's Red Hot then Creole seasoning and finally sprinkled with parmesan, I've definitely had better.  I understand that yes, it is a bar. However, considering that 98% of the patrons were adults over the age of 23, it sounded like a crowd of kindergarten children each yelling over the other. I was sitting across the table from my date and couldn't hear him but could clearly hear the two tables next to us and the booth behind him, have some common courtesy and manners.   After reading the other reviews regarding weekend visits, I think it goes without saying  will not be returning, no matter what, nor recommending this place. It appears to be under staffed, unorganized, and mismanaged. The drink specials, are hardly deals when you compare them to a train ride to the SauthSide or the likes.   May the townies continue to disappoint and should old stories from 15 years ago, that'll be rhw only patrons but, if that keeps them in business, so be it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4HWG2E7pIweFJNJ0LNzBOQ"
  },
  "o7_IGdTZ1Dif5xKuQF432w": {
    "date": "11/20/2015",
    "text": "Yum! Bloody Mary bar is my favorite, especially during game days on Sunday's! I would love to see an expansion of an outdoor space for the summer time! That would be SO FUN! Love love Cains!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zAF_Oe0iKVCxtsf6bMQdnA"
  },
  "8fYOVXdMA8OUf6pF92xDZw": {
    "date": "7/1/2015",
    "text": "I really like this place i always got great food and awesome dessert. Seriously anything i have gotten here to eat has been bomb! I have gone here and just got dessert too. They have a bar and a well sized seati g area. Theres enough tvs so u can see from any angle.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vjjHaXU2iKJKglBxW-tRYw"
  },
  "rc0JWHYj4CZUGGMXSzwqSQ": {
    "date": "4/28/2015",
    "text": "Maybe just didn't hit at the right time, been here twice and both times food wasn't that good. I went on wing night flavors were ok but wings weren't crispy.  Tonight was taco night, waitress was great but not sure what the hold up was with the tacos but it was a long wait. Wasn't that they were busy yet..not sure why but wish I could say it was worth the wait! But not at all, the price is not cheap and then they were cold, and lettuce , cheese,  tomato, salsa is extra.  There are so many good choices in the Pittsburgh area I dont think I will give Cains a 3rd chance. I may be spoiled with my small cheap local bar, but at least the food there is great tasting and warm! Lots of tv's and ok atmosphere so I will squeeze out 2 stars.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wV-66bntZ2LXU0-WjGyiEA"
  },
  "g9IYLGWtpYn6bF2GJKnYjw": {
    "date": "5/27/2012",
    "text": "This was a solid stop for a lunch with my grandma and my mother.  As we drove by, my mother said, \"Oh, Cain's that place brings back memories.\"  So, I told her to pull on over because we were going in.  After seeing the abundant sauces, I had to go with the wings.  I was very happy with them.  The sauces were plentyful and very different.  I got the mild garlic parm and the signature Mean Green, which was a mix of peppers.  Both were delicious and came with carrots, celery, and ranch free of charge!!  My mom's mushroom chicken wrap was huge and delicious, and her sweet potato waffle fries were great.  They could have been a little more crispy, but that is just how I like them.  Now my grandma's sandwich was good, but it were the homemade chips that had me in love.  They were phenomenal.  Next time I night jut make a meal out of their chips.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o1HzICcmqnTNCN38zeE0Sg",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Delicious wings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o1HzICcmqnTNCN38zeE0Sg/o.jpg"
      },
      {
        "img_id": "U5oGHMEHjJwH2I3dMJBKzA",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Sandwich with the homemade chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U5oGHMEHjJwH2I3dMJBKzA/o.jpg"
      },
      {
        "img_id": "86EeENUI-VHzRQ9-PaSfHA",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Sweet potato waffle fries with a chicken mushroom wrap",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/86EeENUI-VHzRQ9-PaSfHA/o.jpg"
      }
    ],
    "user_id": "7V29xzsIxlHfdcHsnpHB3Q"
  },
  "3g1EQvXWEfoPhYKccxApJw": {
    "date": "4/3/2016",
    "text": "The place is well put together but It's over priced and the service is terrible.  Tonight was no different than any other night I've had at Cain's.  An hour after ordering appetizers and burgers I walked up to a waitress who wasn't waiting our table and asked on status of our order.  One minute later all of our food was delivered cold.  I think it's reasonable to expect your wings to be delivered before the main course but I'd certainly expect the food to be warm.  It's also really expensive.  A table of three at Cain's, who spent two hours drinking and waiting on our meal, was way over $100.  I didn't do a line by line break down of our bill but I'd guess the place carries a 20% premium over other bars in the area.  Maybe worth it if the experience was enjoyable but my friends and I usually leave more frustrated then when we walked in.  It's not worth the money.  The place had a great location but otherwise it's a waste.  I'm personally finished with the place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RJe6DthFZg8KJ8CsDq6GRg"
  },
  "zLBQztxyaLhxJNOatLJxLA": {
    "date": "3/20/2014",
    "text": "Cain's Saloon has popped up on my radar repeatedly since it opened - many people have stood by it as a fantastic dinner spot and bar. And while I certainly didn't dislike my experience here overall I can't say I quite get what all the fuss is about.  I came here for dinner and drinks with a friend and upon first entering we were pleased; the staff got us seats and our waitress very patiently helped us navigate their beer and cider options - which took a while, there were just so many! I truly do praise our waitress and the bar staff for taking my companion's final request, which was a little off-menu. No one complained and they whipped up my friend's drink while I went for a Pear Magner cider.   The particular night that we went was wing night, and while wings did sound wonderful we ultimately went for a plate of loaded fries in addition to our separate meals. It took a while to get them, but we figured it was getting busier since it was the evening and we let that slide. Here was where the meal began to lose some of its shine - while at first the fries were absolutely delicious, the more of them that I ate the less appetizing they tasted. I suspect that while the top layer was composed of perfectly cooked fries, the last layer of fries at the bottom of the plate was just drenched in extra grease and oil that kind of ruined the fries themselves for me. Plus, when ordering my sandwich I had asked for one of three sauce options listed on the menu - but once it arrived I realized after biting into it that my sandwich contained the wrong sauce. I didn't bother complaining at that point because of how busy it was - I didn't want to wait for a replacement meal; the sauce I got wasn't too bad or spicy for me, so the sandwich itself still tasted good, but it was still a bit frustrating. After actually finishing our meal, it took an INCREDIBLY long time for us to spot our waitress and flag her down for our check. We're not sure why she disappeared for so long; it was definitely odd to have our service go from above average to below average.  And when we ducked into the bathroom on our way out? Good Lord, was that a tiny room! I almost hit someone with the door because you literally only have a foot or two between the door when it opens and the wall, so if anyone is standing on the other side they're often in the door's way by default. And it was almost impossible to sit in the stalls, they were so tiny. Definitely be careful when entering the bathrooms, folks.  Needless to say, my experience was pretty mixed - it definitely started out strong but it kind of went downhill throughout the night, although it never hit actual flat-out bad levels. I'd still come back to Cain's if someone wanted to, as their food was certainly enjoyable enough. It's absolutely a decent place with some decent options for food. It just wasn't incredibly impressive to me after all the hype I'd heard.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "RqQ9811__L5UW0cx6e7GFw": {
    "date": "5/1/2016",
    "text": "Came here for a breakfast with my bf this morning. Was surprised that bar was full. Nice atmosphere and music. Waitress are polite. The only issue that its been almost one and half hours we are sitting here and still don't have any food.  Asked to refill my coffee and got a cold one. Unbelievable.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OIW6mHQCAWTUHI3hyoLpxw",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Delicious breakfast. Took more then one and half hour to cook it for us :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OIW6mHQCAWTUHI3hyoLpxw/o.jpg"
      }
    ],
    "user_id": "50JPFRjqoW-5C5aUtwDunw"
  },
  "mGZbq2Ik_eSLNQKxD1gZJg": {
    "date": "1/15/2016",
    "text": "Being that I have been here a few times and have had \"better\" experiences, two stars is generous. I have been coming to this BAR for the last 4 years. I have had various items off their menu. From their hamburgers, to salads, to the brunch and chx fingers, wings, and ribs. The variety of sauces is what gets me to come back. But anyway. It's a hit or miss with the food and service, really. Never consistent with quality of either. My latest experience was the brunch. I thought, how can they screw up brunch?!. Um.. Well. I'm sure it would have been great!.. If I didn't have to wait, for literally, 1 hour and 40 minutes for it!! The gravy( breakfast gravy) was warm, however everything underneath was cold. The servers are, for the most part, so terrible I can't even imagine why the owner would hire them! Ugh! I have had ONE attentive server, and that was because we were literally the only table for her. Just stick to going there for a game and a bucket or pitcher! That way you don't have to worry about when your going to catch your server again! I am not exaggerating in the least. I don't usually give a bad review, but I feel this deemed necessary. If your a chick, good luck. If your a smokin dude.. You may have better luck. Best wishes folks!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nzl2KyGKLtV7j8QEfOhC-w"
  },
  "1pm3vqc5Mf8_0yHWl80_Vg": {
    "date": "3/31/2015",
    "text": "I decided to try someplace different and I have passed Cain's in my travels.  I will start with the good.  I liked my waitress. She was nice and attentive.  There were many beers on tap to choose from.  I started with a house salad and found it to be yummy.  The french fries were hand cut.  There is a section on the menu for barbecue and I decided to try the ribs.  They touted that they slow cooked the meats.  I have eaten great barbecue in my life and this was not it.  The ribs were dry and overlooked.  It did not seem like authentic slow cooked ribs to me.  I barely ate half of the order.  I'm sure that there is better food at this restaurant but I'll pass on the barbecue in the future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UrY7qgbtN-99RsDFjJkvBw"
  },
  "OREYIKQ-1YdIPDsLCJuEGg": {
    "date": "3/20/2015",
    "text": "Came here to grab a late lunch and watch the NCAA tournament. The atmosphere is pretty good for drinks and sports and the food is pretty good for a bar. I got a crock of chili and the grilled cheese  and was pleasantly  surprised by the quality and the portion. My wife enjoyed the Cain Club with waffle fries, although  she noted her turkey was kinda dry (we did take hers to go so that may be a factor). The one issue I noticed was that our table was not cleaned off from the prior customers so we had to use napkins and the menus to do that. The wait staff was friend and attentive otherwise. If I was a local I would definitely  return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wYmb4A5GLbJTnrnxywtDsQ",
        "caption": "Photo of Cain's Local Bar + Kitchen - Pittsburgh, PA, United States. Cains Club",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wYmb4A5GLbJTnrnxywtDsQ/o.jpg"
      }
    ],
    "user_id": "sc2tRFEfdmYRYY93Z_l13g"
  },
  "fNi2r4UMVI0eibmU7G6YDA": {
    "date": "2/7/2015",
    "text": "Hi there...went with a group of five for brunch today and things started off well. Coffee...water...good fun. Then we ordered...three of our party received their orders within 15 minutes and liked their food.   The fourth got his about 30 minutes later and his food was terrible. Cold. Greasy. Stale.   The fifth, me, never received the short stack of pancakes and eggs I ordered. Bad service by the wait staff and manager...they checked in with me and left to figure out where my order went several times. Then they'd come back and ask what's wrong as if they forgot they were already tasked to find my order.   Cain's is usually a good place but this morning they dropped the ball...and apparently my pancakes and eggs.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fAu3s8aDq-fzL4kkYPEu3w"
  },
  "_qeLEJ5SBmt2-OXxvOk-cw": {
    "date": "8/20/2017",
    "text": "The service is absolutely terrible but the food itself isn't bad. I'm typing this as I've been waiting for 30 minutes for an omelette and quesadilla because i don't know what to do with all the time I've been sitting here waiting the 6 tables who came in after me already receive their food. Second time here, second time being disappointed with the service. Probably will not come back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ac4D0dVdHFS8u4XAyAYqg"
  },
  "_Vt6ov-Pnbmhhm6elwn8xw": {
    "date": "4/24/2016",
    "text": "Love coming here for their cheap wing night. They have a variety of great sauces and flavors to choose from. My boyfriend and I love coming here to have a drink and watch a good ol soccer game too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FQzMahuwloL7r44Gl_lNNA"
  },
  "ySE6cQ17q0NApPHKdqhuZw": {
    "date": "7/28/2017",
    "text": "I Work close and have tried and tried again to like Cains.. it takes forever to get food then once you do one part or another is normally cold , if you are lucky enough to get a hot Sandwich then the fries are cold.. never fails.. it's hard to get a refill, the larger older bartender/waiter  knows nothing about customer service and is loud and inappropriate. I now know that the upstairs is not completed because \"Joey ran out of money.... Again\"  That's nobody's business.... Maybe Joey should let you go and use the money for the remodel. Tuesday was the final straw.. Its taco Tuesday, there are 3 other tables of 2 to 4 people and 3 or 4 sitting at the bar..  it took 1 hour to get \"the special\" steak tacos and they were cold when they hit the table.. even tried calling in To-go orders and they are either wrong when you open them up or not ready for 15 to 20 min after you were told. Sorry Cains but you have lost many of the people I work with for the same reasons and we can hit your building with a rock from where we are.  We wanna love you but you need to pull it together.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ppYGnsbYBxmSyEhDKHphwA"
  },
  "s97vv-B2bpFoMh3AgTFa7A": {
    "date": "1/31/2016",
    "text": "Service was extremely slow to begin with.  Not a big deal being that i was visisting with friends and in no hurry.  Took over a half hour to have our order taken. Ordered my food and of course an hour and a half after sitting down it was received.  Go figure cooked, but cold.    When I told them that it was cold they tried microwaving it.  They ended up making a new one  and the wait was over 20 minutes.  I should have taken the microwaved food, because this time it was hot on the outside and frozen on the inside.  real great to bite into.  heard lots of great things about this place, but I can not say it was at all good.  Will never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VDMWgq8NF6eRlLQirWfQ3w"
  },
  "yWhBKjyorFE7wWFXVuASrA": {
    "date": "4/5/2016",
    "text": "Got a couple well drinks with friends.  Nice, casual atmosphere and decent prices.  Waitress had no issue splitting checks.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K-nJvlZKQOHp1R5CkHh0Eg"
  },
  "4pIojrwCXi6MtdsKIqU5sg": {
    "date": "5/15/2017",
    "text": "Nastiest burger. Super soggy. Like eating wet sock. Good fries but burger was like eating solid vomit. Never order the capone burger",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZWDXSaBRCcfP6yg8_d_gMg"
  },
  "3PxLlpal9zXekBqYGfXOkQ": {
    "date": "10/25/2015",
    "text": "Great beer list always changing it up. Follows the season. The food is good the Cuban press is one of my top picks. And you can't beat a wing night Wednesday. Sports fans if you can't get a game there on one of those tv your team must not be the good.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qBWiG2GK1FJan4ajG7vMFA"
  },
  "_T153sSzZwFA4Y1MMZy5GA": {
    "date": "6/18/2017",
    "text": "Great wings, good service, good beer selection. Hardly fine dining, but great bar food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T9-wKlq0jbMGATDMkJ0RAw"
  },
  "6xBRGrIaaD8mpljmZib0Dg": {
    "date": "3/14/2015",
    "text": "Came for breakfast. Kim the \"manager\" was mean from the time we walked in the door.  We tried to sit at a table but she told us they had a big party coming. Then, she sat 2 small parties there.  90 minutes later, after those people had gotten food and eaten, we asked about our breakfast.  We were then told it would be ANOTHER 15 minutes.  Funny thing is, my friend had told me how horrible the service is and how mean the chick at the front acts.  We tried to give them the benefit of the doubt.  Bad idea.  This place is a bad idea all around. One star that belongs to the bald bartender.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fc2aBUcE7ipkN411GGQd-w"
  },
  "DpZb7oHDJHX3HtUXqaCIAg": {
    "date": "4/4/2016",
    "text": "You can never go wrong with a bar that serves breakfast lunch and Dinner.. This place has delicious homemade dishes daily! Food presentation makes your eyes bigger than your stomach! A must try for anyone looking for a different new place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-GMLsazYLquHRMIGeOy5jA"
  },
  "SPesLmE_kiVMiEtB-f31Tw": {
    "date": "11/8/2015",
    "text": "Cain's has great BBQ and the best bruschetta I've ever had, but DO NOT go there on a game day unless you enjoy the fact that all 50 televisions have their volume jacked to the the max. My fiance walked in and walked directly back out the door with nothing but an instant headache.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1BEwbEprDCGotY5R6lvxnA"
  },
  "vX4K4Xv93j6W0XtxosYQWA": {
    "date": "4/13/2016",
    "text": "I was pleasantly surprised by this place. Was brought here by some locals, had the bacon and bleu burger and it was fantastic! It's pub food, but well done pub food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hltIcM8gCxJUwOD37zi_Q"
  }
}