{
  "lQpu7yRUp7f3iN2kFaoI8g": {
    "date": "12/5/2014",
    "text": "Not the best I've had but definitely not the worst. Plus, the cashier made a mistake taking our order and the owner (I assume) rectified the situation in a great way, so a+ customer service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJq5b1YWluNX1yafGmwhTA"
  },
  "nylzUh-CJjz345ZKZRDCRA": {
    "date": "7/8/2015",
    "text": "My dad loves the dolmas (stuffed grape leaves I think). I loved the gyro, best I ever had.  Although I haven't tried everywhere around Pittsburgh.  Gyro and fries with cheese was 8 something.  The fries weren't the greatest, but salt, pepper, and cheese made them good.  My dad said the grease looked dirty but Idk.  Little family business that needs support.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8PFZs6fsRwMafqaJV2nOoA"
  },
  "_hib-Hs8SbkyDfYOnHSHhQ": {
    "date": "6/2/2014",
    "text": "Best gyro and fries in the South Hills! The price is incredible for the portion size and the fresh potato fries. This place is a gem in Castle Shannon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YfUYzUPozALoaKnndnx-kw"
  },
  "9WQ9Mc2N9LBs8L_-yN9BNw": {
    "date": "12/10/2015",
    "text": "Always passed this place and wondered how the food would taste because I'm picky with my gyro's. Finally stopped tonight staff is super friendly very welcoming, The pricing for stuff is very reasonable. And the gyro was super soft and the sauce is the best I've ever tasted. Will definitely be going back again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BkZrBn2h69OPsm43LmSdyA"
  },
  "VzCJEpvJ886cBLm6Qa4B3w": {
    "date": "11/24/2015",
    "text": "Was there today with a friend.   The gyro was good and the service was fine.  Very friendly waitress.   However, the jerk of a cook, (Sam) wouldn't stop yelling and pushing around our server.   She couldn't do anything right.   Both my friend and I were angry.   It made for an awkward lunch.   We will NOT be going there again.   I hope that poor woman isn't his wife.   He should be ashamed of his behavior.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ih9ex2Wq2OcrQE3pWvziww"
  },
  "wXzaLGrxBTiZPTUAzcx6rw": {
    "date": "3/18/2013",
    "text": "Wow! Don't judge a book by it's cover! Although Original Gyro looks like a hole in the wall that would serve poor quality cheap food, I assure you it is quite the opposite. Per hubby's request, we stopped at the OG on our way home the other night for some quick take out.  For $8 each we got a meal with our choice of protein, pita and two sides. I chose the chicken with fries and a salad while hubs got the pork kabob (forget the official name) with rice and a salad. We watched as the cook cut the potatoes and cook my fries on the spot! Delic! My only criticism is that they were is desperate need of salt. The salad was huge with large chunks of cucumbers, tomatoes, olives and feta. The vinegarette was tasty but a bit sweet for my liking. My chicken was spot on. So much so that my husband quickly gobbled down my leftovers before I could save them for tomorrow's lunch. All in all, good food, great quality and huge portions. I'm a fan!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ftUrNSpxUr8eWCyOlsZVgg"
  },
  "3Jm8NuoFnSQcQjKfNeZa8w": {
    "date": "10/20/2015",
    "text": "Great place to grab a quick and tasty gyro at a great price that can't be beat. There is limited seating available but take out is quickly and easy. The gyros are flavorful and packed with meat and all the right toppings so much that you better not be afraid for things to get a little messy! I didn't try any but some sides and desserts are available. Service was quick and we were out in less than 10 min with our piping hot food. You can't beat the prices. While the workers were friendly with us, they were having an argument amongst themselves right in front of us which was unprofessional but I will still be back for takeout because you can't beat the product for the price!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "TqONHy1yyWRvenaFx6VtKQ",
        "caption": "Photo of The Original Gyro - Pittsburgh, PA, United States. Grilled chicken gyro - delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TqONHy1yyWRvenaFx6VtKQ/o.jpg"
      },
      {
        "img_id": "nERGchgl2YgL7pWQ-EycZQ",
        "caption": "Photo of The Original Gyro - Pittsburgh, PA, United States. Spanakopita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nERGchgl2YgL7pWQ-EycZQ/o.jpg"
      },
      {
        "img_id": "9OgPTCIxcLpwMvcdnGKlOA",
        "caption": "Photo of The Original Gyro - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9OgPTCIxcLpwMvcdnGKlOA/o.jpg"
      }
    ],
    "user_id": "mm9WYrFhiNqvHCyhQKw3Mg"
  },
  "Z2ntQI1oebT5FbNT3URq9w": {
    "date": "7/14/2017",
    "text": "Best gyros  i have had. Great meat. Quick , nice and polite service every time here. Good place and reasonable prices for the delicious food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ydhrOdgvFgkgZdVgEazj3g"
  },
  "gmegXVIASdp6ICP-z5AWQg": {
    "date": "5/4/2017",
    "text": "If I were a prisoner on death row, Original Gyro would be my last meal.  The reason I would be on death row is for absolutely murking a criminal amount of gyros from this place.  If it weren't likely to make other guests uncomfortable, I would lay beneath the spinning ring of gyro and have them cut the meat directly into my mouth.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1GVLcnklCLYxgGYf2zmRWw"
  },
  "PrvXEcgPkqIPHPUZ3mu56A": {
    "date": "5/4/2017",
    "text": "Listen. This isn't the NBA dunk contest. I don't just give perfect scores, but this place deserves a perfect score. The gyros taste is guaranteed to be the best you've ever had. The price is even better! The Super Gyro Special includes a Gyro, Fresh cut fries, and a drink for only $7.47   If you find a better deal on a better quality Gyro, you tell me.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "GC7KC3siodScs2MXKjMaYg"
  },
  "EOshVZCYUZ0RPnolXYFAmw": {
    "date": "4/4/2016",
    "text": "This is a good little spot for gyros. I order a regular gyro with fries and tea. The gyro is always fresh, packed with meat and toppings, and served quickly. The tzatziki is pretty good, though Olympos Gyros in Robinson still wins me over for best tzatziki. The baklava is really good as well. It's cash only but there's an ATM inside. Staff is always kind of standoffish but nice enough, not rude in any way. It's a good spot for a quick meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gH144bG_roPadHLjHag-cQ"
  },
  "W2slCJzkA8Uun73X83ROPw": {
    "date": "4/14/2017",
    "text": "My wife and I love the new one in Oakland.I walked home last night from work and got two of the best gyros we ever had..love it..thanks for coming to my neighborhood and only 6 minute walk from my house...great price for 2 Gyros with extra meat and fries and a Drink.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YB7dcmGBVlvmMZBpOA2v4Q"
  },
  "kjtTb_lxx1xpRRCQLhggcg": {
    "date": "6/9/2017",
    "text": "Great food. Gyro comes with a lot of meat!  However...I go back because the tiramisu they sell is the best I've ever had. I'm not sure why. It might not be an authentic recipe...but it is so good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g8hYu_3_0IwAntNbPGm_cg"
  },
  "6VuzyQb17Kyy3z-lzwmDMQ": {
    "date": "11/29/2016",
    "text": "This food is delicious! I love that they shave the gyro meat fresh. Groupons are available- great opportunity to try the place if you haven't already done so.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "am0arrzxAfSm65zyatG7Mg"
  },
  "7awkUxpB9X5lq_H5iCD38w": {
    "date": "10/27/2015",
    "text": "Good food for the price. I like the gyro very much, wasn't too salty and the sauce was great. Only problem we had was that the owner I believe was berating his kitchen help the entire time we were there. It made it uncomfortable and that usually takes a lot for me to see before I feel weird. Hopefully it was a fluke but will give it another try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tpLWXsk3Uyx_qyxcN_tEA"
  },
  "30ItD3AdnDspcljYkmiHSA": {
    "date": "1/28/2013",
    "text": "The OG is still CASH ONLY!  After visiting my aunt and uncle in a nursing home way, way out in South Fayette last evening, Dad decided to treat us on the way back.   The dolmades are still divine, and the fries are twice-cooked, hot fat glory, but that gyro, which I had been itching to sample was a worthy challenger if not the very best I've ever eaten. The pita bread was fresh, plush, and studded with cornmeal, the meat was fall-apart luscious, but the ace in the shirt pocket was the tzatziki sauce which recalled ranch dressing with its union of lardy, tangy, and sweet.   And the baklava was yet again nutty, flaky, honey-drenched pleasure.",
    "rating": 4,
    "rated": {
      "funny": 12,
      "useful": 16,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "AVxjXH-ombZSp7jvq_qS0w",
        "caption": "Photo of The Original Gyro - Pittsburgh, PA, United States. Baklava",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AVxjXH-ombZSp7jvq_qS0w/o.jpg"
      },
      {
        "img_id": "6McR2JiPS2nIJ_04elUK7g",
        "caption": "Photo of The Original Gyro - Pittsburgh, PA, United States. Gyro",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6McR2JiPS2nIJ_04elUK7g/o.jpg"
      },
      {
        "img_id": "xuq4tf9R_FvM5KYfQ5MSBA",
        "caption": "Photo of The Original Gyro - Pittsburgh, PA, United States. Dolmades",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xuq4tf9R_FvM5KYfQ5MSBA/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "8wFkqKe1bt24_yXgx_PQww": {
    "date": "9/10/2016",
    "text": "Steak Gyro was awesome! Only complaint were about the fries, which weren't fully cooked. Will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hWEzZJ3pdsp0UwnM295CBQ"
  },
  "PwF5o9I5C0Pxtwr7rSZwBg": {
    "date": "1/26/2016",
    "text": "Not my absolute favorite gyros around but good because they are super close to home and I've had nothing but good experiences. Once, the cashier messed up our order and the owner made it right and sent us home with 2 more free gyos! Made us fans for life.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "i_5fq6ubebLBah97FlSzCw"
  },
  "qvOCS2bZ3Isg5AZN6MQhIA": {
    "date": "10/24/2015",
    "text": "Very good gyros and wow you can't really beat the price. Gyro, fries and a tea 6.70 that to be is a deal!!! We be going here quite often.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4y_1o3LAtWwS00gCUeSDRw"
  },
  "iXwJEAXVrLhyO1sl5aPjdQ": {
    "date": "6/26/2017",
    "text": "Best gyros around. The meat is very juicy and never hard or dried out. Plenty of food with the gyro special. Our office is right down the street and we eat here often. The employees are always really nice which makes us come back even more!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yS8VTtuo7mirvjE9RPu2wQ"
  },
  "15GqwNVvvR_5KHDQ025TjA": {
    "date": "3/10/2017",
    "text": "I was in and out before I could check in with Yelp.  The gyros were nicely sized and tasted great.  Prices were fair as well.  I'll be back again for more.  :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqVeWiBMfOcvjH41f8X-Rg"
  },
  "-4xjONuQ6_E-l9qrySTqFQ": {
    "date": "6/21/2013",
    "text": "I've found my go to Gyro joint!! As a longtime, (now former Tom's Diner) gyro eater, I appreciate the simple, and satisfying experience of Original Gyro. My daughter, is usually my eating out side kick, and if we're in the Castle Shannon area, it's rare to pass up a stop for her plain (meat & sauce) gyro. We've been in enough times, that our orders are in progress when we walk in. I've thought of trying something different, but why mess with the streak?  The Gyro special is the big hit , for $5.75+tax, you get a gyro, fresh cut fries, and an ice tea. This is my kind of 'fast food', not dried slabs of bark like gyro meat that turned me off from gyros at other places. Walk up to the counter, watch your pita warm up on the grill, watch the moist, tasty meat fall onto the pita, and catch yourself drooling as the order is bagged up, (because I take it to go).   If you know what you're looking for, it's all you need to know.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "kKCWp4tDw76Q546wXwWuTg"
  },
  "qfXsHz448W5v5Lz72a-MLg": {
    "date": "6/22/2015",
    "text": "Best gyro in Pittsburgh?    If your looking for the best gyro in the greater Pittsburgh area this just might be it.  I don't live in Pittsburgh but I have been to 2 other local gyro spots (mike & Tonys, lesvos) and I have to say the Original Gyro edges both of them out.    When it comes to gyros there are 2 main criteria: taste of the meat and the tzatziki sauce.  Their lamb is cooked and spiced to perfection on a spitter and the amount of meat they give you is overwhelming, I honestly had to take some out so I could fit it in my mouth.  The flavor of the lamb was sealed in my fingernails for a good 3 hours even after I washed my hands, a True sign of slowly seasoned meat.  Their tzatziki sauce is nice and not too overpowering, like a cucumber cool whip, definitely no feta which I do not care for in my gyros.  I had to take off some point off for the cash only policy even though their prices are pretty reasonable ($5.50 for gyro only, $6.29 gyro, fries, drink).  Also the lack of menu items is a lil disappointing, would love to see some spit roasted pork or chicken souvlaki like they have in Greece or some homemade moussaka.    But if your a Gyro Junky like myself you have to give this place a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lXAeXkDvniYjX5qXdKLqBg"
  },
  "WfX10qkAKFBz0tA1OP-dWQ": {
    "date": "1/24/2013",
    "text": "Update:  too many times we have come in here, and the owner of this business is extremely rude  his employees horribly in front of customers. I just don't want to continue patronizing this man's business, and while the Gyros are good if you go in there you'll see what I mean",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "PD3X7S70zXHeOx1NjeicjQ"
  },
  "I2SlZ3Xo9NOfIg8eot3V2A": {
    "date": "11/10/2015",
    "text": "Pretty solid gyros. I like how they give you big thick chunks of meat instead thin slices. The best part though is their baklava. I love baklava but some places make it too dry, not here. It was really rich, sweet, and tasty. I would go back just for it. If you're looking for a quick bite to eat this is a good stop.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nc_bxB1yUdBvdfj1R3F0GQ"
  },
  "lxo7vH0nQIAeuCvk4W-zLw": {
    "date": "11/28/2015",
    "text": "The gyro Special is a great deal ! Huge gyro fries And a tea for like $6 . The only place I go for gyros",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9f9gH-w2g_Hau7z0bEbLw"
  },
  "Fzs0hFZt9zy2mIlsr0HMNg": {
    "date": "3/1/2019",
    "text": "Its always hard to choose delivery if you've never been to a certain restaurant before but my dad and I wanted greekish food but didn't want to go anywhere for it so we ordered from this place nearby on UberEats. We were both pleasantly surprised!   My dad ordered the gyro special that comes with a gyro, fries and a drink. The gyro was packed with meat and they gave a generous portion of fries. He usually judges food pretty harshly, but he said it was excellent!  I ordered the chargrilled chicken platter that comes with 2 sides- I got a Greek salad and rice pilaf, it also comes with pita bread. I also ordered a side of grape leaves because I'm a sucker for them. The Greek salad was a nice size and the dressing was tasty. It had the perfect amount of toppings and their feta did not seem store bought which made it even more delicious. The grapes leaves are also homemade, you could tell by the way they were wrapped and how each were different sizes. They were so good! I'm used to eating them cold but theirs were hot and although I don't prefer them that way, I really enjoyed these. My meal was super filling- I couldn't eat it all but the chicken was cooked perfectly and it was tasty, too. The rice pilaf was a little over cooked but it was still good. And the pita was soft and grilled a little.   Their prices are super affordable, as well. Our meal would've been less if we picked it up but oh well LOL! If you live in the South Hills check this place out! I will definitely order from here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vRHUVyLn6uzShnF8uG4Qcg"
  },
  "ARiPilic5zI_doz2tLaHqA": {
    "date": "8/27/2019",
    "text": "Great gyros. Limited dining area. Great for take out.  Friendly staff. Chicken gyros are great too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vgx-TZLq55PZnEumT-NOXA"
  },
  "NYxmVmrZyiAssiaTqSK0vA": {
    "date": "7/21/2019",
    "text": "Today was my first time eating here and it was so good! Great prices, big portions, excellent service, and amazing food!!! Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RnebVHOYs-hgFM1XArWGTA"
  },
  "WVA-WSQOJbrjrR-j9auJUw": {
    "date": "3/31/2019",
    "text": "Tried the gyro special and baklava delivered by Grubhub tonight. For the first time. The gyro is great. Huge portion- cannot finish all. I checked the reviews after I had the meal. They are right. Everything is perfect except the fries are a little soggy. Baklava is a bit too sweet for me but it's great with a cup of home made espresso. Will try other gyros next time",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t_Yi20dVMlziE6pqDHryDQ"
  },
  "hVZI47asu_JI8CqMTB7Z6w": {
    "date": "8/19/2018",
    "text": "Best gyro in Allegheny county.  Gyro boasts a generous portion on lamb and hand cut fries are always crips and hot.  Don't leave without getting a piece of baklava or you'll be sorry.  If I had to give a piece I'd advise I would recommend heartier napkins,  seems like I go through a dozen of them",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rwOinqdTUGYHr4kYec_tSg"
  },
  "G6NavB_QmvI_MA83mHTO-Q": {
    "date": "6/12/2018",
    "text": "Have driven past this place many times. Decided to stop. OMG you get a gyro, drink and fry for $7.47. No need to get extra meat, they load it up. Food is made fresh and hot. They also have other Greek items to choose from. Will be coming here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kZY7ETNq_UeWnQ0moEJTkw",
        "caption": "Photo of The Original Gyro - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kZY7ETNq_UeWnQ0moEJTkw/o.jpg"
      },
      {
        "img_id": "93s88qlA_GUu8PQPt8ebGA",
        "caption": "Photo of The Original Gyro - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/93s88qlA_GUu8PQPt8ebGA/o.jpg"
      }
    ],
    "user_id": "AYarmqNQXDpUdZIL-jSXtw"
  },
  "0ukY9fze4b2gmHnUJaFFvg": {
    "date": "1/18/2019",
    "text": "The Original Gyro has been a Castle Shannon location for many years founded by a Greek gentleman Sammy who originally brought the gyro to the Pittsburgh area, hence the name. The place inside is nothing spectacular but the food is incredible! The special is my go to the gyro is awesome but the fries that go along with them are fresh cut and are equally delicious especially if you add \"fry dust\" for a drink you can choose from different pops and Schneider Dairy teas. I really don't have anything bad to say about the Original Gyro other than expect to wait between phone take out orders, Grubhub and Uber Eats, and dine in orders the place gets busy and the two girls in there kill it but there is only so much they can do. If you like gyros you have to go get the Original!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8YJAxMtCrpO0eIqajHV47Q"
  },
  "eZ7Vgs4BLYx-ln3q858NDg": {
    "date": "2/9/2019",
    "text": "Living in Pittsburgh I was only familiar w one gyro place (we all know the one.) Decided to try this place bc I always see their sign that reads \"GYRO\" in big red letters and figured they must be good at it!   Staff was very friendly and so were the other ppl in there. I bought the gyro special (gyro,fries,pop) it came out to $8.50. The gyro was massive and tastes fresh, HUGE points. Fresh cut fries were alright, nothing spectacular. But what really made this all come together was the fact they had ice cold Cherikee Red.   Will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b-ggh0ZoTdUYy19LPS8GXA"
  },
  "NPP2MTp2j7atHyRvLWXavg": {
    "date": "4/7/2018",
    "text": "Really great place to stop and get a quick and delicious gyro meal. Everything is always very fresh when I come here and made per order.  They have a meal deal that is a great price which includes the gyro, fries, and a canned soda. Can't beat it! I personally usually get the gyro salad. It's packed full of gyro meat, fresh olives, feta cheese, and other toppings. The regular gyro is always packed full and can be customized for your liking.  Service is fast and friendly! It's never a bad choice to stop here if your in the mood for a gyro or Greek food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "pp6XLZoL30k6bhSS8JTl0g"
  },
  "qHWwKoE7-76Qu4seE5S3yw": {
    "date": "10/15/2016",
    "text": "Always fast service and reasonable prices. I usually either get the gyro special which comes with fries and a drink or a gyro salad. The portions are huge I just wish their fries were cooked more.   I'm so glad they take cards now. Although it never stopped me from going before.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UcbfvskRZ35K_385B1vVUw",
        "caption": "Photo of The Original Gyro - Pittsburgh, PA, United States. Chicken salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UcbfvskRZ35K_385B1vVUw/o.jpg"
      },
      {
        "img_id": "Jyy5FksY9gAjUwKPcFfBBA",
        "caption": "Photo of The Original Gyro - Pittsburgh, PA, United States. Gyro salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Jyy5FksY9gAjUwKPcFfBBA/o.jpg"
      }
    ],
    "user_id": "WgEKUJoh5msZlOlTCKnKtg"
  },
  "FjdcpO24fZe8pVe7YNPb6A": {
    "date": "12/18/2018",
    "text": "A small, mostly takeout location. The food is quite good, with excellent prices and large portions. I particularly like the chicken gyro and charbroiled chicken dinner with rice pilaf and a Greek salad. Which for 12 dollars, it's a hard value to beat. I'd say my least favorite part is the rice. Which is ok, but it seems to be pre-cooked and microwaved when ordered, probably for the sake of speed. The salad is great. They have an amazing Greek dressing. And the feta and olives are quite good. Try them out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ewjafrcTBkercR1az1Sjg"
  },
  "hQ_5hcj3syKLuHkCt8VwVg": {
    "date": "12/14/2018",
    "text": "Hands Down BEST GYROS EVER!! Meat is seasoned ABSOLUTELY PERFECT! Best prices around. Only downfall is no delivery. But that's what Door dash is for.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yK0UQFXD_6jXFdflT9fEXQ"
  },
  "7NqwqZBI3emRKYs0XSxhOg": {
    "date": "2/1/2018",
    "text": "This small gyro store is a great asset in the neighborhood for a quick, filling and delicious meal at a very reasonable price.   They have a number of different combo specials that include a gyro sandwich, fries and a drink. The regular gyro combo is $7.47, which comes to $7.99 with tax. The drinks are not fountain style but instead you pick a can or bottle from a fridge. They have sodas, iced teas and bottled water.   I got the regular gyro and it was a big serving and very tasty. The fries are home made and fresh. This was a great value.   They have some dinner platters also at good prices and some Greek specialty items behind the counter. I'd definitely come here again.   Although there's a few tables inside where you can eat if you like, this is more of a take out place. Service was very quick and friendly. A nice place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dz8CFWEWuR_4S1zlZhWCMQ"
  },
  "0sJXPp7SUM25qJRF8XHRFQ": {
    "date": "8/24/2017",
    "text": "A good gyro, but not great.  Definitely not on the level of Mike & Tony's, Sparta, or Knossos.    The meat was ok, but did not have a lot of flavor and seemed to be dry and overcooked.  The tzatziki sauce was a little too thick, but had a good taste to it.  In terms of the amount of meat you get, it is very little compared to their places.  Also, the fries needed salted and were not very good for being fresh cut.  The people inside are always very nice and friendly.  Service is usually pretty quick as well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "XTozbEAm2uk3m3drjLDcTA": {
    "date": "11/9/2018",
    "text": "My goodness, I just ate the Mount Olympus of all gyros! This place was awesome! I hope they franchise in my region.  I was greeted at the counter by friendly young lady who told me about the Gyro special. For around $7.94 you receive a hefty Gyro, fresh cut fries, and your choice of drinks. I chose at Turner's iced tea from the nearby quarter. When my my lunch arrive, I was pleasantly surprised to see that it was chock-full of delicious, soft, tasty lamb meat, a firm but not too chewy pita, healthy looking lettuce, pieces of tomato, and sauce. It should be noted that they followed my explicit instruction that The sauce not be drenched all over the Gyro. The amount was tasteful and perfect. I treated myself to a piece of baklava for dessert. Excellent. I highly recommend this place for a quick lunch. The ambience in the core might be lacking, as animal planet was playing loudly on the flat screen TV, but for a quick lunch it can't be beat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P5sEbOWdW3dGEC-sDnAXyQ"
  },
  "8sHajImRIFk5eFbOXOup0A": {
    "date": "10/1/2016",
    "text": "I'm a fan! Very quick service, delicious gyros, and reasonable prices. I definitely see myself coming here often now that I live only a few minutes away.   The menu is quite typical for a Greek food restaurant. We ordered two gyros and an order of fries. The gyro tasted very fresh and I feel the meat wasn't overly salty. The fries were fresh cut and were delicious. My only complaint was they didn't give us very much! Oh well, that's better for my waistline anyway.   I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "JzXYbFZab43YbzgZfm4yOA": {
    "date": "12/6/2018",
    "text": "Used to live closer in Mt. Lebo - so it's been a while.   Used DoorDash tonight and they delivered out to USC.  I honestly forgot how good this place was. We had a few regular and chicken gyros, some rice pilaf, a few grape leaves....all perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h-dRKxpiYIlZ-MhJs71Rag"
  },
  "FO5X-tz5E2B-mFchNZfqiQ": {
    "date": "1/5/2019",
    "text": "Great food, prices, and service. Portions are huge and its as good of gyro meat as I've ever had.  I get takeout from them twice a month at least.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E_1ky3CFVleBKPZvOTHVYg"
  },
  "dxDQt-PPTP0NUkfAs21cHg": {
    "date": "8/4/2016",
    "text": "They now have a better menu with specials and coupons, and option to pay by credit card before was cash only.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4JbAZA0m_LZSiWeX4LuGIw",
        "caption": "Photo of The Original Gyro - Pittsburgh, PA, United States. Lamb gyro",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4JbAZA0m_LZSiWeX4LuGIw/o.jpg"
      },
      {
        "img_id": "xoJineSan0feWB2vw_KB0A",
        "caption": "Photo of The Original Gyro - Pittsburgh, PA, United States. Like their mozzarella sticks",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xoJineSan0feWB2vw_KB0A/o.jpg"
      },
      {
        "img_id": "LJnByPicY-X9hhIIfm8xeA",
        "caption": "Photo of The Original Gyro - Pittsburgh, PA, United States. Steak gyro, yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LJnByPicY-X9hhIIfm8xeA/o.jpg"
      }
    ],
    "user_id": "QuLMz9jLUPTCM4OX9VBIHg"
  },
  "IoJXillNZwhM_jmArCoNNA": {
    "date": "11/11/2018",
    "text": "This is the perfect gyro lunch spot. Everything I have tried is good. For the gyro special you get a gyro, fresh cut fries, and a can of soda or carton of Turner's tea for $7-$8. Can't beat it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BIBmidn3fhRzLvYMZLshEA"
  }
}