{
  "2YjokValTvejH8W2hsGwog": {
    "date": "8/11/2014",
    "text": "Best Italian restaurant by far!! I've been here hundreds of times and tried atleast half of the menu lol!  Pizza is awesome, steak hoagie fully loaded is probably my favorite and haven't had one thing that I didn't like.. Its a great family restaurant and you always leave full and happy and thinking what else can you try next time you visit!  I HIGHLY RECOMMEND PASQUALINOS TO EVERYONE THAT LIKES TO EAT :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lo5lv3UyIALGTUjh_X3row"
  },
  "GiD0sPc9R5UywtQxiwZUIg": {
    "date": "12/9/2011",
    "text": "Not sure how this establishment was rated a 5 star....really? Hubby and I wanted Italian food without having to drive all over Pittsburgh so we Yelp'd and found a five star Italian restaurant just up the road a bit.    No hostess waiting at a podium here. Just a togo counter where we were instructed to grab a menu and seat ourselves. The only available two tops were located in the middle of the traffic aisles, meaning patrons and wait staff walking on both sides.   None of this mattered to us, however, because the ratings of four and five stars that we read were based on how delicious the whole menu is. And we LOvE Italian food!  I ordered the chicken parm which came in two sizes, as do other menu items.  Hubby ordered spaghetti and meatballs.  We thought these dishes would be accompanied with hot, freshly toasted garlic bread but came with a large cold bun. But just a few minutes earlier, the table next to us had what looked like some sort of bread, toasted and wrapped in foil.  So assuming it was toasted garlic bread, we asked our server if we can have garlic toast instead of the bun. Oh, no, says our server...we always serve the buns.  The pasta and sauce were adequate but not as amazing as what the others rated.  Definitely not a four or five star, but adequate.  Therefore, my rating is 3 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RGTBZ8ybMsbV-WKvI1MX5w",
        "caption": "Photo of Pasqualino's Pizza &amp; Pasta - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RGTBZ8ybMsbV-WKvI1MX5w/o.jpg"
      }
    ],
    "user_id": "_Eu_9lumAGZ1HHf3OP3hag"
  },
  "A5iCFJredguSOwKGpu593A": {
    "date": "10/22/2011",
    "text": "YOU MUST TRY EVERYTHING BECAUSE EVERYTHING IS SO GOOD!!!! Employees are very nice, family owned, cleaned and food usually is ready fast... small dining area inside, they do have delivery or take out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "joCcHNyvjrwEg_6KX6MMPg"
  },
  "wMa7wcueYnbgsZLG0aPY1A": {
    "date": "6/27/2013",
    "text": "I went here as a kid when it was pizza palace...still same place but name changed...took my husband and kids here a few months back, now its our favorite place..i daughter is always asking for it...square cuts that are light and airy lots of cheese and pep is are fav. this is a must try. byow if you like..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cNanOhIQ-7qcwnwv7Ij2mg"
  },
  "a3gB07fxYP9h_VdZDovfww": {
    "date": "1/6/2012",
    "text": "Great place for an unpretentious, tasty Italian meal.  Great for takeout too.  Incredibly busy, and short wait times.  BTW they DO accept credit cards (MC, VISA, AmEx).  A great unsung place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ALwGPgaD29rP6WBvWvT3tg"
  },
  "0CEpZpN5NbzVCt0NXDFdRQ": {
    "date": "3/27/2013",
    "text": "Honestly some of the best food in the city, if not the country...!  Anything you order will be Delicious..!, I know you hear this a lot from people but I'm here to tell you this is 100% Legit best place hands down. If you lived in Penn Hills or surrounding area and don't eat here at least once a week you are missing out my friends. I'm going tonight actually and if I was thin I'd eat here 7 days a week. Any other pizza place pales in comparison, it's like a car dealer telling you to choose between a Ferrari and a Yugo...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3wQ-mQPVQ0F4J99XPxJIVA"
  },
  "_qvOIpgNsV3wqPMG3YZrbA": {
    "date": "8/24/2013",
    "text": "Ordered a pizza for take-out, sounded promising after seeing the 5 star reviews. The restaurant is small and seems like it's a mostly take-out place. Disappointed in the pizza, they use pre-baked crusts and top it with a very bland sauce.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QtqWMef3-cmbZmCCZslPnA"
  },
  "dk6cK5AQ5_FmQzu7ivUlVw": {
    "date": "9/15/2013",
    "text": "Just tried this place for the first time. Nothing fancy inside but the food was fantastic! Our service was good. Over all a great dinner. We did notice their takeout service was phenomenal while we were there.... It was an endless line of people throughout our whole meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bM55XIkbT7g43fcuE8ebJw"
  },
  "s5uO2AZPibDHyq6Rt3T0eg": {
    "date": "10/19/2009",
    "text": "Delicious!! The only place to go for Italian food. Great to go with family or just any time at all!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C5_Fi_lHRpULx4oTPIeGPA"
  },
  "H7SoZORNgkpsMY6V4s-XEA": {
    "date": "2/17/2017",
    "text": "Again with the unforeseen circumstance hahah  I have probably been here about 4 times since my last review where I stated I wasn't going back. And I have waited to update this review as I wanted to see how service would be on a Friday/weekend atmosphere   They have redeemed themselves. Went in on a Friday night it was busy as per usual frank was behind the counter and there were people waiting for food and service. The employees were friendly. My food was ready at the time they said it would be and everything went smoothly.  Food tastes excellent literally updating my review stuffing meatballs in my mouth!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7lV1AD01lZ7N1svp7U_pnw"
  },
  "umGWhP94JD44JLMmLWnqgA": {
    "date": "1/4/2017",
    "text": "Pasqualino's aka Pizza Palace has the best food.  Their meatballs are to die for.  Their rolls are so good warmed with butter. The hoagies are delicious!  There hasn't been a good served from their that I haven't liked!  They are great for catering as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xgatqFuuVNBKV7CflPJnuA"
  },
  "9He9Pg07N_wklJyi9VZSmA": {
    "date": "9/18/2016",
    "text": "Good lasagna, I ordered it often, but I believe it's no longer on the menu. I've also ordered a chicken parm sandwich for my family, they loved it. I've not tried anything else. The dinning area is inviting, nice staff, clean space.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lUWOUW3gI7Hp75vZJbA_uA"
  },
  "zB77Lcv0brdpFpK0EUASPQ": {
    "date": "1/24/2016",
    "text": "The food here is delicious! We drive about 15 minutes to get a large pizza and hot stuffed peppers all the time! The sauce and crust are fabulous. I haven't had a pizza like it.  They serve the best chicken tortellini soup Wednesdays and Saturdays. The broth is flavorful and light.  The large homemade rolls go great with the soup.  The prices for the quality of food is amazing. They do get busy, so make sure you account for extra time when placing an order.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HTKyL2FUAnwGmKvK2a_jyg"
  },
  "i6Wz7xc88laTwh8Zmz6BjA": {
    "date": "7/8/2016",
    "text": "Awesome food...staff works hard...owner Frank is a great guy...never have a bad visit here whether eating in or take out...I've been coming here (or around the corner) for 40 years...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AXxm-lhMV46XX9A714aoFw"
  },
  "Q145GTyx8lgUNj1PPOihfA": {
    "date": "1/20/2015",
    "text": "Pizza is SO delicious. We typically get size large (square), which is a generous portion of pizza. It is definitely enough to feed a family, or enough to feed two people for a few meals. I really like their cheese blend, which I believe consists of at least some portion of provolone cheese. I haven't tried anything else besides the pizza, so I can't comment on that.  I took off one star for service. We've only ever picked up pizza there, and sometimes it takes 10 minutes or so just to get someone's attention so we can pick-up and pay for our order. It's frustrating to wait there to pay, while you can actually SEE your pizza getting cold in the background. Either way, it's worth it because the pizza is just so good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l2S62fnyODeQWChxhIsEjQ"
  },
  "OkH74t1sDt5KAC5rl452-A": {
    "date": "10/19/2016",
    "text": "Even though I live in the South Hills, I traveled to Penn Hills to pick up their stuffed shells to feed 11 hungry women at my home. They were delicious and everyone raved about them.   I would recommend this place to anyone. They never disappoint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yBRlxIkgwkVsvAU8P_BXLA"
  },
  "erBJvOKBNBGnux4spvuYgw": {
    "date": "4/12/2017",
    "text": "Hidden gem in Penn Hills. My family and friends have been coming here for years. It's a small family owned pizza shop, turned restaurant. Our favorites are the stuffed shells and meatballs. We stop by any time we are in town. We also love their Italian hoagies and pizza. We've also attended catered events that have been held in their party room. Always an amazing spread. Great food, great service. It's a staple in Penn Hills.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Hb5YHSAYjVqjnsRFwDyVw"
  },
  "wBIgYJz81Kle_3csJQrg5Q": {
    "date": "10/16/2015",
    "text": "Hadn't been in for maybe 10 years. Had a Turners and a half a Las Vegas and in was all I hoped it could be as compared to memory. Can't wait to go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fg5iiFQXm3ttDpkpm2X7YA"
  },
  "U0T70JUe9dhRnXKRe8su1A": {
    "date": "5/2/2015",
    "text": "If you can handle the poor, slooooow, and mostly rude service, their pizza, meatballs, and stuffed shells are divine! We love the sauce: you can buy jars for around $6. I'd recommended take out to avoid the wait!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7wiPP9fIoPTGa8p9dsicjQ"
  },
  "hhCMBhakscZ_ywCC2xv3AA": {
    "date": "12/13/2016",
    "text": "Really good food and great prices. The dining area is a bit small which wasn't an issue when my family ate there because there were only a few people in there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nQ4zx-d3wgv1x3A5RoZHyQ"
  },
  "MtwF5MCfQo_dacwIC2o9Ng": {
    "date": "11/15/2015",
    "text": "It used to be great...anymore not good at all....they raised all the prices...and jar of there sauce is like 7.00 what a joke",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i4fopNSGqjX7qDUk2EGM5w"
  },
  "YjEjTN2ukjGcHV4tlVbkUg": {
    "date": "7/24/2015",
    "text": "I got the cheese ravioli and subbed meat sauce for the tomato sauce. It is fantastic! The meat sauce is so authentic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eF9xonZnu2jbsR0O8ZOs9g"
  },
  "jNlTDPx5_KLuyuN3cNWQKg": {
    "date": "3/30/2016",
    "text": "Although the pizza is good, the service is horrible! Over an hour after placing my order over the phone and it was still not ready when the quoted time was 25 minutes.. The individual who took my order hung up on me and everyone inside was rude as well!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E2Hd91VOUSNGYSN3v1iWFA"
  },
  "NZp-3oafE06OWZ7BHS7l5g": {
    "date": "6/23/2015",
    "text": "Best pizza in town! Greg and his crew pay close attention to detail to ensure every meal is up to our standards.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "51iTJhqXHw12BZKwJtGMuQ"
  },
  "3bjmlLlMe6gJcL-7Oj2Pzg": {
    "date": "11/27/2011",
    "text": "I'm a Penn Hills native, and Pasqualino's is a must when considering take-out.   Everything on their menu is delicious.  Their pasta sauce is slightly sweet and is great on the stuffed shells (my favorite!), spaghetti and meatballs, and lasagna.   Their pizzas are sicilian (thick cut, square). My family loves their pizza. Frankly, sicilian isn't my pizza preferance. I always order one of the pasta or salad entrees, both of which come with freshly-made rolls and butter.  Staff is friendly, and if you go there enough, they WILL learn your name and food preferences.   Overall, food is cheap and high-quality.   One tiny drawback. They do not deliver. But I do not think that warrants a docked star.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "tu5AwWOh6QlSvpi5CXalQg"
  },
  "etQrvNzpBd6cZ2tDe7Zopw": {
    "date": "8/31/2014",
    "text": "Delicious food! Wouldn't change a thing. Have had just about everything on the menu and have never been disappointed. Fantastic lasagna! My husband loves the Crab Cake Medusa! Regular and super thick pizzas are awesome! I think the type of cheese is what really makes it! Best white pizza also! I could go on all day, I'm making myself hungry just writing this.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "N1K30OWvcseB7Axv9iLHSQ"
  },
  "YZXC15hPQEBmRluliHWdaQ": {
    "date": "12/2/2013",
    "text": "We were traveling with our three children and this restaurant was the perfect stop. The food was great, fresh bread, homemade cookies, cheese, pasta, pizza. Crayons and Friendly service too. Great Christmas music and decorations.  Perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4l1apPCaUokRfQO9dMElDg"
  },
  "N5qjlUGYaVJ1QPM582gVeA": {
    "date": "10/3/2014",
    "text": "The very best for Italian food. I have never received a bad meal here. The service is a bit slow but when the food is this good, it's worth the wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CF9xMT2QOltGajeIFY8FsQ"
  },
  "U4Gz0hxVjPC9x3uP8d3-mg": {
    "date": "5/30/2013",
    "text": "A rare 5 star for me....pizza is old school great, the sauce is great, the pasta dishes are awesome.  It is family style dining - no bar or alcohol on site.  The are only a few pizza places I drive out of my way for...this is one of them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JEfQk9SVGmPGSjNlBkyJaQ"
  },
  "g6GRqt-GQm6KfoNv50oVhg": {
    "date": "8/13/2019",
    "text": "Went in with low expectations, but left very happy.  The prices are fair.  The place is very clean.  Good quality dishes, and tables, and paper straws.  Friendly staff.  Acoustically it was very good, like they had music playing but still easy to hear the people you're there with.  They must have recently remodeled because the floors and tables look different than some of the other people's photos.  If I'm back in the area and looking for a place to eat, i'd definitely go back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o7IlyNAZEDZnlinUY8neqw",
        "caption": "Photo of Pasqualino's Pizza &amp; Pasta - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o7IlyNAZEDZnlinUY8neqw/o.jpg"
      },
      {
        "img_id": "ST9muJxzAdmVF6mWpHfmUg",
        "caption": "Photo of Pasqualino's Pizza &amp; Pasta - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ST9muJxzAdmVF6mWpHfmUg/o.jpg"
      },
      {
        "img_id": "boJyWkenfmYzBjSFffHh2Q",
        "caption": "Photo of Pasqualino's Pizza &amp; Pasta - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/boJyWkenfmYzBjSFffHh2Q/o.jpg"
      }
    ],
    "user_id": "FE-9sqz_sg-XEx19vsLxaQ"
  },
  "HYjHORxlQfpQuhDoeE_dOA": {
    "date": "7/12/2019",
    "text": "Stopped here for lunch on a whim. The staff was pleasant, attentive, and the food came out pretty quick. Of course, I forgot to take pictures of the food. However, I will say this... The half size of the hoagie was plenty big enough for a lunch portion and the small size spaghetti was plenty as well. The hoagie and stuffed shells were great. The spaghetti was just okay but mostly because it didn't have enough flavor. It was just bland. Which is interesting because the stuffed shells had plenty of flavor.   Overall, it was a good place to have a little lunch but nothing is making me want to go there again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i9rH5-NuYFnZhTMAqHCRQg"
  },
  "iZZlD66Uc99CVqsh6hTWeg": {
    "date": "6/30/2019",
    "text": "We moved to the Penn Hills area over 20 years ago . Pasqualino's Have never failed us !! We've basically tried the entire menu with delicious delight! We tried the yinziano pizza for the first time today, and once again YUMMMMM!! Our go to Are the StuffedShells with Cheese and meatballs on the side , I've NEVER had any nearly as good !!!!!  Thanks for providing delicious housemade food , every time!  Ruth & Chuck",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8hxd74tM9msccr0BSaL09g"
  },
  "nMPYmutdOjNcy3sf5Mvdpg": {
    "date": "4/24/2019",
    "text": "YES - love this hidden gem in Penn Hills.  If you're looking for home cooked Italian, this is the place to come.  I've been here 3 times now with a friend who has been coming for years.  His fav is the stuffed shells, I've had them and they are good.  I prefer them the next day, I think they taste way better.  Everything I've had here is good - I'd recommend starting off with the fried zucchini bites.  I believe they are tossed in panko, so they have an extra crunchy taste to them which is delightful.  Don't forget to grab some of their homemade cookies on your way out and a jar of their homemade sauce!  Wait staff is nice, attentive, always pleasant and friendly.  We've gotten take out from here as well, and the food quality is the same as if it was served right to the table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rfy598B1ElBFv8uH4cVLJg"
  },
  "2oKlyGJsu-RMtIYeNLq__w": {
    "date": "1/22/2019",
    "text": "Decent meal!   Like home cooked italian food. All simple and tasty. A lot of food in the menu to order next time! Will def eat again! Restrooms are so clean and it smells good!  i def recommend the tiramisu itssss superrrrr good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wg7YI6rbr5f_6nW8dnVGvA"
  },
  "4KClgM1BJaGKDq6axnblsw": {
    "date": "9/9/2017",
    "text": "Another good Italian restaurant in the Penn Hills area.   We have driven by this place more times than I can count, but decided to try it out as the Verona village inn was packed.  We ordered takeout A sandwich and a small pizza.   The pizza crust I was not a big fan of but I did appreciate that they had fresh green peppers and fresh mushrooms on the pizza.   Since it was our first time here the waitress who took our take-out order really went above and beyond which is what makes this a four star review. She gave us a sample of their homemade chocolate chip cookies which were divine and a sample of their homemade pasta sauce also amazing!  My husband sandwich was okay.  They do not use shredded lettuce and just use pieces of lettuce which when mixed with mayo and Italian dressing on a hot sub tends to get a little soggy.  All in all we will give it another shot and try different things.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "CE9dP0R3a830RClaeWCvZA",
        "caption": "Photo of Pasqualino's Pizza &amp; Pasta - Pittsburgh, PA, United States. Drinks to go and desserts to die for pre portioned to go",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CE9dP0R3a830RClaeWCvZA/o.jpg"
      },
      {
        "img_id": "dkf5BKthITsFjIe71OdNlw",
        "caption": "Photo of Pasqualino's Pizza &amp; Pasta - Pittsburgh, PA, United States. Menu side 3",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dkf5BKthITsFjIe71OdNlw/o.jpg"
      },
      {
        "img_id": "UrIbRn_KOg6iZzG1VN6Tbw",
        "caption": "Photo of Pasqualino's Pizza &amp; Pasta - Pittsburgh, PA, United States. Menu side 2",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UrIbRn_KOg6iZzG1VN6Tbw/o.jpg"
      }
    ],
    "user_id": "exlziNg-2I1-7JZcYPgWJg"
  },
  "82VA4nYfJHOHw-DnaPUaqg": {
    "date": "5/8/2019",
    "text": "A hometown favorite. Amazing dishes, great hoagies and pizza. Staff is always very friendly and I've never had anything on the menu that was not excellent. Hidden Penn Hills gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kyqZOq9cc-RzOVto0hNEIQ"
  },
  "aDXJMFq0kzZr3RqyuXvgSw": {
    "date": "1/30/2019",
    "text": "While traveling we used yelp to find this beauty! What an awesome spot for some authentic Italian on a cold night. We were able to interact with all of the employees who were friendly and welcoming. When we arrived, a local policeman was finishing up and recommend the pizza and stuffed shells. We of course went with his suggestion and a salad too. We were able to chat with the owner of over 40 years. What a delight all around!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "L1PwyKgN-Cm6dbho0HKFSQ"
  },
  "FYnZjlwO7Go7BKUgUshChg": {
    "date": "4/10/2018",
    "text": "The word my wife and I kept using during our dinner was \"solid\". It was a solid Italian meal. Nothing fancy just, just good home-style Italian comfort food. I got the small serving pasta and meatball. My wife got the stuffed shells. Serving size wasn't too big. It was just right. Our only disappointment was that they were out of the chocolate chip cookies.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B_GMOc3Bi6sw4ATZKnlK5g"
  },
  "fLhOPJtS1-u2gUQBiaVqwA": {
    "date": "2/1/2019",
    "text": "Delicious authentic food. One of the best restaurants in town. The food is so good. You can tell they make it fresh when you order. They also have delicious desserts and it's great for take out. Restaurant is clean!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5IEde7XZAp5hbV_WifaTaQ"
  },
  "foauNk8zwft1zN0Mo2EEEw": {
    "date": "1/15/2019",
    "text": "Love this place! The service isn't always 5 stars but the food makes up for it. Their sauce has good flavor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eppm8VsHlzeBlEgwTUx75A"
  },
  "6_veKX3S8yeQZO_UD7iiFQ": {
    "date": "5/1/2016",
    "text": "Pizza is as good as it gets. Delicious crust. Dynamite sauce. Generous toppings.   Zucchini strips also excellent.   I'm not a big fan of their pasta, but I'm pretty picky about pasta. Their pasta is also not the point of this review. The point of this review is that their pizza is nails - go get yinz some.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "rEFkpmgrgwjaQ6XDeYaVTw"
  },
  "d1ED1qOAOisXZaE3UK4FbA": {
    "date": "5/18/2017",
    "text": "Tried and True Penn Hills staple. I've been going here since my childhood and could probably count on one hand the amount of bad meals I've had. Everything is good from pizza to pasta to hoagies to salads. Some of the best stuffed hot peppers around. Stuffed shells or ravioli are must try's. If i'm in the mood for a hoagie, the Italian is very good as well as the meatball hoagie or the Las Vegas. As a kicker to a great entree, the rolls are the best! Friendly staff, starting with old man Frank usually behind the counter like he's been for 30+ years. Love it here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PRR_QZhRCkxa-hb-fmnA9Q"
  },
  "4dbempkWoESx3Pe8Fo7XeQ": {
    "date": "6/12/2017",
    "text": "We were staying at a hotel pretty close to here, and I was searching for somewhere that wasn't a fast food joint.  And not a chain restaurant.  I came across Pasqualino's Pizza and was looking at the menu.  I immediately knew this is where I wanted to go.  We got there and I was SO HAPPY I chose here.  We had their cheese sticks for an app.  They were very good.  For our main dishes we had the stuffed shells with meatballs and the chicken parmigiana.    The stuffed shells were to die for.  You can tell they are homemade by their flavor.  You could actually taste the different cheeses they use.  And the sauce is very good also.  It's not chunky, and not a lot of spices.  Which I like.  The chicken parm looked very good also.  I did not try it, but the person who had it said it was very good also.  Just a light breading on the chicken and it sat on a bed of rigatoni.  It had the same sauce they used on my shells.    It was so cheap in my eyes too!  If I'm ever back in this area I will definitely make sure to stop there again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "L02MiSHs61NS92bJYQNyQw"
  },
  "moJs5W-zvD4jAKPSC5iSjw": {
    "date": "9/14/2018",
    "text": "I went to  Pasqualino's about a month ago. I ordered the pasta with eggplant. When it arrived I thought I got the wrong meal. There were these little black slivers on top this pasta. Apparently that was the egg plant. When you ate it it was tough and did not taste like eggplant.   I thought the sauce was bland and it just barely covered the pasta. I didn't complain because I was there with a date and I just wanted to leave. I've been there a few times had pretty good pizza and just average Italian hoagies. Much better Italian hoagie up at the Frankstown Wood Fired grill just up the road.   Maybe they become so popular that they've lost their attention to detail on what exactly they're serving.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D4bhj8aOk5WkTrqpBfywSg"
  },
  "ODjFShCuo66ypcV7gmHnTw": {
    "date": "8/13/2017",
    "text": "This is one of our favorite places to get Italian food. We usually get takeout and they give you amazing rolls and tiny containers of parmesan cheese which is a really nice touch. The pizza and pasta dishes are all great. My favorite would definitely be the stuffed shells and meatballs. You can tell they're home made and I don't think I'll ever get tired of them. The sauce is so good I pour the leftover into a container and use it on something else later.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QHVqW4RhsG6LNLn7v12nJQ"
  },
  "ZTiLuIRqU28XEcnr010mnA": {
    "date": "8/14/2014",
    "text": "Absolutely the best little Italian spot in penn hills hands down. There is no competition for miles. The prices can't be beat along with the hospitality.  I enjoy the crab cake medusa which has an Alfredo based sauce with a delicious crab cake on top of linguine noodles...  The meat is so soft and tender that it leaves you begging for more. I've been here twice in the last week and would love to dine here every day.  We ordered the lasagna which was amazing..the meat is so soft and their red sauce works with every dish..the flavor is by far very exciting.   I'm wrinting this as I eat.,I just had a bite of the gnocchi and man are you missing out if you've never eaten here...please try this place it is amazing!!!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "8OfD1NBIP7Rd53tMmLp29g",
        "caption": "Photo of Pasqualino's Pizza &amp; Pasta - Pittsburgh, PA, United States. Party room",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8OfD1NBIP7Rd53tMmLp29g/o.jpg"
      },
      {
        "img_id": "79NFCvX86eFDWvHATaqg9w",
        "caption": "Photo of Pasqualino's Pizza &amp; Pasta - Pittsburgh, PA, United States. Back end",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/79NFCvX86eFDWvHATaqg9w/o.jpg"
      },
      {
        "img_id": "zuk9zy9iFRBtT_q4e7AK5A",
        "caption": "Photo of Pasqualino's Pizza &amp; Pasta - Pittsburgh, PA, United States. She&amp;#39;s likes it thissss much!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zuk9zy9iFRBtT_q4e7AK5A/o.jpg"
      }
    ],
    "user_id": "vInhYl7i3v9UsYkmcm_ZUA"
  },
  "Q7iU25_hIA53qtowdGYL4g": {
    "date": "6/28/2016",
    "text": "Love the place. Casual and laid back. Stuffed hot peppers were great, good sauce. Handmade pasta is really good as well. The meatballs are big and tasty. Everything looks amazing here. I love the big bun they give you with a dinner. It's worth the trip to give the place a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tpLWXsk3Uyx_qyxcN_tEA"
  },
  "0OrwCO4OGUWJcm9tk1p4zg": {
    "date": "11/4/2017",
    "text": "My family and I have been coming here since I was a kid - We've had several parties in their new(er) back room, we have them cater our family picnic every year and their take out is almost always the first thing my family and I think of when we don't feel like making dinner. I've never had a bad experience, everyone is always so nice and treats you like family. Mr. Pasqualino greets guests and oversees the general flow of the restaurant. I came today by myself (I was craving it hard and it was too short of notice to invite anyone) and the service/food was so good it made me realize that I never came on Yelp to review them - I got a cup of Tortellini soup, Side Salad and Spinach Stuffed Shells. The soup was hot and amazing, the salad was just big enough to not fill me up too much - My stuffed shells were clearly fresh and very hot, the roll that comes with my meal was warm and the butter was soft and easy to spread. I am so thankful that there is a cozy, hometown place like this to eat that never changes in quality. I can't say enough nice things about this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dqwStxu-gDfwB0GL5EWZUQ"
  },
  "UtNOw3VQM8X7MF9YZKAZjg": {
    "date": "9/15/2017",
    "text": "Yum, yum, yum! Love the Yinzano pizza and the chicken pesto sub is awesome! Everything from the cookies to the sauce is great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QIx0j3B1KTJmoDpYDJZ2Pw"
  }
}