{
  "r5d5B5eZ2C6twg3XQgp1Mg": {
    "date": "8/25/2015",
    "text": "I have already visited Nak Won Garden three times within two week after their reopening. I love the variety of authentic Korea dishes on their menu. I have had Tangsuyuk(Sweet and sour pork, the best one I've ever had in Pittsburgh), jjambbong(Korean-Chinese Spicy Noodle Soup, well it's actually a surprise order because I pointed at the wrong item on the menu but it turned out to be great! a lot of seafood and the portion is huge...), Galbi Dolsot Bibimbap(the meat is very tender and well-marinated) and my favorite samgyetang(Ginseng chicken soup). I've always been carving for samgyetang ever since Green Pepper stopped offering it ,therefore I'm so glad that it appears on Nak Won Garden's menu! It definitely won't disappoint you if you prefer the lighter side of Korean food like me. I would say this is the best Korean restaurant in Pittsburgh right now.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cDvwxpPB8pewyFhip59PlQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Back: Tangsuyuk(Sweet and sour pork); Front: jjambbong(Korean-Chinese Spicy Noodle Soup)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cDvwxpPB8pewyFhip59PlQ/o.jpg"
      },
      {
        "img_id": "cH10SiIoZqD3BhlE3VUtpg",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. samgyetang(Ginseng chicken soup)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cH10SiIoZqD3BhlE3VUtpg/o.jpg"
      }
    ],
    "user_id": "OJCb4OLll83wi6FaOYiK1g"
  },
  "GG4zWIQoeuSr6nqarK5EXg": {
    "date": "8/25/2016",
    "text": "Very expensive.  Small fish they charge $18. In Virginia you get two fish for $4 less.  Food is not that good. ..even Kimchi was not good.  It was disappointment all around. Hard to find good Korean restaurant in Pittsburgh for some reason but this one is worst one so far.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AMT39xVq1b2KS0PVaaon_w"
  },
  "Z-vG2FY920xGyZgMsum03A": {
    "date": "10/30/2016",
    "text": "Good quality meat and vegetables, food made with care, great service. I am excited to visit again and explore more of the menu!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wU6Vlp3pTuG8iC9oVRVrDw"
  },
  "VbRtIKySoj4UFoKzcNsUzg": {
    "date": "12/14/2014",
    "text": "They're a solid 3.5 but I'll tend down toward the 3 just because the dinner prices are pretty high--I've heard lunch is a good $5 cheaper so we'll have to head back to check it out.  When we walked in, we were the only completely non-Asian table, which seemed to be a good sign. We were promptly poured hot tea, and given water upon request (yeaaaah some habits die hard). We opted for a spicy pork belly dish (tasty, although not super spicy) and bibimbap. The bibimbap was very flavorful, and the housemade gochujang (occupying large ketchup-style bottles on the table) was really tasty--I was tempted to pour some out into my doggy bag! My biggest critique was that despite being served in the traditional iron pot, the bottom rice was not anything close to crunchy, which is one of my favorite parts of the dish. There was also not very much meat in this dish.  The banchan were good--we were pleasantly surprised to receive it without ordering a tableside cooked item. However, most, if not all, of the items were pickled--no steamed eggs, japchae, or jeon. I'm not sure if these offerings rotate or if this is all they ever have.  At any rate, we'll be back for lunch, and possibly with a group to try some of the tableside-cooked food...but I miss Flushing!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "Ri4xmSrehzGEqbR1EWAhAw"
  },
  "mWD_WA3_ojZGNOJ5Y_axKQ": {
    "date": "12/27/2016",
    "text": "I have gotten the ddeokbokki a couple times to go and it's always amazing but today I actually went in and had lunch with my friend and it was AMAZING! Service was great, friendly, and fun! The food was on point I could t stop smiling we will both be back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vp4iFYtODUNyFq8AcIAVdQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vp4iFYtODUNyFq8AcIAVdQ/o.jpg"
      }
    ],
    "user_id": "L0W4YU6mbRLwVub6B0jwMA"
  },
  "gc-4_wjKSP4nHhPgxZmobg": {
    "date": "12/11/2014",
    "text": "Previously there were only two well-known Korean restaurants in Shadyside/Oakland/SQ Hill neighborhood: the Korean Garden and the Green Pepper. This Nak Won Garden is a new Korean restaurant, and my Korean classmates thought that it was the most authentic one.  So me and my gf went to the restaurant tonight, and ordered the salted fish, bibimbap, and the stir-fried pork belly. I thought the food was pretty authentic because I've been to a couple of cities in Korea. Also it wasn't too sweet or Americanized. The server (a Korean lady) was pretty nice and helpful, even though her English wasn't great.  In general I give it a 5, because of the food, service, and the location (close to Giant Eagle). I think it's really nice that Pittsburgh, as a city in the Mid-West, is getting more and more authentic Asian food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "zBFJQVUXuzj7mXeILFo7ZQ"
  },
  "RBsgjxDloes1vAnouwuZSA": {
    "date": "5/21/2016",
    "text": "I came here after craving korean food for days and was not disappointed.  I ordered the korean barbecue, which involved a portable gas stove they bring table side. We got pork belly and thinly sliced brisket. Both were given in good portions. It also came with lettuce to make wraps, dipping sauces, and an assortment of side dishes (good but not excellent). Though we had the cooking covered, the server was nice enough to help us out with it. She was chatty, but not annoying, and very sweet. I asked if the bbq came with any soup or something and the server said she could give me a tofu soup, which I assumed would be soondooboo jjigae( soft tofu stew). It ended up being korean soybean paste soup, which was also good. However, I think if I hadn't asked we wouldn't have received this, because non koreans wouldn't expect that. So I recommend asking just in case, same goes for any korean restaurant. Steamed egg is also common on the side of k bbq.  Our dumpling appetizer was tasty and good in portion. It seemed homemade.  I also got a small order of the oh jing uh bokkeum, squid and veggie sautee.. which was good, but not great.  They don't sell alcohol, so you'll have to get your soju from a liquor store that is apparently above the walgreens down the road.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WasG6DfKATP8Ws-8MWkKtg"
  },
  "01oC8-OdzCqXpi8V5fxJVQ": {
    "date": "6/24/2017",
    "text": "The taste is alright, but the price is expensive than I thought. I'm from Philly, for the same price you could get much better quality food in a Korean restaurant there. But overall it's s nice place the server is nice",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x96AFFA6nQrlq3-mMTQZjQ"
  },
  "HxBd7H_i8s4sUqCeCCzKhQ": {
    "date": "6/29/2016",
    "text": "Fast lunch service and great food. Located close to the Hillman Cancer Center and the Courtyard. Loved the shrimp fried rice lunch special with soup and sides. Highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hd2l-jDrbLRbENeraI8zsw"
  },
  "9D18rIGOr_mwh2zxieKRbQ": {
    "date": "8/18/2016",
    "text": "It was my first visit to this place as I just arrived from California last night. WARNING: For those of you from LA, you may probably be shocked by the prices. The yellow croaker, which was small and fishy, was $13.99(the lunch special price). Tofu soup doesn't come with any of the dishes. It's $10.99 during lunch. They don't ask you what level of spicyness you want. They just give you whatever they made. It was actually really spicy in my terms since u used to always get mild. The seafood inside the soup seemed to have been frozen before and then defrosted. I also got the galbi dolsot bibimbap. I was expecting to have some beef ribs on the top of the bibimbap but I found out that there were only small pieces of meat placed on top. I was quite disappointed... I don't think the stone pot was hot enough as the egg didn't cook well and made the rice seem squishy and a tiny bit watery. For the yellow croaker, tofu soup and bibimbap, it cost approximately $50 with tax... I probably wouldn't come back again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_qufjIJoNBJNE0SDBIgNhw",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Galbi bibimbap, yellow croaker",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_qufjIJoNBJNE0SDBIgNhw/o.jpg"
      }
    ],
    "user_id": "AAtIcTb2kRy-6Gn1QzK5mw"
  },
  "WUuhkVMDPyFeaEL8uoD3tQ": {
    "date": "8/29/2016",
    "text": "Their food is korean perfection. A little overpriced but their lunch menu is less expensive. I love their pork bulgogi and i forget the other dish's name but it is udon noodles with seafood and it is sooo good! Their dukkboki is delicious too, and so are the fried dumplings. I love this little gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J95mD8riE_B3zcGAuAgYuQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/J95mD8riE_B3zcGAuAgYuQ/o.jpg"
      },
      {
        "img_id": "yG-qRY3Wtoi5T93RiiIJtg",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Pork bulgogi and the dukboki appetizer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yG-qRY3Wtoi5T93RiiIJtg/o.jpg"
      }
    ],
    "user_id": "1cLsV3rtVyJQOHJ-GEST5w"
  },
  "wkVDuX1B2hPKFs8X15wObw": {
    "date": "8/26/2016",
    "text": "They took our unfinished soup back to kitchen and said \"it is for other table, yours is not ready yet.\"  Just imagine it!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xICuF4rEk_4AN5Kx15rpDQ"
  },
  "bUzp0p4xeclQx2jZ3JFUNA": {
    "date": "6/12/2016",
    "text": "This place is overrated. The quality of food is about average or slightly below average for such an establishment. The price is ~30-50% more than expected.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5yDDRUmZqITbQchkECWOnw"
  },
  "Ad2smU7akioMobbUomIkaw": {
    "date": "5/12/2015",
    "text": "Went with a group of friends yesterday at 6pm, crowd started soon after we were sitted.   The food was very good: the thickness of the seafood pancake was just right and tasted very good, and bibimbap was normal. My friends shared a set of grilled meat, I did not try hence no comment about the taste.  The service was another matter. Restaurant was very short of staff, and there were only 2 servers on the floor, one presumably the owner. As one can imagine, the service was pretty erratic; we asked for ban chan refills thrice, and they came only around 15-20min later, water refills had to be asked and reminded as well. And it was a disaster at the cashier, as partly our fault, we did not inform the server we wanted to pay with more than 1 cards before bill was printed; did not realised it was an auto gratuity of 20% for a party of 6 and more (which did not justify the level of service we received), and the presumed owner had a problem with the program they used for cashier.   The experience was really stressed and I am not keen on returning. However, do go there if you're looking for a job!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6WAWwt_73l8aMfkjsthSvw"
  },
  "e3b0KYhcHmjjKzHeFZI2Aw": {
    "date": "3/7/2015",
    "text": "As a disclaimer, I do not know what \"authentic\" Korean food is, since I've never been to Korea.  But I have been to quite a few Korean restaurants in the US.  The service at Nak Won Garden was friendly, fast and good.  We arrived early on a Saturday for dinner, and the place filled up quickly.  Unfortunately, the food was fairly bland (we ordered steamed dumplings, bulgogi, and dolci bibimbap).  I'm not sure if that is more \"authentic\"?  I don't usually have to pour hot sauce on my bulgogi.  The dumplings came out cold... And raw in the middle... Pink pork.  Portions are smaller than I'm used to, but who doesn't need smaller portions?  Unfortunately, the prices are high.   $45 for 2 entrees, one app, 2 bowls of rice.  I left craving Korean food:(",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5I4_OEvrdTRhrk6ipGVQEw"
  },
  "E-D2hOWj7764pek40VRJIw": {
    "date": "3/5/2015",
    "text": "Outstanding food and a warm staff make this my go to place for Korean food! The Bibambap is outrageous and the Ban Chan are always fresh and diverse! This is a cozy place where you can really appreciate the food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ja7v9yoaC5VRUx6JSLvUyQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Great place with wonderful folks",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ja7v9yoaC5VRUx6JSLvUyQ/o.jpg"
      }
    ],
    "user_id": "eYR00lvuCK9tUrHvBoGHgg"
  },
  "OPBM2AF-P2Lusrik_AKP5w": {
    "date": "9/19/2015",
    "text": "Everything in here is great except for food. Bulgogi is too sweet, chicken soup is weird, seafood pancake is the only one I feel ok.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BTDus4NT6rtODgWFUDTyGA"
  },
  "ftzz9vGmJLimaoV2yj4_Xg": {
    "date": "3/5/2015",
    "text": "Oh em gee! Where do I begin. I was handed a barley tea upon walking in on a chilly day. Point, Nak Won. After perusing through the extensive menu, and immediately deciding I would be back soon, I went with my standard dish by which I evaluate all Korean joints, dolsot bibimbap and of course an appetizer of mandu, because dumplings, dammit. The moment my order went back, the banchan came forth. IT WAS GLORIOUS. First, the kimchee is legit, nostril clearing, fermented piles of joy. Damn, I missed a good kimchee. There were an additional 5-6 other dishes, winter veggie fritters, bean sprouts, etc. All were excellent. The mandu came out and were clearly handmade. Get the order of 10, not 5. You're welcome. Finally my sizzling, snapping, searing bowl of bibimbap arrived and I was elated. The egg was perfectly cooked, still runny for mixing. The meat was well seasoned, the veggies were abundant, and the rice was beginning to caramelize on the sizes of my stone bowl. I was given a beautiful bowl of homemade chili sauce, which mixed in beautifully.   Nak Won sticks to its Korean heritage by not mixing in Japanese or Chinese dishes on the menu, and I'm glad. Korean food deserves its own stage. This is by far the best Korean food in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 11,
      "cool": 7
    },
    "photos": [],
    "user_id": "QgLwZ-MAnu0lBB8aVjb9pg"
  },
  "lAfB-yIBzoUOof07re07jw": {
    "date": "10/8/2015",
    "text": "The Korean restaurant is great! I will definitely visit again! I ordered fired rice last time. I really love the flavor!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Z1lI6-OhvHlxbxMwZ1yCA"
  },
  "xaSWALsffB4X9DRQRdY7dg": {
    "date": "12/3/2015",
    "text": "I came here for lunch two days before Thanksgiving.  The place was quiet.  I ordered a beef short rib dinner and that was a BIG mistake.  It costed $35 and I walked out just barely full.  They gave me 4 piece of short ribs with bones and not much meat on them.   For that much money, I should have gone to a sushi bar and gotten a better meal.   I won't be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bTsNH6k7OnoEBl3nqwZAWg"
  },
  "TPw7-FVGvOI-y7dycsWVtw": {
    "date": "2/23/2017",
    "text": "Great from start to finish. The beef bulgogi was a great intro to Korean food. The cucumber kimchi is great as are the glass noodles. The service was attentive and made ordering easy. The BYOB option is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "My9rji5rYWKVB1yiIW-Q4Q"
  },
  "Gelx-GrOC5_g2YVKHApxaQ": {
    "date": "5/31/2018",
    "text": "I ordered Bulgogi takeout and when I went to pick it up, I thought there was a mistake because the total was $25. There was no mistake! It cost $25! The bulgogi was decent, but I honestly don't understand why they charged $25 for a single bulgogi dinner. I won't be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-k2eCTq-oOb6Qkxu0lK8Ww"
  },
  "h44TdzCpDZ8WOZjfuEotKg": {
    "date": "5/18/2018",
    "text": "I have been here several times and always enjoy the food. Although it isn't exactly cheap, I don't think the prices are too different from other Korean restaurants in Pittsburgh (although there are so few). The real issue I have is with the service. It seems to be incredibly understaffed, with one woman (who I assume is the owner?) doing most of the hostessing & waitressing. There is typically one other person there \"helping\", but seem to be relatively unhelpful (only refilling water & handing customers menus). No one is exceptionally warm or friendly. The side dishes come out with the main entrees, which I find odd. Also, I typically feel rushed. Once my friend & I were even told that they needed our table for a bigger party (aka please leave now). If they improved their customer service & maybe hired an additional waitress or two, this would be a great restaurant imo!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XMckLNsO72Y7VQKGsfCKaQ"
  },
  "j6zf4jlVYsmhAbrsswrCdQ": {
    "date": "8/13/2016",
    "text": "Food is delicious! Ambiance isn't that great but definitely worth the trip, lots of options. Portions are kinda small but I still think it's good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ew6BEeK14K6x6Omt5gbig"
  },
  "2AsQO7O0HUDBlbUyPEZYzw": {
    "date": "2/5/2015",
    "text": "We came here late on a Tuesday night, excited to enjoy some authentic Korean food. I grew up near Annandale, a town in northern VA with a huge korean population, so I have been very much spoiled by the korean food there for much of my life. It is some of the best you will ever have. Here in Pittsburgh, I've only ever been to Green Pepper, which I think is just OK.  Nak Won Garden's interior is small and unassuming. There is one long row of tables lining the wall. The tables themselves are cute; they contain drawers where the clean utensils are kept (so you can grab them yourself). The service was very competent, and I enjoyed the dish that one of the servers (who was korean) recommended: Jukgaejang, shredded beef in a spicy broth with scallions.  The broth itself was delicious, full of flavor and excitingly spicy but not so much so that I couldn't enjoy the other flavors.  My boyfriend had the dolsot bibimbap (the one that comes in the clay bowl and is a few dollars more expensive), and he was pretty disappointed.  I agreed that, compared to other places we've had bibimbap, it was pretty lacking in both flavor and quantity of meat/veggies.  Our banchan were alright, but it seems like we got fewer of them than I've seen in some of the pictures posted on Yelp.  No kimchi, japchae noodles, cucumber, or mashed-potato banchan.  Since I enjoyed my Jukgaejang and there are many more positive reviews of this place, I would like to come back again. Maybe earlier in the day in case they run out of dishes by the end of the night!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TsBUWbhRhuiEMXb56kL0Cg"
  },
  "FiZwwX7aN9rmhhCHdAXI1w": {
    "date": "9/29/2016",
    "text": "This place was I joke, amazing food, and I mean amazing!  Only 4 stars because the service wasn't great, but the food, holy cow it was good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ETT81-aPiTRJUiK5llXD5w",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Small, but smells amazing!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ETT81-aPiTRJUiK5llXD5w/o.jpg"
      }
    ],
    "user_id": "saGWpjRpvH4c45R-sMlj_A"
  },
  "hywqqofVvQ6qnGcI1nN-Pg": {
    "date": "1/17/2015",
    "text": "Being rather new, Nak Won may have a few kinks to sort out, but I am confident that they can grow to be another one of the good Korean restaurants in town (of which there aren't many). Their menu is quite extensive, ranging from barbecue to soups and stews. Prices are reasonable as well--if I recall correctly, the barbecues seem to be cheaper than Korea Garden and unlike the competitor seem to come in different serving arrangements, so that you can do a per-person or per-table basis. I didn't get any this time, but I would want to come back for lunch on weekdays, which offer more affordable versions of stuff like bulgogi. Other menu differences are that Korea Garden does more Chinese (noodles) and even Japanese (bentos) menu items.  This time we had the soondubu, the beef and seafood versions. Very nice portions of meat and tofu in the soup, while the soup itself was extremely flavorful. Maybe the one at Korea Garden gives even more in terms of seafood, but I definitely prefer the soup here.   Banchan was good too, although we were left a bit dissatisfied with our selection. Both tables on either side of us clearly got more than 4 different choices (e.g. we didn't get kimchi, seaweed, or potato), and when we asked a waitress if we could have some more she kinda stumbled and said \"umm how about cucumber?\" Not that what we got wasn't good (it was all tasty, including the cucumber), but it was just not a great feeling seeing other tables get more appetizers in terms of variety and quantity than we did. Not sure if it had to do with the items we ordered, but I never found this to be the case in other Korean restaurants I've visited. Hopefully won't happen again next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qu5Ctc6mzgc2ZsbuZw5tgA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Beef soondubu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qu5Ctc6mzgc2ZsbuZw5tgA/o.jpg"
      }
    ],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "SW132XhLAIN_6nRVw_dc0A": {
    "date": "7/30/2016",
    "text": "Wonderful little Korean Restaurant that has great staff and delicious Korean food. The owner made sure to stop by every table. I can't wait to return to eat again!! Everyone should give Korean food a try. It's very different from Vietnamese, Chinese or Thai food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BgRLQV32BdNE9wJsNFtsEA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Wonderful Korean food!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BgRLQV32BdNE9wJsNFtsEA/o.jpg"
      }
    ],
    "user_id": "0fq238YFVW5qWcWwebQaQA"
  },
  "dgXfnkqpIqqJYHyb0XPcow": {
    "date": "12/20/2014",
    "text": "We got here around 7 pm on a Tuesday evening, a party of 5. Unfortunately they had no tables open but we walked over to giant eagle to get a six pack since it is byob there. Before we finished buying our beer they called to say they had a table, so the wait was short.  Once there, we waited at least 5 minutes before we were brought water or even a bottle opener to start drinking our beer. The service was slow, but I'm willing to overlook that since they only recently opened and probably have been getting more business than they could have guessed.  We started with a big kimchi pancake and it was crispy and flavorful. Great sharing size. I got the haemul soondubu--there was so much seafood in it! Tiny shrimps and squid legs, little clams, and of course the ever tender pieces of silken tofu, with a raw egg tenderly placed on top of it all. It was super delicious and I was pretty happy with the price, which is $1-2 cheaper than the one at Korea Garden.  The banchan was varied and some that I had never had before. Fresh kimchi, burdock root, spinach, celery, and bean sprouts. They were happy to replenish it once we had gobbled it all up. The burdock root was my favorite--their seasoning was excellent.  I definitely plan on going there again. The quality of their food was solid and the prices were very reasonable. The seating area is small, however, so I will probably stick to visiting on weekdays. Wonderful new addition to Pittsburgh dining!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8XnZDDY4yNIbtQfBN1_Tyg",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Kimchi pancake and banchan!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8XnZDDY4yNIbtQfBN1_Tyg/o.jpg"
      }
    ],
    "user_id": "88bnyygk6fNt_sq6DrOykw"
  },
  "n1unzHNerLPjVXyf5PeLsw": {
    "date": "1/14/2017",
    "text": "Good food, terrible service. We were treated as though we weren't paying for our food at all. Will not return because of how impossible it was to resolve issues that should not have arisen at all. We were given much less food than we ordered, and were given no respect, despite paying for our food and leaving a tip that was not deserved.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "l9n1ED1UWx3qUYPtl7bywg"
  },
  "Ja2xhjt7Svu-bsFZZCjqww": {
    "date": "9/16/2017",
    "text": "The food here is amazing. Happily surprised. Would come again and again. The owner is super nice as well. Absolutely phenomenal. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kFk_TTqamK4a118Wk5HGdQ"
  },
  "DSXNzP3Akk-UlCsIyUWd6Q": {
    "date": "10/9/2017",
    "text": "First off, this place is so overpriced it's not even funny.  Secondly, they have TERRIBLE customer service.  My husband and I went there on Valentine's Day and it was snowing a decent amount.  Of course, since this place doesn't take reservations, we decided to head in during early evening before the dinner crowd; although we also were aware that any time on Valentine's Day will be rough at most restaurants.  However, what we experienced that day was beyond our limits.  We got seated and our \"banchan,\" complimentary Korean small appetizer dishes that get served prior to every meal, came out.  Although it was crowded, it was what we expected on Valentine's Day.  Shortly after we got seated, we noticed a huge party of 15 or so people come in.  My husband and I said to ourselves that we should try to order before that big party orders and so we did.  We ordered our meals - my husband ordered bulgogi and I ordered a soondubu stew.  Fast forward one hour later.  During this time, we saw this whole huge party of 15 people who had ordered food after us receive their food relatively quickly.  And we were still just sitting there without our food, picking at banchan.  The worst part is, the owners of this restaurant knew the huge party of 15 people since they were from their Korean social group so they played favoritism and catered to them above us since we were only two people whom they did not know personally.  On any day, this would be unacceptable behavior for a restaurant, but on Valentine's Day, this transgression is unforgivable in my book.  We ended up getting up and leaving since we never got our food after waiting for a whole hour, although we had definitively ordered before the big group had come in.  My husband is a patient man, more patient than me, but we both agreed this was too much.  We paid $5 for the banchan we had eaten a little bit of, and told them that we were disappointed they had let a large group get their food very quickly soon after they had ordered even though we had come in first and had ordered first, and that they should be more mindful of couples on Valentine's Day.  To this, they said that they would give us a discount on our next meal.  A month or so later we went in for our next meal for dinner and received a $20 or so discount from our total bill.  We ordered the same things as before and my husband liked his bulgogi but it was very overpriced for what little meat we got. It was like a measly half cup of bulgogi and some rice on the side for $15, and my soondubu stew was $11 and was just normal, nothing spectacular.  I personally like Korea Garden's soondubu stew better.  Needless to say, we will not be going back there ever again.  Some things you just can't fix with throwing a discount as a bone for being totally rude and playing favoritism to people you know rather than the customers you are supposed to serve. Shame on you.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "TWzRnwVJvH8P4Z8nfqXecg"
  },
  "KgEXT3gnv7lsfqKom1MpWQ": {
    "date": "1/16/2016",
    "text": "Ordered galbi tang soup and beef bibimbap :-) the food is okay, and they provide small dishes! I love the fish cake. The tea is also great!!!!!  The restaurant is not so big and very crowded. Since there is not many Korean restaurants nearby center ave, will recommend this one !",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bMOOa6IcCFy2gcPpySIAEw",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Small dishes! Love the fish cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bMOOa6IcCFy2gcPpySIAEw/o.jpg"
      },
      {
        "img_id": "2hlbIh3URzDiYq6NVFHmhw",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Beef bibimbap",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2hlbIh3URzDiYq6NVFHmhw/o.jpg"
      },
      {
        "img_id": "wpl7pgKpODFTfTHv662DRA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Galbitang",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wpl7pgKpODFTfTHv662DRA/o.jpg"
      }
    ],
    "user_id": "Yuc7wZxhOKkS1hYMIXaDRA"
  },
  "bw8EC2PsX0odG70lBtYYcg": {
    "date": "9/1/2015",
    "text": "I stopped in here for lunch today.  Since they don't have a menu available online there was no ordering ahead.  Also, once I got there I found out it was cash only unless you spent at least 25 dollars.  So I put my order in for the Soondubu and headed to the ATM in Giant Eagle.  Soondubu is a \"silken tofu\" in a \"spicy, savory broth\" with I got with beef and came with slices of pork and kimchi on the side as well as rice.  I thought the Kim-Chi and sliced pork was very good.  The tofu and broth however left a lot to be desired as I found the broth to be neither savory nor spicy.  As a lunch place I was somewhat disappointed that they did not have any options less than $10.99.  I'd still like to come back and try their Korean BBQ sometime, but probably won't be getting take-out for lunch again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kMqeVGy6zy1ZCCZ-GplOSQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kMqeVGy6zy1ZCCZ-GplOSQ/o.jpg"
      }
    ],
    "user_id": "yN9wki8dsMvZtK5s2ZqEeQ"
  },
  "ICf6neCmUqiGO49mZcpYiA": {
    "date": "12/10/2017",
    "text": "the owner was really unfriendly. She was very impatient when we asked her about the menu. She even hurried us to finish our meal faster.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9gdRV2jTbSaKly1GRD7tfQ"
  },
  "aexfNW3TwTQ4m2Ji5c6XLQ": {
    "date": "11/22/2015",
    "text": "Being an out of town patron, I was craving some warm Korean food since it was really cold outside. This was the closest Korean place to where I was staying so I make a trek to Nak Won Garden. This place may be a hole-in-the-wall establishment, but the food is pretty good. I ordered the beef soon-du-bu which is a beef tofu soup. The banchan (side dishes) come in these really tiny bowls but of course they refill it for free. The service was on point and food was decent. It definitely satisfied my craving for Korean food. The food is on the pricier side of the spectrum, but worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XiFzYeOUdkL1HxVFlPsHSA"
  },
  "QNjgzXUv3b6LXNZ8ylDc9A": {
    "date": "12/25/2017",
    "text": "I love the service. The owner is very friendly. My mother who is Korean loves the authenticity of the food. Bulgogi and Soon Dooboo are good. The Bi bim bap and Mandoo are good also. Good service and portions. I feel that the lunch menu is good value.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G5D5kNP-l4pcZCE5w6utgQ"
  },
  "vGMJC9nrIJFy1HqG9ruJwQ": {
    "date": "5/21/2017",
    "text": "Food was decent, but does not reflect the price.  The servers were very friendly and attentive despite being extremely busy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_6rvK2BBawPvSvtWs6oazw"
  },
  "E8rj8G6HQkGTgArLJqyiTA": {
    "date": "6/18/2017",
    "text": "I've had korean food AMPLE times. I've even spent time in Korea. This place, the food was not good. extremely bland. The restaurant itself was nice. But the food. No thank you. Very disappointed, as I will be working in that area for a few months.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KAkd4Wkwo846cbUxsyPgkw"
  },
  "P4QxI_6p7VMh98A5ScRlbw": {
    "date": "10/31/2017",
    "text": "Food is below the average, price is not cheap, service is good but probably because I was the only one in the restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cSueM6_er4EA2F949Wja9A"
  },
  "34VQFuEcy2SnoTaKDitPXw": {
    "date": "5/30/2017",
    "text": "We went there a while ago when it first opened for a friend gathering. I remember the food was good so did the service. We had a friend who stayed in Korea for couple years and knows Korean food very well with us on that day. As our friend pointed out, everything was very good close to authentic. We would go back and try again. Wish they have menu online beside the ones that was posted by the guests so that we can easily order pick up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "pW_XkS9BfbnAQ_JMxNA-8w"
  },
  "TkfkkzYv-zvkOc0oyaEF0A": {
    "date": "5/17/2018",
    "text": "The hostess was rude, simply switched off the light at 9.10 when the restaurant is officially open till 9.30 PM. Further, we gave her a $2 tip for the poor service but she made it a $4 tip when I was trying to reconcile the charge in my credit card statement.  Be careful!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZMxYbKaW8lcnagfBogIIFQ"
  },
  "-yLVimSaKS1U3Af4C5N8fQ": {
    "date": "7/25/2017",
    "text": "Food wise, based on what I had was good. However, I'm not sure why their rating is only 3.5. I think at least they deserve at least 4 stars haha. Hope you guys will enjoy eating at this restaurant:)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YJUyRF-vTsIoDoK8mUmzWg",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YJUyRF-vTsIoDoK8mUmzWg/o.jpg"
      },
      {
        "img_id": "flWqV3Yb70SusLDawpUFDA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/flWqV3Yb70SusLDawpUFDA/o.jpg"
      },
      {
        "img_id": "OwLqdtgj4CVD0Zw-NDB19w",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OwLqdtgj4CVD0Zw-NDB19w/o.jpg"
      }
    ],
    "user_id": "QaCCbhaxr7XXvqiMcewsLg"
  },
  "68p7169Dwz0DzzMz5oIe2g": {
    "date": "3/6/2016",
    "text": "I was very pleasantly surprised by my experience at Nak Won last week. I am usually not a fan of/not interested in Korean food, but boyfriend and I decided to try it out since it's close by and he likes Korean food. First off, I must say that our service here was fantastic. Our server plus a couple other people who worked there stopped by our table at least once to ask if everything was okay, and they were all very nice. We ordered fried dumplings, seafood + scallion pancakes, bibimbap, and beef bulgogi. The dumplings and pancakes were GREAT. Bibimbap was like every other bibimbap I've had. Boyfriend said his beef bulgogi was pretty good and finished all of it despite all the other food we ordered. But really though, the dumplings and pancakes were so good!! Also, we got strawberry biscuits/crackers after that were a pleasant end to our meal. This is probably the first Korean restaurant I've been to where I've actually enjoyed most of my meal. Would come back for the yummy appetizers!  Taste | 4 Atmosphere | 3 Service | 5 Presentation | 3.5 OVERALL | 4",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "axcAaQsvgFIm16PUcG9reA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/axcAaQsvgFIm16PUcG9reA/o.jpg"
      }
    ],
    "user_id": "HC5zLdut4caN1VPqxqRsMw"
  },
  "DSfKBySY31E5rIAllISkSQ": {
    "date": "3/15/2016",
    "text": "I live very close to Nak Won so it's very convenient for me. As a result I am here quite often.   Recently, I was very pleased to see the addition of RaBokkI () to the menu. This dish reminds me of my summer in Korea. Rabokki is a variation of the popular street food tteokbokki. Tteokbokki is fried sticky rice cakes in a sweet and spicy sauce along with some other veggies. Rabokki has the addition of ramen noodles and hard-boiled eggs. The chewy rice cakes and soft noodles soak up a lot of flavor. If you like tteokbokki, you will love this too.   My other favorite dish is the beef bulgogi. The word Bulgogi literally means fire meat in Korean, and is derived from the Pyong'an dialect. It refers to marinated meat, (generally beef if used without a qualifier), cooked using traditional grilling techniques such as gridirons or perforated dome griddles that sit on braziers, unlike deep frying or boiling in water.   I have tried various other dishes but the aforementioned two dishes would definitely be my favorite.   The owners are very friendly and will speak Korean with customers but the servers are young American girls. They might not speak Korean but they have great personalities and are ready to serve you.   4 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TJh8QEjY5yclRgvIjNkuUw",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. New menu items added! Rabboki with added cheese and ramen. Phenomenal.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TJh8QEjY5yclRgvIjNkuUw/o.jpg"
      }
    ],
    "user_id": "Pe5eoZvuQYif9-jPfrFSTQ"
  },
  "LNAJ1Ue1KjSORGSOhBJQyg": {
    "date": "1/18/2017",
    "text": "Nak Won Garden (NWG) is pretty good. This was my third or fourth time there and it's been consistently good. The latest trip was for lunch, which is usually when I go and there's maybe two other occupied tables around that time. I've never had to wait to be seated so the fact that they don't do reservations isn't an issue for me. It's a good time to go for a casual lunch because you don't feel like you're occupying other people's space given that their tables are fairly close together.   Each time I've gone they've had Kpop playing (Super Junior, etc.) and it's a very casual environment. I've only been there during lunch hours so there's usually only one person greeting and taking orders. They usually seat you closer to the door/windows which is fine. The waitress was very sweet and they're pretty good about checking in on you without seeming overbearing but also very present if you need anything. It's the perfect combination.   The food is really good. I usually bring new people who have never had korean food before so they generally get the bibimbap. I like it as well, although I've tried a few other things there. Most recently, I got the Dolsot (hot stone) Bibimbap with chicken and my friend had the marinated beef. Both were good but it's pretty mild without their spicy sauce which I assume is some kind of gochujang. They both had the traditional fried egg served on top, which I love runny. It's $14.99 which honestly isn't bad. They do have bibimbap for less that is not served in the hot stone. This last time they served less side dishes but in larger portions which was totally fine. The kimchi was great. The Mochi ice cream was divine. Everything was good. I've never had their BBQ or their Bulgogi but that's next on my list. I already have plans to go again after friends saw some of my pictures. Also, order the dumplings--it's a must.   I will say that they try to sell you on appetizers which is fine because they're worth it. My friend and I were going to split mochi ice cream (they come in a set of 2) but she just brought out 4-- we didn't complain. We both walked out spending $25-30.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LcyQy0mcoSjeFLFE7uvTWw",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Pork bulgogi.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LcyQy0mcoSjeFLFE7uvTWw/o.jpg"
      },
      {
        "img_id": "QNYd_nvv768BdkyCWni_Ug",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QNYd_nvv768BdkyCWni_Ug/o.jpg"
      },
      {
        "img_id": "C2gXxUaMp2aFwojpuEmUQA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Strawberry and mango Mochi ice cream.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C2gXxUaMp2aFwojpuEmUQA/o.jpg"
      }
    ],
    "user_id": "h0TUJ5pU-buTRFFeghmwvw"
  },
  "B1fJOd9Gu83_1Qc__FV0gQ": {
    "date": "8/18/2018",
    "text": "This owner never changes her service. 2yrs ago, there were some customers and she was yelling at her employees, this year she wasn't kind \"because of weather\" (she said), she served budaejigae without the main ingredients and she sounded irritated everytime she talked to us. I shouldn't have had to deal with her angry attitude.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vkIAHCCdSOLnrU7I3O7X5A"
  },
  "PeB1lw-ogPiC3fnuOQJM1A": {
    "date": "8/16/2018",
    "text": "I have to keep calm firstly cuz I feel cheated. The suggested gratuity is incorrect. A $35 dollar check requires me $10 tip and not that this is 18% suggested gratuity.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UPhALFyZYDTVGK4Hi6sH8w"
  },
  "CFs6idlLB1ASXvNn53TpSw": {
    "date": "4/7/2017",
    "text": "The restaurant was understaffed. Serving was pretty slow and we stood at the door ,waiting for quite a while before someone came to us.  My tea cup was very dirty with some kind of sauce sticking on the rim! The waitress apologized later but the damage has been done .   I ordered a soup which cost over $17 . The taste is ok but is overpriced for such small portion...  Have been seated under the ventilator,chilled !",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yYGxCGNUTQ7kt7VbziKzfQ"
  },
  "4ar9TRslzYYBxGQlMf0ozA": {
    "date": "10/20/2016",
    "text": "Tastes ok, but portions are tiny and service is horrible. We got cold stares when we walked in at 9:20.   There was a mix-up in the order and one dish came out less. We were served 3 entrees (party of 4). We were told that they are not going to start cooking one entree again.  I always assumed, if you are a restaurant, that is what you do.   We were hungry are drive from NJ so we ate and cut our losses. IMO, 3 dollars for a bowl of rice is a bit much.   Thank you but no Thanks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "GzAyLfPT66wWv4xtukwr3w"
  },
  "QVwn9KhVoXir7UM3ngvtDw": {
    "date": "1/16/2017",
    "text": "Likely the best Korean place in Pittsburgh, though I'm not sure how much that means.  I've been here twice now, and the food is generally decent, but the service is often uncomfortable.  The waitstaff is uncharacteristically white for a Korean joint, and the servers I've interacted here have great, even when I asked for a bajillion refills on their very aromatic hot tea.  In my defense, the cups are tiny, leaving the tea to get cold in 2 minutes flat if you don't chug it.  A teapot or carafe with the order, like Chinese places do, would be much appreciated.  The less nurturing service comes from who I think might be the owners.  While we were waiting at the door, two tables opened up at the same time, as an older Korean lady seated played hostess.  As it was a sub-freezing January night, I asked if we could have the table in the back, farther from the constantly opening front door.  I was told simply, \"No.\"  Oh, okay then.  We sat at our door-adjacent table, where we placed our orders and did not receive banchan until well after our entrees were delivered.  It was as if we were being punished for only ordering entrees--\"No appetizers?\" she had asked us, in a tone of half disgust and half dismissal.  Lucky for them though, because I was brought the wrong order, and probably would have been already elbow deep in it when they unceremoniously whisked it away five minutes later if I hadn't been dutifully awaiting my banchan for the full dining experience.  Anyhow, when I did receive my GALBITANG (extra spicy), it was a generous bowl of savory broth, with the perfect level of spice (aka really frickin' spicy without killing my tastebuds just yet), 3 or 4 meaty chunks of short rib bones, and perfect strands of swirled egg.  Overpriced, yes, at around $16, I believe, but deeply satisfying.  My husband's BEEF BULGOGI, was fairly standard (and also overpriced at $22+) but delicious nonetheless--thinly sliced beef, not too fatty, grilled in a sweet and savory sauce that I would eat on anything.  Its accoutrements were mixed up in the banchan we eventually received, but we ate in lettuce cups with rice, grilled onions, sweet pickled onions, and little dabs of doenjang.  Jalapenos would have completed the perfect bite, but now I'm just getting picky.  Our friends' sizzling plates of BEEF and CHICKEN BOKKEUMBAP were less impressive looking, but as first-time Korean food-imbibers, they seemed to enjoy them.  Spicy sweet pickled cucumber, soybean sprouts, soft marinated eggplant, and kimchi banchan rounded out our meals.  Thinly sliced, well-seasoned cucumber were a stand-out favorite.  The kimchi was seriously disappointing to both kimchi-lovers at the table, myself included.  Other tables adjacent to us received different banchan, some more appealing-looking, but by this point, I was too jaded by rejection to ask.  I enjoyed this meal as much as our previous visit, when our table of four shared a SEAFOOD JUNGOL, filled with squid, monkfish, shellfish, and other sea critters, as well as some sliced veggies, if I remember correctly.  Cooked tableside, it was a fun meal to share, and makes for a spicy, communal dinner experience.  Nak Won continues the Asian restaurant trend of tasty food and terrible service, and overpriced to boot if you happen to be in Pittsburgh.  Makes me second guess my Korean cravings.  I think I'll hold out for greener, tastier, friendlier pastures.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yk6WWwezDBeQB3Kpb7xehA"
  },
  "TMOFXZtc01vS5oWAWydE9w": {
    "date": "10/4/2017",
    "text": "Food was great and the portion sizes were perfect! Ordered the kimchi stew and bibimbap -- perfect for two people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "R6XBu4nVY9FAfyOoMbXKCg"
  },
  "VjMegLjBxr6e9C58S6w90A": {
    "date": "11/4/2017",
    "text": "When I moved to Pittsburgh this summer, I heard about the happening food scene and was hoping they'd have a variety of ethnic foods for me to try, as I had been doing while in Brooklyn over the past year.  I happen to love Korean food and my sister in law has taken me to the best New York has to offer.  It was tough going to a restaurant and not having her as a guide about what to order, but the staff here is so gracious and warm, they were happy to help me out! Now I came with an appetite, and went for the table side Korean style BBQ, the beef bulgogi.  With this option, you get a bunch of little side dishes, as I had experienced in the past.  They cook the meat in front of you, and then the waitress tore off a piece of lettuce placing meat, pickled onions, and \"special sauce\" in the wrap and anxiously waited for me to take the first bite - LOVED IT! I am typically used to eating korean BBQ meat with rice patties instead of the lettuce, and I do prefer it that way as the rice patty is a bit thicker/better crunch, but the food was absolutely perfect and the lettuce did not detract.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "by9WgccrFe3DNxUkwJUkOg"
  },
  "e1ENJY4s-kXYReMplp4JDg": {
    "date": "4/22/2017",
    "text": "Really great little Korean place.   We got the Pork Belly and the wings.  Both were definitely above average.  I don't know anything about Korean food and both were tasty enough to satisfy my American-slanted palate.  You mix the pork belly with Napa cabbage, spicy paste, jalapenos and garlic.  The wings had a heavy spicy sauce and they were topped with peanuts.  Some of the wings were on the bone and some were boneless.  They also give you 5 little dishes of Kim chi, broccoli, pickles etc to eat with everything.  Overall this place is great. Will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PqNHpuIRQj8Yib-WgBkgxQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Pork belly and fixings.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PqNHpuIRQj8Yib-WgBkgxQ/o.jpg"
      },
      {
        "img_id": "0O_WFVaHPkvMx7PXciO9GQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Large order of wings.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0O_WFVaHPkvMx7PXciO9GQ/o.jpg"
      }
    ],
    "user_id": "xHyJ2AUvvCfKjMTfSPPI2g"
  },
  "lwFLZ8qUVeccozQ1a8Ux0A": {
    "date": "6/25/2018",
    "text": "There is no privacy in this restaurant. The owner keeps talking to customer while they are eating",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yVDpjM6xRFvi2Yt2n4VPNQ"
  },
  "yL5b8bOtz5IvGAuKDxpCng": {
    "date": "2/28/2016",
    "text": "I've been to a lot of Korean restaurants, including ones in New York City. I visited Nak Won Garden twice. Once I had Budae Jungol, which was good, but didn't settle with my stomach too well. I also had one of my favorites, jjambbong, and it was the most unimpressive jjambbong I've had. There was a lot of squid, but only one clam and one shrimp. The soup was not as rich as many other places.  Service: The first time I was there, the restaurant was really busy but the service was good. The waitress came to check on us often. The second time was during mid-afternoon when it wasn't busy at all. But the waitress came only in the beginning to take my order and then at the end to give me a check. It was like she was waiting for me to leave. It didn't feel very welcoming.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zya8YbRKYzFELQbG9b1XQQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Jjambbong",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zya8YbRKYzFELQbG9b1XQQ/o.jpg"
      }
    ],
    "user_id": "YDJThYrghe0CGPINWW_ILQ"
  },
  "D0OgkPsJ_sIn87D1Nf_erQ": {
    "date": "2/14/2015",
    "text": "Compared to the other Korean restaurants in Pittsburgh, I would say Nakwon comes out to lead the pack. The food offers a more authentic taste and menu compared to other local places. Especially for being a new restaurants, I was fairly impressed.   SEAFOOD PANCAKE (Haemul Pajon) -- Started out with the seafood pancake as an appetizer and it was delicious. The pancake wasn't too battery or soggy. It had a nice crisp on the outside from the pan frying. Also, there was surprisingly a lot of seafood in it. They definitely did not skimp on the squid or the shrimp. The green and red peppers were also still a nice crunch and not over cooked. I didn't care much for the sauce they have with it - I personally thought it tasted better in it's own.   CASSEROLE -- One word - YUM! So good - all their soup based dishes seemed to be prettty delicious in general. I don't remember which one I had specifically but I would imagine that any of them would be great. The broth was a really good flavor - nice and spicy. Definitely makes you sweat. Definitely made me sweat. Filled with sausages, rice cake, onions, kimchi, and ramen! We ordered a lot but the sheer size of this dish alone could easily feed 3-4 people.   MARINATED BEEF (So Bulgoki) -- I wasn't particularly impressed with their bulgogi. It was a bit bland for my tastes and I thought that the meat could be more tender. It was a bit too chewy as well.  STEAMED EGG (Gyeran Jjim) -- I don't even remember if we ordered this, but it was quite good. The end was nice and fluffy. Extremely light and sweet...and hot. Gosh that egg holds it's heat in the stone pot.   SPICY PORK BELLY (Gochujang Samgyeop)  -- Pork belly marinated in Korean pepper paste, or gochu. Possibly better in theory. I didn't particularly enjoy this dish from here if were being honest. I found the meat to be quite chewy like the beef. It was a bit hard to eat. The pork belly also wasn't as spicy or have enough kick, not as much as I expected anyway.   I'm interested to see how their KBBQ is. They're one of the few places in Pittsburgh that have you cook it yourself at your table. (There needs to be more places!) I would come back and try their KBBQ though.   Side note- they have whole clementines post-dinner, which I actually absolutely loved.   The service was great. Everyone was very friendly and attentive. They even offered \"service\" aka on the house items.  The restaurant isn't huge, but would be good for small group get together. It's BYOB with a $2 fee per person, pretty reasonable in my opinion. Overall prices are still expensive. All Korean food in Pittsburgh is fairly overpriced though, so I guess it's 'competitive' in the market. Suggest going with a group and splitting the bill/meal. It's definitely a family style restaurant not a 1:1.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 11,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "JlWKmf5ass9iEuO8qaKUtw",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JlWKmf5ass9iEuO8qaKUtw/o.jpg"
      },
      {
        "img_id": "qNYEW2IHn5lO95bPhzSCZQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Seafood Pancake -",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qNYEW2IHn5lO95bPhzSCZQ/o.jpg"
      }
    ],
    "user_id": "1f6eEQiFfMt5HLQbS2wlJg"
  },
  "2XzbsDGpUUFZQitC1h9Pzw": {
    "date": "5/14/2016",
    "text": "Service was terrible. Felt like I was rushed from the moment I walked in the place. My check arrived 5 min after the food. As people began filing in, I felt they were just itching for me to leave. I laid down $17 for the $16 lunch (which was just average). I saw the cashier shake her head as she walked away with the money, assuming that the extra $1 was the tip. Little did she know I was planning on leaving a reasonable tip. Instead, she never returned with my change. When I questioned her, she stared at me, then said \"I thought that was the tip.\" She rushed back to the cash register and took $1 out and handed it to me and rudely said \"No tip?!\" I simply replied \"nope\" and walked out.   I will never be back and I would encourage everyone else to do the same. Trust me, the food is not worth it.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 9,
      "cool": 2
    },
    "photos": [],
    "user_id": "dUGwfQfKYiM3qWt-FvVPZQ"
  },
  "uLYpzYhlvl1avCs7BY_tiw": {
    "date": "4/1/2018",
    "text": "I love this place.  Good homemade Korean food.  Love the Galbi Tang and pork bulgogi.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JFxSpW7pwexoN5azbgpMMg"
  },
  "4Zb51DMVXCqyKXWxpfZRvA": {
    "date": "2/27/2017",
    "text": "I've been to Nak Won Garden a few times and every time it's been wonderful. The owners are super nice. On my most recent trip I had the kimchi pancake, fried mandu, pork bulgogi, and kimchi jjigae. Everything was delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZfOa2ueWALD6aHEOa2wpSA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZfOa2ueWALD6aHEOa2wpSA/o.jpg"
      },
      {
        "img_id": "Mz9kQIXG4XVQucUbpIntZw",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. The table ran out of real estate!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Mz9kQIXG4XVQucUbpIntZw/o.jpg"
      }
    ],
    "user_id": "vxPJ9ww0-iho5uJfhXsk5A"
  },
  "curFGMMfaEJWHLI8f99eyQ": {
    "date": "1/15/2018",
    "text": "My husband and I stopped here while staying in the area overnight. We had the idea to eat at a place across the street, but decided against it.  Thank God we did!  This place was amazing.  The sign outside just said \"Korean Restaurant\" and it doesn't look like anything special. When you walk it, there aren't too many tables.  Luckily, we snagged the last one.  There was a busser whom we were put off by.  She wasn't friendly has flat out told us she had no idea what was good because she \"doesn't speak Korean.\" Luckily another woman came over, I believe she was an owner. She made suggestions, and answered some questions.  The food came out incredibly quick, and it was outstanding. It was easily one of the best meals I've ever had. The portions are big, which is reflected in the price.  For my husband and I to eat, it was $55 before tip.   It's also a BYOB, which many patrons were taking advantage of.  When my husband and I return to Pittsburgh, we will absolutely stop here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VUjqaUHYOJ2ZFwuyjFgJQA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Beef bulgogi and duck!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VUjqaUHYOJ2ZFwuyjFgJQA/o.jpg"
      }
    ],
    "user_id": "0Sr-OcymmUDhIU2WhfLuEg"
  },
  "ZQEMDxH98G4uYy-o92KCRg": {
    "date": "3/14/2018",
    "text": "Nice place. The waiters are not very friendly though. I like the tofu soup. The kimchi pancake and fried fish are mediocre. A little expensive for the food. But I do highly recommend the soup.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "FmyYSodHuwK-x7cw4atA4Q"
  },
  "GuExv7QpGk7bmbmv1CAOqA": {
    "date": "12/13/2018",
    "text": "The food here is delicious. It is no more expensive than any other authentic korean restaurant so i'm not sure why people give low reviews for that.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QIwmQG0Y33BxoisD92HV5w"
  },
  "dDY9cGundW04tErRUZNNrw": {
    "date": "9/25/2018",
    "text": "Service was so great, once we were seated we got hot tea and food came at a reasonable time. I got the soondubu and it was really great with oysters. Loved it and will be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "blrbF_j724b2V9K5aWT4Mw"
  },
  "mn0zeEm-m0yaf93o9yEf1Q": {
    "date": "4/10/2018",
    "text": "Stopped by for lunch because I was craving some bulgogi. The lady who served me was super nice. There was also a cute dog! Not sure if that cutie was just there temporarily or not. The food was good but nothing spectacular. The sauce on bulgogi was a little too heavy. Will come back to see the dog probably...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QU-GYtwQowc8prxs41RE2A",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QU-GYtwQowc8prxs41RE2A/o.jpg"
      }
    ],
    "user_id": "EU5dSjk-UzILTp5kcg-dOQ"
  },
  "7K48AOburXreA8-R4jaFAg": {
    "date": "5/4/2016",
    "text": "Pleasantly surprised to find an authentic Korean restaurant in the city. I went there on a weekday evening and was seated immediately. The ambience of the place is simple, yet welcoming and homestyle. We were greeted by a friendly hostess, who answered many questions we had. My partner had the vegetarian sundubu, with soft silken tofu! He loved it completely, I had a bite and I liked it too. I got the chicken bulgogi (marinated chicken in a sweet and spicy delicious sauce) served with a side of rice, and other accompaniments. I loved the Ban Chan, and my favorite had to be the boiled bean sprouts and kimchi. I was also happy with the service of this place, the owner personally came to ask us how our food was.   Overall a nice addition to the plethora of good Asian dining options in the city. Will be back to try the bibimbap and ddukbokki.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oF6xWPfGEyDvJsQrZmMbgA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Vegetarian sundubu (far right ) and chicken bulgogi (bottom left) and other ban chan",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oF6xWPfGEyDvJsQrZmMbgA/o.jpg"
      }
    ],
    "user_id": "Zt8kRfpqdL7cULnAS2f5AQ"
  },
  "CUGvN4AK9YJk28YHXLB6wg": {
    "date": "2/5/2016",
    "text": "In Pittsburgh, Nak Won Garden (NWG) by far, holds the top slot for best Korean in town.  The lack of high end Asian and ethnic food choices make NWG a standout.    Examples of why you ask?  Ban Chan, the customary small side dishes that accompany your meal, provide plenty of variety: kim chi, potato salad, pickled radish, fish cake, boiled bean sprouts, pickled peppers, acorn jelly, dried fish, and greens.  These are free and refillable by request so don't be shy if you need more.  Korean grilled meats and fish.   They have it down to a science; the way they use marinade on beef bulgogi, Galbi ribs [1] and pork.  When the choice involves the use of a BBQ hot plate, you really cannot go wrong.  As part of the BBQ combos, you also get hot tofu soup, rice, steamed egg and pickled onions for an all-out family style meal affair.  If you love fish, you will appreciate the mackerel fish and the croaker as it's perfected salted and grilled, great with steamed rice and that aforementioned Ban Chan.  Not to belabor (working here to reduce TL;DR scenarios), but there's more!  Hot pot options [2], sizzling rice a la BiBimBop, chicken ginger soup, and other individual appetizers/entrees can be ordered as well [3].  Do not forget to check in with your Yelp app, it will afford you a 10% discount off your meal.    Come hungry my friends and happy eating!  ----------- Details:  [1] Galbi ribs, in particular, are high quality but are quite expensive at about $35 per order.  Splurge once and a while, will ya?  [2] I did not particularly like one hot pot option that included luncheon meat, go for the other choices.  [3] Jap Chae, a potato glass noodle, is another favorite of mine as well.  Love the dumplings appetizer, whether pan-fried or steamed.  Did I mention seafood pancake?",
    "rating": 5,
    "rated": {
      "funny": 63,
      "useful": 105,
      "cool": 93
    },
    "photos": [
      {
        "img_id": "7MbZU27PABio5C9-WJcCyg",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Lotus root (ban chan)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7MbZU27PABio5C9-WJcCyg/o.jpg"
      },
      {
        "img_id": "cl_mZ8XU2oYIngOL5_jeLg",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Korean blood sausage",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cl_mZ8XU2oYIngOL5_jeLg/o.jpg"
      },
      {
        "img_id": "Uq0720DN8hw8B2s8UyVWYw",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Galbi prime ribs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Uq0720DN8hw8B2s8UyVWYw/o.jpg"
      }
    ],
    "user_id": "6tbXpUIU6upoeqWNDo9k_A"
  },
  "dbZp1RN3YRHlebSSArQM2Q": {
    "date": "10/27/2018",
    "text": "Very good Korean restaurant. I had Pork Bulgogi and it was perfect. Very authentic. Good service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D-2FHKg_C5HjrgVO2Da0-w"
  },
  "8zIFZ-T7rPq0tQYaXYM1Ow": {
    "date": "3/24/2018",
    "text": "This was simply amazing!!! We made a two hour drive for my husband's birthday to get some good Korean food, and it exceeded our expectations.  Everything and everyone one was absolutely wonderful!!    Thank you!  We WILL be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "24AH-xvkLgepzqaaLm0gtw",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/24AH-xvkLgepzqaaLm0gtw/o.jpg"
      }
    ],
    "user_id": "4m2oY_pTqsRaO8z4D9C8pA"
  },
  "UPcZJkZQYb44Ve4bonfGVw": {
    "date": "6/3/2018",
    "text": "Came here for lunch with a friend since we both adore Korean food. We both were thoroughly impressed with the food and service! To be honest,  it was some of the best Korean we've ever had. Flavours of each dish were well balanced and everything we had was great. The people there were very friendly and welcoming and made the experience quite enjoyable. I highly recommend this place to anyone wanting good and authentic Korean cuisine!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "ijpyMqj7wOlEbCnQbNxIOA"
  },
  "4IaDerOVQDBR6kO-o0gDwQ": {
    "date": "2/7/2017",
    "text": "This is my third time coming since it opened two years ago. The first time I came was when the place first opened, and I was a little disappointed with the food and service. I attributed it to the fact that the restaurant was newly opened. The second time I came was a year later, thinking the restaurant might have become more stable. I was wrong. The food was okay, but the service was terrible. My friend and I waited for thirty minutes to order, the small dishes were not fresh that night, and we waited another hour for our food to arrive. I told myself I would never come here again.  A year later (now), I came again because my friends wanted to go. I thought, one last try. This time, I got the Golbi Tong ($16.99), which is really similar to Chinese daikon soup! The taste of the food is good, and the portion size of the Golbi Tong is large because it is soup based. The meat wasn't completely cut into slices and was still held together though. The beef should also have been cooked in the broth longer for it to have softened more. But on food otherwise, it was decent. The small eats this time were fresh and well marinated, quite unlike my experience previously. The service is still a little slow, but the lady is also a little more friendly than I remembered her to be. It's good to see improvement. I might just come here again in the near future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JHBq20vGYkkDUPt4dZxLKA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Left: Ddukbaegi Bolgogi ($16.99), Top: Ddukbokki ($9.99), Bottom-right: Golbi Tong ($16.99)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JHBq20vGYkkDUPt4dZxLKA/o.jpg"
      },
      {
        "img_id": "jvp7ssWWSTL5hELLcGZNAQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Golbi Tong, very much like Chinese daikon soup!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jvp7ssWWSTL5hELLcGZNAQ/o.jpg"
      },
      {
        "img_id": "MJ3_eexVKFt-gcYJ5isPuQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Ddukbokki ($9.99)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MJ3_eexVKFt-gcYJ5isPuQ/o.jpg"
      }
    ],
    "user_id": "3bs5yS7O7262QcARGfGU8Q"
  },
  "4BwNq_vUtseK525qNqaY2A": {
    "date": "5/8/2018",
    "text": "The dumplings were good, the bulgogi wasn't too shabby, but the service was bizarre.  The food arrived quickly but the hostess/waitress stared at me to the point I had to ask what was wrong.  She continued to stare at me until it made my husband uncomfortable, and then after we ate my husband went to the restroom and she stared at me the entire time has was in the restroom (maybe 3 minutes) and then said you aren't from here.  I have never felt so odd during a meal.  I won't be returning.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "21r9_26PoEqudZdSg2lSDg"
  },
  "IRu9R84Xl9FLtj6vrOuaMA": {
    "date": "11/21/2015",
    "text": "My last review was during their initial opening, but I don't think things have gotten any better though I've been back 4,5 times. I've wavered between 2/3 stars because the food simply isn't that good, and there's a lack of competition.   They do now offer Korean-Chinese, and I ordered take out of Tang Soo Yuk today. The dish was placed in a styrofoam container WITH the sauce, so the fried pork was soggy. The sauce spilled outside the container so bringing it back was nerve-wracking because I didn't want the sauce to spill. Other than that situation, the sauce was pretty tangy, and I enjoyed that. The amount of pork was really, really small compared to the price, and the only veggies were onions and some slivers of red pepper- disappointing. I was looking for carrots, some green veggies, but nothing.   The Soon Dubu was still a little bland, and therefore I won't be ordering it again if I go back. Banchans definitely got worse since their opening- some broccoli, kimchi, and fishcake.  Overall, this review was pretty negative coming from a Korean, but I was disappointed. I do enjoy their Pajeon and Boodae Jjigae, but this experience put a damper on this place for me.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "N7NnC6-q0O-Gq2n_7YJkNg"
  },
  "TzhlIrz2i0gdLmxAuKpbBw": {
    "date": "11/15/2017",
    "text": "I love the soondubu! Their ddeokbokki wasn't as great, but the bulgogi is flavorful. Everything comes with sides as good Korean restaurants do (like Kimchi, etc). It is a little overpriced ibn my opinion. It's a small place and there isn't a ton of seating so it might be tough for large parties here. Street parking can be hard out front, but I've gotten away with parking at Giant Eagle right next to it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zw_V_Hd-2bDCymvfII-8uQ"
  },
  "G31oSUp7RRKTNNK6SsENig": {
    "date": "11/7/2016",
    "text": "Move over Korea Garden (KG), there's a new garden in town. As much I like Korea Garden - we decided to skip and try Nak Won Garden. This place is 1.small (smaller than KG) 2. BYOB and 3. Doesn't take RSVP. When we got there, the place was packed but was told it would take about 15 minutes before we can be seated. It eventually took a little more than 30 minutes. But unlike KG, they had more than 1 server :) which was definitely a plus.  Once seated down it only take about few minutes before we were served with water and a beer opener. We placed our order and voila we got our food in no time.  We ordered the pan cakes, Dukbokki, Rabboki, Bibimbap, Pork Bulgogi and my all time fav.Octopus Bulgogi. They were all really good and reasonably priced. Depending on your taste bud - if you are a first timer - the safest bet is to go with some sort of Bulgogi IMO.  Would highly recommend this place.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3stoOi_xp7gTeU0K1ywazQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Bibimbap",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3stoOi_xp7gTeU0K1ywazQ/o.jpg"
      },
      {
        "img_id": "CtYeTWf9fLfiVXWgu1Bn2w",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Pancake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CtYeTWf9fLfiVXWgu1Bn2w/o.jpg"
      },
      {
        "img_id": "EjGYCC75bvMFCRHJgDGmlw",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Bulgogi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EjGYCC75bvMFCRHJgDGmlw/o.jpg"
      }
    ],
    "user_id": "fBO-AauqOjPX2UBp9RgeQQ"
  },
  "rk1SW-XcBzpclpPtXfvuTg": {
    "date": "2/20/2018",
    "text": "I came here for the first time the other day with my friend. It was pretty quiet when we arrived so we were quickly seated and served tea. We split dumplings as an appetizer before getting our main dishes. I ordered Bibimbap (mixed rice) which is essentially meat, an egg, and a bunch of vegetables that you mix with rice and a side of Miso soup. My friend got the Gulbi-gui (Pan fried yellow Croaker) with side of rice. You also get all the traditional banchan or side dishes like kimchi and bean sprouts. Our host was very nice and joked with us and even practiced Korean with me. I did feel a bit rushed out when she placed our check on our table before we had finished eating and the place wasn't even full! Overall, it was a good experience, though I found their food on the pricier side.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e6yeOGukUlN7CfKSR2w2zQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e6yeOGukUlN7CfKSR2w2zQ/o.jpg"
      },
      {
        "img_id": "q_tn-Hts6dmmiS2bwJolfQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q_tn-Hts6dmmiS2bwJolfQ/o.jpg"
      }
    ],
    "user_id": "81G2qsHbnoxMQDSh6rdjRA"
  },
  "NYtd6Xh2oizcAsDKC77MrQ": {
    "date": "8/29/2018",
    "text": "One of the best Korean places in Shittsburgh. We came here with 9 people and they served us very nicely and efficiently. Their beef was very tender and juicy, went well with rice and other sides. Spicy seafood udon and pancakes were also some of their best dishes. My friends from Korea also like this place, and the owners are Korean so it is authentic. Pricy in comparison to other places around and even compared to the Bay area, but very worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zcj2B3_rAi-zr8PN9teJ2A"
  },
  "PjFeYh3IdEaRkF55x9hG9A": {
    "date": "8/8/2018",
    "text": "The food is ok but expensive. The worst part is the waitress. She never fills up water only if you ask her to. Besides, she stared at us when we wrote the tips. To sum up, it is very uncomfortable to eat here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k3EmXl_Hktuwgu6aSmFvCQ"
  },
  "q8YEpEVGc3T_nNQIBrvaPA": {
    "date": "6/28/2016",
    "text": "I was very satisfied with my meal (VERY VERY) and very happy afterwards. I freaked out when I saw they had DDEOKBOKKI (one of my favs, but since its a street food in korea, many restaurants tend to not have it on the menu *tear), basically just ordered that. It was amazing. Like more amazing than korean mom ddeokbokki, and Korea Garden by far. The bro got bibimbap (not dolsot because it was way too hot out), and he was also satisfied.  And not sure what kind of rice Korean restaurants use, but its literally amazing... howwwwwww Restaurant feel is very homey. Its probably a mom/pop restaurant, because only older ladies are ever out/about serving. Service was fine, nothing special but they were very polite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 10,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "lZ0fSghv6Lny5bCjHI7oKw",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. bibimbap",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lZ0fSghv6Lny5bCjHI7oKw/o.jpg"
      },
      {
        "img_id": "-jbcPpPxeFdameZdpxn00Q",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. ddeokbokki  Best in Pittsburgh",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-jbcPpPxeFdameZdpxn00Q/o.jpg"
      }
    ],
    "user_id": "42aIqqLHAJeQRMVwZKcFdA"
  },
  "wsqYepwtEzEHDOGAhC9aOw": {
    "date": "9/9/2016",
    "text": "Tastes so good but portions are tiny!  I've sat in before and compared to now, when I got take out, the portions are even tinier! I literally counted 21 rice cake pieces in the take out box for $11.   I've ordered dokkbokki, seafood pancake, and seafood tofu soup.  Seafood tofu soup is probably the most worth it. It tastes so good- very savory- and well worth the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lYYEQ86VUMPqnRhqm6FvIw"
  },
  "z0qvijkjrL_bflIPcPLc3g": {
    "date": "4/29/2019",
    "text": "Was craving Asian food and found this place nearby.   Soon Tofu (4/5): pretty good, got the seafood flavor.  Mandu (4/5): solid dumpling appetizer.  Neng Myun (4/5): if you like cold noodles this hits the spot.  Overall pretty good Korean food for Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 6
    },
    "photos": [],
    "user_id": "txu_KwZOGYG6O3yYHjztbg"
  },
  "y0JCVxRyCGxn8WrAeufEpw": {
    "date": "3/31/2019",
    "text": "If you're looking for the best Korean food in Pittsburgh, look no further. The soondubu (tofu soup) and kalbi tang (short rib soup) are delicious, the mandoo (dumplings) and seafood pajun (pancake) are pretty good as well. I wasn't a big fan of the tteokbokki (spicy rice cake), for some reason the sauce didn't taste as good as the ones I've had in NY.  The only downside is the pricing as you'll probably be spending between $15 - $20 on a meal for two. But then again, there aren't really many other places within 50 - 100 miles where you can get as authentic korean food. (Some ppl like Green Pepper but I would recommend skipping it if I were you).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7MW4pEkiqRvSwWIj8XwCog"
  },
  "k0E0_B75gneTGIi4eTQ4gQ": {
    "date": "9/6/2019",
    "text": "Celebrated at this Center Avenue gem. The service is excellent and the atmosphere is cozy and clean. We started with steamed dumplings and a huge veggie pancake. Both set the stage for what was to come. Our table exploded with tastes of kimchee - 8 different kinds from traditional spicy cabbage to eggs to a sweet potato. So good. We brought our own beer and wine. The sizzling platers of meats, lettuce to wrap in and dipping sauce were a banquet and tasted great. Enough left overs for another meal. The owners even made us little good luck bundles of love and as a special treat gave us a cute little yogurt shot as a after dinner palette cleanse. So good, affordable and most important filled with love and care. Yum! I brought my own reusable metal straw and they provided the metal chop sticks. I will be returning soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UetOIhAdPBkGjm_o-mSC3Q"
  },
  "11Ewn542be_j8KSrSwdfcg": {
    "date": "6/1/2019",
    "text": "Don't get me wrong their food is decent. Other then their chicken wings not being as crispy as we'd like them to be which was our fault for not asking for them extra crispy, the biggest complaint is their value, the food here seems to be pretty overpriced for what it is, I paid $20 for a chicken noodle stir fry dish which at most places ranges between $11-15, however the noodles did taste pretty good and were fresh. The other items we had included fried dumplings and chicken wings. The dumplings were pretty good just just ordinary. The chicken wings, again, were not as crispy as we'd like but the flavor of the fish sauce wings was pretty good! I am happy I tried this place and I don't regret coming here but I would just like to see more value to their menu. If you enjoy Korean food you should defiantly come here, just don't be surprised by the prices.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bkp-hKHz2_PyEPNK93kGSQ"
  },
  "FDSYqp_hRpOC6nF8SDrFPA": {
    "date": "8/27/2019",
    "text": "This was a great find! The food was spot-on and the portions were generous. I ordered the Dubu Kimchee and a seafood pancake, my wife ordered the Dulsol Bibembop. The banchan were flavorful: kimchee, broccoli, bean sprouts, potatoes and a delectable eggplant. They even had Perilla leaves! The one downside is they don't serve alcohol. I would've loved a chilled bottle of soju or a beer to complement the meal but alas, no liquor license. I'd recommend this place if you're looking for decent Korean food at reasonable prices. I'll be going back the next time I'm in Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-OMQbuHTE701-ylP2klAaw"
  },
  "Sx7JIwnWmXgGmyVplFEZ0A": {
    "date": "6/22/2018",
    "text": "I was really craving soondubu(tofu soup). I'm staying in downtown and this place is definitely worth the trek to shady side hahaha.   I'm from California so my expectations weren't high.... but to my surprise the soondubu was spicy! I loved it. It was flavorful.   The woman working was so sweet to us. I have really long hair and she just started braiding it.... hahaha some people might be weirded out but we thought she was so sweet. She told us her favorite parts of the city and had a nice convo(wasn't too busy around 4pm).   I recommend this lil gem. It's definitely authentic korean food in my opinion ;)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "b7wrLsvOUQ6rSy1m1urcXg",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b7wrLsvOUQ6rSy1m1urcXg/o.jpg"
      }
    ],
    "user_id": "smantZRbVX66eYVejZxpvQ"
  },
  "zLpDDfVes4QE_I1Fgr8H9Q": {
    "date": "8/31/2018",
    "text": "The waitresses are very friendly and the restaurant is neat and clean. The overall service is pretty good. I was excited for the Galbi ribs although it's quite pricey. However, it's not even worth to pay $35 for just a small dish, and it tasted not even close to the Korean style Galbi. Very disappointed...   I think other dishes should be just fine. But I don't think I recommend this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iJzGDWfnLp5YngkiZfRzww",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Galbi rib. Really expensive and tasted ugh",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iJzGDWfnLp5YngkiZfRzww/o.jpg"
      }
    ],
    "user_id": "Bz9Hddcu2Hu0h3FArKfDGQ"
  },
  "gRRtltPncgVGUPlPGtEHXg": {
    "date": "9/28/2018",
    "text": "Everything was fantastic, the waitress was so helpful and easy-going. I really felt like I was eating in a really inviting Korean family's kitchen!  The kimchi scallion pancake we started out with was fantastic, it came out within minutes of being ordered, and for that matter all of the food came out really well timed. I had the chicken bulgogi and my dining partner had a big soup with beef in it. Both of the entrees and the appetizer were amazing.  My chicken bulgogi came with lettuce leaves to wrap everything up and a bunch of really small side dishes: spicy pickled cucumbers, kimchi, a marinated kale, sesame oil marinated sprouts, and marinated blanched potatoes. Hands-down the best part of my meal besides the chicken itself, was the onion salad with sesame ginger dressing: they blanched the finely sliced onions so that they weren't spicy or aggressive- honestly one of the most refreshing things I've ever eaten.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "v7vs2Aa1nzyruEWu2K0cPg",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v7vs2Aa1nzyruEWu2K0cPg/o.jpg"
      },
      {
        "img_id": "RyPitGw3IdfrbKCdBd14Nw",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RyPitGw3IdfrbKCdBd14Nw/o.jpg"
      },
      {
        "img_id": "eQUNGoC1d_UC77B4m0La2g",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eQUNGoC1d_UC77B4m0La2g/o.jpg"
      }
    ],
    "user_id": "ub62tDwXuUiS6cDiWPHCNw"
  },
  "wFw3TBzPH51Be2mSb8Lsfw": {
    "date": "8/1/2018",
    "text": "I'll start off by saying the food was great! I went with my friends who are from Korea because they really missed Korean food. Keep in mind, we went during the winter, so it's been some time since.  When we were paying, we were having trouble splitting the bill because some of us ate more than others. But we were being rushed so we just threw one of my cards down and decided to figure it out later. When we were about to leave, the woman serving us pushed the tab back in front of my friend and demanded a better tip. I was shocked because I was sure we left 18%. It not like we made a lot of demands or needed a lot of service so I thought it was plenty. But she kept angrily insisting, and I was shocked because I never experienced anything like that. We just scribbled it out and added more just to get out of there.  The food was good but I don't really want to go back. Maybe she was having a bad day, or misunderstood us, but it was a really uncomfortable experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KbEOcyXkennwbu4_h5wfeA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KbEOcyXkennwbu4_h5wfeA/o.jpg"
      },
      {
        "img_id": "6_bjK-Jai_IRvc0ON0qrnA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6_bjK-Jai_IRvc0ON0qrnA/o.jpg"
      }
    ],
    "user_id": "F4RJm0DeBGd_wWO8WeCKHw"
  },
  "IvqkgXWlxD19L3up20Y8JA": {
    "date": "6/24/2019",
    "text": "If I have a friend or family visiting, I would definitely recommend this place for quality Korean food. I was initially taken aback by the high prices but ended up settling with the Mandoo dumplings. The portions are very large so I would say it's worth the prices. The ingredients were fresh and the dumplings were delicious. The soup was not as spicy or flavorful as I normally like, but they give you hot sauce and a lot of extra toppings. The staff was very friendly and it felt like one of the few authentic Korean restaurants that you won't find elsewhere In Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S5_4G4O6_1Cev_4Mxx0prw"
  },
  "S5d3ED8sJx3CQBmKnNBCsQ": {
    "date": "11/30/2018",
    "text": "Not as good as recommended. Price is high, food is not that tasty but with okay portion. The restaurant owner was pushy when we tried to figure out the menu. The general feeling of eating experience here is not satisfied. Won't come back again.  This place is not recommended in terms of service, tasty food, and price consideration.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "KPESRvj4_Zmw4SZ0ITxK7g"
  },
  "KD8EkqgE4Z61GECPyXNPGA": {
    "date": "1/6/2019",
    "text": "Ate there for the first time. I've been to Korean restaurants in other cities so I knew what to expect. It was not fancy but it was clean and service was very helpful and friendly. Beef bibimbop was a nice serving for the price and it was fresh and hot. Kimchi stew was also hot and spicy and good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BYSh-doeVX7Wqo1Ewx5huQ"
  },
  "xmfbAOfVyg1TGrYNrekG7A": {
    "date": "6/19/2018",
    "text": "We stopped by here while we were attending a wedding. I love trying new Korean restaurants. We got an order to go. The lady on the phone was not professional. She could've been nicer I thought. She didn't even ask for my number or name for a pick up. I was little confused. The place itself is very small and I didn't see any private parking. We had to park at the grocery store right next door for a little. Food itself was fine. It was very pricy for what I've got. I've got Korean sushi and Korean rice cake with fish cakes. I know that Korean rice cake is not the hardest thing to make. I wished rice cake was cooked little longer. It was little hard, instead of being chewy. Sushi was fine. Nothing special. They do give you soup and some side dishes. Overall, I would probably go to a different Korean restaurant in Pitts.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uTV0xQBKB9kBDhRNI6SDEQ",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uTV0xQBKB9kBDhRNI6SDEQ/o.jpg"
      }
    ],
    "user_id": "a5Q6X78wxXUblX27YMbJVw"
  },
  "VtowhU6EshjXf0DUdzjqcA": {
    "date": "8/15/2018",
    "text": "Excellent fresh veggies & great combinations. The staff was friendly & the food came quickly. The prices are a little high, but if you are craving Korean food you will love their Bibimbap.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IlhKMdwuMW7axRf9HF-SgA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Hot sauce. Do not mistake this for ketchup at your own peril. But if you like spicy, this is an excellent compliment to the meal.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IlhKMdwuMW7axRf9HF-SgA/o.jpg"
      },
      {
        "img_id": "xvJIfvApFnxALs38RN2QMg",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Traditional Korean Bibimbap with tofu served in a hot bowl with kimchi, potato, pickled bean-sprouts, &amp;amp; peppers with sardines--delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xvJIfvApFnxALs38RN2QMg/o.jpg"
      },
      {
        "img_id": "akA1WttvW2tE8qfUn82Pgg",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Miso Soup served with any rice dish",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/akA1WttvW2tE8qfUn82Pgg/o.jpg"
      }
    ],
    "user_id": "SqLdtVqXGkyhJH3IS_BA8g"
  },
  "-cL_scjuMWexOjgO1E8JQw": {
    "date": "6/29/2017",
    "text": "Walked in, was quickly greeted and seated.  I was the only one in the restaurant, which I thought looked clean and like a nice atmosphere.  According to the server, it's best to park at GIANT EAGLE's Parking lot and walk over, that way it's free.  We did so and had no problems.    She got us both water, my guest got a diet coke and it was given in a plastic bottle.  We ordered a bunch of food.  The mentioned good friend of mine speaks Korean and has visited Korea multiple times.  Both he and I agreed that the main-dish-food was very tasty!  Everything we had was pretty good, though we felt their Kimchi was weak and not as strong as we both liked.  We got the traditional stone bimbambop (stir it immediately when it comes out!), seafood pancake, \"unit\" stew hot pot, and a pork noodle dish that was divine, wish I could remember the names and spellings.   Towards the middle of the meal, the server was no where to be found, we couldn't get our waters filled.  When she finally became visible to seat other people who'd just walked in, we got her attention and paid the check.  It was very expensive but we DID get a lot of good food-- seems to be a theme for getting Korean food in this city.    Tip: Lunch is much cheaper than dinner prices!  This place is okay.  I will be back for my Korean food fix.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "R9q3KCz1jRa_w0GHrcR4Sg",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. I was told this is called &amp;#34;unit&amp;#34; stew when translated directly.  It has a slice of american cheese, hotdogs, ramen noodles, mushr., kimchi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/R9q3KCz1jRa_w0GHrcR4Sg/o.jpg"
      }
    ],
    "user_id": "TqnFxFHEOvaGea9Lzn7wqA"
  },
  "--zIqbevDpByLqeG_sAhNg": {
    "date": "11/4/2018",
    "text": "I love this place so much! My boyfriend and I drove all the way down from state college to Pittsburg several times for this amazing restaurant!! The service is nice, food is extremely delicious, and the price is ok. In some ways, i feel it is cheaper than some Korean restaurants in US.   Highly recommend it!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P9BsAa9qPTyS67ERaA1Rrg",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P9BsAa9qPTyS67ERaA1Rrg/o.jpg"
      },
      {
        "img_id": "ogAzMWDsR-kGxUsCx6qqTA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Sundae-Korean sausage",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ogAzMWDsR-kGxUsCx6qqTA/o.jpg"
      }
    ],
    "user_id": "ezrhKG8_BCpFqb5y7atY4A"
  },
  "N2q2zjUrQp50nkwpNdWYpA": {
    "date": "6/13/2018",
    "text": "Ok, so I am African American BUT I love Korean food, people, music and KDRAMA!!!  I order BiBimBap. My niece is half Korean and her dad makes it all the time.  The people at this restaurant after being told 10x (no exaggeration) I HAVE A MUSHROOM ALLERGY. The woman repeated me and nodded every time I said it! I get ALL THE WAY HOME (2.8 miles) my food was cold ICE COLD. The BiBimBap I usually get is warm (the meat and the rice) not theirs. I took the food back! She really checked the food to make sure the meat was there! Who pays $14 to take just meat off! Then she called me \"baegchi\" translation IDIOT!!!! I watch enough Kdrama and Listen to the music I am starting to learn the language. I didn't let her know I knew what she said but all I can say after all this is THEY ARE SOOOOOOO RUDE BEYOND RUDE AND I WILL MAKE MY OWN BIBIMBAP FROM NOW ON!!!!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "nCIgkXNs7JxJmSQAftGKyw"
  },
  "t_-A-1CKhX-zzEEmQaBjTA": {
    "date": "1/14/2019",
    "text": "You can have good home style Korean foods. Their kimuchi are very good. I like spicy seafood noodle.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cAtMmGkdfMJvSRveJsijLA"
  },
  "CPwbgkMm2qsaGLHD-FQXzA": {
    "date": "2/5/2019",
    "text": "I will say that this place is good if you reallllyyyyy crave Korean food, but I feel like the price is too high for its quality. For example, i paid the same for a plate of Galbi here and in NYC Ktown, and honestly the korean food in nyc tastes better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lYWdikyVwrx3bMp_83paYA"
  },
  "8rca2MJvvY9GFfuy0jOFfQ": {
    "date": "4/20/2019",
    "text": "I've eaten a lot of Korean, overseas, at authentic restaurants catering to mostly Korean clientele; one of my close friends is Korean and lives in Seoul; she introduced me to kimchi made by her mom. So Korean food fast became one of my favorite types--and you can't beat the dining experience of a good Korean restaurant: you go, get an unlimited assortment of tasty starters (upon request--often by pressing a button built into the table), and then you get your mains that are reliably good (kimchi soup, bibimbap with lamb, or at some places bbq with an adjustable smoke fan above the table). I went here expecting something decent, at least, knowing that Pittsburgh isn't known for its Asian food. I was at first excited when I came in; the place smelt somewhat badly of fish from the kitchen, which to me was a good sign; it suggested authentic cooking; and at the far end, there were two groups of Korean students eating hotpot of sorts, with platters piled high with veggies; they were all carrying on in good ways, so that made me even more hopeful. My wife and I ordered Bibimbap and Kimchi Soup. While waiting for our meals, I kept looking over my shoulder for the starters; they didn't come; then I saw the waitress put a little platter with a few starters on it next to the kitchen stall; that was odd--usually you get starters promptly and before your mains. They then served the starters _with_ our mains, the latter coming out so fast that I thought--that's a bad sign. Even for comparatively easy-to-prepare dishes like bibimbap and kimchi soup, you don't expect them to come out in five minutes (when the place was mostly empty, by restaurant standards). Apparently, there's differential treatment for westerners vs. Koreans. The sides were few and small-portioned, and when we stacked up the platters, after eating what little there was, they didn't refill them. I complained about the kimchi soup because it was 80% tofu (I expect a lot of kimchi, naturally, in a kimchi soup), and the bibimbap was not at all filling and hadn't hardly any meat. It was, let's be frank, lazily made. The flavor of the kimchi soup wasn't bad, but it was a bit watered down. So if you expect truly good Korean food, I would advise against going here; you'll neither get a plethora of tasty starters, starter refills, nor a filling, well-prepared meal (unless, that is--at least apparently--you're rich Korean students who don't care about spending $25+ on two meals that amount to one).",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5Fy-ZZFjGmV41uzI7vvsgg"
  },
  "_bRnU2ihzsdoGRj2vJyH6Q": {
    "date": "3/25/2015",
    "text": "We came in on a Saturday night, the place was packed but after 25 minutes or so we were seated. Right away our waitress offered us hot tea and gave us menus. My husband ordered the LA Galbi and I ordered dosolt bibimbap. When my husband's dish came out we were surprised at the small potion of meat. I remember saying, \"18 bucks for that?\". The meat was chewy and the marinade was not as flavorful as we hoped. My bibimbap was good and I enjoyed it, I have found that no matter where you go, you can't go wrong with ordering bibimbap. When our bill came out we were surprised when we saw that we were being charged 29.99 for the galbi!! We were sure we had seen 17.99. When we asked our waitress she quickly apologized and said we had been served the large portion. Problem was that when our order was taken we were never informed there was a small and large portion. The large portion is not listed on the same page, it's on either the next page or one after that. If we had seen that we would have specified. It was their mistake and they were very apologetic but I can't see us going back. It was just way too expensive. I understand they they are a new restaurant but for the quality and portions it's just not worth it for us to pay that much.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Ra43bbUQNYkBCOUQtxYnA"
  },
  "PBQQC-AjSt0nhs0fXqvP6Q": {
    "date": "5/6/2015",
    "text": "What a terrible restaurant! This is literally the first time I complained a restaurant on yelp. I ordered a beef stew for take-out. When I got back home,take out the food, the stew looks like left-over from someone else. It only covered 1/3 of the the box. Even worse, there's no beef at all!!! There were very tiny and not fresh shrimps instead. More importantly, it even didn't taste good. The rice was only a bite!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q_7bEAEFLrHZC_jUmFIK6A"
  },
  "UUMHfaT83JOrNZ4QPHKL-A": {
    "date": "2/4/2015",
    "text": "I've been looking for good Korean since Dasonii shut down last year.  I prefer the Tofu Stew and it is delicious and filling. My friends tried the bulgogi and they loved it. This is the best Korean food you can get in Pittsburgh and the price isn't that bad.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I9u5KEMToitFh1aKL4bblg"
  },
  "ookH66ZiShQwwgBMCX3qRw": {
    "date": "1/27/2015",
    "text": "Finally!! Nak Won Garden is exactly what I have been craving in this area for the past 4.5 years.  I wish it opened sooner as I am moving away from Pittsburgh this summer.  The food is authentic and delicious, prices are reasonable for Korean food, and the service is fantastic.  We had the haemul pajeon (seafood pancake), soondubu (spicy soft tofu stew), and wooguhji galbi tang (spicy short rib stew).  Of course, there was plenty of yummy banchan.  Oh, it's BYOB!  The restaurant is small and busy despite only being opened for a few months, so you may have to wait a bit (they get the food out quick though, so their turn around time is pretty good).  The owner is very friendly and told us that opening this restaurant and serving home-cooked Korean meals was her dream. She achieved her vision perfectly.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "hx9kNcrl_z2R8adn2ssrHw"
  },
  "1jLtu-gENOzo7351ntmOiQ": {
    "date": "1/28/2016",
    "text": "I never write reviews but this was one legit meal. The carpaccio was to die for and the service was outstanding. I will definitely be going back soon!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZHTtAM_0mvg37oQBTuApoQ"
  },
  "3XIu1In54GozzMvzx175DA": {
    "date": "1/28/2016",
    "text": "Great food and atmosphere. The pork belly was delicious. Living in Squirrel Hill/Shadyside there are so many options but this one is the best. My wife and I eat here often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jXHvtV_adoA4OzAjbIsDrw"
  },
  "qJZTjqhEkW7goG45cewodA": {
    "date": "11/11/2014",
    "text": "Grand openings are always tricky. I expected the service to be either on top of their game or a little messy. Unfortunately it was the latter and I'd give this place another shot in the future to redeem themselves. Despite the waitresses being all over the place, they were all very friendly.  The food was good. Coming from LA, expectations are always high, but since I'm not a picky eater, I try to be unbiased and considering all that, the food won't blow your mind but it's better than decent.   Food is pricey but that's anywhere outside of LA, especially Pittsburgh with the scarcity of Korean restaurants. Expect your cheapest dish to be $10.   (Time never plays a role in my ratings unless the wait is absurd. Back in the day, restaurants took about 30 minutes to serve the food and that was standard and people were okay with that. That being said, food here took around 30 minutes. If that's too long for you, don't eat here and then complain)  Congrats on opening. Hope you'll be a little more organized next time I come!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "vaLlOKH-f_XNmtIcrYo6kA"
  },
  "YRHrhyrhUOXXEcsNNDSJtQ": {
    "date": "4/5/2015",
    "text": "We went to the restaurant about two months ago when it just opened. LOVE the food.  So we went again recently. I heard that they change the chef so I wanted to see if there was any difference. The food was still delicious. We ordered seafood pancake, small BBQ combo (very good value!), spicy rice cake. They were all well prepared!  I think we got good service there overall! The lady cooked for us was very helpful. She showed us how to eat the BBQ properly.   However, the receptionist was very rude and showed no respect to the customers. She was not professional at all. She told us that she could only seat us when everyone in our party was there. But she seated other group even though they were still waiting for other friends to arrive. Anyway, we did not have a good experience with her.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "INvF7MlUg4rGpuDLVuAx_w"
  },
  "S2edQuSyc9jmwhueWw0Dsw": {
    "date": "9/8/2015",
    "text": "The bibambap is just normal. But the pork belly with a special sour&sweet sauce with onion tastes so special!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CmEbyZrj_3EHpBAIyAck6Q"
  },
  "IZwsbpHRoixnQUOg_1gwww": {
    "date": "11/21/2015",
    "text": "The hot stone rice(?not sure about its name) I had was just so so, not as good as the one in college in my hometown. Service was nice and staffs were friendly and helpful.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "et4UIX9lhXl9AcSQ6RRR3w"
  },
  "FGolXtu7ZLAD23VhBrC7eA": {
    "date": "2/10/2015",
    "text": "Not many Korean options in town. This is the best place I've tried yet. Coming from NYC I'm a bit spoiled.   Prices were reasonable. Looking forward to coming more often.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YtXjPReUGS9kVoAWIeHA2Q"
  },
  "kJsbaWL3jqRfFyVK-1smGw": {
    "date": "3/13/2015",
    "text": "Five star definitely! The first time we went there I decided that this place would be a regular for me. My friend had spicy beef and tofu stew which was really spicy and perfect! I tried it too and fell in love with the authentic dish in the first sip! I've had same dish in green pepper, Korean Garden and so many nice Korean restaurants in Beijing. Yet the soondubu here is one of the best. I ordered beef with scallions. It was in a spicy broth and very good, too. We also ordered a pork belly stir and it was OK, a little too sweet for me. But generally this small eatery next to giant eagle left a great impression with spicy authentic Korean food. Today it's been wet Nd raining the entire afternoon and I skipped lunch so I was starving at around five. Me and my friend decided to visit here again. This time we ordered a family size casserole and a soondubu. We ate them all up. I can't even think of a word to even begin to describe just how amazing the casserole is! The stuff in the hot pot is actually quite normal and commonly used in other Korean joints: ramen, kimchee, ham, pork belly and some mushrooms. But the soup which is spicy and tasty and has the refreshing pickled flavor of the kimchee is UNBELIEVABLE! After ten min of boiling, the broth became even more flavorful when the mushrooms, ham and scallions melt in. Lovely dinner friendly waitress and nice service! Here we go, five stars!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j2nqU557Xcxdr4HKKBWlhA",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. First time in Nak Won!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j2nqU557Xcxdr4HKKBWlhA/o.jpg"
      },
      {
        "img_id": "s7pOz66K_6FgrumrH0Ayow",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. Beef with scallions! Hmmm yumm!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/s7pOz66K_6FgrumrH0Ayow/o.jpg"
      },
      {
        "img_id": "a5jMiK0cbrptDMCwW5l8mg",
        "caption": "Photo of Nak Won Garden - Pittsburgh, PA, United States. The pork belly stir we ordered last time. Good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/a5jMiK0cbrptDMCwW5l8mg/o.jpg"
      }
    ],
    "user_id": "d2M2Aflh5G9nSQGr8K5YLw"
  },
  "amZESDelzDJ2fiulTWjjxA": {
    "date": "1/19/2015",
    "text": "I've just been once, but its going to be on my regular rotation for sure. I stopped in a late lunch, about 3 PM. It was full but clearing out so I was seated right away, and quickly decided on a beef tripe stew.  Now, I have to say I have an unusual obsession with Korean food, and an equally abnormal love for offal. So when I saw a jjigae I had never tried, and it had innards in it - I had to go for it! And it was good. When I want something hot and bubbly on a cold day, soondubu will probably always be my automatic craving, but it was nice to change it up for once.  Even better, when I was getting to the bottom of my bowl, the owner came around with a small portion of something for me to try. Budae jjigae! It is one of my favorites, and I hardly ever find it on a restaurant menu. She told me they are going to have a new menu, and that is going to be available.  The banchan were good too. Sometimes when I go alone restaurants will either go overboard and give me enough for a family, or dedide to give me a sliver of kimchi, thinking I probably won't eat it anyways. Here I got enough that I had plenty of variety, and something to cool me off between spicy sips of broth, but not so much I felt like I was wasting it.  I can't wait to get a group of friends together to come back and try the bbq one night. Though I'm betting it gets pretty packed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hZEJi7bB583wVzqsagNbuw"
  },
  "OzlzoOguPnci0XkLjKGg8A": {
    "date": "5/11/2016",
    "text": "Going to try not to be too harsh, since I did have some good meals here in the past when I came with Korean friends. However it's not clear to me what exactly happened to this place in the past several months, but Nakwon garden's service and food quality seem to have taken a huge plunge. I can deal with sub-par service, that's fine, however the food on the other hand is not acceptable given the prices they charge. The other day I was served chicken bulgogi. The meat was obviously frozen machine cut chicken you would expect from a budget Chinese broccoli chicken meal take-out you can get for $5, except this was for $18. The portions were also half the size compared to my last visit. What's the deal Nakwon? I'm sure there must be a reason for this plunge in quality, however if you can't keep up your quality, you might as well half all the prices on your menu or just shut the place down and move on because it's only a matter of time another another Korean restaurant opens up in Pittsburgh to challenge your monopoly.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Ryf6RT2c-t3XgQquzWpNA"
  },
  "oSlRjPV6sVCYTDIDUXLFig": {
    "date": "6/9/2016",
    "text": "Did take our food here. Decent food with fair spice level. Chicken was a bit chewy. Quantity is adequate but found it was a bit overpriced.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0hnfc4XlbDFMs69BaV5YbQ"
  },
  "PGd9InXA0RhnjlqG9dhzdQ": {
    "date": "2/9/2015",
    "text": "Quite expensive compared with Korean restaurants in the west coast, but the food is not bad.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-SDx-d5jppC4OBBosLVpYw"
  },
  "Xjt4f8eObVx5n152SKE3Mg": {
    "date": "11/24/2014",
    "text": "I like the food but it need some help to do with the service. Waitresses are nice but they are too busy to forget things. The manager need to figure out that problem. It lacks of organization.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kSMqLqQWAElEedTj3h5fgA"
  },
  "NlurrSFKrbcT-RuWE4xOfQ": {
    "date": "4/14/2015",
    "text": "This is the best Korean food I've had anywhere on the planet--and boy does it get crowded. The staff is charming and friendly, so perhaps go outside of peak hours when they're more relaxed. Not a ton of seating so not the best for big groups.  Wonderfully-marinated galbi, hot super-crunchy bibimbap, deeply flavored yukgaejang, bright and rich soybean stew, extraordinary jap chae.   Absolutely stellar food, very highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YiSgk1SyXgSHG2hOfLYAQg"
  },
  "RVBXf-lKW5PLDoAbvdCP7w": {
    "date": "10/30/2015",
    "text": "I am a fan of Korean food, and I have to say that this is the best Korean restaurant in Pittsburgh. I have been Korean Garden, Green Pepper and Sushi Kim. As for me, Nak Won Garden is the best.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cDDKq3yLgDKK7s5mCuSIwQ"
  },
  "lmMaSKYlB5ZdI8nEt2fzyg": {
    "date": "1/16/2015",
    "text": "We had dinner at this place when it opened. Absolutely fantastic. Service was great, food was killer. The friends I went to dinner with were new to Korean food, and the staff was very helpful in describing and suggesting dishes .The place is smaller, which I really dig. It's an intimate little setting with an open kitchen. The smells are amazing, it's a family atmosphere, and I left incredibly satisfied. Portions are large, and easily shared. Prices are good. For Asian in Pittsburgh- it's legit. Def a gem. Go early, it fills up quick.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a1h2P-yLquiVwZlwxl-8aQ"
  },
  "abw4xrBey7SHV61xh0Tcsg": {
    "date": "12/14/2014",
    "text": "Liers!!!  The food quality in this restaurant is above average but it has really bad attitude. It closes at 8:00pm at Sunday night. We had 4 people and called them at about 6:40pm. They said that they stop accepting customers at 7:30 and we should be fine. We arrived at 7:15. But they said that they decided to close the kitchen early and kicked us out.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BlzG-H2IVJgWZDTJdnHsug"
  },
  "TqjCz_jxFOviR-oaldYfFA": {
    "date": "2/19/2016",
    "text": "I had ordered with Nak Won Garden before and it was great. Today, it was not....I first attempted to order food for pick-up and asked about their best beef broth. The receptionist told me that I could just come in person to make an order because there were not many customers. I called back and asked for steamed dumplings and japchae. I arrived to pick it up and noticed the package to be lighter than usual. I arrived home and there are the dumplings but no side dishes and the japchae does not have a single portion of meat (it's only veggies). Taste good but a bit surprised for what I would expect from a Korean restaurant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d_Nk1Tbri2bOe5rHfWm_Sw"
  },
  "9MconSdnh7DxdGQrBsT2jg": {
    "date": "11/28/2015",
    "text": "I went here twice with different friends. None of them said the food was impressive. The price of bulgogi is little higher than we expected.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7WnWiZSVw8ZcoWnb-wCsBQ"
  }
}