{
  "lLGJAqj7cn5aophiZnV61A": {
    "date": "8/17/2014",
    "text": "In town for the Steelers game and found this place for breakfast.  Awesome food prepared perfectly. Would recommend to anyone traveling to Pittsburg. Will definitely eat here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "dYjFCmDZQVaSc_eTBq8VLw"
  },
  "2L7Gxm-K6Pnn59-L702Bzw": {
    "date": "12/24/2016",
    "text": "We loved this place. Our first time in we were treated like regulars. Great little spot that was warm and inviting. Homemade soups were so good we had to take some home. Large portions, hand cut French fries hit the spot. I'm from out of town but have family in Mt. Washington. I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HyNAfXkB8e4tPWxVUKSpNg"
  },
  "L3k7kdJ9nPdkwX-Me1VTjQ": {
    "date": "11/22/2015",
    "text": "I've lived down the street from micro diner for almost 3 years and it keeps getting better. Staff is extremely friendly and welcoming breakfast is awesome. Can't go wrong with the Italian breakfast Sammy, probably the best menu item.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TS3SwfXW5sfOqge0wZcIHA"
  },
  "CtYTrvpvCH0WP6aT0mxBIA": {
    "date": "12/27/2014",
    "text": "I decided to eat here again since my last review and thoroughly enjoyed it.  Glad I did because all of my previous visits were good food and good service. I will continue to enjoy micro diner in future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5f3b2IJeMn7H5xkatviCKg"
  },
  "FIL1JjGzAQYJuTp2bFYmZQ": {
    "date": "11/25/2014",
    "text": "This little diner at the top of Mt Washington was a great find. The service was wonderful, the food was tasty, and the prices were very affordable. I took my family to eat breakfast about 8am on a Monday. It wasn't crowded and a small parking lot is located across the street. I highly recommend this diner for breakfast at an affordable price and good sized portions.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "53gjEF2X6fk2DF9lkK-CDA"
  },
  "KK0eq39v-kDJqLOrS34hVQ": {
    "date": "4/18/2015",
    "text": "Stumbled upon this place today after running a 5k. I gotta say, they impressed me. I'm def a tough critic on breakfasts to begin with, but we devoured everything. The staff was super pleasant. Will def be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CSe3dRei3fAAmfm64vm0pQ"
  },
  "kDwgtPBBaHLKlJYzQmud5w": {
    "date": "8/13/2016",
    "text": "Great staff, excellent food and a fun place for breakfast. Had the daily scramble special with a side of tasty pancakes. Nice up and coming location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-AVs1sETEtR_Bczhk-T2nA"
  },
  "RVVb6YVC3i5vB7WDaDPvGw": {
    "date": "7/5/2014",
    "text": "Great place for a breakfast menu. Great pancakes.  Sandwich menu is generic and so-so.  Very clean and polite staff!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "86M8RPM6g0QFCOLNNfMMjg"
  },
  "Kdil4RgTLMXWz50-QwUd8Q": {
    "date": "7/15/2015",
    "text": "Inexpensive, homemade food without the typical greasy quality of many diners. All the usual suspects on the menu, which is appreciated, along with some unique choices. Our waitress was very attentive even though the place was packed, and our food was ready surprisingly fast. Definitely going back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "69ywjKRFHC_8V_2kOK2d3A"
  },
  "cCQOGWE12DaNIkwehVYZ5g": {
    "date": "3/2/2014",
    "text": "This little place is just perfect.  It gets the job done in a friendly way.  Food  has always hit the spot.  For the Mount,  it's our little piece of Mayberry!  Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lT1K7uqkRnB9aND3UvUx5g"
  },
  "qIhh5pYcgefvI8gsbwxdWg": {
    "date": "2/23/2014",
    "text": "Nice little place serving good breakfast or lunch. Also get to enjoy the cook singing while he prepares your food.  Fun place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FO8hILdACBsZrVDur5x8RA"
  },
  "nIU1_fX9zTuPu1L28ok8sQ": {
    "date": "1/1/2015",
    "text": "Very good! The staffs are friendly. Food is nice. The place is not big, but good to relax and enjoy food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ad4CvYABz99h0RDe9u8WLg"
  },
  "oRvGLge_d32wEmeWFQcBlw": {
    "date": "7/4/2014",
    "text": "Very cute place! The waitress was pretty clueless, however. I specifically told her that I do not eat squash and that I would take the    vegetable as long as it was not squash. The waitress then proceeded to bring out an entire plate of squash. I was also given a very tough steak without a steak knife. But they are BYOB so that's cool!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cRVg3_vORpLkDNDxXW28fQ"
  },
  "Cfbw6NaM6HeU_F27wUay8g": {
    "date": "8/2/2014",
    "text": "Small but confident menu. The fries were outstanding, perhaps only cheesewiz could make them better. Natural cut and crispy. The Ruben was outstanding. The burger was gone before another word was spoken, and the Sirloin Steak wasn't the most tender, but made up with great, well-seasoned taste. I'll definitely be going here again, perhaps to try breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UahJo4_h90meEc8gs4Nf0w"
  },
  "pFny3pYkHUKHWKSUfcBP_A": {
    "date": "7/18/2015",
    "text": "Nice little diner. Quite small but good service and food was good for diner food. Ruben was excellent. Breakfast is great. The fries are the best! Good addition to Mount Washington restaurants for family eating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "acJ5wH7xEzckBP1J8L0dYQ"
  },
  "VEjuypRzxUBmsWQDkqiHZg": {
    "date": "7/24/2013",
    "text": "Had micro diner for the first time absolutely loved it that omelet w the lab sausage was fantastic my wife and I will be back and great service and clean hat what the mount needs thanks guys",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "cCcdEgZJVNcOLD9Fc6HoVg"
  },
  "u4rP4bA41ZHlBFapFoAd0w": {
    "date": "1/14/2013",
    "text": "Needed to try the new place but won't be back. Don't think it will survive long on the mount. Small inside and cold!!!!! Asked specifically if they used Breadworks bread and was told they did, but when I goy my sandwich it was on plain old square bland wheat bread. Very disappointing. Also the pepsi tasted flat and/or diluted. May be a good place to go after bars close and you're so drunk you can't tell what you're eating but I wouldn't recommend it.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "gVmsL-FroEEx5mZSRqEa4Q"
  },
  "kXsr9BqMCkaVscMcol9qrQ": {
    "date": "2/13/2013",
    "text": "I have eaten here twice now.  Today I had eggs and really great potato pancakes.  Last time I really enjoyed the pancakes with syrup...pancakes had a hint of vanilla...very good!  Service was friendly and excellent!  A man at a table across the room had the biggest fish sandwich I have ever seen!  I really like this restaurant and will be back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WOcdhPc9V4ZZ6Ywyp4zO0Q"
  },
  "oah2xrj_P3v7IreFlsCSXA": {
    "date": "10/28/2017",
    "text": "Great little diner in Mount Washington around the corner from the top of the Monongahela Incline. Came here for breakfast on a gloomy rainy Pittsburgh day and were delighted to find a new favorite place to eat in Pittsburgh. Friendly homey little place with great service and terrific homemade food. My husband had a very tasty Italian omelette, stuffed with sausage, mozzarella, peppers and their own marinara sauce. I loved the egg white omelette stuffed with feta and vegetables. Pancakes (Nutella and bananas! Strawberries and cream!) steak omelette and western bagels were wolfed down by my teenaged sons. Next time in Pittsburgh we are coming here for dinner, not Fancy Overpriced Steak House. If the dinners are as good as the breakfast, it will be worth the trek up the unpaved mountain road to get here. Bonus: the view of the city at the end of the street. Stunning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3w0kLKoKfMsm4N2A-j7Rww",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3w0kLKoKfMsm4N2A-j7Rww/o.jpg"
      },
      {
        "img_id": "TSlH4oKhSn8eWLukT5q1dA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TSlH4oKhSn8eWLukT5q1dA/o.jpg"
      },
      {
        "img_id": "A2IHzig2Tec2tFDbs5NSZw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A2IHzig2Tec2tFDbs5NSZw/o.jpg"
      }
    ],
    "user_id": "Wo-XxfMTt8pER9yKyeVtLA"
  },
  "f5wrG_pqq9jDxQBK_cg9zg": {
    "date": "3/24/2017",
    "text": "Spectacular hospitality and VERY fresh food. First time in town and decided to give this place a try. EXCEPTIONAL experience- highly recommend this place. I had the chicken and artichoke pita (with hand cut fries) - super tasty. Check this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "llQFcrNPKUQj7HHkMNcvpA"
  },
  "nNwFSBQWFfctfObY_38yCw": {
    "date": "6/23/2014",
    "text": "While on a weekend trip in the 'Burgh, we ended up on Mt. Washington around brunch time on a Sunday. There seemed to be an endless amount of bars on Shiloh St., but not many establishments open around 10am. I'm generally a fan of diners, and this one ended up meeting my expectations. The breakfast food was your typical eggs, omlettes, breakfast sandwich, pancakes kind of fare, and the food was decently priced. I had a cheese omlette, which came with a side of toast and diced red skin potatoes. I was hoping for hashbrowns, but I'm pro-potato of any kind and they were perfectly prepared. My other half got the basic breakfast (eggs, sausage, toast, potatoes) and an order of pancakes. How do diners get their pancakes so fluffy?? It must be magic, because theirs were perfect.   The decor was minimal and the space was small, but it was clean and unassuming. I liked that the kitchen space was open to view. Also, we must have caught the end of the pre-church rush, as there was only one table for two available. There are probably around 10 tables here, max, so I can see how there might be issues getting a table during a busy time. Our server was really friendly and attentive, and brought me a water with my coffee without me asking! The only negative was that my toast didn't come with any kind of jam/jelly, and there wasn't any on the table. I'm sure I could have asked for some, but I was so full of pancakes that I didn't really need my toast!   This is a great place for breakfast if you end up on Mt. Washington and it's too early for a beer!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "oIY4DR9xqAok3PJJwVnXDw"
  },
  "q7p2yg_yZ6NiAmWThvY0JA": {
    "date": "3/30/2014",
    "text": "Having benefited from a fat federal tax refund late last week, Kay and I were in search of fresh Yelp material this morning. After fooling around with my newfangled iPhone 5C, I managed to find Micro Diner, a relatively new hash-house in Mount Washington I wasn't aware of before. Braving the blustery chill of a seemingly unending Pittsburgh winter, we intrepidly headed to Shiloh Street.   As we entered the small, and therefore accurately-named yellow-walled establishment, we were serenaded by a cook who unashamedly loves his Top 40 pop. Small circular mirrors could be seen hanging, resembling portals into a parallel universe.   The bill of fare is fairly typical for a local diner, and that could be why I'm only going so far in my rating. These types of eateries are becoming as overly commonplace as all the New American pubs and grills that keep appearing throughout the Pittsburgh Area with menus that lean heavily towards obvious, inside-the-box items. Nothing Micro Diner offers is unique, and while that's not to say that the food I had was dull in flavor or execution, I can't say I haven't had it all before.   Take for instance the Italian Sammy. Served between two slabs of white toast, the sandwich consists of spicy, locally-made sausage, over-hard eggs, and a choice of cheese. I don't recall being asked what kind of cheese I wanted, so I was given provolone, which in this instance was appropriate. The meat, made by Labriola Sausage Company in the Strip District, was cooked well enough to remain juicy. I could have had it alone or with some eggs on the side, but having it bookended with bread simply made it portable and quicker to eat.   A side of aptly crisped and overall, properly prepared corned beef officially completed breakfast. Lights. Out.   Wait, what's that you say?   Ahhh, but pancakes are dessert my friends, at least to me. Treats are to be saved for last, and I cannot describe the Nutella Pancakes any other way. The flapjacks were of medium thickness yet maintained a puffy, starchy texture. Tufts of what seemed to be house-made whipped creamed tamed the lethal, hot fudge-like decadence of the Nutella, which melted all over the golden discs. Again, this was something that can be had elsewhere, namely DeLuca's, which makes a similar dish that would frighten away Micro Diner's offering due to its sheer size.   But it made me smile. Hey, that's all that counts in the end, right?  So yes, Micro Diner isn't exactly macro in terms of innovation, but if you need palatable, old-fashioned, unpretentious grub to grease up your tummy after a wild night of prowling about, here ya are.   P.S. The interiors were spotless, and the service was friendly and on point.",
    "rating": 4,
    "rated": {
      "funny": 10,
      "useful": 16,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "VF2PAVvRdGoUR5CE_5JT3w",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Corned beef Hash",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VF2PAVvRdGoUR5CE_5JT3w/o.jpg"
      },
      {
        "img_id": "ReI9mori1t5_bZNXEofOnQ",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. The Italian Sammy (two eggs, Labriola sausage and provolone)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ReI9mori1t5_bZNXEofOnQ/o.jpg"
      },
      {
        "img_id": "koUvcaO8rGjsrv57yY8fGQ",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. interiors",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/koUvcaO8rGjsrv57yY8fGQ/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "QhhJnmjMbo7lOfY4H-EHfQ": {
    "date": "3/22/2017",
    "text": "I'm in Pitt a few times a month for work. I would never consider breakfast anywhere else. This place is exactly what a \"Breakfast joint\" should be. Food, service and the vibe are amazing. Don't miss this hidden gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Yl87qbnVOhmvmwtS9g2jQQ"
  },
  "giHfSL1RonthQLO87Vcxzw": {
    "date": "3/24/2018",
    "text": "This little diner is just perfect. The staff is amazing. They're personable and prompt. The food never disappoints. I have never had a meal I didn't like at the Micro Diner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xdkcH7dBUz-zxx_ZThy23Q"
  },
  "6F4seEq4hzCVoWYJSkhTlw": {
    "date": "7/28/2017",
    "text": "An excellent breakfast/brunch gem! Local Seinfeld like vibe with a throwback personal feel to it. Kitchen is open and cook/chefs are interactive. \"Everyone knows everyone\" kinda experience. I wish more breakfast places were like this. Connie was a delight! Always on top of the coffee refills and running around enjoying and immersing herself in her work. I would definitely recommend repeated visits if possible!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-038R5cSkXqsYl_bVdT3XQ"
  },
  "VLj92sCTUD-FjgXPHR3iSw": {
    "date": "9/10/2017",
    "text": "Gluten free pancakes with strawberries are heaven!!! There's no pic, because I dove in before I thought to take a pic  can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hsZj-KbijKR8r4ytP-iiRQ"
  },
  "sG_G1SlFma8nzYJHRdDOPA": {
    "date": "12/9/2014",
    "text": "I love the food @ Micro Diner. Everything I have gotten here has been delicious. They're food is so fresh, service is great, the food comes out fast & good selection of music on the radio.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wsmaGILhfG2B2xI4j_kQfg",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Cinnamon French toast! So delicious!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wsmaGILhfG2B2xI4j_kQfg/o.jpg"
      },
      {
        "img_id": "yhT0azXBK3E6_zH7i98wBg",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Stuffed French toast with strawberries &amp;amp; cream. Scrambled eggs &amp;amp; fresh cut home fries.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yhT0azXBK3E6_zH7i98wBg/o.jpg"
      }
    ],
    "user_id": "9pbOJFanh66_QnIb5Fjblg"
  },
  "4R63nCV7HkAY0X3C3IVSSg": {
    "date": "8/25/2017",
    "text": "This place is great! The food is exactly what you want in a diner. I had the meatloaf and mashed potatoes. The portion of meatloaf was huge...plenty of leftovers to take home. Very friendly staff, reasonable prices and an easy walk from the Mon incline. I am already thinking about when I can come back :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J1VHFflIqafgfO84yfAMxQ"
  },
  "e0AI-7OLQOL-G8JBYzt62w": {
    "date": "7/14/2017",
    "text": "Bomb. Ass. Food. They keep it too cold. But I'm from Florida so everything up here is too cold. The lack of quick food (it wasn't terrible, we were just damn hungry) was made up for some awesome food. Server was nice enough. But nuts to all that, you go to a restaurant for food and this was dope. Tight work, Micro Diner, tight work.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dPFPM1jeGC_Uo8qByYGmsQ"
  },
  "mBEj8e9A0CRFJrK5cDkZUA": {
    "date": "8/7/2017",
    "text": "The waitstaff was extremely friendly.  They have a great breakfast menu.  My husband loved loved the strawberry cream pancakes.  My kids enjoyed the chicken fingers which were huge.  I would definitely eat there again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oj4d7j7KkQOrcMgnH-RksA"
  },
  "c8Gl3cnF9RRA2J6d58Pbbg": {
    "date": "2/3/2018",
    "text": "Great diner with friendly and prompt wait staff.  We got the Italian omelette with homemade marinara sauce on the side and the classic breakfast sammy.  Both meals were very tasty and extremely filling.  Perfect hangover cure!  Would definitely recommend this place to people looking for a quick and delicious breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xOmt1U4NSUlzAxaLuSuOcg"
  },
  "_LYHt7cWMm9e4dfE6bbi_Q": {
    "date": "4/22/2016",
    "text": "Overall the service was decent and the food was fresh and satisfying. I ordered the French onion soup and it was cheesy but very salty. Cute spot for the neighborhood",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JOows8IozzDDi64jqgwsTg"
  },
  "kJvXJ3RGlgfDFTmQ_zChGQ": {
    "date": "7/10/2017",
    "text": "Visited from England in March and we were blown away by how friendly Pittsburgh was, especially the staff at micro diner.  Our waitress was fantastic and so friendly. Food amazing. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kNrd0lDSc-jf7IhereFukg"
  },
  "E16ALjJ924QIW7x3d-7v5Q": {
    "date": "12/28/2015",
    "text": "This is a great diner. I had the classic burger, cooked medium rare and topped with cheddar cheese. It was delicious. The service was good, helping our whole party of 9.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8d-cDhN_fL_EqyP4pENqow",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Delicious burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8d-cDhN_fL_EqyP4pENqow/o.jpg"
      }
    ],
    "user_id": "BQP1zLw21yuDmGiIheAoyw"
  },
  "w14STFdfTzjblaiafizXNQ": {
    "date": "2/21/2017",
    "text": "Modestly priced joint, good for breakfast, we didn't know it is on a mountain and we had to go steep up hill to reach there. It was just half a mile from our hotel but was very exciting going that distance in an extreme mountain climbing mode. We had a good time at the dinner and discovering the view and the tram from there downward. Eggs sausage french toast pancakes. ...same old and cooked nice",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pGGjauRzSMHQgPfei9eBRg"
  },
  "Yc-eaThPUUT2rXkRckqGnA": {
    "date": "3/20/2017",
    "text": "Went here for brunch and it was a good, basic breakfast. Nothing fancy or pretentious, just a good breakfast. Service was really friendly and my breakfast sandwich had Italian sausage on it, which was a nice change from regular old breakfast sausage. My son had Nutella pancakes and he devoured them and the other son had a Mickey Mouse shaped pancake. He liked it as well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w5oSKFous_6Hem66VP3npw"
  },
  "5UdhgPeLAKAm-er-X8WpJA": {
    "date": "5/4/2017",
    "text": "We tried to get in on Sunday M, too crowded, came back Monday at 9:30, sat right down. Service was excellent, clean & cute diner atmosphere, friendly as can be. Coffee was good, server refilled 4 times. My artichoke, spinach, mozzarella omelette was lacking seasoning, i.e. Salt/pepper and was a little watery. Too bad cause being a vegetarian this sounded swish and was really about the only option for me:-( hubby had basic breakfast with all the meat, potato fixins and said it was great. We will try again next time and maybe I'll stick with basic eggs.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HJ_aArQ7WZQETMdNT__eww"
  },
  "wu0SOP4cNUGm4XFFAaFUNg": {
    "date": "12/27/2016",
    "text": "We stopped here after riding the Incline. The food was great! The service was great! We sat at the counter and talked to the waitress and enjoyed our meals. My son had pancakes, daughter had a hamburger, my husband had a club, and I had a pot roast sandwich. It was all delicious! We talked to the owner about the great old pictures of Pittsburgh on the walls. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2pcIUMb9kn33No2ufbnWsA"
  },
  "3af2U-jbEO3mKku93A17sg": {
    "date": "5/5/2017",
    "text": "My friend and i decided to skip Chinese food for dinner,she prefered a quite place away from bars so being a lover of diner food,we decided to try Micro Diner for the very first time. I live in the neighborhood and I know this place exist but just never tried it and I'm glad we did!  We went there on a Friday 6pm ish,the place was empty,we seated ourselves and our server Amanda was very polite and nice,gave us the menu right away and gave my 5 yr old daughter some coloring pen and stuff to keep her busy. I ordered the kid's menu which was chicken tender and fries,my picky daughter ate the entire fries and 2 pc of chicken so that means the fries was good,the chicken was tender and the breading was perfect. I got myself the stuffed french toast with strawberry and creme with the side of bacon (although i picked sausage instead of bacon but its no big deal) and the strawberry banana smoothie. My friend ordered a hot roast with the side of fries and cauliflower. I tasted the beef and i thought it was good however the cauliflower was overcooked. We had meatloaf and pot roast for take out too. With regards to my meatloaf takeout,it was a lil dry but it's okay,the mashed potato tasted like something that's from the box thou. I will not try their mashed potato again but i will definitely try other food on the menu. I absolutely love the french toast and the chicken tender. Overall experience was good,i gave it a 5 star because the customer service was great,the location is perfect and the food are not expensive.  Our verdict: We will go back to try other food on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Yo4bHmIM9Xo7fnw63ikSmg",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Meatloaf with the side of mashed potato and grilled zuchinni with brown gravy and 1 pc of garlic bread (for my take out)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Yo4bHmIM9Xo7fnw63ikSmg/o.jpg"
      },
      {
        "img_id": "ESvOH9L4ZNQ4iJgSR_khCA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. The open-faced Hot Roast with the side of fries and cauliflower",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ESvOH9L4ZNQ4iJgSR_khCA/o.jpg"
      },
      {
        "img_id": "siKld6uXBYg_ata6QllhIA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Stuffed french toast (3 pc) topped with strawberry and creme with the side of bacon (i absolutely love)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/siKld6uXBYg_ata6QllhIA/o.jpg"
      }
    ],
    "user_id": "BTLCu5mAMiODuCQxw8nfCw"
  },
  "wXFotSHExXSsB4gAZlx4fQ": {
    "date": "6/10/2017",
    "text": "Went here on a late Saturday morning and were seated quickly. They don't poach eggs, but the wife got basted and that was almost as good. Her toast was not too thick, not too thin; just perfect for the picky toast snob that she is. My omelette was fresh, but it could have used more cheese. The coffee cups were always filled.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nfP7jRgmR_wkM10_Gg0scg"
  },
  "mbnk0POHoOQqZlpZouEPXw": {
    "date": "1/31/2018",
    "text": "Awesome little place! The staff are SO NICE. Service is fast even on busy mornings and the dishes are good old-fashioned american comfort food. If you sit at the bar then you can see your food made in front of you so you know what you're getting. It's a great slice of mount wash friendliness.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oZ3-Ww1t4HAI6AYGxpfOhw"
  },
  "L7OH5o_KD26LOqQdgxQNHA": {
    "date": "12/22/2015",
    "text": "Micro Diner is a small, humble diner in Mt. Washington right by the overlooks on Grandview Ave. Boyfriend and I seated ourselves at a cozy yet roomy corner table right behind the bar. I got the macro breakfast: pancakes, two eggs, your choice of meat (I got sausage), and your choice of either hash browns or home fries (I got hash browns). Boyfriend got steak & eggs, which also came with your choice of potatoes and toast. We ordered the cinnamon French toast as well. We enjoyed the pancakes, which were the perfect texture and thickness (although I do like the thin hotcakes at Pamela's too), and the cinnamon French toast was pretty good too (just wish their portion was bigger). However, my eggs tasted strange, as if they made it way before I even ordered it. The hash browns were tasteless; maybe they expected you to season to taste, so I sprinkled a generous amount of black pepper on it. Not the best brunch place around, and a bit out of the way if you're a college student in Pittsburgh, but they have good pancakes and decent French toast.  Taste | 3.5 Atmosphere | 3 Presentation | 2 Service | 3.5 OVERALL | 3",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "3E6cp5VzaPcFAuWr_MjFLw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3E6cp5VzaPcFAuWr_MjFLw/o.jpg"
      },
      {
        "img_id": "FBT-MHoeQ00gJ5E_fPAIsg",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. steak &amp;amp; eggs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FBT-MHoeQ00gJ5E_fPAIsg/o.jpg"
      },
      {
        "img_id": "UNXkrkwfZN1f-bujFHmwsw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UNXkrkwfZN1f-bujFHmwsw/o.jpg"
      }
    ],
    "user_id": "HC5zLdut4caN1VPqxqRsMw"
  },
  "iihZ6Ka4ffML0pjXCfQ8mw": {
    "date": "12/5/2015",
    "text": "While looking for somewhere unpretentious for brunch one morning, we stumbled into Micro Diner and a table immediately opened up.  This place is bumping on a Sunday and a great breakfast, or anytime, spot. Especially after almost joining a pretentious brunch a few doors down, I'm glad we made the diner choice. Since it was between breakfast and lunch, we ordered one breakfast item and one lunch to share. We ordered the chicken salad, after asking the waitress for a recommendation between my two choices, and a breakfast sandwich.  The salad was much larger than I expected and full of chicken. Sometimes you go to places and you get this sad little piece of grilled chicken that barely gives you a bite or two, but the amount they served was perfect. The breakfast sandwich was super tasty.  Since our first visit we've also ordered dinner for delivery and they arrived much quicker than expected, another pleasant surprise.  And in case you haven't seen my tip...this location also serves as a UPS access point (or drop off/pick up location), which is great for the neighborhood and ensuring your boxes get to or from where they're going!  This place is a great quick bite or a simple dinner that you don't have to think too much about.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "NxtYkOpXHSy7LWRKJf3z0w"
  },
  "Ifah5GxLulMHgPsNx7SnmQ": {
    "date": "5/15/2017",
    "text": "I'm addicted to the bacon/egg/cheese on a biscuit! It's a fun little diner experience to stay & eat. Takeout is also super easy. The place is clean & staff is friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lMuahQqsQRgd4b3Emr7Ppg"
  },
  "ltexDfEX8rUlVaUmc8ZIYw": {
    "date": "7/6/2015",
    "text": "After a night of drinking on Shiloh Street, it was 2:30 am and I was starving. I didn't think anything would be open that late and to my surprise, I discovered that the Micro Diner was open until 4 am! I was pretty excited.  My boyfriend and I grabbed a seat at the bar style seating and were greeted right away with waters and menus. We both ordered the same thing- their turkey club with home fries. This dinner is pretty small and it was slightly busy when we arrived. The kitchen is open and we were able to watch the cook as he prepared the orders. He was pretty amazing- he handled all of the orders on his own and in a timely manner. My boyfriend was so amazed at how many orders he handled at once and how delicious our sandwiches were that he shook his hand after our meal. I believe his name was Mark- so shout out to Mark for being an awesome chef!  Our sandwiches were very good- the turkey wasn't lunch meat, it was real turkey and the bacon was super flavorful! The coleslaw was awesome and the sauce on the club gave a nice, spicy kick to the sandwich. It really hit the spot. The home fries were just potatoes and weren't very impressive. I ended up taking them home and doctoring them up a bit by adding peppers and onions and making them a little more crispy. After fixing them up a bit at home, I really liked them.   Overall, I am really glad we checked out this little place. It has an awesome location- right off of Grandview. I would like to return in the future!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 11,
      "cool": 7
    },
    "photos": [],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "jGAfZV2jARk-e0huhf2TQQ": {
    "date": "12/28/2016",
    "text": "My sister and I came across this fabulous diner in Mt Washington on Shiloh.The croissants egg and bacon sandwich was out of this world!  Connie and Lonnie were exceptional at attending to our needs.The coffee was tasty and hot.The croissants were buttery a d oh so fresh.The friendly atmosphere made eating so pleasurable.What is great is the location. (Parking lot across the street) This is a hidden treasure.Wish we had this restaurant in Shadyside!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bWn_apGR2Ah2XMQSh65dOg"
  },
  "3lkqdKgFcFRPrhSnZn0bdQ": {
    "date": "9/23/2016",
    "text": "This is definitely a typical diner. I did really like the potato pancakes, but I wish they had some kind of seasoning in them. The main reason that I won't be coming back here is because the waitress asked if my boyfriend wanted a refill on his iced tea, put her hand in the mouth of the cup, stuffed it in her underarm & continued cleaning up other tables. She brought the same cup back that had been under her arm. It still had the wold straw in it. Reusing cups is completely acceptable, but putting a cup against your body like that & then giving it to a customer is extremely unsanitary.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "JeIVRtZiwUnSP9qR4AmfEQ"
  },
  "YVxZjZbftfk5dy5RTMr6zA": {
    "date": "4/16/2017",
    "text": "Nice family owned & operated business. Great staff and delicious breakfast! I had the loaded potatoe pancakes. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VfyW_fXjAjIyGxXbvkEW2w",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Loaded potatoe pancakes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VfyW_fXjAjIyGxXbvkEW2w/o.jpg"
      }
    ],
    "user_id": "9JNPDqTs7M5n39YsS4TjBA"
  },
  "x18LcjnueF6pNUlypaLWsw": {
    "date": "11/4/2017",
    "text": "So listen, guys. The food at this place was incredible. Everything you would expect from an old fashion, home cooking, people loving diner. Honestly if you love lemonade, this is place that suits those needs. I'm the type of person that gets lemonade literally everywhere that I go and by far this one takes the cake. The coffee wasn't on the best side but why drink coffee when the food will make you fall asleep anyway??? The food was great, the service was great, and I had a wonderful time. Definitely 10/10 would recommend to anyone traveling to or living in PA.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kN5tb60kyXy_0O4lMhcfAA"
  },
  "mIXN1ZR1kB8f_6Wedb5gvQ": {
    "date": "7/15/2018",
    "text": "Visiting Pittsburgh, found the Micro Diner by Yelp. Great place, friendly, good food. Try the Labriola sausage!  Stop and take the great view from Mount Washingon. We came on a July Sunday morning and we got a table right away.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W2sF0G538pELHkYqZJRSIQ"
  },
  "tczab5QG8UEFlmekkInL0g": {
    "date": "12/21/2016",
    "text": "I found this place on groupon.The food was great and so was the service. The prices are even better! It's only a five minute walk from the top of the monogahela incline.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GILQoBk5xjojNNOeD8U8FA"
  },
  "aBShwT-HRZ4JGbQDgA7v9A": {
    "date": "2/14/2016",
    "text": "This is a quaint little diner just a short walk away from the top of the Monongahela Incline. As soon as we walked in, we were greeted warmly by the waitress and told to pick whatever seat we wanted. The atmosphere of Micro Diner is very cozy and fun, in part because of our friendly waitress. She turned on music for us and was extremely attentive!  The service was quick and the food was good. They have an decent-sized menu with a lot of interesting options (Nutella and Cinnabun pancakes to name a few). Also, they are one of the few all-day breakfast places in Pittsburgh! The omelet wasn't anything special, but the Nutella pancakes and hot chocolate were fantastic. You receive large portions for a low price. I would definitely recommend people to come here, especially if they are looking for some late night breakfast since Micro Diner is open until 4 am on Fridays and Saturdays!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_farHjfv1Mc5nK5DjBbXXQ",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Hot chocolate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_farHjfv1Mc5nK5DjBbXXQ/o.jpg"
      }
    ],
    "user_id": "mIkc2-trSM7uvp7FZhiiNA"
  },
  "PbVDEDzGgwZIefI_FrgicA": {
    "date": "6/29/2018",
    "text": "LOVE the Micro Diner ... we frequent it about once a month.  Great food and great service.  We were celebrating my wife's birthday with a friend.  Our server, Connie, overheard our conversation about celebrating her birthday.  Much to our surprise, Connie came over with a delicious chocolate cupcake and a candle.  What a sweet thing for her to do to make my wife's special day extra-special.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k4Zo9qLhjgAEI3YkM1qO3g"
  },
  "G3zTOP4d7oonKhmlQ3K5Og": {
    "date": "6/28/2018",
    "text": "Cute place, small, friendly, good food and prices.   Went for a birthday breakfast for a friend.  Waitstaff Connie was pleasant, efficient and went ABOVE and Beyond by running over to the bakery to get a cupcake for the birthday.   She brought it out with a candle and beautifully presented with whipped cream and chocolate sauce.   Delicious cupcake from the nearby bakery too.   Friendly, homey place with folks like Connie who take the time to add the extra to make it special!  Thanks,",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KPymdKxRi_WIm6bpEYtxqg"
  },
  "SeamP_0R9hatxlwLW-16ww": {
    "date": "2/24/2015",
    "text": "I visited the Micro diner this past Sunday around lunchtime after foregoing another restaurant down the road. Micro look quaint and inviting, a typical Pittsburgh restaurant that promises good food and fast service. I am delighted to say that we got more than we hoped.  The space is small but incredibly clean and modern, the decor look new and the walls have great oversized colorful art work that just makes you feel right at home. There is an assortment of mostly 2 seaters, a few 4 seaters and seating around kitchen bar.  We were advised to find seating anywhere and were quickly given menus and follow up coffee. delicious. The menu features most breakfast items, a few lunch burger [perfectly straight forward classics] and sandwich options. I chose the Eggs and Potato Cakes and my fellow diner had the Macro Breakfast [3 eggs and pancakes].   The pancakes were delicious and not overly sweat, the potato cakes were fluffy and the eggs were just right. I was delighted to find that none of the items were heavily salted, allowing each guest to adjust on their own. The food was brought out quickly but with just enough spacing in order to enjoy each 'course' on their own [the dishes are separated because of smaller tables].  During the meal we also had an opportunity to discover other features of the restaurant. First of all, they are have take out breakfast for meals over $10 dollars. Neat, especially when you are stuck on Mt Washington and it's subzero weather like it's been this February. No standing in the cold for me! Second, this place is open from 7am - 4am [yes] on Friday's and Saturdays!!! So feel free to make your way up the incline for some late night breakfast because you will not be disappointed. Last, they have special items. Due to popularity I was unable to try the loaded potato pancakes, however they did sound scrumptious. I look forward to those in the future.  An absolute must try and a guaranteed returned to this wonderful little diner is in the imminent future. I can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2AiYF7z32_0Oitl4aYXwg"
  },
  "KUED5JBRmdVweD3NHHVgBQ": {
    "date": "7/24/2016",
    "text": "Great breakfast place. My husband and I live nearby and we come here all the time for breakfast on the weekends. The micro breakfast and macro breakfast are good options if you're looking for the traditional eggs-meat-and toast deal (the macro breakfast also comes with a pancake). The price is right as well for the large amount of food you get. I like the breakfast sandwiches, especially the Italian Sammy and Western bagel. They have spicy Italian Labriola sausage which is excellent with eggs or on a sandwich. They always have interesting specials, usually one savory and one pancake - but go early because they often run out of the special items by 11:00 or so (usually what time I go).  As the name suggests, it is small so you may have to wait, but usually they're pretty good about getting people in and out. We have had good, attentive service for the most part, although a few times I've gone the service hasn't been great. Sometimes it can take a while to get your food. They also have takeout, which is nice on a lazy morning. Overall, love the food, the prices and the cozy local diner atmosphere of this place. We are regulars and will certainly keep coming back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "673fNUO-5pyHPV7W1Sgilw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Special feta, spinach and tomato omelet with home fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/673fNUO-5pyHPV7W1Sgilw/o.jpg"
      }
    ],
    "user_id": "MKeWSLsayBxEqz4xMeMeow"
  },
  "0GlJ4u5fL3c3_4wQqGFpLg": {
    "date": "11/5/2017",
    "text": "As a resident of Mt. Washington, Micro Diner is one of the best kept secrets in the city. Tiny in square footage, but large in personality. The staff is always friendly and has the best tunes on the loud speaker. My go-to dishes are the Loaded Potato Pancakes (with both applesauce AND sour cream) and/or the Micro Burger. Both speak to a totally Yinzer palate. The ultimate kicker - Micro Diner is BYOB. So feel free to bring a bottle of champs (from the liquor store next door) and have some mimosas at half the cost! Cheers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ubrpx1SynLst5rvf6DHs_g"
  },
  "tf4wNYMFrAFgCh0fGGEKnw": {
    "date": "10/25/2014",
    "text": "Very nice little place nestled on the hilltops of Pittsburgh, a street down from the Monongahela Incline. It's a small 'old school' feel diner with a updated and fresh atmosphere. Diners were friendly, staff was friendly, free wi-fi (a bit slow), and the prices were friendly to my wallet and the food was good. Met a very nice couple sitting beside us and were telling us about some of the other sites that we may want to check out. This is a very nice little treasure! If you get a chance to go, you really should.    Oh, yeah, the music they were playing was great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "V2QLYEWoCllxxfTUwRGHdQ",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Micro Diner",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/V2QLYEWoCllxxfTUwRGHdQ/o.jpg"
      }
    ],
    "user_id": "1sc9kKqi9ViETHm0JLOMRA"
  },
  "b3_QCyKqNFr9l3VLAwHjkQ": {
    "date": "5/29/2016",
    "text": "A small but really good place. Your typical diner food. I went here on a sunday morning with my boyfriend and it was just a nice breakfast experience. The service is a little rushed but probably because they are trying to turn over as many tables as possible in the small place. Great prices too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SAU8ANF44wlXdDCylFYDrA"
  },
  "E6gHt1AfmRRZJ8TXTXa3-A": {
    "date": "2/22/2016",
    "text": "Micro diner is great if you're looking for the old time diner feel. The food is always fantastic. I've had chicken, omelettes, burgers, etc. and they're always cooked perfectly and served quickly. The wait staff is always friendly and very quick with your order. The coffee here is phenomenal as well. It's also BYOB, so you can stop at Packs and Dogs next order and bring over a few beers. This place is a great hole in the wall restaurant on Shiloh, and I would definitely suggest it to anyone in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-yf4v6bwN64O4l5kU0mRqw"
  },
  "ZBJ400c0bODfgY_dMyB98Q": {
    "date": "12/5/2016",
    "text": "Found this diner on yelp.  Place is spot on.  Small but the food is great.  Had the micro breakfast.  My buddy had the sausage biscuits and gravy and thought it was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yNZdBf_nAjG-B3S0vNJUKQ"
  },
  "mVD62u1DRRIOy2suWoyRcw": {
    "date": "9/8/2015",
    "text": "One of my favorite places in Mt. Washington! I moved up a few months ago and was so pleasantly surprised when I tried Micro Diner! Everything I have tried has been delicious. I'm a huge fan of breakfast all day. Also love that it's BYOB. The only reason I knocked it down a star is because the service is a bit spotty. But the food is delish!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_oNthTV94Evx9qGkJOTXLQ"
  },
  "3ZKDQM9P6ZmZXlpc4s66Jw": {
    "date": "1/27/2016",
    "text": "Came here for breakfast/brunch on a Sunday for the first time. There is a parking lot right across the street which is convenient. Very small space, but fantastic food!! My Italian omelette was huge and super tasty. Service was quick and staff is friendly. I can't wait to come back and try some other things off of the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JPOcwRppEWi8VQC6EU5rAA"
  },
  "QXvK1NAAvZT0croLMoU_Kg": {
    "date": "1/6/2013",
    "text": "A small diner featuring a 3.99 breakfast special everyday (2 eggs, toast, and choice of bacon, sausage or ham, add red skin potato home fries for two bucks more, still a great deal for 5.99). Lunch has typical finer fare, burgers, sandwiches, wraps and fried finger foods. I had a plate of hummus, flavorful and filling, served with pita points. While dining there I saw a pretty awesome looking tuna wrap, a hand made burger, and a mouthwatering grilled Rueben all served with fries that looked hand cut. The signature sandwich is the \"unconventional\" Club sandwich, three layers if turkey, slaw, bacon, cheese and a chipotle sauce, sounds great! Another sandwich on the menu that caught my eye was the Pulled Pork. House roasted pork served with BBQ sauce, slaw on a Kaiser roll.  Being vegan I saw quite a few offerings for us, a home made veggie burger, veggie pita, the hummus, and a few other offerings I can't remember at the moment. For the healthy breakfast they serve egg white omelets and egg beaters and oatmeal, and yogurt and granola.   Soups, salads, sliders (are sliders the new pop culture appetizer?) and huge sandwiches. The Micro Diner is a welcome addition to Mt Washington's business district which has seen the Grandview Bakery, Packs & Dogs, and others.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "UsmTxWbobLsI6WR1Db0W7A"
  },
  "gCyL7imhPxL4V9Wy_rkXWA": {
    "date": "2/22/2015",
    "text": "They served us cheese sticks without cheese in them.  The Reuben was deemed \"the worst we've ever had,\" their mashed potatoes were bland, the turkey in the hot turkey sandwich was dry and tasteless,  and the bread was so toasted it had to be cut with a knife.  Disappointing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "85QJ_wnnVuVSIsBS42bUvw"
  },
  "guSjOgTMUR1_RuGVCkmiOw": {
    "date": "12/9/2015",
    "text": "Great cozy little diner. Has the classic diner feel overlaying a quality selection of breakfast fare. The Gluten Free selections were nice (my companion has a gluten-free diet requirement), pancakes were great! Street parking though, so bring change for the meters!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z0IcOu4i97VKv_8IyRWNjQ"
  },
  "mQDJOp3EwkRrsvGNdq4OaQ": {
    "date": "3/13/2016",
    "text": "It's a nice little place and I would go back.  Food was tasty, came out hot and fast, and the prices were appropriate.  St. Patty's Day corned beef special was good.  A little lacking in decor, but the view of Pgh from the top of Mount Washington is incredible.  Server was super friendly and helpful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gwmsX1H_tfBp-cliwPvnYQ"
  },
  "_hYDqOXjTAnhU6nE5rnGDQ": {
    "date": "5/3/2015",
    "text": "We ate here twice while in town for a lacrosse tournament. Very small and seating is limited but it's far enough off the path that we found seats each day. Food was excellent and I have a hard time finding cooks that can cook a over-medium egg right. Definitely enjoyed.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1R6Y5-XVGlDhl261NZlTgw"
  },
  "TEbYPpDH-1DP0-QuUqLOHA": {
    "date": "4/13/2013",
    "text": "Every time I go, I eat the same thing: Egg White Veggie Omelet, its delicious! It is cold when the door opens I agree with the previous post, but dont you expect that when you are in a small place in Pittsburgh? I additionally love that they open late hours on weekends... yum!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "88i_DImiAep48j1la4v93A",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Veggie egg white omelette.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/88i_DImiAep48j1la4v93A/o.jpg"
      }
    ],
    "user_id": "A0ssDikuj0SQr9mVqnh91Q"
  },
  "XmpCiR1Y5Hg3UygRXvKOxQ": {
    "date": "6/15/2015",
    "text": "Loved their Garden Salad, tons of vegetables. Ok service, our waitress seemed disinterested.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WZ-1f7JXXzfgs_f0bSlxHA"
  },
  "7GCK4sJ4xrijDm--yBGYcw": {
    "date": "5/26/2015",
    "text": "Delicious foods with reasonable prices! The house made strawberry source and sausage are really tasty. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nCx7zy0yGdxWh2wsXblamg"
  },
  "00BZ_3DY_X_Hcg5zivlLBw": {
    "date": "3/12/2013",
    "text": "Clean and spacious little diner in the Mount Washington area of Pittsburgh.   This diner is a few blocks from some of the greatest views the city has to offer.  I went in at about 10:00 a.m. on Sunday morning with my girlfriend, and we were seated right away.  I had been looking for an excuse to get her up to Mt. Washington so that i could propose to her....  I took her up there for a \"breakfast date,\" and after walking down Shiloh street, we settled on the Micro Diner.  Despite being insanely-nervous about the engagement ring in my pocket and the fact that i was going to pop the question right after breakfast, the food here was delicious enough to defeat my appetite-suppressing nerves.    We each got the morning's special - a gyro omelette!  It was AMAZING!  We ordered our homefries \"well done,\" and they were appropriately crunchy and delicious  (there is nothing i hate more than mushy home fries!)  The coffee / toast was as expected for a typical diner - nothing fancy.  Pretty much an average diner with the added benefits of a spacious/clean feeling atmosphere, and a close proximity to Mt. Washington's great views.  I cant speak for the every-day menu, but the special we had was out of this world!  On a side note.....   about 10 minutes after we left the diner, she said yes!  :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l3vtWnWFEXNr_w1cQ83_DA"
  },
  "4MMddLOGwaGQ32gImicPJw": {
    "date": "11/20/2015",
    "text": "Pretty good. The staff were friendly and the food decent. The hash browns seem excessively oily though; I feel as though every time I eat the hash browns here, my life expectancy shortens by a year. All in all, this is probably the best place to get breakfast on top of Mount Washington.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pnwoTk1qmXoVH_OyXxXzmg",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Classic breakfast sammy on Italian toast with a side of hash browns.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pnwoTk1qmXoVH_OyXxXzmg/o.jpg"
      }
    ],
    "user_id": "vg-_YnzqVERXgcAt5wDFmQ"
  },
  "WV4KxUTf8KcXPwxNPs5UEA": {
    "date": "1/16/2016",
    "text": "Great food, great service, great place!!! Highly recommended! The servers maintained their composure so well during the busiest time of the day-- always had smiles on their face.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SfcWwOKlOmRXj-A3bNfY1w"
  },
  "Jy1MsIMytQMQDLethbGm2w": {
    "date": "8/20/2015",
    "text": "I was just browsing through the restaurants when I saw Micro Diner and had to write a review. I used to live on Mt. Washington and lived there when I started dating my future husband and we went there almost every weekend for breakfast when I lived there. So maybe I'm biased but if the food wasn't great I doubt we would've kept going back. I always got the cinnamon French toast and bacon and he always got an omelet. Everything was really good. Very crispy bacon!!!  One time I felt like getting something different and got a breakfast sandwich and that was also really good. You won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zgo6ehbfeMOcsG9bgofMNg"
  },
  "KO2Vsu9A6gvKYreYlwX1UQ": {
    "date": "6/16/2016",
    "text": "Just had lunch with a friend.   Nice atmosphere, not too crowded even though we arrived at 11:45.  It was delicious and the breakfast options were so tempting that we had breakfast for lunch.  Both of us tried the veggie omelet with rye toast.  Yummy.  The service was attentive but not too much to interrupt our conversation.  The waitress kept our coffee cups filled even after we finished our meal. The owner came out to adjust the AC and we had a chat about small businesses.  Glad we found this place as it is not too far from home. The lunch menu looked good enough for a return visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "L0Z7-gRCbVZ_cTUL6z0Lgw"
  },
  "CrDAbpp15O1asGe6Lv60ww": {
    "date": "9/15/2014",
    "text": "Stayed at the sheraton in station square for a wedding this past weekend. We went to the micro diner trying to get a good, cheap breakfast for a group. Thanks to the good reviews, we went and were not disappointed. They were so nice to us and helped us move tables to fit our party of 6 in the small restaurant. All the food was so good and the coffee was plentiful. The macro breakfast is a steal! Would definitely go back if we're in the city.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "r4wmJCBhJFrPmpgtNhEnYw"
  },
  "IchI4GqpH867oebtjWJjMg": {
    "date": "12/3/2015",
    "text": "Love the pitas. Especially the Chicken ceaser. Ordering online is convenient and they deliver fast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mUbIcYFzkkvLXP0yV4RpqQ"
  },
  "zakyGKa_gIDguvDHQtSjyg": {
    "date": "7/23/2017",
    "text": "Amazing pancakes!!!  - Opens past midnight, so you can enjoy the view in mt. Washington and then possibly come to fill your belly - pin your hometown on the map",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OtLwDVAqjfDBB0hOfMhZTw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Corn beef hash",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OtLwDVAqjfDBB0hOfMhZTw/o.jpg"
      },
      {
        "img_id": "SfdNs-dLAb3Hob_65v1Agg",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SfdNs-dLAb3Hob_65v1Agg/o.jpg"
      },
      {
        "img_id": "pvtRHnBLXjrNqCxVb5P1Bg",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pvtRHnBLXjrNqCxVb5P1Bg/o.jpg"
      }
    ],
    "user_id": "NUD4azjDxMTzeKtxVg6jOw"
  },
  "B4g0fxsJqJ1TglfYk8BBQg": {
    "date": "7/9/2018",
    "text": "It's a simple cheap diner in Mt. Washington on Shiloh St. I ordered French toast, home fries and eggs. It was all good but I couldn't help but feel like the French toast was missing something. The blueberry pancakes my friend ordered were great, however. Overall this place is good place to visit if you're on a tight budget.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UL-StZQLeBgqyR3YeZexag"
  },
  "6VoPwC-TezB-qTp5WWxhbQ": {
    "date": "5/20/2017",
    "text": "This is a great little diner in the heart of Mt Washington area. If you came up on the Mon incline, walk a few blocks and stop here for some great food, friendly service and classic diner atmosphere.  I had the Macro Breakfast plate - all the breakfast staples, eggs, toast, hash browns, pancakes and bacon - all well prepared and tasty. Hash browns were the highlight.  If you are in the area looking for some good food and no-frills, stop by Micro Diner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_rvxykxj_yGsB_Mt9ugAUw"
  },
  "ss9G2ja0lTKKgBoxMw1aRQ": {
    "date": "5/28/2018",
    "text": "The food was okay. I didn't like it but my husband did. It's better than starving or eating food from a gas station. The eggs had no flavor, my bacon was cooked all the way and the veggies in my potatoes weren't cooked all the way either.  The coffee was good. I'm scared I won't make it too far before having to run to the bathroom",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bjh8tWU9Zs1vR9e-5f2PDA"
  },
  "1AGhFaMz1nk6HL424AhU9Q": {
    "date": "8/5/2018",
    "text": "Today was our first (and last) visit.   The food wasn't bad, but I think the only seasoning they use is butter. Everything tasted like nothing.  They have a credit card sign in the window but told us it was cash only when I handed my card over.  I had to walk to the ATM to get cash, then my server had to LEAVE THE DINER to make change. When she did give change, she handed me a $10 bill, which would have forced me to leave a 30%+ tip. I had to wait about 5 more minutes for her to find singles.  My waffle was left untouched due to its tastelessness. Usually when someone doesn't eat an entire part of their meal, you ask them why. No one did.  It's just not that hard to make a decent breakfast. They need an overhaul.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "05W-h012Adiz8tuncdIOHA"
  },
  "LdIYs3-jMm7pcxUy-m988g": {
    "date": "7/18/2018",
    "text": "Ok so this is the ONLY place open at 6am!!! And it's super cute. I was greeted by a friendly young lady who acquiesced to my (strange) requests due to my dietary requirements. They were very accommodating which is appreciated especially being from out of town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nnWS-b3_1rFAIlhqset1QA"
  },
  "YfiYEjlOZ3iqK_VRZ02zrQ": {
    "date": "3/17/2019",
    "text": "Micro diner  is not only artistically and uniquely a great place  to have a great meal with awesome people they have the BEST fish sandwich I've ever eaten!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cXB5JsWHU-bk1UO92q3d7g"
  },
  "f87lFuRMeRVMQRsA9l2rmw": {
    "date": "12/8/2017",
    "text": "This is a great small diner that has an extensive menu, fun local vibe, and they keep the coffee coming!   I ordered just a regular cheese omelette which at $3.99 makes for an affordable breakfast entree. The omelette was delicious and nicely prepared. The coffee was good ($1.99 for an endless cup) and they were prompt with their refills which is much appreciated.   The service was quick, attentive, and friendly. I would definitely come back here if I were in the area again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SceADw4QFy7oCmToRS5W_A"
  },
  "e4iyHKVWlhqyWKmQcZ21wQ": {
    "date": "2/1/2019",
    "text": "Terrible. Service was terrible. Waitress wasn't very attentive. Asked for sauce was given the check and a to go box instead. Wasn't even half way done with my food. Also when the food came my toast dropped on the table instead of having a replacement was asked to pick it up. Food was eh.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G2VUDLU4hY46v3klwHxgkA"
  },
  "TbBdWjInrsGVDIoDBU8uww": {
    "date": "8/14/2016",
    "text": "So happy we found this little gem. We were recently staying downtown for a wedding and this place was the perfect pick for breakfast! First, the location was awesome, it took us out of the city and provided amazing views on our after breakfast stroll. The surrounding shops and eateries looked super cute too. They aren't lying by calling this place micro, it is very small. I'm just happy they weren't slammed and were able to seat our party of 5 fairly quickly.  My breakfast was basic, but solid. I appreciated being able to swap out bacon for sliced tomato, and my eggs over medium were cooked flawlessly. Hash browns were great to - breakfast staples done right! I was intrigued to see potato pancakes listed on the menu an naturally had to sample and so happy we did because it was really good!   The MIL got a Rueben with turkey and claimed it was quite good, the fries were just a bit soggy.    The service was super friendly as well! Just a great little breakfast to start our day off strong!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "kMmlYyyvJ_mbfeLIqG2ptg",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Reuben with turkey, sandwich was good but fries were a bit soft.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kMmlYyyvJ_mbfeLIqG2ptg/o.jpg"
      },
      {
        "img_id": "e2nSAcBhxYKowwqwLz2omw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Micro breakfast with tomato instead of meat! Yummy!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e2nSAcBhxYKowwqwLz2omw/o.jpg"
      }
    ],
    "user_id": "_kPm0L6KX9H_CqFoi5x_fw"
  },
  "dOnkzbc1kQMqC5AqiA7jnw": {
    "date": "7/24/2018",
    "text": "I just recently moved to Pittsburgh and I have been out and about checking out all of the local spots to eat. I love breakfast, and Micro Diner definitely satisfied my need for a local diner. I get the home fries, corned beef hash, eggs and toast almost every time I stop in. The portions are a great size, the eggs are super fresh and fluffy and the corned beef hash is almost as if it was made at home. 10/10, will always go back on a Sunday morning for some home cooked food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n8glhV2tEtvmviPQ2Yy9tQ"
  },
  "9Xeki7BQTRZQP7Pt9Ia5uQ": {
    "date": "7/3/2015",
    "text": "There are very few restaurants to eat at that do not cost and arm and a leg on the mountain. It's a great place to live when you're 50 and like spending $200 in a restaurant where the menu and the pomp haven't changed in 30 years. While it may seem intimidating to some, if you look hard enough, you can find good, inexpensive fair away from Grandview.   Micro diner is a great little spot. While tiny inside, the menu is pretty big and the food is good and cheap. I seldom order hash outside of Pamela's because I know that often diners recruit theirs  from a can. I was really happy when I asked the waitress and she said it was home made. 3 eggs, toast and a healthy portion of hash was only $7.99 and extremely tasty. I would like to go back and get their french toast. While not a big sweets person, it looked amazing and was stuffed with strawberries and creme. The only reason why I didn't give this place 5 stars was because the waitress didn't write our order down, had to come back and retake the order and I ended up with my eggs sunny side up instead of over easy. How I managed to carry on with my life, I will never know.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6d2ox8Y5ARsNgmZVySwYVw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Corn beef hash with eggs and toast!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6d2ox8Y5ARsNgmZVySwYVw/o.jpg"
      }
    ],
    "user_id": "OWtzJMlqA7cY559O80nqQg"
  },
  "JACjGebSAM5bjACSnbIVZA": {
    "date": "3/26/2015",
    "text": "Delicious chili Tomato based not too much beans or meat, big tomato chunks A side of grilled veggies is beautiful, delicious, and inexpensive! Yummm So happy this place is here, you can find breakfast or later fare, really cute place, great business hours. Hard to believe The Village Dairy was ever on this same block!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pjbYAFsVxDuZeAdlwyBL3w",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Grilled veggies mmmmm!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pjbYAFsVxDuZeAdlwyBL3w/o.jpg"
      }
    ],
    "user_id": "o9cHwoFocl2YCsg9mg7MCw"
  },
  "f85a0uGOssL_ducCh5-pJg": {
    "date": "12/18/2017",
    "text": "Best pancakes I've ever had. Warm and friendly staff. I wish I lived in Pittsburgh. I'd eat here all the time!! Highly recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WwNXlg8cGKoQSkpq0NHoGQ"
  },
  "fJ0yqFru0XKanKGWoZfVlw": {
    "date": "6/11/2017",
    "text": "We stayed at the Sheraton Station Square and didn't want to spend a fortune on the hotel breakfast. That area offered precious few decent breakfast options...so up the incline we went thanks to a quick Yelp search. We were ravenous and this totally hit the spot! Nice portions, reasonable price and a server with personality was exactly what we needed. Thanks Micro Diner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "y0MwqMMYGt9lvQQsFVB-ug"
  },
  "uIpcHp9s4D4IrGJc51aTIg": {
    "date": "1/30/2018",
    "text": "This is my go-to breakfast spot on Mt. Washington.  The food is cooked right in plain sight and is consistently wonderful.  The value is also better then any other breakfast place in that area.  The staff does a nice job turning over the customers. This is just a flat out great little diner.    The lunch and dinner menu are very good also. One thing that earned my loyalty to this place was I asked for a specific item not on the menu and the chef was happy to make it for me. They make it for me every time I go in now.    Great neighborhood diner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aG42hudwQChiOwU6mfCR4Q"
  },
  "FsPWHVu--TFvpsBI9k_v6A": {
    "date": "4/8/2018",
    "text": "I love a good diner and this place hit all the marks!  We sat at the counter on a busy Saturday for brunch.  I got the turkey club with fries and it was great.  The many had many breakfast and lunch options as you'd expect.  We'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SCqi8N3vP4qIcF5ezzWzzQ"
  },
  "diIaCPG2a0jQTUeOoswzjA": {
    "date": "3/24/2018",
    "text": "Easy simple and delicious. Cute little diner. It literally is micro. Quick service. Not bad prices. Right near the incline.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pWqyPgFJpbj4z8of9pfv_w"
  },
  "6B9FR2-C0qf-Bb-e1CLc-g": {
    "date": "6/2/2018",
    "text": "Ist time there today.... had cornbeef hash and eggs... with a side of potato pancakes... hash was pedestrian ... potato pancakes we great... will be back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xrMRE2ce3vq4fnd1Fjij_A"
  },
  "9dsgtG9WBWimim8OzaB5Hw": {
    "date": "7/14/2016",
    "text": "4 words: Really good, simple food.  We couldn't find many places near our hotel that a) weren't chains and b) were open on Sunday. Then Yelp found Micro Diner for us.  They don't have a parking lot, just street parking. We were able to find a spot around the corner, careful some of the streets in their neighborhood are steep.  This place is teeny tiny. They have table seating and a few high counter seats towards the back. We decided on the counter. The counter basically surrounds the kitchen, so from where we were we could see the chef making everything and hear the hilarious conversations that their waitresses were having. Kinda made us feel like locals.  We both order their regular breakfast (eggs, sausage/bacon, potatoes, toast) and we both very much enjoyed them. The staff was super nice, the food was really good, and came out quickly- I don't know that I could want more out of a breakfast spot.  We will absolutely be back the next time we visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vPOkQJKahhR13LQ2ElSFGg"
  },
  "mR9dEGsFQaMOQbQ7vNCbRw": {
    "date": "5/8/2018",
    "text": "I liked this place. My breakfast was cheap and filling. Quality place. I'm excited to come back and try the rest of the menu items. Only suggestion is the few strawberries put on top look silly. it would have been nice to have a strawberry puree to put on top of the strawberry pancakes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x5bReTDEyc_R6JfabeoZ3w",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/x5bReTDEyc_R6JfabeoZ3w/o.jpg"
      }
    ],
    "user_id": "rVLTC95ZV7yCmbQbSVdX1w"
  },
  "-E8y719-IoWnrVQQFPGXjQ": {
    "date": "3/31/2019",
    "text": "I recently placed a pickup order from Micro Diner and was actually surprised it was only going to take 25 minutes on a Saturday morning! I ordered one meat lovers omelette with hash browns and one macro breakfast with scrambled eggs,potatoes,bacon,chocolate chip pancakes and white toast. Everything was great with the omelette but the macro breakfast was another story. When my boyfriend opened the take out container with the eggs and potatoes he noticed one long black hair wrapped around the eggs and potatoes which was disgusting but it was easy to just discard that portion of food. But then he started cutting the eggs he noticed another hair that was actually COOKED into his eggs!!!!! It's absolutely disgusting!!!!!!!!!!!!!! He was not able to eat anything but the bacon and pancakes since they were in a separate container but still it's absolutely APPALLING!!! Such poor hygiene and how do you \"not notice\" that as you're cooking and placing into the container?!?!   So obviously the first thing we did was call Micro Diner immediately and let them know the situation and when the lady answered the phone and we explained how disgusted we were and how we wasted money to only eat half of what we ordered and if we could get a refund or come down and just get it remade she said \"oh we must not have noticed. We can't do anything.\"  She also seemed like she wasn't surprised like she's heard of this before which is more sickening. Absolutely pathetic and not even worth the argument. We won't even step foot in that filthy restaurant ever again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cDR0-gjy0lYr6AjvZj4YSA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cDR0-gjy0lYr6AjvZj4YSA/o.jpg"
      }
    ],
    "user_id": "Z-SHV5h619RqAkfUD2VO6Q"
  },
  "R5FE_jVHs42rDPSAA08ECA": {
    "date": "5/6/2018",
    "text": "Great place for breakfast! The restaurant has your typical classic diner feel and the good food to back it up. I ordered the strawberry cream pancakes and was happy. The cream itself had a strong strawberry flavor to it and the pancakes were plenty large enough to fill me up. I barely put any syrup on my pancakes because a sweet flavor was already there with the fresh strawberries and cream. The food is also very cheap so you're not spending too much on breakfast. Our waitress was very nice and willing to make a special order of something not on the menu. Only thing that I found a bit frustrating was they didn't have change for a $20 bill so I had to pay with my credit card instead.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AZ0-zBDphKINci32twtujA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Strawberry Cream Pancakes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AZ0-zBDphKINci32twtujA/o.jpg"
      }
    ],
    "user_id": "KKblXUNxSGCewpDxiiSRQA"
  },
  "7Jk3Pr6PbbMGN5g0akcDpQ": {
    "date": "4/2/2017",
    "text": "Average, run-of-the mill diner. You won't find any frills or bells and whistles because they're just there to serve you breakfast. The space of the restaurant is small so seating is limited. We stepped in for dinner on a weekday and were one of only two parties dining that evening. You seat yourself and patiently wait for someone to greet you. Our server was very friendly and helpful when it came to serving us. Since the place was pretty empty, service was prompt and the food came out quickly so that was a bonus.   The food was very basic and unenthusiastic. I would compare it to an iHop or Eat'n'Park where you receive the bare minimum for what you ordered. I had the veggie omelet with egg whites which came with toast and hash browns (or home fries, your choice). Egg whites were an upcharge of $2.25 which I find ridiculous. The omelet itself was very bland and unexciting. If I'm being honest, the best part about it was that it was edible and I was starving. I ordered plain french toast on the side and was very disappointed. It tasted like it was just popped out of a freezer, microwaved, and thrown on my plate. The toast itself was flat and deflated while the taste was quite unappealing unless you drown it in maple syrup.   Overall, I was unimpressed with the quality. The service, atmosphere, and location is great, so there is some great potential here if they added a little more to the food. In the meantime, you can find me at iHop.",
    "rating": 2,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "0vrmzpR0TieRE4dCqNaiAQ",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Egg white veggie omelette and French toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0vrmzpR0TieRE4dCqNaiAQ/o.jpg"
      }
    ],
    "user_id": "6KUA3-IfHoAhQ3FL2djQoQ"
  },
  "MRntddjWGe9rxrwaxqCGHA": {
    "date": "8/31/2018",
    "text": "Micro Diner is the cutest breakfast spot on Mt Washington! Today was my second time coming here, and both times have been awesome! Connie wS extremely friendly both times, and ordering to go is quick and seamless. The first time I had the potato pancakes and eggs which were delish, and this time I had a larger order (for the fam) and everyone loved what they got. I tried the Macro breakfast today and it was so good! Conveniently located on Shiloh Street. If you need a solid breakfast stop, Micro Diner should be your number one pick!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4Rr2jXBpOiStO8zap027BA"
  },
  "EEvoM2GdXkuBXoXFdkFJiQ": {
    "date": "3/30/2019",
    "text": "Great spot in Mt Washington area.  I'd come back for sure.  It's a basic diner atmosphere.  I had the Micro. The bread was great.  I had the swirl rye toast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h14YrxuCqiP9EGOkKJNv4g"
  },
  "k8JOZVofZNtTJKBFbmwrRA": {
    "date": "3/9/2019",
    "text": "Good food. Hate that you can't place pickup orders here.  I've done this a few times now hoping the outcome would be different. They let you call it in, tell you 20-25 minutes. You show up in that timeframe, sit/stand in there for ten minutes before you realize they havent even started preparing your order yet.  The last time I ordered, got fried mozzarella and a reuben.  I could have personally pasteurized the milk used to make the cheese for my fried mozz, and killed the cow and prepared the corned beef for my reuben in the amount of time that this place had my pickup order ready.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1GVLcnklCLYxgGYf2zmRWw"
  },
  "wM9jdE8HusqgUUvZxjMgQw": {
    "date": "9/1/2018",
    "text": "The Best! The staff is so nice and friendly.  It's just what you think a diner experience should be like.  I've only had breakfast here and it's been consistently great.  I always get eggs and different meats, coffee, and no potatoes or toast, and I always leave full and happy.  My mother-in-law had this giant plate of pancakes with fresh strawberries and whipped cream - she loved it!!  I'm looking forward to trying lunch and dinner.  It's nice to have restaurants in Mt. Washington that aren't super expensive and fancy (love those too) where I enjoy the food and atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6lb0eTeWb9qFJGY4g1wMkQ"
  },
  "x3f73tgljyLu2jildXWt_w": {
    "date": "8/15/2018",
    "text": "Had a morning to enjoy a quick breakfast and for a home cooked feel this place is the spot. Relatively small diner with a homey feel and quality food. Definitely worth the trip up the incline to check out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F8FjqvavQ_VsUma7FGa6wQ",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Corned beef Hash &amp;amp; Eggs!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/F8FjqvavQ_VsUma7FGa6wQ/o.jpg"
      }
    ],
    "user_id": "tlidfsVQaC3BwUODiB_aRg"
  },
  "E6XDJLOzcESgMjzWsdHFXQ": {
    "date": "4/15/2018",
    "text": "Popped into Micro Diner late in the evening after some beverages and was impressed with this little place. Food was really good, service was quick, prices are on point for the portions! I don't live up on the mount, but if I did, I'd be a regular! Veggie omelette was packed full of vegetables and their potatoes are perfectly crispy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "4LqVKforbiwOIarGB5YCkA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4LqVKforbiwOIarGB5YCkA/o.jpg"
      }
    ],
    "user_id": "-sv8-a09Psq5CMzmg6E4OQ"
  },
  "XW3DzIkvIo6qyVVGMEWMrg": {
    "date": "9/25/2016",
    "text": "The food is excellent ! I know you can't go wrong with breakfast but really you can ! The food is super fresh and the price is perfect for the portion. I suggest everyone should come here and get the spinach and artichoke omelette. My boyfriend had an omelette as well.   My only gripe  is the same as the other reviews unless you have 3 ppl or less , you are prob gonna have to wait for a bit. The wait is not very long but trust me it is worth it. If you are in a hurry, I wouldn't suggest it. You need to come, sit down, and enjoy yourself.   I highly recommend this joint !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ga8vOsXxLKzo7vkTjz8ohg",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Spinach and artichoke omelette",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ga8vOsXxLKzo7vkTjz8ohg/o.jpg"
      }
    ],
    "user_id": "AKMRMIIPSHzp4KD76Z9Tgw"
  },
  "FtRO_RN_kGZc2-7KzA0VEQ": {
    "date": "8/27/2017",
    "text": "I came here for the first time with my dear friend who comes here frequently. We are both Long Island transplants and totally enjoying the foodie experience. I had the chorizo scrambler which was out of this world delicious... I will finish it for dinner later!! My friend had French toast w whipped cream & strawberries..she licked the plate clean so very yummy. I will be back many times!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "nlAf2LI0NQrfZj34lgPMpw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Chorizo scrambler mmmmmgood",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nlAf2LI0NQrfZj34lgPMpw/o.jpg"
      },
      {
        "img_id": "IRR9sJAN4qJnFbxnzfAyxA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IRR9sJAN4qJnFbxnzfAyxA/o.jpg"
      }
    ],
    "user_id": "MKOKaGIY1SW9w3hdVO9Jwg"
  },
  "HiPMYdgY74rixNh-DhwhTQ": {
    "date": "7/22/2018",
    "text": "Macro breakfast-yuuuummmm Pancakes, light and fluffy - good syrup, not too sweet Eggs- fresh and cooked to perfection  Sausage- pretty good Hash browns-perfect  Ice tea-excellent  I LOVE THIS PLACE The service is always spot on, even with 5 people and 3 separate checks. Thanks Guys!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "McGDwEyJB9RQn-Dkjdztmg"
  },
  "k3466a8ZAKpVVWF5TH9onA": {
    "date": "4/4/2018",
    "text": "I really don't know why I didn't write this review ASAP. First of all, I am a pancake/breakfast fanatic. I will brinner every day of the week if I can. So a few Saturdays ago, I stayed at my friends' place on Mt Washington. \"I'm craving pancakes \" was the mutual consensus of the loft. Micro Diner was conveniently close. We called in our order and in ten minutes it was ready.  The portions are MASSIVE. I got scrambled eggs, hash browns, bacon, and pancakes. Every thing was so so so so so delicious. But before I explain more about the food, let's back it up a bit. The inside of micro diner is very cute. It is exactly where I'd want to be on a Saturday morning post workout, or really, any time of the day. The woman waiting on me was super prompt and as sweet as pie. She made sure I had extra syrup and condiments and napkins. But, back to the delicious pancakes. These flapjacks were literally the BEST I have ever had. And I am a pancake snob. They were huge, thick, fluffy, and simply perfect. The batter they use is so tasty.   All I can say is, I can't believe I lived in Pittsburgh for six years and I just tried this gem now. I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "ZVWJJnaWs5i8KxG18XzRIw"
  },
  "L_cYa7ljEKMjwsr8AzCqTQ": {
    "date": "5/13/2017",
    "text": "What a delightful diner this is Located on Mt Washington it's worth the drive up or incline up here. It's a little spot about 10 tables  Big photos of Old Pittsburgh adorn the walls We were warmly welcomed by Amanda on a chilly May night ...late as in after 10 After seeing their social media posts of yummy looking offerings of French toasts and pancakes and here we are Fresh brewed ice tea tastes so much better then the stuff that is clearly from a mix I ordered traditional French toast Wow it was just just perfect. Classic white bread triangles powdered sugar and nice butter pats on each slice served  piping hot so good who needs fancy stuffed (though it is on the menu) no syrup needed here  My dining partner had a traditional turkey Sammie served hot with gravy and mashed potatoes on white bread. Rivky asked is this carved turkey? It was a fine looking meal  Fries smothered in cheese was our side one thing I noticed burgh fries are not crispy like Long Island fries this is a good thing they are yum We are sitting and relaxing Amanda our waitress happy to learn we are moving to Pittsburgh my daughter realizes it really late  I said no worries this diner is open till 4am Friday and Saturday  It's nice cozy places like this that is one reason I'm coming back plus a check for two under 25",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "d0wKwQ0pXuAFIEmDUPOzaA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d0wKwQ0pXuAFIEmDUPOzaA/o.jpg"
      },
      {
        "img_id": "zoDGQ1EsUPjEsXkxW8tUoQ",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zoDGQ1EsUPjEsXkxW8tUoQ/o.jpg"
      },
      {
        "img_id": "MRMGdQB40w53c0MCrH_rTw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Turkey gravy hot Sammie",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MRMGdQB40w53c0MCrH_rTw/o.jpg"
      }
    ],
    "user_id": "k55-QGGiZwKI0l6mY2w_lQ"
  },
  "Mnlc1GJUHLbZtR8ICiGZxg": {
    "date": "10/9/2017",
    "text": "This place is a tiny little diner up on Mt. Washington.  We bought a Groupon that was $15 for $30 worth of food which was a great deal and we had no problem using it! This is a good place to come for a hearty breakfast if you can get a seat.  The potato pancakes here are really good and a nice way to switch up the usual hashbrowns or homefries.  I tried the corned beef hash, it was crispy which was good, but had almost more of a barbeque flavor than a corned beef flavor which wasn't my favorite.  Even though I didn't love my order, I would definitely come back again and try something else on the menu!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2PoFXMHOCiMwSDmvv3_3LA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. This diner really is micro!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2PoFXMHOCiMwSDmvv3_3LA/o.jpg"
      },
      {
        "img_id": "xONG_tngHM5ws1ka1znU_w",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Rye Toast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xONG_tngHM5ws1ka1znU_w/o.jpg"
      },
      {
        "img_id": "8SdIERrDakGQabHTrhGr_w",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Corned Beef Hash, a little bit of a different more barbecued taste",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8SdIERrDakGQabHTrhGr_w/o.jpg"
      }
    ],
    "user_id": "p7VESlDGmZpTP1Yck52Seg"
  },
  "rww5ldkhhVBYzxENBI2uWQ": {
    "date": "10/27/2018",
    "text": "I ordered French Toast, wife ordered veggie salad with mixed veggies, grilled. Mine was great, hers was awesome. Small place, friendly service. Decent coffee.  Worth the trip out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ckd5oA7Zv75xOeSaUlkl7Q"
  },
  "x_A5fKFRKpK4L4pdr1CAJA": {
    "date": "8/18/2018",
    "text": "Excellent food every time I've gone. Easiest to park at the nearby parking garage, and walk. Breakfast all day",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pDsbh4MkTz35-uS62g5GYw"
  },
  "CNhaH0OQDpwvlrOSf_rKEg": {
    "date": "7/26/2016",
    "text": "So far, I've been here 2 or 3 times and while the first time there were some issues with a coupon that I was entitled to use, I have to say this place is consistently good.  It's a diner so it's good diner food. I almost always get a breakfast sandwich oddly because basically the only time I go to a diner is when I'm in the mood for a good breakfast sandwich.   Always consistent and they're open late! Which is awesome because I live on the mount and late night food is few and far between up there.   Close to the overlook on grandview and still this place isn't touristy or overwhelming.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g4bWbLD5kQBaZ6VSRXxvHw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. My breakfast sandwich and home fries!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g4bWbLD5kQBaZ6VSRXxvHw/o.jpg"
      },
      {
        "img_id": "IfR1xaRcv2IgIEKgDa8NQQ",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Hot chocolate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IfR1xaRcv2IgIEKgDa8NQQ/o.jpg"
      }
    ],
    "user_id": "tJiWkQtxSmr4UdfEp-EYHA"
  },
  "qr15jbS1OWThSPShjAeAVQ": {
    "date": "1/1/2019",
    "text": "This was the most disgusting experience I have ever had at a restaurant. I ordered $30 worth of food on Uber eats. They forgot my soup, the salad was soggy and they put in the wrong dressing. When I called Micro Diner the woman was incredibly rude and hung up on me. When I called back and asked to speak to a manager she told me that she is the \"mother-f#%+ing owner\" and hung up again. This is the most disgusting behavior I have ever experienced. They were also super rude to the Uber eats driver. DO NOT SUPPORT THIS BEHAVIOR OR THIS RESTAURANT. AWFUL!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gH1wV5GN-98bZaSbAsIohg"
  },
  "1khnZ2ijLkeLeZyXfll8CA": {
    "date": "5/12/2019",
    "text": "Great breakfast. Very reasonable. Super nice staff. Parking lot across the street. Will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MvnBXKddW_u9jV6GbZ7BUg"
  },
  "pp2RDEbzEvHCPzzj9UUlwQ": {
    "date": "6/24/2019",
    "text": "A little worse than your average diner. I walked in and awkwardly stood for a bit until someone yelled \"sit wherever\" from the back. Coffee was average. I got the cinnamon bread french toast, which was nothing special. I've had better french toast in MANY other places. I feel like I was just eating for the sake of eating, rather than enjoyment. My boyfriend got the corned beef hash. We definitely don't recommend it. It didn't have enough corned beef, so it pretty much tasted like bland potatoes. The eggs were sad and tasteless. Everything looks better than it tastes!  I don't really have anything good to say other than there was plenty of seating at 8:30am on a Saturday.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Pv-pOC4ji8hcCKMktfvYcg",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Corned beef hash",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Pv-pOC4ji8hcCKMktfvYcg/o.jpg"
      },
      {
        "img_id": "YXhxEipZniaPgpZtKmPAEA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Cinnamon french toast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YXhxEipZniaPgpZtKmPAEA/o.jpg"
      }
    ],
    "user_id": "xR6F_SLgC4SiJ39RuxQ1YQ"
  },
  "VLJOIy0kvO5gjWxN92itig": {
    "date": "6/23/2019",
    "text": "Ordered this via grub hub or doordash or uber eats - not sure.   Eggs were half way cared about, the hash browns were cold and not brown st all- and the cheese on the scrambled eggs was still cold.   Also scrambled eggs doesn't mean upset an over easy egg and then let it cook and hard to a frisbee then box up.   Wasn't worth it. Hated ordering it and would rather go to the place and say I was there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NEKtao7ZSy6iBjV6ECMaiA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NEKtao7ZSy6iBjV6ECMaiA/o.jpg"
      },
      {
        "img_id": "9oSPYw8eCnrTuc-SO4llVA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9oSPYw8eCnrTuc-SO4llVA/o.jpg"
      }
    ],
    "user_id": "IrxksmWRD9rRivs7JE6IKg"
  },
  "UxBHuJasYMtttoDVuO-bkQ": {
    "date": "9/14/2019",
    "text": "Small establishment with a decent breakfast menu. I got the sausage breakfast sandwich which came with home fries. Sausage was an interesting texture, very chewy with some pieces that didn't taste great, which kind of ruined the experience. Will have to return to try something else on the menu. Other than that the place is very clean and the service was great!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Y0XMA904CqccjZarkVZJg"
  },
  "lwfdGapxaMXuwpXLhYJrow": {
    "date": "1/6/2019",
    "text": "I was not expecting a lot when I came here for lunch recently.  However both the food and service were above and beyond.  The place definitely gets crowded and is small inside, so you should expect a slight wait if you are going during a busy time.  The setup inside is really cool and has an old school diner feel.  You can sit at the counter and watch them make your food which was fun.  The servers were all working so hard during our time there.  They had a tough job, as the place was packed, but they did a great job getting the food and drinks put quickly.  For my meal I went with the French onion burger.  I ordered the burger medium rare.  You never know what to expect when ordering a burger at a diner, but this place does burgers right.  It was cooked perfectly, was juicy, and the meat had a great flavor.  The burger was topped with carmelized onions and provolone.  If you like French onion soup, this is a must try burger.  I would have liked a little less bun, as it took away from the great flavor some, but overall it was a great burger.  My friend had the hot turkey sandwich with mashed potatoes and said it was very good as well.  Will definitely be back to try some of their other menu options!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q-nYKO3DwbBaICMfPagSEw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. French Onion Burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/q-nYKO3DwbBaICMfPagSEw/o.jpg"
      }
    ],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "_U8FDychOqSltiULJQEsPw": {
    "date": "9/15/2019",
    "text": "O.K food. Terrible service. I went alone and sat at the bar area. I ordered a coffee and a breakfast sandwich. The food came reasonably quick. However when it came time for the check, it took forever. The woman cooking the food was loudly arguing with the other woman working there. It was disturbing other patrons. After waiting and waiting I raised my check in the air but no one seemed to care. Another patron told her I wanted to pay and she said \"everyone needs to calm down\". I finally got her attention to which said \"I don't have change\". I told her I had a card to which she huffed over and grabbed it from me. Never coming back here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "80a_Mtv9FcyySIlnIq5EAQ"
  },
  "lpsF80yi89VyY_v7ORkpKw": {
    "date": "3/29/2019",
    "text": "Located right off Shilo street, Micro Diner is a must stop. It's a small diner with a warm, homey feel. The food is tasty and the views are excellent. Shilo street is one of my favorites, and this Diner truly contributes to that. Their Micro Breakfast (which is what is pictured) is filling and the perfect, traditional morning meal. They have a variety of options, so there's something there for anybody! I definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GQMtNxu4ZmRhSuwjmNJyHA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. The Micro Breakfast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GQMtNxu4ZmRhSuwjmNJyHA/o.jpg"
      }
    ],
    "user_id": "VdVb5Eipk1B5uupaC3J_0Q"
  },
  "dlKiZ7OtSGDkrSFxKaD3FQ": {
    "date": "5/3/2019",
    "text": "This seemed to be a more affordable option on Mount Washington's Shiloh Street. They seem to specialize in breakfast, but I was hungry for lunch. I had the Chicken Caesar Pita. The grilled chicken was moist and flavorful. The French fries appeared to be hand cut. I was very satisfied with my lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "nDS68-Z9x21817kgKECNcQ"
  },
  "Ry1_VkFbuLb73LKkfmI_DQ": {
    "date": "8/31/2019",
    "text": "Great place! I went in with only 25 minutes to spare before I had to be at work and they were super accommodating and got my food out right away despite having a full restaurant! Staff is very friendly as well. Will definitely go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wyQqF_u09yTknnm6H2zb3w"
  },
  "8HYbxLYbjsmYFMF5rhyxSg": {
    "date": "4/5/2018",
    "text": "I will say I'm a big fan of this place. However I do have some complaints. We came here for brunch with friends and the waitress misplaced my friends order. Not only that, she also forgot my bacon and forget to ask ask the kitchen to make my hash brown crispy.  Anyway, enough of that. I ordered the macro with bacon. Everything was delicious. Their good ol plain pancakes wasn't anything different, i don't know if I'm just craving for pancakes that day I just really enjoyed them and inhaled them so fast.  The French toast look really good though, I would like to try their different French toast next time. Everything here looks delicious to be honest!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bs7f-kjswABPZWmZtflAUA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Macro Breakfast minus the bacon :(",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bs7f-kjswABPZWmZtflAUA/o.jpg"
      },
      {
        "img_id": "o8GKnTCo4M2hWg5dUh4G8w",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Yum simple but delicious",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o8GKnTCo4M2hWg5dUh4G8w/o.jpg"
      }
    ],
    "user_id": "X0ThBT2nXkeEFzd7RSuy6Q"
  },
  "nDEnSAfEcOdh60fdUJfL9Q": {
    "date": "7/7/2018",
    "text": "Came here for the first time for lunch on a Saturday.  I ordered the veggie omelette with red potatoes hash and wheat toast.  Hubby ordered the french onion soup, fried provolone, and blueberry pancakes with bacon.  Total came out a little over $30 (not including tip).  What's Hot - Quality.  Hubby's french onion soup was good.  I liked that my veggie omelette had feta cheese inside.  It gave it nice flavor.  My red potatoes has was tasty, as well.  Not overly seasoned and not too salty. - Menu selection.  They serve breakfast all day, which is always a plus for us.  Their non breakfast menu looks good, too.  They have sandwiches, burgers, appetizer, vegetarian options, etc...  - Location.  It's within walking distance (a few blocks) from the Monongahela Incline, which is nice.  Easy to find.    What's Not - Price.  When hubby ordered his blueberry pancakes, the waitress asked if he wanted bacon.  Hubby said yes, but the waitress did not tell us it is an additional charge for the bacon.  2 slices of bacon is an additional $1.75.  If something is an additional charge, I believe the wait staff should check with the customers.  I'm not opposed to paying, but I like to be an informed customer and know what I'm paying for.  Additionally, I'm also the type knowing that a cost is for a meal, rather than everything being a-la carte.  My veggie omelette with potatoes and toast is $8.99.  Good price for a whole meal.     - Service.  So-so and not great. There were only 2 waitresses.  Don't know how many were in the kitchen.  There were also 4 other tables with customers while we were there and we noticed service was pretty slow.  It's a mom and pop restaurant, but my guess is that it doesn't take much for them to get busy, especially if they only have a wait staff of 2.  The day we were there, their credit/debit card machine wasn't working properly.  They had a sign taped to the door saying cash only, because of some glitch.  Definitely not cool.  Don't know if this is a regular issue for them.  However, credit cards worked.  After the waitress took our order, she charged us right away before the food came.  Problem with that is we're expected to pay the bill (including tip) before anything is even served.  Didn't like that.  - Quality.  Their food isn't bad, but it isn't the best.  I've had better.  For example, their fried provolone triangles is basically fried slices of cheese.  Not the most flavorful and not a lot of cheese.  When you take a bit and look inside, it's very little cheese.  Some of our cheese melted on the outside, which meant there was none left inside.  Additionally, I like my omelettes fluffy with a decent amount of egg.  Their omelettes are 3 egg omelettes.  The egg was so thin and didn't do the omelette justice.  However, different strokes for different folks.    Final Answer Willing to come back, but not a first choice.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lYgVqmINYyKyTb754hJCKA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Veggie omelette",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lYgVqmINYyKyTb754hJCKA/o.jpg"
      },
      {
        "img_id": "4a8FYrDJMxHEe-Q7pbo-Mw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Blueberry Pancakes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4a8FYrDJMxHEe-Q7pbo-Mw/o.jpg"
      }
    ],
    "user_id": "eYUt3Va-5w-NrCBxD_PrFA"
  },
  "TdVaJzfUXDD88b92-wxeiw": {
    "date": "1/10/2019",
    "text": "So the past few times my friends, workers and I have gone here, the service has really been lacking.  It seems like ever since the ownership changed they don't know what they're doing. Keeping people waiting crazy amounts of time for something as simple as a burger when the place is EMPTY is ridiculous.  I will no longer be recommending this establishment to anyone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "diq97ZN5hG_HVsbopHE92Q"
  },
  "0Gb6a-vJ5nwfJxTUjiRllw": {
    "date": "2/5/2018",
    "text": "One of my new favorite diners in Pittsburgh. I stopped here the other night for a late night bite. I ordered the patty melt and my girlfriend got the sausage Sammy and a pancake.   Our waitress was kind and seated us as soon as we came throught the door. If you visit this restaurant I highly recommend asking for Amanda! She always refilled our waters and even though they were busy she did not forget about us.   Our food took maybe 15 minutes to arrive to our table. The pancake came out first before the rest of our food. We finished eating it in maybe 2 minutes it was so good. Their pancakes are some of the best I've ever had at a restaurant. They were fluffy and buttery topped with powdered sugar. It was so good we did not put maple syrup on it. (We ended up ordering another.)  The sandwiches came shortly after. I ordered my burger medium rare and it came out exactly that. I've never ordered a burger at a diner and had it cooked so perfectly. It lacked a little seasonings but over all it was delicious. I would get it again any day. The side of fries that came with the burger were great! Seasoned perfectly with salt and pepper. There were so many I hardly finished them all.   The sausage breakfast Sammy was good as well. The sausage seemed to be homemade. The eggs weren't over cooked and there was a perfect amount of cheese.   Overall this experience was pleasant and enjoyable. We went a little too late on a Friday and ran into some drunk people. I recommend staying away from here on Fridays and Saturdays past 11. If you live in Mount Washington it's a great little spot to hit after the bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0N91KZHstHSnKwJVRa2p2g"
  },
  "5FQuR4wnG6mmM8ghIulkAA": {
    "date": "8/22/2018",
    "text": "Micro diner was great! I wouldn't say it was my favorite breakfast/brunch spot in Pittsburgh, but it was still yummy and it was cheap! First off, CASH ONLY. It's located on Mt. Washington, but unfortunately you don't get the great view of the city from the restaurant. However like I said, the food was delicious, fast, and cheap! They offer breakfast, as well as lunch/dinner. I ordered a breakfast sandwich and my boyfriend got an omelette with some fries. The fries could've used more salt, but it's better to be less salty than overly salted. His omelette was good, as was my sandwich. I appreciated that they had turkey sausage available as a breakfast meat option.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "libunRQaC_wqmUicbNAPUQ",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Omelette with side of French fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/libunRQaC_wqmUicbNAPUQ/o.jpg"
      },
      {
        "img_id": "TIZizbzn33WaaRxBB-5HVA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Turkey sausage and egg sandwich on wheat toast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TIZizbzn33WaaRxBB-5HVA/o.jpg"
      }
    ],
    "user_id": "ENZbh_u6v1vT_zTUW3vZGw"
  },
  "25LYsCaUTvzBjSYSgSrvVA": {
    "date": "1/4/2019",
    "text": "This place is a little gem in the Mt. Washington area. My brother and our pap went there frequently. After the sudden passing of our pap we decided to have the wake there because it was his favorite place. I can see why, the staff was amazing and make you feel right at home. Our waitress Connie surprised our family with a nice set up and chocolate milk martini glasses(chocolate milk was pap's favorite). It definitely brightened our day. I can't thank this place enough. To top it off their food is AMAZING! I can't wait to bring my kids up here more often. Thank you Micro Diner",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tQUHJoBmooNZ_he4Os3pvw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tQUHJoBmooNZ_he4Os3pvw/o.jpg"
      },
      {
        "img_id": "JJOG15hJAhVtqVeYHovzvA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JJOG15hJAhVtqVeYHovzvA/o.jpg"
      }
    ],
    "user_id": "BRQqZuIxNzGZ3LQsd_e58g"
  },
  "UjFmn_DmGphKbQFvh6XjFQ": {
    "date": "4/28/2018",
    "text": "I really wanted to like this place - it's exactly my kind of breakfast spot and the menu looked yummy.  I also heard that they occasionally have biscuits and sausage gravy, which I am a huge fan of.  This visit was lacking though.    The servers were all friendly enough and they were hustling, but the actual service had a lot of flaws.  We started by ordering one coffee.  She brought two - no biggie.   We weren't ready to order when she came by the first time.  When she came back, she didn't have her ipad, but took our order anyway.  She could have used the ipad.  My companion drank four cups of coffee waiting for our order and we were quite hungry when it arrived.  The server delivering the food had our order plus part of someone else's order, which she tried to sort out at the table.   She asked us what we ordered, but then still didn't quite get it right - we were missing toast and had an extra side of bacon, and my bacon wasn't well done as requested.  We decided to go with it and rolled on.    As for the food, all of it was under-seasoned.   Part of my order was the potato pancakes, which I ordered because they were house made.  Unfortunately, they were not cooked quite long enough.  Edible, but the texture was off.  The toast was cold and smothered in butter.   All in all, it was fine, but not great.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "h9LPugJk2cpIh0gmQb5LnQ"
  },
  "2ZjrTjiXIRg5xfMhqW1IWg": {
    "date": "1/14/2019",
    "text": "Cute little diner. Not sure if this diner is always cash only, but there was a piece of paper that fell off the front door that happened to be stuffed under our table and one of the employees came over and asked what was under my chair.... Turns out it was the sign that was supposed to be posted that says \"Cash Only.\" Neither of us had cash with us, so my friend had to run across the street and grab cash. Food was delicious (basic diner food). Will probably be back next time I'm visiting Pittsburgh!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oS0xZPoLmfnMqH1NMdXwIw"
  },
  "HJ649-LVEcfVlXjBwDejJg": {
    "date": "6/13/2019",
    "text": "The waitress was friendly and it didn't have the typical grease filled diner smell but out of the four orders of food we got for the 4 of us, two plates had hair in it!! This is disgusting and unprofessional! It made the food unsatisfying and uneatable!!! This is an easy fix and shouldn't happen as it did!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ItOvb6bei4757TdtF-up5A"
  },
  "ErErWytdN9rjdIeY5QcUcA": {
    "date": "3/31/2018",
    "text": "I can with my girlfriend and two friends to enjoy some brunch/breakfast type food on a Sunday morning. We arrived around 12:00 pm and ended up being seated around 12:30. I had the cinnamon French toast that was served with Texas toast bread. I found it fairly delicious but it could have been crispier. The turkey sausage on the side was a nice addition as well. The only issue were the attention on water refills, and the mixed up my friends order and took a long time to get him a simple breakfast sandwich. I'd go back just for the general simple diner ambience and appeal. The people were really nice overall as well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JIO3CZI-EaxdOTU7UpDW0Q",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Cinnamon French Toast Breakfast and turkey Side of Turkey Sausage Breakfast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JIO3CZI-EaxdOTU7UpDW0Q/o.jpg"
      }
    ],
    "user_id": "oogG6am_fY37MZZFxsYAcw"
  },
  "RZi1pdyjd7yr1thowvRslg": {
    "date": "6/19/2017",
    "text": "Wife and I and kids and just moved to Pittsburg from New York and it was around 12 midnight and we were starving. Wife decided to go to the Micro diner. I had the house salad and a pot roast diner. I also shared a french onion soup with my daughter. I will start off with the only negative aspect which was the french onion soup which was terrible. The salad was great and the pot roast was over mashed potatoes with tons of delicious gravy. I have to say it is probably the best pot roast I have ever had and the gravy was amazing. The service was fantastic and prices were very resonable. You can be sure I will be going back there again for more. Definitely 5 stars and would highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 10,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "_l04jPtbfZ6Gh42PRK7VZA",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_l04jPtbfZ6Gh42PRK7VZA/o.jpg"
      },
      {
        "img_id": "0X9Zvn_2_rgX4Szyimhqvw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0X9Zvn_2_rgX4Szyimhqvw/o.jpg"
      }
    ],
    "user_id": "hg71CGHy9bwpgY8cGVVg4w"
  },
  "hKHe745b0JRfiFPx9tRFcg": {
    "date": "5/10/2014",
    "text": "Living on Mt. Washington, Micro Diner is our favorite breakfast, lunch, or 2am joint on the Mount. The food is delicious, the service is great and the price is fair. It's a small diner, but the food blows it out of the water. Everything we've had has been delicious! It's homemade, American comfort food at it's finest. All it needs now is a liquor license. I'm highly recommend the Micro Diner.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 10,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "8NYO9Pu0KlAg1MueWfh0wg",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Meat lovers with a side of fries.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8NYO9Pu0KlAg1MueWfh0wg/o.jpg"
      },
      {
        "img_id": "eW-61er9_bcHwmWE3L503Q",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Micro breakfast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eW-61er9_bcHwmWE3L503Q/o.jpg"
      },
      {
        "img_id": "XNJPdnv0QB5251emH2vg4g",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States. Buffalo Chicken Sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XNJPdnv0QB5251emH2vg4g/o.jpg"
      }
    ],
    "user_id": "I_oxL1fLfT-tf2UMhh4ZYg"
  },
  "3C2R-RrwiksaXZrMpR9Agg": {
    "date": "10/10/2016",
    "text": "A must stop for any Pittsburgh tourist.  Great food, cool off the beaten path part of the city & a short stroll to the scenic overlooks of the Pittsburgh skyline.  Really enjoyed the meal...great homefries and potato pancakes.  Will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kxtenssAF9p_vQOCtblciA"
  },
  "r9lyv8OyGvZ9gILKZyZ0lw": {
    "date": "5/27/2014",
    "text": "I was very surprised by the lack of enough restaurants in the most touristy place in all of Pittsburgh. Though I wasn't very impressed by the number of yelp reviews, we decided to give Micro diner a shot, as Amanda, our waitress convinced us that they had plenty of veggie options for us.  They serve breakfast all throughout the day, which is amazing because, frankly, who doesn't like breakfast food? We got the veggie omlette and grilled veggie sandwich. The portion size is rather large and the food was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "-gnA4aesGpa4w9YPnWuV9A"
  },
  "7OXb_5mA09sAws0PcPwy1w": {
    "date": "7/29/2016",
    "text": "I love the Micro Diner. My husband and I come here often. All of the food is great, but we love the breakfast. On holidays the chefs come up with fun specials. I had Irish Cream french toast that was to die for on St Pattys Day weekend. The waitresses on the weekend mornings are amazing, but most of the wait staff is awesome. They're all great at refilling coffee and water, which is my number one requirement for good waitresses, and they're very friendly. Even when they are busy, they get you a table quickly. We have never waited more than 15 minutes, even on a busy Sunday morning. If you're on the Mount, definitely get brunch here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zhcHzAEeBlv41aW_odTxNg"
  },
  "LMOVgFEemKR1IZE6Vq8bUQ": {
    "date": "7/18/2016",
    "text": "waitress forgot I asked for water, the cook was very friendly, everyone was all around really nice. The corned beef hash was most certainly the best I have ever consumed. it was flawless. it's all about the spice and these guys nailed it. For crappy free-refis coffee, it was actually pretty good. I had like 4 cups.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GJDLiiiq81bPY9aY4Amfgg"
  },
  "iIhKexjPBBtyzQU_RkujgQ": {
    "date": "7/8/2017",
    "text": "I probably will never get a chance to return to this place again. But my one time there couldn't have been better. We live in Las Vegas. I grew up in Pittsburgh in the 1960's and early 1970's before moving away. Since then, I had only been back once, in 1991. I had always wanted to take my family there and show them my hometown. And this past week, I got to do it. We were staying at the Sheraton, at Station Square. Our first night, we took the incline up to Mount Washington to view the city. The next morning, we were looking for a place to have breakfast. We didn't want a touristy place. We wanted a place with a local feel. I researched Yelp and found the Micro Dinner on the top of Mount Washington. We once again took the Incline up to the top of the hill, then walked about 5 minutes down Shiloh St. It's a great little neighborhood. If your driving, the parking on the street is .25 cents per hour! The Micro Dinner is great. All the tables were full, so our family of 4 sat at the counter. The staff is so nice and friendly. The food is wonderful. And prices are great. We had breakfast items. But I was so impressed with how good everything was that I looked at their lunch and dinner items. It really looked good and reasonable. We were very busy during our stay and never made it back. But I can assure you that if we're ever back in Pittsburgh, you'll find us at this great little place. And to the staff. Thank you for being so nice and serving such good food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HYRHPLKamrsgDqoYjUwC6Q"
  },
  "W4o0vJ9VO48fGTajrI1fng": {
    "date": "6/3/2014",
    "text": "The Micro Diner is an enjoyable place with not much flair or theatrics. The food is passable but nothing to write home about. Our waitress was friendly but it did take a bit to get our grub. She was singing along with the radio which I found to be humorous and effervescent.   Overall, go if ya got no place else to go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9olpPYmaiCqIgOyLrmT24g"
  },
  "p1GP5HQ8p5mdPWUvjJJqEA": {
    "date": "8/28/2016",
    "text": "Unbelievable food.  The service is a little disorderly, but it's a small enough place that the combined efforts overcome thier process problems.  The Italian Omlet was ridiculously great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SvSBLZaAuemi6B-qk1stow"
  },
  "ejPYLtGUbkd4AswYfSLK1Q": {
    "date": "3/3/2016",
    "text": "Micro Diner has amazing breakfast.  The food and prices can't really be beat.  The only problem is the amount of seating, and occasionally the amount of time you wait for your food sometimes.  Still, worth the wait",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jSHt8v7GCcrTDbmxqOKFNw"
  },
  "zRPHyIh8ueJUZkdJrI8hJQ": {
    "date": "5/5/2014",
    "text": "Pretty darned small but big on tastey foods.  We arrived earlyish and sat right down.  The menu is typical dinner fair of breakfast and lunch items.  We went here for breakfast a few weeks back and I had a burger and my wife had a wrap.  The fries were exceptional.  Prices are also good. Server was friendly and it was her first day.  The biggest drawback was that we found a bolt in the wrap.  Apparently they noticed that some cookware item, a pan or something was missing a bolt  and the waitress appeared immediately after we discovered it.  I would guess she was on her way to investigate our meals as soon as they found it missing.  Either way we were comped the wrap and we were not to taken aback by it.  At least they are clean enough back there to immediately notice something like that. They were very good about the whole thing.  All in all it was a good experience and we wil lreturn.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "B7aR8VlLMGzaJ7NHC-jeMQ"
  },
  "-R5wGSdTWcE-4AcuxySdIQ": {
    "date": "9/29/2015",
    "text": "Very few places have made me more proud to call Mt. Washington home - and this is one of those places.  The food is extraordinary! If you like the original diner experience and taste, then this is the place for you. On multiple occasions I have ordered the Italian omelette here with a side of hashbrowns, and it was cooked to perfection.   The staff is extremely pleasant and helpful as well. They are always friendly and cheerful when I walk in and are quick to spark up a conversation when they are able.  If you want to truly experience a gem and cornerstone of the Mt. Washington area, then look no further.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pKRu_hYiZgmuZY2_yBXLVQ"
  },
  "U0Ptu911Ok-E9B5p_p8dDA": {
    "date": "8/8/2016",
    "text": "It'll do if you're drunk, last couple times I went had to wait a little longer then planned but food was good staff was friendly, cook was staying busy props to him, one time tho a while back we ordered food that was apparently never rang in, waited then found out it \"wasn't rung in somehow\", got our money back because we had to go to work couldn't wait any longer. Foods is good, bottom line if that's why you're reading reviews.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nwy8uwq8kdL0M4bDxBGcUA"
  },
  "sPHGqxGv02spw30fhFWipA": {
    "date": "10/26/2014",
    "text": "Great breakfast place! And right now the street from the famous Mt. Washington lookout. After breakfast you can take a stroll on over and walk off those extra calories. Make sure to try their ham and their pancakes!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2JP8PVIAUAWjoKw9yJ9NAQ"
  },
  "lWprZUShcbi4aPNNIRBJDg": {
    "date": "7/21/2017",
    "text": "Quaint little diner. Good service and food. Great place to eat at when visiting the top of the Monongahela incline-well within walking distance.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hmy_ioG_BuHTPxKnlwim1A"
  },
  "b6OXYirTxcl5gEQbAch8eg": {
    "date": "5/4/2016",
    "text": "Great omelet and breakfast. We will be back tomorrow before we leave to go home. Loni is avery friendly and helpful person.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F1a_gzV-V9oqq-yHKHPTBQ"
  },
  "YSGVKqtEGYRRLexOHvPlDg": {
    "date": "8/8/2017",
    "text": "Their nontraditional hours make this a place I can usually always grab food. Leaving work at late hours, this is a big deal. Grab a buffalo chicken sandwich, or an omelette.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XB7bqRJ8c-g2OKHReMxjlA"
  },
  "Pft9UAgB9YNx_RBe7CdQzQ": {
    "date": "8/24/2017",
    "text": "We stopped in on a Friday night at 7.  Connie the manager couldn't have been more gracious and friendly.  Highly recommend Micro Diner for its home cooked dinners.  The meatloaf was to die for... We will return for breakfast.. if our dinner was any indication the breakfast will be spectacular.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AH4MZcHyuj8hDqsgjuEt4w"
  },
  "KBv7h0au6w77t6_hlxePDA": {
    "date": "5/28/2017",
    "text": "Five stars. Service is excellent, the food is delicious. We sat at the bar facing the open kitchen, 2 chefs sending out goodness nonstop. Busy but no wait on a Sunday morning. Pancakes and corned beef hash were particularly good. Must try if youre in the area and riding on the inclines.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HK2nmpf_8oMRdXyfqvkXNA"
  },
  "YZWz0nYCC9UTDiwR9q3jZw": {
    "date": "7/7/2016",
    "text": "I ordered a 1/2 off coupon prior to visiting this establishment ($7.50 for $15) Merchant took coupon, then came back and said it was no good.  Made me pay full price. I followed up with the coupon vendor and they said the Diner itself marked it no good. Tells me they're probably gaming the system at customers expense. Coupon vendor refunded my purchase, but what a bunch of bullshit i had to go thru because of Micro Diner. Food was meh ... I won't frequent again, or recommend to anyone either",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e11oJit7qMOxUM14omSzyw"
  },
  "tAi5VvQajQYX6ZJPxk9w3Q": {
    "date": "6/29/2017",
    "text": "May be better I'd  had got what I ordered.  Ordered griiled buffalo chicken wrap w/ let, tom, pickle and ranch got fried chicken w let, tom no pickle no ranch.  Waitress spent 20 min talking to out of towners at the counter never even checked on us decided to just eat it instead of waiting half hour for another sandwich",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ggqHZ3Woqjk1HYzfQ1j9fw"
  },
  "nTkyjd4z_hgiurAXbdZBjA": {
    "date": "9/18/2015",
    "text": "Finally made it to Micro Diner on Mount Wash!  My friend and I meet up there at 9 a.m to catch up and discuss life. We sat at the bar that overlooks the tiny kitchen.  Initially it was just us and another guy finishing up his eggs.    We were promptly greeted and I inquired into their gluten free pancakes! The woman checked for me and said they still have them and wanted to confirm that $6.99 was okay. I thanked her for asking and said absolutely! They came out lightly brown on both sides and perfectly cooked.  The kielbasa side I ordered while small was very good too. My friend got the micro breakfast of eggs and home fries  and said it was good. By the time we got up the whole place was filled!  Would absolutely come back the next time I'm around for breakfast!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FHujkOFlpkpG6NGSzn2E2Q"
  },
  "rZ7Unpyh_w4yqJkp608eYA": {
    "date": "11/19/2016",
    "text": "It's pretty hard to screw up breakfast. But they managed to do it. Got both of our orders wrong. We wanted to like this place but I just can't recommend it to anyone. So many better places out there. Our waitress was very nice about the screw ups. nothing worse than an unsatisfying Saturday morning breakfast.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mzkdlf9u_jHRCrujANaqYg"
  },
  "SQCqyn-fgnDCpgHGOM4cZA": {
    "date": "5/24/2017",
    "text": "If you are looking for a casual, local experience this is it. Good food, reasonably priced, and large portions.  The micro referred to in the name is for the size of the diner, not the food or preparation.  You can sit at the counter and watch your meal being prepared pretty much right in front of you.   I usually get my food to go because it is very loud in the diner.  Two TVs going, plus a radio, the staff hollering back and forth to each other, and almost always there are a few locals hanging out having colorful discussions. I prefer my meal without a side of opinion so I don't stick around.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vlUXqMgw3PWev9I3Vhh4nA"
  },
  "kYUB6U49q6v9VgPqFZn2wA": {
    "date": "8/21/2016",
    "text": "J and I came here for breakfast a few weeks ago. We were lucky to find a parking space right out front since t can be hit or miss in Mt. Washington. We got there around 11am, and were seated pretty quickly. The place is small, with only about 6 tables. The walls were decorated with art and photographs, most for sale which was nice (albeit a bit pricey). Our drinks and meals came fairly quickly. J ordered coffee and the micro breakfast and I had cranberry juice and an omelette with spinach and tomato. Everything was pretty good and inexpensive. We will definitely be returning!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BfX5cChtKJZMhWHLB1K1eg"
  },
  "uAGxvikCPhdP7VYoDuqd6g": {
    "date": "6/5/2015",
    "text": "Don't waste your money.  We went here based on good reviews.  Seating is comfortable.  My husband ordered a Ruben and fries.  The waitress said good choice.  He was really looking forward to a good Ruben.   Very disappointing  it was over cooked meat dry, not enough sour kraut, lacked thousand island dressing.  The bread was toasted heavy instead of lightly toasted.  One bite it was so bad did not finish it.    My son and I had the micro breakfast.  Eggs were tasteless no seasoning.  The home fries were just cooked potatoes that were dry like the had been sitting since this morning and were reheated ketchup didn't even help the cause.     The waitress said would you like a box for the Ruben?  I told her that it was not good and we would not be taking it.  The waitress sent a woman to our table to explain to us they use very expensive corned beef and she squeezed the meat and did not feel over l cooked.  She went on to say that she never gets complaints in fact compliments on the Ruben and maybe it was not to his liking.  Well sorry he has eaten many Rubens and this is 2nd worst he has ever had.  She apologized as the waitress dropped off the receipt for my paid check.  I was told I will get you a gift card.  For what I will not be coming back keep your gift card.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_-B4IHj-1kforTa4p4kwNw"
  },
  "eZVZFaMXh6Jc54gsvCLaVw": {
    "date": "7/18/2016",
    "text": "Wait service here was about as messy as I've ever seen it in any restaurant I've dined in. One waitress took our order and just jetted away before I could order an additional item. Another waitress knocked the coffee over on the table and nearly ruined my girlfriend's dress. They slipped us a check about half way through our meal (probably to make room for a party of four that were waiting for a table). Felt like we were rushed along.  Foodwise: the pancakes tasted great, but they came out before the omelets. The omelets weren't anything special - basic diner grub.  Wouldn't come back here if I'll ever go back to Pittsburgh (don't know why I ever would though, honestly)",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hZEZKW-DfhTUBWd1RYcnsA"
  },
  "w9mIhPzaetm8oN9tS4noyg": {
    "date": "4/6/2017",
    "text": "It's good if you want a basic breakfast. I wouldn't recommend getting it delivered, it rarely shows up warm.  The food is good, there isn't much out of the ordinary on the menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HA4PfDteLWS4sVW5CgxFWg"
  },
  "vDkwRxyztheMrhEmJaXuXQ": {
    "date": "5/16/2015",
    "text": "Nice cozy little dinner great food and service gets packed really quick first time here for lunch we enjoyed it!.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V4lgWiRTmcNaK8q9yHLn2A",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/V4lgWiRTmcNaK8q9yHLn2A/o.jpg"
      },
      {
        "img_id": "jCX_EZKcOzR3JQuZF2mmyQ",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jCX_EZKcOzR3JQuZF2mmyQ/o.jpg"
      },
      {
        "img_id": "iVYNQCU9CvXxzJwamXspmw",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iVYNQCU9CvXxzJwamXspmw/o.jpg"
      }
    ],
    "user_id": "AcLFYq6rprfTsewmHDEiIQ"
  },
  "CbsjtU0YIiyKgsPkwhyXDw": {
    "date": "4/1/2017",
    "text": "Visited on a rainy Friday morning. The place was warm and comfortable.  Got a table w my friend and were quickly greeted.  The waitress was great, got me coffee and took our order. Food came promptly and looked great.  Had a breakfast sammich and a potatoe pancake.  My friend had French toast and hash browns.  Food was good, nothing exceptional, a bit bland, but we enjoyed our meal.  Price was right, waitress was courteous, worth the visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dVq0qgeo3F3nmzGjDYElEw"
  },
  "KGxs8WUeEXOsxZwXArI1vA": {
    "date": "8/11/2015",
    "text": "I have eaten here before and it was fine. Today I grabbed a salad to go, more than half of my spinach was wilted and my cucumbers were literally rotting.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8G7wVor6UJXcx0ZCsSJ9lg",
        "caption": "Photo of Micro Diner - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8G7wVor6UJXcx0ZCsSJ9lg/o.jpg"
      }
    ],
    "user_id": "9JGaK7K8pXDwpKjPIsu08Q"
  },
  "Eifaax7J_dzkX6LEZq3f4Q": {
    "date": "12/18/2016",
    "text": "Love this place. Food is awesome and the setting is super-cozy-- you can watch them cook the food, which is fun! Family-run and you can feel it.  Will definitely go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VwdKDWlEamkDvD1cL9IvVw"
  },
  "oAO05JBrIqKstZPe0Za-5w": {
    "date": "10/31/2015",
    "text": "Excellent food, coffee and service.  The prices are very reasonable and there was no wait at 9:30 in a Sat morning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HKdCl7uryk0M0_G4SNDKZg"
  },
  "JPhNu-GndAqnJv0CcY_D-w": {
    "date": "3/3/2017",
    "text": "The staff was very pleasant and professional.  The vegetable omelette was good, but the hashbrowns were undercooked. My buddy had a strawberry-banana smoothie that he felt was watered down.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jcpfrMnLkcGebFP8T36Afg"
  },
  "Ey265n-GOeJE8uZzyYsY5Q": {
    "date": "2/25/2017",
    "text": "GREAT diner food!  Freshly made.  Nice portions and a very pleasant staff.  I think I missed the crowds, because other reviews said there are lines, but I could see with the quality of food that this place puts out, you may have to wait at times.  I had the meatloaf and it was awesome with a nicely seasoned brown gravy and REAL mashed potatoes.  Saw the cook making burgers and pancakes and other things, and they looked very appealing, so I got to make some trips back here to try those.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PXVt6mYWYhiCPooXpoeORQ"
  },
  "3zEbWLps38o8v-Ywxaghfw": {
    "date": "9/1/2014",
    "text": "Quaint little diner hidden atop Mt. Washington. This is a great place to take family and friends visiting Pittsburgh after travelling up the incline.   Relaxed atmosphere and layout. The staff are fantastic and knew a third of the customers - this tells you all you need to know. The menu was diverse and well priced with a selection of both healthy and hearty items.  Our orders came through quickly and were a cut-above standard diner food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZgdnPwzjIeFwWrhNZrVGcw"
  },
  "iiM_h9yIRLjOPTBjGe6DrA": {
    "date": "6/10/2016",
    "text": "Micro Diner has a great menu full of typical diner fare. I really wanted to like this diner more than I did; however, the fact that we all had something wrong with our lunches ruined it for me. And, I'm sure they're busy on the weekend, but I'm not a fan of rushed service. I've heard the breakfast there is much better than lunch so I'm willing to give it another chance - but won't be running back any time soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YNkbvkPhLMFlOFYH2PLMwA"
  },
  "IFbycpL6MB8DhUwCKZps7g": {
    "date": "1/7/2015",
    "text": "Cute and quaint little diner with pretty limited seating.  I had the Macro breakfast with two pancakes, sausage, hash browns, and eggs cooked however. It was very tasty. The hash browns were crispy and delicious but the sausage was a tad overcooked.   The staff was friendly when we arrived but not very nice when we called to see how busy they were. Whoever picked up said \"we're busy\" and hung up without another word.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "agXJ2q1yxRupMSBCT-FFXA"
  },
  "poiHR_teyuua_rT3WoEUZA": {
    "date": "12/29/2014",
    "text": "Local diner vibe. Local (limited) diner menu. Local diner food. The prices are reasonable. The food was solid. I wouldn't drive across town (next time!) for the food, but if I was in the area and looking for a quick bite, I'd definitely go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WazrNeLsBFLhlVzNMz89MA"
  },
  "VY2fa38vIRq7ZlBMJYzgQg": {
    "date": "7/15/2017",
    "text": "Stopped in at 4 am for our first visit for some good ass fries, stuffed French toast, and music",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4sR9lQx8Dv7zwB7wO03sdg"
  },
  "IOQT_3ye_SlF8Oltf2NXAw": {
    "date": "5/5/2016",
    "text": "My boyfriend and I stopped in randomly while touring Mt. Washington for places to live.  I love brunch, and this was the only local place that was still serving breakfast at 2pm.  Our waitress was on point with refilling coffee (must have coffee) and our food came out within 7 minutes.  It was exactly what I wanted for diner food.  I left completely satisfied from my endless coffee and veggie omelette with crispy hash browns.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gILJVZyu1Pzb9EuWpXk3mg"
  }
}