{
  "EZF0RBglRN5oxp7HDzr4Ug": {
    "date": "10/8/2017",
    "text": "This place had so much potential, but really missed the mark. To start, the building was new construction so they could have done whatever they wanted with it. What they ended up doing is a bland, generic looking build with an awkward dining room that lacks any form of personality. There's not really any good place to wait for your table to be ready inside or outside and you'll see people awkwardly sitting on the curbs in the parking lot while they wait. Sitting in that dining room you'd have no idea you were in a Mexican restaurant. The dining room has two story ceilings which are impressive, but just highlight the lack of thought that went into planning the space. The walls are bare. It's just a giant plain room with tables. There is a tile accent wall and fountain which are pretty enough, but are kind of boring and there doesn't really seem to be any rhyme or reason for them. The food here also leaves much to be desired. It's bland and cheaply made. Our quesadilla had fake velveeta-type cheese in it and was served with translucent lettuce and the smallest dollop of sour cream that was barely enough for a single slice of the quesadilla. Not only that, but it was a pretty small serving for the price. Only three little pieces. The fish tacos were bland and the sauce served on the side for them was decent, but super runny so it didn't really stick to the taco well enough to flavor it. Considering Mad Mex is right down the road, I probably won't find myself here at Emiliano's ever again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fhAk9y00oF5yvXwn8gl3JQ"
  },
  "zsN8qkqsRr6s7BUtBGVJGA": {
    "date": "1/3/2018",
    "text": "My husband and I had a great experience at Emiliano's on New Year's Day night -- a time when many restaurants are either closed or have the \"B\" team on as a skeleton staff.  This was NOT the case.  We sat at the bar in a warm and welcoming atmosphere.  Our food was excellent (great dressing on the salad), excellent frozen sangria margarita, and perfect chicken suiza enchiladas and tacos.  Our bar tender, Edward, went above and beyond with his customer service and was a delight to chat with.  We are from VA and we plan to recommend this restaurant (in a beautiful new building) to our family and friends who live in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bgzBfhjpqk_Dtryt0MMv7A"
  },
  "wCVNnWeGd0JDs4H6rcmRng": {
    "date": "12/20/2017",
    "text": "Nice food...great flavors, good portions and very generous corn chips and salsa...Margaritas could be improved...Kind waiters and easy parking...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iJRIeJpX4MD0X6DvossTTw"
  },
  "QbBuwXgPmMvClmeqek0zdA": {
    "date": "4/16/2018",
    "text": "Stopped by for lunch today for the first time . It's a pretty big restaurant with two different sections. One section has a beautiful waterfall decoration. We sat at the other section in a booth by the windows . The bathroom sink bowl was very pretty decorated with roses. Our waiter was very good. I had ordered my dish but needed to run home quickly to receive a delivery . When I returned, I didn't even have to ask the waiter for my food . He had kept my dish in the warmer, and he had brought it out immediately as he noticed I had just walked in. I ordered the fried fish tacos which came with pico de Gallo ? , a spicy sauce, and some yummy rice all for like $8.50. We were also served the complimentary nachos and salsa. My friend who is gluten free got the shrimp tacos and another friend ordered the avocado chicken salad which they both enjoyed . I would definitely return because of the great service, beautiful decor, and value for my money. Give this new restaurant right near Lowes a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3F2-bRbYBbQF2JsuSzvug"
  },
  "_BdFV6oM7VfGoVB16IvKAg": {
    "date": "11/4/2017",
    "text": "Emiliano's is one of my favorite restaurants and I have been going to the Gibsonia one, where you can sit down, order, eat, and leave within 45 mins. The first time I came to this Emiliano's was about a week after it opened and I was unimpressed, but figured it was just because the location had just opened. After going for a second time, I can definitely say the poor service was not because of the restaraunt recently opening. It is a Saturday night, so it is normal to have a 50 minute wait, except nobody else was in the waiting area and the hosts didn't give a buzzer or take my name. However, they did in fact seat us after 30 minutes. The waitress did not come to our table for about 5 or so minutes and did not come back with our waters for another 10. She then took another 15 to take our order and bring more salsa. It took one hour for our food to come and it was cold when it came. They forgot my tortillas and sides as well. Our waitress went to the table next to us and didn't come to check on us for another 5 minutes and then took a few more minutes to bring back the tortillas, which she said were already prepared and they just forgot them. The chicken was dry and the breasts were very small. When I opened up my napkin for my silverware, it had what appeared to be mold on it. She brought us our check before taking our plates and then ended up dropping and breaking a dish, which was obviously an accident, but was just the icing on top of the cake. I will definitely be staying at the gibsonia Emiliano's.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ieju5ou_wCSMbu6sVsyLKw",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Something that was on my napkin when I opened it",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ieju5ou_wCSMbu6sVsyLKw/o.jpg"
      }
    ],
    "user_id": "mMLqVNMb4zTIWl3_uAbjgw"
  },
  "la5vg-CbXazupmTfJLIfuA": {
    "date": "11/2/2017",
    "text": "Our first time will unfortunately be our last.  To their credit, they took a reservation for our party of six and we were seated promptly.  That is the last good thing about the evening.  Service was horrible.  As we looked around for our server, we noted that there were no servers anywhere on the floor.  Whenever anyone asked for anything, there was a long wait before it was brought to the  table.  Food was tasteless.  Chicken was bland and had no taste to it.  My husband's shrimp was also tasteless.  The others in our group all agreed.  On a side note, even though the place has only been open for a month or so, there are cobwebs on the chandeliers.  Not too appealing.  What a waste of $50.  Next time we will go to El Campesino.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jBU6oq-yuCA_WfjjBCVWnA"
  },
  "k-BSl5BZ3ktr3kBPzOIz3A": {
    "date": "10/13/2017",
    "text": "I am not one to complain but, I was disappointed with my experience. The food was bland and service was slow.  I had the super burrito with chicken.  The chicken was dry and the sauce was tasteless.  The price was high for the quality and the restaurant was loud and cramped.  Won't eat there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ib1wlI5psn_rOaILHQmRCg"
  },
  "nZMV4lsA4IFk2C-14cov7A": {
    "date": "10/2/2017",
    "text": "Food is decent and about average on price. But the music!!  I'm here to eat, not to visit a dance club. It's so loud you have to shout, so instead of masking your neighbors conversation, you hear everything.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K4FdKS905jGheGjoof-ngQ"
  },
  "S2gbEUAhn8-zQLwyh4lnSA": {
    "date": "9/29/2017",
    "text": "We came here for dinner last night. The service was great from the bar staff and the young waiters. The food was just so - so and a bit cold. Chicken Faijitas and Chimichanga. The real issue is the decor. The dining room is so big with high ceilings. It is so loud and bright. The tables only have one cushioned chair - the rest are hard wood.  Not sure I will be back when Mad Mex's is just down the street.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IUtPTOkd7AzzH_Na4SBR_w"
  },
  "AYNDiNkXUVFrvkZOcUiS8Q": {
    "date": "10/1/2018",
    "text": "We came here for my best friend's rehearsal dinner the day before her wedding. We had a slightly large party of about 25 people. We had a separate room to ourselves which was nice. The problems arose when it took forever to get someone to even just pass out menus! We arrived around 7:30 and didn't get our menus until maybe 8:30? We had plenty of chips and salsa that was passed out to us and quickly refilled but apparently no one thought to hand out menus and take orders. The bride had to eventually ask for a manager to see what was going on. He thought we would already know the options available and wouldn't need menus. What? They had to send someone to type up and print out tiny sheets of paper with 3 options of food that we could order from. This added and extra 15-20 minutes to us waiting. We didn't order our food until close to 9pm and when it did arrive it was not the best, the flavors were a bit off. I ordered some sort or spicy chicken meal. It tasted like spicy BBQ sauce.   The whole situation made no sense because they knew a large party was coming in that night and I'm assuming they had informed the bride of their large party menu options. Why was this not a separate menu or already typed out before we arrived? I'm still super confused about what happened. We didn't get out of there until around 10pm the night before her wedding!   We are probably never going to go back. The service was strange and the food really wasn't good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hG0ZpOI61G5aqmXBKkAiLQ"
  },
  "YYk0KFPTVVHJn5Mk3w0Org": {
    "date": "5/19/2018",
    "text": "Lukewarm, tasteless food and watery margaritas that kept me running to the bathroom overnight. Will never go back, and absolutely cannot recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jGULsNyiwvfm3egJRyoTUw"
  },
  "9j9v0JTwFawv95Y6NXDTgg": {
    "date": "1/14/2018",
    "text": "Currently having lunch.  I had the Jalisco Special (chicken breast and sirloin steak) and it was great.  David, our server, was very attentive and polite. My wife had soft tacos and fruit cups. The fruit cups had more pineapple than anything else, and that's not her favorite, but the rest was good. Looking forward to  having David as our server in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iuGqIEM0U_JXidh7QNWRew"
  },
  "L17iuM9Brt-2hjXcZ-aVwQ": {
    "date": "9/29/2017",
    "text": "Really enjoyed this new restaurant, it did not disappoint. The deco is beautiful and this is very professional. We will be visiting again very soon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "RZ3byPx6SO194CrG58IGWA"
  },
  "E5rKcaVOdtVXq-IRAr5yJg": {
    "date": "8/15/2018",
    "text": "Overall great experience! They make the guacamole table side which is super fun. The meals were great and the waiter was very polite. The decor is beautiful and fun!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5UjCg88d2eDdIbD5CNaVfg"
  },
  "pCh3fXMB1RuBr3qBzwXtZg": {
    "date": "3/26/2018",
    "text": "Very disappointed. We'd eaten at the Emiliano's in McIntyre Square in the North Hills dozens of times and always loved it. This was our first time eating at this one. The three of us who ate at the other Emiliano's all commented that the food at this one definitely wasn't as good. I had a combo plate with Chile Relleno and Chicken Tamale. The Chicken tamale had 4 strings of extremely dried out chicken inside (inedible). I ate the rest and an hour later started getting stomach cramps and the sweats in TJ Maxx next door. Definitely got food poisoning. No one else in my party was affected (besides having to hang out at TJ Maxx forever until I could safely ride home). Definitely won't be going back there ever again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NPYPKTEeXNv-Epi-1T-3BA"
  },
  "YU2Z9or9s0aiV6uMw1Dg9Q": {
    "date": "12/3/2017",
    "text": "Probably the worst service I've ever had. I was there a few weeks ago. The waiter was very short when speaking to us. Definitely not all his fault. He had the entire bar side of tables. He was overwhelmed. Very poor decision making on the managers. Instead of helping his staff, the manager was standing at the host stand playing on his phone, while his staff was swamped. It was rather rude. Never asked if we wanted another drink until It was after close and said It was too late. We were told the bartender already left for the night. They started to flip up chairs at the tables next to us and swept around us. Will definitely not be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DStayl2b3kag3k-HUoOw6A"
  },
  "5h8b9ojbEudydvSRlJTOLQ": {
    "date": "12/18/2017",
    "text": "Unfortunately, had two bad experiences here. Was looking forward to them opening in McCandless. The first time I went was a few weeks after they opened, so I had hoped that the bad and slow service and incorrect order served was due to it still being new. Unfortunately  not the case. Never got refills on waters; the table next to us had to go to the bar to get their sodas refilled. They served me the wrong food, and the waiter did not come back to check on us until my table was finished eating.   Giving it a second try, returned for some late night appetizers and drinks just recently. The sangria is not fresh and tasted like grape juice mixed with rubbing alcohol. The fruit inside was more like orange peels instead of chunks of fruit. The spinach quesadilla was served without the cheese melted, and the spinach used was not fresh (frozen spinach) and was overpowering the quesadilla. It seemed like they dumped all the spinach they had left for the night into the quesadilla. Cheese queso was sub-par and we had to keep asking them to refill our chips (small bowl). Will not return here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XgYARaA4aIK9T33KT88g7Q"
  },
  "uWjaWABY0j6rIlUM_3wyYw": {
    "date": "6/17/2018",
    "text": "Service initially was good.   Then our waitress took a while to get us extra chips and refill our drinks.  Our food was good however.   They steak my daughter ave I ordered The Matador was very good.   Marinated.   Medium rare.  Tasty.  The avocado salad I ordered had no dressing on it.  Our waitress seemed to disappear for inordinate amounts of time.   We never did get a refill on our chips.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zYwQZp4wc9PQOnlXgrUmZQ"
  },
  "LwjXwVQ9225Y3tcdvxr5yA": {
    "date": "12/10/2017",
    "text": "So glad we tried the new location. Great food,and service. My only issue is the lights are too bright. Keep up the good work.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FJf6st9s-EnoUQiKzQ2i0w"
  },
  "186e5KZlZwAtx80YCPf3_g": {
    "date": "10/1/2017",
    "text": "We went on 9/29 been to other Emiliano's before and always liked them.  This one just opened and looks very nice in and out. However wife got very sick that night and next day. All the symptoms of food poisoning.  Talked to manager and he said I was the only one to report this so he doubted this was the case.  Can't be sure but would never go again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5BXtQUbD6mSBVPoLMxI9vQ"
  },
  "NU2GwXqSYO3pgliW-WmJFg": {
    "date": "3/24/2018",
    "text": "Nice atmosphere but service was okay. Took forever for our meals to come out. Food was mediocre.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UUy_9N-XN-t7A56WbQXPzA"
  },
  "xD0VlH43Mrr_DuVpJDvCGw": {
    "date": "1/11/2018",
    "text": "Our server Marie was absolutely amazing. She was so attentive. She constantly made sure we had everything we wanted and needed. She answered our questions concerning certain meals. I will definitely be asking for her again when i go back. #serverappreciationmonth",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lsLsUfG68QdPvbq6KIDPzg"
  },
  "PU-6Bgs6hhGNfQoZ3KxFsg": {
    "date": "11/1/2017",
    "text": "As a Mexican, it has been tough to find places nearby that serve food that is authentic and fresh. This place comes so very close and the decor is truly beautiful. It's a great place to meet with friends and family and enjoy good cuisine and tequila!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kxRvGWenXM7AuiSJKyNdvw"
  },
  "PXOiy1CwWOv8VtgXvCgBxw": {
    "date": "1/5/2018",
    "text": "Today was our first day at the Emiliano's location in the north hills. Emiliano's has been one of my favorite restaurants for years. This location did not disappoint. Our waiter was Edward- he was fast, friendly, knowledgeable, and tried very hard to make our experience the best it could be. He recommended the best dishes and drinks. The food was good and I always enjoy a good margarita... But ultimately, thanks to Edward, we'll definitely be back very soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SvD8UP-Jo9E8Iea_XycDTg"
  },
  "ajdhqtdbjc4ijigQQsJgsQ": {
    "date": "9/25/2017",
    "text": "Emiliano's has always been our favorite. We were so excited for this location to open. The food was delicious as always, but the ambiance and decor left a little to be desired. We went for dinner and the  main dining was so brightly lit and it just didn't seem very \"cozy\" like the other locations. My husband and I joked that we felt like we were at Hofbrauhaus with how open and bright it was. The music was also very loud and with the height of the ceiling and number of people in the dining room, it made it somewhat hard to carry on a conversation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "75DdasNLTKSlOm8mjVOLLw"
  },
  "4nXPV6asCOvRWv0a3ZOgvg": {
    "date": "12/5/2017",
    "text": "We went when they first opened - with high hopes because we LOVED the old Emiliano's. The first meal there was severely substandard - soggy chimichanga with tasteless and dry chicken inside, things were cold when delivered, parts of the meal were never delivered, and service was sloppy and s-l-o-w. Decided not to review at that time as we thought they might be experiencing opening pains.  However, we went back yesterday, were seated, and although there was a congregation of 6 servers standing around at the back server station chatting aimlessly, were never acknowledged in any way, shape or form. There were only 3 or 4 other tables with patrons, so they were not \"busy\". After 20 minutes, went back to the hostess, told her we had not even been acknowledged, got a kind of snarky \"oh, I'm sorry\", and nothing else, so we left.  We will not be giving this place another chance",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iKIOtFylp7KbdzPwXLZNeA"
  },
  "fTgJDUiv13aoGXeqiMRjmQ": {
    "date": "12/28/2017",
    "text": "The food was delicious.  Atmosphere was very nice. Our server was so considerate and concerned for our enjoyment of the evening.  I've been there twice and both very good experiences",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xq1IKSDspxqP19YNpfhSYw"
  },
  "thxWmiVv7OnBEa5RTfbYCQ": {
    "date": "3/9/2018",
    "text": "My husband and I went here for lunch and we were pleasantly surprised by the decor and friendly service. In reviewing the menu they had all of your average Mexican cuisine choices. My husband ordered the fish tacos in which he described as ok but missing something and I ordered the chicken chimichanga. The appetizer we ordered was the most disappointing part for me though. For a portion for a price of $10.99 they give u a $1 worth of dip, however the presentation of it is awesome. They approach ur table with a hot plate and make it in-front of u. When they completed the presentation I noticed the the quest was like water. Usually a fundito is made with a nice healthy portion of chorizo with queso thick enough to coat the chip. It was just a greasy mess. Also their Margaritas were just average as well.  All in all if I wanted to pay $70 for lunch I could've went downtown and this place was just not worth that. We will most likely not return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LDS0vN3q9Rp0vm2QWVzz0w"
  },
  "2txqyXICIWZtEZlFtGqhiQ": {
    "date": "9/23/2017",
    "text": "This my second attempt here.  Service is poor food is cold and always wrong.  Patron it will be moving forward.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_C6F_M0OLwO10BbQsr6mhQ"
  },
  "Ja8G_hg0_ulhpBJyCE_Ozw": {
    "date": "4/14/2019",
    "text": "We love Emiliano's! One of our favorite places to go. The cheese dip is something we always have to get! Really like that they give you chips and salsa for free! I like the arroz con polo.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IxZfTbPIOzjlUAOSnDp1TA"
  },
  "l25nPvcFR2_qQc5rCwcXgA": {
    "date": "1/23/2018",
    "text": "This is my go-to for Mexican food in Pittsburgh! My family and I have been here multiple times, but today was exceptionally amazing. Our server, Mario, was so attentive and especially patient with one of the slower guests in my party. We all ordered different variations of the lunch combinations, and everything came out exactly as we had requested. It was all delicious, especially the breakfast burrito and enchiladas suizas!! We will definitely be returning for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QG5Q-ICKKPSD798hjcx7LA",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QG5Q-ICKKPSD798hjcx7LA/o.jpg"
      },
      {
        "img_id": "TP5Jy1BdFf5eswBztrzfgQ",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TP5Jy1BdFf5eswBztrzfgQ/o.jpg"
      },
      {
        "img_id": "TKbDEIZSD2yNT1OT5r-5iw",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TKbDEIZSD2yNT1OT5r-5iw/o.jpg"
      }
    ],
    "user_id": "FxrSWuB-FBJuCckdnf9zPQ"
  },
  "eOslw4pVskVHKtjyZou6FQ": {
    "date": "1/24/2018",
    "text": "Love this place.  Great bar.  Excellent service.  Different types of seating arrangements.  Staff helpful.  Salsa and chips served immediately.  Large Margaritas tasty.  Guac was wonderful as well.  Just go and enjoy lunch and/or dinner.  Or just hang out at the bar area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GsFr15zUG8wO9fsSHwvZUw"
  },
  "7NZapxfRlubX1UIndqvWLA": {
    "date": "12/31/2017",
    "text": "Salsa is just average and their food prices are over priced for what you get.  Shrimp I ordered was over sauced and not very tasty. Too many restaurants in the area to ever return.  Beer prices are reasonable.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eK97RyPJDzjW0HUYseq0Xg"
  },
  "hRDFsnzagLk8IV_It5mUIw": {
    "date": "10/28/2017",
    "text": "I feel bad for this place because of so many negative reviews, most of which are really odd to me. Maybe they had a rough opening and have since fixed things. Here are the facts. At 730-800pm on a Saturday this place was packed with a 25 minute wait for table for 2 so it can't be that bad. All of the food we had was really good. It is on par with any other Mexican restaurant, your standard inauthentic but consistent tasty food with good portions. Prices were a bit high especially for alcoholic drinks but they did have daily specials for certain drinks.  I think that this place is much better than it's reviews. My disclaimer is it is not 5 star for me I'm just giving 5 stars to help counterbalance the previous negative reviews. It is 4 star for me though, was just a little expensive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7kKmVOZhJzhN12Onrh0OLA"
  },
  "4W0G9NWjoH1mtoUhmBweTw": {
    "date": "8/18/2018",
    "text": "First time, last time. Chicken burrito supreme was not good. Veggies too hard, chicken rubbery with heavy handed red seasoning. My son wouldn't eat his steak and shrimp (and he's a teen who eat everything). Said it had an odd off putting taste. Tres Leche cake was not good. Cinnamon overload with old cake. We didn't complain & paid & left a good tip, but lesson learned. Just not a great experience. Used to Mexican food being cooked and seasoned much better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H_l3Okb4P-ij2euaQZ1ikw"
  },
  "WiV_edb6DlKWypcLiucgbg": {
    "date": "2/17/2019",
    "text": "The best homemade guacamole, its perfect every-time! Staff is friendly and provide great customer service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rPOsR2ALmYGrIpnK3Xmxvg"
  },
  "32BJD0wXkkg3JjxRCPcPFA": {
    "date": "10/14/2017",
    "text": "I have SO been looking forward to checking out the new Emiliano's so this review is hard to write. My friend and I went there Friday for lunch and were very underwhelmed from food to service.  The chicken inside the chimichanga and enchilada suiza was horribly dry and tasteless. The amount of refried beans on my plate was paltry. the spinach quesadilla tasted burnt and the cheese was just in the middle not spread throughout.  I'm hoping this is just a bad day and they can only get better but my friend and I were really disappointed. The service was fine. Not great but nothing to sing about. But I think the worst was just the overall feeling that they were not on their A game. As we walked towards the exit, two of the hosts standing there didn't acknowledge us or thank us for coming-- I guess I'm just used to better!   On the plus side -Atmosphere is great and the decor is beautiful but if you can't get your food on mark and your service better we will not be coming back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Kccf2-UZdtCSHNRvl9Srw"
  },
  "5ssqMX91H6TcK6SUDww4ZA": {
    "date": "9/21/2017",
    "text": "I've never been to any of the Emiliano's locations, and the new one in McCandless is across the street from our business, so we thought we would give it a try.  My beloved had tacos and I had the Enchiladas Supreme. They made a special combination at my request and didn't look at me like I was weird that I wanted 2 types of sauces. They were pretty tasty too!  My one bone to pick the whole restaurant wasn't with the food, it was with the ambiance of the place. I felt like the lighting was really a little too bright. We ate in the bar area, but when we left, I saw the main dining area - also really bright.  I would suggest dimming the lights a little and maybe even putting candles on the tables. A little color with artwork would be welcome as well, as everything was brown on brown. The atmosphere in a restaurant is important. Something a little cozier would be nice.  I wish them well at this new location, a little fine tuning make it a perfect place to dine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "21W8iTZGWdCk1utgudcToQ"
  },
  "iTIHzBouvqtan89plt7nbw": {
    "date": "5/12/2019",
    "text": "Beware this place has staff stealing people's credit card information. When I  ate here, I gave my credit card to my waitress (whom I dont think was apart of the mischief) about 5 mins later she comes back to the table to tell me that she lost my credit card and that she thought one of the other servers had taken it. After about 15 mins of 5 people searching the restaurant and trash cans, there was no sign of the card and I asked to speak to a manager. At that time the individual whom the waitress said she thought had taken the card magically appears back at the front counter and slips the credit card back into the receipt book claiming he had found it in the trash can. The same trash can that 3 other employees previously checked for the card. He took the card to copy the information but did not get it back in time before the waitress was ready to close out my bill. I dont trust them at all and will never visit again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3n-QzSHbojRoxh7otE6tNg"
  },
  "dInB3NYi8qpBNfbZfsbyzA": {
    "date": "10/16/2017",
    "text": "Nice for a quick no wait meal.  Grand ceiling and a fountain that took up a lot of the dining room... however it is pretty.  We love the salsa and the rice was a gorgeous color.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w7AHshkbjWqP-lkRfwp92w",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/w7AHshkbjWqP-lkRfwp92w/o.jpg"
      },
      {
        "img_id": "sQ2P4l2fFmgp0bU3XWVo3g",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sQ2P4l2fFmgp0bU3XWVo3g/o.jpg"
      },
      {
        "img_id": "tazEzp3z1KUXblWriKfaPg",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tazEzp3z1KUXblWriKfaPg/o.jpg"
      }
    ],
    "user_id": "P32IUJ9gCBFtA0WeDSrV8g"
  },
  "xntLhEtJkGzYRmd8yGF1nw": {
    "date": "10/22/2017",
    "text": "This is their newest establishment which recently opened in Pittsburgh. The decor is very nice and they have a beautiful water fountain inside. Our hostess/waitress was a young lady from Ohio and she was very pleasant and accommodating. The food was very tasty and the portions were a nice size. We didn't get any drinks today but the next time I come to Pittsburgh I'll try out their Margaritas.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vh7pIV2jK0qUABnfEyw6SQ",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vh7pIV2jK0qUABnfEyw6SQ/o.jpg"
      },
      {
        "img_id": "X-GNaiAhMwwupCazX-DBKg",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X-GNaiAhMwwupCazX-DBKg/o.jpg"
      },
      {
        "img_id": "L8vwVISK8W-ToozkzPHJDQ",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L8vwVISK8W-ToozkzPHJDQ/o.jpg"
      }
    ],
    "user_id": "vUyr0O72btWjs1HqZRc4EA"
  },
  "prZohT0fWMiFqe4hmpxVBQ": {
    "date": "10/15/2017",
    "text": "Chicken enchilada was dry af! Mentioned it to Marie..(our now server bc our earlier server who took our order disappeared) and she just gave me a blank stare and walk away. No manager visit. No pre-bussing. Dont ask if I need anything my stacked dishes taken away, just take it away! Bill came and my drink was more than what she said it was, which is fine, but know what ur talking about! All in all, great decor, my food sucked and the service was meh..2 stars cuz my marg/sang was good",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "POREzwQx-Q6vaF5sIvQRrw",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. No prebussing!? Come on I&amp;#39;m packed up even.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/POREzwQx-Q6vaF5sIvQRrw/o.jpg"
      },
      {
        "img_id": "x9oWdNWLh8NQxMS891posA",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Dr ..I mean dry chicken enchilada..couldn&amp;#39;t finish. Mentioned it but no managers visit",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x9oWdNWLh8NQxMS891posA/o.jpg"
      },
      {
        "img_id": "y9n3-GvoNapOfcsGiz0hJg",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Nice decor",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y9n3-GvoNapOfcsGiz0hJg/o.jpg"
      }
    ],
    "user_id": "fh7JDSRfrkZFKvaqb68jOA"
  },
  "iY33D4JUjBX338-8beKFog": {
    "date": "11/26/2017",
    "text": "It was very busy evening, but they manage to get us a table in short period of time. Food was good and service was relatively quick for a busy night I should say ! Will try to hit happy hour next time...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e_fhnFuUDHCKcqF8M45lwQ",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Chicken fajita..",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e_fhnFuUDHCKcqF8M45lwQ/o.jpg"
      }
    ],
    "user_id": "M-C-ocUSdqQdh_wwPkytSQ"
  },
  "4YsjnpUC23kzsD1gQkyFVw": {
    "date": "5/27/2018",
    "text": "We finally decided to try Emiliano's yesterday. The restaurant is gorgeous. We were greeted by a less than enthusiastic hostess who took us to our table without a word or a smile. Our waitress was very friendly though and attentive to our needs. I ordered Carne Asada. The waitress asked me what temperature I wanted it and I said medium. When my entree arrived I laughed! I so wish I had taken a picture of the meat!!!!! It was as thin as a pancake and a weird orange color. I would say it was about 1/4 thick. I cut into this orange meat and it was grey inside. Medium?? HA! It was like shoe leather!   The rice and beans had the same hue of orange too! I am glad I finally made it to Emiliano's because now I know never to return!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KMGs8TBVeYyrb7HrDpzNXg"
  },
  "hmP0Q1zT09QsZAwIaJOWQA": {
    "date": "1/30/2018",
    "text": "So yummy! Tried the choripollo California burrito and it was delicious. Great lunch menu prices and awesome service. Enio was our waiter and he was super nice and attentive. Chips and salsa are the best around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NV4aS3LVFbpHbjs35cTbfw"
  },
  "FzNqNukpj7Gblo9kmW4njQ": {
    "date": "2/8/2018",
    "text": "Terrible service and I've had better Mexican food from Chipotle. Bar tender was cool and drinks were good though.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A7aaJdMLOXdsoBiIQIvExg"
  },
  "EBF89lOYDdz0Ay2ECPmQwA": {
    "date": "1/19/2018",
    "text": "Great restaurant, bar super clean, bartender Edgar class act and down to earth person. Very helpful and knowledgeable with things in menu.  Highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sk6msOVNv3wR5rEdEhZlWA"
  },
  "VxXl55p6LoQNepvicf-nXA": {
    "date": "12/29/2017",
    "text": "Where to begin? The bar area is large. The bartenders seemed especially overwhelmed. Margaritas are good, but not the best I've had. Franklin Inn by far has the better margaritas. The quantity of food is reasonable for the price, but the quality is lacking. Service was fair. Our waitress forgot to bring silverware and napkins, additional chips as promised, and extra sour cream for my boyfriend. I'd rather go to Mad Mex.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZrtGsM6sUUkyojnBeiwAOA"
  },
  "-HDNVHzkh4in90knPi2dDw": {
    "date": "1/27/2018",
    "text": "This is a hard review to write, I do not believe in writing bad reviews whatsoever so I give them a 3 star in the middle for right now, I will try them again because there atmosphere is great and service is great there food can use more Mexican Flavor, the beans were cold the rice was cold, I had the fajitas not really spicy at all, like fajitas should be but they were edible, I did see other food being served to people around us and they look delicious I will give them another try ,,  I'll change my rating at that time if their food is better otherwise they do an OK job for the Pittsburgh area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WKifGDgIpCG5gBh0LPzAUw"
  },
  "gkuxyJyuKc5Vnnn30y2qsQ": {
    "date": "9/3/2019",
    "text": "Seven of us went for supper here on Sunday.  There were 3 adults, 2 teens, and 2 children. Three don't eat meat only fish.  Everyone was satisfied with the offerings. The Cancun chimichanga was ordered by three and it was great.  The service was fantastic. The person who had the sangria loved it.  The final cost for everything was very reasonable. We went to the location in the north hills.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pmglbGo1pqTbXKzD2w33Hw"
  },
  "AXrd-v60Xo42nv5htrV8EQ": {
    "date": "9/12/2019",
    "text": "We stopped in for lunch and chose to order off the build your own combo menu. The chips and salsa were out quickly with our drinks following soon after. I had a chicken quesadilla, a chili rellano with chicken, and a chicken burrito. I had the sweet potato fries as my side, and they were probably the best part of my meal.   The chicken used in my dishes had a lot of watery liquid that made eating them a mess, unfortunately. My dining partner had better luck with his food. He had a chicken enchilada, chili rellano, chicken burrito and rice.   Overall, it was speedy and friendly service. The food was a good deal, but we kind of got what we paid for. Its not a bad stop for a quick bite when you're running errands, but I wouldn't go out specifically for Emiliano's.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rkX7b-mvYl-Z6qWr1tsvyw",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Chicken enchilada, chili rellano, chicken burrito, and rice.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rkX7b-mvYl-Z6qWr1tsvyw/o.jpg"
      }
    ],
    "user_id": "HOt4dV5lPrug5WwhK7OpQg"
  },
  "HOpBUpOsSgmhXBvxL1INmA": {
    "date": "8/19/2019",
    "text": "We visited this location when it first opened and everything was awful from the service to the food. After seeing a review that said 'recently gave this place a second chance and was surprised', we decided to do the same. It was definitely better than last time, but I still wasn't thrilled. I'd say it is your typical Americanized Mexican stop, so don't go out of your way for it but also don't avoid it if it's convenient and you're hungry.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ayGmE1tzjNp4PQ2KUkAqmA",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ayGmE1tzjNp4PQ2KUkAqmA/o.jpg"
      },
      {
        "img_id": "E3KctF6MNgqaOuVYxoKjbA",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E3KctF6MNgqaOuVYxoKjbA/o.jpg"
      },
      {
        "img_id": "22ofUq8NCo3eztAPWmGKHQ",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/22ofUq8NCo3eztAPWmGKHQ/o.jpg"
      }
    ],
    "user_id": "DbEFWoaL4yaFeQ8g_Q2lFw"
  },
  "bjh2IK4DmQt_L_lXxegpkA": {
    "date": "9/3/2019",
    "text": "Emilianos is one of my favorite restaurants! My fiance and I try and go every Sunday to enjoy each other, great food & drinks, comfortable atmosphere, and great hospitality. The food is always amazing. The chips and salsa are AMAZING! The salsa is fresh and delicious. The cheese dip is so good and the drinks are so good. There is a wide variety of food options and everything is so good. I usually get the chicken fajitas and my fiance likes to order different things every time we go. We have never had a bad meal. Everything is so satisfying and we always look forward to coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f5d8F9kKUUVcQ1pWkU0gQw"
  },
  "xm_vrDKiG_ng6ErKeyxmlQ": {
    "date": "3/18/2019",
    "text": "George was such a good waiter! He's so funny and nice, a real asset to the restaurant. He recommended the chicken quesadilla and I had zero regrets My friend is of age and got a margarita and said it was very tasty and strong",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zHiqImROwzYI_AZm4qrDjg",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Chicken quesadilla",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zHiqImROwzYI_AZm4qrDjg/o.jpg"
      }
    ],
    "user_id": "u2gn03aQ4b8K-naWp-e4fg"
  },
  "koj4PA5iGy5Tu6okz1cejg": {
    "date": "3/4/2019",
    "text": "We got takeout fajitas. They were delicious! I have no complaints. The tortillas were great and the chips were great. I wish they were a bit more generous with the salsa but next time I would just order guacamole or something! We have a lot of chips left.  All the veggies were cooked well and tasted fresh and both the chicken and steak were good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UdbvIleQQfqiFBFxD1Ckug"
  },
  "C0zYesa-4OXMuU2Z7b82Gw": {
    "date": "3/16/2019",
    "text": "We have dined in this place several times. This time, my wife, my daughter, and I went there for an early dinner. The service was great. We were seated immediately and the waitress was so sweet, fast, and punctual. We ordered Holy Guacamole. It is my recommended appetizer at this place. Tip: try it. No apparently is like a bowl of freshly made Guacamole. For the main course, I ordered Matador Steak and my companions ordered two versions of Fajitas. The food was great. The decor and ambiance of this place is also beautiful and authentic. We enjoyed our experience and will be back to this place in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "syxctnFJdyVlp-X_3o6gHQ",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Fajita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/syxctnFJdyVlp-X_3o6gHQ/o.jpg"
      },
      {
        "img_id": "QjkxZ8mJM9ZKbqe-ZCfcrA",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Holy Guacamole",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QjkxZ8mJM9ZKbqe-ZCfcrA/o.jpg"
      },
      {
        "img_id": "zsZj3M9fYuJEg4fBfieRTw",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Matador Steak",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zsZj3M9fYuJEg4fBfieRTw/o.jpg"
      }
    ],
    "user_id": "ce8DJ11n1mmozkPUEGLo2w"
  },
  "IK97gfH9q7bNH9jgBS-ooA": {
    "date": "4/26/2019",
    "text": "Positive experience. Came for happy hour and ordered a mojito, loaded nachos, and buffalo chicken tacos...all I'm happy hour menu for $17. Good value. Service pretty good. Food had nice flavor but wish they had something with more a kick, especially for buffalo chicken tacos",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j673UVaBi2c4JyMBntqJXA",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j673UVaBi2c4JyMBntqJXA/o.jpg"
      },
      {
        "img_id": "GqjhLEGfKHhUJwoT06ILSw",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GqjhLEGfKHhUJwoT06ILSw/o.jpg"
      },
      {
        "img_id": "No3UnOERJKMltzafP-t2DQ",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/No3UnOERJKMltzafP-t2DQ/o.jpg"
      }
    ],
    "user_id": "yBQ48jYofc1Ob2idVCZgEg"
  },
  "kaukHCxFOzmJHPHK9odXjg": {
    "date": "7/26/2018",
    "text": "While the food looks promising to be delicious, the flavors are a bit haphazard. The vegetables in my main dish were perfectly cooked, and that was pretty much the highlight.  My Blue Margarita was overly sweet, but still drinkable. The Arroz con Pollo varied between perfectly seasoned, very salty, and underseasoned with each bite. I never knew what I was going to get even though I mixed it well. The refried bean side was bland and unmemorable. I was excited to dive into the tres leches cake, but again...left feeling disappointed. The cake was dry and lacking in any flavor. I don't know how a tres leches cake can be dry, but this one was. Plus, the chocolate sauce detracted a bit from its overall flavor. I had more hopes  Also, one of the bathroom doors in the women's restroom had a lock that wouldn't lock and the door would rattle open.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JK3wKRisbNDEdetGd03qIQ",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Tres leches cake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JK3wKRisbNDEdetGd03qIQ/o.jpg"
      },
      {
        "img_id": "dm80RZB10JIymVnetnIdxQ",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Arroz con pollo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dm80RZB10JIymVnetnIdxQ/o.jpg"
      },
      {
        "img_id": "BBS9BSpkNhidRaE1N3d1CQ",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Blue margarita",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BBS9BSpkNhidRaE1N3d1CQ/o.jpg"
      }
    ],
    "user_id": "WjsmRfQ_ruPazoZl_9AQcA"
  },
  "fNsbURFZ5GT9Ru1tmNRsxQ": {
    "date": "11/12/2018",
    "text": "I've been coming to Emiliano's for years and years, and it's still the old standby for me when I want somewhere other than Mad Mex. That said, it seems like their food quality has really plateaued, and unfortunately nothing really stands out anymore.   Don't get me wrong, it will be a serviceable and affordable dinner. Some things hold up better than others (basic tacos, enchiladas). But steer clear of the entree meals and the quesadillas, in both cases I'm not sure how they always end up being so mediocre between poor taste and execution.  But if you come on a night with a beer special and want some tacos, you'll do just fine... don't expect much more from them otherwise.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhQOA8-FdpA6D0hNhXEYIw"
  },
  "OXzfG6pO3Qw7Z6aXQYc3zA": {
    "date": "9/22/2017",
    "text": "Welcome to the 4th location of this great Mexican chain restaurant! The new location opened up on Labor day and the decor makes you feel exactly like you are in Mexico. The staff is extremely friendly and helpful.  The menu is identical to the menu you get at the other three locations. In this case I was having lunch with my daughter. They serve complimentary chips and they have a special lunch menu where you can get a meal for under $10.00. They have a birthday club which you can join which you will get an email with a buy one get one free entree.  I ordered my favorite the arroz con pollo with rice and salad. My daughter had two burritos with rice and refried beans. Portion sizes are generous so be prepared to come hungry! Take out is also available.   Emiliano's is located in McCandless Crossing right next to Lowe's. There is plenty of free parking and has a great menu. They have both men and ladies restroom along with a family or gender neutral one.  Will definitely return to visit again in the near future.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 9,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "Us69puKJae-NyOmD5XzCWQ",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. burritos with rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Us69puKJae-NyOmD5XzCWQ/o.jpg"
      },
      {
        "img_id": "rRk-H7Q6DmftSFIN2CpNnA",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. inside",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rRk-H7Q6DmftSFIN2CpNnA/o.jpg"
      },
      {
        "img_id": "XwppzNId6x8YJe7AtLaL8g",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. breakfast items available",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XwppzNId6x8YJe7AtLaL8g/o.jpg"
      }
    ],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "OHzDJsE9YmhGEayeT9NOeQ": {
    "date": "3/31/2019",
    "text": "Visited here on a Saturday night for a birthday dinner. There was a little wait but our party headed to the bar. We ordered frozen margaritas and the bartender was very nice.  When we were called for a table, they led us to a booth. We had 7 in our party. We asked to move to a bigger table, the hostess walked away before we could finish the question. So we all squeezed in. While at the table, our waiter asked us what we'd like to drink and we ordered more margaritas and beer. It took a while for those to come back to us. When we ordered our dinner and appetizers, it was an even longer than normal period of waiting. In the mean time when it was an opportune time to refill drinks or something, our waiter was no where in sight. When our food finally arrived three of the taco dishes were not even hot. We had looked for our waiter but he had yet again disappeared! So we asked another waiter for a manager. Over the manager came, we told him that our food was cold and he took it back. By the time our food returned to us, everyone else was done and the dishes were hot. But not the food. We had enough. We looked for the manager again but he has disappeared too. Overall this experience was not ideal. They missed out on a lot of money and pretty big tips. We would have ordered more drinks and if only there was a good waiter around. I don't think I'll revisit this location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5saKw-tqZhEgkkCGXA4UNg"
  },
  "pdQ1JcnCGqlxG1J8PMsnzw": {
    "date": "10/13/2018",
    "text": "I've not gone to Mexican restaurants very much, but in walking by their Gibsonia location, I noticed an offer posted on their front window to get a free main course on your birthday.  In July '16, I did just that, two months before my birthday that year.  Fast-forward to OCT '18 - - my first free entree' offer arrived in my e-mail, so after two+ years, I was finally going. I selected this location as I go to a nearby gym.  I also knew this was a rather new facility as I watched it being constructed from the ground up.  Not surprisingly, it was nice inside - very spacious in the main dining room.  The ceiling is very high which I figured would keep the noise level down, which it did, as the background music wasn't over-powering & I didn't really hear any other patrons' conversations.  We were promptly greeted by a waitress who brought along a basket of nachos & salsa.  Being first-timers there, we needed some time to review the menu as we first ordered soft drinks. Ultimately, we were given all the time we wanted & never felt being rushed.  There was a wide selection of appetiziers which we determined that none of them appealed to us, with cheese being the most common denominator.  I like some cheese but not overwhelmingly so.  Had they had something with shrimp or calamari, we likely would have indulged.  So we just stuck with the nachos & after perusing the adult beverage menu, ordered the same libation, which we each enjoyed; one of their margaritas.  There was a Happy Hour drink special featuring one beer, one wine choice & one cocktail, but none of them seemed as interesting as the margarita.  For the main course, we each opted for a different version of fajitas, having limited Mexican food experience.  We were each pleased with our selection & kinda glad we hadn't ordered an appetizer as the fajitas was a fairly large portion, when all the side items are added-in (re-fried beans, rice & a small salad).  Since there was a lot there, I could have used more than the three warm pancake wrappers to roll the hot items, but on the other hand, it was just as well to finish the un-rolled remaining food with just a fork.  Between the drinks, nachos & entrees', we were too full for dessert.  I presented my free entree certificate almost immediately when our waitress first appeared, so there was plenty of time if they (the staff) were going to gather around my table at any time during the meal & sing \"Happy Birthday\".  I'm very greatful that they didn't.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lIvtLm2lAoz1N2zTlDdMag"
  },
  "srgR9AfcV41R7m0kNL7qUA": {
    "date": "9/27/2018",
    "text": "I drive by this place all the time, so when my husband suggested going there for dinner, I was looking forward to it. The area inside is very pretty, and when you walk in, it smells like great food. We choose to sit outside on the patio since the weather was beautiful. The best-tasting thing at my dinner was the Corona with a lime. My food honestly tasted awful. So did my husband's. I eat some of it because I was starving, but I kept thinking I can't believe I'm eating this. Not to mention there were fruit flies all over the table. The servers were nice. Hence I'm giving this two stars.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V0jsZ2BHltTYQ_NAKp61hg",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/V0jsZ2BHltTYQ_NAKp61hg/o.jpg"
      }
    ],
    "user_id": "hkHGJMk8m3FDC8bqLMvaSw"
  },
  "5dBbbtOC23UMOFwRjxMcVA": {
    "date": "5/12/2019",
    "text": "My wife and I live near the McCandless location but heard mixed reviews about this place from friends.  We decided to give it a try and were not disappointed.  The wait was only a few min to get us seated and the atmosphere was great.  Our waiter was attentive and the food was fantastic.  We ordered the chorizo queso to start and we're hooked from there.  I ordered the steak burrito and my wife ordered enchiladas and rice/beans.  We both loved our meals and look forward to going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EStJDPbA0rAOfqmJbLYNNQ"
  },
  "xIjm7Eflp1hJb0PoPxVlRQ": {
    "date": "7/11/2019",
    "text": "Only 3 stars because my server Jody was excellent ( I would give 5 to her). Besides that, the food was decent but this is the CHEAPEST restaurant I've ever been to. A side of sour cream?? \"Sorry that will be a dollar upcharge\" extra queso??? \"Sorry that will be an upcharge of $5.\" This place comes off as ridiculously cheap and no quality restaurant presents itself that way. Get a clue.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0I16QZLlAT239ObHfHeFzQ"
  },
  "JABI0RsInQ2cCpFkVwLc6Q": {
    "date": "11/27/2017",
    "text": "Finally Emilianos is back in the North Hills! I always enjoyed meeting up with friends at the past location in McIntyre Sq and was excited to check out the new location. I must say that the new digs is gorgeous with high ceilings and fountain. It was only a bit too bright in there for me. A dim lit atmosphere would make it perfect. Of course you get complimentary chips and salsa. We added the guac with it, that is made fresh table side. It was tasty. But my absolute fave is the chicken chimichanga; they definitely did not let me down. Everything was flavored just right and customer service was pretty good.  Oh and of course the margaritas are delicious, with great daily specials. The day that we went, the fish bowl margarita was on special for 5 dollars! Cant beat that!!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "W0YPUUT-1jxzv0hjUi5mLw"
  },
  "mnxBIPz3clHxeaU0uNepsQ": {
    "date": "10/3/2017",
    "text": "Emiliano's in McCandless is the opposite of Doctor Who's Tardis. It looks massive on the outside, but you walk in to the cramped waiting area with 2 small benches, and take a quick look around, you realize it's all an illusion.  There was a 30 minute wait for our table and then we waited for about 20 minutes for our drinks and another 30 minutes for our food to get to the table, which the waitress apologized for profusely. Do yourself a favor and steer clear of the apple cider margarita (their seasonal drink). It was foul.  The food was average. The fajita was okay, definitely lacking in flavor. Everyone thought their food was \"alright.\"   Overall, not worth the cramped wait, high price, and lackluster flavor.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "p2isYRYCqgYtu_gv-m_StA",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Fajita Sides",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p2isYRYCqgYtu_gv-m_StA/o.jpg"
      },
      {
        "img_id": "12NmllWizhY6w6Ajj6Ezbg",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Apple Cider Margarita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/12NmllWizhY6w6Ajj6Ezbg/o.jpg"
      },
      {
        "img_id": "HPaGbJyAjeHKrHY1LEnODQ",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States. Chicken Fajita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HPaGbJyAjeHKrHY1LEnODQ/o.jpg"
      }
    ],
    "user_id": "xKR85VrcBBsIVfNmDT6ADQ"
  },
  "HBXhSw6opJewfWK02LAKtg": {
    "date": "1/4/2019",
    "text": "This location and South Side are the best! Stay far away from the cranberry location! This location has lots of space and the food is excellent! If you're looking for a waitress go for Christa! She is the best waitress",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K4xbJICEbGn2gAuF02RecQ"
  },
  "yXQTIkBE7Cvrz2665nnF-g": {
    "date": "10/2/2017",
    "text": "Very disappointing. I think we'll stick to the Cranberry location. The ambience is all wrong. It's extremely bright. There are even lamps on the tables and we were glad we could shut that off. The music is awful. Modern bubblegum pop. (Music from Trolls,Despicable me etc...) something about the staff even seemed 'off' for an authentic Mexican restaurant.  The food was just as good as the other locations although our chorizo queso was very runny.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A1Ku9kmYfCgY3bynzAs-zg",
        "caption": "Photo of Emiliano's Mexican Restaurant &amp; Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/A1Ku9kmYfCgY3bynzAs-zg/o.jpg"
      }
    ],
    "user_id": "wkokiWbTL9yf-NJUK6cb8Q"
  }
}