{
  "OEExIgNZLhOsQkiIog4cfA": {
    "date": "2/9/2014",
    "text": "This is definitely an old school hang out with a classic menu.   Although my steak was cooked perfectly,  I can't speak to the quality of the ingredients as they lacked natural flavour of meat and fish that I love.   My biggest gripe, though, would be the overcooked scallops.  If you are an adventure Eater or like common things cooked in uncommon ways, I would skip this one.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zCNkLqHEImSxUlhljSXKEg"
  },
  "YJDQHnCnedw8oXdTWxdAQQ": {
    "date": "2/12/2016",
    "text": "Most of the facets of our meal of Thursday, 11 February 2016, were marvelous as usual, particularly the server and the host staff.  I asked for onion on my Caesar salad, which was not brought.  Everything else was presented as ordered.  The glaring flaw was the braised short rib entree ($35).  It was delicious, but I was stunned by the tiny portion size, suitable for only a child.  The diner should be warned that this dish is for those who are not hungry!  The mashed potatoes that accompanied it were delicious.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1jXmA4__4UWIplZk6MJMQ"
  },
  "Zbg9DcEUmdUaXxy7IB91Vg": {
    "date": "1/28/2014",
    "text": "I love this Morton's. .the staff is great and the food is amazing..the ribeye was great and scallops wrapped bacon amazing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "eT_2Npy-ymSQjqj0tUUGlQ"
  },
  "wUIT9VbBj3wG1jlxF3PPnQ": {
    "date": "1/21/2014",
    "text": "In the words of my father this restaurant is first class all the way! From the valet service to dessert everything was fantastic-you of course are paying for it.  It was a wintery night and $9 for valet parking was fine by us.  The valet was very concerned about my heels getting caught in the grates on the sidewalk! We used Opentable to make reservations although it wasn't as crowded as I expected for a Saturday night. We were seated right away at a side booth which was perfect for two. Our waiter was fantastic and I started off with one of the specialty cocktails and my date ordered red wine. The drinks are pricey so beware-$15 each for the glass of nothing fancy red wine and the specialty cocktails are also $15 each.  It was Pittsburgh restaurant week so I went with the $35 3 course meal which I thought was a fantastic deal.  You had your choice of any salad. I went with the cob salad which was a smaller portion but just right for me. With 4 entrees to choose from I went with the 6 oz filet and mashed potatoes (choice of one side).  They were both fantastic. I ordered the chocolate moose for dessert thinking it was cake rather than a small bowl of rich dark chocolate moose but it was still pretty good. My date went with the $59.99 3 course option that included seafood. I believe they have this option anytime.  He started out with a full size caesar salad which included very tasty homemade croutons. Along with the 6 oz filet you also were able to choose a seafood side. He went with the bacon wrapped scallops (they give you 2 huge ones) and baked potato for his side. What I loved about the baked potato option is they bring out a topping bars complete with butter, sour cream and bacon.  For dessert he went with the chocolate molten cake with a side of vanilla ice cream which was to die for!!  Overall one of the best meals I have had in a while!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bu1mtWwxuayzV6b3VScWLw"
  },
  "_wFsTvQxtrYEWb0XYHow7w": {
    "date": "1/18/2014",
    "text": "After originally writing this review for Open Table, and not until it was completed was I informed that it had to be trimmed to a brief highlight before it would be posted. FAIL OPEN TABLE REVIEWS!  Morton's The Steakhouse, to the average joe, is a special occasion treat. It's prices are out of this world, especially when everything is a la carte. The restaurant-going public at large has gotten used to dining where choosing an entree entitles you to choose soup or salad, a vegetable and a starch. I've been here before, so I know not to expect anything with my steak besides a plate and flatware. Oh, and a napkin (and to be totally honest, bread and a glass, complete with water).  However, since the star of the show here is steak, it's almost sacrilege to choose anything else. C'mon, the speciality of the house is right there in the restaurant's name! I went with the \"Signature Cut New York Strip.\" To be totally frank, it is quite possibly the best steak on the face of the planet. It comes with a beautiful char, perfectly cooked to perfection, with nary a blemish to be found. You will be using your knife, but never to cut away grizzle or fat. How does a steak taste this good, chew this well, and not have any fat vein? Not quite sure, but Morty seems to have it down to a science. My companion had the \"Center Cut Prime Ribeye\" and she agreed with my assessment of perfection.  I saw many of the apps and sides being delivered to other tables, but after a soup (which I will describe in a moment) and steak, who could eat so much. The Jumbo Shrimp Cocktail app looked tantalizing, old-school style on a wide-rimmed glass, complete with dry-iced fog effects. The mashed potatoes and mac & cheese looked tempting, and were large enough to feed a group, but I can't attest to the flavor.  We started with a loaf of exceptional warm bread with flecks of toasted onion on the crust. It had a wonderful crumb, and I'd buy it from a bakery in a heartbeat. To begin I started with the Lobster Bisque, and my companion began with a Center-Cut Iceberg, or wedge salad. The wedge seemed perfectly adequate, inspire of it's Flintstones size. We both agreed that the Lobster Bisque was sublime! It had an incredible depth of lobster stock flavor. Speaking only for myself, though the bisque is the main attraction, the lobster island usually found floating in the middle is akin to the cherry topping an ice cream sundae. And I save it for the final sayonara spoonfuls. And in this case, it actually took down with it what went before. It was so overcooked as to be inedible, and rarely is ANYTHING inedible to moi. It had the mouthfeel of an underdone sponge, or perhaps soggy cotton balls. What a disappointment! I really couldn't tell if it was over or underdone.  So that last payoff, combined with the waiter's never-ending push to inflate the bill with dining accoutrements, were the only demerits from an otherwise exceptional meal!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IOYbJgL67pkodqDGr1rIXg"
  },
  "YVWe8M9O6eEh7beWMZxeOA": {
    "date": "2/16/2015",
    "text": "We arrived from the Airport, and were greeted by Matthew and welcomed to the best steak house in the area. We were so glad to have arrived and looked forward to our amazing dinner. Our Server Bryan did not disappoint - the pre dinner drinks - the food and the wine were delivered in exquisite fashion. Thank you all for an amazing experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y-vq6pMSAnr7VqZ3mP8-OQ"
  },
  "EOATny66oZl6tTxhfBqBUg": {
    "date": "11/26/2014",
    "text": "Wow, they know how to cook a steak!  I took my husband for our anniversary and he was practically giggling every time he took a bite of his Porterhouse because he thought it was so good!  We will be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OXDYjJyJzBVNHeKGjbxb2A"
  },
  "TMLqnZNBqlDGThGKbbCi1A": {
    "date": "8/18/2011",
    "text": "Morton's... Well where to start. I took my girlfriend here to celebrate some important events that occured all within a week. It took close to a week to decide where we had wanted to try and we decided first to make it upscale, and secondly about steak. Well we had our clear choice to be Morton's.   We enjoyed the ambience and atmosphere that was provided as well as the wonderful and informed wait staff. We had reservations and were actually sat early which was fantastic! I am a big lover of steaks so I chose the porterhouse, while my girlfriend had the double cut filet.   We started first with a salad wedge which I found to be tasty, very crisp and fresh. My girlfriend had the lobster bisque which she loved. Our steaks came out after we finished our staters and our wonderful bread loaf.   I must say the steak was cooked exactly how I wanted it and I ate every bit of that monster! We finished off with the hot chocolate cake which was devoured rather quickly. All in all it was a wonderful experience and for me very much worth the money.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "On9QMyRntgTDbaD5-uT8wQ"
  },
  "qMGBL8oNp-a23Yq0_fxlAA": {
    "date": "9/25/2015",
    "text": "Terrible Value but the steaks were good.  $13 Caesar Salad with tasteless dressing that probably came out of a bottle.  $13 side dishes.  But the most crazy was $89 for a bottle of Acacia Pinot Noir that's $20 at the State Store.  A mark-up of 4 1/2 times retail.  Insane.  No other drinks.  No dessert or coffee.  So the bill for 2 salads, 2 steaks, 2 sides and a bottle of very average wine was $310.  Probably the worst value around.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jlWYqr9IGLQrSRowtsKf4g"
  },
  "wkuDSRzqTpvt0WMp4vb4zA": {
    "date": "8/18/2010",
    "text": "For my boyfriend's birthday earlier this week, he told me that he wanted steak for dinner.  Steak he wants, steak he gets!  We did a little bit of research about where to get a great piece of meat in Pittsburgh, and we finally decided to check out Morton's.  We'd heard of it from Chicago, and it definitely has a good reputation there too.  So we came in for our 7:30 reservation on a Tuesday.  The hostess greeted us warmly, and led us into the dimly lit room to our booth.  I had told them on OpenTable that it was my boyfriend's birthday, and my mom called ahead to pre-order some things, so the waitstaff knew that we were celebrating.  And wow, somebody told him \"Happy birthday!\" every 15 minutes!  They all knew about it!  Our menus actually had \"Happy 28th birthday, Taylor!\" printed on them.  My mom had pre-ordered sparkling wine, which was waiting for us on ice when we arrived.  The sommelier (wearing a tux!) poured it for us.  After we toasted, a hostess came by with a digital camera and snapped our picture.  Five minutes later, she came back with a print out of the picture, and a birthday card signed by various servers.  Wowza!  We felt unbelievably welcomed.  We helped ourselves to a slice of the huge loaf of onion-y bread sitting on the table, while we listened to our server tell us about the various menu offerings.  It's a little funny how they have examples of the food sitting under plastic wrap.  It does give you a nice visual for the steaks, but it's a little funny for....asparagus.  Still, seeing the size of the meat helped us make our choice.  First, we got the onion soup and the Caesar salad.  The onion soup was served bubbling hot, with a layer of cheese baked on top, of course.  It was very tasty - not the best I've ever had, but it definitely hit the spot for two hungry people!  Something about the broth was a bit too sweet perhaps.  The Caesar was great - they knew we were splitting it so they served it on two perfectly portioned plates - you could taste every single ingredient that goes in a classic Caesar.  You know they made this dressing perfectly - can't leave out the anchovy!  Delicious.  We each got the bone-in Ribeye, which was 20 oz of medium-rare amazingness.  Our steaks were unbelievably tender and flavorful.  The meat was pretty marbled, but the fat was so succulent that honestly I ate every bite of it.  The meat needs no sauce - just that luscious char on top and warm tender beef within.  Fantastic.  Loved every bite.  Our one wish was that the plates were warmed - since they were cool, it seemed like the steak was cooling down faster than it should.  But that didn't stop us from loving our wonderful dinner!  Mom had pre-ordered two desserts, their classic chocolate cake and the creme brulee.  I didn't taste the cake, but my boyfriend said it was incredibly rich and decadent.  I loved the creme brulee, and somehow finished every bite despite being stuffed already.  Service was always friendly, the ambiance was romantic, and truly I felt like we were royalty.  Come here on a special occasion, and you'll see what I mean.  It is a very expensive place to eat, but totally worth it for a special occasion.  With prices that high, you deserve to feel like their most cherished patrons of all time, and we certainly did.  I would very much like to come back the next time we have something to celebrate and want to have a big steak at the same time!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "yaBIVHDxaUBN2YHQ8-YiuQ"
  },
  "ry3xGMOVYZ1PqIb_RLIDew": {
    "date": "9/13/2012",
    "text": "I can't wait for the day I walk away from a $120/person steak dinner feeling like I got what I paid for.  This wasn't it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "fQSH9H4-tdUBkg1vVaUc3A"
  },
  "hGTD8jQxNY5LD0xZpOCxFg": {
    "date": "11/1/2015",
    "text": "We had dinner tonight and were so disappointed. We had a party of 15 and the service was so slow we ended up serving the cake ourselves. The food was bland at best. They do not have a children's menu. The only thing that was efficient was the valet service. We won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "78Ir1tZ0H-yCpSw0f7eIJw"
  },
  "JTcLGUkTsi_BVWTGNRQUag": {
    "date": "1/11/2012",
    "text": "I know I'm a steak snob but I found this Mortons perfectly adequate. The service was just okay. We asked our waiter for a recommendation on a side dish and he not only forgot to bring it but also what we ordered!  And you think they were bottling it themselves when we asked for a second bottle of wine. The only saving grace was the chocolate mousse which was a little cup of whipped heaven.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "vk_Rp8-2dZMBqMpP6Q6VLw"
  },
  "YzSfWnXUi7WtpB0_Rtqc7w": {
    "date": "7/9/2013",
    "text": "We ended up at Morton's for our anniversary dinner because Meat & Potatoes was overbooked and we didn't want to wait an hour for a table.  What a great decision!  The service was impeccable and the food was delicious.  Yes, it is expensive, but we were able to split an appetizer, soup, steak and vegetable dish for a reasonable price and didn't have room for dessert.  Their portions are certainly in-line with the price.  Their Lobster-bisque is basically heaven in a bowl.  Don't miss it!  And the Balsamic reduction on their asparagus was amazingly flavorful and clearly a True reduction and not one of those lousy corn-starch reductions most restaurants are using now.  On my way out I slipped (due to my own inability to walk!) and fell, and the response from the staff was very caring and immediate.  I was impressed from the moment I walked in until the moment I walked out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "poqdCeijsMRECEamzb5oGQ"
  },
  "BqzP1YuUSpX3j7U6RVJMLw": {
    "date": "9/21/2010",
    "text": "Morton's gets a 4 star because they are more expensive than Peter Luger's and not as good as Peter Lugers.  However, Morton's is a very good chain steakhouse. I'd suggest going with a group of people so then you can order the porterhouse for 2. It is delicious. They bring it out on a hot place and set it between the 2 people eating it. You are then each given a piping hot plate with hot butter drizzled on it. The server then puts some of the meat on your plate and rubs it around in the butter. Delicious. For the sides, I would suggest getting the creamed spinach. The asparagus isn't bad either.   I actually went there for my fraternity senior class dinner with a group of 8 guys and they gave us our own room which was really cool. You just have to put down a cover for each person which you lose if one guy doesn't show up. We all got the porterhouse for 2.   For deserts, you need to get the souffle which has to be ordered with the meal because it takes some time to make.  After multiple bottles of $60-80 wines, the total tab came out to a little more than $1000 for the table which wasn't too bad.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MbBhClrXyu8-Mk5wW5y8tg"
  },
  "eqE-ZdGEWN-8UX9MzOwsQQ": {
    "date": "12/1/2012",
    "text": "Morton's is one of my all time favorite steakhouses. We have been to this location on multiple occasions and have never been disappointed.   To start, we've had the raw bar appetizer which is always fresh and delicious. I always order the filet mignon medium rare, while my husband will change up what he gets. The sides are huge and made for sharing. The creamed spinach is yummy, the baked potato is huge, the hashed brown potatoes are nice and crispy but I don't think you can go wrong with anything you order.   The key lime pie is delicious and the legendary hot chocolate cake melts in your mouth but the souffle for two is always a winner.   Also, don't worry about parking because they have valet up front.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "kJ8BvrNfz0zBf0L9v10PGQ": {
    "date": "3/8/2009",
    "text": "The last time I ate at a Morton's was in Houston, TX, so I was very excited when BJ suggested that we dine here Saturday night. Had a 7:30 pm reservation, was greeted promptly and led to a comfy corner booth. The restaurant was very busy. Our server Georgeann was very friendly and hit it off right away with BJ. The two of them kept me entertained all night long! I don't know which one was the funniest. Well, BJ wins hands down.   We pondered the wine bible for a bit, but BJ is a beer dude (they have a somewhat limited selection) and I am more of a cocktail girl. Loved the cosmopolitans there. Very delicious.   We bypassed the appetizers, we both got Morton's salads, which were huge. I had a single cut filet and a crab cake, BJ also got a filet and bacon wrapped scallops. Both our steaks were very flavorful and cooked to perfection. For our sides, we shared asparagus and a loaded baked potato.   We could not pass on dessert. I had to have Morton's Legendary Hot Chocolate Cake and BJ had the Key Lime Pie. The chocolate cake was amazing, I love it. So did BJ.  He ate it instead of his pie.  We got the pie to go and it was also very, very good.   Great place for a special occasion. We had a wonderful evening.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "H5d_nFqzwrREE-YduK2ABg"
  },
  "pgn3AX9rw83sTv1XoVRlhg": {
    "date": "10/14/2012",
    "text": "My wife and I took a friend to Morton's after a Steeler's game 7 October.  I have never been to one of these steakhouses so it was a real treat to experience it in Pittsburgh.  It was absolutely the best steak and meal I've had at any steakhouse or honestly a dinner anywhere.  Everything was perfect...steaks, crab cakes, shrimp cocktail, and the veggies were just amazing.  I literally fell in love with the cream corn.  The manager (Robert) came over and personally checked on us, engaged in a conversation for at least 10 minutes and was just ensuring our experience was perfect.  It was.  The after dinner drinks and desert (a chocolate lava type cake) was beyond words.  This is now my favorite place and steakhouse.  Thank you!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ekub3M-h2QKmp1lhOv3-Vg"
  },
  "4lbjZcIQJzqYkJcHD26xiw": {
    "date": "7/17/2012",
    "text": "It's Morton's... High end steakhouse with high end decor, service, and food quality. Nothing particularly amazing or different from this locations, but I did find the 3 course special to be a great value. Morton's was just purchased by Landry\"s which may lead to even more corporate feel. I could tell (because our waiter told us) that most of the staff is not exactly thrilled about the acquisition. We will see...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3I2wGF73UOPMuwSuzMCYWQ"
  },
  "3b0Fv4AOBRkRqyIys7nQaA": {
    "date": "10/4/2012",
    "text": "Unbelievable! We were in town for weekend and looked up the reviews in yelp for a nearby steakhouse. Service was top notch, wine list extensive and above all an excellent meal. Would definitely recommend it for a special occasion and great meal out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aCrU0-DW1Z0w1YIwSHR0AA"
  },
  "v8UNNeppw61UaHw2cSemGQ": {
    "date": "5/1/2015",
    "text": "My boyfriend has taken me here for my birthday almost every year. I always find the experience wonderful.   They have custom 'Happy Birthday menus' for you. They take/print a picture of you/spouse for you to take home. Everyone stops by and wishes you a happy birthday. 50% of the time I got a free dessert.   We usually go around 5:30 so it's pretty quiet, not a lot of people. My birthday landed on a Monday the one year and we had the whole dinning room to ourselves.  The foods always wonderful. Staff is always wonderful.  It is ridiculously expensive so coming here once a year just the right amount.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cA5cJkMKBkM5qDVv-8jZ9g"
  },
  "Bhim030N2Q86sJwomZfuwQ": {
    "date": "2/28/2015",
    "text": "We had the filet mignon, sour cream mashed potatoes, grilled brussels sprouts, sauteed wild mushrooms, chocolate mousse and the seasonal fruit crisp. For drinks we had the fire and ice and the secret garden.    The meat was not as favorable as we expected. But the side dishes were really yummy. The mushrooms had the best presentation, and the mashed potatoes were perfect! The seasonal crisp was better than the chocolate mousse.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mQII58g259FR6KViE4FzmQ",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mQII58g259FR6KViE4FzmQ/o.jpg"
      },
      {
        "img_id": "glt-aRPh-QtuekNLjTAq3A",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/glt-aRPh-QtuekNLjTAq3A/o.jpg"
      },
      {
        "img_id": "IRyiyhqX0j2msmATJ4K8WA",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IRyiyhqX0j2msmATJ4K8WA/o.jpg"
      }
    ],
    "user_id": "ZedmQ3zv5V3JjGRgwevziA"
  },
  "8TP6LfIh_EBwBsz-KYuSkw": {
    "date": "2/15/2016",
    "text": "Went here for the first time ever last night and the overall experience was incredible!! Showed up 30 mins early from our reservations and was seated immediately. It being my first time there, the waiter was very knowledgeable about the menu and any questions we had, he also stayed on top of the drinks. The steak was cooked to perfection, nice and juicy, tender, and well seasoned. It was the best steak my date and I ever had (Cajun ribeye, my date had the NY strip) and I will definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0IEZNvhmPR5KA9yx9D24Ag"
  },
  "Q6XzJROq4-OPJ0zrxkjitg": {
    "date": "3/15/2013",
    "text": "I love a good steak every once in a while and when me and the then-BF received a gift card for Morton's I was looking forward to a nice evening out.  If you go there for ambiance, you will be disappointed.  It is lit brighter than a high school cafeteria, and the tables are very closely crowded together.  At a place like Tessaro's where you're paying seven bucks for a burger, this is to be expected, but a place like Morton's?  Come on!  The server was good and brought out the different cuts of meat and provided helpful suggestions for pairing our dinners with a nice glass of wine.  Most people already know this, but everything is a la carte.  So everything--a baked potato, a salad, a vegetable, etc.--is extra and on the expensive side for what you get.  I ordered a ribeye and it was perfectly cooked medium/medium well.  I ordered a tomato and mozzarella salad and it was excellent with a drizzle of olive oil and balsamic vinegar.  My dinner companion got a filet and he said it was good but it I thought it was quite small.  I believe he got creamed spinach as a side and we split a side of mashed potatoes.  I believe the bill, with the tip, came to over $150.  Was it a good dinner?  Yes, but not great, and far from outstanding or memorable.  Was it worth $150?  No, in my opinion.  If I spend that much money, I'm looking for the \"whole package\"--great service, soft lighting, a bit of room from the next door diners, etc.    I'd give the food three stars, service three stars, atmosphere zero stars, and value for the money one star.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "4pRehidpIXTZsTK3sBrUeQ"
  },
  "Nhi6sx0309x0x2G5LESBIw": {
    "date": "3/13/2017",
    "text": "Everything was perfect. We couldn't have asked for anything more. Warm, pleasant, yet professional greeting, and seated immediately. Decor and atmosphere were very high end. But none of the staff was pretentious. Food was perfect. Sea bass was the best I've ever had. My wife said her fillet was delicious. Our sides were incredibly tasty. I can't imagine wanting anything better. They had a extensive wine list. Our waiter was friendly, but not familiar, and very attentive. Morton's is outstanding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F4fzipDpsDD9wrKr7LnJGQ"
  },
  "1yxVdc0Lwzpr20A4Y6jSrw": {
    "date": "2/13/2016",
    "text": "Wonderful experience! We made reservations for last night at 630pm, we arrived early and were still seated immediately! Our server was amazing. We both ordered the filet and lobster tail. Our filet were both way over cooked but still the best filet we have ever had. Lobster was delicious. Good portions per meal. Both ordered a side; we got the jumbo baked potato and the bacon& onion Mac n cheese. The sides are quite large. They do not skimp out on the toppings for the jumbo baked potato either! They really tried to push dessert on us but we were very full by then. Overall experience was great! We opted out for the valet and parked about 1 or 2 blocks down at the parking garage for $5. Will be returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HAHaqZUvu3YcMCNknT0yzA"
  },
  "oeVEcxcxdkp8enOUWMsy1g": {
    "date": "5/2/2016",
    "text": "I can't tell the difference between Morton's and other chain high-end steakhouse.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eVt6t1Acg3y32R8E_AbJ-Q"
  },
  "HhjqkQledrRDzU29rjS1Qw": {
    "date": "12/31/2012",
    "text": "Morton's, was without a doubt one of the original esteemed statehouse restaurants in America, often emulated by others.  Great they were, with superb steaks, outstanding service and old club style ambiance. This was always a top place for business and special occasion dining. Now it is not as much as it was for my money and taste based on a recent visit. They are taken over by a very large mega restaurant chain corporation. Landry's, who are owners of over 35 restaurants and chains many you would be familiar with now own Morton's too. Morton's no longer has a focus on their original identity, meaning and purpose but are being changed in a modernized way. On my last visit changes were visible. Some changes and cost cutting and commercializing has begun. The menu is changed to include items which will appeal to a broader clientele. Now profits and growth are a bigger part of the strategy.  Gone is the famous GM Bill. Bill was as much an institution as the restaurant he ran. Changed too seem to be the quality of the steaks. Our ribeyes were not a recognizable ribeye cut and the taste was not there as we remembered. One of three steaks came out drastically overcooked although the error was quickly remedied with a properly cooked replacement. I just hate to see the continuing commercialization of our esteemed restaurants in America.",
    "rating": 2,
    "rated": {
      "funny": 8,
      "useful": 23,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "Emg2nln0IZB_tvcAgxtfew",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. I think Linda is satisfied with dinner tonight.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Emg2nln0IZB_tvcAgxtfew/o.jpg"
      },
      {
        "img_id": "hq6mWQ5CbvOIongFMk8nLA",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Jody will eat two Center-Cut Prime Ribeyes. Hold the carbs and stick to the basics of the place. That boy can eat.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hq6mWQ5CbvOIongFMk8nLA/o.jpg"
      },
      {
        "img_id": "mNu9xESjHP9mvIFhCaZzQQ",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Somethings remain the same.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mNu9xESjHP9mvIFhCaZzQQ/o.jpg"
      }
    ],
    "user_id": "AyYKTOCL5qM8589oBsqbfA"
  },
  "MLkGn6p_4S3PgefrbzutyA": {
    "date": "9/13/2013",
    "text": "Formally, my favorite restaurant in Pittsburgh. Years ago when I would come here the food and service would be exceptional.   However, lately the food quality has really dropped. It is a little disappointing, I came 2 times in the past 2 months and both times I was left wondering what had happened to the ultra high quality food.   Full disclosure, one time I came during restaurant week for one of the lackluster meals and the other was a business lunch where the business purchased salads and deserts for everyone.   I still like the place a lot. But lately it seems like Morton's is more and more empty than I used to remember and maybe that is the reason why.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "W3taqdZnz61XE-nIfUtoiw"
  },
  "93RYOXRsb0kq0RqX0VJMOQ": {
    "date": "8/17/2015",
    "text": "For my final stop for Pittsburgh Restaurant Week, mumsie and I chose Morton's. This was my first experience and any Morton's and I think it converted this mostly-pescatarian into a full-blown meat eater.  We enjoyed similar selections from their Restaurant Week menu which included the Ahi Tuna Tower, 6 oz. filet, Key Lime Pie and Creme Brulee (I had the Pie). We started the meal with a couple of cool cocktails and warm, fresh-baked onion bread - both delicious.  The Ahi Tuna tower was a solid \"good,\" though I'd probably try one of their signature salads instead the next time.  Dessert was also very good, but the star of the meal was the Filet. This filet. I don't even know what to say. I moaned...too much during this meal.  But it was SOOOOOOO good. I'll go ahead and say it - it was the best damn piece of meat I've ever enjoyed. Done perfectly medium rare, it's something I'll be thinking about for weeks to come, I'm sure.  Though Restaurant Week is officially over, Morton's has a \"Summer Tasting\" menu which offers the same choices for $40.  My meal, including cocktail, rang it at $52 - a SIGNIFICANT savings over retail price.  Though the ambiance at Morton's leaves much to be desired, it's worth it to enjoy such quality food and service. Get there before the summer sale ends!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ARdx8hOcEWlMDjzwLYZ_g"
  },
  "fJidUPm1SjP8YgSBr4K_fw": {
    "date": "1/17/2016",
    "text": "When you're in Pittsburgh, and you want to have a great dining experience, let me suggest Morton's!  I have had gone there for lunch on a few occasions, but dinner is a whole different experience!!!  Our waitress Kelly was great!  She provided us with great suggestions for wines to pair with our dinners, she kept great conversations with us, and made sure we enjoyed our evening.  Both my girlfriend and I had Filet Mignons.  I have had Filets in a lot of places, but I think this might have been the best ever!  I also had a Caeser Salad before, Steamed Broccoli with the meal, and the Double Chocolate Mousse after.  My girlfriend enjoyed the Tomato Salad before our meal, the Chicago Mashed Potatoes, and the Key Lime Pie for dessert.  Afterwards we finished our bottle of Spellbound Merlot, signed up for the Landry's Select Club and enjoyed the remainder of our evening!  Morton's has always been one of those places that I've kept in the back of my mind for a great meal, and tonight they have proven why they are the best!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2P9mqMjke2qOGgfNMfkPFA",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Night At Morton&amp;#39;s!  Spellbound Merlot, Caeser Salad, Filet Mignon, Steamed Broccoli, Bread, Double Chocolate Mousse. Great Meal!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2P9mqMjke2qOGgfNMfkPFA/o.jpg"
      }
    ],
    "user_id": "WgHfq_3N4nbxp3c-6uBwEA"
  },
  "TIihTxbmOF-jnpETidyjmA": {
    "date": "5/21/2014",
    "text": "Refined, classic style steak restaurant, Mortons will not disappoint those who are looking for a traditional upper end place.   Yards of linen, tons of silverware, and hordes of waiters make this place a must go in Pittsburgh.  Our table of six enjoyed perfectly done steaks and fillets, beautiful accompaniments of vegetables and potatoes, great salads,  excellent desserts, along with an impressive wine offering.    Expect to pay heavily for this experience, it is well worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BAQKh3cLeo6RGTpi6dnYkA"
  },
  "WA3UcwbmcO9pGidpWMALrg": {
    "date": "4/29/2014",
    "text": "I went to Morton's for the first time on 04/19/2014 to celebrate my boyfriends birthday.  Overall, the experience was exceptional.    The meal started with prosciutto wrapped mozzarella.  It truly was one of the best appetizers I've ever had.  Our salads were served next - one caesar salad and one chopped spinach salad.  Each were good but nothing special.  For our entrees, we ordered the porterhouse steak with peppercorn rub and the 6 oz. filet mignon with shrimp and scallops.  The steaks were cooked to perfection, but my partner thought the rub on the porterhouse was overpowering (I tended to agree).  We also ordered horseradish mashed potatoes and sauteed broccoli florets as side dishes.  Both were amazing.  Morton's Legendary Hot Chocolate Cake rounded out the night (in addition to one bottle of wine and 2 alcoholic coffee drinks).    This was a perfect way to celebrate a special occasion.  Beings that we had never been there before, it was important for my boyfriend and I to try a bit of everything!   We had more than enough food to eat and even had plenty to take home with us.  The cost (including tip) was approximately $330.  BUT, to be honest (and I can't believe I'm saying this), the service made it worth it!!!  The wait staff was better than any I have ever experienced...very personable, knowledgeable, and accommodating.  More than anything (even the taste/quality of the food), the service is what will bring us back to Morton's Steakhouse for our next special occassion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oJ9l3P0gXEACrSlg-ROBeA"
  },
  "MbNTLSFQe6MNPfR-y3oaIw": {
    "date": "9/27/2012",
    "text": "I came here for my birthday dinner.  I was not impressed at all.  First off, we sat at the booth near where the host has his podium.  He seemed to be in a bad mood and made us feel uncomfortable.    I did like the nice touch of having my name printed on the menu and service by our waitress was good.  However, food wise, it was just OK and a bit disappointing.  I of course had filet, and I was just so underwhelmed with it.  The flavor was meh and the black truffle butter was surprisingly boring.    After this experience, I have no desire to ever come to this restaurant again.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "tOMztypmq06beq-zncxjiw"
  },
  "9HobibfIx4btqwQMsqjCoQ": {
    "date": "9/27/2014",
    "text": "How this place got 4 stars when there are so many better options in Pittsburgh is beyond me.  The only thing that was noteworthy about the experience here was the price. The food was bland. Nothing to write home about. The place looks uppity, but really the food is just ok. Go to Ruth's Chris instead.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "XEY3td7sbGvmkSsFNMyyRg"
  },
  "s-IWR_elYwqvrrdEAnL_Dg": {
    "date": "9/13/2015",
    "text": "I was there for dinner with a friend last week.  Our server John was very nice and professional.  Foods were great! We both had the filet mignon medium rare, perfect! $40 comes with a salad, 6oz filet mignon, a side, and a dessert!  It was a great deal!!  Love it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z7xdvngzxGEOdQTPxvh5Hw"
  },
  "HhsXhFIU5P8bRbYOTjr12Q": {
    "date": "2/17/2015",
    "text": "The service was great- our group of 6 was really well taken care of.  We went in December of 2014 just after they had re-opened from the fire.  A few things we ordered weren't available, and as former service employee myself I understand how it will take a bit of time for them to make sure they are fully stocked.  I did not pay the bill, but someone from the management team came out and said they'd take care of a few things for us, which was very generous. We also requested to move tables because of a cold draft from the entry doors and they did that for us as well.  Never having eaten here before, I felt the food was very average for the above-average prices we paid.  Our server was very knowledgeable about everything and had great suggestions.  Our appetizers were good (scallops and wrapped cheese).  The best part of the meal was the endive salad I had, a special that particular time, and very interesting combination of flavors. The sides we ordered were a black truffle cauliflower (a special) and au gratin potatoes. The potatoes were really lackluster and all 6 of us probably only ate half of them.  Stuff I make at home is tastier.  The cauliflower was ok.  For the meal I had the mixed grill- shrimp and crab cake.  Lacked flavor and was very average at best.  I've had many crabcakes in my day and this was no better than a $8 crabcake at Red Lobster (that is probably at least 75% cheaper too).  The price tag was so over the top for what I got with this entree.   Dessert was a joke- a chocolate cake that was SO boring in taste and flavor.  It was like some sort of frozen dessert I'd buy at Giant Eagle & warm up in the microwave for 30 seconds.  Overall the speed was a bit slow too, but I know sometimes they do that on purpose to give you time to enjoy the atmosphere, which was pleasant.    Often I find it worthwhile to pay more for a meal if you get a wonderful mix of flavors that you usually can't recreate at home yourself, something that satisfies the palate. This dinner left me feeling full but not satisfied.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hdz4kId9ydLGLONkWc826Q"
  },
  "X8_-1G-8ynXgAQq-LDCwjA": {
    "date": "2/2/2014",
    "text": "Visited Morton's last night for dinner before the show. After we were seated, our waiter greeted us shortly after with the menus. The menu has a perfect amount of options. Not too many and still enough to have a complete variety. Chicken, chops, seafood, and most important, STEAK! For a salad, we started off with the chopped spinach salad. It was perfect, as I am very particular with how my salads are dressed. The dressing wasn't dripping off, it was evenly and perfectly coated. I chose the 6 oz filet mignon, with 2 bacon wrapped scallops and 3 grilled shrimp for my dinner. It was more than enough. The steak was so tender and juicy! I would definitely go back to Morton's again and again for a wonderful meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AfhjOClos5vUKwMGvwxEPQ",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. 6 oz filet mignon, 2 bacon wrapped scallops, and 3 grilled shrimp. Phenomenal!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AfhjOClos5vUKwMGvwxEPQ/o.jpg"
      }
    ],
    "user_id": "YVxvDmbde3iKKsUK-ZL7TA"
  },
  "KfpQahLjHRNxy_UCvEvpdA": {
    "date": "6/6/2015",
    "text": "I had the opportunity to try Morton's food through work. My experience there was all right. Compared to my dining experience at Ruth's Steakhouse, Morton's paled in comparison. The filet mignon I ordered was not cooked to the medium rare I had requested. However, the waiting staff provided excellent service so I have no complaints about their service. There are other steakhouses in Pittsburgh that offer a better steakhouse experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BTg_ajmMJKKpvH0P1mAUqA"
  },
  "-xuxhjpYPGV09cRBv1L1Ww": {
    "date": "3/5/2013",
    "text": "I ordered the center-cut ribeye for entree. It was delicious.  The environment is nice and servers are polite. Recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sTkCM0cPGIGG1ZjOIjjGig"
  },
  "y2QXivYXfP1zAV6-JkUspQ": {
    "date": "5/12/2014",
    "text": "This place is great! Went for work and we had the most attentive and friendly wait staff! We were all joking around and having a great time! Completely took over the place with our small but loud group of 4! Split multiple bottles of wine and had many a cocktail, appetizer and entree. So good and definitely better than going to a Capital Grille. If you're looking for a good place to go for a work dinner, I highly recommend. They don't disappoint and have a menu that also caters to those of us who don't like steak- I had their salmon and it was delicious! The apps, especially the tuna tartare, was incredible!   Hope to be back next time I'm in Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "sDRrYd6VJIxZX-Mu9vtG8g"
  },
  "5woulcCZ1bEVor_MG1bOCg": {
    "date": "12/21/2017",
    "text": "DO NOT WASTE YOUR MONEY!!! GO TO HYDE PARK!!!  My husband and I took my parents to dinner at Morton's downtown pittsburgh .  (We normally go to Hyde Park but we had gift cards to Morton's that we have never used from our wedding).  We all ordered the 6oz filet, the shrimp. And scallop meal for $59.  We all ordered the filet to be prepared medium.   All of the filets were overdone. ..... like well done .   My mom actually had to send her filet back it was so over cooked.  The shrimp and scallops were very small.  The taste of the filet had nothing on Hyde park.   I think the food at Outback Steakhouse or Applebee's is better than Morton's.  I would actually prefer McDonald's to Morton's.  This is our second time there and our last.   I was not impressed the first time and the food was so horrible this time WE WILL NEVER GO BACK.   Even the salad and sides do not compare to the Hyde park.   We have dined at Hyde park ,Eddie merlots and the palm steakhouse in Vegas.   Morton's is by far the worst high end steak house I have ever been too. Service was slow.  Food and drinks way over priced.  Sincerely, a very disappointed customer. Oh yeah and the bill for 4 people was $500.  My best advise..... go to Hyde park or Eddie merlots if you are craving a high end steak house in pittsburgh.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NHUt8mKdBF3CJocRhy_U7A"
  },
  "St4hwXPPCODu5md-N4fjvA": {
    "date": "1/7/2017",
    "text": "My wife and I were in town from California visiting Pittsburgh for the Steelers game.  We were craving a steak and having had a phenomenal experience in Los Angeles at another Morton's Steakhouse, we decided to give this one a try.   When we got there, the restaurant was packed and only room in the bar area.  We took it.  Our waitress was very nice, attentive and explained all the specials.  We went with the appetizer tacos (AWESOME!!), and shared a ribeye (we always do) and a baked potato.  We ordered the steak medium well.  Well, it came almost well done, but we were so hungry we ate it.  Needless to say, it was very dry and not much flavor. For the price we paid for the steak, we could have just had two beers and two orders of the tacos and we would have been good to go.  So, for a Morton's Steakhouse, we expected more.  We were eye balling other steak venues in town too, but this one was the closest to our hotel.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "S5S35XhzXM4vJBh1khnkHg"
  },
  "j0rHlivCGffW2LWpVoD--Q": {
    "date": "2/27/2018",
    "text": "The service is great, that's the only reason I'm giving the 2nd star. The quality of the steak I had was the same I could get at a Texas Roadhouse. I was disgusted when I turned around and seen the chefs prep a steak that came out of a vacuum sealed bag. You can't age a steak 28 days, like they claim, in a vacuum bag. It looked like the same steak that Omaha Steaks are mailed in. This place is way overpriced for the quality you get. Their drinks aren't anything special for the price. Save your money",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KZBlUvyzm_3oM27BMNhPOQ"
  },
  "RyCiCh1DTmOR_YjxyVKGfg": {
    "date": "7/22/2015",
    "text": "My family and I came here to celebrate my sister's graduation! It doesn't have a grand entrance and looks kinda like a normal hole-in-the-wall restaurant since you have to go through a couple doors to get to the actual restaurant.   Pros: The food, service, and ambience is great. We ordered so much food and had a bunch of leftovers. I, personally, ordered the cajun ribeye and it was cooked perfectly medium rare and FULL of flavor. We also got many sides, such as truffle fries, hashbrowns, mac and cheese, mashed potatoes and brussel sprouts. The truffle fries were yummy, but the hashbrowns were soaked in oil. I did like the mac and cheese though! I didn't get to try the mashed potatoes or brussel sprouts. We got the hot chocolate cake and the lemon souffle for dessert. The hot chocolate cake was delicious. It comes with raspberries on top, caramel drizzle, and a scoop of ice cream on the side. Definitely WORTH. The souffle was light and fluffy! A big contrast to the chocolate cake. Oh yeah, and the bread they give you to start is AMAZING. It's crispy on the outside and light and fluffy on the inside. That stuff is soo good.   Cons: It was noisier than expected; since it's a classy place you'd expect there to be soft jazz and people having intimate, quiet conversations. However, it was quite loud. And of course, the prices are very, very steep, but that's expected of a steakhouse.   Overall: This is a great place to celebrate a special occasion if you're willing to splurge! The food is so great and flavorful. Overall, my experience at Morton's was awesome, and I will be back.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "ZEWnzSvNo1v2efAAbVhK0w",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. The porterhouse",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZEWnzSvNo1v2efAAbVhK0w/o.jpg"
      },
      {
        "img_id": "L4s-K_LB4Psnu4iPYGFnVg",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Inside of the chocolate cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L4s-K_LB4Psnu4iPYGFnVg/o.jpg"
      },
      {
        "img_id": "0m0oqPEH7SGnAgkvoRcIgw",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Chocolate cake for dessert",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0m0oqPEH7SGnAgkvoRcIgw/o.jpg"
      }
    ],
    "user_id": "gWFbfassLbjkd7nfGPCu9A"
  },
  "xWegIVx2iNfgkIY3dNDHsw": {
    "date": "8/15/2015",
    "text": "I'd have to say I was pretty disappointed with my overall experience.   My boyfriend and I attended Morton's this evening to take advantage of restaurant week. I'm not sure if restaurant week had something to do with the sub par food. If so, its a shame because you would think the restaurant would want to feature their bests.   We both ordered the Morton salad with egg, anchovies, and blue cheese and we both agreed that the salads had too much dressing.   For the main course, he ordered the 16 once bone in pork chop and I ordered the 6 ounce    filet. He definitely went with the better option. The pork was flavorful and delicious. The filet was undercooked, I ordered it medium and it was medium rare. Good flavor, but honestly not better than any filet I've prepared at home.   The sides left much to be desired. I ordered steamed broccoli and he ordered mashed potatoes. We had to send the potatoes back because they were cold. The broccoli and the potatoes were very bland not much flavor at all, and there was certainly a lack of presentation.   For dessert, I had the chocolate mousse and he had the key lime pie. The pie was probably the best thing about the whole experience, that and the onion bread.   In hindsight, I'm glad we didn't pay full price and I'd much rather have eaten at Ruth Chris or any of the other restaurants participating in restaurant week. For the price, it wasn't bad given the amount of food, but I expected more from Morton's. Don't believe I will be returning here unless it's free!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "PpR9WNCcnU7YFH7lL8n_-A"
  },
  "Xccw7EdOpKnpnZrYZkSH1A": {
    "date": "10/1/2016",
    "text": "I can remember going her as a kid with my family for any fancy or special occasion. It just brings back great memories. Prom, birthdays, holidays, etc.... It was our go to place   I've been here a few times over the years but not as regular as we used to. Made my reservations on open table. On a Friday night I would have thought it would be crowded but there were only 7 tables.   I have to say our server was great and could not have done a better job.   I ordered my app which I was really excited for but unfortunately it was not good. I only had s few bites. And left the rest untouched. multiple employees came by but didn't say anything. I found this very surprising but I really don't like to send food back. But this was finally addressed by the Mgr at the end of the night. And they gladly took it off the bill.   Wife's meal was a special. She enjoyed the fish but the taste was just bland.   Now in was hoping for lobster but they were out. So i opted for king crab. They were cooked perfectly but I question portion. I ordered 1lb. And got 1 crab leg or approx 4 bites. I actually got one leg split into two halves. I think it was a good size but no even close to 1 lb.   Sides missed the mark. Asparagus still had the white part and had wayyyyy to much balsamic glaze.   Potatoes were covered in grease.   Sorry but with all the new choices and new places in the burgh..... Prob won't be back any time soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "R2WPxxtYsVeODrJexPVpww"
  },
  "jmr_4LcvCE7AkCJrFAg6TA": {
    "date": "6/23/2015",
    "text": "I love a good steak, which I did have my first visit here but this visit was just awful.   I took my hubby here for a Father's Day dinner, I feel so bad I definitely have to take him somewhere else.  The bread didn't seem fresh it was dry with an intense dry onion rub. Salads were ok, probably my favorite part of the meal actually. The steak I ordered medium due to being pregnant but it was rare, he got his medium as well and was actually done medium. My baked potato side was pretty good, it's hard to mess up microwaving a potato. His side of Mac and cheese was laughable. We were warned numerous times how hot the bowl was it came in but the actual dish was cold, cheese was hard, boxed Mac and cheese would have been so much better. The desserts I can't really say anything about I'm not much of a sweets person.  Staff was pretty attentive, you literally take one sip of water and they refill it. I guess I should complain about the service but it ruined the meal having them step in between us 20-30 times. I had to laugh when the one refill splashed my husband in the face mid sentence.  Definitely won't be back, too many other good options that don't disappoint.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "pXFbXy_8S36V5kzicY15uQ"
  },
  "rySbZPEn4wruGQVXIKBpqw": {
    "date": "3/30/2017",
    "text": "I thought it was a great dining experience.  The service was excellent.  The steaks were perfect, I had the scallops wrapped in bacon and they were the best I have ever had.   The chocolate lava cake was delightful.   This is the best steakhouse in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gyRRtnIZHF7Qq3zdE4slRg"
  },
  "NRoVygx55R2YC5sBAJE2fw": {
    "date": "3/29/2016",
    "text": "Stopped here after a show downtown.  Top-notch dining experience! Great relaxing atmosphere, very professional and elegant.  I had the duck, which was delicious. Ended with the cheesecake (a classic).  Pricey for 2 people and drinks, but absolutely justified with the excellent dishes and atmosphere. This food was SO good!  Great for a romantic evening or a special night with out of town guests.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TbsPNIrR3m6zpmzSJ5cfzg"
  },
  "DHOe2gLUZWazhsOAbOSDvw": {
    "date": "3/9/2015",
    "text": "To all: Morton's contacted me and has sent a $50 gift certificate for our lousy dinner January 22.  Our dinner for two was $160 +tip.  $50 is not working for me.  Just thought I would let them know??  I hope everyone has better success than we did.  Good luck all. J Rock",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "RaIitRHw8w3l2Ts10G5stQ"
  },
  "Hw36ep1XE9qUAsCTJ6f6xg": {
    "date": "1/22/2015",
    "text": "Allow me to preface this by saying I don't like giving bad reviews.  But since Morton's is a chain restaurant, I'm sure my opinion won't force them to close up shop.  Its more of a call to arms than anything.  Our recent meal at Morton's, with their elevated price points and long-standing tradition, was disappointing, plain and simple.  I would be inclined to blame it on Restaurant Week, but my wife ordered off of the normal menu.  The beef was substandard, tasting more like a sirloin from Chili's than the supposed high-quality cuts Morton's claims to shill.  When I bit into my side order of broccoli, each floret was half-warm and half-cold.  The only thing keeping my rating at 3 stars and not lower was the pleasant service we received.  When you spend the amount of money that equals half of a normal shopping trip for one meal, you expect much more than we received on this visit.  Simply put, a horrible value.  Extremely disappointed in your food, Morton's.  Your move.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "CzoD8fDNrvNdL03mCqSNTg"
  },
  "vOHcQ8WMqp6wjWCKweKsWw": {
    "date": "8/21/2016",
    "text": "My husband and I have been here before and thought we would try it again this past weekend. It was also restaurant  week so I'm not sure if this is the reason for the terrible experience.  Let's start with the service- our waitress was pretty terrible. When we mentioned we were interested in the specials for restaurant week it was like a switch was turned off. She was no longer interested in good service. After that the only time we saw her was when we flagged her down ( for additional drinks butter etc).  Our first course took about 45 minutes to arrive. For a salad.  I ordered grilled chicken and my husband the filet. My chicken came out and when I bit into it I realized the chicken was still raw. Not like slight pink but not cooked at all. Our waitress still was not coming to our table so I had to flag down a waiter to get her. He refused and instead asked what I needed. I told him my chicken was ( very obviously) raw. Our waitress came over about ten minutes later to see how we were, realized I didn't have my plate and abruptly walked away.  My husband refused to eat until I got my food which then made his meal cold.  I received my chicken with an apology from the waitress. What I assume was the manger came over and apologized briefly but it was just an oh sorry for serving you raw chicken.  I can tell you after the service , meal and customer service we will NOT be back which is a shame as we both work very close to Mortons.   If you are looking for a nice steak in Pittsburgh try capital grille or Ruth Chris .",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QKsxQ4l7KDxpku74ifH7Kg"
  },
  "Gax4R4anDD4yUZRJhghC3g": {
    "date": "8/10/2017",
    "text": "Very overpriced for very mediocre food.  I ordered the crab cakes ($36) and got 2 golf ball sized cakes that were seared with a crunchy crust on both sides.  Who wants crunchy, almost burnt crab cakes?  I want my crab cakes to be soft.  The crab cakes at it's sister restaurant, The Grand Concourse, are much better.  My husband ordered a steak ($60+), and said it was okay; nothing to write home about.  He prefers a steak with more marbling.  He also had the crab bisque ($15) and said he had better elsewhere.  I tasted it as well, and thought it was bland.  The best part of the meal was the dessert, the chocolate lava cake ($15).  But, to be perfectly honest, the lava cake at Applebee's is better.  I'm not a food snob.  The ambience and service were very good, however.  We will not be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IuMznMVB1RoAQRHJaFjYhw"
  },
  "tcb4dr0kJh0qye7uVAyNIA": {
    "date": "2/13/2015",
    "text": "A friend and I paid a visit to Morton's for restaurant week in Pittsburgh for the winter. Usually when I go to restaurant weeks I don't expect the same quality if I came in any other week. I also am skeptical of how much I would enjoy expensive chain restaurants. I was pleasantly surprised when I came to Morton's. I thought everything was pretty good, so I think I want to try when it's not restaurant week to see how much better it is.   Started off with a tuna tartar and it was delicious. The tuna and avocado with their sauce as a garnish was great. The tuna seemed very fresh. For my entree I opted for the steak. It was tender and not chewy at all. It was perfectly cooked (medium rare) and required no other sauces besides how it was prepared. My friend got the pork chop which was also very well cooked. I can't pick which I preferred more. For the sides the mash potatoes were great. Creamy and buttery. But the broccoli side I got was pretty lack luster. It stated bland and as if they just boiled it for a few minutes. I would not recommend unless bland is what you're going for. For dessert we got a chocolate mouse which was way too rich in my opinion. We could only have a few bites each before it got to be too much. Creme brulee left a bit to the imagination. The caramelization on top was mediocre and the creme was a very faint in taste. Plating of the dishes seemed very minimal, but I'm not sure if it was because of restaurant week or not. If not, there is improvement to be had.   I enjoyed the entrees and the appetizer so I struggled between a 3 and 4 but gave the higher score because of service. Even though it was busy we were well attended to.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WLd2rd42s8mX3BnsUB3qeA",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WLd2rd42s8mX3BnsUB3qeA/o.jpg"
      },
      {
        "img_id": "TODbmBo4v7mDCikvNpLVWg",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TODbmBo4v7mDCikvNpLVWg/o.jpg"
      },
      {
        "img_id": "9oE6VllR7dKpqmV-KZrehw",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9oE6VllR7dKpqmV-KZrehw/o.jpg"
      }
    ],
    "user_id": "1f6eEQiFfMt5HLQbS2wlJg"
  },
  "tz-pF_J3m4M67bpl4Dr8YQ": {
    "date": "9/16/2017",
    "text": "Pittsburgh foodies are SPOILED ROTTEN!!! This was the best Mortons I have ever been to in my life and its located in the heart of their downtown... South Florida (my home and the most conspicuously consumptive area in America) has a Mortons that these folks would turn their noses up at, as they booked the first flight home!!! The ambience here was chic and gorgeous while the service was heartfelt and top shelf... Our server, Jess, took her time with us and explained the menu like we were in kindergarten. She brought me the best five onion soup in the world and then blew me away with the spiciest cajun steak I've ever had the pleasure of eating. Dinner was so pleasant and wonderful that I had a food coma dream about buying property here and spending my days in the Carnegie museums and my nights at Mortons (I woke up screaming though, when I dreamt of wearing a Steelers jersey and rooting for the Pirates). The evening was complete when our busperson (who knew we were Hurricane Irma refugees) brought out a massive, piping hot loaf of onion bread for us to enjoy in the morning at our hotel room... Theres nothing like good ol' Pittsburgh hospitality (ITS NOT A CLICHE) and theres no better restaurant than Mortons!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "deJ81MFyetN9EXzBtiT4rg"
  },
  "tGBptOkiWbv5xifYe1sEig": {
    "date": "5/23/2016",
    "text": "Came here for my 20th birthday on a monday night with my 3 other family members. Were greeted with a super friendly host that quickly sat us. He then proceeded to print out a specialized menu reading \"happy 20th birthday!\" Which was an awesome touch. Then he came over, took a picture of us, printed it out and gave us a pamphlet with the picture reading \"happy birthday from your friends at mortons\". The food was honestly some of the best Ive had in my entire life. Filet mignon was done perfectly, the bacon mac n cheese was insanely good. They gave a free HUGE piece of chocolate cake. Out server was a woman named Leanne and she was AWESOME. Overall great experience, especially for a birthday.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cYf0dtUXaa2OKfIADIcezw"
  },
  "vHICdNNQLnTG3kSFGV5Rkw": {
    "date": "3/28/2016",
    "text": "Service can really make or break a restaurant.  I took my wife here for valentine's day this year. We were both pretty excited to eat here because a few friends had recommended this place. When we first walked in it was such a nice atmosphere. The hostess was great and we were seated right away in a nice booth in front of the kitchen. Here is where my problem starts and why I rated only 3 stars. We sat there without a menu for almost 40 min with all the waiters and waitresses going by our table looking at us and walking away. No one came to check on us and we had no clue who the server for our table was. I flagged down two people in those 40 min and they both apologized and said they'd get someone here right away but no one came. We were about to just get up and walk out when finally a nice waitress came to our table with menues. Clearly she had just been assigned our table and had 3 other tables. The restaurant wasn't even busy but the other 3 waiters and waitresses only had 1 table each. We felt bad for her so we stayed and ordered our food.   The food was excellent. No complaints and after the initial 40 min wait we were starving and we had to get to heinz hall for a concert. We were worried that we wouldn't finish our food in time because of the 40 min wait for the menu. But everything worked out in the end.   My wife and I love to eat at good resraurants. We don't get much time together because of our careers so once a month we make a date and go out. I had heard such good things about this place and they weren't wrong. The food was excellent. But the service that night really put us off.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZmV5u_3tTYuPyeM2ATisYg"
  },
  "QRq3QMmtGX4kCTPnC0oJ4g": {
    "date": "4/12/2016",
    "text": "My husband received a gift card a few months ago to Morton's, so we decided to save it and use it towards a special dinner to celebrate our 1 week anniversary.  We got dressed up, he in a suit, me in a black dress and arrived a few minutes before our reservation time.  Upon checking in at the host stand, we were told there were a few tables to seat before us and it would just be a few minutes.  We headed to the crowded bar and grabbed a drink and felt that we were in everyone's way.  As we waited for our table we noticed how casual most people were dressed and many people were in jeans, t-shirts, and fleece.  About 15 minutes later, the hostess said our table was ready and we were led to a back dining room that had 4 open tables (making us wonder why we had to wait 15 minutes when it didn't appear people had left the restaurant in the time since we arrived to reset tables).  We were sat in a room with a table that decided to bring 2 children probably around age 2 and 5.  The parents didn't see any issue as the children yelled and ran laps around the table and disrupted the rest of the room as they laughed. Our service was very good, but we've also experienced very good service at smaller, less expensive restaurants.  The food was good, but again not much better than other mid-priced locations that we frequent.  The grilled onion soup we ordered was just above warm, definitely not hot.  The grilled shrimp that came as part of my meal was tough, and my steak that I ordered as medium rare was closer to medium.  Overall, we were disappointed with the overall experience and basically felt like we were at Texas Roadhouse or Outback due to the clientele we were surrounding by.  We actually saw a man come in and head to the bar dressed in a sweat suit!  Next time we are looking to have a special night out, we will definitely choose another restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kojBB3efvaH92awEebAb4Q"
  },
  "Gw4AA0_3lV3fb0c7KEGrUQ": {
    "date": "5/16/2015",
    "text": "Had dinner tonight with a friend and I have had excellent meals here in the past.  Tonight was a good meal. I play the Landry game with promotion and points many generated from happy hours at Morton's and McCormick otherwise I am \"priced out\"  Six ounce filet with scallops and shrimp cooked perfectly.  Sixteen Oz NY Strip cooked perfectly..Lyonnaise potatoes excellent one problem...more onions than Potato... Sauteed spinach with button mushrooms excellent. Desserts excellent.   Service was very good with four different servers nearly no bumps in service.   I think Wine markup is now in the 3x to 3.5x category. Things have changed under Landry's although I am still happy with my visits.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dQE8Yy6EDujaMJQmke70Vw"
  },
  "_twoGimdWs1b4b16z9gJ2A": {
    "date": "11/7/2018",
    "text": "This Morton's is definitely not my favorite steakhouse in Pittsburgh, but it is good. My husband and I ordered crab cake (meaty), lobster bisque (also meaty), Caesar salad, scallops, filet mignons (my steak was cooked medium-rare rather than the medium that I had requested), broccoli, and raspberry souffle (mushier and foamier than what I have eaten in the past). My husband and I spent a total of $260, although we drank only ice water and ordered NO drinks. 3.5 stars overall",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FW5F5QzzMoeRdIib1OyNOw"
  },
  "X6b_v3rnRrQUudbyk_vt3w": {
    "date": "8/17/2018",
    "text": "The menu is not particularly helpful.  There are zero descriptions of any items, leaves you to quiz your server.  Discovered our Brussels sprouts come with bacon, who knew from the menu!  Vegetarians beware...  you won't leave here craving anything again or even desiring to return.  Everything is \"ok\" not bad, not good.  Definitely not worth the price.  You would be better off, basically anywhere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3nkiVjDmAU1kFy9KKQsRFA"
  },
  "g4bLFm8bwu44U_Ew7GhR6g": {
    "date": "9/26/2018",
    "text": "Great filet and crab cake appetizer.  Excellent service all around, as you would expect from this establishment.  Always a winner when I'm in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkvoF6wQFMCnoByu5J1KaA"
  },
  "dLMwWVlhvyDVKXNeIFJKdw": {
    "date": "6/29/2017",
    "text": "Ok it was a special event ... this restaurant is above my pay grade ($300 for 3 people).  We started with chopped regular & spinach salad and lobster bisque.  All were good.  For dinner, we had 2 filets and the crab cakes.  My guests enjoyed their filets.  My crab cakes had very little filler ... and were very small.  We ordered the horseradish mashed potatoes (OMG GOOD) and spinach with mushrooms.  For dessert we had the double chocolate mousse and a spiked coffee.  Valet service ($9 available after 6) was prompt.  The hostess, waitress, and water boy were pleasant and knowledgeable.  It was a nice experience but the cost deters frequency.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rxw9BOhbTzVUP5rvd5Acdw"
  },
  "FsvqQeBpLghqt6qlAD7Ccg": {
    "date": "3/5/2018",
    "text": "While everyone generally knows what Morton's Steakhouse is about, we tend to look for the unique aspects of the different locations we visit. Pittsburgh is one of the most unique Morton's you'll visit with a rich history of once being the only True steakhouse in the Steel City before the Capital Grill and other establishments came to town around 2000. As soon as you walk in you not only see but feel the Steelers, Pirates, Penguins and local celebrities that have been here before you. It's a great feeling that reaffirms you are in a special place.  Also notable is the level of service at this Morton's. It's world class. I haven't seen this level of service at any other Morton's I've been to. Staff treat you like a King and take care of every aspect of your experience. It's exceptional.  As for the food - it doesn't get better. Their meats are made to perfection and the quality of everything is above average. The New York Strip is always good, as is the rib eye. Ask for their special cuts of the night too. And do your best to leave room for dessert - the chocolate Molton lava cake is ridiculous.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6YmRpoIuiq8I19Q8dHKTHw"
  },
  "MwVppKkcYlKfolV4h_c_4g": {
    "date": "1/15/2018",
    "text": "I came here for Pittsburgh Restaurant week 2018. I never heard of this place until a friend suggested I try it out. I was looking for new and exciting places to try and this was a great opportunity too! Me and my boyfriend got a reservation and JR modem n with both feet.... First of all the service was phenomenal! Best I have experienced at top notch restaurants. Our server was so polite and on top of everything. Before we could ask for something he was on top of it.  We ordered 2 cocktails to start I had a traditional cosmo and he had the sangria which were delicious and had the right another by if alcohol in them. As for the meal, even though we had a limited menu everything we got was great! He got the French onion soup which looked amazing. I'm not a fan of French onion soup but there was a nice pile of ooooie goodie cheese on top which met me approval. He couldn't shovel it in fast enough lol. We both got the filet minon. I got a side of jumbo asparagus and he got the sour cream mash potatoes. The steak was perfect! It melted I. Your mouth like butter. It has to be in my top 3 of filet minon I have ever had. The asparagus was slightly to crunchy for my taste but delicious anyway. For desert we got the Creme brulee. Man was it so good. Perfect sugary crust with a silky textured custard and topped with 3 raspberries.  I would love to go back but it's a bit pricey for me to do all the time but if you want to try it Pittsburgh restaurant week was perfect time to try it. Plus everything I saw come out of that kitchen looked stunning",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9x3T5jquEjpjLQZYfh0ivg",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9x3T5jquEjpjLQZYfh0ivg/o.jpg"
      }
    ],
    "user_id": "-XgVXGJnOnW0kQEol6O3Pg"
  },
  "rhzgJkcDSs3Y_XyZUsaFSg": {
    "date": "6/17/2018",
    "text": "This was me And my husband first time at Morton's and the service is GREAT. I have been to all the steak houses and this is our favorite! We went to the happy hour. The stuff was soooooo nice the drinks was GREAT I had the Morton's martini and a Cosmopolitan. And my husband had the Golden Pineapple which was soooo yummy! For dinner he had the rack of Lamb and mashed potatoes which was GREAT! And I had Chicken Christopher wedge salad and cheese potatoes! Everything was more then excellent! This is our new favorite place. Thank you so much Morton's we will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "st6gXHlupu0QCvip1nHckA",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/st6gXHlupu0QCvip1nHckA/o.jpg"
      },
      {
        "img_id": "h5UtnX8L_xjy0h20_y4COg",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/h5UtnX8L_xjy0h20_y4COg/o.jpg"
      },
      {
        "img_id": "gd36oM05Qw8xhsBQgvVAKA",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gd36oM05Qw8xhsBQgvVAKA/o.jpg"
      }
    ],
    "user_id": "bybVngoLKvs1FvUfe6yzPA"
  },
  "C7iIZkzETOeN_BoQz2zvsg": {
    "date": "8/9/2015",
    "text": "I came to Morton's on a Saturday night because I had been craving Chocolate Lava Cake and Morton's was the only place in Pittsburgh that had it on the menu.  My boyfriend and I were seated immediately in the near-empty restaurant. He ordered the Cadillac Margarita ($15) which was VERY strong and I ordered the Summer Sangria ($15). I didn't like the Summer Sangria too much because it tasted like a glass of white wine with ice, a few raspberries and a strawberry. I couldn't even finish the half of a glass that they served me. I prefer my Sangrias with red wine and a more fruity taste.  We shared Morton's Chocolate Lava Cake ($15). The cake came out less than warm but nevertheless the chocolate lava spilled out of the cake with the first spoonful. It was pretty good but not the best. $50 for 2 drinks and a dessert was expensive for a late night treat but typical price range for Morton's. If you're only looking for a late night treat, I would suggest exploring other dining options in the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wMagyptedA2eCTUT_5HdHw",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wMagyptedA2eCTUT_5HdHw/o.jpg"
      },
      {
        "img_id": "EgkRLSjNTv3bESTf7dk1dQ",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Chocolate Lava Cake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EgkRLSjNTv3bESTf7dk1dQ/o.jpg"
      }
    ],
    "user_id": "2zuGG5zgN1jHmUBm5OdpMQ"
  },
  "dscwJ2HQAHeFxNnB3kFLMg": {
    "date": "4/15/2018",
    "text": "It's very expensive, and it's a showpiece. But it's good. You know? It's worth a few hundred bucks once every few years for us normies to feel special. Morton's does the job. Attentive servers, perfectly cooked food. High taste quality. What do you want? To feel fancy? Go to Morton's. You'll spend three hundred dollars for two people. And you'll feel fancy.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zfk7l2aOZKoAh05OoXRTwQ"
  },
  "1ggL6C3NN3TjWPma3CJUjQ": {
    "date": "6/18/2017",
    "text": "You may be looking at this review and say to yourself, \"3 stars isn't too bad, maybe I should give Morton's a nice Pittsburgh try\". I'm here to advise against that. The food is very good (although some decisions like the choice of oil or a sauce sometimes fell short). However, the prices and portions are where Morton's Steakhouse fall short. I got the sea bass for 50 bucks (go bucks!), but I would say not nearly enough was given. There are plenty of very good seafood places that could get the job done with flying colors for under 30-40 bucks (go bucks!). My intention with this review is not to be a leaf blower in a crack house, but I am just voicing my opinion that the price (insultingly high), portion (extremely small), and the quality (very good) just added up to two starts. If my opinion is not enough, we were one of 4 parties in Morton's on a Saturday night. - J",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "GHdlWej06lv0GNyQiYP9Gw"
  },
  "8jQK-uM0m5RcnPV-Cv4ftg": {
    "date": "8/20/2018",
    "text": "My review is a one star because the lobster bisque didn't exactly taste right like as if there was something wrong with it .The bread included before u wait a good amount of time for your food ;is nasty from being stale and cold .Im sure other meals probably taste better but the seasoning within the food is salty and doesn't really taste right.Altough I do like how the waiter cleans the crumbs off the table to make the table clean as we go along and ,the place isn't too packed.I don't know if this only happend to my group of people but the water taste disgusting like as if it came from the sewer.I will not be returning to this restaurant again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pCxt_byZcffiQcJlRYntzQ"
  },
  "ZUMrWLVT4Zs3wsVis9kUpw": {
    "date": "7/26/2017",
    "text": "Update: they did message to say sorry so I add another star back and also I feel like their steak was good just the dessert was kinda... As a steakhouse, I think they deserve 4stars:)   The bread was huge but the quality was just just just okay and so as the butter. Not much surprised. The red wine I order was Seven Falls, Cabernet Sauvignon, Wahluke Slope, 2013. It was good as expected. The porterhouse was exactly what I expected and it was good with juicy and tender inside with crispy surface. Thumb up . For the temperature was just right which is rare for the porterhouse since it has a bone in the middle where it usually tends to be a bit easier to overlook. However, the plate for the steak was not hot enough. Just a bit warm. The side I got was the lobster macaroni and it was fascinating. The service and ambience was good as well. I also ordered a dessert which was a piece of cheesecake with different kinds of berries. The berries were good and fresh. However, the cake itself was really okay.  One last thing, they didn't clean up the table for me to have the cheesecake after I ordered the dessert which was kinda awkward for this kinda of steakhouse.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "rheY6CUIm3FYHMxPEHr9Rg",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rheY6CUIm3FYHMxPEHr9Rg/o.jpg"
      },
      {
        "img_id": "owQlXY5HWWxjgaN7Vb3s_w",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/owQlXY5HWWxjgaN7Vb3s_w/o.jpg"
      },
      {
        "img_id": "Ddhsz56zB49YyQn-XxYRfQ",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ddhsz56zB49YyQn-XxYRfQ/o.jpg"
      }
    ],
    "user_id": "QaCCbhaxr7XXvqiMcewsLg"
  },
  "d_mNRZolScRdAmdiLZfzBQ": {
    "date": "5/2/2018",
    "text": "We were celebrating 2 birthdays and this was the perfect place. Our server was Diane who was great. In fact, everyone on the staff could not be more attentive or considerate. The food was delicious. We both had melt in your mouths filets, prosciutto wrapped fresh mozzarella, Caesar salad sans the anchovies, horseradish whipped potatoes and cream corn. All were excellent. For dessert the hot chocolate cake was great as was the bread pudding. Bar service was great and their selection and assortment is wonderful. If you have an occasion to celebrate or simply want a fine meal and don't mind spending some $$$. You will not be disappointed with Morton's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lf41cPdVX6XK6SuNYYbwKg"
  },
  "0-odoxUHiFAXbntxbnUrUA": {
    "date": "6/17/2017",
    "text": "Was looking for restaurant for my birthday and mortons was a great choice highly recommended for special occasions. Good Service waiter was very attentive even though it was busy. Seafood was off the chain macaroni and lobster can't say enough.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "K9TjFDiB-M5h3XK5d3BSSQ",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Mix grilled #2 Delicious",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/K9TjFDiB-M5h3XK5d3BSSQ/o.jpg"
      }
    ],
    "user_id": "R9WOAdrLB2N6TggC9w9Dmw"
  },
  "tK9US-fjk96dbxGtNRqA5A": {
    "date": "8/24/2018",
    "text": "Went there tonight and it was probably the worst steak I've had in a long time! Service was good right up until I said something about it, they took some of the steak off the bill but I could over here the staff snickering and complaining about it very unprofessional! If you're looking for a good steak in Pittsburgh go to red! Never disappoint",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZyEL95cqwqjnaKbTmpjLbA"
  },
  "fF11HvIxA7PqeU5Cwp0k7w": {
    "date": "1/22/2016",
    "text": "It was great that Morton's did Restaurant Week, which gave us reason to give the fancy steakhouse chain a try. The ambiance and service are what you'd expect from a place like this--very professional and polite from entering to exiting with valet and coat check options, somewhat dimly lit interior with perfectly set up tables and comfy chairs, and a nice view of the grilling area at the back (but very subtle, you can ignore that if you want to). The service could've been faster overall but I suppose this is how it's normally like.  In terms of food, I'd say everything was pretty great save for the appetizers. The wedge salad was just okay and the ahi tuna was tasty, but the latter was falling over as the waitress placed it on our table (so no presentation points there) and it came with a weird choice of fried wontons that didn't really seem to go well with it all. The complimentary bread was probably better than both apps--it was nice and warm and fluffy on the inside. The filet mignon was what it was of course, a juicy, tender piece of steak cooked as we ordered it. Perhaps it could've been a bit less salty but it was otherwise what we expected. Finally, we enjoyed both dessert courses, a creamy chocolate mousse (there was a lot in that apparently small glass) and a savory creme brulee.   Overall it was a good experience. Probably not in our budget normally, but a steal at Restaurant Week prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YKgOv2eKmjdpvslcc4FROw",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Restaurant Week: Creme brulee",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YKgOv2eKmjdpvslcc4FROw/o.jpg"
      },
      {
        "img_id": "iaSJpx4zeTkwygnv2vH_Zg",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Restaurant Week: Ahi tuna tower",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iaSJpx4zeTkwygnv2vH_Zg/o.jpg"
      },
      {
        "img_id": "KhzLDQMirzcZAvXRIIYP_Q",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Restaurant Week: 6 oz filet mignon with creamed corn",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KhzLDQMirzcZAvXRIIYP_Q/o.jpg"
      }
    ],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "YQpBp0FTONrGgOgZ2HXIAg": {
    "date": "11/6/2017",
    "text": "I went there for my wedding anniversary.  The food was good the drinks were good My server was pleasant and knowledgeable  Of the menus. My only complaint is that there were some females who obviously had to much wine being loud and obnoxious. They should have been cut off or at least asked to leave.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K5iW9kMfQU2YP3i0ukQbkg"
  },
  "rc0_GYq4ir4Rug4T12BEKA": {
    "date": "2/15/2013",
    "text": "Great place for date night or any other special occasion.  Morton's without a doubt is my favorite upscale Pittsburgh steakhouse. The service is impeccable and the food is second to none.  During this visit I took my wife for a romantic dinner for Valentine's Day. We were early for our reservation so we headed to the bar for some \"Bar Bites until it was time to be seated at our booth. Once seated Ed was our server and he was great! He brought over the \"meat cart\" with all of the different cuts of steak that they offered and went over each steak. The cart also has all of the vegetables they offer as well.  We both started off with a few cocktails. I had the French Raspberry Mortini and she had the Chocolatini Mortini. By this time the huge loaf of onion bread was brought and placed on our table. Next we both had salads. I had the Caesar and she had the Wedge. For our steaks we both had the single cut fillet cooked Cajun Style which were seasoned and cooked to perfection. Absolutely the best, most tender steak I have ever eaten in my life. It was like steak flavored butter. It melted in your mouth. I added a utterly amazing crab cake to mine and she added colossal shrimp to hers. To accompany our entrees I added garlic mashed potatoes to mine and the wife added green beans to hers.  For dessert we shared the world famous Morton's Lava Chocolate cake with ice cream. What a way to end one of the best meals we have ever had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "BjtJ3VkMOxV2Lan037AFuw"
  },
  "SP8EOJemfvw5ANHEVzKkEA": {
    "date": "1/8/2017",
    "text": "The food was really good, loved the dim lighting and overall atmosphere. Our waiter was very knowledgeable and on point with service. I would definitely go back for another meal",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dFc8j6SntzAwktw5Xuyurw",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Mixed grill -6oz steak, shrimp and scallops!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dFc8j6SntzAwktw5Xuyurw/o.jpg"
      }
    ],
    "user_id": "3Woe_ZbjFH2VLck8WWsX-A"
  },
  "D2rJhGUmX_LxUl-m2jQ-Ag": {
    "date": "11/24/2014",
    "text": "It's been awhile since I've dined here.  I took my ex boyfriend to Morton's for his 30th birthday, and then we went to Cheerleaders.  This is what happens when you tell your boyfriend you will go WHEREVER HE WANTS for his 30th birthday, and follow it up with, \"SERIOUSLY, WHEREVER YOU WANT.\"  : |  Mortons was by far my favorite, and LEAST EXPENSIVE part of the evening.  Seriously.  So the steak was painfully good.  Like, really good.  We had the filet.  However, what blew my mind was the potatoes.  And the steamed broccoli.  Oh it was soo good.  When we got home that evening, I was like, \"Joe, those potatoes were awesome!\" and he was like, \"What potatoes?\"  : |  The service was excellent.  I keep meaning to come back here, but I never do.  I think next time I come back I'll make sure I'm not the one paying though, it's $$$ but who goes out for discount steaks?",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PD3X7S70zXHeOx1NjeicjQ"
  },
  "Su1UcLesuMmBirKgfvzReQ": {
    "date": "8/18/2019",
    "text": "This reviews is for restaurant week. Highly recommend coming here for their $35 special dinner menu which Includes an appetizer, entree with side dish and dessert.   For the appetizer, I chose the French onion soup   For the main course, I chose the 6oz filet with the potatoes au gratin. I ordered the filet medium rare plus and Morton's got it just right. The steak was red on the inside and had great flavor.   For dessert, decided to upgrade for $6 to the lava cake. 10/10 would recommend this dessert. The chocolate is flowing on the inside and the vanilla ice cream scoops adds for the perfect addition to the chocolate cake.   In addition we ordered a bottle of wine. Service was fantastic. Will definitely come again for restaurant week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AFVNch4LUmmeIlRlmD10bw",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. French onion soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AFVNch4LUmmeIlRlmD10bw/o.jpg"
      },
      {
        "img_id": "LJtY2f8bOetqXGISSFBR8A",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LJtY2f8bOetqXGISSFBR8A/o.jpg"
      },
      {
        "img_id": "e2JnG5_KME1ee0L3zzgctw",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. 6oz steak with potatoes au gratin",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e2JnG5_KME1ee0L3zzgctw/o.jpg"
      }
    ],
    "user_id": "-OeTHjCovP6ZfHcQ3Axpxw"
  },
  "NteU9gVB5t_tdOmSFJhYdA": {
    "date": "5/6/2019",
    "text": "LOCATION:  Located in downtown Pittsburgh in the heart of the Cultural District, Morton's is an easy walk from anywhere downtown.  I was visiting for a few days to participate in the Pittsburgh Marathon festivities.  I'm an avid runner and normally carb load the night before a big race.  However, I already ate a LOT of pasta earlier in the day.  At a friend's suggestion, I decided to visit Morton's.  I don't normally visit chain restaurants when I travel, but I am SOOOOO glad I did this time!  Lisa is the manager at this location.  She is simply the BEST!  She was super kind and took great care of me.  She made a point to wish me well on my run and is such a genuine soul.  I'll visit again just to see her!    ATMOSPHERE AND DESCRIPTION OF RESTAURANT:  It was a Saturday evening (7pm), and I had made a reservation (on OpenTable) the night before with no issues.  As always, Morton's is a classy, clean, quiet place.  I arrived early and enjoyed my favorite Negroni at the bar before I was escorted to my table.  I loved chatting with Jeff at the bar.  What a nice guy!  He's a former runner, and we shared a couple of stories.  Since I was dining alone, I was given a nice two-person table where I could enjoy people-watching while eating dinner.  For a Saturday night, it wasn't too slow...and wasn't too busy.  It was perfect for me.  The room was dimly-lit and great for a nice splurge dinner before a big race.    SERVICE:  I was ecstatic with the service!!  In addition to Lisa's great attention, AJ was assigned as my waitress.  Come to find out, she went to college in my neck of the woods.  We had a great chat.  I shared some major changes to downtown San Diego since she last lived there.  She gave me a couple of pointers for other places to visit in downtown Pittsburgh.  AJ was on top of everything!  I asked for a Negroni when I was seated, and it came in just a couple of minutes...just in time for me to place my food order.  Nick took care of me as well - it was great chatting with him.  He's a good guy with whom I also enjoyed chatting!  Needless to say, the staff was very efficient and courteous.  They all made this out-of-towner feel like a VIP.  The staff truly made me feel at home in Pittsburgh.  I wish I could have just sat and chatted with them all night.    FOOD:  I ordered the 12oz. Filet Mignon, Creamed Sweet Corn, and Horseradish Mashed Potatoes.  The steak was cooked to PERFECTION!  I normally order horseradish as a side with my steak, however, the mashed potatoes had so much horseradish that I simply dipped the steak into the potatoes!  HEAVEN!  The creamed sweet corn made me feel less guilty by having a veggie.  All in all, the corn and mashed potatoes are substantially large portions.  They would be more appropriate as shared items.  I did my best to eat everything but was quite full before I could do so.  The food helped me sleep well that night!     CONCLUSION:  I strongly recommend Morton's in downtown Pittsburgh, as it is truly a perfect way to meet some down to earth Pittsburgh folks!  The food was amazing.  However, the staff is why I will be coming back.  I feel like I made a couple of great friends and hope to see them all again soonest!  By the way, I ran one of my best half marathons ever.  Thanks for the well wishes, Morton's!  Love to all of you!  Look me up when you visit San Diego!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vZQ_1SdzRfg5P7Nq9muWlg",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vZQ_1SdzRfg5P7Nq9muWlg/o.jpg"
      }
    ],
    "user_id": "wFnAWTWwuWKb9NmIOdcGWg"
  },
  "7A4v4ELoe2-vd37OOgEewg": {
    "date": "3/21/2019",
    "text": "I have been wanting to go to Morton's for a really long time and was so glad when I finally ally got a chance to go. 4 of us dinner at Morton's ok Valentine's Day for an early dinner, right before seeing a show downtown and it was nothing short of excellent. This is a Landry's restaurant, and Landry's never disappoints.  Morton's menu is on the more expensive side, however, you are getting the highest quality steaks, seafood and ingredients unlike a Texas Roadhouse type steak house. Morton's is True fine dinning. In my opinion, it is definitely worth the price, especially for a special occasion or well deserved knight out.  Our service was awesome. Someone was constantly checking in on us, providing refills, ask were sure to get us out of there on time to make it to the show. The restrooms were top notch as well. Very clean and had the \"nice\" thick paper towels - you know what I mean!  For our meals, 2 people in our party had filets and said they were excellent. As for myself and another, we had the miso seabass and it was delicious, literally melted in our mouths. As for sides, we got asparagus & Brussel sprouts. For starters, we had soup, Morton's salad and wedge salads. The wedge salad was HUGE & plenty to share between 2 people. I wish we would have had room for dessert, but we were too full.  For anyone looking for an excellent meal, great service and a few drinks, head to Morton's! You won't leave unsatisfied.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W0xwzUQUVA-JV04yNrfoSA",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Filet",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W0xwzUQUVA-JV04yNrfoSA/o.jpg"
      },
      {
        "img_id": "sqDCDShSATfKvIiPmjd2Zg",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Miso seabass",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sqDCDShSATfKvIiPmjd2Zg/o.jpg"
      },
      {
        "img_id": "5N5Q7SOzD9BpHnXcUgOotw",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5N5Q7SOzD9BpHnXcUgOotw/o.jpg"
      }
    ],
    "user_id": "chbCROaKWm2pj5uUT-ruGw"
  },
  "Xhx8FDraiZd-9rfw4Zqfsg": {
    "date": "11/8/2018",
    "text": "Steak house restaurants are always my first choice. Made a reservation in yelp app got right in at the time I requested. Nice table location very nice server. There were several large parties in the restaurant that we could see. We assume that was the reason for the slow service.   There were times when we we were out of drinks and water and could not find a server. We finally ordered a bottle of wine so we could serve ourselves. We ordered several appetizers including the tuna tower and the escargot. The appetizers were very good.   For dinner we ordered the bone in ribeye and the bone in strip steak. All steaks were cooked perfect. The sides that were recommended, mushroom special and truffle frites I would pass on next time. The mushrooms room were over cooked and tough the string fries were not flavorful for truffle fries. Sorry I expected better service when your spending $60 dollars for a steak.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dV6Pjdlgp5EJA0WABQnssA",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dV6Pjdlgp5EJA0WABQnssA/o.jpg"
      },
      {
        "img_id": "DIv0jy9Lg7K0lFV1dPxn-A",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DIv0jy9Lg7K0lFV1dPxn-A/o.jpg"
      },
      {
        "img_id": "lCTE5KFvr6u6f3sGh-8TAA",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lCTE5KFvr6u6f3sGh-8TAA/o.jpg"
      }
    ],
    "user_id": "Sru74jmh8G7Ny70RVUnU1Q"
  },
  "RO-4z1l2gaKAPoMGsJZhtA": {
    "date": "11/5/2018",
    "text": "Great steaks. Okay Sides. VERY expensive.   My wife and I wanted to treat ourselves to a nicer dinner before a concert, so decided to splurge on Morton's. We both like steak and Morton's proximity to Heinz Hall sealed the deal.   Our server started us with a massive loaf of bread and whipped butter. Both were quite good - the bread has a bit of sweetness with goes well with the crispy baked onions on topped. Combine this warm delicious bread with the whipped butter and you have a great starter.   I ordered the chopped salad, while my wife ordered the onion soup. She definitely made the better choice. My salad was fine, though I was irritated by the bleu cheese throughout (the menu doesn't really give descriptions of ingredients, but I had told our server that I didn't want bleu cheese on my steak because I don't like it, so I would have hoped she would have said something).   My wife ordered a special: 8 oz filet with lobster and a bernaise sauce. I went with a Surf and Turf: 6 oz filet with 3 grilled shrimp and 2 bacon wrapped scallops. I truly enjoyed my entree - the steak was perfectly cooked and both the shrimp and scallops were wonderful. This all came with a few spears of asparagus. It was quite a filling entree.   We also ordered two sides: creamed spinach and mashed potatoes. I was not impressed with either. The mashed potatoes felt very plain, while the creamed spinach didn't seem particularly creamy (the spinach felt almost undercooked).  Our total bill was quite expensive, but it didn't feel like it merited that price. We've had excellent steaks (and far better sides and salads) at other restaurants in the area, so this didn't feel worth the price.   Additionally, while we were eating our appetizers our server gave us a rather long sales pitch on the Landry's card (pay to become a member and get money back at Landry restaurants). The speech was ill-timed and felt out of place at a place like Morton's. My wife said it best: \"I'd expect a loyalty club card pitch at a Red Robin's, but not at a Morton's.\" I don't blame our waitress (as I'm sure this is a canned spiel that everyone has to give), but the whole thing felt cheap and was irritating in the middle of my meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vg0xfP02tul2MMl6q4Rj0w"
  },
  "X5ZO-b_vc9pYRU2yfEm7bg": {
    "date": "1/17/2019",
    "text": "I have to start off by thanking Morton's for participating in the 2019 Winter Pittsburgh Restaurant Week. Had it not been for their features, I probably wouldn't think to stop in for dinner. Morton's reputation precedes them and for good reason: they focus on the quality of their service and the quality of their meats. I know a lot of places with \"steakhouse\" in their name but they lack in the areas of making great steak.  Morton's did not disappoint one bit and for a place of their caliber, often it's easy to overrate the experience. Most people think that they need to break the bank to eat at a delicious steakhouse but that isn't the case when you eat at Morton's for happy hour. With extensive selections, no matter your diet, preference or budget, there's something for everyone. I chose the Prime Cheeseburgers and Truffled Shoestring Fries from the happy hour menu, while my date opted for the Prime Filet Mignon restaurant week special, including Lobster Bisque, Cheddar Au Gratin Potatoes and Chocolate Lava Cake a la mode. Everything was amazing! I couldn't have asked for more.  I absolutely loved dining here and I especially appreciated the wife range of choices to decide from. The next time I'm in the mood for a rich, juicy, prime cut off steak, I will be sure to go to Morton's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c5c7pb6kn9Lp46b7xWbFzw",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/c5c7pb6kn9Lp46b7xWbFzw/o.jpg"
      },
      {
        "img_id": "fZUpu_Cp1MPzkvWcO7_zyA",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fZUpu_Cp1MPzkvWcO7_zyA/o.jpg"
      },
      {
        "img_id": "Hdc-Ka2ImPIuDFjvd5NY0w",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Hdc-Ka2ImPIuDFjvd5NY0w/o.jpg"
      }
    ],
    "user_id": "zg6LAy9gGLVH9JtcYP9gJg"
  },
  "L8Spt0coJCCc-NyrnxKq7A": {
    "date": "5/4/2019",
    "text": "Food was delicious, very filling. Cooked a little too \"interesting\" for me but overall it was good. Our server was on top of things and super nice. We went with food he recommended and it was worth listening to him. $160 for this dinner seemed a little over the top price wise. Probably wouldn't go out of my way to go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8L0kxwUzdAzMVDf-PSUuzw",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Morton&amp;#39;s Legendary Hot Chocolate Cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8L0kxwUzdAzMVDf-PSUuzw/o.jpg"
      },
      {
        "img_id": "fr1pJn6OiftXjD63ClmxIw",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Bacon wrapped scallops, 6oz Fillet mignon, and grilled shrimp on the left. Brussels Sprouts in the middle, and Cajun Ribeye on the right.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fr1pJn6OiftXjD63ClmxIw/o.jpg"
      }
    ],
    "user_id": "2P-9NHIYv37OA_hlGrLDjg"
  },
  "vfYJ_H1lu9tazgBByO5LQw": {
    "date": "8/17/2019",
    "text": "Went for restaurant week. My wife had the restaurant week pork chop which is huge. I had the lobster dinner which was excellent. Elizabeth our server was great and paced our dinner as we wanted.Excellent service and food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rk9yeFK8QwZd1lHefWTyQg"
  },
  "pFW4GEQlEdj5DeIbIFeJSA": {
    "date": "9/10/2018",
    "text": "I'm on a mission to try all the fancy steakhouses in Pittsburgh and this was where my husband and I went first. His reasoning for trying Morton's first was, \"that's where all the fancy cars go,\" as we always see the expensive cars parked outside. And from what I hear, it is likely to see local celebs dining here.   If you want a steak done right, specifically filet, Morton's does it pretty well. Perfectly seasoned and well-prepared. Nothing is overly seasoned like you'll find at other places. Morton's food was pretty simple, no frills, but delicious nonetheless. Overall, the food was fantastic as far as steakhouses go. And honestly? We've been craving Morton's steak ever since we left.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "bCwI8qAyr6Hi3puss4ryFw": {
    "date": "8/8/2018",
    "text": "Went here on a Saturday night for a nice date night and really wanted to be able to write a better review. I love any excuse to dress up and eat a fancy meal. Unfortunately, we were let down more than once.  I ordered a petite filet medium rare and my boyfriend ordered the full 10 oz cooked medium well. My steak came out fine. However, my boyfriend's steak was not even what I would consider rare. He is not one to send back food, but it didn't feel safe to eat. When he showed the server, she even made a face and went \"ooooohhhh\" and rushed it back. It took quite a while for the steak to come back (which wasn't surprising considering how raw it was) and I was finishing mine by the time he received his corrected steak.  What struck me as odd for such a high end restaurant was the way the waitress cleared the crumbs from our table. It seems like an odd thing to notice, but our waitress came with a knife to sweep the crumbs off of our table between courses and instead of sweeping the crumbs into her hand or onto a plate, she dramatically flung them off of the table onto the floor. It was surprisingly off-putting and something I've never seen before.  Maybe we went on a bad night, but I don't see myself returning to Morton's anytime soon. I expected so much more. I will note however, that I am a big critic in search of the perfect french fry, and their fries are delicious, thin cut and perfectly crispy!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aHd4k8ky04G370YKKNwXwQ",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aHd4k8ky04G370YKKNwXwQ/o.jpg"
      }
    ],
    "user_id": "J3g4nJY1TQC82voY9Lv6UQ"
  },
  "JyRF7Q3c33gw4zDJWzVhMg": {
    "date": "3/5/2018",
    "text": "Our server was kind, and very attentive. The atmosphere is nice but not overly \"stuffy\"  I enjoyed the complementary bread, and large food portions.  The seafood that we enjoyed you could tell was very fresh and high quality.   Valet parking out front has a $9 convenience charge which is totally worth not searching for a parking spot downtown.  I would recommend this restaurant to anyone looking to celebrate a special occasion or just enjoy a night out in the city.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QT1nL_4Lxw2V1pXiooFGmw",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QT1nL_4Lxw2V1pXiooFGmw/o.jpg"
      },
      {
        "img_id": "f9D3PWYWy7HFnYcmyyLGwA",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f9D3PWYWy7HFnYcmyyLGwA/o.jpg"
      },
      {
        "img_id": "KPZ3gM6J2oDN7Bbsa15YeA",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KPZ3gM6J2oDN7Bbsa15YeA/o.jpg"
      }
    ],
    "user_id": "q7kb0GVCWOdORhOrRfkxbw"
  },
  "7ugfU_5us0vw3HhLcF2UFw": {
    "date": "3/3/2019",
    "text": "This review is for the winter 2019 restaurant week. I've only been to Morton's once and never had the steak. We figured for $35.19, what better time to try it. Normally, just the steak alone is around $40 so this really was a good deal. Seats fill fast so make a reservation online for restaurant week. I ordered the Caesar salad, 6 oz center cut filet, personal sized twice baked au gratin potatoes and legendary hot chocolate cake. We started the meal with a strong but pricy mixed drink. The happy hour prices aren't great but that's known for expensive restaurants. Next, they brought out a giant loaf of onion bread. It was warm, hard outside and flaky inside, and surprisingly light. My salad was extra crisp and liked the dressing. Finally, the main course. The steak was cooked to a medium perfection and melted in your mouth. The potatoes were very cheesy but could have used more seasoning and flavor. Lastly, the cake. By that point, we were already full! It was warm and chocolately. The vanilla ice cream was a yummy mix of flavors. Overall, the food was very good and would be willing to come back on a special occasion",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Oc3KuBCfZ2i685jroNkyag",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Legendary hot chocolate cake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Oc3KuBCfZ2i685jroNkyag/o.jpg"
      },
      {
        "img_id": "Fy8-343MPw9F-2ANtVxiQQ",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Complimentary onion bread",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Fy8-343MPw9F-2ANtVxiQQ/o.jpg"
      },
      {
        "img_id": "c2v3ZlxhycHIEmtuaqODtQ",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Center cut filet with twiced baked au gratin potatoes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c2v3ZlxhycHIEmtuaqODtQ/o.jpg"
      }
    ],
    "user_id": "pLy8-MTpmY-xIKrfdSv1CA"
  },
  "NxLMcaeqFiPRvOOQjW0C9Q": {
    "date": "11/20/2018",
    "text": "I came here with a group of friends back in September while visiting Pittsburgh for the Georgia Tech vs Pitt football game. The friends who live in Pittsburgh apparently are regulars here and the service was absolutely five star. They knew the staff and the staff personalized the service for us. We all had a phenomenal time and thoroughly enjoyed our dinner. We were the last patrons to leave the restaurant that evening but the staff never made us feel like we were inconveniencing them by staying so late. I would definitely come back again next time I'm in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "C4ph6HVa1Mx3Zf3I8qp6SA"
  },
  "TLaeobkYuGcxp3XROS_60Q": {
    "date": "11/7/2018",
    "text": "This is probably my favorite steakhouse in our city. It's so expensive but so worth it. Both times we've been here I've been so impressed by the service and the quality of the food. Plus last time we were here (Valentine's Day 2018) I got chocolate mousse that was just so freaking good. I'd recommend this place if you want an upscale romantic date. It's candle lit, the atmosphere is good, and the drinks are yummy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LC1N1SFW-MaLWiq6Du1oCQ"
  },
  "rcKy6AroTBlEfg5sEmciEQ": {
    "date": "2/11/2018",
    "text": "My boyfriend and I randomly stopped in and sat at the bar to get dinner. The service was good, the bartender offered good suggestions. I ordered the center cut iceberg to start and the bartender suggest we share it and I'm glad we did, it was huge and so delicious! They were out of the twice baked au gratin potatoes so he suggested the mashed cauliflower which was also delicious and a healthier choice so we were happy with that. All in all the food was great and so was the bar service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "P_9pp-EijzLxbjKqPfDUjg",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Center-Cut Filet Mignon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P_9pp-EijzLxbjKqPfDUjg/o.jpg"
      },
      {
        "img_id": "YV6z4ga8bXpTmZkNOwTZBw",
        "caption": "Photo of Morton's The Steakhouse - Pittsburgh, PA, United States. Miso marinated sea bass and mashed cauliflower",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YV6z4ga8bXpTmZkNOwTZBw/o.jpg"
      }
    ],
    "user_id": "mu-GFiSWKmtqj2CduZP5wg"
  },
  "tMJ51hTsHsgp1eaGOpXoSw": {
    "date": "1/24/2019",
    "text": "I go here all of the time and sit at the bar.  The food is solid, not always consistent, but the service is great.  My only major complaint is that I overheard the bar staff bragging about how they water down all of the liquor, especially in their martini's and mixed drinks.  Not only is that a terrible, dishonest practice, but that fact that they were dumb enough to be speaking about it loudly in front of patrons- horrible.    I will still go here, but DEFINITELY won't be ordering mixed drinks or liquor here.  Beware ordering any liquor here!  The restaurant is already a bit overpriced as it is.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LaJO_x0v_pp6TE6FoULHXA"
  },
  "urFnlQLWQGTEggbusW77pA": {
    "date": "9/15/2018",
    "text": "Absolutely fantastic food and service!! Our server, Kimmy, made amazing recommendations.  Sea Bass was awesome   Seasonal apps great     Making reservations for holiday soon",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Oyp_r6ll7sTeWBPyWs9OWg"
  },
  "MQ9ZXk37T-E1KVnBkJKmWQ": {
    "date": "10/28/2018",
    "text": "Really wasn't what I expected. I wanted to take the wife out to a nice dinner we usually do outback or longhorn for steak dinner, but we figured what the he'll I we hear Morton's is good, but not  worth $300.00 I'm my opinion.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nz5y5Zg9iyzvWsOX7JayoQ"
  },
  "o1vAkpud4Njp9Pjg8dNGtQ": {
    "date": "5/6/2019",
    "text": "As a very recent Pittsburgh resident and professional student, I thought I would be out of place at Morton's. However I was pleasantly surprised by the warmth and kindness shown to me at the restaurant by all the employees. The food is amazing. I had the NY Strip with Au Gratin potatoes and Creamed Spinach--to die for! Their cocktails also pack a punch which was a bonus for me getting out of a major exam today and looking for a great way to unwind. This Morton's will be my go to place for dinner for years to come!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sVNEYk1d1bvEFlDt34sfFA"
  },
  "1Z0ua3LvkBoj1uacy9rBdQ": {
    "date": "3/17/2019",
    "text": "I have been eating at Morton's all over the country for years. I was in Pittsburgh for business and decided to meet a local friend there for dinner this past Friday. We sat at the bar and it was terrible. The food was solid per the usual at Morton's but the bartenders were so inattentive and just not nice. We ordered a lot of food, and they acted like we were not even there. We had to keep asking for another glass of wine, to put our orders in, etc...it was like we were bothering them to ask for our dinner entrees. And, the bar was not that crowded. I would have understood if it was packed, that was not the case. I did let the manager know and he was very nice. That being said, would never eat at this location again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tkd0zyvvU2_cN2SiGdNjOQ"
  },
  "tJYqAjiOvAIFf0Je0O9-qg": {
    "date": "4/20/2012",
    "text": "This is easily my favorite restaurant in Pittsburgh. The steaks, the sides, the service, and the atmosphere all add up to a great experience. I can understand the high prices being a turn-off to many people that say a good steak can be found at much cheaper prices, but for me, this place is just a great experience in general. I find that it's worth the occasional splurge, and I would go just for the potato pancake alone",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I8NoqjrGQ50RfHW_znoIwQ"
  },
  "nRgeAzjPE603DdDdsHsDLg": {
    "date": "5/21/2012",
    "text": "Morton's. Enough said. Not my most favorite location but you can't go wrong here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Beh-ktLzU_Yi4URaMeXsQ"
  },
  "LKxVTMXKlpJTtIU5eoLqeA": {
    "date": "8/4/2014",
    "text": "We went there the other night for a fiends birthday and everything about the visit was superb! As soon as we walked in we were greeted with a warm welcome. I ordered the New York Strip, Oscar style and it was delicious. The lobsters bisque was also very delicious. All in all this is the restaurant you want to go to if you want high-quality, delicious steaks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WC_6rygJzv6gG-Q76fvHCQ"
  },
  "RJQ7gjK7UcQN8PfXuBEjdg": {
    "date": "11/12/2011",
    "text": "THIS IS THE BEST STEAKS ANYWHERE!!! Great staff as well. It is a go to place for us when we are in the mood for steaks!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ajvbqTp1QbKo4pqZmVanYg"
  },
  "V1IHHO9hexiZblvp8dPPIw": {
    "date": "5/20/2014",
    "text": "We made a reservation and were told that seating was on time, we waited 15 minutes past our reservation time to be seated. The food was awful, my pregnant fiance ordered a filet medium rare that came out medium well!  Who cooks a filet medium well?  My father-in-laws strip was so over seasoned he could barely eat it.  But since we waited over an hour for our food, he had to eat it.  Our reservation was for 8:15 and we did not eat until after 10:00.  We all ordered medium rare steaks and one lobster tail.  It should not take over an hour to prepare.  The filet was taken off the bill, however, that does not help the fact that a pregnant women had to wait so long to eat and when it came out she didn't even eat.  I shared mine with her as did her dad share his, but as mentioned above, his steak was awful too.  My Cajun ribeye was good and so was my mother-in-laws lobster.  We ordered chocolate souffle for dessert and it didn't even have chocolate on it.  It tasted like scrambled eggs with whipped cream.  I have to tell you that was by far one of the worst dining experiences we have had.  The four of us eat out together once a week and tend to go to more \"pricey\" restaurants.  This was terrible and I am sure we do not plan on returning.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1V8zTIGN_ioRgbRZ40IsoA"
  },
  "nkj45Ym-IwK-Ud4w_MUywg": {
    "date": "7/2/2014",
    "text": "We find ourselves at Morton's about 4 times a year.  The food is rarely a let down.  The steaks have been perfect, the potatoes delicious, and the desserts to die for.  However, the service, or rather the servers, leave a lot to be desired.  To put it bluntly, we have consistently better servers at Applebee's and Outback.  The men who have waited on us at the Pittsburgh Morton's act as if they hate being there.  We often feel like we're prodding them for information because they do not speak to us unless they absolutely have to.  Our most recent visit was three nights ago and we had the worst service to date.  The server was lazy, far too laid back, and truly should not have been working in such an expensive establishment.  We asked him questions about the special (he denied there being one and there was), about a chicken dish (his response to how the Chicken Christopher was prepared - \"It's, like, well, ya know, just regular fried chicken\"....he could not have made it sound less appealing and it's most definitely nothing like regular fried chicken), about the way a dessert is served (he told me the fruit crisp was absolutely berries, but once ordered what was served was apples), and he was obviously put out by such questions.  The price of the meals and the service are absolutely not in line at this location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UMrt8aUYRexoL3V4X4LbsQ"
  },
  "duv6wiNNnED0F3lpytyJjg": {
    "date": "1/14/2013",
    "text": "Like most Morton's, nice environment and good food. And as expected, it can be a bit pricey depending on order. Strongly recommend their desserts! Not a big steak fan myself, but I did like their filet mignon. The service was ok, but was certainly not among the best in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AyhF9VDkrReBv_cO-oI-JA"
  },
  "o3byAxSb_ekMAhr3eA-cSw": {
    "date": "10/10/2010",
    "text": "The food is awesome. Nice atmosphere. Come in on happy-hour that you can get oysters for $2 and colossal shrimps for $2.25 at the bar. They are a must-try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fj7dJGR_BUar23TUBGmW7Q"
  },
  "7_JTkYtbx7tvbfqN8dVCpQ": {
    "date": "6/18/2013",
    "text": "We've eaten a number of superb meals at the Morton's in Cincinnati, and were eagerly looking forward to a sumptious dinner at Morton's in Pittsburgh. Oh boy. The ambiance is more like a Wendy's that tries to be upscale: cramped, busy, somewhat noisy. Of the two filet mignons we had (different sizes, medium rare) one was horribly overcooked, the other one a little on the rare side. The meat wasn't special. The deserts were OK but the Creme Brulee was bland in the extreme. Service was OK but occasionally inattentive. For two adults, one child, a check of $150 would have been reasonable for the quality provided. It ended up being $350 or so. Oh well - I rounded up the check to $400 and left with the intention of never coming back again. Imagine my shock when I found that my credit card had been charged with $600! I'm sure this will turn out to be an innocent mistake, but if this restaurant thinks it provides an experience worth $200 per head, they need to call Chef Ramsey.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "kCOTkW_QMp6_NRDw4bl1Lw"
  },
  "Iyxw1MMV_qlJYp8HiDo6KA": {
    "date": "8/6/2009",
    "text": "This place is pretty good. It was my first time at a Morton's. This is comparable to Bob's Steak and Chophouse. Definitely up there. The double filet I had was cooked perfectly and humongous; dayum! The waitstaff and ambiance was nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "y2Y-iGnRMk7zqJidVnC_Lw"
  },
  "nAwi_7gGJtrR9ng7V_CS9w": {
    "date": "2/24/2011",
    "text": "We had a very unpleasant experience on Tuesday, 2/22. I strongly advise against eating at Morton's in Pittsburgh.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-WUDFOVlzUJqPLfoyaUFcQ"
  },
  "8uYXfG_UrDICeMy9eX45GQ": {
    "date": "3/16/2010",
    "text": "I don't eat much steak, but when I do, I like a good one.  Sometimes you can get a good steak at a regular restaurant, but you will usually need to go to a specialty steak house to get an exceptional steak.  Morton's Steak House is such a place.  They serve Prime, USDA Steaks; good cuts of meat, with the appropriate amount or marbling.   We stopped In Morton's one Thursday evening after work.  I have to admit, I was bit excited because it had been some time since I had a good filet.  Morton's doesn't skimp on the frills, the lighting is dim, the decor is formal (white tablecloths only) and the wait staff are required to wear formal white shirts and bow ties.  We sat, ordered a few glasses of wine, and looked over the menu. The waitress arrived with a platter of specific cuts of meat under saran wrap, and explained the differences between the meats to us (a Morton's tradition).  I had already decided what I wanted, (a filet, medium rare with bearnaise sauce and asparagus), and my dinner mate ordered a filet as well, butterflied (that means cut in half and cooked until the flavor has expired).  I cringed, but that was what she wanted.  We also ordered a few Caesar salads.  After we placed our order, our waitress asked us if we wanted to pre-order a souffle.  Pre-ordering was necessary she explained; the souffles take 45 minutes to prepare and cook.  We passed on her suggestion.  Our salads arrived, and as she was serving us, she asked us again if we wanted to pre-order a souffle; for the second time, we told her no.  The salads were good.  The romaine was crisp and fresh, the homemade anchovy dressing and croutons were a nice compliment to the crunchy greens.  Our salad plates were cleared, and our waitress asked us once again of we wanted to pre-order a souffle...are you kidding me?   Our steaks came, and we were eager to try them.  My cut of meat was good, but not exceptional.  It was one of the end cuts, closer to the chateaubriand.  The asparagus was good, but the bearnaise was a little thick.  My dinner mate's arrived charcoal black, as per her suggestion.  She loved her steak, but I'm not sure how that was possible. We had a nice meal, but nothing to write home about.  Our overzealous waitress really took away from us having a nice time.  Her constant attempts to up-sell us not only took away from our evening, but really was an invasion of our privacy.   Go have a steak at Morton's; it's an old-school steak house.  The food is good, but they really need to retire the prior-to-ordering steak and saran wrap presentations.  I just hope, for your sake, that you don't get the waitress that we had.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nHxQfB9CRettoPKJmkDx_A"
  },
  "2gLEA-k2fLK-I_tIDsxCug": {
    "date": "10/19/2008",
    "text": "We ate here on a Sunday night and it was surprisingly slow. The wait staff was okay, not the best I have had at a Morton's and the same goes for the food. Don't get me wrong, everything was good just not as good as say the Morton's in Portland.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "e5O_lm2Mov6kHOka8wgvOA"
  },
  "wSs_MpcO8zUo8tatlok8BQ": {
    "date": "1/1/2010",
    "text": "Great place  . My favorite steak reaturant in Pittsburgh . The bar area could be bigger . The valet's were professional and quick .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vaNvEgtznFwSPDNkbM7hjA"
  },
  "RxlYOj99V8JSOVLhGhDQ6w": {
    "date": "4/13/2008",
    "text": "There is nothing really to complain about here.  This Mortons is like most in other cities.  It's definitely for the expense account crowd.  It's fun to go to a place and to know exactly what you are in for.  I've been to Mortons all over the country and this one stacks up pretty well.  It's like most other high end chain steakhouses (Palm, Ruth's, Capital Grille, etc.).  The bar is pretty lame, but I'm guessing most go here for a sit down dinner.  Capital Grille or Hyde Park bar is much better for bar scene.  But, one thing I definitely appreciate about the bar is  the bar menu.  If you've never been to Mortons and you are watching your budget go to the bar have a cold beer and order the PRIME cheeseburger trio or the Filet sandwiches for only 6 DOLLARS.  Plus, the fries are awesome.  The dining room is really nice with dark wood and lots of leather.  The service is awesome because I'm guessing you have to be pretty good to land a server position that might end up paying you 6 figures.  The food is great.  However, my opinion is that most True high end steakhouses all have similiar quality steak.  I eat here a few times a year and my favorite first courses are the lobster bisque (Very good, but not as good as capital grille) and the tuna tartare.  Stay away from the filet.  I mean it's tender and delicious, but try a steak with a little flavor.  I'm guessing if you're like me you don't go to Mortons often, so try something that  is hard to get elsewhere.  Get the Cajun ribeye.  I can't remember if Pittsburgh location does a bone in ribeye, but if they do I would say a cajun bone in ribeye will be one of the best if not the best steaks you ever try.  I also suggest getting the \"lazy\" lobster.  There are few things in life more indulgent or enjoyable than having a two pound lobster cooked perfectly already cracked for you.  It's pure indulgence.  The asparagus is great and as big as a baseball bat.  The spinach is great and the hash browns are a must have.  You should definitely save room for desert and there is no better desert here than the chocolate souffle'.  Remember to tell them that is what you want for desert when you order your entrees.  I wish the bar was better, because if it was I'd go here more often.  This place is exactly what you would expect.  And, that's a good thing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "1TkFY3Z_g62uZ6xNhAhXoQ"
  }
}