{
  "iaRSimaQrgbD9-PuFd8JgA": {
    "date": "2/12/2012",
    "text": "Best subs in Pittsburgh. Fantastic cookies.  About the subs: Heavy on meat and cheese. Light on the veggies. Homemade bread. Delicious Dibellas exclusive oil based dressing. Reasonable prices. How can you go wrong here?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAtyWWIoY4sx2dqtVgGb7w"
  },
  "yo_A2hhAy-akNc6b0Zr5Vw": {
    "date": "5/6/2013",
    "text": "I really like DiBella's. The service and ordering system are both great. The sandwiches are very good and very fresh. I love their cookies too. DiBella's beats Subway hands down.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7AGLlj5YzqdBfCPiZCa1mQ"
  },
  "vGl8G-RCQYhzDDnstmipRg": {
    "date": "8/23/2011",
    "text": "Love Love Love DiBella's! Now if only we could get a Wegmans Grocery Store down here....   Quality meats, fresh breads, and the sub oil is simply amazing. I'm here atleast once a week!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2YolNVJc_oYKXOMwNeTZAQ"
  },
  "PA96RC4Hf801GZRQRFGlqA": {
    "date": "2/2/2013",
    "text": "Can't go wrong with DiBella's, but you can do better.  Not going to go into detail with this review.  The place is what you'd expect from a chain sub shop that is definitely better than Subway.  You'll be filled up with greasy cold cuts for around 10 bucks, the staff will give you the impression that they'd rather be anywhere else, and you'll be in and out in a jiff.  The subs are good, but there are better downtown.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "E8w6O_CXuluNeo4K1JMIbQ"
  },
  "1Ulo7Qw2wCs2QZ_qExeWdQ": {
    "date": "8/7/2015",
    "text": "the signature sesame buns dominate flavors from meat",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eVt6t1Acg3y32R8E_AbJ-Q"
  },
  "A2VKR38WdfZEPenH3F-3iw": {
    "date": "10/6/2011",
    "text": "Talk about a great find! Stumbled in by chance and found the inside of the subway shop to be extremely charming and clean... and the bread + cheesesteak did NOT disappoint. It wasn't greasy and overbearing. Very very good! Will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "g82R2_L85cOxE3ADIUdRpA"
  },
  "kigB46tyI6ANO3mK-8p7sA": {
    "date": "3/19/2015",
    "text": "The #1 priority of a sandwich shop is fresh bread and DiBellas strictly rotates without exception. When asked what type of bread I want, I always say I want the freshest and I'm always told,  they make their bread fresh everyday. That does not mean you get fresh bread everyday because I often get stale bread. Like today. I just don't have time for it anymore. The last time, I sent my sub back. I can go to subway for a sore jaw and cardboard. 81 reviews and 116 helpful votes, I tell it like it is, not like other reviews.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8cLmMVgzYBc_uFECicsWLQ"
  },
  "m2ozywXoHowTRKAHCPn3tQ": {
    "date": "1/25/2015",
    "text": "The place wasnt crowded the afternoon my friend and I went.  The wait is nice and short from when we ordered until the food was ready.  Their everything bread is exceptional.  I had the Cowboy which was very tasty.  I would go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XgwoFVFjMzsDEcgDR_DabA"
  },
  "XZ4TtMLDsMqpqAzWDqqWoA": {
    "date": "6/29/2012",
    "text": "Great subs, bottom line.  Fresh bread, a large variety of choices, hot or cold.  Yum, yum, yum.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "djSJ6a9gsLSdj-7BoyNNQA"
  },
  "GVrPnHNaGlG8u_V9F14Rdg": {
    "date": "6/10/2013",
    "text": "meh. uncle sams and jimmy johns are better. diBella's bread is delicious...soft and chewy...but jimmy johns tastes better. uncle sams cheesesteak is much more flavorful. the first time i ate at dibella's, i was very disappointed in their cheesesteak. it was bland. and i even got mayonaise on it. the second time i tried a cold cut sandwich. the roast beef wasn't as good as at jimmy johns, but the bread was really thick and tasty. i probably won't go back when jimmy johns is better and faster.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6z9ERfBvRF3HOXLNTNkdpg"
  },
  "gWFtXZVYAxNknRq0nI10rQ": {
    "date": "7/3/2011",
    "text": "This was a very good place that we happened into for lunch. Many places are closed on Sundays in Pittsburgh, so we were very happy to find this place open. We both got subs and really enjoyed them. They are reasonably priced. I would definitely go here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "pVA5j9KzgGv8fzCW_cI7TQ"
  },
  "bDLrMK5RSZwDN4tvZayXww": {
    "date": "12/29/2011",
    "text": "Really wonderful sanwiches! The plain bread is incredible....that sounds dumb, but once you've eaten here you will know what I mean.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sYBgfT4Qpbg8qe1-nckazQ"
  },
  "_OJGgYNH6SGv4ObTpe0qXg": {
    "date": "9/4/2011",
    "text": "While on vacation and spending my last day in Pittsburgh I was in the mood for a sandwich and one that I could not find in Cincinnati. While walking around market square someone recommended DiBella's so I stopped in. It like your typical sandwich shop, go to the counter order your sandwich, watch them make it, tell them what you want on it, then pay. The sandwich was much tastier than a typical sandwich shop though. They highlight for me was the freshly baked bread. I had an Italian sandwich and enjoyed the meats that were used. Even though it was a chain, it didn't feel too chain like and it was higher quality than a typical chain shop. I hope someday DiBella's makes it way to my hometown of Cincinnati.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MwEeVx6NfM9Jnw0CW2ZEPw"
  },
  "u8EidPuW6cQS1CwnlZYmtg": {
    "date": "1/29/2012",
    "text": "Great subs.  Steel City Trio warm, YUM :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SatT0mq3c8MGV8-btMwXKQ"
  },
  "VXAdFF5xI4udx2IDof1lhw": {
    "date": "8/31/2012",
    "text": "Awesome sub - can't truthfully say it was the best sub ever but it definitely satisfies and I really like how you can personalize it and how quick they turn around your order.  Some of best sub bread I've ever had.  Beats Primatti Brothers hands down!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Nd5ah7gqNA_ODMhK6lUjw"
  },
  "EMLXCnj2tNpWOLDckVLlYg": {
    "date": "11/11/2012",
    "text": "A step or two above subway. Bread could be better, but good portions and fast delivery of food during lunch. I go often to dibella's",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ri5LGh5ioMMOqm8JybpdOQ"
  },
  "0Hc_qLeySuKe4Yf2SBdckw": {
    "date": "11/9/2012",
    "text": "yum!  so far i've had the godfather and the italian sandwiches - very good bread and good portions of meat.  add some peppers and their really good oil / vinegar dressing, and you have yourself a nice sandwich.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BwGBTrLkbibs_lzW0xyOlw"
  },
  "GuIafcksOfdy3UoPl-bSDQ": {
    "date": "11/11/2014",
    "text": "Really good food, BUT don't go here if you only have a half hour for lunch. Been here twice and both times it took over 20 minutes to get my food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xb7Iiwy0UGizyr1oG8XC3g"
  },
  "iJf5P4ReS2ejTx-TRc0RgQ": {
    "date": "3/28/2014",
    "text": "Great bread and fresh meats.  You'll never go to subway again.   The roast beef is awesome.  And they have a spicy horseradish to go with it.  The bread is definitely the draw though.  Sesame, muktigrain and everything.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MXy1fO4n7Q5-FRdgSWWXDQ"
  },
  "apK5v64qba8uSQh0lYe-8w": {
    "date": "4/10/2015",
    "text": "I love this place! I've been in Pittsburgh since my Duquesne days! My friend introduced me to this place way back when and I've always come back! The bread is amazing and the portions on the sandwiches don't disappoint. The speed is relatively fast, depending on what you order. The cookies are to die for and the pricing is about average. Must go",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5lHx2wxanG3mvM-x3BOd9w"
  },
  "5aN7mfOv8RY_lmiPQp2Jtg": {
    "date": "9/12/2012",
    "text": "Good Chicken Philly sub with cheese, peppers and onions.  11 inches for about $7.  Bread wasn't that great; definitely didn't look like the \"everything\" one I chose on the counter.  It was burnt but not crispy.   If they improved the \"fat\" bread I would give it 4 starts.  Beats subway.  $2.50 extra for drink and chips or drink and cookie.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DEFk299pEBqKgUgQ703V9g"
  },
  "N8XXB10IzS62fyPVgJ9ivw": {
    "date": "5/23/2015",
    "text": "Looking for the undisputed best cheesesteak in Pittsburgh, look no further my friend! I've never been to the downtown location, the one in the North Hills has pleasant staff, but the sandwich is so great, I wouldn't care if they tossed it at me. Ya'll are too sensitive and Whiney, if you want to Be treated like royalty, go to Ricos or LaMont.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e2KHp49i2d1uobEfM1NEEA"
  },
  "lr_3SkTOwAS_CEifgVfWlg": {
    "date": "10/17/2011",
    "text": "Wow, this is a good sandwich!  Everything tasted so fresh, and the sandwiches were expertly assembled.  Though I think the bread (which is made there in the store) really makes the sandwich, I am also a fan of the good quality meats they use.    The staff was helpful, friendly, and patient with me as an indecisive first timer.  Great location on Market Square.  Wish I had one of these back home!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "pHTNGXmD2GQYtoT9J-5gvQ"
  },
  "erpahQnsUfCJ_QEjdSQ56w": {
    "date": "11/17/2012",
    "text": "DiBella's is my favorite chain sub shop.  I have to hand it to the employes, I went to this location on Light-Up Night, and I only had to wait maybe 10 minutes for my sub. Now, on a normal day, 10 minutes might be a bit long of a wait, but this place was PACKED because of all the festivities going on right outside the doors. Every other place we went seemed like an impossibly long wait for anything, so I give this location a lot of credit.   Anyway, onto the food (you know, the important stuff). I think they have some of the best quality sub bread at DiBella's, I just wish there was a bit more variety to it. Your options are sesame, multigrain, everything, or plain. Maybe I've been spoiled by other restaurants, but I'd like a more artisan option as well. Everything on the sandwich tastes fresh, unlike some places. I like the Godfather, personally, but the cheesesteak and the tuna salad sub are great options too (tuna salad can be tricky).  DiBella's is a favorite of mine because everything tastes fresh and it's definitely worth the money.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QkZqYX7zxQOZewe1e6RjAQ"
  },
  "wckNAMRznj-olR578LSjRg": {
    "date": "4/18/2015",
    "text": "Amazing bread! Probably as good as it gets for a sub. I had the chicken Philly and the large was way too big, but delicious. Would love to try this place again because so many subs looked tempting.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HALsk1uxBmlnrexRaDpSaA"
  },
  "c6H79m-hMljOyfr1QmNnEA": {
    "date": "10/13/2014",
    "text": "High quality subs, the bread was fresh and the staff is friendly! I will absolutely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CUscree_J4QGlE67nmqlGQ"
  },
  "ZF88CFBlucraWGavwQje8g": {
    "date": "7/30/2012",
    "text": "Greatest Sub in Pitts so far.  It's a lot better than it's neighboring sandwich shop (sorry neighbor). The restaurant is super clean and has a old school feel to it. I had the Godfather with everything on it. Fresh meat, fresh veges, and just an awesome sub. It's definitely a great bang for your buck.   I'm headed back soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Rf0oE5nAywr2jlqopPTLw"
  },
  "68kRC-lcfPETD3RgcFWJ8A": {
    "date": "12/15/2011",
    "text": "If this review were based solely on service, they would have gotten 1 star. I am totally unimpressed with the staff at the Robinson location. The teen who waited on me mumbled and I couldn't understand him as he asked me what type of cheese I wanted. He seemed annoyed that I couldn't hear him. SPEAK-UP KID! While I was ordering a young lady came in to pick up a sandwich tray that had been pre-ordered. They could not find the tray and it took 5 out of the 7 people working to look for it and resolve the issue. That means that everyone else had to wait longer. The manager should have been able to handle that request alone, but they all turned it into social hour-laughing about how the tray wasn't made. I was beyond annoyed.   But this isn't just about service...it's also about the quality of the food. The food is delicious. The subs are so yummy . The bread is perfect...not hard bread but not mushy either. Just perfect. They are a little bit pricy, but totally worth it. The house dressing is an oil dressing and it is perfect.   So DiBella's...love the food, but hire some more competent people with some manners, PLEASE!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jaij3nmMTFFguC67URtcxA"
  },
  "_Ylk2eKigVq8F5wpdfKcig": {
    "date": "9/23/2011",
    "text": "Favorite sub place!!!  I love their subs.  The first time I came across a DiBella's was in Buffalo New York.  I was so EXCITED when they came to Pittsburgh.  The subs are the way Gram used to make them: heat the meat and melt the cheese!!  The best part of the meal is always dessert and their cookies are to die for.  I love to bake and make excellent chocolate chip cookies but I love their cookies.  I had to give this place only 3 stars becuase of the setup.  The door is always cramped at lunchtime and the line is always out the door.  They always seem to have enough staff on hand to make the line go quickly but you are fighting the people coming out of the restaurant.  Once you pay for your food you have to fight to fill your drink.  Everyone stands by the registers to wait for thier food.  5 stars for the food but 1 one star for the setup!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "htcbcv878nz2uiLkK1-yUA"
  },
  "cmt4etXQFmRB7nATn_CJSg": {
    "date": "2/15/2012",
    "text": "The Bread.  Everything else is the same. I feel like that's all that is needed for this review. But that's the main reason I like DiBella's so much. I go regularly with a co-worker for a cold veggie sub on multigrain and leave extremely satisfied.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ME1-IwMQMHkowOxffKUx7w"
  },
  "eo9sKrCBURHJXHTu0AhZNA": {
    "date": "7/8/2011",
    "text": "I've been here numerous times since they opened. DiBella's is one of the best subs you can get in Pgh, to say nothing of dahntahn.   There's a large assortments of subs and meats - capicola, corned beef, chicken philly, genoa salami, ham, etc. I've had everything from the dagwood to the old fashioned, philly cheesesteak  to buffalo chicken. All quite delicious and a good balance between meat, cheese and toppings.   And you can get them hot! Me does not like cold subs.  The wait can be a little long during the lunch rush but I think they do a pretty good job considering the volume. The order takers are pretty friendly.  Overall, this is one of my favorites in market square, esp. getting to-go when the weather is nice and you can sit outside and people-watch while eating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jZ1ziwykb5EEla5y4D5Ozg"
  },
  "eJufTjUjfUoXuOy6RrvpJA": {
    "date": "2/5/2014",
    "text": "Great place. I've only had the subs, none of the sides. But I've tried 4 or 5 of the subs on the menu and they were all worthy of the 4-5 star range. Price is a little higher than I would like, but ultimately, its worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Taht2c_3VahS9mbw1Zu0AQ"
  },
  "V6FwXEhSjLkn2T5TMVkN4g": {
    "date": "8/27/2015",
    "text": "Everytime I visit Dibellas I have a flawless experience. No matter what time of day, how busy, who's working, I always get great service and great food. My go to sub is the God Father, hot, on white bread with lettuce tomatoes provolone cheese and oil.. and of course that chocolate chip cookie.  When you walk in you're facing a long dining area/ordering line, which can be a little concerning when it's jammed with people and the lines out the door, but their staff is prompt and efficient, and although sometimes they lack the personality to go with their great service, I'd rather have quick, quality food than a chatty, overly friendly employee- after all, that's not what's going to satisfy my hunger.  And besides, when you're working on getting people in and out and concentrating on orders with no end in sight, I'd say it's expected to feel a little less chatty, and I'm ok with that! Continue to deliver quick service and great food, and I'll continue coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8Az_JgEpXqAii_5EDkw2tw"
  },
  "YlHsFQbqnOxJ3DNWLGHtgg": {
    "date": "3/3/2014",
    "text": "Nice standard sub shop, with great bread. Much higher quality than the nearby Jimmy John's and Subway.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jgX3wExCx-0jPztOJROJyg"
  },
  "GxaPERS0HYmUeXt8xxE4aQ": {
    "date": "9/15/2012",
    "text": "Not bad. Salty. Employees miserable. Large portions.  Right on Market Square.  I like the one in Cranberry better.  There the employees were just weird, not miserable and depressing.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "nOcP-0PIg4REFX4JeR49aw"
  },
  "SJZNg2o8c5jooIwzer6GmQ": {
    "date": "12/12/2015",
    "text": "Seriously the best subs we've ever had! Amazing bread & delicious meat. Yummmm! It was lunch time on a Saturday & it was super busy. Service was very fast & friendly. We will be coming back here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2eO4K_eQYALdKYHJgX0wUg"
  },
  "8YcDme46cq6pIbkgWJlU6w": {
    "date": "6/7/2011",
    "text": "This is a very good sub. Fresh hot cheese steak. Great bread. Good outside area and quick service. Loved it. Did not try the cold subs,but they looked great as well and huge.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tFeGSYSSSo3UdWIRSi40SA"
  },
  "5T-wnnjM6Yu3XNFlAbFVQQ": {
    "date": "7/12/2011",
    "text": "It took me quite some time to even try this place as there was a line out the door every single time I went. I'm not a fan of waiting so I always put it off. I have been here a handful of times since and always had a pleasant experience.  I think it's really great that Market Square is putting in so many food establishments, giving us downtown workers more options. Plus the subs are decent so it's not forcing you to eat something you don't like, ala Subway.  Things I don't like about it.  1.There is always congestion when you walk in because as soon as you walk in you order to the right. People just seem to be milling about for no reason. 2. It becomes a large cattle call as the employees are yelling for your business. It's kind of like those people at the mall with the stuff that makes your nails really shiny. 3. You're given numbers once you order so the entire time you're eating you hear the workers yelling out numbers like they're in a football huddle. 4.I like a warm sub but I don't think any of them are cold. I had a chicken cesar today and it was warm. That may be your thing, but it's not mine.  However 1. Their bread is amazing. Far surpassing any sandwich shop downtown. 2. The sizes are very generous. 3. Serves is pretty fast 4. They had great pasta/macaroni and potato salad.  There are plenty of sub options to choose so I can't wait to see what I get my hand onto next. Just make sure you pay attention or they'll be walking around the room with your sandwich and you won't even know it. And who wants to eat a meatball sub that's been sitting out?",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dsX3MiQiTy3OVI8MKn0I4w"
  },
  "s60CrC8ySGdif31MxVX7Gg": {
    "date": "11/16/2013",
    "text": "For a sub shop, this place has a limited range of ingredients and an even unfriendlier staff.  Upon entering, I was treated as if I didn't know what I was doing - which was True - and also annoying because I was asking about vegetarian options.  At that point, I'd leave a business, but I had limited time and don't know the downtown area well.  So, I ordered something that was overpriced and just filled with olives and roasted red peppers - which wasn't filling so much as just satisfactory.  So, if you're a vegetarian or vegan, stay away from this place.  Otherwise, I think meat-eaters might like this.  Truth be told, the service is what brings this review down.  This must be a place where teenagers who don't care go to work.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nR3hzni4OL96vnEcR_frYg"
  },
  "_S9q9Ajf6xSPn4hG-nvr3g": {
    "date": "10/16/2013",
    "text": "Can I just say the obvious here?  It's Subway, on steroids.  Everything is just about as similar as you can get. From how you order to how you pay. However, the most glaring difference here is the price. When I went to pay I about hit the floor. For their \"medium\" sub meal combo I could have had two foot longs at Subway.  The thing that I did fall in love with here was the bread. I know the other place bakes theirs fresh as well, but it does not compare to this.  The crust kind of crumbles when you bite into it, and the innards are so soft and great at keeping what's inside, inside.  And do they ever load up what's on the inside, I'm not talking about the fillers. I'm talking about the actually meat.  I tasted more meat than veggie, which pleased me.  The one thing that I didn't really like was not being able to see the toppings. It's great that they interact with you, but it's also hard to hear over everyone else that is in the restaurant.  Plus I like to see that what is put on the sub is as fresh as the bread.  In summation, even though the price shocked me, the taste out shocked me. Is that a phrase?  Oh well if it isn't, I'm using it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "BQsUfZgj9OqQEXm97V8JWg": {
    "date": "1/16/2017",
    "text": "You get your money's worth. The meat on the sub is also really fresh and so are all the other ingredients. If you need something to eat and don't mind spending a bit extra for superior quality, then you should go here. The place has ample seating and the people that work there are pretty nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L24lwOtCetlcV6kOJvBi1A"
  },
  "3C8ekSRgySKAC4coouWU_A": {
    "date": "9/6/2013",
    "text": "I don't get the appeal that results in lines out the door (or maybe that's just the poor setup where the line starts a few feet after you walk into the door.  First off, it is pricey for a sandwich shop.  On the upside, there are a lot of choices for you to customize your sub the way that you want it.  Lots of meats and accouterments to choose from.  The employees taking your order seem to be working at warp-speed, to the point where your head might be spinning after you place your order.  The cashiers and managers down at the other end tend to move a lot slower.  Yet, despite the frenetic pace of the front-line, I always seem to wait forever for my sandwich- usually about 10 minutes. To be clear, I order my sandwiches very simple.  You are given a number then someone is running back and forth from the counter trying to hand out the sandwiches. It is so unorganized and chaotic.    The sandwiches are fine, but nothing spectacular. The portions are generous- the small is quite large.  The large is ludicrous.  I wish they had a bigger assortment of bread- some with seasoning (like a Parmesan oregano, for example).  The pasta salad is good, but over dressed. The cookies are tasty.    Unless you have a coupon, be prepared to pay twice as much as you would at Subway.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zh-Nkaz5pFlOln-7GORWaw"
  },
  "i6er5Ay3HLN_dmp2CT5cEA": {
    "date": "5/12/2016",
    "text": "DiBella's is a great place to stop if you need a quick lunch downtown. While it does get pretty packed for the lunch rush, the line is usually better than it looks and it moves quickly. I've had hot and cold sandwiches here and have always enjoyed them. I usually get a small or medium, occasionally going for a large if I will need lunch leftovers for the next day. It's a little overwhelming with ordering if you've never been there before, so make sure you peruse the menu and know what you want before you step up to the counter!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "5IaHGddT0RLq1-S5LbP1iw"
  },
  "TywmhAcTg5vOsvmhSdk8Ag": {
    "date": "6/10/2013",
    "text": "I loved DiBella's! We had the godfather there and it was insane, we topped it with everything we could think of and then some. I liked all their options but if you're a vegetarian they don't offer a huge selection. It is however, worth taking a stop by and checking this place out.  I usually don't go to delis so this place really blew me away!! The location isn't the greatest, I love their subs but I wouldn't trek all the way downtown for them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BkMqpJikNc3r5itc-ui6ww"
  },
  "YWzXJq3repyMkcE1ZHh9kA": {
    "date": "2/21/2013",
    "text": "My new favorite chain sub place in the Burgh!  I was in the area one night and had my heart set on finally trying a burger from Winghart's. They were closed for remodeling due to a fire. So I walk into DiBella's and boy am I glad I did! When I walked in I noticed how clean the space was and that it had a old school feel to it.  DiBella's not only offers subs but, salads, macaroni, potato and pasta salads, deli pickles and cookies as well. Think of Five Guy's but, with hoagies as you pick your bread, size of hoagie, cheese and toppings you want. I went up to the counter, looked over the menu and was ready to order. I went with a cheesesteak on their white bread, (similar to pretzel bread) provolone cheese, lettuce, tomato, banana and sweet peppers, mayo, BBQ sauce and steak sauce.   I got my sub toasted so the provolone could melt a little more. I added a combo of chips and a drink also. I grabbed my bag of chips, went over and filled my cup and went down to the cash register to pay. The smell of my sub being made was absolutely intoxicating! A few minutes I sat down to enjoy my hoagie. Let me tell you, it was EPIC! From the fresh bread to the tender steak to the fresh condiments, it was truly one of the best chain store subs I've ever had! It was so good that a few days later I took my wife and daughter to get a sub as well. They also have a kids menu. Service was excellent as well as it was a little crowded but I got my sub fast!  All in all a great place that is a defiant must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BjtJ3VkMOxV2Lan037AFuw"
  },
  "xhGm7ixx5WGhuCzlYO_K3g": {
    "date": "11/16/2017",
    "text": "Fresh subs that are delicious! Far better than a couple Sub chains out there. Will definitely be going back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2jdL_vvnu05GrWiXNKk0Jg"
  },
  "ZUvkEM3pznf2oJg_pMwpIg": {
    "date": "6/8/2015",
    "text": "Echoing what another reviewer has said about DiBella's, the subs are good, the staff is friendly, but the ordering system is a little disorganized. I went on a slow Sunday afternoon and although there were several people working the counter, I couldn't help but feel a little put-off by the number system used for ordering. Instead of an orderly queue where an order is placed, you pay, etc., people wait in front of the counter where staff are making subs, and seemingly just shout out their orders to them before taking a number and going to wait.  I ordered the cowboy which was pretty delicious. The bread and ingredients were fresh and my sub was made to order.  The atmosphere is interesting: with big band music spilling through the restaurant sound system and a long row of booths and tables set in a cavernous tiled room resembling a New York City subway station.  Cleanliness left something to be desired as it was hard to locate a table that wasn't dirty or covered with crumbs.  Overall, you come here for the subs and not the atmosphere obviously, and DiBella's makes a good sub.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "j5OsEnHzKuhenSrllS9qPQ"
  },
  "eix1xNTjPQmyX8nfc2LncA": {
    "date": "3/11/2016",
    "text": "Great subs... Love the godfather sub always get it... Love the variety of oils that they use... There's mostly a line but it seems to go by very quickly... Better than all the other sub places in my eyes...",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-h4nHEPASpo_vL5cUvdQxA"
  },
  "Su3xoWpTd3NfBT6o8M-TaQ": {
    "date": "5/25/2014",
    "text": "So I went in here cuz almost everything I wanted was closed on a Sunday. Saw this place and figured why not. After going in I noticed the old school look. It felt comfy, so I look over the menu and see the cowboy a BBQ bacon chicken sub. I noticed all the food is cooked on the grill after ordering. After a short wait I bit in and taste what have to be one of the best subs I have had in my life. The price was good also and a med sub was more then enough. Would make this a reg spot I have to visit when I come to pitt along side the likes of primanti bro.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s-mjedpPI2BgStwk1B4I5A",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. The cowboy ate the other half too fast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/s-mjedpPI2BgStwk1B4I5A/o.jpg"
      },
      {
        "img_id": "csT71q0LEbapQgX2e66MVw",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. Old school",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/csT71q0LEbapQgX2e66MVw/o.jpg"
      }
    ],
    "user_id": "d1IBKv5wY-zI1H4VmM3oXw"
  },
  "5xCQQTVj4AIHVeWJwQwh0A": {
    "date": "6/6/2014",
    "text": "This was a first time visit and well worth the walk.  I went with the medium Godfather combo.  Huge size, awesome bread and meat/veggie's made this a keeper.  You always have to compare a hoagie to others and this dominates.  I will be heading back down the road.  I was scoping out the other subs at the table and I need to keep trying them out.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GlvYtSgqAs0-E84e2MdzkA",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GlvYtSgqAs0-E84e2MdzkA/o.jpg"
      }
    ],
    "user_id": "Rem81Xoev05aqeA-mFbM4A"
  },
  "zJ1TabxdO-BnDMaHPrgKbQ": {
    "date": "10/1/2014",
    "text": "Great sub place!  They are more expensive then subway, jimmy johns, and quiznos but you get a lot more bang for the buck.  I got their godfather per recommendations and it was very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QFTgUEdAtxhR44KdeHQXFQ"
  },
  "3GDzAGr5iCt3mQ970BmpmQ": {
    "date": "9/20/2014",
    "text": "Way better than Subway.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f4d-dzblpmtjvtfxJ7WArA"
  },
  "fI4DnxEl90WcAG6gvvmOTg": {
    "date": "4/7/2013",
    "text": "Kay wanted to treat me the other night, pledging to meet me in Market Square for a cheap dinner to commemorate her new, new job (long story, but it's worked out so far). I'd been wanting to try this somewhat upmarket version of Subway for some time now just to see if the hype was deserved.   Yeeeahhhh...I dunno. I was a bit let down by 5 Guys too due to its greasy, sloppy overkill. Yet, with DiBella's, I found most of everything to be merely edible and not much more.  The potato salad, however, was a Grandma's-level mockery that tasted as processed as a pop song. The potatoes were akin to tofu with the texture of gnocchi. I did love the bejeezus out of that sour and fat dill pickle, though, but sadly and strangely, it was the highlight of our delicatessen supper.   That's not to say that my custom-made, oven-baked (my choice, you can also have it cold) sandwich was an abomination. Comprised of ham, corned beef, roast beef, onion, cucumber, lettuce, tomato, mayonnaise, oil, American cheese, mozzarella, and provolone, I opted for the Portuguese-ish, pretzelesque \"Everything\" roll to contain it.  The meat itself lacked in...something. Freshness perhaps? It simply didn't have the flavors I've come to expect from deli meats. I didn't find them at all \"greasy\" as another reviewer put it, but rather they were bland to me, and overall, there really wasn't much about the sandwich to set it apart from Subway aside from meats that were a little more supple.  Also unremarkable were two dozen mini chocolate chip cookies that came off as the mass-produced, vacuum-packed, and readily available sort one would find in a supermarket aisle along with Oreo's and Chips Ahoy.   On a positive track, I did appreciate the enthusiasm of the employees along with the almost fun, surprisingly effective, \"20-questions\" styled ordering system and the clean, period-piece decor.   Although, why they wrap the hell out of dine-in sandwiches is beyond my understanding. For takeout, yes. Eat-in, ehhh, why waste the paper?   DiBella's was founded humbly in 1918, and I get the sense that a lot was lost in its metamorphosis from mom-n-pop shoppe to national franchise. If I could, I'd time-travel backwards to try the original and would wager that the sandwiches were far more magical.   Primanti Brothers has recently made this type of demonic pact as well, and I hope that it doesn't cause them to become as homogenized as DiBella's.   P.S. Our tab for 2 medium sandwiches, 2 potato salads, 2 pickles, 2 fountain beverages, and the cookies was over $30! Affordable this wasn't.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 10,
      "cool": 6
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "KYfoYeMvjkWXyRnp9RhhaA": {
    "date": "10/31/2015",
    "text": "I wanted to like this more than I did.  My co-workers and I decided to stop in here for lunch yesterday, and I think everyone was happier with their sandwiches than I was.  I go the DiBella dip, which is essentially a French Dip hoagie.  And the dip was good, the roast beef was fine, and I ordered grilled peppers and onions to go with it.  I got white bread, which was okay.  On the whole, I think it was too lean.  Which is why I ordered it in the first place, because it was just about the only hot sandwich that wasn't over 1,000 calories in the medium size!  I kept biting into it and dipping and thinking, \"Man, some provolone cheese would help this a lot.\"  The ordering process also gave me a little bit of heartburn.  You go up to an available person behind the counter and tell them what you want, so they go make it for you.  What was unclear, however, was whether you're supposed to wait until they hand you a sandwich right there, go pay first then wait, or what.  In any event, they do have numbers that you can take, but it seemed to arbitrary as to who got their sandwich at the grill/counter, or who needed to go pay then wait for it.  So yeah.  Just an okay experience.  I may be convinced to return, but I probably wouldn't seek this out again.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3FjdHwnoz-vfw6hBBtckqg"
  },
  "PdJlxAt19LUGKOwPmCuUFg": {
    "date": "12/21/2014",
    "text": "This is not my favorite sub restaurant, but it is OK. I visited in the evening after dinner when it was not busy. I still had to wait a little while for my sub. I did have a table and chair to sit at, which I appreciated. My tastebuds were satisfied but not thrilled with the taste.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FW5F5QzzMoeRdIib1OyNOw"
  },
  "RI_cBDMSTIt-SI_KlwYnlQ": {
    "date": "2/9/2012",
    "text": "Awful. Just awful.   In this establishment, you order at a counter of shouting service-people, each vying for your attention at their line. You place your order (standard hot subs), and then, while you stand or sit to wait, workers run up and down the long restaurant yelling out order numbers. The atmosphere is chaotic, and yet the wait still managed to be quite long.   The price was quite high: a regular-sized sub, a cookie, and a drink for $13.   The worst part was the sandwich itself. The first time I went, I found it to be a very run-of-the mill hot sub. I was ambivalent. However, I decided to give it another shot and, though I had a similar experience with the services, the roast beef dip sub on whole grain was *absolutely disgusting.* The bread had an unpleasant, dry, dense flavor and texture, and the meat was highly salted leather akin to beef jerky. Dipping it in the au jus managed only to make it soggy and even saltier.   Really, I would eat at any single place downtown before I will be back to this establishment or any of its other locations.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "82hsvKoSUqOcDNlRf-SvQQ"
  },
  "lTEBnc2hpkMjWcUBBpTl_w": {
    "date": "4/12/2011",
    "text": "DiBella's is the best sub I have ever had in my life.  I'm from New Jorsey and I agree that it is hard to get both a good slice, and a good sub in this State.  Why is that?????  DiBella's needs to open a place here!   This was my forth time in Pittsburgh I do three things:  1-get a garbage plate. 2-go to see theSteelers. 3-get a DiBella's sub!!!  The secret is the bread.  Baked fresh at DiBella's all throughout the day.  This aint no subway roll, bleaacchhh.  I don't know if they put an eggwash on the bread but it's got a shiny brown coating on it that is really good.  The next secret to a DiBella's sub is the condiments: all kinds of mustard and their oil is tops.  I prefer honey mustard and a thin coating of mayonnaise.  Secret # 3: peppers!!  They have sweet, hot, and banana. you gotta get the bananas!  They are those awesome sliced, neon yellow peppers that add just the right amount of kick to any sub.  DiBella's does not skimp on the fillings...many layers of top-quality meat and cheese make these subs the best around.  Average prices for incredible sandwiches, corny 1950's decor with black and white tiled floor and wooden booths, but nobody comes here for the decor, they are comin' here for SUBS!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IKBiqTO9BQfP50ogIrkBDg",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. Old Fashion Sub",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IKBiqTO9BQfP50ogIrkBDg/o.jpg"
      },
      {
        "img_id": "gMIchRWz8mYzIcr1QjBQpA",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. My Cheese-steak Sub",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gMIchRWz8mYzIcr1QjBQpA/o.jpg"
      },
      {
        "img_id": "If52GWVXoyLz8UH_m8_ztQ",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. Large Cheese-steak Sub",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/If52GWVXoyLz8UH_m8_ztQ/o.jpg"
      }
    ],
    "user_id": "Br_Smhj4sBAwXDm5G-a8tg"
  },
  "U_kagayiZUT32YEF3dMB8g": {
    "date": "4/19/2018",
    "text": "First time trying Dibellas, man it was sooooo good. The bread was fresh, veggies were good and the meat was of good quality. The bread was definitely my favorite part. Big portions too.   I got the chicken philly, service was nice and super quick. Will definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EUfONlnbVGkNKFWMVHBaRQ"
  },
  "0joBHRY1UFcHjRIsbxbeXQ": {
    "date": "9/25/2018",
    "text": "Ordered the Uncle Louie. Overall a decent samdwich. The bread was great but there was a lot of it, and the sandwich was pretty dry because of it. Fast service and reasonable prices.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P9UfAYeMYwuI3o4pyuRVzw"
  },
  "SwWUKxOQPM1SC9ZERiCDcg": {
    "date": "7/28/2018",
    "text": "I've spoken to different employees from this company over the phone on multiple occasions and they are all exceptionally rude and snotty. I'll take my business elsewhere and I recommend you do the same.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k6sdFoOZYzf8y4ZdWRtgkQ"
  },
  "YZ9GpHxssLEbKPfS4mppng": {
    "date": "5/19/2017",
    "text": "Pretty average to poor quality sandwiches... maybe you can consider that a level higher for Pittsburgh standards but I'm using an NYC Deli scale   Surprisingly for a place with a multiple POS line and pager system they're incredibly slow and disorganized. You can order and pay quickly but it may take ages for your sandwich to actually be prepared, that is if they haven't completely bollixed it and forgot to even make your sandwich as happened today. Never again.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2tavxf3qmdLY1n1BjmU_YQ"
  },
  "WiTf-0NFTMQqu7LDTPD-TQ": {
    "date": "3/19/2016",
    "text": "This is by far my favorite sub place in Pittsburgh. Their bread is amazing. My go to is always the old fashioned grilled on plain bread. It comes with turkey, ham, and salami. If you haven't tried dibellas yet you need to get there ASAP!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o5muRF_DnMz8p10-rHFkEg",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. Old fashioned sub on plain",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o5muRF_DnMz8p10-rHFkEg/o.jpg"
      },
      {
        "img_id": "IVe-dCBFNbBvnP3_DLCPWw",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IVe-dCBFNbBvnP3_DLCPWw/o.jpg"
      }
    ],
    "user_id": "-Y6tXYPYqeVy37-L5p0rMw"
  },
  "m_VpY802r3ivLzQ-2J6fdw": {
    "date": "1/26/2017",
    "text": "The sandwiches are ginormous, fresh and tasty on delectable buns. Super filling. My office used to cater boxed lunches from here for meetings and what a treat that was.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "FLELcQBk8y6y3SOZpyemow": {
    "date": "5/8/2014",
    "text": "You down with OCD?  Yeah, you know me. I'm down with OCD, yeah, you know me.  Okay, I'm a little obsessive compulsive and I like things to be orderly so that's why I'm tempering my rating.  The food itself was pretty good. My tasty cheesesteak with onions and peppers was only a medium but it was the size of a toddler's arm!    The guy who took my order was friendly and the dude who rang me up was nice but the ordering and paying process was so disorganized that I nearly had a panic attack.  Okay, it wasn't that bad but the place where you ordered was clogged with people waiting for their food so it was tough to tell who was waiting to order and who was waiting for food.  When you walk into a place and see a huge clump of people standing around, it doesn't really welcome you into the place.  If they could separate the food delivery from the food ordering so that everything was linear and tidy, then it would make my very uptight soul incredibly happy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e850WQLria_vM4S-qTVlrA",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. This is a medium!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e850WQLria_vM4S-qTVlrA/o.jpg"
      },
      {
        "img_id": "BEV6WQmDr6JRyqDP7Q5vmw",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BEV6WQmDr6JRyqDP7Q5vmw/o.jpg"
      }
    ],
    "user_id": "wzyGNvArcpUjZauRWFrKHA"
  },
  "WlpAYRtUpTUbSnNbKcLZZw": {
    "date": "3/1/2018",
    "text": "I didn't actually eat the subs myself, but I ordered a party tray for another office in Pittsburgh last minute and these guys executed - I even received a followup call from them a few days later asking how everything went. Very high level.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rDjaF6eEj02_NyayU593Fw"
  },
  "I5wBhEpp14RWunf-4I2l9A": {
    "date": "2/12/2018",
    "text": "Best bang for your buck type place. The \"godfather \" sub with spicy toppings on a wheat roll is delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qayT6rFLcCVtB7VM_-NbJg"
  },
  "WVysV0oVAOhPpFvUMaV_bA": {
    "date": "2/24/2017",
    "text": "This chain location  is a solid option if you're not down for a wait at Primanti's. Actually I think it's better than Primanti's, but I am not a member of the Yinz nation.  The bread quality here is very good - imagine the freshness of Subway but with real bread. Great texture, and I learned an \"everything\" works better with deli meats than it does with cream cheese or smoked fish. The meats themselves were solid - I liked the horseradish mayonnaise on my Uncle Louie, a combo of roast beef, ham and turkey. Salad items were fresh as well. My partner's Old Fashioned (turkey, ham, Genoa salami) was also savory.  A medium feeds one large appetite. If you plan on having dinner, share your large with a friend. Not on the level of a Gaucho or even a Thin Man, but it's a crime that there are ten thousand Subways and maybe two dozen of these. None where I live.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bBQZxbAr331bA2Lqqvt5dw"
  },
  "Skgw6ddQqwiih5ApAdk1rg": {
    "date": "8/8/2017",
    "text": "I think it's an insult to even compare this place to Subway! It is a chain and, therefore, not quite as good as your mom and pop Italian grocery, but it sure as heck beats any national chain. Bread alone makes it worth a try, chewy crust, soft inside, makes me glad for gluten. Meats are fresh tasting as are the toppings. I like the three different sizes--plenty for the larger appetites. I walked in at 10:15 on a Tuesday and was the only one in there so I can't comment on the crowds. Same guy made my sandwich and rang me up, all with a smile. Definitely worth a try if you're Primantied out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "r4E7ElYXdKpRzcFOFlFyWg"
  },
  "yC_IO0IKv2o_ZcR50ArMcg": {
    "date": "9/26/2017",
    "text": "Instead of another trip to Primanti, I decided to try DeBella's, and I was very impressed. I had a medium-sized sub, which was equivilant to a large sub most other places.   The bread, sesame in this case, was excellent, and the tuna strong.   I wish they had DiBella's outside of the Pittsburgh area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BQk_TnOI6JI5ogqT5FpviQ"
  },
  "UO31io8ZJ5acDlKkhMRxSg": {
    "date": "8/10/2015",
    "text": "Stopped by on a whim for a sub with my daughter.  I ordered the cheesesteak  and meatball sub. Both subs were hot which is an A plus in my book. The bread was soft and fresh.  The meatballs tasted great. I'm always worried about ordering meatball subs and having the meatballs taste like they were out of the freezer.  It did not disappoint.   I enjoyed my cheesesteak and would order it again.   I didn't give this place five stars because like other yelpers mentioned it is a little confusing when you walk in, and the pasta salad is smothered in Italian dressing.  I would also like to see kid options. A simple grilled cheese will do.   These subs are way better than Subway!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rD25AK8lc0r-TgDtYgzATA"
  },
  "96zRrs2M7oyY-8k6ax1MGA": {
    "date": "4/1/2015",
    "text": "We stopped in today for lunch. We began at Grant Street and walked down Forbes turning our nose at every place since we have ate there 100x in the last 4 years.  We get to Market Sq and decide on DiBella's since neither of us have been there.   I ordered \"The Cowboy\".. which is cubed chicken, BBQ sauce, cheddar cheese and thick, smoked bacon. I enjoyed the sanwich and was surprised on the size of it.  Bobby ordered \"DiBella's Dip\" shredded roast beef with the side of au jus sauce. You can order it cold or hot. He ordered it hot and added sauteed mushrooms, onions and peppers. He gave the sandwich two thumbs up and again the sandwich was huge. I have no intentions on heading back to Subway, Quiznos, Penn Station Subs (yuck) or Jimmy Johns. They know how to make a sub! Also, their bread was perfect!   Prices are pretty steep though.. we each ordered the medium sized sub and made them both combos (medium drink + a cookie or bag of chips) Our total came to $25. Can't really eat Dibella's everyday but it will be a nice treat and I'm glad to have changed up my lunch routine.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "xR7rQ9lk_8piN8V-p3IM7w": {
    "date": "4/28/2018",
    "text": "After leaving a nearby establishment due to horrible music, my husband, two teen sons and I walked into DiBella's. The wonderful aroma that created us was a warmup for our tastebuds. Our subs were ready quickly and once we settled with our drinks at a table, we enjoyed every bite. The boys inhaled their meatball subs and my husband devoured his buffalo chicken sub. The mediums filled them up. My small chicken philly melted in my mouth. The atmosphere was wonderful and we enjoyed our meal. Thanks for a great start to our evening in Pittsburgh. Now- Let's Go Bucs!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jsQxQYNKeCpKozClefk4jQ"
  },
  "xMfNOgw15M95vdcilPHSKg": {
    "date": "4/23/2018",
    "text": "We had a great experience during my recent visit to DiBella's.  The gentleman who was making my sub was probably the nicest sub maker I've ever had in my life.  The line was long (during lunch time on a Friday when there was an event in Market Square), but the team kept it moving.  The two subs we got tasted great and they were reasonably priced.  What more could you want?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g_o2-WR2y9M24a8i9X3lIA"
  },
  "uTMiGvLfbKLTN7NMDYB37A": {
    "date": "1/22/2016",
    "text": "A company came to my school and catered these for lunch and it was honestly one of the best subs I've had in my life! I feel like you're probably thinking it's just some bread and meat and fillings, so how good can it get? But the ingredients tasted so fresh. The bread had a unique grain-y texture that wasn't too firm and relatively healthy. I got a turkey sandwich and finished it so fast! Definitely want to stop by and check out the brick-and-mortar location, but I can attest to their simple yet great tastes and ingredients!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "87yDspNg9HFoPqV0A-heZg"
  },
  "2Wtnlm55XH8IGpK0tMReRA": {
    "date": "6/1/2017",
    "text": "Great service, great food. When we got there the line was long but by the time we left it was our the door! The service was very friendly and helpful, both the godfather (slightly spicy Italian) and the steak were recommended (and both amazing) with the addition of a huge kids meal (3\" sub, applesauce, cookie and apple juice) and some of those chocolate chip cookies. The bread was fresh, soft and flavorful (sesame all around), the portions we're generous and the small was more than adequate (6\", I believe). Two adults and 2 very littles were more than pleased. Highly recommend stopping by and nomming on one while you enjoy market square.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ED7fXMpz8F890Zs1ev1QuQ"
  },
  "DMmVOdYwTywpR2JH5bEidg": {
    "date": "7/19/2014",
    "text": "Stopped for a quick bite while walking around Market Square, and was not disappointed!  I got the chicken cheesesteak, small size, which was actually not that small at all. They packed my sammich with legit chicken breast strips (not the usual shredded kind), which was awesome. The bread! It was soft and so chewy!  There is a decent size dining room if you want to eat in. They also have options for other hot and cold sammiches.   A good option for a quick, cheap and delicious bite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N7NnC6-q0O-Gq2n_7YJkNg"
  },
  "5DcgD-HkFllP65J-_L-ayw": {
    "date": "8/1/2016",
    "text": "Thats a pretty good sammich.  The medium sub is freaking huge and with bag of chips was like $8.  The price is the reason for only three stars.  I mean it is a good sub and all? But $$$.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GHP0zVzInzoxUm_5nPK6KQ"
  },
  "RAnIY-aqbt4WHV-A7LnYRw": {
    "date": "7/27/2019",
    "text": "Stopped by for a quick and inexpensive lunch. Got exactly what we wanted and expected. The sandwiches were very good - although an extra slice of cheese (for no up-charge) would have been nice, a healthy quantity of meat on each came standard!  Oh, and the cookies...yum!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a57e1o0n1KteMhhcBoZTxA"
  },
  "NJJX-_IOP1c1YK7W76ZSDw": {
    "date": "6/28/2019",
    "text": "Don't order online.  Complete failure.  Ordered two subs.  They intermixed the ingredients of each.  We would have dismantled and rebuilt to match the order, but mama says mayonnaise is the devil.  In-house orders are quick and the subs are good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V5jg4VqaUZQHeJFtLvTQMA"
  },
  "YVx1hdt0iO8L0KuwTjqKVg": {
    "date": "6/16/2019",
    "text": "I don't typically do delivery, but it was raining outside and I had no car at the hotel I was staying so I decided to order online and have my veggie sandwich delivered. As a note, they do charge a minimal delivery charge but also a charge for small orders. I'm not sure what amount removes the small order charge as I tried to upsize and the small order fee remained on my bill.   It took about 45-50 minutes before it arrived, which was good as I was just at the right hunger level when it arrived.   I thought that the delivery guy would come to the room since I put all of that information in the comments, but he called and said I had to come to the lobby and pick it up. No big deal but I had to get out of my night wear which took a minute. He was nice enough so I won't complain about going downstairs.   I took my sandwich and pasta salad to the room. I opened the sandwich and because of the wet dressing I asked to add the bread was so soggy that I could only eat about 1/2 of the sandwich. Thankfully it was huge and I ordered a medium because I thought a small would be too small (there are no inches listed when you order so it is difficult to know how big it is).   What was delicious and worth the wait was the pasta salad. Oh my, it was so good I should have just ordered that instead without the sandwich. I'm salivating thinking about it now and the reason for the 3 stars instead of 2 stars as the sandwich certainly wasn't worth it. Next time I will go to the restaurant to give them a 2nd chance at redemption. Just a suggestion to the restaurant: if someone orders wet dressing, perhaps put it on the side so they can add it when it is delivered.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TExj5cyhpYqe-zPKWGQaNA"
  },
  "rH6mjgQmUumtJxY-DX54dw": {
    "date": "8/29/2019",
    "text": "The Godfather sub was so simple but tasty. Sometimes you do not need to be over the top to make great food. The service was fast, friendly and inexpensive. I would definitely recommend this sub shop anytime you are in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-uyrIp7lqGMCTA2CzSHYiw",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. Goff ather Sub",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-uyrIp7lqGMCTA2CzSHYiw/o.jpg"
      }
    ],
    "user_id": "pIAjzKEjeJQfJq1MiL-vjA"
  },
  "5SaeYSp__Mv-u_2HXVRPuA": {
    "date": "6/27/2019",
    "text": "You can't go wrong with a dibellas sub. They have multiple locations, which makes it convenient. The god father is my personal favorite, a good twist to the Italian. I love their multigrain bread & I Aldo like that you can get the subs in different sizes.  DiBella's makes good cookies as well. If you are looking for catering in an office or at an event, Dibellas will do the trick! The veggies are always fresh which is why their tossed salads are also good. Their pasta salad, in my opinion, is just \"ok\".  Overall, I would recommend Dibellas. Tip- you can order right here on yelp & get delivery through grub hub!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "chbCROaKWm2pj5uUT-ruGw"
  },
  "uJbodKVkUOzObxDhf4tZrA": {
    "date": "2/4/2019",
    "text": "***WOW*** Super great customer service. I walked in and was greeted immediately. I was asked what they could help me with. There were about 6-7 people behind counter and every single one was friendly and had a smile on I ordered the old fashioned which is turkey, ham and genoa salami on a foot long everything roll with lettuce tomato and mustard. The staff were super friendly and were anxious to serve. the place is pretty big and has plenty of seating to eat in. The sandwich was totally delicious. The sandwiches are overstuffed with meat which is great. I would defiantly go there again fo all my sub needs. If you are in Market Square and want a unbelievable sub sandwich then definitely stop at DiBella's Subs. It is defiantly worth the trip.",
    "rating": 5,
    "rated": {
      "funny": 25,
      "useful": 35,
      "cool": 31
    },
    "photos": [
      {
        "img_id": "iVNpGIYTwxJU4z9UgrWaAA",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iVNpGIYTwxJU4z9UgrWaAA/o.jpg"
      },
      {
        "img_id": "GsQ5Fboe3bZh8XRkpZCSVw",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GsQ5Fboe3bZh8XRkpZCSVw/o.jpg"
      }
    ],
    "user_id": "hg71CGHy9bwpgY8cGVVg4w"
  },
  "tix-Dg09AiTejXBk-P9hMg": {
    "date": "7/10/2019",
    "text": "Always great subs! DiBella's started in my hometown of Rochester, NY, so I was excited to see that there was one In Pittsburgh. Something about their bread is just so good and I can't find another place that has bread as good as they do. They have several meat options and you can make your own sub or choose from a menu. They also have amazing chocolate chip cookies! I highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "66st7s4ZLqJVWkAbULNnZg"
  },
  "BUK1znWutFCeKtDzDBlo9g": {
    "date": "5/29/2018",
    "text": "Solid place to get a sub done the right way! Recently I started working on the Blvd. of Allies downtown and we are only a few blocks away from Market Square. Needless to say, there are what seems like hundreds of restaurants and places to enjoy for lunch. However, if you are in the mood for a fresh juicy sub, DiBellas is the place to go!  First thing I noticed when walking in was how quickly you get served. The cooks will flag you down and then you approach the counter and place your order. I went with the pulled pork sub that comes with Sweet Baby Rays BBQ sauce. I know, to die for! I got the large because I was not too familiar with their portion size.   This \"large\" hoagie was massive! Literally it was like 2 subs. The cook was nice enough to cut both halves in half for me! The sub itself was delicious. The sub roll was so soft and you can tell the freshness after the first bite. The veggies were good, and I actually enjoyed the coleslaw that came on top as well. The only nit picky thing was about the pork itself, could have been shredded more. The big chunks of pork were tough to eat because they would fall out the sub and get pretty messy. But not a huge deal.   Overall, a solid 4 stars. At DiBellas, you are getting a quality sub with great ingredients, fresh rolls and quick service! The service was the second best thing about my trip, because when you are in Market Square on an hour lunch break, fast service is a essential!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "XbjFeJpU8qkbxRk2DG2EFQ",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. The pulled pork w/ sweet baby rays!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XbjFeJpU8qkbxRk2DG2EFQ/o.jpg"
      },
      {
        "img_id": "Kfgsw5YuMFYyl0kp4GKzaA",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Kfgsw5YuMFYyl0kp4GKzaA/o.jpg"
      }
    ],
    "user_id": "wMC90PiyisLn7omSU7jMhg"
  },
  "orgaWT6cM0lKip3flZtK9w": {
    "date": "4/21/2019",
    "text": "How did I not know of this place before?! It's right on market square, next to chipotle. This is another great option if you want a little more homey subs besides Jimmy John's. I usually order the Philly cheesesteak or the meatball sandwich. It doesn't beat other cheesesteaks that I've had but it's pretty decent. Their subs are pretty big and the bread is delicious! There are plenty of seating in the back and the atmosphere is old school.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gmCK2ARSx22S_4_RQF9Jwg"
  },
  "q2CAZq38wr_Zwyum1e7FSw": {
    "date": "2/6/2019",
    "text": "DiBella's subs are tasty. The bread is excellent and ingredients are fresh. Sure sometimes there is a line if you go at popular times but I've been several times; their service is good.   On the downside, their Cheesesteak sandwich has *very* little meat. We've gotten the 'large' a couple of times and I think they don't put any more meat on there than the 'small.' When you open it up it's mostly bread with a few pieces here and there. It still tastes great, but with all the great Cheesesteaks around (esp Uncle Sam's) that are about the same price with significantly more meat, I don't think we're going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jubLqX74DKeTSyWQ5IMDtg",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. DeBellas menu, page 2 / list of sandwiches and prices.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jubLqX74DKeTSyWQ5IMDtg/o.jpg"
      },
      {
        "img_id": "beHu-vqW0D_4BM0NvDgWOw",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. DiBellas menu, page 1",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/beHu-vqW0D_4BM0NvDgWOw/o.jpg"
      }
    ],
    "user_id": "BKZACAs7UAUxg0jlZz-1xA"
  },
  "4fKiklCsIVMTQOgx7D4SqQ": {
    "date": "3/16/2019",
    "text": "Good philly cheese steak, its Saint Patty's day, no beer, 2/5...  Cheese steak fit in my pocket for leftovers 2 hours later. 4/5",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FeSyeIJNhNjV390Pi24BvA"
  },
  "LoJ8n26BSjDEm2Cx791ohw": {
    "date": "7/26/2018",
    "text": "We happened upon DiBella's while walking around Market Square.  OMG, it was the best sub I've ever had!  I got The Godfather which had capicola, salami, and spicy ham.  I got cheddar cheese, mayo, and oil.  I ordered a medium and it was huge; I could only eat half.  Their medium is a large where I'm from.  The bread was soft and obviously homemade.  My husband had The Dagwood which he loved, but he can't remember what meats were on there .  We got two huge subs, two bags of chips, and one soda for $20.82, so quite reasonably priced too.  The guy that took our order was very kind and helpful.  The restroom was clean.  I have absolutely zero complaints other than it will be a long time before I get to come back to Pittsburgh for one of these subs!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6ccbQo3ILfK4oltftqxuWg",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. The Godfather",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6ccbQo3ILfK4oltftqxuWg/o.jpg"
      },
      {
        "img_id": "iM1e_yIE2tmLwWy5ModrrQ",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. The Dagwood",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iM1e_yIE2tmLwWy5ModrrQ/o.jpg"
      }
    ],
    "user_id": "l-c_MiSlszEnth3qiGRg-g"
  },
  "2eF9xEW-pE-FADkRhsm33g": {
    "date": "7/4/2018",
    "text": "DiBella's Subs slays me. I rank the subs higher than subway and, dare I say it, better than Jimmy Johns. The sub variety is large and the quality is excellent. Everything tastes very fresh. Ordering can be a little overwhelming, but the employees realize that there are a lot of questions and are patient with their customers! It's all about the speed, freshness, and value when it comes to DiBella's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "krY0RTqlIjmbZAgncuDPaA",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/krY0RTqlIjmbZAgncuDPaA/o.jpg"
      }
    ],
    "user_id": "VdVb5Eipk1B5uupaC3J_0Q"
  },
  "oDOPUdvMi_tvppMJOFlUIA": {
    "date": "6/19/2019",
    "text": "I went there today with my nephew for the first time for us both.  I should say first and last time. It was disgusting. Bread was super bland. I wanted my sub cold it was cooked. Which isn't too bad if the bread actually got toasted which it didn't. I do not recommend this place",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ul3BevINewTswGvGuEjYSQ"
  },
  "gMw-vCbEYRo71sdfUOIl-Q": {
    "date": "8/7/2019",
    "text": "Yeah it's lunch time but it shouldn't take 30 min to get a sandwich. I enjoy their food but this is ridiculous. I have an order to have it on the app. And I have been in the store waiting for half an hour",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "orLLDmnEO7fd3QgLNUxPyw"
  },
  "hm5H9sybBQjdqYhw9ubeUw": {
    "date": "7/23/2018",
    "text": "Don't get trapped by the hype of Primanti Bros., go to DiBella's!!!!  Standard sub shot with AMAZING bread and the best Chicken Cheese Steak I have ever had!  I go out of my way to go to DiBella's whenever i am near Pittsburgh. The place is great and fairly priced for the area! They make the bread at the restaurant and it blows away any other sandwich in the area.   Suggestions:  - Chicken Cheese Steak - they use real cut up chicken breast, not shaved chicken.  - Italian - good oil and quality meats. - Avoid the regular Philly cheese steak if you are used to real Philly cheese steaks. Only sandwich I have ever been disappointed with.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "D9_2TAka66qKhXaGnzDceA"
  },
  "pPOF39JoA7DJYyfZ4siYtg": {
    "date": "3/30/2017",
    "text": "I have used DiBella Subs Catering countless times in the past.. and every time its a hit!   The sandwiches are always so fresh and always the buzz in the office. ,.. anyone who is not involved in the event or meeting has their fingers crossed there will be leftovers!!!   Today was unusual .. the left overs remained for the longest period of time.. 5 minutes.. ha !   The \"godfather\" is no doubt my favorite sub..  and paired with lays potato chips.. its a perfect match!!   Great sandwich shop!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "1GIVS73gtbquVlD7Wr8yDQ",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1GIVS73gtbquVlD7Wr8yDQ/o.jpg"
      },
      {
        "img_id": "3aCdYOcd557EsXMevHMINw",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3aCdYOcd557EsXMevHMINw/o.jpg"
      },
      {
        "img_id": "gYAIaK0vauF-xSeJNk4i6A",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gYAIaK0vauF-xSeJNk4i6A/o.jpg"
      }
    ],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "tFZ_wBlhfhL4iuz1c2selQ": {
    "date": "3/4/2018",
    "text": "Great spot in Market Square for submarine sandwiches.   They get five stars for the large servings at a reasonable price, the fresh ingredients, and the excellent quality multigrain hoagie roll.   I also like the large size and plentiful seating. If you go way back there's a little more private area away from the counter where you can sit. They have free WiFi that had a good signal.   There's a selection of about 10 specialty subs and also an option to build your own. I got the Uncle Louie, which had roast beef, turkey and ham. It was really good and they offer the standard toppings. They make the sandwich while you wait and you pick and choose the toppings you want.   They have macaroni, potato and pasta salads available for $1.79 but I passed since the sandwich was so big.   It's nice the place is open on Sunday. I'll definitely come again when I'm in downtown.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2SipUJUKoROrEvRCAA9zug",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. The Uncle Louie--roast beef, turkey and ham. Huge size for just $7.49.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2SipUJUKoROrEvRCAA9zug/o.jpg"
      }
    ],
    "user_id": "dz8CFWEWuR_4S1zlZhWCMQ"
  },
  "eu-LjwnZZDPJI3qpJanrUQ": {
    "date": "11/26/2018",
    "text": "You need to get a sub here. Lots of meat on the sandwich. Skip Subway you won't regret it. Great fresh sliced meats and bread. For $2.00 more you'll feel so much better that you stopped at DiBella's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zCNq4Bc8l-X-5kZsUBK7zA"
  },
  "2KSbVWrlC2tQCTJrA8AB_Q": {
    "date": "8/26/2017",
    "text": "Sometimes I think it's hard to differentiate sub shops - but DiBella's stood out to me! They had so many options and my classic Italian hoagie was EXCELLENT! be warned - a small is 7 inches so be prepared to go big when you order. They also have mediums & larges. It has a very quaint, old-time feel inside and beautiful outdoor seating right in the heart of market square. Match all that with kind & quick service and you have a perfect lunch spot in the burgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zbl-MD0_hSOOfk6hM9bVVg",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. Beautiful view of market square from their outdoor seating!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Zbl-MD0_hSOOfk6hM9bVVg/o.jpg"
      },
      {
        "img_id": "kJrugacLppMUUyL9lwX44Q",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. My Italian hoagie (this is a medium size)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kJrugacLppMUUyL9lwX44Q/o.jpg"
      },
      {
        "img_id": "BnZhboufjv0fi8DfzEz3gQ",
        "caption": "Photo of DiBella's Subs - Pittsburgh, PA, United States. Inside vibes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BnZhboufjv0fi8DfzEz3gQ/o.jpg"
      }
    ],
    "user_id": "LaiylSIbrA3aPvOYtl-J4A"
  }
}