{
  "WDjPW0iQm-CWDIQPWksr4w": {
    "date": "6/9/2009",
    "text": "Is it a Pittsburgh thing? Maybe so but that is no excuse for this crumby diner chain. The few times I have dined (if that's what you want to call it) at an E'nP I felt like committing Sepaku (Hari - Kiri). I never got sick from the food but more disgusted with myself for stooping to this level of gastronomy. Nothing really worthwhile on the menu (maybe a burger- how much can you mess that up?). My gut just tells me not to trust E 'N Ps.  No offense to truck drivers of America b/c they keep supplies on our selves but It  reminds me of a truck stop restaurant without the truck drivers. I always seem to migrate to the salad bar and get weirded out for having to deal with the utensils that pick up the salad. So I wind up washing my hands after getting my salad stuff. The waterfront  E 'N P is perhaps the cleanest one I have been to but that's not saying much b/c the patrons are kinda off. So an extra star for this location. But it's not like I would ever say to my friends in NY, SF, London or wherever...\"Hey when you come to Pittsburgh be sure to go to an E 'N P to get the flavor of the city\". Obviously this place appeals to a certain class of people of which I guess I can't be a part of as much as I want to be at times.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "bDGC2QHZ6t_is1olLGgoWg"
  },
  "STLFZpDGnwxpfjlCf8uV-w": {
    "date": "1/16/2011",
    "text": "This is the best location of the best restaurant in the world. I visit Eat'n Park every chance I get when I come from out of town. I regularly have cravings for this place even after moving out of state years ago.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Df9purkAY92E0-avW8Wdg"
  },
  "YgSK3GtRU7GWRanI-0r6XQ": {
    "date": "3/3/2014",
    "text": "Always good food at a fair price. It's not gourmet, but they have an amazing salad/ soup bar that would put most other places to shame. Great fresh food, friendly service, and desserts to go. Can't beat it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RjHL7LgjnTVreGEJCQxonw"
  },
  "uluOL1bT65w8LO7eBuMc6w": {
    "date": "6/21/2014",
    "text": "Food is decent. Service is always hit or miss. Great for a quick family breakfast. Buffett for kids is free with an adult. Boom.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QdeCNuivD_R7wnmMlCqIBg"
  },
  "HlR5gls61s8ALoAM4Xz9_A": {
    "date": "11/1/2014",
    "text": "God i hate eat n park. Only reason i have gone is for the salad bar because u cant find a decent salad bar in this city. Just about every entree iv had here is nothing more than rubbish, except maybe the cheesteak. Only go if u have little kids",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CR0D39AqYLrClEpLU31OkQ"
  },
  "ygf7EAvnEoXXT2y80PrYPA": {
    "date": "12/20/2013",
    "text": "When you go to an Eat 'N Park, you definitely do not get anything fancy. But I wanted just breakfast--bacon, eggs, toast, and tea. The waitress was nice and checked in with us periodically to see if we needed anything. The food tasted good. I did notice that the square and smiley-faced windows in the building might go out of architectural style soon, but they are interesting and cute to look at. On the way out, I waited in line to purchase smiley cookies. The line had only one person in front of me, but I waited for several minutes--too much time! Eventually I got my cookies, and I was out the door.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FW5F5QzzMoeRdIib1OyNOw"
  },
  "r-wfJfDq_AYP917yscrxOg": {
    "date": "10/8/2015",
    "text": "We had 20 people so we had our own room. The server Janee started off strong setting a tone for our meal that she would be organized and on point.  Unfortunately, that was the high point of this service.  We sat there for 20 minutes without drinks, in fact some meals started coming out and we still didn't have our beverages.  Half the table had Pepsi or Diet Pepsi, the other half had water and two people had dr. pepper.  I'm not sure why they couldn't just get pitchers.....I got the salad bar only, it was ok but it was messy so when you went to add items other items were mixed in which is kind of gross, I thought the chili was overly salty.  The other people we were with didn't have much good to say about their meals, with the exception of the angus burger.  Janee did stop and take a picture of our whole table which was nice and we were there three hours so she did earn her pay, but she set the expectation high that she knew what she was doing and it fell flat pretty fast.  I'm not sure it was all her fault as she didn't seem to have a staff that was working to support her, just catch her up as needed.  I think if you have 20 people at a table 2-3 staff members would make you more successful.  When we went to leave I bought a dozen of the sugar cookies.  The person at the counter didn't know how to ring them up and was quite rude when I asked for her to ring them up, like I was doing her a disservice by asking to purchase the restaurant's products.  That was my first time at Eat'n Park and I think I would prefer to just eat at Denny's next time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oJQ_uQSfjaoDCPTnBfW0uw"
  },
  "YdkkphY4sxtAzvOlS7h1PQ": {
    "date": "6/2/2011",
    "text": "If you must eat at Eat N Park, this is the one you want to go to. Why you ask? The corporate offices are right next door and the suits are there every day, breakfast lunch and dinner.   When I spend a few hours with dear old mom, she enjoyed spending a day at the Waterfront, she loved the since closed 39 center store, where she could buy her monthly greeting cards for 39 cents each. Then we drive over to this eat n park where she has her breakfast smile and I enjoy an egg beater sandwich and fresh fruit.  This place is spotless, the salad bar always looks fresh and the food is good, for a chain.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "UsmTxWbobLsI6WR1Db0W7A"
  },
  "wzA4ugiZXTpikj18bvixAQ": {
    "date": "1/1/2011",
    "text": "I went here around 12:30 AM on January 1, 2011, after New Years' Eve. They had a breakfast buffet laid out.  I'd barely gone to any Eat 'n Parks this past year because my local one (in Edgewood) is horrible, so I was pleasantly surprised that there was nothing wrong here. We were seated quickly, the waiter handled the beverage orders quickly, and the buffet was fine. No problems at all, except when the place got completely packed around 1 AM and we had a bit of trouble tracking down the waiter to get our check... That wasn't a big deal, though.  I can't justify giving more than 3 stars due to the fact that Eat 'n Park isn't exactly fine dining, but we got filling food for minimal hassle, so it was a good experience overall.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_fzKRINmPwtMkrpGfTMMQw",
        "caption": "Photo of Eat'n Park - Homestead, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_fzKRINmPwtMkrpGfTMMQw/o.jpg"
      }
    ],
    "user_id": "lv52Tt5labpxJELNZPCRCQ"
  },
  "1kB_nY0vBPTfnWcqgp7CBQ": {
    "date": "2/7/2013",
    "text": "Fow what it is this eat n park really is a lot better then i remember. I also really like and approve of them offering healthier lower calorie option that have some variety and taste good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B7aR8VlLMGzaJ7NHC-jeMQ"
  },
  "zaCKlo4CfcLSfgrMsoYByg": {
    "date": "7/2/2010",
    "text": "Ugh. I've always been an Eat n Park fan, but this place was awful. It was a Friday night and granted it was pretty busy, but gawwwwwd. It seemed like every single employee was around 16 years old. The service was very slow. We ordered an appetizer platter and cheese fries to split. Easy enough, right? Well they didn't fry anything long enough so it was soggy and all the breading was falling off everything. My drink was never refilled. Even worse, we noticed ants crawling all over the window sill next to us!  Half an hour later the server decides to ask \"You gettin' dessert?\" We ordered slices of pie to go. My \"slice\" of strawberry pie was two strawberries and a few crumbs of crust. We went up front to pay to find one lady at the register (who seemed to be the sole adult employee) counting her drawer and nobody else in sight. We stood there and evil eyed her for a few minutes and she finally took a break from her conversation to say someone would be with us. A few more minutes and finally the girl who was our server rings us up. I asked for a different, ACTUAL slice of pie, which she managed to get about five minutes later. Basically the whole experience was pure torture, which is disappointing.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "M9MXoSsb193m1g0QmmUYBQ"
  },
  "E59jqjfNfHFchZljpnCS_Q": {
    "date": "6/26/2013",
    "text": "Great location!  I love that you can substitute burger with a veggi patti and that they have gluten free bread.  Love love love the smiley cookies :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P3B7FfBpXERa-KdxwIGkHA"
  },
  "il2SeNbDHzdmieqltr3eEg": {
    "date": "10/14/2012",
    "text": "I like this Eat'n Park. Even though it is a chain, not all of them are created equal. The wait staff and kitchen staff really make a big difference in whether or not an Eat'n Park is worth patronizing.  Eating here, I change my mentality a bit. I always order the seven dollar BBQ burger with the salad bar add on for two dollars. In my mind, I always see myself ordering the seven dollar salad bar with a two dollar hamburger. When the salad bar is kept stocked, it has some really good and fresh items. I love that they have spinach and not just iceburg lettuce. I wish other Eat'n Parks were more like this one.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rnfgjemszUlQx6U_-PO63w"
  },
  "0CNwmM20k73HGk_BBPZ9bw": {
    "date": "5/4/2012",
    "text": "We don't have Eat N Park in Illinois, so when I first saw one, I remarked to my sweetheart, \"eat and park...doesn't it make more sense to park first, then eat?\" Yeah, I know, that's like a bad dad joke.   But anyway, to a foreigner like me, Eat N Park is awesome!    We only come here for brunch, and since I aint got no job and limited funds, it's pretty awesome to enjoy a brunch for two for under $20.  The unlimited house coffee is delicious, and I'm not even a big coffee drinker (more of a tea aficionado myself).   Another thing I dig about this place is even though they're very much a meat and potatoes diner, they're really good about accommodating vegetarian diets.  I like the Smiles.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Aqd30dnWlwN3Zs8bXDb4Zg"
  },
  "621gbtSLqTG-5jebxLLebg": {
    "date": "8/23/2015",
    "text": "Great service, Great server who did everything she can to get us what we needed, and a great price. The food was awesome and the salad bar was stocked with so much fresh fruit and vegetables.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JQdvs8hdpnkXLQUKPawgwg"
  },
  "tVukgNUtET7QoPmJdvMmnw": {
    "date": "5/24/2012",
    "text": "This company represents a honest and caring company that cares about their community.  They operate a variety of businesses and restaurants including the Eat n Park locations, the new Porch in Shenley, Six and Penn Kitchen, and the new upcoming Hello Bistro.  I cannot wait to try all of their dinning places.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7V29xzsIxlHfdcHsnpHB3Q"
  },
  "WdftYgh9sj2NzUSr_jYufA": {
    "date": "10/14/2014",
    "text": "People may complain that the food is not high quality or the place is a bit messy, but c'mon it is a diner!! I have been going to Eat N Park ever since I was a little kid living in Pittsburgh.  12 years ago I moved to NJ and now I go to school at Pitt and it is still one of my favorite restaurants.  Whenever my family comes to visit I do not want to go to some fancy high end restaurant, I always choose Eat n Park.  The nicest service, and greatest 'comfort food'.  They have one of the best salad bars, and I also love their fried zuchinni strips, and potato soap!!  Be sure to grab the cinnamon buns to go, as well as a smiley face cookie.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dExGhkCBdTpcEB75Cg_Cig"
  },
  "uy9yl2RIDXBfYdeRCkXtPQ": {
    "date": "6/15/2014",
    "text": "Eat n Park is usually decent.  This location though has HORRIBLY SLOW service.  Seriously, we never wait less than 10 minutes for a server to acknowledge us, and we live near the Waterfront, so we've given this location the benefit of the doubt numerous times.  Each time hoping that the last was just a fluke, new staff, or something.  It's not.  Doesn't matter what time we go.  It seems we are not acknowledged for several minutes, and then the service is mediocre at best.  Occasionally, we've had a stellar service, but it's few and far between.  Today, after waiting 15 minutes, then getting up to find a server in another section, we were informed that we were sitting in a \"closed\" section.  That server offered to serve us, but honestly, we left.  I told the hostess who seated us about the mixup, and got a blank stare.  I've never had this issue at any other EnP.  We left, drove to the Squirrel Hill location, and our orders were taken in the amount of time we wasted at the Waterfront.  Mgmt- you have a beautiful, prime location.  Get your hosts and servers on the same page!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J47vnFH99Bm9W_jDZDePPw"
  },
  "oL-ET4vECeI81exJi8lC7Q": {
    "date": "3/7/2011",
    "text": "Much like every other Eat 'n Park (3 or 4 stars worth of chain-diner food), except the last five times I've been here, the service has been damn, damn, daaaaaaaamn slow.  It's always fun to see the staff smoking out back while I've waited an hour for some scrambled eggs.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BWFF5dX7oE5F-IB8hc36Kg"
  },
  "ONKAiX2dhyb-jDegUXj4NA": {
    "date": "8/14/2006",
    "text": "Great waitstaff, very friendly and obliging.  They were missing an ingredient for some of the food I ordered so I had to change my order.  The food I did get was disappointing.  Bills itself as family dining and I suppose it's good for that.  The location at the waterfront is nice, especially if you sit outside.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-a9IN_IZSLphqDCq5r1DUw"
  },
  "_Y2gj2E8h9HREx_fdib67w": {
    "date": "1/8/2013",
    "text": "poor quality of food for the money; over priced, more of a college hangout than good food",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EX8qOAfAXh6wTc0agiRLMA"
  },
  "QMTBLfOsOXogHgBQVgVAnA": {
    "date": "10/10/2010",
    "text": "I love eat 'n park. Whenever I come to Pittsburgh, I go to this restaurant. This area is great in the waterfront. It's so peaceful here. Pittsburgh is a beautiful city. Eat n Park has the best pie. I wish we have this at home. Their banana cream pie and their strawberry pie are my family's favorite. Their food is better than IHOP. They are so cheap. You can get a slice of pie for $3.  They have a variety of everything and they are clean. Their cheese fries, milk shakes, and their breakfast menu are great. Not everything is great on the menu but they have everything you can think of in a diner and the best part is they are open 24 hrs a day. If you're hungry in the middle of the night, they have a midnight menu. I like this location better than the one at squirrel hill. The waitresses are nicer and the food is better. We stop here every time we are in town. They are not a fancy place but they have good cheap food. Try the food, you can't go wrong with the money you're paying.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QWSiTs6VS6BDraj-j9huAg"
  },
  "V2AQe0hrS3ZBzDV2NnGCvA": {
    "date": "11/25/2012",
    "text": "Definitely a 3 star type of place. Our experience was more like 2 stars though. The  food was exceptionally good. Better than I remembered it. What you order and end up getting looks exactly like the photo on the menu, in a good way (unlike Denny's where the menu looks WAY better than anything you will get from their kitchen.) Our server was acting very strange and really awkward. We felt that the service was very rushed and unfriendly. Protip: do not walk away from a table of people when they're talking to you. And walking ten steps backward while talking to us, not looking where you're going? Annoying and awkward. What would have been a 4 star experience was tainted by this guy's.....lack of experience, if you will. Meh. That aside, like I said, the food ROCKED. For the price, quality was pretty dang good and I don't say that often about diner-esque food.   I wanted to try their pie selection but the weird server assumed that just because I ordered off the low calorie menu that neither of us wanted dessert. Oh well. His loss (on tip.) Damn, that choco pie looked good. Mmmmmm. I may have eaten healthy for my entree but I am a fatty at heart. BRING ON TEH PIE!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "F3lu1icxJX5A5tCw-jVpTg"
  },
  "WqlpDKY4os86xTqooQc0KQ": {
    "date": "11/1/2016",
    "text": "We went about 9:30 10:00 @ night & I had the pot roast sandwich with a side of mashed potatoes and my roommate had the chicken parm with garlic bread and afterwards I had the hommade potato chips and my roommate had a chocolate milkshake. The roast beef was average @ best and the bread tasted oily but the gravy and mashed potatoes were good. The breading on the chicken was burnt and the chicken was rubbery & the garlic bread wasn't toasted. The homade potato chips were OK & my roommate asked for the milkshake to be extra thick & creamy & it was thin.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i4QWh-AKvUEPx6p1oHOj7w"
  },
  "80dHvKUqKhOIb-uHOjSV7A": {
    "date": "3/14/2015",
    "text": "Eat n Park is the place for smiles, but mine is kind of that emoji that has a squiggly line.  Thins I like about EnP: 1. You always know what you're getting. Standard across the board.  2.Pies great. Baked goods great.  3. Soup good.  4. Who doesn't love a Smiley cookie?  5. They are a charitable group and I think that's awesome.   Things that make me squiggly smile. I ordered the basic breakfast smile the other day. I asked to hold the toast and potatoes and swap a fruit cup. Get the less-than-half-cup of fruit and it's sub par. Yes, winter, but isn't their ideal to use what is in season? I can still find some sort of fruit in grocery store that's decent and you're a major chain! Find a supplier. What really was disappointing was that my server up-charged me 1.99 for less-than-half-cup. Now I have worked in the past for many years. Yes, some swaps do require an additional charge, but really? I just gave you back potatoes and toast for clear fruit. She did take it off, but I'm sure she was doing what is practice. So if I would have paid for that it would have been over 10 bucks for two eggs, two pieces of bacon (which is a buck a piece on up charge on friend's sandwich) and coffee and basically three bites of fruit.   Eat n Park is the place for squiggly smiles.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xp0KpZXUGC1FUFaQqlOLZg",
        "caption": "Photo of Eat'n Park - Homestead, PA, United States. Squiggly breakfast smile. See my sad fruit cup halfway on the right?",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xp0KpZXUGC1FUFaQqlOLZg/o.jpg"
      }
    ],
    "user_id": "UBUV0ElEvm8kgxZvcdDo2Q"
  },
  "eKL6PyUvjfWKZzgA2ho8HA": {
    "date": "10/20/2012",
    "text": "Yes, I know that it's cheap diner food, but c'mon... You have your corporate headquarters within walking distance and this is all you can serve up?   My husband and I were craving a late night snack after seeing a movie a couple weekends ago and decided to try this Eat 'N Park location for the first time. I had always been adequately satisfied at other locations so I thought this restaurant would be worth a try.  I ordered several items - Sweet Potato Fries with Apple Butter Dip, Hot Chocolate, and Pumpkin Creme Pie. I think my husband ordered some sort of burger or sandwich. Anyway, every item was problematic in some way. The fries were good, but the apple butter was oddly thick and sweet. The hot chocolate had \"creative\" chocolate syrup drizzling, that was running all down the cup and saucer. I had to carefully drink the beverage - which was OK - because I was afraid that I would get the syrup all over my hand, face, and clothes. The pumpkin creme pie looked like it was sliced by a 5 year old. It looked like it had been carelessly cut and plopped onto the plate, where it appeared very flat and unappetizing.  However, our waitress was the sweetest, middle-aged woman! Our food took a little time to get to our table (not too bad though) and she comped two of the items (I believe the Hot Chocolate and the pie) from our bill. She was very attentive and kind while we dined there, and I made sure that my husband gave her a good tip. If I remembered her name, I would definitely mention it in this review.  However, despite our kind service, I'm not planning on returning to this location any time soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cCke3VtFLtqgzkgYSrSE2g"
  },
  "by5YOgEHOFjO0URbonXoiA": {
    "date": "10/14/2013",
    "text": "Classic Eat 'N Park experience. I've been here 3 or 4 times and have always had great service.   I love the breakfast food, that's what I usually get. Waffles are amazing (better than IHOP) and they bring you hot syrup. Yum.   The soup is also AMAZING and the salad bar is really good. If I ever go for lunch, I always get the soup and salad bar. Always a good choice. I love their sandwiches and all the desserts are top notch.   If you need late night dessert options, their sundaes and milkshakes are so good. Get a sundae with some fries & gravy or with some fried zucchini! Yum!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "e-Gc4jYQdLOHX9iaDuYuCg"
  },
  "TF7DmWGl45CAfFAvoWcR7A": {
    "date": "5/23/2016",
    "text": "I love this place. You can have buffets, breakfast, lunch, and dinner. Awesome place. It's clean and the customer service is excellent. I will say they get busy and the wait can be dragging process, but overall they treat you with respect. The last time I was there I ate the seafood platter. It was a little dry, but the waitress was nice enough to bring more sauce. I never complain about the food because it is alway fresh. I do suggest it and would go there again and again!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-koA958o8tvYGa_4X7bcfw"
  },
  "jCKpUfD10ztZ--43riLEMw": {
    "date": "7/27/2014",
    "text": "I was in a jam and was meeting relatives for an impromptu breakfast.  This was not fast and easy HOWEVER- they did a great job making a slow experience by giving us free cookies and very nice service. My egg whites spinach omelette was excellent.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sOvwU7OPfMj11R6hfWm6SA"
  },
  "oFnaGIaljnbgLVEAqLrF6w": {
    "date": "6/2/2014",
    "text": "They make a nice breakfast for less than the tip form dinner the night before.  That's not bad!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SVEf1aVxFxyr639FvFCn_Q",
        "caption": "Photo of Eat'n Park - Homestead, PA, United States. Drive through pancakes. Nice to know I&amp;#39;m sharing the road with such people.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SVEf1aVxFxyr639FvFCn_Q/o.jpg"
      },
      {
        "img_id": "mVM2_BlgRMGW9myvp3goGQ",
        "caption": "Photo of Eat'n Park - Homestead, PA, United States. Fluffy pancakes.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mVM2_BlgRMGW9myvp3goGQ/o.jpg"
      },
      {
        "img_id": "VXIAer2iqxgpOVli9jMWoA",
        "caption": "Photo of Eat'n Park - Homestead, PA, United States. Coffee. The most important meal of the day.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VXIAer2iqxgpOVli9jMWoA/o.jpg"
      }
    ],
    "user_id": "Pkk8XaJP4WfxK3dWs8dnxg"
  },
  "bm7uju2Gf7qFdZdk41mmpw": {
    "date": "2/18/2016",
    "text": "Perhaps the crowd here is less harsh, because I feel like the location in Squirrel Hill has been consistently better despite having a slightly lower rating. I've only been here three times - twice on a Wednesday night around 5 and once on a Saturday at around noon. From looking at the other pictures, the food doesn't seem so bad, so I might have just been unlucky on the Wednesday evenings, because both times I've ordered, the food was completely unsatisfactory.  The first time, the sesame pork chop was tiny - definitely not worth nearly 10 dollars (I take SOME presentation into account as well, and the food just looked thrown together on the plate). But I had the great salad bar to make up for it, and managed to cram 6 plates of salad because I'm a college student trying to maximize my nutrient to price ratio. And on the plus side, the waiter, Kevin, was very friendly, and even comped my HUGE piece of pumpkin creme pie for no particular reason. I didn't mention anything about the pork chop because I was very satisfied with the salad bar, anyway.  The second time, I ordered the chicken broccoli alfredo, and it was absolutely disgusting. I could see oil droplets on the entire dish (and I understand that alfredo is a creamy, oily dish, but this was ridiculous), the chicken was slightly burnt, and there were THREE pieces of broccoli. In a dish called \"chicken and broccoli alfredo!\" Honestly, I've never sent back food because who knows how chefs would respond, but oh well. On the plus side, the waitress (Aly or Ally I think) was absolutely lovely. A lot of energy, smiles, and attentiveness, so of course, I tipped well.  The place was packed on Saturday at noon, but other than that I had no issues. I'm not sure who cuts the pies though (whether they're already sliced or the waiter/waitress does it quickly), because the carrot cake I had was considerably tinier than the pumpkin creme pie! Perhaps they'd anticipated not having enough?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k4rXLpIAZFNwxmgK2WcGxw"
  },
  "16sY9uwKpSGGX4EM5OwlSw": {
    "date": "3/27/2016",
    "text": "We come here alot but i think thats based on location and price. Food and service are hit and miss. I love the soup and salad as does my daughter and she is free which is great. You can get the meal w the soup and salad and bring the meal home from filling up on the bar.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bwN0e8qalV6-KUqbDptGGg"
  },
  "KhkBi4j-Dlu6kCRxd3vNlw": {
    "date": "1/2/2016",
    "text": "Good cheap food. Horrible service.  Had to wait 15 minutes before our waiter to even acknowledge us.  He then was really rude and never gave us napkins or forks. Our appetizers came out before our drinks. Didn't get any refills.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RrO4hm6rm1u8FwsX6kKK7g"
  },
  "WpCh9GZIZdH_bIVrux5CLA": {
    "date": "5/10/2016",
    "text": "My experience was subpar at best the hostess didnt even offer to take our coats.  Our table was terrible we sat in an hard cusioned like material which hurt my bottom and when the \"waitress\" offered us water it did not taste like it was bottled in spain like we asked for in the beginning. Our evening then became even more nightmarish than one could ever hope for. We asked for the fresh tilapia stuffed with creme freshe and the waiter looked at us like we were foreigners something. So we had to settle for chicken fingers. And when i went to the restroom to pass those horrendous monstrosities of mutated chicken there wasnt even one of those bathroom people there to offer me a towel and their colourful company. i had to end up toweling myself with a blow dryer. I still tipped the blow dryer by inserting silver dollars into those slots. Overall you will never see me there again and i will take my business to Applebee's.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5fFIp67_wEUa2E8Ku9auPQ"
  },
  "cI2IpbUIzyIZKc8XOoCOvQ": {
    "date": "2/15/2015",
    "text": "What I love about ENP (aside from the Smiley Face cookies) is they have different things on the menu you don't find at Bob Evans and Cracker Barrel like vitamin water, Eggs Benedict, omelettes, buffet, healthier options.  Service was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xxvz5g67eaCr3emnkY5M6w"
  },
  "PRzKuLHzBnjTh6Kr516YiQ": {
    "date": "6/30/2010",
    "text": "Eat 'n Park is Pittsburgh's version of IHOP.  Great food at cheap prices. Really good salads, sandwiches and burgers. Like Dave P. said, This is one of the better locations probably because it's right next to the headquarters.  Service has always been go at this location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "BjtJ3VkMOxV2Lan037AFuw"
  },
  "gIahvHgVupqi2IaLveTmhw": {
    "date": "12/4/2015",
    "text": "The waitress there are extremely rude .  On two occasions that I went there the same rudeness was there in 2 of the older wait staff.   Not sure what this is about..??  The first time a lady friend of mine did not order the Buffett and the watress tried to charge me..then proceeded to argue with me...lol..this morning.. another older last kept rolling her eyes at every quetion I had...lol...NEVER GO THERE AGAIN..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SEZPPipn9LoQKz1wtEtaRQ"
  },
  "9F0QFog5YBzY5qUJWu_eWA": {
    "date": "1/13/2016",
    "text": "Salad bar looked old. Dry food, mashed veggies, etc. The girl that usually does it had just come in. Ashley was our waitress...FANTASTIC SERVICE!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z0R7DtndK28RphnhvB94-g"
  },
  "aAt1JPfwtG5dEaU0tuuoLw": {
    "date": "3/17/2013",
    "text": "We had a really nice Sunday brunch here today. It exceeded my expectations which were admittedly very low. We needed some healthy food options for our 1.5 year old as well as enough comfort food to satisfy our starving and lazy weekend bellies.   There was a short 10 minute wait for a table at around noon but the hostess was nice enough and they gave us a big, clean booth with a partial view of the river. It took another 10-15 minutes to get service although our waiter did pop by to say he would be right with us. Another waitress took our order in the end and they comped us for one buffet. So the three of us ate for the price of one since kids five and under get a free buffet with a paying adult. ($7.99)  Ok enough about the service which was slowish but it's a full house at that time so understandable . The food:  The buffet was constantly refreshed and each container overflowing with hot food. My favorites: really well cooked fried chicken perfectly salted and complemented with Frank's red hot sauce. Biscuits and gravy, the biscuits were a little dry, mini peirogies, cooked baby carrots, really nice mini pancakes, stuffing, bacon, and ok-only home fries. It's too bad cos I generally judge a place by the quality of their breakfast potatoes but in this case the fried chicken more than made up for it. My husband had some decent salad and good clam chowda.  My kid ate everything on the other end of the buffet: cherry tomatoes, cottage cheese, cooked baby carrots, cantaloupe and honeydew melon, pineapple, bits of peirogie and chicken. The waiter gave him a shamrock sugar cookie at the end of the meal. We helped him eat most of it :)  There were a few misses: French toast were disappointingly dry and hard and the buttery/oniony noodles were undercooked. Other things looked good but we couldn't try it all: mini-waffles, mash potatoes and gravy, sausage patties, cheesey sauce, scrambled eggs. We'll just have to go again in a few weekends. Alright folks, don't need to run out and crowd it up but that fried chicken... Mmm mmm.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IvidCwnCMi9HCCbD9LpR3Q"
  },
  "7WJUBRFnoGIoPYWo-xF29A": {
    "date": "7/23/2016",
    "text": "So it was a typical family Sunday,we arrived at around 130ish,it wasn't crowded,but we waited for probably 3 mins before we got seated,this guy at the cashier who didn't want to show up for work gave us the menu and left,I asked if the breakfast buffet was available and he just shrugged his shoulders and said I think so. Our waitress came and took our orders,she was okay but minutes later,she advised us that someone is gonna take over our table and introduced us to another waitress,my daughter got a breakfast buffet so she was already eating, 40 mins later,our waitress came with my baked cod and my husband's sandwiches (I forgot the name),she told us that our appetizer was given to another customer so they have to make it again. What's the point of ordering an appetizer when it's being serve as a dessert so I told my husband to cancel it. Our food wasn't hot that means that it's been sitting in the kitchen and nobody cared. I was starving so I didn't bother complaining. Now my husband after 2 bites on his sandwich noticed a broken toothpick in his food. It was disgusting! We stopped eating,long story short,Brittany the mgr wasn't even apologetic told us that their kitchen is so busy and told us to take care of the bill and left. We didn't know what she meant but we thought she's Gonna bring us our bill so we can pay and left,so we waited again for 5 mins and we decided to go to the cashier and pay. Brittany actually decided that not letting us pay would compensate us. The experience was horrible,food was disgusting,customer service sucked. We came home and made our lunch at 4pm.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BTLCu5mAMiODuCQxw8nfCw"
  },
  "b_v1DcR6k1Iu8i_1Z4zfIQ": {
    "date": "8/26/2015",
    "text": "This has to be the worst restaurant at the waterfront. From the second I walked in the door no one acknowledged my sister or myself for at least five to ten minutes, which I thought was weird because they were not busy. The manager, who was standing close and talking to another employee looked briefly at us, didn't smile or welcome us, turned and continued her conversation. We finally get sat at a booth that the hostess sloppily wiped off, left crumbs all over the seat and left old trash sitting on the table. We sat in the booth for ten minutes waiting for someone to come wait on us before I finally decided enough was enough and left. My sister loves Eat n Park but every time I enter the waterfront store I'm severely disappointed.    I've been a manager and a cook at two very busy restaurants in Oakland for over six years so I know what I'm talking about. I have never let anyone stand in a doorway like that, I would wait on you myself until the waitress could get to you. It is appalling to see what that place has become. I will never go back to that place again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2mVetTHBJClG2RTqexlXUw"
  },
  "e-41qSk-vIW-KrjuF6uoyA": {
    "date": "5/19/2014",
    "text": "The food is usually pretty good, however the service is almost ALWAYS very VERY slow. Most of the staff are pretty friendly and sweet but there are a few sour ones in the bunch that make the experience not as nice as it could be. Although they still technically do their job, you can FEEL very negative vibes from them and see how inefficient they are with the way they do things. It's a hit and miss. Unless you know one of the servers and their schedules. The low rating is mainly for the slow service and the handful of staff members who aren't very pleasant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CwMi6wwtKES_6JVA4EC6Pg"
  },
  "-xvF3QA8QLVbuAPhzPNKVA": {
    "date": "3/18/2019",
    "text": "I had the displeasure of choosing the Eat'nPark at The Waterfront to dine last night.  Arriving at 4:50 we were seated by 5:00 p.m.  We placed our order within five minutes.  My lukewarm unflavored ice tea and my daughter's water arrived.  Not once did the server come back to our table to see if we needed refills.  After 45 minutes elapsed I asked the waitress when we would be receiving our food as we already waited 45 minutes.  She replied within 10 minutes.  Finally our order arrived and to no surprise it was not our order.  I handed the orders back to the server informing her it was the incorrect order, got up, put my coat on and went up to the cashier.  I paid the $2.24 for our drinks.  I asked to speak to a manager.  After waiting another 5 minutes a manager came out.  I told her what had happened and she asked where we were sitting and I showed her.  She said our orders were almost ready and did we want them to go.  I said no thank you.  She proceeded to go back into the kitchen.  We stood and waited 5 minutes and she never came back out.  We left.  Needless to say, Parkn'NeverEat should be the new name for this restaurant.  Horrendous.  I will never return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EGWYVcV8xw0tDXsc8KDYVg"
  },
  "ybtr126eOKNDEyA-Q2PyMg": {
    "date": "9/30/2017",
    "text": "Great place for a time out from the busy sight seeing around Pittsburgh's Organized labor history.  This place is great for family gatherings and groups, we were a group of about forty plus people and they accommodated a room in the back for us, great waiting stuff and great food at a very reasonable price. Shout out to the great USW Leadership Scholarship Program for finding this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "B05gFd26mFIbU0np7Nl2pg"
  },
  "l4gbBK8iojMH5EUFEvktkw": {
    "date": "11/22/2016",
    "text": "I've heard mixed reviews about this place. So many locals swear that they love it here and then a few others say it's terrible.   We came here on a Saturday night around 6:15 because we needed food in a pinch. They seated us around 6:30ish and it took till 7:05ish for our food to come out.   I ordered the chicken fajita flatbread. It was surprisingly pretty good. I enjoyed the chipotle sauce and the salsa on it. Their French fries weren't bad either. My friend got the buffalo chicken wrap and it said he wasn't impressed. My mom got the turkey sandwich topped with gravy and wasn't impressed either. My dad is a vegetarian and was very glad to see that they had a salad bar. The salad bar was pretty basic though.  The service was alright and they did their best to bring out the food as soon as they could. The restaurant is a little dirty and could be cleaner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ib3uXHSWeBed2kK-BKLGSw"
  },
  "LgqtPgg6k9N0qsagjhdzTQ": {
    "date": "4/23/2016",
    "text": "Every time I have come to this location I have been disappointed with the service, the food, the cleanliness and/or the wait. I don't understand how their HQ is next door and this location is such a step down from other locations.   This visit the salad bar was notably missing items, the soups at the salad bar were practically empty and watery. The restroom was dirty. The coffee was stale. And the steak salad ordered off the menu was browned head lettuce with \"steakums\" looking meat. Further, while I was at the salad bar, an employee and presumably a manager were discussing another employee who was always late and not able to effectively do his job and were also complaining about patrons not putting the serving spoons back in an upright position after use.   I don't think I will come back to this location. The location on Streets Run Rd and Clairton Blvd is the exact opposite of this location. I will take my business there.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "If8_cPRR32orCE_dMb94QA",
        "caption": "Photo of Eat'n Park - Homestead, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/If8_cPRR32orCE_dMb94QA/o.jpg"
      }
    ],
    "user_id": "Z3vmPWEMzvzvY-OPLnIMLg"
  },
  "p0PdY_qUO3zLjjiA_Ajo3w": {
    "date": "9/25/2017",
    "text": "I'm totally biased because I grew up around Pittsburgh and ate at Eat 'n Park all the time.  It's more than just a diner, it brings back all kinds of memories.  Now that I'm a \"diner connoisseur\" I have to say that the old E'nP still delivers. Is it the best food in the world?  No, of course not. But it hits the spot with eggs, bacon, flapjacks, black coffee, and a new breakfast buffet (did someone say unlimited bacon?).  Add a bunch of friendly waitstaff wearing Steelers and Pirates jerseys and I feel at home.  So, if you want your small-batch, farm-to-table, hand-crafted meal, there are plenty of other places to go in Pittsburgh.  But if you want a plain-old hearty breakfast with memories of eating at the counter with your dad after a Pirates game, go to Eat 'n Park.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bhKPTru9Av_lP5OfNMbc4A"
  },
  "eyhnqhMwLgccuxTf6degIw": {
    "date": "10/26/2018",
    "text": "Dry ass omelet.... period. Hash browns were dry and stale... wtf. Never coming back again. Period.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MgydhqUrQaD9NByAQQc8yA"
  },
  "Ol-V4wfYSc_S1TzqgpWoAQ": {
    "date": "5/13/2017",
    "text": "Horrible service. I do not want American cheese on my omelet. Your menu says your choice of cheese. The manager came out to argue with me about their poor service, I wasn't offered a refund. I had to wait forever. It had a slab of American cheese on it. I don't want my omelet tasting like a cheeseburger.   I think the only reason this place gets any business is because of the location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UF32lXb79D29HIk0BWdqWA"
  },
  "I0MIZBXuJvQQTUSbTX70Vw": {
    "date": "6/12/2018",
    "text": "The drive through is ridiculous. I ordered fifteen minutes before I arrive, paid, and am on my twenty fifth minute after that, and I'm still sitting here typing this review. I Would've done better to go home and make it myself",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "v8Hi4Sfbg4dbfgsXYXYsYg"
  },
  "VuuUTdrMax0kxkUVKrz2bA": {
    "date": "9/17/2015",
    "text": "From the last time I was here it was a complete one-eighty.  Our service was way above average, in fact our waitress was amazing.  She was attentive and even doted over my niece, it felt great to be welcomed and accommodated this time around.  This visit I was here with a bigger party than last time, but that didn't stop us from receiving some of the best service I have ever had at an ENP.  Food is standard, especially if you are like me and enjoy the salad bar.  It's not the hugest salad bar, but it has enough items on it to feel your stomach and then some.  Oh, and I rediscovered the grilled stickies.  O M G!  I forgot how much those ooey gooey grilled sticky buns of gold could be the perfect ending to a healthy meal. ;)",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "sqNOSvADoqg0jNf9cLf7Gw": {
    "date": "1/16/2017",
    "text": "Eat'n Park has an above average brunch buffet on Sundays from 11-2. They have a nice little variety to choose from on the buffet (Pancakes, waffles, bacon, sausage, scrambled eggs, pierogies, chicken, fruit, salad, soup, just to name a few.) The food is pretty average I'd say, but for 10 bucks, it's not a bad deal. I've always had good service every time I've been here.  I've definitely had better brunches before but for the convenience and the cheap price, I'd return in the future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wrsj5oMHsRzouMNuZlatbg"
  },
  "yFt3TVLWCSELdwsW9_uMQA": {
    "date": "1/14/2017",
    "text": "Fresh produce and ingredient game has come a long way. For a chain that offers consistency at an affordable price and a family friendly atmosphere, they hit the mark. And as far as service, these people HUSTLE! It'd be interesting to find out the numbers of tables and meals they turn over on a weekend shift!! Don't be fooled by the simplified menu, all kinds of options are available, they're happy to personalize your selections they cater to allergen/ dietary specifications.... Also a great late night spot! Some time just go to squirrel hill late night and watch ! Ha",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9cHwoFocl2YCsg9mg7MCw"
  },
  "Y0GAod_gu73-gnNH90sv6w": {
    "date": "8/21/2016",
    "text": "It's not often that I give five stars because of service, but our server, Lori D., earned this normally \"okay\" restaurant five stars.   The breakfast food was very good. Everything was hot and tasty, but again, the attentive and knowledgable server is what stood out.   Typically, I only come to Eat'n Park for coffee and dessert, but now I will definitely stop in for breakfast again. In Lori's section, of course.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "U2_JkG4zWzTxB81SJdV6_A"
  },
  "XrbuPFmSz7khaPEBr5kyug": {
    "date": "5/10/2016",
    "text": "I recently went into this Eat N Park and had a HORRIBLE experience. The food was sub par and the seating, if you want to call it that, made my butt hurt for weeks. I had a hard time sitting down right for almost a week and a half. How can a restaurant not have proper seating for its paying customers? I shouldn't have to eat this sub par food in a booth that feels like a home for grizzly bears.  Oh, and don't get me started when I asked for the wine list. I enjoy a nice glass of red wine when I indulge myself in an all you can eat buffet. Trying to eat \"fresh\" pineapple with no wine just breaks my heart.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "p_qHQn8jIpXVwKzb8nSL_A"
  },
  "yqZYq-kjmOFbgN43ggU2YA": {
    "date": "11/28/2014",
    "text": "This is an A-OK Eat n' Park.  The salad bar was fresh, but some items needed to be replenished (there was some left, but not much...).  Service was as expected - good.  I would go here again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yVMvS4Q7JTxHALm8CTwSZQ"
  },
  "P5buYqcCt83mcDHEY8pF0g": {
    "date": "8/27/2016",
    "text": "I used to love eating here. Good food and service and great salad bar - - BUT:  Last 4 visits, the service was VERY slow. Seating was SLOW, Server was SLOW to take order, food was really SLOW to come up.   Paying at register for pie was very SLOW.  And - they weren't busy!  It feels poorly managed and not well staffed.    This is no longer our go to lunch and dinner spot until they figure this out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rrCBdjD6pOGq9u6mUZRpXQ"
  },
  "ZifdBYlBAgTykDR4IWr2oA": {
    "date": "6/24/2017",
    "text": "We stopped for dinner on Monday, June 19, 2017.  We were seated around 5:45 and a friendly waitress took our drink and food orders.  At 6 pm we got our drinks, at 6:15 our side dishes were served and the friendly waitress said 'your food will be right out'......and then the long wait. At 7:00, our meals arrived.  Everything was cold, eggs, bacon, chicken wrap, fries, coffee!, my the bagel in my bagel sandwich was barely toasted, the Canadian bacon was cold and there was a slice of American cheese that had to just come out of the fridge, as it was also cold.   The dining area was dirty.  The only plus at this EnP is that the staff is pleasant.   This will be the last time we dine at EnP Homestead.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "btEbVHW6R0tLnK4khFM-yA"
  },
  "GwRmb7k7I20LE_gC3mOzpg": {
    "date": "5/26/2014",
    "text": "I thought this is a nice place to eat if you have a family. Lot of options, food was pretty good and cheap. Was satisfied with my meal, had fish with veggies(Years ago) and did tell others that this was a nice option.  Its not super gourmet, but it is a place you can grab a nice meal at a good price.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ry2eEdDFbB3jCd-puLq0bg"
  },
  "IujJfiDvYTE9qzufOduOOQ": {
    "date": "5/8/2013",
    "text": "Some how even though the food at this Eat'n Park is down right abominable, the smiles and laughter is always there.  How can I stay mad when the prices or so cheep? Myself my boyfriend and his nephew had lunch with milkshakes and me having a coffee it was $31.00  On this particular occasion the fire alarm went off and rang and rang and rang loud and long for over 15 minutes before the fire department got there realized they didn't have key to turn it off and than another 10 minutes later finally shut it off...only at Eatn' Park.  My baked potato was hard as a rock, I had ordered two pieces of baked cod and only received one.   The waitress was very sweet and attentive and really attempted to build a rapport with our lil nephew which I thought was sweet.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "_-u--VZN0fOOOWo-C2vY8g",
        "caption": "Photo of Eat'n Park - Homestead, PA, United States. Vanilla latte",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_-u--VZN0fOOOWo-C2vY8g/o.jpg"
      },
      {
        "img_id": "nXu-nfXTHP2F2zcNC0Z-hg",
        "caption": "Photo of Eat'n Park - Homestead, PA, United States. baked cod with a baked potato",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nXu-nfXTHP2F2zcNC0Z-hg/o.jpg"
      }
    ],
    "user_id": "V7uS5US4oTf-S9u36HJQCQ"
  },
  "tQcCIlZHk99TWIskIIpBAg": {
    "date": "1/15/2017",
    "text": "Breakfast was hot,  came cooked correctly,  waitress was great.   Standard chain breakfast stuff,  nothing to write home about.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mEye5eGR02eE8wd9WzXIPA"
  },
  "TfcAcR5cnGIFTPa7rcv-MQ": {
    "date": "1/25/2015",
    "text": "Eat 'n Park is one sneaky chain.   They like to create new items on their menus (at times only for specific locations) only to pull them away before I can craft a review.   For instance, an errand brought Kay and I to the Waterfront for brunch early one wet, dismal afternoon, and on the bill of fare were two dishes that apparently are no longer offered: The Hefty Ham Sandwich and The Caramel Apple Pancakes. The former was my entree, and the latter was dessert of course. Yinz know how I trundle.   The sandwich was a classic of economy and restraint.   I know you could make it at home, numb-butts, but it's always better when someone else does it. Besides, the Superburger's gettin' old, and taking risks at Eat 'n Park is like playing football in a mine field. We'll not discuss their meatloaf, please.   Narrow flaps of a juicy, full-bodied ham fit for an employer's X-Mas bonuses are carefully, artfully placed within a chewy toasted Bavarian pretzel bun. Broiled cheddar cheese tops it. Spicy brown mustard compliments (condiments?) it. I asked for mayo as well since it's essential to my being, and I'm quirky like that. Warm, dripping, elementary comforts were had.   Did Eat 'n Park do something to its cole slaw? It  has more...color now, and it tastes somewhat better than it used to (think tangy). Regardless, I chose it instead of fries since EnP's tend to underwhelm me.   On the flip side, I was overwhelmed by the Caramel Apple Pancakes, almost. I shirked the complimentary bacon (or sausage if you prefer) onto Kay so as to battle this beast uno en uno. Two signature EnP pancakes are topped with warm cinnamon apples, streusel, candied pecans, caramel.   If you have this as a main, you're on your way to join Wliford Brimley, cousin.   This was apple pie meets a cinnamon roll meets a bag of candy corn. The flapjacks were airier than a daytime talk show and frankly would have been dull with just syrup and butter coating them (I never order regular breakfast items at EnP). It was the humid fruit, the crunchy nuts, and the sinfully sugary white and brown icings that made this a treat, eclipsing anything on the dessert section f the card in a rare triumph.   For a chain, Eat 'n Park can be one helluva lark. Why do to you go to Denny's again? Tell me, real quick.  P.S. I have nothing bad to say about the service. Kay and I were treated professionally and not without a smile.  P.P.S. As I've mentioned in another EnP review, try the bearclaw if you're sick of having pies and sundaes (even if they are pretty good) after your meal. It will be served hot with butter slathered all over it. If you are to die that day...",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 11,
      "cool": 11
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "iPnRnt9BtsDu7HvqnIIX-A": {
    "date": "9/10/2019",
    "text": "Now it's not perfect, but the food is good --and this never fails -- the menu is diverse (vegetarian, vegan, gluten free, keto, all will be happy here!), and your wallet won't take a huge beating after you are done.   It's good for breakfast, lunch, dinner and late night. Great for groups or dining alone.   I docked a star for service (at this particular location)  because i haven't ever had great service here, last time we waited 20 minutes to pay and get boxes. We always had to request refills.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JyEUq446Ardyn9NbnG346Q",
        "caption": "Photo of Eat'n Park - Homestead, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JyEUq446Ardyn9NbnG346Q/o.jpg"
      },
      {
        "img_id": "gHUHKrxHCvPIM9PtC1_s_Q",
        "caption": "Photo of Eat'n Park - Homestead, PA, United States. River view",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gHUHKrxHCvPIM9PtC1_s_Q/o.jpg"
      }
    ],
    "user_id": "agQTCO7HM5nAKw2_i9MnaA"
  },
  "oH3sgpR0F14FLP9qLH4Vwg": {
    "date": "6/23/2019",
    "text": "As someone that has food allergies it's hard to be sure of what I can eat because they don't have an allergy menu/info sheet; however, they did reassure me that they would be careful.  Last time I was here I had the craziest experience and I haven't been back.  We came in at around 6 am, our waitress sat us next to the only other seated person. Everything was normal at first until the guy behind us kept talking to us, then started mentioning how he had to go kill some guy afterwards, he also started crying and talking about some kid he killed and how he deserved it. Me and my boyfriend were actually terrified.  I'm not saying I won't come back, but just a word of advice. If you are seating your second customer, please don't put them next to the ONLY other person in the restaurant. Very scary experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vf9xtHr09xXXFh24jvfrIA"
  },
  "IvRjh1Es3CxRTgakN5IOUQ": {
    "date": "4/30/2019",
    "text": "Poor service. No greeting when walking in even though there were three employees up front.  The sign said to seat yourself so I did. No one approached the table. Made eye contact with a few employees, nothing. Waited over 10 minutes and finally had to say something. No apology about the wait. Ordered my food. No plates at the salad bar. Soup was cold so that was extremely disappointing.  it was slow at this location so I'm not sure why no one could keep anything stocked. There were lots of employees there. I even over heard one asking where all the customers were but they couldn't even keep up with the ten people in at the moment. First time at this location. Not sure if I'd be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0pmQslaz5Jao70pInzO_jg"
  },
  "Ql6ohflHHwI74zN6ff01ew": {
    "date": "9/16/2019",
    "text": "My brother, who lives in London England, sent me notice that the Eat  N'Park at the waterfront had been completely renovated. I stopped there for dinner tonight Monday evening. First,  in the peak of tomato season they were out of tomatoes. When desert time rolled around they were out of pumpkin pie and apple pie. The lights were so bright I thought I was in the hospital operating room. Did not like the new renovations at all! It will do in a pinch but I have no plans to go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GnvxsIW6eJmTaHyykbw5kQ"
  },
  "gNmUDDLh-MTXtfeDtm4ICQ": {
    "date": "8/31/2019",
    "text": "We came here after a visit to Kennywood.  After 10 minutes our server had not yet come over, so I told the hostess and a few minutes later our server appeared.  She said she wasn't aware our table was in her section.  She took our order and 15 minutes  later, still wasn't back with our drinks. We requested a manger and in the meantime, she came back with the wrong drink order.  After that, we decided to leave, but wanted to talk to the manager first.  He wasn't much better.  He was in the kitchen and didn't come out for several minutes. Not a location I'd return to.  * I submitted my feedback via the Eat 'n Park comment form 10 days ago and have yet to hear from anyone.  Apparently they are still not interested in serving us.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KZa7mrxWUvA6C0iW-14b4w"
  },
  "nc-UgEGlRYwwXyJC7xR88g": {
    "date": "3/2/2019",
    "text": "I ate breakfast 4 days in a row here while I was on a business trip.  I had omelettes with sausage.  The omelettes were fluffy and had plenty of stuffing.  They gave you 3 sausage patties which is much better than 2.    The staff was quite friendly and provided quick service.  The coffee was good, and they refilled it often.  The bottom line is when I am traveling I like to find a dependable place for breakfast. Eat and Park meets the bill.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6jna5W1aqs4amKwBoCH2YQ"
  },
  "cnlyTW-0VokO5HI6sWSkNQ": {
    "date": "5/9/2018",
    "text": "I am not a huge Eat'n Park fan. It's nice because there is something for everyone. I have never had a great experience. BUT !!! I was so pleasantly surprised this morning.   The service was great ! Accommodating to a grandma and granddaughter!! I was so hungry for an omelette.   The new Sausage & Pepper Omelette was amazingly good ! I asked for sauce on the side so I could dip ! I am a dipper   My daughter enjoyed her Western and granddaughter loved the French Toast !   We will definitely return again when hungry for an omelette!!  We used the coupon for the free slice of Strawberry Pie - !!  Great dessert !!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3egcdazws_x1wW35jgXfNw"
  },
  "6ALliTw3BMAPm8VPSkgF2A": {
    "date": "7/1/2018",
    "text": "This was my first trip to eat'n park in a few years. We had a party of 7 so it took us just a little bit longer than usual to get seated. It still was a reasonable timeframe for 6pm of a Friday. We made the trip because they were giving away free Daniel Tiger books to each child. My daughter was more than pleased with that!  When we ordered, I was surprised to see you could choose the soup and salad bar as your side with an entree. I ordered that with the whale of a cod fish sandwich for 10.99. The fish was not bad but not the best. The kids meal we ordered was grilled chicken breast with a fruit bowl. Very nice size portion.  It would be nice to see eat'n park do more giveaways like this. If so, we will be back sooner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "HvDBT2whHCalPX7eWgmrqw"
  },
  "wwVSDFZBADxvWz0t-GxhSQ": {
    "date": "7/7/2018",
    "text": "When it comes to food you usually get what you want.  An egg white veggie omelette is my go to breakfast.  The potatoes are hit or miss.  We tell them well done and they still come out half cooked.  There is nothing worse than a half cooked potato.  Service is hit or miss as well.  Folks are nice but sometimes a little slow regardless of how busy they are.  Nothing that would make me want to stop going there.  Funny thing is that their motto is the \"place for smiles\" but the folks that work there are rarely smiling.  Not sure why.  At least the cookies have a smile on them.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VblVPsnCGff5a9MF6HGouQ"
  },
  "8D8rYhWXY7tCuJOrUVBdeA": {
    "date": "8/11/2019",
    "text": "We went on a Friday night.  We went there after our Kennywood trip it was 8:00pm. It took the waitresses 20 mintures to decide which one was going to wait on us. Then finally got a waitress.  The restaurant wasnt busy at all but had many waitresses.  We finally got one. We didnt get refill on our drinks. The food was horrible! My burger wasn't done and had a gummy texture to it and the fries were hard as a rock. The fries tasted like they were reheated. My daughter's burger was the same way.  We have ate at other Eat and Parks before but this was the worst experience I ever had.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2rAMETYUa0wGJH46h0BafQ"
  },
  "lzqCxzdk56R5Yf_7-9742w": {
    "date": "5/15/2018",
    "text": "My mother and I went to this eat n park and we both ordered chicken caesar salads to go. We sat and drank beverages (me a water and her a chocolate milk) while we waited for our food.   The restaurant was not busy but we ended up waiting over 40 minutes and realized we still haven't gotten our food. We went to the front of the restaurant to the counter because our waitress was nowhere in sight and said we've been waiting for 40 minutes and haven't seen our waitress since we got our drinks.   The girl went to the back to see what was taking so long. When she came back we were told that the waitress was currently in the kitchen preparing our food. We then proceeded to wait another 10 minutes while another waitress complained about us loud enough for my mother and I to hear. We walked out of the restaurant after waiting almost an hour for food we never received.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TeCu4zf1aPEPk96oReqpkQ"
  },
  "_zBPobj1QMVYILHglzUHVg": {
    "date": "3/30/2019",
    "text": "Maybe it was just a busy time.  Saturday afternoon but food came out sooooooo sloooooow.  Nice waitress but sooooo sloooooow.  Food was good.  Waffle sucked tho.  Don't think we are returning.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "goB1er9HHIYnOVfxGQNcmw"
  },
  "rLmx3K6um5fSgNl3ZAQ8KA": {
    "date": "8/23/2018",
    "text": "Is Eat N Park on someone's list of favorite restaurants? If so we need to talk ASAP. I'm convinced that as an adult Eat N Park isn't a place I set out to go but I end up here. Their breakfast is good, the people are friendly, and as an adult I still love a smiley cookie. How can you be unhappy with a smiley cookie? I'll wait! Also their salad bar is fresh. The desserts are heavenly but it's Eat N Park. If you've visited one all your life, you've seen them all. I do like the takeout option. It's always a good idea. I always recommend their waffles as they're huge. Eat N Park is synonymous with childhood memories, late night munchies, and affordable food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tekHDsd0fskYG3tqu4sHQw"
  },
  "n-GaJb6s2XsBNIRwyofEhw": {
    "date": "5/24/2018",
    "text": "I'm a creature of habit. I love the western omelette with potato pancakes and wheat toast. The service is always friendly and the price is right.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "pr8_C12oHakeNB4ZPp_dig"
  },
  "JJXP_eQItV_FgivoIQrcWQ": {
    "date": "6/9/2019",
    "text": "There was a fat obnoxious boy up front sitting people. He was very rude and didn't want to do his job and sit me and my family. He also seemed annoyed he had to do his job and told me he couldn't get me a booth. Then he walked away and wouldn't sit me at the table that was cleaned. Horrible service. Very rude people. I had to clean and move to a table myself!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OGcjfXaX_BuHCn7nLr0cBw"
  },
  "e8gpVt73YaC-SjaeS3gEpQ": {
    "date": "10/18/2017",
    "text": "I'll give this place 3.5 stars. The food is decent and I really like the breakfast buffet and the soup & salad bar. Customer service has always been mediocre. Sometimes you'll get a server who is really good and other times you won't. After being seated yesterday evening we had to wait 15 minutes for our waitress to come to our table. Twice she quickly walked by and said \"I'll be with you in a minute!\" At least give us glasses of water! When she finally came we asked if we could an apperizer on the house because of the inconvenience. She said, \"It's not within my power!\"  :0\\",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nEK083Ffx_jSj-9sIam2Hw",
        "caption": "Photo of Eat'n Park - Homestead, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nEK083Ffx_jSj-9sIam2Hw/o.jpg"
      },
      {
        "img_id": "54yDBMaKcZ3x07VFxCJRtg",
        "caption": "Photo of Eat'n Park - Homestead, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/54yDBMaKcZ3x07VFxCJRtg/o.jpg"
      },
      {
        "img_id": "T_yxSFzKKXYlyZfXu_1fUQ",
        "caption": "Photo of Eat'n Park - Homestead, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/T_yxSFzKKXYlyZfXu_1fUQ/o.jpg"
      }
    ],
    "user_id": "qQxRRzTT0U75A3mTVRh8xw"
  },
  "LcSW0iNZcSlSZ6kjXoKdwA": {
    "date": "3/2/2019",
    "text": "Just visited the corporate office Eat n Park in the Waterfront Homestead tonight at 8pm. We had to wait a few minutes for a booth for a family of 3. We then got to see how trashed the restaurant was...full tables of empty dirty plates..trash and food on the floor. We decided to leave and find somewhere else to go.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jZ4C04qVcYNVuLlHPiqMBg"
  },
  "MJnwNtGOyK68bH3zDptGOA": {
    "date": "3/24/2018",
    "text": "We have not been out to dinner in a while having 2 kids. We stopped for dinner tonight at EatnPark. We were seated within 5 minutes and that was great. As soon asker waitress came over we ordered our food. It took way too long to get our dinner. The philly steak sandwich was delicious. My buffalo chicken wrap was way too wet with sauce and ranch. So if you order it maybe ask for ranch on the side. My husband got the salad bar and chili was so good he got 2 cups. Then my son ordered the pancakes. He didn't complain but as I was cutting it the edges were hard. Not the worst but we have definitely had better service here. Our waitress was really nice so that was a plus.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8EAuJDTuy9foHWGvoyGxg"
  },
  "uXCFCGM5eHsCZrT5hoczuA": {
    "date": "4/22/2019",
    "text": "The food is reliable for all ages.  Well priced and exceptionally clean. Our server, \"Bibby \", was fantastic and went above and beyond to make it an excellent experience.  We had a toddler with ADHD and an autistic adult who were both treated with respect and sincere kindness.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gQMp1HNg4CAtoBlYe9MuXw"
  },
  "_-uHh-5KwEPnHhPPm83Ywg": {
    "date": "3/23/2019",
    "text": "Did not get my girlfriend water when she asked, never checked on us. No silver wear no napkins & the dumb bitch was just walking around. Is that good service? I think the fuck not",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vi8rOF3zBgTt0B9w_xUkJQ"
  }
}