{
  "i3937LOSUvvAEPNWIRkkpQ": {
    "date": "11/29/2014",
    "text": "Eh, I've had better, but it's decent.  Visiting Pittsburgh and a friend, we decided to stop by this Korean fried chicken place.  We were intrigued as we absolutely LOVE Korean fried chicken.  First, they have a wealth of bubble tea flavors. We got the thai iced bubble tea- it was alright. The boba was good, however, I'm pretty sure they use mix for their flavors. However, the tea itself was pretty good.  Next we ordered a medium of a mix of the sweet n spicy and the soy garlic sauce. They ran out of drumsticks that night (what), so all we got were wings. We had three people- and could barely finish a medium, so mind you, the portions are LARGE.  The sweet n spicy wasn't really spicy. And I felt like the wings weren't fried to what you  would normally expect in Korean fried chicken- it wasn't crispy enough, almost more soggy like. Eh. Plus, you had to pay for the radishes too! What! That's a side dish!  I thought it was neat though that they had these finger coverings so that your fingers didn't get dirty. Heh. Kind of awkward to use though.  Nice concept, but eh, I've had better Kfc. If you're ever in Ann Arbor, try Seoul Street- this place could definitely do a lot better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PrwnAL82LL4Ewt_wJpHWCA"
  },
  "hd1z9cv2rcBz_0SF_ldlpA": {
    "date": "3/31/2015",
    "text": "Love the tea but the chicken was everything.  We stopped in for teas then went back for chicken about a week later. The selection of tea flavors and \"bubbles\" is large enough to get a different combination every time, all delicious. You can even ask for \"less sweet\".   The chicken was expensive but well worth the cost. Coated in A sticky slightly spicy sauce that you will want to bathe in. This chicken is good! Its good warm and cold. Its expensive about $1 per wing section but you will not be sorry.  Also worth trying are the fries but the must try item is the Takoyaki. It is batter dipped octopus bites of wonderful. They also look really cool when you get them they appear to be moving. These are not to take home. They are not good cold and dont reheat well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2YVGKKcup6mjQmDQ6arEg"
  },
  "GttrycXAgkm0dsT5DnchLw": {
    "date": "4/10/2017",
    "text": "I absolutely love their Korean fried chicken. This is basically the only place I know that sells this and it's amazing. It takes a while for them to fry the chicken and I've stayed over 40 minutes waiting for it before on busy days. It's right next to Oishi and right across from fuku so it's pretty close in Oakland. I like both flavors of sauces for the chicken and I usually get a half and half mix of the two sauces for the chicken. I've only tried the dubboki once but I'd just say it's spicy and has no sweetness. It didn't really taste like dubboki to me cept the fact it had rice cakes in it. The boba milk tea tastes sort of powdery. I would stop by fuku for boba if you wanted it. But other than that, the chicken is the bomb.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AAtIcTb2kRy-6Gn1QzK5mw"
  },
  "3je9k5WC-b4QifbgRnw0aA": {
    "date": "8/23/2014",
    "text": "Yesss, so happy Korean fried chicken made its way to Pittsburgh when I did! I'm used to frequent artery-clogging Bonchon outings at home, and Chick'n Bubbly definitely lives up to my standard for KFC.   By the way, if you've never had Korean fried chicken... brace yourselves. It's a life-changing experience.   + Relatively short wait for chicken (especially compared to Bonchon) + Delicious, crispy soy garlic wings (didn't try the other flavor) + The five wings snack portion filled me right up + The wings themselves are pretty sizeable +/- Very sweet bubble teas from syrup. They're tasty, but I would love to have some fresh fruit smoothie options - Pretty much takeout only, since the seating space is very limited. On the bright side though, the wait times are fast enough to grab and go!  When that post-studying fatigue strikes, I definitely anticipate more cravings for KFC, and I'd happily come back here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DiGoYgNl13q6QvWmZ3kjAA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. snack size (5 wings) portion",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DiGoYgNl13q6QvWmZ3kjAA/o.jpg"
      }
    ],
    "user_id": "IhB3dvBjH5gWp__Ae1VxIw"
  },
  "6Dz2GpSsW1fKc4g8Lf7zZw": {
    "date": "5/17/2016",
    "text": "I like their bubble tea--it is mixed well, not overly sweet, and the tapioca is the right consistency, neither too tough nor too soft. They lose half a star for playing annoying music--they're far from alone in this fault though. Really small place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YE54kKTuqJJPNYWIKIpOEQ"
  },
  "kI3-W4KADQzQL6a7x7VA8Q": {
    "date": "2/15/2017",
    "text": "Great bubble tea! I would recommend the thai bubble tea, and my husband loves the strawberry one. There are many flavors and mixins to choose from and the service is always great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a3DQM1PQmRqP_E6CRr8oqQ"
  },
  "JTUHobwLpiWjCGl3SyWzkQ": {
    "date": "10/12/2014",
    "text": "Oh my god yes.   Best chicken I've ever had, but every time I go they always run out of wings! The prices aren't bad but they aren't cheap. The plus side is that you get a lot for what you pay.    My favorite so far is their soy garlic, their sweet and spicy chicken has way too much sauce and drowns out the flavor of the chicken.  Their bubble tea is amazing with a variety of different options to add to your tea from jelly to flavored bubbles.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BkMqpJikNc3r5itc-ui6ww"
  },
  "5PgWqLYRTrvbEzqG3qG36g": {
    "date": "11/1/2015",
    "text": "Best bubble tea in the city of Pittsburgh. Maybe tied for first place. It's a tough choice, but Chick'n Bubbly has jelly and bursty things in addition to the good old classic stuff. Oh, and they seal it into the cup with one of those heat-sealer things and you get to dramatically punch a hole through the lid with a pointy straw, so that's a bonus.  I'm a creature of habit, can't help it (got it from my parents). I've been ordering the same beef terriyaki bento bowl from their neighbor, Oishii Bento (owned by the same people), for like 8 years, so now when I'm waiting for that order, I mosey next door and buy a bubble tea. They'll even give you 50 cents off if you show them your Oishii receipt. It's pretty much the best lunch ever. I was over the moon when they brought bubble tea next door to my favorite restaurant in Oakland, so I'm really glad they actually made it good, too.  I can't say I've actually tried the chicken, but I've heard from good authority that it's great. And maybe I'll order it some day just so I can try out the awesome little finger condoms they have so you don't get your fingers all sticky.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDlPrFkMDXYqVzzjaerHSA"
  },
  "1Q07j5-Ehd7JSZcTPCT-2Q": {
    "date": "6/4/2015",
    "text": "Perfect! The most delicious bubble tea I have ever drunk. It's even better than original bubble tea from Gong cha, the most popular bubble tea brand in Taiwan. Fantastic!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hmAEYxDtYYcmJfDskyFjJw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. I missed you",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hmAEYxDtYYcmJfDskyFjJw/o.jpg"
      }
    ],
    "user_id": "od9yICvieykOzQv1vWYphQ"
  },
  "dCinSXtyxu8ghrwjaCHM-A": {
    "date": "6/24/2015",
    "text": "I really like this place! The wings are huge and actually worth the price which they charge. I wasn't expecting good Korean fried chicken in Pittsburgh so I was pleasantly surprised. I wish they weren't so sweet though!  And the bubble tea is pretty good (the best I found in Pittsburgh so far). My roommate claims this is her favorite even compared to the ones I had her try in New York. The quality is certainly there (though I prefer my New York haunts personally). The menu is above average in what I expect to pay but my roommate and I usually split an order of wings and also eat a meal at oiishi next door to get the receipt discount and visit chicken bubbly for dessert/wings.   The finger guards are a godsend. I'd be a complete mess without. (Eating wings is a messy ordeal) My only other complaint is the wait is quite long but the wings are super fresh and piping hot when you get them!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ObFg3cZX6wexRBlAXE_G7A"
  },
  "QDNCpbB3Uu_EH8M4GWOmQw": {
    "date": "1/14/2016",
    "text": "It's okay. Overpriced for the things they serve, although the chicken is decent. The way they seal the bubble tea is pretty neat! Perfect for when you're on the go and can spill it easily, like myself.   My biggest gripe is that they charge extra for the tapioca bubbles. If the bubble tea is more expensive than other stores, that's fine. Make the wholesale price greater. Don't charge extra for the tapioca bubbles if it's in the NAME. Make it more expensive and extra toppings will be extra. There's nothing wrong with that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z6-cjss7psd-Vb2h1josRA"
  },
  "iM7bQlkuiO5-SPSaJWlSvw": {
    "date": "4/4/2016",
    "text": "Stumbled on this place searching Yelp...and I'm so glad I did. My wife and I stopped in on our way to Phipps Conservatory and we'll be back. What'd we get for $25?  - Lunch special today including 5 chicken tenders, fries, and a drink - Small Snack pack of wings (Sweet n Spicy sauce) - Teokbokki - Mango Green Tea - Honey Green Tea  If you're at all familiar with Teokbokki, then you'll be disappointed. It's a simple version of the dish, what you'd expect from a small carryout place. It'll either scratch that itch or make it worse, if you've got a hankering. That, my friends, is the only thing remotely bad I have to say about this place.  The rest of it was EXCELLENT! Neither of us are fans of bubble tea but the green tea with added flavors were amazing. Clean, refreshing, nice way to mellow out the star of the show.  Which brings me to the chicken. Forget about Nashville hot chicken, especially since we're nowhere near Tennessee. The colonel needs to get on board with Korean spicy fried chicken! This was the best! Whether you get the bone-in traditional wings or the tenders, they're both made to order. They don't sit around under a heat lamp. Fresh and amazing taste. The sweet and spicy sauce is INCREDIBLE! Whether you get it on the side or slathered on, you will NOT be disappointed. Franchising opportunities, anyone?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sbAP2DgFreSqulpQ5E65GQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Sweet n Spicy Snack pack of Korean style chicken wings!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sbAP2DgFreSqulpQ5E65GQ/o.jpg"
      }
    ],
    "user_id": "E_bLXf-0QpPGKPuedzLIdw"
  },
  "zqDjTrT8Qhl3ruiwhCK2rg": {
    "date": "4/6/2015",
    "text": "Tasty food in Oakland! Now if it were only closer to the CMU end...  The husband and I were wandering around Oakland looking for dinner, and I remembered hearing good things about this place. The interior is super tiny but at 7pm on a Thursday night there were several seating options available (wall \"bar,\" traditional tables).  The bubble tea choices are almost endless, whereas the chicken options are quite simple--wing \"style\" and 2 sauce options. We wanted to try both, so we placed our order as 10 pc of each, and we were pleasantly surprised to be given the 20-piece \"discount\"--a lot of places won't let you mix flavors, so that was nice. The bubble tea was good, and it was fun to have some flavor choices for the boba. We downed it while we waited for the chicken--about 15 minutes.  We had asked for it \"spicy\" but instead of changing the sauce they put on it, they give you spicy sauce on the side. This would be fine except that the flavor profile of this was very similar to the sweet & spicy and thus clashed with the soy garlic. It would be nice if there would be a way to actually incorporate the spicy into the wings ahead of time.  I would be remiss if I didn't comment on what we affectionately termed \"finger condoms\" (I'm sure we're not the first). They had little sanitary dispensers of plastic gloves that were like thimbles for the inner three fingers of your hands, thus protecting you from making a mess. They don't save your face, though, and the large and saucy wings made me wishing for the more American wet naps. Still, if you didn't have time to wash your hands before eating, it presumably offers you some protection.  I'd love to see them offer more sauce flavors, but even with the limited choice I'm still likely to return...wet naps in hand!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ri4xmSrehzGEqbR1EWAhAw"
  },
  "LYUZQ0mk3KXg_RLA7rZZcQ": {
    "date": "4/22/2017",
    "text": "Awesome wings, fries and friendly service! Have gone back many times but we always do take out so i can't say much about eating in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "keoWQm1xld4mvvfrvBG1PQ"
  },
  "su5bqE_z-lXOTb8RuzXKsw": {
    "date": "9/16/2014",
    "text": "This place is really awesome!!!  Chicken is really tasty and special. It might take a time to get the chicken because they don't make the chicken before they get order. But it's worth to wait. Of course the taste is really fresh and juicy.      And they use real tea leaves for their bubble tea, so the bubble tea is really fresh and healthy.I know there are only few bubble tea stores that use real tea leaves. You can choose so many kind of topping for your bubble tea like Tapioca, Jelly, brust boba ..,etc.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iLNocHIT7KtkjL9Xup-abg",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. menus",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iLNocHIT7KtkjL9Xup-abg/o.jpg"
      },
      {
        "img_id": "xiaGD-cbedHh65UV_2pSHw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. menus",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xiaGD-cbedHh65UV_2pSHw/o.jpg"
      },
      {
        "img_id": "_7W27l988XeB-Xv2DVI8oQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Finger cap",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_7W27l988XeB-Xv2DVI8oQ/o.jpg"
      }
    ],
    "user_id": "XXIlKlo8gNtuicRrk8AnXQ"
  },
  "wSqCXMZorMxK9ZmeTs_3SQ": {
    "date": "3/22/2015",
    "text": "I never had Korean fried chicken before. Don't get me wrong, I've always been a huge fan of Korean food. But it was not until recently did I hear the phrase Korean Friend Chicken. Tried it with a friend who has been here before and loves the food. Ordering was easy, they don't have much but fried chicken, bubble tea of different flavors and some appetizers. We got takoyaki and a large portion of sweet and spicy fried chicken.  Takoyaki was good. If you haven't had it please google gif. files of how the thin fish flakes wave as heat convection occurs at surface of the \"octopus-meatball\". Looks nice and tastes even better. But the chicken was so special that it completely dominated over the appetizer. Perfect crispiness, good sauce and satisfying portion. We ordered a large portion - 15 wings and 9 drumsticks. The drumsticks were HUGE. But we almost finished it. Just give you a brief idea how good the chicken was.   Not a large restaurant, takes a while to get the fried chicken, and things can get messy when eating the chicken wings. They have the smart application of this three-finger-plastic \"glove\" you can put on, and it is effective in terms of not getting sauce all over your hand. Also rumors say that they have the best bubble tea in town.  Hope you will enjoy it as I did!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "49GlLnhi2d8YbbR6tzDFUQ"
  },
  "gnguNDY_Jb2EnZ_jrFgT8A": {
    "date": "8/12/2015",
    "text": "Best! Bubble! Tea! And the sweet and spicy chicken was amazing! I'd never had korean fried chicken before, but I have had a lot of other Korean food. The flavor reminded me of that, and is nostalgic for me this way. The music goes between what you can hear on the radio station and some kpop. Its a very cute little place with quick service and a good feeling.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DEx89W_MM8rRqdYRNSYn6w",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Finger guards to keep you clean while you eat some tasty finger foods!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DEx89W_MM8rRqdYRNSYn6w/o.jpg"
      },
      {
        "img_id": "RrrwKddKVez-AwyDH30HGg",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RrrwKddKVez-AwyDH30HGg/o.jpg"
      }
    ],
    "user_id": "57EAK5jxc921uGE8BfsiDQ"
  },
  "lKuHNMzEGx9_-j3kIeC5UQ": {
    "date": "7/3/2015",
    "text": "I always love coming here! The staff is so nice, and the drinks are always tasty! My favorite is the honeydew smoothie with strawberry bursting balls.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hWjkn2UwRlo5Lm3GbxC_ig",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hWjkn2UwRlo5Lm3GbxC_ig/o.jpg"
      }
    ],
    "user_id": "SQ_qmCRyeX6CMSf0TMf78Q"
  },
  "7r4LO38ICf5cts_QcAwSQw": {
    "date": "9/10/2014",
    "text": "I came here yesterday for lunch.  Having never tried Korean Fried Chicken (KFC) before, I was eager to try some KFC wings and drumsticks, esp. since I'm a fried chicken aficionado.  However, when I ordered (at 12:30pm), they told me they were out of drumsticks, so I was only able to order wings, which was disappointing.  I ordered the snack size, which comes with 6 wings, with soy garlic sauce, and I was told it'd be 15 min.  I don't often buy lunch in Oakland, but this seems like a long wait, esp. compared to other lunch places nearby, and I ended up waiting about that long.  Re: the wings, I found them quite crispy and delicious, and definitely worth trying.  I wasn't a huge fan of the soy garlic sauce, since it was pretty sweet (akin to sauces served at Americanized Chinese restaurants); next time, I think I'll get it on the side, if possible.  (Obviously, I can't comment on authenticity or compare, since this was my first time trying KFC.)  I also tried a sample of the taro bubble tea during the grand opening, and found it kind of bland, hence why I didn't order any.  I also found the prices a bit high--6 wings set me back $6.19 (w/ tax)--esp. given the inexpensiveness of other lunch options in the neighborhood.  Overall, I enjoyed the wings, and would recommend them to people who haven't tried KFC or are craving it (there aren't any alternative options in PGH).  However, this restaurant has some kinks to work out re: service and pricing that detracted from my experience.  I'd stop back in again, but I wouldn't necessarily go out of my way to do so.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "I_WV-KkxheB4j_f5XCMtMg": {
    "date": "10/2/2014",
    "text": "I miss bon chon and was so excited to check out this place. The wings are pretty meaty and enough sauce for me. I got the wings, 10 soy sauce garlic and 10 sweet & spicy. More sweet than spicy. They're just super cornstarchy or something that makes you feel full after 3 wings and the drumstick of the wings were dry. I always prefer the wing parts though. I did not like the radish. It was very watery making the radish mushy.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "RaSq7WPbxH7Dm5yfVBAgYw"
  },
  "-DI2E7vbxzt5-FW71GdGqw": {
    "date": "3/13/2018",
    "text": "Great chicken! I had a sweet and spicy chicken which was very flavorful. It might have been a little too saucy personally, but it was still good. It came pretty fast too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fRi0v0J9Xy5rDBmJo3wH3w",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fRi0v0J9Xy5rDBmJo3wH3w/o.jpg"
      }
    ],
    "user_id": "BZFnb8yf5gsyLEJKZlw84Q"
  },
  "cibHjjsQ1g9VhTtu5gaaaQ": {
    "date": "5/17/2016",
    "text": "Highly recommend calling in your order. 30 minutes since I placed my order. 10 of my 20 wings were ready about 10 minutes ago.   I'll post again after I eat 'em and let you know if it was worth the wait.  Ok I tried 'em.  YES they are worth the wait. These wings are flavorful and meaty. I tried both sauces and prefer the soy garlic sauce. Not to say the sweet and spicy isn't good. I'd definitely have them again next time I'm in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qqTCxEux5_K6lfsoKdleaA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Ummm, I&amp;#39;ll take their word these being good.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qqTCxEux5_K6lfsoKdleaA/o.jpg"
      }
    ],
    "user_id": "z-_5fKmPeB-g7t6GGBO9PA"
  },
  "JHf1_vXDy6vOEAUneoHM_w": {
    "date": "10/22/2015",
    "text": "Line was out the door. Service was a bit slow, but the workers were working hard to get the orders out to everyone in a prompt manner. I only swung by to get bubble tea, but the fried chicken smelled delicious! I think the best part about Chick'n Bubbly is their finger glove dispensers. It is ingenious! We didn't order chicken so we respected their request of not taking one - but I definitely want to try it out the next time I'm in town!   The drinks were great by the way! Milk tea on point- and they perfected my request of strawberry peach smoothie!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "0IfU-lE1AmaCXLrf_Ihk-A"
  },
  "v7ny-TNmieuvBcwAaVx24A": {
    "date": "8/4/2018",
    "text": "Having lived in NYC(Manhattan and Queens) for the past 20 years and just moved into Pittsburgh about a month ago, I've been really craving some Korean fried chicken. I've been to most of the fried chicken joints in Ktown from Manhattan(BBQ, Cheo ga jip, Bonchon, Turntable, etc.) and Bayside and I gotta say that this place actually stands its ground in comparison. The chicken was super crispy and pretty flavorful. We got sweet and spicy sauce on the side (which they gave us 2 giant cups of btw) but the only downside was the sauce was more Americanized. Also, the bubble tea here was great considering other places that are selling straight from powder bubble tea. I really liked the peach jasmine bubble tea and my husband's taro tea was really good and not excessively sweet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SWD1IJ66WSozR0bGucv56w"
  },
  "CwQYTqvj3FDsQ7EYnNELlw": {
    "date": "2/3/2018",
    "text": "I highly recommended this Korean Fried Chicken place! The food is delicious and the bubble tea is always amazing! It can take a while for the food to be done, so I recommend ordering in advance. There also isn't much seating, so you'll mostly likely want to get takeout.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ucjYMnPlJzMDRG74C8Ltng"
  },
  "WuVHpqf2DPhPFyAfgzUuwQ": {
    "date": "8/18/2018",
    "text": "I like this place!!!! I hope I can try more Korean food over here. The service is good as well",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AARW5kVV1l9GbPleG1OGTA"
  },
  "3PkbQJAn-dY-5QOTA9Pm0g": {
    "date": "7/26/2016",
    "text": "If you are a fan of fried chicken, you've gotta go here. Very simple menu but incredibly delicious!!! This is Korean style fried chicken, offered in wings or drumsticks with two sauce varieties, sweet & spicy or soy garlic. They have a few sides to pick from, such as French fries or gyoza dumplings. You will not leave hungry.  My favorite part is their selection of bubble tea! I've tried a bunch of the green teas and have loved all of them. A lot of places usually offer more milk tea options, so as a lactose-intolerant person, I really appreciate their selection of green tea flavors! I love the typical tapioca bubbles, but they have something called \"bursting bubbles\" which I love even more. Picture a tapioca pearl, but with a thin outside layer and liquid in the middle. They have a variety of flavors for those as well, but I think the strawberry is my favorite. Every time I am in Oakland, I stop here for a bubble tea!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "5IaHGddT0RLq1-S5LbP1iw"
  },
  "6fIKXEOm7S0Fxwir30QRJQ": {
    "date": "11/10/2016",
    "text": "I decided to try this place, because I heard people talk about it and I usually see people inside. Unfortunately, I won't be returning here. I tried the garlic soy sauce chicken which had good flavor, but I did not like the texture. I thought that I could rely on the fries, and yep that didn't happen. The fries were pretty bland. I did like the vibe of the place. It's small and intimate decorated in bright colors with K-Pop playing in the background. In short, the food just didn't tickle my fancy. I thought this place was pretty expensive before I even ate my food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UyXqGEKod-veD6m6Hq0EDw"
  },
  "0duR2eq_w5CCVW-p0TB2Ug": {
    "date": "9/27/2016",
    "text": "By far my favorite bubble tea place yet. I have tried bubble teas numerous places. Everyday noodles being the first place I decided to try it and I wasn't impressed at all. I refused to give up on them though and now I'm glad I didn't. I think what I like most about this place verses some of the others is the way you can customize it. A lot of restaurants you don't have many options so I don't always like what they have to offer. Chick'n Bubbly has many options to choose from though. Go get yourself a bubble tea asap!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-Y6tXYPYqeVy37-L5p0rMw"
  },
  "qZ3pQFAsWi1egFudLe0TGg": {
    "date": "1/18/2017",
    "text": "My second or third time here. The waiting time is a bit long like 15 min for a small drumstick with sweet and spicy sauce. I also had taro milk tea and french fries as sides. The sauce is light spicy which hits me right, but overpowering sweet, french fries a bit too salty. taro milk tea has as always too much tapioca that I cannot finish nor reach. The cashier is friendly. Two stars off for the mediocre chicken and fries and waiting time.  Lesson for myself, good milk tea, but no need of tapioca it's a waste, unless I really crave them.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zxDNmyPhnHtm6ZS7QSaf1A"
  },
  "nBBdpRStg-fanMrOIjttVA": {
    "date": "10/7/2015",
    "text": "This little place is truly easy to walk right past. The menu is limited to Korean style chicken wings and bubble tea. My friend and I both ordered the lunch special which you can only get from 11am-3pm. It consisted of 5 wings, choice of fries, small bubble tea.  The soy/garlic wings were my favorite as the other wing sauce is just a bit to sweet for my liking. Great tempura style fry so the wings are not greasy and are really light. Got the sweet potato fries and again - tempura style fry so they were fantastic!   They don't serve anything outside of wings and bubble tea. It would be nice if water was at least an option. The manager came up to us after the lady taking our order didn't understand what we were asking for (water) and he went next door and got a bottle for us. Great service on his part.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FHr7uFEjte9M0QQGIRYQcQ"
  },
  "40sY6SWBGKQBGZGJrpGsVg": {
    "date": "8/9/2015",
    "text": "Korean fried chicken coming to Oakland... times really are a'changin' in Pittsburgh!  I wish I could say it remotely measures up to anything bigger cities have to offer but... no :( Underwhelmed.   It's a shame, because the shop is very cute. Easy ordering instructions and options for drinks and chicken on 2 menus. A garage door in the summer, though the seating inside is pretty limited. And honestly, the chicken is not a bad deal. Either a combination of decently sized wings (drums and flats) or actual drumsticks  - or a mix of both - for decent prices.   But the sauces aren't great. The sweet/spicy is just sweet + sliiight afterburn. Not much of anything else besides sticky sweet - pass. The soy option is better, but strong on garlic, and there was something off about the overwhelming garlic that I didn't enjoy. The better of the two though. Overall, they lacked the aromatics and balance that makes korean fried chicken so addicting. And the batter... too much cornstarch? Because it's like unpleasantly crunchy instead of crispy.  I probably wouldn't eat here again, unless they changed things up a bit.  Tried a couple of bubble teas and they were pretty good, so it's definitely an option to keep in mind for a quick grab and go tea/smoothie place in Oakland. Nothing I would go out of the way for. If only the chicken were better...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "jXX-G_goCYZZrLSDY8qXdg"
  },
  "Qcjdrsc28XP6GmwC4kJIEg": {
    "date": "8/25/2017",
    "text": "Plain green bubble tea is really good, I'm diabetic so I asked for it to be \"almost not sweet at all\" and this is the first time someone has actually nailed it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "zhBhxbCIq5rMVpLEYvwaUA"
  },
  "9KHw273owSl-5PVNeQcLSQ": {
    "date": "9/5/2014",
    "text": "Chick'n Bubbly is the greatest gift to Oakland since P-Caf closed and was replaced with Winghart's. Chick'n Bubbly is Oakland's crowning achievement after the revitalization of Schenley Plaza (getting rid of unsuccessful food stands in favor of Waffalonia and Conflict Kitchen); it is the creme de la creme of Oakland Avenue's Asian Row; I can even forgive Oakland for letting Veracruz go under and Fez Grille close after accepting Chick'n Bubbly into my life.  Large pieces of twice-fried chicken, wings or drumsticks (or both), covered in your choice of sauce (you can get more spicy sauce on the side). A small is more than enough for lunch; I probably would have been better off with a \"snack\" size.  They also have a huge list of bubble teas and a few sides. I tried the pickled radishes, which were awesome. I want to go back and try the takoyaki (UPDATE: I went back to try the takoyaki, and it wasn't my thing. It might be your thing, because it wasn't bad; it just wasn't my thing).  The space is a bit small, so it might be worth grabbing your meal (and a few of the plastic finger-covers so you don't get too messy) and taking it all to go. I'm a fan!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "xhVlmdU1sPVH6GBJw6AZtQ"
  },
  "j1KqUS7zGQc-sFiG0uAapg": {
    "date": "2/11/2015",
    "text": "This was the first time I ever tried a Korean style chicken and I have to say I liked it!  The menu here is simple: chicken either spicy or sweet and bubbly tea.  And there are a ton of bubble tea flavors to choose from.  It's a filling meal and I didn't finish my order.  Here's what I struggled with - this is a messy meal.  You have to wear 'finger gloves' to eat it and you need to be real cognizant of your surroundings or you're going to be covered in sauce.   You can eat in but it is bar stool seating and not a lot of space.  They do have iPads you can play with while you're there - which can prove to be difficult while wearing your finger gloves.  But I suppose if you're just there to enjoy the bubbly tea it would work to your advantage.  Neat addition to the Oakland scene.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYTpi63Tv_UTjsaTMCZUvg"
  },
  "JHwlTAa9T3m8yofzxHM9Ag": {
    "date": "4/19/2018",
    "text": "I always try their mango milk tea. It's just so refreshing...it's different from the mango milk tea I have tried in Taiwan or Chinese restaurants. But I love both, but I like this one better lol...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x96AFFA6nQrlq3-mMTQZjQ"
  },
  "wz2DSKk6qtiaC1xXiHpSSA": {
    "date": "9/7/2015",
    "text": "I have a love-hate relationship with Chick'n Bubbly.   First let me say, do not order from Chick'n Bubbly if you are in any type of rush. A typical order takes anywhere from 15-20 minutes to cook. I have learned the hard way. I often get very antsy when waiting for my food, listening to Korean pop music.   In terms of drinks, I have only ever tried the lychee smoothie with popping boba. Having sat there waiting for my food on numerous occasions, the staff consistently and royally screw up drink orders.   The sweet and spicy wings are for sure my favorite as opposed to the soy garlic. Some people do not like how much sauce they coat the wings with but personally I love it. There is something so addicting about the flavor. Be sure to grab a set of the finger caps that are used in Korea as a means of keeping your hands clean while enjoying your wings. At times, I do not feel as if the chicken is cooked completely.   On one occasion, I got mild food poisoning from the chicken. I order on a weekly basis and knew the chicken wings didn't taste right, but I was so hungry that I just continued to eat. I ended up becoming quite sick immediately after eating, not being able to actually finish eating. I did not alert the restaurant because I do truly love this place deep down. I return on a weekly basis but I'm much more cautious.   On my most recent visit, I was delighted to see tteokbokki was added to the menu. However, I was disappointed with it. I probably will not order it again. Having tried tteokbokki at my restaurants, the fish smell was far too potent and the flavor was far too fishy. Maybe some like it as so, but I sure don't.   Like I said, this place does some things great but highly lacks in others.   An honest 3 stars, but 5 stars in my heart/stomach.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3iL9ARPP6m-la6Q_81V7kw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Exterior",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3iL9ARPP6m-la6Q_81V7kw/o.jpg"
      },
      {
        "img_id": "_Z9c_0Ns2NWoxslpnALMVQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Small sweet and spicy chicken wings/ Tteokbokki",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_Z9c_0Ns2NWoxslpnALMVQ/o.jpg"
      },
      {
        "img_id": "YvduJA004ICGvb1Lc4ghgg",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Lychee slushie with strawberry popping boba",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YvduJA004ICGvb1Lc4ghgg/o.jpg"
      }
    ],
    "user_id": "Pe5eoZvuQYif9-jPfrFSTQ"
  },
  "_28ZEb4Qcd7wflqRKTJQrA": {
    "date": "8/26/2016",
    "text": "Neat place for drinks/bingsoo! It's next to Oishii Bento, which has pretty decent Asian food carry out for cheap, and if you save the receipt you get 50 cents off your drink at Chick'n Bubbly.   I heard the chicken is really good but when we went, we were already pretty full and just got the tea and bingsoo. The drinks are a too sweet if you have the popping boba in, even if you ask for the tea to have no sweetener. Wouldn't recommend that. But the matcha bingsoo was pretty good considering Chick'n Bubbly doesn't specialize in it. I'd recommend you set the bar low for the bingsoo, it's not bad but it's not that good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-w7TWvKedW7rJtR2FXjCOQ"
  },
  "aVeg9wK6RDY2QjgqhZE3hA": {
    "date": "3/12/2016",
    "text": "There has always been a very distinct difference between Bon chon and wings. However, I didn't feel that way when I ate here. Maybe I set my bar too high when I came since I was imagining this place to taste like the Bon chon I had in NYC. But after trying it twice, I am relatively disappointed. The sauce itself taste decent, but the texture/flour they wrap around the wings are relatively thick. I expect Bon chon to be more crispy rather than soggy.... However, they do have awesome bubble to because you can make it more or less sweet based on your liking. I would definitely go back for some bubble tea, and probably skip the chicken for some oishi bento next door. Same owner, but the food between the two stores are so different.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "xpkdFgOVRX43fV0begAaOQ"
  },
  "XpzO9QIhx-43Y4nDPk9Veg": {
    "date": "9/25/2016",
    "text": "Good looking chicken wings but it tastes like the chicken meat and fried part are separate. Should be drier like the other regular K style fried chicken.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lGzJrXNUyTRhn9ZO0dj0nA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lGzJrXNUyTRhn9ZO0dj0nA/o.jpg"
      },
      {
        "img_id": "Ko7Txe8X55WkQgLx7HKluw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Medium chicken wings. There&amp;#39;s a lot in that box!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ko7Txe8X55WkQgLx7HKluw/o.jpg"
      }
    ],
    "user_id": "LP6rFL9eDVP_GUNAyZ78cg"
  },
  "8A1pMDNsOoUU3SwgZuwVqw": {
    "date": "9/17/2014",
    "text": "The only reason why this is getting four stars is because they have a limited menu. But if you are looking for some out of this world fried chicken you should go! Make sure you get a side of pickled radishes and Takoyaki!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A312_n0WHm80DFoZvdpgKA"
  },
  "cEVfhU6o14NspBX5-Ar5iQ": {
    "date": "8/11/2014",
    "text": "Very good food.  Crispy outside of the wing and tasty sauces.  Would come back again.  You can get regular buffalo sized wings or you can get the big chicken legs.  A milk tea with bubbles is a nice choice as well.  Great staff and customer service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SyTvX1rSDKHGMIbVNzHDHg"
  },
  "YgLp4scXjWU98_gl-hg2Gg": {
    "date": "10/5/2014",
    "text": "Finding good bubble tea in Pittsburgh is not easy, but this place does well with theirs. I like that they have the option of green tea jelly, it different. I just wish they had coffee jelly. They also sell Korean chicken, which I haven't tried. They just need more workers or blenders. One worker on the register and one making drinks to speed things along. Next time you're in Oakland try it out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uVNvbVgh4tz48NN3w38Njw"
  },
  "OblVcekAnfhSaov3Wnx75w": {
    "date": "9/30/2014",
    "text": "I tried going here a couple of different times. First was during their soft open, and they didn't have everything available. I left, so I could get the full experience in one visit.  I went back about 3 weeks ago to try the bubble tea. I was told it would take about 20 minutes for them to cook the tapioca. While I appreciate fresh made items, 20 minutes for a beverage is a little outrageous.  I went back today and asked if they were out of anything. They said no, so I ordered the Snack Wings & Drums with Soy Garlic Sauce, and a Thai Milk Tea with tapioca bubbles. She said that the bubbles would take 10 minutes, but I figured my chicken would take a few minutes anyway, so I went with it.  The chicken came out fast and looked great. Carmel brown pieces perfectly coated with sauce. Not too much, not too little. I picked one up and took a bite. It was cold. Not like \"this isn't hot enough,\" cold to the touch. They were fully cooked, but apparently had been sitting out unheated. Not safe. I asked if they were supposed to be served cold, and they said they would make me another.  The next batch came out hotter than the sun, but still perfectly cooked and sauced. The sauce was savory, but I would have liked a more pronounced garlic flavor. They were the crunchiest wings I've ever had. Very tasty and moist. Still quite good.  I'll say it...the finger condoms are weird. I wasn't going to use them, but when the guy brought out the chicken, he's like \"here...use these so your fingers don't get dirty.\" I obliged, but felt really dumb.  The bubble tea came out about 2 wings in. It's totally sealed on the top, with ice and bubbles inside. There's no indication of where you are supposed to put the straw, so I opted for near the side...big mistake. The cup top burst open and the cup itself split near the top, drenching me in Thai tea.   That being said, it was delicious, if not over priced, and ultimately a mess.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sVcD7x931EUab172kqZhVw"
  },
  "sBfyNf8nLauTIVJscUl-Yg": {
    "date": "12/21/2015",
    "text": "DISCLAIMER :This is primarily a bad review for the delivery company used through yelp on 12/19/15 and not the restaurant or their food. It would have been nice for the restaurant to try and rectify this but it was not their fault.   I ordered via yelp (eat24) around 7:10 pm. I got a call at 8:12 from the delivery man saying there was a problem with a different order coming out late so mine would be another 30-40 minutes. I paid more than $30 (with a 15% tip on top of the $4 delivery charge). Finally at 8:40 I called the restaurant and found that the delivery service still hadn't picked up the order. I asked if it had gotten cold and she affirmed that it had. They did not offer a resolution but told me that the transaction went through yelps system and they couldn't do anything on their end. This is not acceptable. I asked to cancel but there was nothing for her to cancel. The food had been prepared. I called the delivery guy back and said I wanted to cancel. He said he would call his customer service and try to cancel it. I repeatedly asked that he have them call me and confirm the cancellation. He, not sounding confident, said that he would have them call me with confirmation. It's now 11:30 and the charge is still pending. No call back. I will now email yelp for my refund. Hoping I don't have to dispute it.  UPDATE: I emailed Yelp and explained what happened. They returned my email on the next business day to let me know the refund has been processed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yOyFdmIBOnyipIXCJb51gQ"
  },
  "IWHqFUcMtu3BW9xhYUpGvg": {
    "date": "8/1/2015",
    "text": "Soy garlic chicken with a less sweet lychee bubble tea.  It was quite tasty.  Can't wait to return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fIzbpZgUQUcTIXDu2YVKhw"
  },
  "9ASAq-AS-MOGfvybkeFMDg": {
    "date": "9/15/2014",
    "text": "Too long of a wait for your food.  I was on my lunch hour and waited 25 minutes for food.  They need to speed up their food service for a to go restaurant.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wnt5ZmYiBH-RZYy8PIc7Dw"
  },
  "JNqGhYuquf463trOAxeYOw": {
    "date": "7/29/2014",
    "text": "The food was really good, and I will definitely be returning soon. I've heard how popular fried chicken is in Korea, and based on the chicken here I can see why that's the case. The batter is light and crispy, and the sauce is really tasty and applied liberally. The radish pickles, the typical side dish for Korean fried chicken, were a tasty new experience, and I was impressed by the all the bubble tea options. The staff was very friendly and attentive, and they seemed genuinely invested in ensuring that I had a good dining experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sD3tgJewE8jkvB6lBJ9aNg"
  },
  "gIRSOa8pvHp3wEA_Xmo2ew": {
    "date": "7/28/2015",
    "text": "Have visited twice.  Both times the fried chicken was prepared to order.  One of the top places to get fried chicken in the city.  If you like spice ask them to make the sauce spicier for you and they will accommodate.   Both the cucumber and radish pickles served with the chicken were excellent.  Will return whenever I am in oakland.   Have not had the bubble tea.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H36hAUrFI1vX90NOAXQffg"
  },
  "BaPi9nTZwipvIT_0JripwQ": {
    "date": "8/8/2014",
    "text": "I'm a huge boba or tapioca Pearl fan.  Since moving to Pittsburgh I haven't found a decent place. ... Until now.  The taro milk tea with tapioca pearls was awesome.  And almond smoothie was great.  I would recommend this place. The gentleman at the counter was very patient with me (I'm picky). The place is small but cute and clean.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NQECxoPtMo2cc2Fw7oD4aw"
  },
  "9JDJYoBs00dKH9yI9lTh4Q": {
    "date": "2/21/2017",
    "text": "I used to really love Chick'n Bubbly, but it's been a little inconsistent so I'm only going to give it three stars.   The chicken is wet sauce style and is generally pretty good. They also have plastic finger caps so you can avoid getting your hands dirty, genius! I think it also comes with free daikon so even out the spiciness and chicken flavor. The problem with this chicken is that it tastes great fresh, but if you take it home and put it in the microwave, it gets soggy and isn't as appetizing.   Then they came out with their tteokbokki and I was a huge fan of that. I started getting it over the chicken because it was cheap, had great portions, and tasted good. The tteokbokki was the right chewiness, and they put little pieces of lettuce and slices of fish cake in there as well. Unfortunately, they started raising the price, decreasing the portion, and overcooking the tteokbokki (it was so bloated). Getting this dish became a hit or miss, so I started just making my own.  I like the bubble tea, but I think it really depends on personal taste. It's definitely more milky than most places, but I like the way it tastes and the boba is pretty good. If you get a meal from Oishii Bento next door, you get 50 cents discount on the bubble tea here!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nj4PFafiPqA1PFj63rR9yg"
  },
  "8GL1u4O50IlY5BWW_6jrcw": {
    "date": "2/2/2017",
    "text": "A great Korean style fried chicken! Super crispy on the outside and moist inside. You can choose from two sauces, three different sizes I believe with different combination of wings and drumsticks. And very good bubble tea as well. The reason i am giving it four start is they only have two sauces to chose from and no dry fried wings neither. I hope they can bring more flavors to the menu!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SDu_vMhWyYet3Bh5Pt3MLQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SDu_vMhWyYet3Bh5Pt3MLQ/o.jpg"
      }
    ],
    "user_id": "pW_XkS9BfbnAQ_JMxNA-8w"
  },
  "-1FB0q4SX4i9WNMHanT_Bg": {
    "date": "1/1/2019",
    "text": "Love the chicken! Boba drinks are better than most places. I usually go for the taro or the milk tea. Either way, I love coming here especially during the summer and spring when they have the garage door up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rcl2d0TuITGwUeMO_JIl5g"
  },
  "TdWpR1QTvJGzcGB2GkCQXA": {
    "date": "6/1/2018",
    "text": "One of the wings bought today had a funky taste from chicken going bad.  Also, they are marketed as Korean fried chicken but they definitely are not. I have eaten Korean fried chicken countless times in Seoul so I know what I am talking about. Every time I visit I find they have drifted farther away into something unrecognizable. I do not taste any spices. Cost cutting measures? Change in ownership?  Whatever the reason, I really hope they up their game. They are giving Korean chicken a bad rep.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-UO978GjBK6wz0qZOtfwsw"
  },
  "jtf_YfwHWjZ6Bima9x9Wjw": {
    "date": "9/4/2016",
    "text": "They recently introduced several flavors of bingsoo, the Korean frozen dessert, probably for the summer but hopefully to stay for longer. Given that it is virtually nonexistent in Pgh AFAIK (save for Sumi's in Squirrel Hill), this is a nice option to have. Flavors range from matcha to mango to popping boba, and it's $6 for a medium-sized (but heavy!) cup. While I've always had it in a bowl in other cities, I guess a cup makes sense for takeout.  I tried the matcha, and I guess the only reason it was called that was because of the matcha ice cream on top. Below that was a variety of different sweet fillings and bites, with textures all over the place. Mochi, jellies, red bean, almonds, even a couple of pocky sticks. While bingsoo usually contains many of these ingredients, this is all really jam-packed, and much of the shaved ice had already been compressed into a blob by the time I got to it. So I would go as far as to compare it to a halo-halo (without the ube), rather than a traditional bingsoo.  It was also a bit sweet for me, but it's a fun item to get if you're feeling decadent once in a while.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rTsK_tTrJxxQ3PHjucPP1w",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Matcha bingsoo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rTsK_tTrJxxQ3PHjucPP1w/o.jpg"
      }
    ],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "EtJihZblmb_hUAUuHPyC-A": {
    "date": "10/21/2014",
    "text": "Fiance and i happened upon this place after finally finding parking. How did we get so lucky??  The restaurant is small with mostly bar seats and 2 tables. The fragrance of garlic-ky fried chicken countered the freezing rain that was beating down in front of their open-garage styled door. The cashier lady and the cooks in back greeted us with a smile and helped us tourists order a 20 piece meal and bubble tea!  Everything was delicious. Picked radishes complimented the greasy goodness of chicken. The only thing was that they gave us the radishes in these tiny plastic cups made for condiments. They had no problem with giving us as much as we asked for though! Happy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Aegj3R9b3xyA2XKnqUDlxg",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. &amp;#34;chick&amp;#39;n bubbly&amp;#34; is probably one of the most delicious restaurant names i&amp;#39;ve ever heard",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Aegj3R9b3xyA2XKnqUDlxg/o.jpg"
      }
    ],
    "user_id": "CF7D79y2G1FQGnpnnlIV4Q"
  },
  "o4MExT7msIMu_XeGcuf4uQ": {
    "date": "8/23/2017",
    "text": "Love this place!  They offer choice of tapioca OR jelly OR bursting pearls!!!  Friendly service and great value for the size- Large is massive (maybe 20 oz)-  for $4.05!   I've paid more than that for lesser quality and half the size!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ro6n3uyUJQT4Jk_2BxPf0g",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Lunch at chick&amp;#39;n bubbly!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ro6n3uyUJQT4Jk_2BxPf0g/o.jpg"
      },
      {
        "img_id": "eSFgL1uGmb0IrTZwXsgphA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Love that they still offer traditional tapioca!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eSFgL1uGmb0IrTZwXsgphA/o.jpg"
      }
    ],
    "user_id": "Q0FESf36rmp6g-A77bo1Tw"
  },
  "gZ6fJrTsiwNHWA8-h_GFhQ": {
    "date": "4/8/2018",
    "text": "Our group had bubble tea and we were all happy with the service, product and place.  It was reasonably priced and lots of choices were available.  Didn't try any other menu items but they look good and wouldn't hesitate to go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WBJO3cabgnBZh-IRvrlvmw"
  },
  "9tzYpSNTLN2_6-6vsvkxqw": {
    "date": "3/12/2017",
    "text": "Bubbly perfectly describes this little gem. My daughter craves taro bubble tea with the little chewy tapioca bubbles. Her cravings are met and battled victoriously by Chick'n Bubbly's creamy tea.  Living in Korea for almost 4 years I often crave Korean style chicken wings and ddeoppogki. My cravings are also won over by their superbly done chicken. The spicy/sweet sauce, the sticky yet crispy texture, and the meaty well cooked wings are slung at speeds one should predict for made to order food.  The place is small, yet moderately comfortable. The staff is always very friendly and may I say bubbly. Chick'n Bubbly gets me to come back multiple times a month and that alone should tell someone all they need to know.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "E8w6O_CXuluNeo4K1JMIbQ"
  },
  "a0fwctD52guAWNcZZv2tPw": {
    "date": "8/4/2014",
    "text": "KFC! Korean Fried Chicken hits Pittsburgh!  For some of you, these are going to be some of the best wings you have had...ever. This is KFC, double fried for crispyness and smothered in a glorious sauce, either sweet and spicy or soy garlic. These are not your typical bar hot wings: these are almost double the size, bursting with flavor. Cut the spiciness with some pickled radishes, and then go for some more.   chick'n and bubbly is currently in its soft opening, offering bubble tea and wings. Grand opening with be 8/25/14, where they will offer their full menu, including various katsus.   The space is small, only a few seats and tables, so for now, take out is your best bet.  I tried their black milk bubble tea- very, very good(if you see my previous reviews I love bubble tea). The tapioca pearls are sweet and chewy.  Is this like Bonchon or Kyochon, the famous KFC chains from Korea? Not exactly, but it is equally as good, and the wings are a bit bigger.   If you've never tried KFC, this is the place to do it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Q8LCAbEFv51abVrTWIooyA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Q8LCAbEFv51abVrTWIooyA/o.jpg"
      },
      {
        "img_id": "pq3O8HCcbVYEM350K0COJw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Sweet and spicy wings, pickled radishes and bubble tea!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pq3O8HCcbVYEM350K0COJw/o.jpg"
      }
    ],
    "user_id": "N7NnC6-q0O-Gq2n_7YJkNg"
  },
  "228ppbBVmufVDIVKb5zOog": {
    "date": "4/4/2016",
    "text": "Omg the chicken here is crazy good - crunchy and delicious plus they have these adorable little finger gloves so you don't get messy eating the delicious goodness.  It does take a little time to get your order but the food is worth it.  I've gotten the taro bubble tea - it's a little sweet so you should ask for it not to be so sweet and it will taste good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S_zQU7qN5NfTNeAa9jtqNA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Jelly shaved ice - sooo good - make sure to mix it up!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/S_zQU7qN5NfTNeAa9jtqNA/o.jpg"
      }
    ],
    "user_id": "hjk--8VuDX3479_atPJQ1g"
  },
  "LgJYXgIvpX0y2whMQxfhFg": {
    "date": "7/31/2016",
    "text": "Ordered soy garlic sauce wings & drumsticks, Thai milk tea with green tea jelly, and black milk tea with boba.   Their tea is not overly sweet & the jellies & boba are the right consistency and nicely flavored.   This is hands down probably one of the best Korean fried chicken places that I have eaten at. In terms of crispiness and flavor, it was Bonchon & Kyochon beat. It was not overly greasy, salty, or sour & the double fried crispiness was so satisfying to bite into.   Additionally those \"finger condoms\" for eating the chicken is an ingenious idea. I really hope that other fried chicken/finger food establishments pick this up as well.   Service was very courteous and friendly. It might take a bit of time for your order to be ready since the chicken is double fried, but it is definitely worth the wait!  My only con is that I wish they had boneless nuggets or tenders to order.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T6fk18hJADtrVTRoqBKd1Q"
  },
  "tkYHVFTuRH6jMMzVS4TMEg": {
    "date": "10/18/2018",
    "text": "They have the most crispy, non-greasy chicken in the city! They have a variety of selections of chicken and bubble teas. I also recommend the Bingsu (Korean shaved ice). They have green tea, mango and even Oreo bingsu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "30mWDTIYgYw_cM8_mlj5PA"
  },
  "wUIHy5rqFV4-MXOr56EBeA": {
    "date": "3/23/2017",
    "text": "Chick'n Bubbly has decent fried chicken and bubble tea, but I have had pretty inconsistent experiences here in the last year. Most recently, they were out of drumsticks and \"have been for a few months\" which seems like a big risk for a Korean fried chicken joint. Trying to keep an open mind and ignore the attitude from the cashier, we ordered the fries and medium wings in spicy sauce. It hit the spot, but it's just not as good as it was before and the customer service was absolutely awful, or rather, lacking. The girl stared at us the entire time we ate, letting us know that we were a huge inconvenience to her. It was not a great experience.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OQBMu7x0V4Oz3iFv3x0i5Q"
  },
  "JfbFVHQGkDkIJrkLFH-8QQ": {
    "date": "3/22/2017",
    "text": "Pricey but the chicken and bubble tea is oh-so delicious. They were out of drumsticks the day we visited (and when they only offer wings and drumsticks, that limits the menu even more) but the chicken was crispy and flavorful. The bubble tea flavors and boba options were extensive so it was hard to choose. We were a group of 6 which had to break up to sit at the bar and around the 3 person table but it was still a fun experience.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Eedrz1bElHAZJEIZwu3Rmg"
  },
  "wpoZIvulSRPf5UPjuCGiRQ": {
    "date": "6/3/2017",
    "text": "The Korean fried chicken are so delicious, however, they're pretty pricey. They could get away with it since they're the only place selling KFC in PGH. They recently started selling bingsoo, mmmm in a big fan and it is perfect for those hot summer days! But again the price is higher than what I'll normally pay. I'll definitely come more often if the price is lower. Overall, the food here is phenomenal, price is high for these Asian street food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X0ThBT2nXkeEFzd7RSuy6Q"
  },
  "gnjBCW8nOFLaiZ2t4jMojw": {
    "date": "8/17/2017",
    "text": "Food and tea is really good! Girl at front was kinda grumpy but doesn't  change the taste of the food! Try this place out if you can!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FM8eNKAdYlugS3TFOFoeEA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Small place but it&amp;#39;s really nice!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FM8eNKAdYlugS3TFOFoeEA/o.jpg"
      }
    ],
    "user_id": "OZk6ZBqWLpXAqyHotXb3aQ"
  },
  "djPnNT3vKpVYGfYEJvAHmg": {
    "date": "11/9/2015",
    "text": "The first time I went here I got the milk bubble tea (100% sugar)  I had no idea that they did reduced sugar. It was so. Sweet.   Now I go to oshii bento and while I'm waiting for my lunch, I stop next door (here) and get $1 off bubble tea!! With 30% sugar (milk tea) , it is amazing! The bubbles are delicious too  Actually. UPDATE  Now even if I go to oishii, I go to Fuku Tea (Literally you walk straight down across the street and it's right there. You can see it from oishii) Sorry. Fuku Tea has replaced oishii for me.  (Fuku has really sweet bubbles to I usually get 0% sweetness? That's just me tho)",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "42aIqqLHAJeQRMVwZKcFdA"
  },
  "b9sh4OgXrpApG2p2848Tow": {
    "date": "11/22/2015",
    "text": "It's a small, cramped place with a limited menu...what they serve is in their name, but their chicken is great! I didn't get the chance to try the bubble tea, but I'm kind of turned off by the fact that they charge extra for boba beads.   The chicken though is phenomenal. It is definitely worth all the hype. Their snack size of 5 wings is enough to fill me up for lunch. The wings were meaty and lightly breaded to obtain this beautiful crisp on the outside. The meat was sooooooo moist and probably one of the best I have ever tried. I wish they had more flavors though because I did not like the sweet and spicy, it's way too sweet and intense. The soy garlic is delicious! I had to dock a star off because their fries aren't that great. It was way too salty and undercooked. McDonalds has better fries.   So in conclusion, the chicken was awesome, but the fries were not. If you are a wings connoisseur, definitely check this little place out. The Koreans do know how to fry chicken just right!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "H_09-Wr5JcN5hpp5RnSLTA"
  },
  "yjsD0Rv_1JKHqxtcyjNXXA": {
    "date": "12/5/2017",
    "text": "The actual food is pretty decent, the bubble tea is average, and the chicken is pretty delicious. However, while my friend and I were waiting for our order one day, we witnessed the waiter touch the phone and cash register/cash, before making a drink for another customer. He was adding stuff to the blender, and then noticed that there was a piece of something in there that wasn't supposed to be in there. Without washing his hands or putting on gloves, he then reached into the blender pitcher with his bare hands and took that something out, before proceeding to blend the beverage and serve it to another customer. Maybe I'm a germaphobe, but that incident did not make me want to order another beverage from them again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SEqIhF4lmVUrbYKTdndv1g"
  },
  "hcAHloHDGiKZUb-QVrX7VQ": {
    "date": "4/30/2019",
    "text": "The first thing I want to say is that the food is good, the one star is not for the food but the service I had the day I am posting the review.  I've been to this restaurant several times as I love their chicken and tea and even get the occasional takoyaki. I am always treated well by the staff but tonight, there was a young girl there that had an attitude problem. She had no patience when trying to take my order and was quick to snap at my boyfriend when he tried to order something that they were out of. I worked food service, I get it but there is saying something and just acting like customers are a hindrance. It really ruins the experience. Unfortunately, after being treated like we should be serving HER, I will not be returning here to eat. This girl should not be working there and it's a shame she ruined such good chicken!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HEcQJkEhFF3nTXhs_g7KmA"
  },
  "zVcS9vRQT7VqBo9vQoUQ4Q": {
    "date": "7/15/2019",
    "text": "So, we walk in and the guy seems upset we came in. My wife asks a simple question and he acts like she commited a mortal sin. The guy and his friends then have a conversation in a language we cant understand, laughing and looking our direction. The whole time Im saying please and thank you, smiling etc....polite as possible. Hes still upset with me, for an unknown reason. I gave a tip and left the store. Im telling myself, dont take it personal, hes having a bad day. Im then drinking my slushy and become convinced they added 3-4 times the recommended amount of artificial garbage powder they use. I drank half of it, and ended up with a potent stomach ache. Terrible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BE--Qqh1XgGfAYC-gUbQHg"
  },
  "1XSsVTqLP-OuIFZBMYP-dQ": {
    "date": "10/22/2018",
    "text": "Small passion fruit smoothie with mango bubble bursts. Large passion fruit milk tea with strawberry bubble bursts. I love that this place has the bursting bubbles!! Hate to say it but it might be better than Fuku Tea. And it has food! I wish more food but still a nice little selection of chicken. It's also a small place so there's not much seat. Took a star off because their chicken isn't that good, in my opinion.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RxjwR05MzYpWoQ6jctk4gw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RxjwR05MzYpWoQ6jctk4gw/o.jpg"
      }
    ],
    "user_id": "-kfgS_ghCvdTYCwoUShlPg"
  },
  "ZcKqA_sLiLPWXgpmI5SZug": {
    "date": "12/5/2017",
    "text": "I was kind of skeptical of this place because of the logo. I ordered a snack box - with sweet and spicy sauce. The sauce wasn't very spicy, but the wings were crispy. I found them to be delicious. Very nice flavor and cooked perfectly. I loved the rice flour addition to the wings for the extra crisp. I would definitely go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3d4fac-e3Plyib8QUEmHNg"
  },
  "zNpPrsgo7m70NkQnMNfUpg": {
    "date": "8/7/2018",
    "text": "Passion fruit smoothie is my favorite drink. The shaved ice does not totally look like Korean style but it tastes good and will be better if you mix. The squid ball-takoyaki is yummy. The chicken nuggets in sweet and sour sauce are alright. Overall, it's a nice place to have Asian snacks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6F_qu1ImIjraM85ZmUH0nA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6F_qu1ImIjraM85ZmUH0nA/o.jpg"
      }
    ],
    "user_id": "qGzcK-RojZgc_l7CJlQp3Q"
  },
  "jkKlQ1Z1cCyw210tL37rGw": {
    "date": "6/19/2018",
    "text": "My favorite place to get bubble tea in the city! Also the fried chicken is absolutely bomb. Flavor profile is on point! I usually get a medium portion and split them into spicy soy garlic and sweet and spicy. Sweet n spicy is a little too rich on its own, so combining it with the drier spicy soy garlic is a good complement. People have mentioned that the menu is small but the perks of that is that they do a few things and do it well!   Chicken takes a while to make, but that's fine because you'll get it hot and super fresh. I have also tried the takoyaki here - it's decent. For the price you get quite a large portion of takoyaki balls.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w3Ic5JV-v5CiC3ecdHC5cA"
  },
  "YwPOMIliCQek7RG7wVSVVA": {
    "date": "7/7/2016",
    "text": "Got the milk tea with tapioca, which was pretty good.  Only complaint was the price (almost $5).  Also had to try the chicken wings.  I got the sweet and spicy and they were surprisingly good.  They do take a while to cook though.  I think I waited 15-20 minutes, but at least they were hot and fresh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "STTHqXrjUueRVi58OQ60wA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Chicken + tea",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/STTHqXrjUueRVi58OQ60wA/o.jpg"
      },
      {
        "img_id": "g3CKtyOTP7lWiPuSPMHzvg",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Milk tea!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/g3CKtyOTP7lWiPuSPMHzvg/o.jpg"
      },
      {
        "img_id": "ss22o-tleKVZSW57P3WjlQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ss22o-tleKVZSW57P3WjlQ/o.jpg"
      }
    ],
    "user_id": "0xYHrm3Eq2jt4Yc4wT4TsQ"
  },
  "Xu1PFz3iT6fke_EPKNFyCw": {
    "date": "10/26/2017",
    "text": "Service: Took longer than I expected for the food to be ready (probably 10-15minutes)   Employees: Friendly and helpful  Menu: Not a large selection... also a bunch of the specialty menu items were unavailable when I ordered. The bubble tea menu selection is pretty diverse though!   Seating: There wasn't much seating... probably 6 seats at a bar-type area and 5 now seats at a couple tables.   Food: The wings were delicious and crispy. Also, the spicy sauce was actually decently spicy!! The bubble tea was delicious and the boba was definitely a good amount of chewy.   Overall, I'd definitely come back to get more wings and bubble tea!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TH4yfKSVe3bpnXrsehgIxw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Honey green tea with boba",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TH4yfKSVe3bpnXrsehgIxw/o.jpg"
      },
      {
        "img_id": "75NjlJuu-2GsZTCaa9Nfcg",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Snack size with spicy soy garlic sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/75NjlJuu-2GsZTCaa9Nfcg/o.jpg"
      }
    ],
    "user_id": "9MU6L4v83qo9jmutekcWMQ"
  },
  "JOSjvZ0V1coXbnbqPJcHAQ": {
    "date": "7/23/2018",
    "text": "I've had a lot of Korean fried chicken over the years and this one is definitely a pass. The chicken was not juicy, the batter is flavorless, our chicken was over-fried to a point where it tasted burnt, and there was so little sauce on our chicken! This place is worse than Bon Chon and Bon Chon ain't even good. I'm surprised by the number of good reviews this place has because it was honestly pretty unmemorable and bland chicken... then again, I've frequented northern Virginia and right outside of NYC NJ cities that are super Korean-populated so maybe I'm just used to the good stuff and pickier than the average person about Korean fried chicken...? Doesn't seem like Pitt has much good Korean food anyways. Definitely a pass for me but if you've never tried Korean fried chicken before I guess this is still worth a visit. I cannot comment on the bubble tea but it seems to have good reception based on other reviews.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZvsxI7NlvtzPbX2T8eUZIQ"
  },
  "CsVx-RT4efc_kjJifA1U_Q": {
    "date": "3/10/2017",
    "text": "My typical Friday night includes a random cute girl and a bottle of Champagne. I like to call this concept \"Chick N Bubbly.\"   What to get: Korean Chicken Wings. What not to get: STDs from the gorgeous girls at U Pitt and nasty boys not from U Pitt that come here to pick them up.  What else to get: Black Milk Tea with Tapioca Balls. What else not to get: Creepy Staring Syndrome with Blue Balls.  For awhile, Chick N B was one of my fave things in Pitt. The bubble tea the girl recommended on my first visit was an original black tea and it was yummy. So creamy and thick and delicate and just the way I like it. It reminded me of the milk tea at Coco, a chain that is especially popular in Flushing NYC.   The Korean chicken wings were off the charts good. A bit like Country Sweet (in Rochester) but better. I don't usually like sweet food unless it's a dessert, but these wings had it going on. Plus I appreciated that it cost me under 10 for the chicken and the tea. And that first time I came had lovely service too. Very busy, decent wait time, but so worth it. Awesome experience.  I even wrote this about my experience, after my first visit:  (1) The creamiest, sexiest, most delicious milk Bubble Tea outside Coco (Queens NYC). Absolutely heavenly. Their other flavours are pretty good too, not to the same degree as the original.  (2) Ridiculously delicious sriracha-infused Korean Chicken Wings. This was the first place I ever tried KFC (Korean Fried Chicken) and if this is anything to go by, I'm going to love it long long time.  Unfortunately, my experiences since then have been less stellar. The wings are still amazing, and still deserve five stars. But the bubble tea has been inconsistent, and has not been nearly as enjoyable the last few times. I can't figure out what's different. It might be the creamer, it might be the tapioca itself, but also it might be that my bubble tea appreciation and tastes are becoming refined and more picky very rapidly, since I've had so much damn bubble tea lately. In any case, I'd rather get my bubble tea from I Tea Cafe in Shadyside, Sumi's in Squirrel Hill, or Love Yogurt right here in Oakland, these days. Also the service here the last few times has left something to be desired, and the most recent time they kept getting my order wrong. However, I will say that they did (eventually) fix it (begrudgingly) after I forced the issue (and by issue I mean I need to stop using so many parentheses).  These days I think the BT tastes more like Kung Fu Tea than Coco. Which is not as good, because of the creamer used. Nevertheless, the BT here is still enjoyable, and the Korean Wings are excellent, as are prices.  And my gf is pretty awesome. She's a cool chick, and bubbly. And when I say bubbly, I mean this in multiple ways, with emphasis on the word multiple. And by that I mean that when we are, you know, she often, well, basically, and you will not believe this and it should not be written on Yelp and it's very personal and intimate, but I'm going to tell you anyway... she tends to randomly and spontane  (You have reached the character limit for this review. Thank you for reading.)",
    "rating": 5,
    "rated": {
      "funny": 16,
      "useful": 16,
      "cool": 18
    },
    "photos": [
      {
        "img_id": "KVCkvUrjvx8ag7kZ41L3Kw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Omg! It&amp;#39;s people! Honeydew Bubble Tea is PEOPLE!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KVCkvUrjvx8ag7kZ41L3Kw/o.jpg"
      },
      {
        "img_id": "Zo2wW-3Bptx8csrVby8Udw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. This was served to me by a very bubbly chick",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Zo2wW-3Bptx8csrVby8Udw/o.jpg"
      },
      {
        "img_id": "qV4KeRtnB8FWd36gih4eYQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. On a Korean wing and a prayer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qV4KeRtnB8FWd36gih4eYQ/o.jpg"
      }
    ],
    "user_id": "Hi10sGSZNxQH3NLyWSZ1oA"
  },
  "w8jtG5zwdkmWRgEkawpjgw": {
    "date": "4/30/2016",
    "text": "It's hard to determine a solid rating for Chick'n Bubbly because some items are great while others aren't.   The bubble tea is pretty good but I personally think the regular is way too sweet, which thankfully, they have a reduced sugar option. With a huge selection of flavors, there are plenty of options and combinations you can choose. In terms of food, it's hit or miss. What you'd think would be the star of the show, the chicken, sadly was not for me. The batter was really crispy and that's good and all, but the sauce kind of left me wanting more. They only have two sauces and they both were not that flavorful to me, especially when served atop ultra greasy chicken. I think the chicken is missing a bold sauce that will cut the flavor of the grease. We also ordered the takoyaki (squid balls) and they were delicious! The batter was really soft and the flavor was on point.   Overall, I may or may not come back. Although if I do, I probably won't get the chicken. The tea and takoyaki will have me coming back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "RkOTqhmxvgFW1bdHcKsmPQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Takoyaki",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RkOTqhmxvgFW1bdHcKsmPQ/o.jpg"
      },
      {
        "img_id": "XMxWdPww5__VSrFSZy6kfg",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Kushiage (battered chicken breast on a stick)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XMxWdPww5__VSrFSZy6kfg/o.jpg"
      },
      {
        "img_id": "1vINb6fLUx5MYzjt7zUP6w",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Snack size of wings and drumstick.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1vINb6fLUx5MYzjt7zUP6w/o.jpg"
      }
    ],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "QBb_5NSK30GGXM5k87KWdA": {
    "date": "5/28/2016",
    "text": "Delicious korean fried chicken for a great price! My friends and I stopped by for lunch and all got the awesome lunch deal - $8.99 for milk tea, fries, and either 4 wings or 5 tenders. I got the wings with soy garlic sauce, which were very crispy yet tender, although they could probably use a tiny bit more sauce. The seasoned fries were also really well done and my friend enjoyed his sweet potato fries as well. I got taro for the milk tea, which I enjoyed and I like that you can customize how much sugar you want in it (less than half sugar is probably good).   I got everything I wanted with the lunch deal for less than $10 (bubble tea AND chicken wings?!) and was definitely full after finishing everything. The shop owners/workers were also super nice and took time to explain the menu to us. The only thing is that our three orders probably took about 20-30 minutes to come out when we were the only customers present at the time (I could see them frying everything fresh in the kitchen) - we weren't in a rush or anything, but if we had been, I would have probably been more annoyed. So don't expect extremely fast service. Other than that, I highly recommend this place! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vTKk4kvZ6KhtqZikZerVvA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. menu including specials",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vTKk4kvZ6KhtqZikZerVvA/o.jpg"
      },
      {
        "img_id": "wSyx-6gbiocETH-2YNuk0A",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. $8.99 lunch combo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wSyx-6gbiocETH-2YNuk0A/o.jpg"
      }
    ],
    "user_id": "vRP9nQkYTeNioDjtxZlVhg"
  },
  "5ZNSx_3Jsv2bB5bb80rXYA": {
    "date": "8/21/2018",
    "text": "Located next door to Oishii on Oakland.  Looking for boba tea.... this is it.  Refreshing after a delicious meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jmMw9CqrhcI71TMcN6MMAQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jmMw9CqrhcI71TMcN6MMAQ/o.jpg"
      },
      {
        "img_id": "74Uz_YHwx4gbxbBwGzwm6g",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/74Uz_YHwx4gbxbBwGzwm6g/o.jpg"
      },
      {
        "img_id": "BO4B5mnyZXcW07aA6xpzHw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BO4B5mnyZXcW07aA6xpzHw/o.jpg"
      }
    ],
    "user_id": "KBt4y4aRn8_PS0VKVPLEKw"
  },
  "TKlxcMRCepvEHTPkkkVCeA": {
    "date": "2/1/2016",
    "text": "Love the chicken here!! At first I thought it was a little overpriced, but the chicken is so tender and the pieces have so much meat on them so you'll definitely be satisfied. I ordered a large drumsticks and wings combo and split it with 4 people and we were all so full by the end of it. I love the sweet and spicy saucy. The pieces are all a little crispy on the outside but still tender inside. I don't know if the flavor combination is for everyone, but all my friends and I love it!  The bubble tea was also great. Nothing too special about it, but many restaurants mess it up and this place didn't.   I would highly recommend this place and will probably be ordering from here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M0jLRhryNskx-nWD0yyHww",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Chicken and bubble tea!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M0jLRhryNskx-nWD0yyHww/o.jpg"
      }
    ],
    "user_id": "87yDspNg9HFoPqV0A-heZg"
  },
  "zjQeP0ByCNJEgSYz62V_YA": {
    "date": "1/1/2018",
    "text": "The kushiage is a tasty little snack for only a couple bucks! The bubble tea isn't anything particularly special, but I do like how you can adjust the sweetness level. They don't have as many topping options as Fuku Tea though, and I love herbal jelly which they don't have.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zw_V_Hd-2bDCymvfII-8uQ"
  },
  "DsF_yVMPjzPAHeGKX_OzAg": {
    "date": "9/23/2015",
    "text": "Not too pleased with my most recent visit here. Yesterday, I got the $8.99 lunch special that comes with your choice of bubble tea, chicken tenders or wings, and fries. I got the matcha green tea as recommended by a friend. It's a new flavor and it's pretty good. I chose seasoned fries and enjoyed them. The chicken tenders were the problem. There were two problems actually. The sign on the wall advertising the lunch special said you choose between 5 chicken tenders or 4 wings. I chose the former but saw that my receipt said 4 chicken tenders. I thought it was just a mistake so decided to wait until I got my food. Sure enough I only got 4 chicken tenders. Upon closer inspection, I realized it was better that I didn't get all five because--see photos--they were way undercooked and unevenly cooked. Not golden brown like they're supposed to be but more like a light yellow mostly.   In the past, I've tried the wings and didn't really see why people liked them so much. I've also tried their Thai milk tea a few times and it's always too sweet. Service is good though; the ladies who work there always serve with a smile.   Taste | 3 Atmosphere | 3 Presentation | 2 Service | 3.5 OVERALL | 3",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "zqdYgZ3_B1QO-YKPSFx3Og",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. seasoned fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zqdYgZ3_B1QO-YKPSFx3Og/o.jpg"
      },
      {
        "img_id": "uk4yWz97gXbIAyZW4h5EvA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uk4yWz97gXbIAyZW4h5EvA/o.jpg"
      },
      {
        "img_id": "G9dpVi4NvHOt0EXEBFpztA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G9dpVi4NvHOt0EXEBFpztA/o.jpg"
      }
    ],
    "user_id": "HC5zLdut4caN1VPqxqRsMw"
  },
  "uxxHB5QIfb7q1F1Zr_scuQ": {
    "date": "4/2/2018",
    "text": "The ladies who waited on me were so friendly. They do many options for bubble drinks and great bubble smoothies. I will have to come back for their chicken.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "lyNcVUmdHPAyM_RPhqhpkQ"
  },
  "08ThMfzDrMiauIk7ktMkpQ": {
    "date": "12/7/2018",
    "text": "Best boba in Pittsburgh, hands down. And we have tried them all. We travel often & boba is a favorite treat when we hit any city but we had all but given up on finding a local joint we love. We honestly figured it would be mediocre Fuku as an ok local taste to remind us to get back to SFO, YYZ, or LAS, lol. But just a chance walk up the block and - happiness! We stopped in initially because of the cute name! We have been all through the menu, maybe more then once... and we have our faves, but the bottom line is that their boba is a good texture and a good size and taste. Bursting bubbles are a delicious addition - lychee is my fave. We are there every week, hope to see ya sometime! It is such a fun place with a great staff! The awesome blonde girl with glasses is so darn bubbly herself that you cannot help but smile and bop along to the music with her ;) Chicken and apps are yummy, too! Can't go wrong here - treat yo'self! And keep an awesome Pittsburgh spot going strong!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pCAIqi6wiAY65gIndwsYUw"
  },
  "bxMbtRzNdeNQNzWhfyH2Tw": {
    "date": "4/25/2018",
    "text": "One of the first places to serve bubble tea in Oakland! Worth the trip just for that. Their chicken is tasty as well, but kind of greasy and usually takes a while to make so plan on a wait if you get any hot food. They offer several sauces to choose from and I'm a fan of the spicy one...it isn't too spicy, it just has a kick!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "uPMYfrfY2XCRcQUfeUnBbQ"
  },
  "_EeE-7R3jRDuCASXTMnqLQ": {
    "date": "8/4/2015",
    "text": "I'm going to start off by saying the best Korean fried chicken that I've ever had was not too long ago so it's still very fresh in my memory.  It was at Turntable on 5th Ave in NYC and since eating there every KFC place I've been to in Toronto I've had to measure up against Turntable and while I've found some places that make it decently, I've yet to find a place that comes even close.  Chick'n Bubbly being the only place I was able to find in all of greater Pittsburgh to claim that they make a Korean fried chicken almost obliged me to have to go and try it for myself.    On this short little strip of Oakland Ave between Fifth and Forbes has a bunch of places to eat including another Asian place on the same side of the road as well as two sushi places right next to each other across the street.  Chick'n Bubbly is a small little storefront, so small you could probably miss it.  The counter is small, the menus are on backlit flat panels and there are only 2 tiny 2 seat tables near the front entrance.  All the other seats are stools along the side wall, facing the wall.    We were 3 so I went with 30 wings half spicy sauce and half garlic and soy along with a tea drink each.  All the food and drinks came up to 46 bucks.  It seemed kind of pricey being that the large teas were 4.25 each and 30 wings was the largest order we could get.  They boxed each flavor of wings 15 to a box in two separate boxes.  We were eating but they don't have plates but rather tiny trays which is what we used to for the bones.    The spicy sauce again, this is the Nth time a hot spicy/sauce place has used TOO much sauce.  When we got to the bottom of the box the ones at the bottom were swimming in sauce.  Again, the garlic soy were better than the saucier ones.  The garlic soy although having sauce were much lighter and stayed crispier and overall were better tasting being more savory than sweet.  The chicken itself, the wings were large.  I would have preferred to have them be much more crispy/crunchy as I have had at other places that serve KFC.  It seems to me their batter seemed much more thicker than I was expecting as opposed to the paper thin batter I've come to expect when having KFC.  Overall the food was OK but it certainly wasn't great and it was a 5 compared to Turntable if that is to be a 10... basically half as good if that.  Price wise it's not really as good of a value either.  For the same money in NYC at a real sit down place we only had 20 wings but they were exponentially so much better and I had beer and soju as well as fries etc.    The bottom line is while Chick'n Bubbly is OK, it's not as good as other KFC I've had in NYC or at home in Toronto.  They use way too much sauce and the batter is much too thick when compared to other KFC places.  It would also be nice if they had proper tables to eat.    As far as their drinks go that they do properly.  There are a gazillion places to get bubble tea in Toronto and they make it good here.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "RRLt9mKpmiO30bqK1hFqGg",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Spicy hot sauce Korean fried chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RRLt9mKpmiO30bqK1hFqGg/o.jpg"
      },
      {
        "img_id": "75Vokz-4hUx_Ei-Y6HeLrQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Garlic soy Korean fried chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/75Vokz-4hUx_Ei-Y6HeLrQ/o.jpg"
      },
      {
        "img_id": "6cNBTEpC-66b4PM6Fg-cjw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Green tea matcha, mango smoothie, lychee tea",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6cNBTEpC-66b4PM6Fg-cjw/o.jpg"
      }
    ],
    "user_id": "65yB0ydGXOZ_-T6J_GbKfw"
  },
  "Fegp74ho9lBJUqDtfZjJ8w": {
    "date": "5/31/2019",
    "text": "Driven by this place several times and was always captivated by the fun colors on their sign outside. Decided to stop in today and was not disappointed! (other than the 20 minute wait).   The taro smoothie with boba was quite good and I was happy that the boba was still chewy unlike some places I've tried where it's begun to disintegrate before I've even had my first sip.   The KFC is also quite good! I was in Seoul a few months back where I had my first and I think this place is pretty comparable.   Got the Spicy soy garlic flavor and loved that there was a good amount of heat without being overpowering.   Next time I'll probably order ahead so that I don't have to wait as long, but that being said, the food was worth the wait :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vSYxyrGKJqhY2arPIs9O9A",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Taro smoothie w/ boba",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vSYxyrGKJqhY2arPIs9O9A/o.jpg"
      },
      {
        "img_id": "UICH1QXQfbm_Dl5yaEtrlw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. 5 Spicy soy garlic wings (Snack-size)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UICH1QXQfbm_Dl5yaEtrlw/o.jpg"
      }
    ],
    "user_id": "Iicg8bnAevUC20LlXRNv8A"
  },
  "abpzm9xB0vJm_lZY4rzBng": {
    "date": "5/22/2019",
    "text": "I adore Chick'n Bubbly! I work nearby and come in every six weeks or so to get my crispy KFC and takoyaki fix. They serve strips, chicken on a stick, a variety of sides, and boba teas in addition to the aforementioned items.  I almost always order the spicy soy sauce on my wings, as the other one is too goopy and sweet for my taste. The snack size with a side is enough for an average lunch, since it consist of six large wingettes double fried in a crispy coating. Their takoyaki (fried octopus balls drizzled in kewpie and brown sauce) are small and best eaten fresh, since they become soggy very quickly. With that said, they satisfy the takoyaki craving I developed while working at Umami, seeing as how a table there is a hot commodity nowadays! Their boba teas are solid as well, and they offer almond milk for people like myself who can't drink regular milk. I only occasionally order tea though, since it's more like a dessert than a beverage.   Chick'n Bubbly meets the need for solid KFC and cheap eats in the Oakland area. I'm glad to work nearby and I'm sure I'll be a fairly regular customer for the foreseeable future!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zPwZQEVmFg9cbmsEwLpA6g"
  },
  "ANuXEVdvw1XmSHh4YgzU-A": {
    "date": "5/2/2019",
    "text": "Best Korean style fried chicken in Pittsburgh! The chicken is crispy and well seasoned. There are two flavor sweet spicy and ginger soy. I'm not a big fam of their sweet and spicy. I think it taste weird compare to other KFC that I have had in the past in other cities or countries. I wish the pickled radish would just come standard with fried chicken but you have to pay extra for that.  I only ordered for pickup but the seating area is limited",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VswUoaRCaDcu4D-_hrHuaQ"
  },
  "44zF-2JismnaUI2Mj9M59g": {
    "date": "7/5/2019",
    "text": "My review is based just on the bubble tea and service. The greatest disappointment was that I had stopped by for bubble tea but they had run out of tapioca... Even so, the restaurant was full of people but it looked like there was only one person making the drinks so it took longer than expected for my friend and I to receive our drinks. I noticed that all the fruit flavors were made with powdered mixes rather than actual fruit, so the flavor was a little more diluted than I would have liked.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7geGFvbSYCkwq7znW9M7Ew"
  },
  "rh_0_bizHcd6ChUhhB4R6g": {
    "date": "8/19/2019",
    "text": "A bit small so if they are busy you won't be able to get a table. Love the bubble tea and the Korean fried chicken is amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kEtVOmQDxjijMdiwzMTc0w"
  },
  "xsDSNzxSjr8lPWaCuaWliA": {
    "date": "8/10/2019",
    "text": "I had a snack size (5 wings) in spicy soy garlic and it was delicious. The wings were the crispiest I've had in Pittsburgh and the sauce was the perfect amount of spicy. Definitely keep some water near but you can still enjoy the flavor without being overwhelmed by spice. The price was definitely fair for what you receive. Staff was super friendly and accommodating of my friend's sesame seed allergy. Would recommend and will be returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zZTt0wUOpilrqhZfFwopqQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zZTt0wUOpilrqhZfFwopqQ/o.jpg"
      }
    ],
    "user_id": "7qvuRMyMAj-dhDBRXtS4Ew"
  },
  "ndEt-E1jmU71hVZjDFgwBA": {
    "date": "3/24/2019",
    "text": "Over the last few years, I have really grown to love Korean food. CnB is a small, lowkey spot in Oakland with good KFC. I usually get the sweet and spicy Korean Style Fried Chicken and fries. I say the chicken is good not great, because it's not quite as crispy as I would like. However, the flavor is great and seasoned fries are fantastic. They also recently added spicy rice cakes (tteokbokki) with fish cakes to their menu! This is my favorite thing to get at Korean restaurants so I'm thrilled about addition. It's so delicious and doesn't disappoint. I think CnB is a great spot for Korean food- due to its smaller menu, it's quicker and less expensive than the other options in the city.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FR0_puUfNemRqD2pj5xNLg",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Sweet and Spicy chicken - Snack size",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FR0_puUfNemRqD2pj5xNLg/o.jpg"
      },
      {
        "img_id": "QzbPuxFUTyFCKZLn_tIGuQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Tteokbokki!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QzbPuxFUTyFCKZLn_tIGuQ/o.jpg"
      },
      {
        "img_id": "MZfG5aer2aU6ZbqctCy7HA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MZfG5aer2aU6ZbqctCy7HA/o.jpg"
      }
    ],
    "user_id": "uKNH69DumrRvm8Ugq6yX3g"
  },
  "_NdFesSa27pSgRTMZOn27g": {
    "date": "3/12/2019",
    "text": "Uhm hiii Chick'n Bubbly, we see you!   I haven't been to Chik'n Bubbly for years aside from picking up, and on Saturday I went in to eat for the first time in ages. Still has limited seating, and the chicken is still really solid (you can choose from two flavors, sweet and spicy or ginger soy), and the bubble tea is still great.  What blew my mind was the UPDATED MENU. They now offer a ton more food options like ttebokki (spicy rice cakes!!) and other delicious things.  Would recommend stopping by if you haven't gone in a while!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-dc3f8tNYGd8sOrqPbsw3g",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Spicy rice cakes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-dc3f8tNYGd8sOrqPbsw3g/o.jpg"
      },
      {
        "img_id": "YK2H15WzLi9-tSb9hoUjmg",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Chicken and seasoned fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YK2H15WzLi9-tSb9hoUjmg/o.jpg"
      }
    ],
    "user_id": "oWjEjoX_L9HeXnD4bKjw2w"
  },
  "MDkYPQM02_8rkNspbjcVVQ": {
    "date": "4/21/2018",
    "text": "Love thier Korean Fried Chicken. I love the sweet and spicy sauce. Really really tasty! Thier bubble tea also taste good with a variety of toppings.  My to-go place for quick n good snacks!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5SVkHGXyXHUpofXujfzsuw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Good snack!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5SVkHGXyXHUpofXujfzsuw/o.jpg"
      }
    ],
    "user_id": "YEBj1ua6MrlFFU_MKaggqQ"
  },
  "ZxQJIAi40l7gRlVI33dbwQ": {
    "date": "6/15/2018",
    "text": "One of my friends highly recommend this place for the bubble drink. Finally, on a warm summer evening, I decided to go there to get some bubble drink. I remember my friend mentioning the bursting bubbles which is my favorite. So, I ordered a mango smoothie with lychee bursting bubbles.   The staff is very friendly and helpful. They didn't have the mango bursting bubbles, so they let me sample the lychee flavor before I decided to get that. This is very nice and I recommend you to try before you decide on a flavor.   The drink is worth the price!! I will go back for more during the summer and I highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TDJ-WTjbgHEoG6wqCOIikA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Lychee bubbles in mango smoothie!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TDJ-WTjbgHEoG6wqCOIikA/o.jpg"
      }
    ],
    "user_id": "bmSuFvdMyF66PDUZr9VfoQ"
  },
  "gZKLDgXm6q7ZXHYQcu3TXQ": {
    "date": "6/1/2019",
    "text": "Every time I visit Pittsburgh I come here for bubble tea and it usually tastes pretty good but this time I tried the almond milk tea and I have literally never tasted bubble tea this bad. The almond milk was sour and had chunks in it. I normally get almond milk tea at other bubble tea places so I know that's not what it's supposed to taste like. I went back after I took a sip to ask if the milk went bad and they said they make the milk fresh every morning. I'm giving 2 stars instead of 1 because the workers were really nice and friendly.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C-UFKiJNDUYnxOK8BPVC5g",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Almond milk tea",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C-UFKiJNDUYnxOK8BPVC5g/o.jpg"
      }
    ],
    "user_id": "MiDy4D0SIwvQa5KFbSgl6w"
  },
  "J4d_JmvK3ukJF5CHLqEhYQ": {
    "date": "2/11/2019",
    "text": "I SERIOUSLY don't understand with the many great reviews. I wanted to try this place because whenever I come to visit my boyfriend in WV, we always end up going to Fuku for milk tea and we both wanted to change it up for once, so we stumbled upon this place.   PROS:  This place seems to be great with snacks, there are a couple items we were interested in trying but unfortunately we were still full from eating dinner. I like that you can order boba and snacks and I believe they have a happy hour menu with a decently priced combo meal. Maybe ill only come back to check our their snacks. The service is great, which is why I decided to keep the third star.  CONS:  WOW, I was kind of at lost for words when I first drank their milk tea, and not in a good way. My boyfriend and I were blessed with milk tea places EVERYWHERE in the Bay Area, specificallly in San Jose. We have both tasted alot of the milk tea places because I sorta have an addiction to milk tea. The first thing I ordered were two Thai Teas because who can mess up a good Thai tea? Well, apparently this place can.  It had no flavor that is distinctive to thai tea and it was super milky, what is worse is it had this lingering medicine taste I couldn't shake off. DISGUSTING. Never have I said those words about milk tea and this is the first. I had asked the young man working there if this was how they always made their Thai and he said yeah. He said they add powder flavoring..WAIT WHAT?! I was very hopeful that was only for the Thai I ordered so I asked them if I could change my drink and I got a regular milk tea instead. I took a sip and it seemed fine and then that weird aftertaste came back. EWWW, WTF. I was furious, this really had to be the worst place for milk tea that I ever been to. My boyfriend and I ended up just walking to Fuku and throwing away our drinks.   This place is also tinyyyy. Will be difficult to get seats for a group of friends.  This is definitely not the place for legit milk teas.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xbSyq7I_goHiAvlnGcsCzQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xbSyq7I_goHiAvlnGcsCzQ/o.jpg"
      },
      {
        "img_id": "QKpHByVzKkW2XPodGe8t0Q",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QKpHByVzKkW2XPodGe8t0Q/o.jpg"
      },
      {
        "img_id": "NsAmxjEJDgvSMl21pmXXDQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NsAmxjEJDgvSMl21pmXXDQ/o.jpg"
      }
    ],
    "user_id": "6TqvBAdUuetUaKI9Y-Va6w"
  },
  "ImGfnzOaThvXZUaXWItZRQ": {
    "date": "4/7/2018",
    "text": "CnB is a very little resturant in the heart of Oakland.  It's right across from two sushi places which are also very good.   The menu at CnB is very small. It's fried chicken wings, exactly like you would expect in an American restaurant, plus a couple appetizers. They also have a large selection of bubble tea's. I'm a little crazy for bubble tea. I've tried it in several countries and this is an accurate representation.   We ordered a strawberry and a mango slushy, plus 10 wings. We ordered the sauce on the side. They only have two sauces, spicy and soy. They were both good, not amazing but adequate.  The one thing that really makes this place special is the breading on the chicken. It might be panko, I'm not totally sure, but it's amazing. I could just eat the skin and breading.    Everything is sold in togo boxes, and everything is very reminiscent of Chick-fil-a. The logo is even a Chick-fil-a knock off. If you're in Oakland I highly recommend you try this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "9aeA2Im-DEzy-4JBocV7Mg",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9aeA2Im-DEzy-4JBocV7Mg/o.jpg"
      },
      {
        "img_id": "ufovl9SoiIl5H2pGePfTcA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ufovl9SoiIl5H2pGePfTcA/o.jpg"
      },
      {
        "img_id": "TJNt-pOnvVhmaL27hRRcqA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TJNt-pOnvVhmaL27hRRcqA/o.jpg"
      }
    ],
    "user_id": "z2S2HYVNwCIBRESeMkJjjA"
  },
  "ElABy1pBZMEJ6UIOlAQovQ": {
    "date": "8/31/2018",
    "text": "Super friendly staff and delicious grapefruit slushy (less sweet option!) with bubbles and lychee! YUM.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0N5EHn-bEtRoDvZ7Qdnrhw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Less sweet grapefruit slushy with bubbles and lychee!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0N5EHn-bEtRoDvZ7Qdnrhw/o.jpg"
      },
      {
        "img_id": "lo_9ZA9NvbtECQylUVGQSw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Less sweet grapefruit slushy with bubbles and lychee!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lo_9ZA9NvbtECQylUVGQSw/o.jpg"
      }
    ],
    "user_id": "6_TDXmwXl85aiT4utMa_nQ"
  },
  "YPiungVewb2MV2fMVc73HA": {
    "date": "11/13/2017",
    "text": "What a fun little spot this place is!  And who doesn't love KFC?!?!?  Not usually a big bubble tea fan, but had heard such good things about their I decided to give it a go.  I ordered the black milk bubble tea with tapioca balls; it was creamy, slightly sweet and chock-full of tapioca.  Was a great accompaniment to my spicy wings.  I had a ten wing box split between two flavors...soy garlic and the sweet & spicy.  The soy garlic was less saucy but a great tang with a slight brininess from the soy.  The sweet & spicy started off sticky-sweet then a bit of a kick from the spice.  They were both great, but i'm gonna give the slight edge to the soy garlic.  I also ordered a box of fries and they were fantastic...must be fried in the same oil as the wings?  I sat in to eat, so everything was piping hot.  Great meal in a funky little shop.  Will most definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "8R0hfMmVjQf3wgE0zOzAsA",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Mixed box - sweet and spicy (L) and soy garlic (R)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8R0hfMmVjQf3wgE0zOzAsA/o.jpg"
      },
      {
        "img_id": "nmZrMzF8WXuKlxIv_qshXQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Super-crispy fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nmZrMzF8WXuKlxIv_qshXQ/o.jpg"
      },
      {
        "img_id": "jZDhzBumCdeMqQt-ylZ2Fg",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Black milk tea with tapioca balls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jZDhzBumCdeMqQt-ylZ2Fg/o.jpg"
      }
    ],
    "user_id": "CcOgdfEJxgrxTAwag5k18Q"
  },
  "h_Iqa0UVGNTO1CxmfPvc1Q": {
    "date": "2/18/2019",
    "text": "This is one of the best concepts in campus dining. Chicken & bubble tea...whaaaat! I ordered the Passion fruit Milk Tea  & Thai Milk Tea for drinks. The passion fruit was slightly too sweet, but I'll just ask for a smaller pump next time.   There is very little seating, so plan on taking your order to go, otherwise, sit at the tiny tables and enjoy your chicken and tea!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fCKtxe977mwIGTr5t8-JNQ"
  },
  "d2HvTd0QHg7-FCqYd9kYig": {
    "date": "10/6/2017",
    "text": "3.5 stars  Small place that's good for Korean fried chicken on the go.   Service can get slow, which is a really big downside since they don't offer much other than boba and fried chicken, which are foods you expect to come out fast.  For the fried chicken, I ordered 5 of garlic soy and sweet and spicy each.  - Sweet and spicy: too sour and not enough spicy. The sauce also made the skin too soggy so the wings weren't as crispy. But main problem was that the flavor was savory and didn't taste too good. 3/5 - Garlic soy: this was my favorite of the two. The sauce wasn't too thick so the skin was kept crispy, and then the flavors just hit the mark. It was a bold but clean flavor, so not too polluted with random spices and tastes. 4/5  Overall, not a bad place for a quick snack.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9UBEGHJvmaS9M6UiMx_KAw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Sweet and spicy (left) Garlic soy (right)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9UBEGHJvmaS9M6UiMx_KAw/o.jpg"
      }
    ],
    "user_id": "RTTMsplbxNb61fujtFz23g"
  },
  "iY5sYnabTSGkTr4u7s6eZg": {
    "date": "7/13/2019",
    "text": "Super fast, delicious, not too much ice. The only reason i rate this 4 stars is because there's no option to adjust sweetness and I want more boba in my Taro Milk Tea",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8gyqVDj-L3-p0JO-c7gohQ"
  },
  "RlSQi3Z1dghCOAklEo8NSw": {
    "date": "3/24/2019",
    "text": "The chicken is not as crispy as it is originally in Asia. The sauce is fine though. I like the bubble tea very much.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZC4EcoRUtedIOcfZRH5fsQ"
  },
  "eOBR6iJHfPxKnqAaM0UB6g": {
    "date": "5/3/2019",
    "text": "Completely rude service witnessed from one of the employees to a group of other patrons. Employee was on her phone most of the time and sitting on the counter where food was prepped. She had an attitude for most of the night",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pXSLx3-wT7z3N3roPnufhA"
  },
  "WU9t0t9I2QmtWkM0A5iKFA": {
    "date": "7/13/2015",
    "text": "I'm addicted to their bubble tea, and their wings are so delicious and extremely filling. A snack size usually fills me up. A little pricey but worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "czkMely189m-pyzs_j6VYA"
  },
  "BoOsalak_8IPcIYgwwFr3A": {
    "date": "8/3/2015",
    "text": "Meh. Honestly, I wasn't super-impressed. The chicken was good, but not all that special. Also, the cashier didn't seem to think there was any difference between chicken wings and chicken legs (for real).",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "64nM80q0nNsObF-8VGI7hA"
  },
  "FEpX_-Kl41DpcCs4ndHPxw": {
    "date": "12/23/2015",
    "text": "We only bought the smoothies with bubbles and they were awesome. The tapioca was cooked perfectly. The woman helping us was very friendly and helpful. If we lived closer we'd be back to buy some chicken. I do wish the dining area was bigger.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BlEZXOGS9GmNZsuRGUPtrA"
  },
  "syk_5o9jCweTtjFLulyklA": {
    "date": "1/7/2015",
    "text": "I love the concept. I love the freshness. I like the little finder covers too. It's tender but fried to perfect. I like both of the sauces, but prefer the sweet and spicy.. which isn't too spicy. The yam fries are good also. Great addition to the Oakland food scene.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "C371u4yqZEGJN9iTETml4A"
  },
  "baK1epTDzhiUT9PKNM2DTQ": {
    "date": "10/16/2016",
    "text": "I had the soy garlic wings and almond milk tea here. The almond milk tea tasted very powdery and tasted exactly like the instant Greenmax brand almond tea with hazelnuts. The soy garlic wings were quite disappointing. The sauce was more like honey, sweet sauce and the wings were not very crispy. Any of the wings at the bottom of the box or covered by others wings were all soggy. Why buy fried food if it is soggy?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "crAcG6Ta74YVoPwgj3VO1A"
  },
  "EzfSNLXw1jjfqxh7O35eVQ": {
    "date": "8/24/2014",
    "text": "I went this past Thursday during their soft launch. The chicken was super delicious though I hope Chick'n Bubbly improves their wait time for chicken (I would have downgraded the stars but the food just delivered). I happened to go during Pitt's move-in period and around noon. The space is small. I ordered the snack size with both (4 wings and 1 drumstick) in the soy garlic glaze for a lunch size meal. It also comes with a side of radish pickles. I'm not sure what happened but I waited about 20 minutes for what I thought would be a quick pop-in. That aside the chicken exceeded expectations in terms of crunchiness yet being so moist and fresh. You can see the cooks battering, frying, double frying and checking the temperature in their kitchen. I devoured the pieces within minutes and wanted even more though I was full so I'll be back to get some more and some other things.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "57tf_RmT5o3BiFj2gpV-Jg"
  },
  "aKAvC4rFVa1LaK-NuTAcjw": {
    "date": "6/10/2016",
    "text": "Wait was 25 min for wings at 4pm on a Friday (there was only one other customer in at the time). $20 for 15 wings, at least it was supposed to be... Only 10 wings inside when I got home. Very small wings at that. Sauce was nothing to write home about. Slow service, overpriced, weak sauce. Will never return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eXtFWTD7pMOHLjpOov5evQ"
  },
  "W62EVAEQWI_y1rGZZvxZdg": {
    "date": "11/7/2014",
    "text": "The bubble tea is more like thai iced tea. Not bad, just not what I expected or what I wanted.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BTKtAXjPHjH5B3xuT4uiIw"
  },
  "0UN_crDIAXykREaNUcZ0yA": {
    "date": "8/25/2015",
    "text": "Really enjoyed this place along with Korean Garden. I didn't enjoy my bubble tea because I decided to be weird and mix two things that should not be mixed together. However, the person who took our order was super nice and got a little surprised with me saying thank you in Korean when she offered me  haha. Another place in Pittsburgh I'd recommend and go back to again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VPUDrabsoMlwAgk2jpGDHw"
  },
  "xHfxZ4M3Yxyz-h1kJ90WxQ": {
    "date": "8/6/2014",
    "text": "Although I work in Oakland I hadn't stopped here yet since there's plenty of options open during the day, but one evening I got stuck here when my battery needed a jump and my car was stranded on Forbes.  I had a half hour to wait for the AAA truck so I stopped here thinking it would be a quick snack while I wait for the truck, since it seemed like a fast food sort of thing.  Pretty much all they have is chicken and bubble tea, with a handful of side items, so I expected it to be a pretty efficient operation.  However, I ended up waiting a half hour for a small chicken order (they did apologize for the wait, but still, there was only one other person in there waiting and multiple staff).  The worst part was while I was waiting by the open garage door style window and enjoying the nice breeze and keeping an eye out for the AAA truck, they randomly come up to me and decide to close it up for no reason whatsoever, even though I had been waiting awhile already and I thought it was clear I was enjoying sitting there by the open window (and it's not that they were closing up, because people were still entering the door from outside after that).  After that the place was quite stuffy and warm and seemed a lot smaller and cramped.  Eventually I got my chicken and it was fine, but nothing amazing, and a little on the sweet side for my taste.  They only had 2 sauce options and I chose the garlic soy.  I did really like that you could choose drumsticks or wings though (or a combo) since I prefer the drumsticks.  Also, although I ordered the small I was surprised it only came with 3 chicken drumsticks (there is also one size smaller than that).  I kind of thought it would be at least 6, like a half order of wings at a restaurant (thought admittedly they were a bit larger than normal wings/mini drumsticks). So it was a little pricier for the amount you get than I initially thought.  But a decent later night option for the Oakland area.  I did end up making it back in time to meet AAA but only by like 2 minutes so it was a close call.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3bo1FXvQnxw2hmO0CHH4Nw"
  },
  "iePESFF-2De71YoneCuUAQ": {
    "date": "9/12/2014",
    "text": "They need to speed up their food prep time or something needs to change. Waiting more than 30 Mins every time I get here...it's not THAT worth of quality.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wrt6maH_llebYESCVX-JjQ"
  },
  "qGCa_PDDKd1uZ3cDpiPh_A": {
    "date": "10/1/2016",
    "text": "For boba: they make exactly what I want and it's both delicious and done in no time. Only boba place around that gives options on holding sweeteners and also only one with pineapple jelly! Haven't tried the chicken yet but I definitely recommend the boba. Also well priced and large size is generous if you want a lot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "STDJOXj_uyXVxrqg0na3Hw"
  },
  "mmZdB18cA-fdjTuZRRaLgQ": {
    "date": "3/9/2015",
    "text": "The chicken was great. Super crispy skin and a nice amount of sauce. I got the Soy Garlic Sauce and my boyfriend got the Sweet and Spicy; both were good. Originally, though, I'd wanted the Chicken Salad on the menu, but they said they didn't sell that. My boyfriend also ordered radish pickles and was told those were included with the chicken. They gave us a little plastic dressing-cupful of the pickles, which were decent. Listening to other people order, it sounded like other sides might have been included as well, and I wish they'd explained our options when we ordered.  We ate in the shop, and they have little gloves for your thumb, pointer, and middle fingers, which were very handy. The chicken was great, but this place is on the more expensive side. Also, two of the three times we wanted to eat there, it was closed, so be sure to check the hours before going.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Figs8mO8s_aPRq2W7W0cYQ"
  },
  "zJC3nE_2PsEUcEeI-zcrdw": {
    "date": "3/8/2015",
    "text": "On my quest to try out more places, I came across Chick'n Bubbly after going to Oishii Bento, where they offered 50 cents off a bubble tea at Chick'n Bubbly with my receipt.   Like the name, I got chicken and a bubble tea. The chicken was pretty good. Although the chicken was a little on the pricey side and a little too crispy for my taste, I liked that there wasn't a ton of breading and it wasn't soggy at all, like the chicken at most places. I can't remember the exact name of the sauce but it was some kind of sweeter sauce and I asked for some spicy sauce as well. I'm a huge fan of sweet and spicy and I liked it! The best part about this place, in my opinion, was the radishes included with the chicken. They go perfectly together and I would probably choose this place over any other place because of those radishes.  Unfortunately, the bubble tea wasn't that great. I had been craving bubble tea for a while so I was super excited but it kinda fell flat. It was a little watery and a little bland. The tapioca balls were okay but I was left a little unsatisfied by the bubble tea overall.   I got my order to go so I didn't really have much experience with the service. The person that took my order was polite. I got my order pretty fast but there weren't that many people. For those that are thinking about eating in, there really aren't many seats.  Chicken: 4 stars - pretty good but not exactly to my taste Radishes: 5 stars - seriously, every chicken place in the world should have them Bubble tea: 3 stars - okay but not great Service: 5 stars - no complaints Overall: 4 stars",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O1cy3eGV5QOVPR595Oh7Lg"
  },
  "KUg_FtsSyaaqnKLLrmOMFA": {
    "date": "10/17/2015",
    "text": "2 stars for the chicken wings. Been in Pittsburgh for three days now and I've been skeptical about trying this place out but I was really craving wings so I ordered the medium. Good amount of chicken I guess. Kinda like 1 dollar a wing since I ordered for delivery. Their bubble tea wasn't that great. Only gave it a try because I read someone else say that this was the best comparison to \"real\" bubble tea. But being from California where there's 5 tea shops on one block I'd have to disagree. I ordered the mango green tea and it really tasted like jello that I would buy from the Asian super markets & their jasmine milk tea just tasted like powder. Cant wait to return back to Cali so I can get my boba fix. But their chicken is very tasty.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qjNQdxR95nmWl6tlPMH7Ig"
  },
  "y1OPFmyqGrjwpMoKE_qYNw": {
    "date": "11/22/2014",
    "text": "When it comes to Korean fried chicken in general, I must admit that I can get a bit religious- it's THAT good.  With that said, the fried chicken here was pretty excellent, although not quite as good as the food-of-the-gods from Bon Chon to deserve a 5 star rating.  For anyone who has never had Korean fried chicken, TRY IT.  It can be life changing.  (It would also be a good idea to get it with pickled radish on the side, which works as a nice palette cleanser). My only complaint is that the pickled radish and kimchi are both an additional charge.  Overall though, very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sV3xGQ-mFG48hzJcArlLZw"
  },
  "VH5j4dmAgt9vNj-W86ZIVg": {
    "date": "9/12/2014",
    "text": "Bubble tea, bubble tea, bubble tea.  Gotta love this place.  Small little place but nice and clean.  I had passion fruit smoothy with boba and jelly.  Boba and jelly had nice flavor and good texture.  I ordered my smoothy a little less sweet in anticipation of some sweet that comes from boba and jelly.  The combination comes out very very nice....not too sweet but enough of flavor that all blended well together.   Price for bubble tea here is cheap. Maybe because it is near college.  The small smoothy with boba and jelly was about $3.50.  The big one is about $4.50.  Every drink is pretty much less than $5.  Love!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JP86mMiR0Z2eskVP3hLw0Q"
  },
  "G2hg64QLumHItUgeKk8lxA": {
    "date": "9/8/2014",
    "text": "My husband and I love Korean food so we were super excited to try this place, especially after all the great reviews. Perhaps our wings were made wrong but these were not good. We each took one bite, he spit it out on a napkin and I made a face of disgust as I swallowed it. We ended up throwing them away, I don't believe we have ever done that before. They were soggy, overly sweet and tasted like paper, I really  I don't  know how else to describe it. The only reason why I'm giving this place two stars is because my strawberry milk tea was good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Ra43bbUQNYkBCOUQtxYnA"
  },
  "UtXAWNlo2ASPKWMkmapDWg": {
    "date": "9/7/2014",
    "text": "I LOVE Korean fried chicken and was initially psyched about this place and its concept, but I'm getting more and more disappointed with each visit. It seems to me like they are copying BonChon (I've been to the Boston locations), but with poorer execution.   Few complaints - The chicken is way too sweet, for both soy garlic and the sweet&spicy - The spicy isn't actually spicy - The bubble tea has way too much cream and not enough tea flavor - The wait time for the fried chicken is too long for the concept of order & pick-up. It would be okay for dine-in with appetizers, but there isn't enough seating for that.  Tips - I'd definitely call 15-20 minutes ahead of time to order. They'll make your bubble tea \"fresh\" in front of you when you come to pick up your chicken. - Of the bubble teas I've tried (taro, black, almond, jasmine), I like the jasmine the best. I also tried their lychee slushie - it was OK.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HAbASizzsq-Z26CbdTpbpQ"
  },
  "HCaSmBTNgSPZD9MTuQ9pXg": {
    "date": "2/26/2016",
    "text": "I had their soy garlic drumsticks and wings.  Definitely have had better elsewhere.  I remember trying the wings when they first opened and really loving them, but now they are just meh.  The chicken was too oily and were not cooked evenly.  Half of a couple of my drumsticks didn't even have the soy garlic on it and only tasted like fried batter.  I've definitely experienced better here before, but I don't know what happened this time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OLpwPfxfIqpGv7VlrQ4jIg"
  },
  "0iSa-FsIjXqM7KhOH_ecPg": {
    "date": "5/20/2016",
    "text": "The chicken was tasty but the pearl milk tea didn't taste very good. The pearls were hard and the drink was over sweetened. Price is about average for Korean fried chicken. The shop itself was empty when I picked up my food but the parking outside is horrendous. Worth a try but I probably won't be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yyMcYDCXbRYcBbWHc_sGHw"
  },
  "FFroUyWXG0ERyOXiIybyqA": {
    "date": "7/11/2015",
    "text": "Finally! Real bubble tea! I was skeptical when I first saw chicknbubbly - all thanks to my terrible experience with \"bubble tea\" in schenley park 2 years ago. After that fateful mouthful of crunchy tapioca balls and fake fruit syrup, I lacked the courage to try my luck in Pittsburgh again. I come from Seattle which is pretty much the land of bubble tea (outside of Asia anyways) and so I've developed a preference for perfectly cooked tapioca and real fruit if ordering a smoothie. With this criteria in mind, Chicknbubbly passes. Furthermore, the level of sweetening can be adjusted to your liking. Score.  Note: I don't think their taro was real, but most use powder for taro anyways. I'd still get it again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MmEi3bzkBi9ww92B297biQ"
  },
  "HPYUbfRdsvo7OG6qD0kwYg": {
    "date": "11/10/2014",
    "text": "I've had life changing chicken before (see my review of Bolton's Hot Chicken in Nashville), but this is the GOOD kind of momentous chicken.  Chick'n Bubbly's Korean Fried Chicken is THE BEST. SO FREAKING GOOD. It's the perfect level of crisp fried-ness. It's like crispy fluffy heavenly clouds of coating around the chicken with the most delicious soy garlic sauce perfectly glazed like a silver lining around the aforementioned delicious coating. Yep, I've come up with the perfect metaphor now, it's like throwing heaven in a deep fryer and coating it with savory asian sauce.  Dear lord, you need to eat here (yes God, you need to eat here too). A couple of side notes, the soy garlic sauce is the best, you can get extra spicy sauce on the side to douse them with too (I do that, it is so yummy), and the daikon is the fresh kind, not like at sushi places.  My favorite thing to do for lunch when here? Place my order for a small size of wings, go next door to Oishii and get Kimchi and Wakame Salad for my sides :)  Please note, never get the french fries here. Literally the worst of my life, but the chicken is so good I can't bear to give them less than 5 stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V0pP_PQnWdtyKpF-pifiaw"
  },
  "WaqjlpM8YZfh76gHcBhGNg": {
    "date": "10/2/2016",
    "text": "They've got some good bubble tea. Not watery or lacking in flavor. I also ordered the tatsutaage chicken. It's good but there could be more chicken. It's a small amount.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rc37na6VbOqy-5qc4ta4uw",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Tatsutaage chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rc37na6VbOqy-5qc4ta4uw/o.jpg"
      }
    ],
    "user_id": "LYaPQKdSZSUUrr0khGVIkw"
  },
  "QpLMPUmbrh8JvLNWIBvBBQ": {
    "date": "9/6/2014",
    "text": "I have heard many things about Korean Fried Chicken... \"life changing\", \"orgasmic\", \"so good it will make you drop kick your mother, twice\"...and \"jolly good!\"  That being said, I was not the least bit recalcitrant to visit this new entrant into the Pittsburgh food scene, when it was brought to my attention by Maren V. Venturing back into the proverbial \"old stomping grounds\" of the University of Pittsburgh, and navigating the myriad of Sperry wearing, sweatpants clad undergrads, we entered the small and crowded establishment. Following a not so brief wait, we placed an order for soy garlic wings. We were informed, there were no drumsticks available. Tears. The order was delivered in a respectably prompt fashion. As a bonus, they had finger condoms ( is there a better name for these things?) if you are a Monk-esque having two hands dirty at the same time-a phobe, like myself.   Lets get to the wings, shall we? The first bites for a KFC virgin such as myself were confusing to say the least. I had heard these were to be double fried, and crispy, yet tender. I detected no difference to regular chicken wings to be honest. The sauce was almost sickeningly sweet, yet lacking in any subtle distinction of flavor. Some were crispy, some were almost soggy.   In all honesty, I threw about 8 away. I never throw food away. I generally eat everyone elses leftovers because I am fat as f***.   I might chalk it up to being extremely busy, but I really dont have desires to give a second chance. I must find KFC elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s_PI8eOGJdoYCIGCSmBN8Q"
  },
  "nwuK_C31EHKYmvwAGX14ig": {
    "date": "2/10/2016",
    "text": "BEST. TARO. MILK. TEA. Get it!  I am the snobbiest bubble tea snob around, and Chick'n Bubbly has seriously blown me away. Moving to Pittsburgh from NYC, I came in with a high bar for bubble tea. My first order was the Taro Milk Tea, which locked me in as a regular on first sip.   Since then, I've tried almost every flavor on the menu as well as all the other major bubble tea spots in the area (Rose Tea, Fuku Tea, Chengdu Gourmet, Everyday Noodles, Sichuan Gourmet, etc...).   Final verdict: The least impressive tea on Chick'n Bubbly's menu is bars ahead of the best tea on any alternative's menu. There just is no competition.  What I recommend from Chick'n Bubbly: 1. Taro Milk Tea 2. Mango Green Tea 3. Lychee Green Tea Bursting bubbles a must with teas without milk (the milk would clash with the fruity bursting bubbles).",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4-0xEhu7dq39Df1wbgOezQ"
  },
  "LBCLam_HBi88UfFDE0wLsQ": {
    "date": "10/3/2017",
    "text": "Chicken came out really well, similar to Koreatown in Oakland (California). The manager lady is sweet and treats you right.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "faLKC9xmPT4s3P01B_btMQ"
  },
  "RvilaI8gMRT7oM4RQ4Nb3A": {
    "date": "8/8/2014",
    "text": "I went during their soft opening, so the menu was still limited. I'm hoping to try some of their other menu options after their grand opening at the end of august.  The chicken is double fried and is delicious.  You can choose from wings, drumsticks, or a combination of both and choose from a sweet and sour or a soy garlic sauce. The wings and drumsticks were a good size and I had the sweet and spicy sauce, which was very tasty, but made a bit of a sticky mess (be sure to ask for a few extra napkins).  They will spice up the sweet and sour sauce, so be sure to ask for that if you like it hot. It sits a bit heavy, so I found that the snack size was perfect for one person.  It does take a few minutes for them to prepare the chicken. So be prepared to wait a few, but it's worth the wait.  The bubble milk tea was some of the tastiest I've had. The tapioca bubbles are prepared fresh every couple of hours and the tea was very flavorful.  They made the tea quickly, so I was able hang out and sip it while they finished up my chicken.   The bubble tea cups even have a sealed top in case you're trying to carry a bunch of them at once, no leaking possible.  This is important, because this is mostly a take out joint.  There are only a couple tables inside, but when the weather is nice, there are lots of good places to sit outside and eat within a block of the restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DGtHOOllQLPJOUDrNw256w"
  },
  "CUWTfs2CPbYMyV0KtnSqCA": {
    "date": "8/6/2014",
    "text": "Outstanding chicken!  Pittsburgh has been sorely lacking a Korean fried chicken place for a long time.  They're currently in a soft opening with the grand opening in late August so there are limited menu options.    I got the sweet and spicy wings and a strawberry milk tea with bubbles.  Amazing.  There's limited seating and the food does not typically come out quickly (I think I waited 10 minutes for my chicken) so plan accordingly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8FbnfMDyB_nGXIzU0-Y2xA"
  },
  "N-utB7WUSLIabrzKvxapxg": {
    "date": "2/7/2015",
    "text": "Although the chicken is a little pricy, these are the best wings I've ever had in pittsburgh--not only are the drumsticks enormous (is that even from a chicken???), the skin is perfectly crispy and the sweet and spicy sauce was delicious! I got the \"small\" size of both drumsticks and wings and it was 7 pieces, which was pretty filling. I also got the takoyaki which was 9 pieces for $5, which is a steal considering that the only other place to get takoyaki sells 5 pieces for $8 or something. The mayo, scallions, and bonito flakes were all mind-meltingly delicious toppings, not to mention the sensuous way that the takoyaki itself melted in my mouth. It still tasted great after I reheated it later in the night.  Yes, the food was delicious, but what will bring me back to Chick'n Bubbly? Three words--Taro. Milkshake. Smoothie. First of all, this is my favorite beverage in the universe. The one they make here is the perfect balance between sugar and taro flavor. I'm crying just thinking about it; I should have gotten one to-go as well after I killed the large one that I bought with my dinner.  Thank you, Chick'n Bubbly. You have brought immense happiness to my innards.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "88bnyygk6fNt_sq6DrOykw"
  },
  "dVUR81owkDacQgNCNeqesw": {
    "date": "4/13/2016",
    "text": "Nice little place that produces Korean style chicken with bubble tea.  The chicken was very tasty.  Got the large bucket with 20 pieces.  I asked for 20 wings but they gave me 13 wings and 7 drumsticks.  Not sure why.  Maybe it was end of day and they didn't have enough wings.  But if you get a mixture of wings and drumsticks, you only get 15 pieces so I guess I made out.  The bubble tea was good but it's from powder.  I had the taro, wish there was some real taro pieces. And you can adjust the sweetness too.  Overall, not bad for Pitt area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "66JCCGQBbVvo33FMaabLpQ"
  },
  "sfic2D0ZxBuyQp2srRIf7Q": {
    "date": "2/1/2015",
    "text": "I'm pretty obsessed with mango smoothies, so this place rocks. The smoothies are fluffy and wonderful with just the right amount of tartness to sweetness. I'm a vegetarian and Chick'n Bubbly is not vegetarian-friendly (nor would I expect it to be, but I thought I would note this anyways).   Both sauces smell delicious, and the restaurant itself is extremely quaint, but seems to be popular with students regardless of its higher-than-average prices. There seems to be an abundance of bubble tea, smoothie, and even slushy flavors, and I plan on stopping in to try some more!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2_X5tC1F2sYmicko_f7Nxw"
  },
  "VRnSv_DsHv1UHYlYkf_apw": {
    "date": "12/27/2015",
    "text": "Overpriced but the food is pretty good. The chicken wings are pretty large and the batter is crispy. Main reason to come here is for the chicken wings which are really good only caveat is the price compared to the other establishments close by. The bubble tea is good too but a new place opened up down the street that is cheaper and better in that department. Do not order the chicken tenders its basically dried chicken tempura and very thin.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8uuh8jfFA3zUewBTbqZ59A"
  },
  "hHLt_0FXU78gpt0sLstQvQ": {
    "date": "9/23/2014",
    "text": "So I really like the wings at this place. Esp the combination (wings and drumstricks) in the garlic soy sauce. The seasoned french fries and pickled radishes are pretty good too. I don't really like the sweet and spicy sauce it's a little too sweet for me.   For their bubble tea they don't really add ice so it's lukewarm which makes it not so refreshing.  I went their twice before writing this review. The first time I went there I waited over 20 minutes for my order. They also seemed to not have nailed their operations quite yet since they didn't know how long the fried chicken had to cook in the frying machine. They constantly stuck a thermometer in each batch of fried kitchen to check if it was cooked or not.   The second time I went they stopped with the thermometer thing but I still waited over 20 minutes to get my order. Keep in mind it's a really small place so sometimes you have to wait outside for your order when all the seats are taken.   As for the ambiance it's pretty cute but again, extremely small. Service is pretty good too.  I would go back again just for their garlic soy wings but only if I have the patience to wait for 20 minutes to get it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j0JgA_wURIaF0iZqIf1FfQ"
  },
  "nMjZxX-HcVvrd-z-vZpA8w": {
    "date": "12/15/2014",
    "text": "First trip and not bad after taking a stressful test. Not bad milk tea but haven't eaten the chicken yet",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jysh8D8XKigLiCn2u_z9JQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Jasmine green milk tea",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jysh8D8XKigLiCn2u_z9JQ/o.jpg"
      }
    ],
    "user_id": "OVyBgRQORTrSNodNYPxJlQ"
  },
  "CJ4YxQJ5r-hrju7cZo0JBw": {
    "date": "1/27/2015",
    "text": "Chicken is good, but the pickled radish has really gone down the tubes. It used to be white and fresh and now its grey and bitter.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZJ7IDnM4ExySwhxPvrTyoQ",
        "caption": "Photo of Chick'n Bubbly - Pittsburgh, PA, United States. Radish used to be good, now gray and sad.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZJ7IDnM4ExySwhxPvrTyoQ/o.jpg"
      }
    ],
    "user_id": "vH1vI85ICDPGd0dxzzIbaA"
  },
  "pGTviMz4UZGSw5At2upLMA": {
    "date": "7/3/2017",
    "text": "Five stars for really friendly service and my sister's favorite milk tea bubble tea! We have a custom order, asking it to be blended like a frappe. Absolutely delicious! They also recognize us upon entering and already know our order. My mom got the mango bingsoo and was beyond satisfied. Love it here and will keep coming back plus recommending Chick'n Bubbly to friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-wChmsRI9Uh8WkYm6kelIQ"
  },
  "mz8TUsF1VGzEYhxpIei3yQ": {
    "date": "7/2/2016",
    "text": "The staff is awful and the staff is the dog of American. The staff treat Asian badly. Because of the staff mistakes, my bro and I wait there for half of hour for chicken wing. Finally, the staff told us she forgot to make the order. For customers who look like American, she seems like flunkey. For Asian, she is so stupid. Never go to that restaurant!",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ndae4T4h1nmnYZIWQkdZcA"
  },
  "czkQa3ZL0--CJyXjOg1rKA": {
    "date": "9/18/2014",
    "text": "Definitely recommended. It's the first debut of Korean-style chicken in the Pittsburgh eat scene. Crispy chicken among various korean-fried chicken style is the strongest feature of this place. You can order chicken with hot, soy source or half and half. (Actually, I prefer plain fried style with dipping source, but.. it's ok.) Hot source is not too much spicy, so it's easy to eat, you are not familiar with spicy flavor, though.   Combination with beer is absolutely fantastic! you can go to the Peter's pub in front of the place bringing take-out chicken. Only thing is a little bit slow to serve the food, but, it's ok. worth to wait. I have visited 4 times, and will visit again. Great place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1M2vBw5n8p8J0D73Z-QUIA"
  },
  "vI_qiygRYxNKsmvDEaj1qw": {
    "date": "7/15/2016",
    "text": "The chicken here is so good. I called in ahead of time for my most recent chicken order because the first time I came here, I literally waited over 30 minutes for my chicken. I've gotten the medium size both times to share with someone else BUT I think next time I will just get the large wings + drumsticks when sharing because I was still down to have more after both times (like actually I was still hungry and wanted more). Both the drumsticks and wings are really easy to eat because the meat is so tender and rolls off the bone (not like popeyes chicken thighs and breasts where it gets kind of hard to eat). They will split the sauce for your order, so I have had both options with no added heat, and while the sweet and spicy is really good, I am just going to get the soy garlic because it's actually even better. The two sauces are sweet instead of salty, but not too sweet for me. Your chicken comes drenched in your chosen godly sauce so it is nice and JOOCY but the skin is still super crispy and the skin to meat ratio is great since they only have wings and drummies. In fact, the chicken is so good I might even order a large to eat all by myself.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "a1qCiLY6M7qwEhmzIE7acQ"
  }
}