{
  "70e8UiW9Buk__fhJNbhqTQ": {
    "date": "5/25/2012",
    "text": "Angelo's has been a staple in Bloomfield for decades.  It's not an accident that it's still doing well.  Their pizza is some of the best in the city.  The crust is that great combination of crunchy/chewy.  As other reviewers said, they give you an ample portion of cheese on the pie, and it's high quality cheese that's ooey gooey--I mean that in the best possible way! :)  Their sauce is also very good, and it tastes homemade.  It's very simple:  tomatoes with some herbs combined to make the sauce.  The place is very basic:  a handful of tables, a counter where you order, the menu displayed above and behind the counter.  There's a TV mounted to the wall, usually turned to channel 11.  They have fountain drinks if you want to eat your pizza there.  The people there are nice and friendly.  For the quality of the pizza, it is an excellent value, and better tasting than any chain pizza.  I have not had their sandwiches, just stuck to the pizza.  But people that I've gone with have ordered sandwiches (the italian and the cheese steak) and said they were really good.  If you live on the east end and don't feel like eating there or picking it up, they do deliver.  But they're a popular spot, especially on game nights and weekends.  The person taking orders on the phone will usually tell you if it's an unusually long wait.  Give it a try--you won't be unhappy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4pRehidpIXTZsTK3sBrUeQ"
  },
  "45J58mEizuuV9Igdp9JvqA": {
    "date": "1/16/2015",
    "text": "Usually don't write review's however we love the pizza and would get it for the family every week, but the past week the pizza has not been the same. The crust was not like usual and to much sauce. We will be taking a sad break from ordering.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8YdGtV1nKe-gu-E7lUYjIw"
  },
  "dsBVrHdR4R4BVj4GHFad3Q": {
    "date": "9/8/2013",
    "text": "Sad to say, this wasn't the pie in the sky I was looking for. It all comes down to the crust--I threw it out. That should never happen. The crust wasn't enough like the bread from la gourmandine--if that bakery made pizza with the cheese (and even the sauce) from Angelos...now THAT could have some potential. So...still shopping around for a delivery and for a crust that bubbles up around the edges. It might have to do with the water or kneading or something?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqXXdLyVKlpckdu5odG5sw"
  },
  "OqvIva-Lgk8qqhlcB02-3w": {
    "date": "3/20/2011",
    "text": "Dateline: Friday the 18th. I'm at work, haulin' ass as always. A trio of co-workers are munching on a pizza. They catch me looking at them, knowing my passion for food, chuckling that I am not able to partake at the moment.   After a few minutes, 2 cuts are left.   \"Shit, two more pieces. I can't finish them, can you?  \"Naw man, I'm done.\"  \"Hey Darren come finish these, man!\"  I'm on 'em like a hyena on a carcass.   The cheese and sauce were of sturdy enough character, but I just couldn't enjoy that porous, dry, bread-like crust that tasted a week old.  \"Whadja think?\"  \"Eh, it was so-so.\"  \"Yeah, we thought so too. We just wanted to try 'em.\"  \"Thanks for the last two slices though.\"  \"Oh don't worry about it. We figgered you'd eat 'em.\"  \"At least I have something else to Yelp now.\"  \"Yelp? What the %^$#'s that?\"  Apparently some people around these parts still think the internet is for online poker and Youtube.",
    "rating": 3,
    "rated": {
      "funny": 9,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "n-iYg0RjQxe2J9t_CyFZzw": {
    "date": "8/9/2011",
    "text": "Angelo's Pizzeria was recently featured as a finalist for best hoagie in town and the only one on the list nearby. They also had a Vegetarian hoagie on the menu, so in the haste of a hunger-driven decision I called and ordered a veggie hoagie($7.75 - hold the mushrooms), mayo, and an order of fries($4).  We arrived at the shop about 10 minutes later and waited another 5 watching jeopardy while our food finished up. The store was clean, the dough was being rolled out by hand, and there were people eating inside. The pizza was square-sliced and looked good, but we didn't have any.  When we got home with the food, we started into the fries. They give you a lot - you get a small pizza box filled with them - an extra buck or so nets you cheese melted all over it. The fries were very tasty, and had a remnant taste of chicken wing to them. They were also very salty, which I prefer.  The hoagie was a different beast entirely. A few dots of grease on the outside of the paper could not prepare me for the damp towel of sandwich paper I would see when I opened it up.  The hoagie consisted mainly of grilled peppers and onions as advertised, but having asked for extra mayo(As Sarah S suggested) may have been a bit much in this case. They really gave me what I asked for, this thing may as well have been a mayo sandwich with lettuce and onions.  The taste was awesome and even with all of the grease the bread stayed crispy, but not crunchy as many roof-of-your-mouth-scraping sandwiches around town are.My real qualm is about the texture though, and I'm sure it applies most to the veggie hoagie, with no cheese or meat to provide resistance, it all just sinks and squishes around. They need something firm, something that provides some resistance - take Big Jim's, where roasted broccoli and carrots give a nice firm crunch to make you feel like you're eating solid food.  So while I give the taste an easy four stars, I have to deduct a point for the texture of the sandwich, hoping that maybe they will try to add a firmer vegetable to it to make eating it not feel quite as much like sausage gravy on a roll. However I'm sure if you go for a meat-laden variety it will be totally worth your time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B5FTjNWSgkAQ9UjOKVjGhw"
  },
  "D3LdHw38qd1H3x4XfLAETw": {
    "date": "8/27/2013",
    "text": "3.5 stars.  I've heard good praises about this place and stopped in.  Had single slice with mushroom and pepperoni, mushroom steak hoagie, and cheese fries.  The single slice was good.  It was thin and has a good slight crunch.  Only thing I was disappointing in is that they used canned mushrooms (distinct color) which doesn't taste the same as fresh mushrooms.  But it was satisfying overall.  The hoagie was good.  Decent size for the price.  They still used canned mushrooms but it was still satisfying overall.    I wish someone told us how big the cheese fries were.  Three of us ordered one thinking it was a simple appetizer with cheese.  However, it is a huge giant box of fries with mozzarella sprinkled on it.  I am pretty sure it could feed 8 people.  It was also decent.  Needed a little bit of salt but basically fries and mozzarella.   Overall, I found the experience average.  I would probably come back to try their pizza again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vy6bsyGB80NX24wddBb--g"
  },
  "0qBFP_RtitEMsYZ6rnAzqQ": {
    "date": "1/14/2016",
    "text": "We eat here weekly. Top 5 pizza joints in the Burgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y0X59ZwPp89jVkceROxTtA"
  },
  "J_-LkALvQWJ9XsyfHYII1Q": {
    "date": "10/12/2015",
    "text": "THE MOST AMAZING STEAK HOAGIE LIVES HERE!! Go!!  It is called Angelos special steak.  The pizza is inconsistent. Sometimes excellent and sometimes it is just good. They should really work on that. All of the cooks should do it the same.  I keep wanting to try other hoagies but I crave the Angelo's special and I go back for it... I'm sure that you will too!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s49XcBEol0Zf4HsvB6TC2A"
  },
  "njig-sr2oIltFAXHpftK8Q": {
    "date": "6/3/2013",
    "text": "I was skeptical about going to a typical pizza shop during a food tour in Bloomfield, but boy was I wrong. This pizza is really good and you can tell that they do not pick the cheap ingredients off of the shelf. The dough was perfect (cooked well, but kinda doughy) and the cheese was excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-2OB54nQ6FsGLUM-R1KXnA"
  },
  "11TGwzI6SwG3HEXlnsenvw": {
    "date": "12/11/2014",
    "text": "They get 1 star because less was not an option. Was told by someone at the hospital that the steak hoagies are great. Well either our opinions differ greatly on food or we just got hosed. Looked up the menu online. $9.00 for a lrg Angelo special. Think philly cheese steak. So I ordered 2 for myself and my gf. I asked for mine with well done peppers onions and mushrooms no lettuce or tomato. I get there and the total is over $24! So I ask why. I'm told \"oh yeah that's the owners fault he doesn't want to update the online website so it's a little out of date.\" A LITTLE!?!?? Two and a half dollars more is not a little. So I leave already feeling taken but hey they are big and they feel heavy so I'm still optimistic. WRONG AGAIN! The sandwiches nearly fell out through the grease soaked bag and found my sandwich covered in grease swimming lettuce and tomatoes with pale mushrooms and uncooked peppers. Swimming I tell you swimming in grease! If I have a heart atack I'll know why. Called to complain and was pretty much told it was my fault they became greasy because I took to long to get there! And that its all the owners fault about the price. Poor food poor excuses and apparently poor ownership. The next thing that should be poor is the owner because I will NEVER eat there again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q_gN1Dm54NsWJH2ZsAZ7FA"
  },
  "yChkgxKbNeXw4YR780podA": {
    "date": "9/6/2014",
    "text": "Sometimes I like to stop into a pizza place for one slice of pizza.  I have found that the places with the best pizza have \"horrible horrible\" individual slices.  The slices have often been sitting for a long time.  Then if the individual slices are reheated, it still is not quite right.  Then often these individual slices have a very limit amount of cheese and toppings.  Angelo's does not do this.  There individual slices are the BEST!!!!  Everytime I get one slice of pizza at Angelo's it is always pippin' HOT.  It has that just made t.  They are very generous with their toppings on the individual slices. Plus, their individual slices are huge.  I always get them to cut that one slice into two.  I tried to eat half of my slice at the shop and then take the other half home for later.  Their pizza is so delicious the other half often does not make it home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EXVKdlnrhpGGzyywEPa66A"
  },
  "352blDSHU86TAwzjvqHLpg": {
    "date": "10/15/2014",
    "text": "Love the home made mayo and ranch , But the service sucked and the wait was ridiculous! Ordered 4 cuts to eat in and 2 and a hoagie to go.... They served 3 others that came in after us for slices and gave us ALL of our food (30 minutes later) ...including the to go !!!  So in the end we had it all to go!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ftIi2PUuB2v-tPKkfR2apQ"
  },
  "RYQn3at6x_YkN8kR6Eo73A": {
    "date": "12/17/2011",
    "text": "Support this local business.  Good food, nice lady on the phone, and quick delivery. YUM! Never been to the actual restaurant, but i'm sure it's awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MrraKvLx-cMEoXED5x5emQ"
  },
  "b5wivRM12uQMk-AWtnPQGg": {
    "date": "2/26/2013",
    "text": "Great pizza and hoagies. The have what they call Boardwalk Cuts, huge slices which I think are only available on Wednesdays. They also have great Sicilian style thick cuts all the time as well as regular type pizza and all are outstanding. Their steak hoagies are heavy on the meat and it's good quality. This Bloomfield-Lawrenceville-Garfield area is packed with pizza shops, but Angelo's is the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "jeUgS6q6FU3h1960Jyuu0w"
  },
  "4XPrPTrOt7Hb0JyBhHal0Q": {
    "date": "10/15/2009",
    "text": "This is, by far, my favorite hoagie place in the entire city!!! I love it!!! I can't give a lot of insight on their pizza, although I know you can buy it by the slice, because I always get a cheesesteak. They are the best in the city!!! Make sure you ask for \"mayo.\" They don't use regular mayo, it is a garlicky, tasty, mmm...mmm good, finger-licken sauce. I always get extra. Yummy!!! The steak meat is excellent!!! It looks and tastes like it is hand-carved. Really good quality, no steak-umm's here. The price can't be beat.  I have their phone number committed to memory. I always call to place my order, then zoom on in 10 minutes later to pick it up.  The people that work there are great, and you can even see where they make the hoagies...right in front of you. Definitely worth it. By far the best hoagie shop in town. Give it a shot, you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "axpfEDUpHb2hkcUhCJgs8g"
  },
  "QXk5ighgJ6y2zpOJtGSaxw": {
    "date": "7/24/2016",
    "text": "We have been ordering from Angelos for years. In the last few months the quality is falling. If you order at lunch time they will tell you the wait is 45min to an hour. In reality it is more like 90 min. When the food finally comes it is lukewarm.  Last week we threw out French fries, cheese sticks, and most of one steak hoagie. What a waste of money and food! The hoagie in addition to being almost cold had very little steak on it,  This is not what we had experienced from Angelos over the years.  Sadly to say we wont be ordering from them again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "YloA3PQTeQzv4SEjJFHfzg"
  },
  "5bXQPN4W2MpJKPvb5E9skg": {
    "date": "6/5/2013",
    "text": "This is my new go-to pizza place.  After moving to Lawrenceville, I wasn't sure of where I could get a good pizza that also delivered.  Thanks to the latest Yelp Elite event, my question has been answered!  The crust is perfect - not too thin, and nice and crispy on the bottom.  The sauce to cheese ratio is also nice.  I learned that the cheese is from Penn Mac and you can totally tell.  It takes it up another notch.  I'm excited to try the different variations they have.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "m7bTLQo6u3PwdYyj22ITOA"
  },
  "5zJxpydqSy-fLXyb5nsTsQ": {
    "date": "3/23/2017",
    "text": "Don't write reviews often...but have to say this place is as good as advertised and then some. Legit za, with people that do it the right way. Crisp crust, soft/chewy dough, and perfect sauce to cheese ratio. Simply said, it was made to perfection, which seems to be hard to find anymore. Some of the best pie I've had in a while. Def my new go to spot when around the city. PROPS",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eXe9lAE2fTSxClfLN9d8DA"
  },
  "2uDM7kIzdUZE5mVbhaApAg": {
    "date": "6/18/2015",
    "text": "The pizza use to be good. I went there last Friday and got a pepperoni pizza and it was the worst pie I have ever tasted.  Also over priced I will never come back here and I will people how bad it was !",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UiIHV9-va2xf1cZlw5rujw"
  },
  "ri_tU7kHWnyo4eGJryPa7g": {
    "date": "2/24/2013",
    "text": "This place wasn't bad.  I did the Monday/Tuesday carry out special.  A cheese pizza for 7.99.  I added half ham and half onions.  The ham was thick chuncky slices.  Fail!  I like thin slices of ham on pizza so they get crispy.  Nothing special but nothing awful.  Very friendly staff!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nOcP-0PIg4REFX4JeR49aw"
  },
  "kYJrwa829IUJLILX3WN82Q": {
    "date": "7/20/2013",
    "text": "The large pizza is huge. Don't underestimate it.  Be sure to try the \"Angelo's Special\" sandwich with the homemade mayo sauce.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YMZX_osJutEQ8_311LLngA"
  },
  "zTfHuLAnuuWs01ijChGRdQ": {
    "date": "9/4/2015",
    "text": "My favorite cheesesteak. It's tied with Spak Brothers' Pittsburgh Steak as it's a saucier, meatier beast. Order it with the house sauce and all the toppings. You'll never crave Primanti's again.  Definitely has the usual pizza place vibe, but is clean and well lit and has surprisingly ample seating. Angelo's is also a surprisingly fun spot for people watching with the large front window and the number of locals and regulars that walk in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oc9mbpn1l6LXkYupiOZj0A"
  },
  "7VQH_TsjBAz0Ogqk0wUOJA": {
    "date": "7/14/2015",
    "text": "Best pizza I've had in a long time, white pizza with hot peppers, Sicilian style.  Garlic knots were great, piping hot with great flavor.  Will definitely stop here again when in town.  Good service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ngZMI2SrovKLiRueG0DEJQ"
  },
  "AK110yaY16IOetPRfwwKiA": {
    "date": "2/10/2015",
    "text": "I really really wanted a turkey hoagie... I called one day and they were completely out of turkey. Like wth. Out of turkey? So I called again the next week. FINALLY! They have some turkey!  So I ordered a turkey hoagie with a little bit of their homemade mayo and some Italian dressing. It was $10 for a whole. Not to bad of price because this hoagie was HUGE. It was okay... They added a lot more of the mayo than I would have liked and the Italian dressing was very oily so it made the sandwich extremely soggy and sloppy. Gross. I had to wipe some of the dressing off the bread, which made the hoagie manageable to eat and someone good.  I also hear they have free delivery! Yahoo!!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4xADtL7sI2DfiyUcwywLig"
  },
  "ksvfpk3v-fhkuBZi9cMn2w": {
    "date": "6/29/2015",
    "text": "WOW... Great location, Great pizza, Great customer service...Just had the white pizza and it was absolutely delicious one of the best pizza's I've ever had everything was super fresh!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2QUz-rrC7EItmVWvTkZMZw"
  },
  "7a0toJ2wiiW_faBMKSjCOQ": {
    "date": "9/6/2014",
    "text": "Honestly, the hoagies are fantastic, but their service is appalling. I ordered two hoagies and received one and a half. After calling and explaining the situation, Aaron, the \"manager\", rationalized that their hoagies are large and could send another half \"depends on how hungry you are\". ARE YOU SERIOUS?! I have never in my life heard of such asinine customer service. The girl on the phone was really nice though...if that counts for anything. They just lost a loyal customer...never again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_27sYG7siwGEg2sLubZxlA"
  },
  "bMo2M1SToZW6EW71yZSMqg": {
    "date": "5/5/2015",
    "text": "I stop all the time for their cheesesteak with mushrooms,  grilled onions and special sauce.  One of my favorite meals in the city.   Sometimes I also grab a slice,  which are pretty good as well.   I really need to try other selections they have but the cheesesteak is just SO good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8FbnfMDyB_nGXIzU0-Y2xA"
  },
  "XpeGOdbBRCHA_M4fo4VTKw": {
    "date": "2/2/2010",
    "text": "There are two types of food that I will go out of my way to try in each and every neighborhood I spend time in. Pizza and Mexican. Last night found me wanting something within walking distance and cheap. I called over to Angelo's and the pizza was ordered.   The service was fast and friendly and when I went to pick up the pizza the local hockey game was on the radio and the place was deserted. My pizza was just finishing up in the oven when I got there. For a large plain pizza it was 6$ (7.48$ with tax). This special is for carryout only!!  The pizza was huge. The crust was great, crispy on the edges and a medium thickness. The sauce was thicker and a bit tangy. There was a lot, A LOT, of cheese on the pizza. This caused a lot of grease. In all fairness, this was a great pizza for the size and the price. Was it in my top five pizzas of all time? No way. I'd opt for less sauce and cheese next time.  Considering the quality of service and the prices, I'd most certainly try this pizza/sub shop again. I think the next trip will be for subs though, rather than a pie.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "yfK0Od09W_D5jzXBzRgnlA"
  },
  "4KTg8hO-xyhuM32rILkCGg": {
    "date": "8/31/2015",
    "text": "i want to give 3.5 stars. Went in for the first time and had hoagies, they were delicious. We went again another time for the pizza but it was a super disappointment. I wouldn't pick it for a pizza spot but definetly for a hoagie spot",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "54yO7m1WzU8KlY3C-pEOYQ"
  },
  "RvAB8-h7QWb2LXNGdf4mbQ": {
    "date": "8/30/2016",
    "text": "My mom just visited and she wanted a steak hoagie. I took her to angelos because they have the best. Omg!!! It was the most amazing steak hoagie I or her have EVER had!!!! Ask for Andy and you won't be  disappointed, I promise. My mom was still talking about it 3 days later when she left and I can't wait to get another one...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SHzcqoEfAJct0h7uReWu4g"
  },
  "azE7dx5icEM2IlifP8R9gA": {
    "date": "12/8/2015",
    "text": "I used to love this place, but the service is horrible now. If you want something delivered you have to wait about 2 hours. Our food is ALWAYS wrong. Will not be coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "IH6C3PYCVScOjIwNsMKpjA"
  },
  "xc_4Jh0LPzoLfY2UQ-J4Cg": {
    "date": "1/20/2012",
    "text": "I love Angelo's! Every since I've moved to Bloomfield, this is my main pizza joint.  I have carried out, and had delivery.  The staff there is always friendly, and the pizza is delicious.  Delivery drivers are super  nice and quick! As for the pizza I can't stop raving.  I love the sauce and especially the amount of cheese they put on it! YUM!  Toppings are good, and always plentiful.    I will keep going back to Angelo's again and again and again....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Qb0ZfVOe33QVjNHGoGBabg"
  },
  "n3qxo4GIP5DwgjnU1r70xQ": {
    "date": "7/11/2012",
    "text": "The second time in my life that I ate steak I ate it at Angelo's. This was not a mistake.   Approaching the place from the front stacks of pizza boxes on the right hand side glare through the window if there is any sort of light outside. I guess no one wants to steal those. Walking in I nearly miss the black and white portrait of the Corleone family on the wall. Nice touch. We're in Sicily now.   The cashier let me stand far away as i decided. Somehow I like the space and waded there for moments longer than I needed. But, in fairness, after being a vegetarian all through college and only having steak once in my life, last month, I was making a difficult decision.   I ordered two half hoagies. One steak and one Italian. My friend Dave was supposed to be on this excursion with me, but he had to help his dad so I decided to get him a sandwich. Like I do with books (which Dave and I both love more than people) I don't decide which sandwich to eat or whether I will give Dave one or not. I do not get cheese on one of them because I am rather lactose intolerant. I do not get cheese on the steak hoagie, in order to trick my subconscious into thinking that I had a choice but simultaneously letting it know that I will be eating the steak. It all worked out.  I bit into this sandwich while reading about food. I'm not sure if the moment could have been better, reviewing some Amiri Baraka essay on African American food culture and biting into my warm, soft hoagie. So well blended together, each ingredient holding each other like lost lovers, I began to fear that somehow I had not been heard and there was cheese on the hoagie. I opened it up.  Nothing lay between those Italian bread slices but steak, Italian dressing, onions that looked seasoned, peppered, lettuce, and tomato. I think, \"Is that crack or cracked pepper?\" I'm not a believer in such great things unearned.   I look at the spotless red floor and then up to the open kitchen with the chef wearing a Steelers t-shirt with a \"7\" on it for Big Ben. He got sauce on it and almost looked as if he would faint. I wonder about that.  The cashier and the sandwich girl are the only ones who wear uniforms: a company t-shirt. I wish that I could wear short black shorts to work with a half apron that made it seem as if I had no bottoms at all.   The chef slings a pizza out of the oven into an Italy colored box. I grip mushrooms, tomato, and warm lettuce from my paper wrapping, to finish. I've never found a better way to be a part of this city than to find a sandwich shop unique to the neighborhood. Perfect. My stomach still agrees with itself: no more steak.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5VSPlsctD82josmpTV3pgw"
  },
  "UqVbY_5Pu2N2Dcud6akOsw": {
    "date": "11/18/2014",
    "text": "Best Pizza Shop in Bloomfield. Hands down one of the best Sicilian Pizzas around! Sicilian Cuts and Cheese Fries are my go to every time I dine here! Plus they sell Turner's Tea!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9oR11wRmLXX_wBUEj6vEA"
  },
  "oztzHWQZ_yaUM50QhyxGrA": {
    "date": "7/15/2014",
    "text": "Great pizza, all ingredients are fresh and made at the shop. Don't ever order dominoes in Bloomfield!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vqZCDJ8RpOU6nPJhUWi2jw"
  },
  "XIFU_gr_BoG-3AByRQ-uEg": {
    "date": "6/5/2017",
    "text": "Always fantastic. Pepperoni pizza is a must.  Any hoagie is great but Italian is the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OTtVmKiCzEiVp6lyyD7DeQ"
  },
  "vKADD9BA-utMmDv6JyOFAg": {
    "date": "1/15/2017",
    "text": "Best buffalo chicken pizza around, hands down. The boardwalk slices of regular pizza are absolutely fantastic! Service is always quick and have never had any issues here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fVAr-9ICfZMfJk9ow95cBg"
  },
  "VZP0Q7jVH8R6dyaO40g6_w": {
    "date": "8/25/2017",
    "text": "Solid. Pizza good, hoagie ok. Like their Sicilian",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a7jq39vgrg4XJoXd1eMwWA"
  },
  "KX4mDeWmeWaxO2gX84g5wQ": {
    "date": "6/23/2014",
    "text": "One of the best hoagies I have ever had. Warm and toasted. Great mayo. Large serving. Soft drinks are refillable. The 1980's atmosphere is not too impressive, but this is just a pizza shop. Great place to bring out of town guests. I will be back again and can't wait to try the Sicilian pizza.  I got mayo on the hoagie and was excellent, now I know why... It has a garlic flavor and I love garlic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RlKTGX9M_8Sjm0JHj5vdIQ",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RlKTGX9M_8Sjm0JHj5vdIQ/o.jpg"
      },
      {
        "img_id": "Ow0QQ4bC3jpbsveGHzX49g",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ow0QQ4bC3jpbsveGHzX49g/o.jpg"
      }
    ],
    "user_id": "Z-x16ARrjP5aUDHytR8gJw"
  },
  "_0sllW7UUiz3XM3XHIMToQ": {
    "date": "5/15/2016",
    "text": "The best steak hoagies, love the Angelos special  I ordered a lot of steak hoagies but Angelos is the best Real meat, cheese mushrooms , peppers, lettuce and tomato, add a little mayo or Italian dressing and you are all set It's big enough to eat one half and have the other for lunch the next day Gotta give it a try!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hkfZ-EDXvAQebF-OqZxzNQ"
  },
  "9Upe7bkmNXUjC17ZwpEkEQ": {
    "date": "7/27/2016",
    "text": "Meh basically sums it up... I think I am just used to New York pizza, which is closer to authentic Naples-style Italian pizza. The pizza I come across in Pittsburgh is much more doughy with a think sauce more like tomato paste. It reminds me of - sorry - Dominos or Papa Johns. Urgh. Cant anyone make a thin crust here in the Burgh?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "5iTdaHwTbms9D-Th3DNweQ"
  },
  "FYWVlL8_tpyU6Vqi3d4kvA": {
    "date": "3/26/2013",
    "text": "I would have to put Angelo's in the upper 10% of pizza joints here in Pittsburgh. They make you're standard medium thick crust, heavy cheese, heavy cooked sauce, heavy toppings pizza. That being said, they do each of those components better than most pizza shops. The crust is crispy and chewy and actually tastes like something, the cheese doesn't taste like cheap pre-shredded junk, and the sauce is flavorful enough to stand up to the heavy handed cheese and toppings.   Oh, and the pizza tastes great cold the next day so go ahead and order a little more than you need!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "SDiK9OgIjj7mVLAibKKb1Q",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States. 12 cut with Pepperoni, Black Olives, and Banana Peppers",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SDiK9OgIjj7mVLAibKKb1Q/o.jpg"
      }
    ],
    "user_id": "DOajn8AtMjNtCZ87YoIlwA"
  },
  "W4WdpUpVsQlJEbtGES25Lg": {
    "date": "2/22/2017",
    "text": "super yinzer guys behind the counter and perhaps a mafia meeting was in session on the evening that I picked up my pizza, but the toppings were plentiful but not overwhelming, the crust had a great floury puffyness to it, and the cheese was thick and melty. Would certainly order again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tLosSC_fuzi2hU1qA2g8sA"
  },
  "g2h4MP_AsY4RgwY1tkkEwg": {
    "date": "8/26/2015",
    "text": "I want to give this joint 5 stars because when made correctly, they have the best pie in Pittsburgh... I am an east coast pizza snob and really not into Pittsburgh Pizza; however I Angelo's at at least once or twice a week   When the man with long blond hair (I think his name is Mike) works, the pizza is 10/10....anyone else and I end up with a slice that's half thick crust/half thin....   Overall Angelo's is still the BEST PIZZA shop in pittsburgh.... Go check it out, like now!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ChHjObLDwenhrm_iH6XSWw"
  },
  "c9eiZmPuSu9XRqSaw4mhUQ": {
    "date": "8/28/2014",
    "text": "Wow! The pepperoni pizza was so good I wanted to fill my pillow with it so I could dream about Angelo's every night!  Very tasty crust. Full flavored sauce. Plenty of cheese. Nice pepperonis that curl up a little. Perfect thin crust pepperoni pizza!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yYGGiSAugDu6lwCAn1KNOQ"
  },
  "ro8PDGOQ0fSl3Xnpfl_lXA": {
    "date": "8/22/2017",
    "text": "Ate here for the first time at the Italian festival and came back the next day!!!  Their  pizza is awesome I can't stop thinking about it!  Talked to a lot of other customers who said to come back for their hoagies!!! Also talked with the staff who were great people!!! We love to support a local business too!!!  Oh their garlic knots are soooo great!!  Can't say enough about this place!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xjtRUCwDRjv0scbru5IYOA"
  },
  "1E1dDi1POsvxhhTw3ZaoYw": {
    "date": "3/19/2015",
    "text": "Best Square Pizza in Bloomfield.  Sicilian Style all the way with these folks. The fry portions are of a size from a time before meddling liberals and worth every cent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YlNH622nQzakY99Lahk1Pw"
  },
  "5GMaWRyJ6bRo_kGsqDb1SA": {
    "date": "11/7/2011",
    "text": "I'm having an affair. A pizza affair. I have forsaken my darling Adrian's for Angelo's... And it's all because of a white pizza.   Okay, for realz now: Angelo's white pizza is ridiculously delicious. It comes with tomatoes. I added pepperoni, 'cause I was feeling kinda wild. When the pizza arrived and I opened the lid, I had to gasp. The cheese! Ohh, the glorious cheese!  There were regal mountains of ricotta... Majestic valleys of melted mozzarella... Fragrant Italian herbs infiltrated my nostrils... Why am I using the word \"nostrils\" in a restaurant review? Gross.   Anyway, it took all my willpower not to have a pizza eating contest with myself right then and there. You just have to try this pizza. The crust, the tomato, and the pepperoni are all awesome, too, but trust me -- if you like cheese (and who doesn't), you'll love this.  On top of that, their fries are fresh and served in lah-arge portions, and their steak, cheese, and mushroom sandwich is phenomenal. I get it sans the tomato and lettuce -- but keep the onions and mayo. The bread is all nice and toasty, and I swear there's some secret ingredient in there that is a magical a flavor booster, 'cause it's just SO delish!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "HwizP9hLnNGeXcByrApuUg",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States. Mmm... Ricotta cheese!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HwizP9hLnNGeXcByrApuUg/o.jpg"
      }
    ],
    "user_id": "GLjJ1WZDmVuCguPr7mKw5Q"
  },
  "fBwCLAZZ8ixcqbkzUju2sg": {
    "date": "3/1/2012",
    "text": "I cannot say much for the pizza having never had it (YET that is) but I have to say I love their sandwiches/hoagies.  The Italian one never disappoints!    The nice thing here is they actually listen to what you do and do not want on things (seems like a lot of places do not do this anymore).    I am definitely keep Angelo's on my speed dial as there are a lot of other items I cannot wait to try now that the sandwiches have been satisfying on multiple occasions!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLVq7VSJBHZwqurwWoCmpg"
  },
  "-esPF65aH-qrkZfuHWwUqA": {
    "date": "5/2/2014",
    "text": "I am not really certain how this place is getting the stellar reviews that it has. we just had a quick bite there last night and it was easily one of the worst meals that I have ever had the pleasure of paying for. While the people running the shop were lovely, it was not worth the $17 or so we paid.  I had small cheese steak sub - asking only for mayo and lettuce. you would think that might be a nice time to let me know that they use some sort of house garlic-herb mayo instead of actual mayo. but no. So after a good bit of waiting my sub comes out with this weird speckly dressing on top of the lettuce... yes, this is that mayo - which is disgusting. I thought it was ranch and that is when he lady, with a smile, explained it was their house mayo... no, they don't use regular mayo here.   so, let me tell you about this mayo:  1. it is heavily flavored with garlic powder - which tastes seriously like chemicals on a good day and just should not be considered food in any way shape or form. Mixed in with this were some dried herbs - maybe an italian mix? who knows. all I could taste was the overwhelming chemical, fake garlic flavor. Hey, I love garlic and cook with it daily - mind you I actually use the real stuff.   2. it is really thin... I mean thin like salad dressing, runny, thin. Um, isn't mayo supposed to be thick and spreadable? even the stuff you see at subway is thicker. this stuff tasted like really cheap, bad, ranch dressing.  So, after giving it a good effort to try to eat this \"sub\" - I gave up and picked off the bread on the top of the sub - the bread was pretty stellar though. still hungry I decided to try to scrap off the mayo/lettuce disaster and go for the meat and cheese. um... salt? the meat, which suspiciously looked like those thin sheets of steak-um had zero flavor. one bite and I rejected it. While we are talking about the meat - why use this garbage? I am paying almost 6 bucks for this sub. I want to see yummy chopped up steak bits like you see at even a mall sub shop. not this grey, disgusting 1980s looking flavorless \"meat\".  At least the bottom of the sub roll was salvageable... I ate the bread.   On to the pizza. My husband had two slices of pepperoni and my daughter had a slice of plain cheese.   Ok, pizza. well, this too was a massive disappointment. since I was still hungry after dumping the majority of my sub I tried both of their pizza slices. it reminded me of a nice store-bought frozen pizza. yes, bland. bad sauce with flavorless cheese.   My husband is a freak for pepperoni pizza and of the two slices he almost finished one of them. yes, more for the garbage. My daughter? she is three.. she isn't really a foodie (yet) but she got thru some of her cheese pizza... she actually spit some of it out but to be fair - she is three. I tried her pizza and honestly, all I could manage to somewhat enjoy was the crust which was nothing to rave about but it was tolerable.   To provide a baseline - we typically order from Rialto's and while they are not terrible they decent enough for a sub shop - pizza place.  this place... ugh. never. again. ever. We ended up throwing out about 80% of what we paid for. This place insults their customers with sub-par, dated, poor quality food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7bymkn2vy7QV2ry9TDWraw"
  },
  "a4p3ZNwuzwS-zoHnKUK6jA": {
    "date": "1/29/2016",
    "text": "I live in the neighborhood and had walked by more than a few times and noticed the local Cops often coming and going here.  ....Which initially alarmed be as I thought something was wrong.  Turns out, they're there a lot because ITS DAMN GOOD PIZZA.  Think back to that perfect slice you had once... the perfect cheese that isn't too greasy, but still gets that nice stringy-ness to it?  That sauce that's not over-the-top, but compliments the cheese, and then the crust, fluffy enough but not too thick.  That's Angelos.  Fresh and hot, cold the next day - both amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T8eAmI1vYNf4SD5XQuHimA"
  },
  "1BkJ0LmkmRErQp-ufeR_kA": {
    "date": "6/15/2016",
    "text": "I have been to alot of nice pizza places all over the world, and I cook my own pizza (my favorite food). So I am a little picky about my pizza I had just finished my workout class and my buddies and me went to go get pizza its nearby why not?   It was about average nothing special but they were nice at the desk and the food was well cooked.  The atmosphere was really nice, clean they had alot of Pittsburgh history framed up on the walls. Which is really cool for out of town-ers to see",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xDNrqnZrpCSOLoMVCCi4Dg"
  },
  "M5bDAaUy6scLzmyl1Aa5Fw": {
    "date": "7/12/2016",
    "text": "If you get a hoagie...  And you must get a hoagie, try the mayo on it... Very good. I can eat that stuff by the spoonful. Pizza is also very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "si9h_0QEewk01s-vozGTyA"
  },
  "K7nR9cF-1v2tobXixwZVkQ": {
    "date": "9/11/2015",
    "text": "If you're in to typical Pittsburgh pizza then this place is for you. The pizza cooks are named oily and greasy...or at least that's what the final product would suggest. The hoagies are far better than the pizza...but not by much. I'll eat here on occasion, but I would never bring anyone here. Coming to Angelo's, for me, is purely an exercise in self reliance.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dUGwfQfKYiM3qWt-FvVPZQ"
  },
  "baP6dOgkooT1Mc9Sserllg": {
    "date": "1/3/2015",
    "text": "They have the best cheese steak hoagie around.   You have to get it with both mayonnaise and Italian dressing.  Naturally you need lettuce and tomato.   Been coming here for over 40 years. They will also fry  the onions which have a better flavor than raw onions. Staff is stable so you count on the good tasting good every time.  I live about 8 miles away and will stop in every time I'm in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5ynXDKDneOmM6e-qsiKqjQ",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5ynXDKDneOmM6e-qsiKqjQ/o.jpg"
      }
    ],
    "user_id": "xzBehPGrraBZNg61hnI77A"
  },
  "oBUR-YxqIrAYI5lAhvZStw": {
    "date": "8/24/2018",
    "text": "The Italian wedgie is the best thing I've ever eaten.  Good quality meat and bread unlike all the other pizza hoagie chain shops in the east end.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8kp9YC9PYTU7noGOf_o4kA"
  },
  "sB0zylJk5c7ozK6xmr8Jqg": {
    "date": "2/19/2019",
    "text": "Best pizza/sub place in Pittsburgh IMO. Mineo's and Aiello's are popular answers for \"the best pizza in Pittsburgh\" but it's my honest opinion that Angelo's is better. I've gone here for a long time. They just recently moved to a new location in a brand new building right next to their original location. The new location stands out a lot more where as before you might not have noticed it if you were just walking or driving past. Still the same people and the food is still every bit as good. The pizza is excellent, but I think the subs and french fries are the best items on the menu. The homemade mayo is a must on any of the subs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nJYCZ9KavgomNC0dNM-E2g"
  },
  "IrHF3KSPtoSBWL8jDF8Piw": {
    "date": "1/9/2019",
    "text": "Great pizza, the food is excellent. If near by try the Angelo Special steak sub !! You will thank me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fgx-5fLjOte6A-zUAAcAAQ"
  },
  "9KzvaeVbVZ9d-8Nb5nwOTA": {
    "date": "4/20/2019",
    "text": "I grew up in Queens, in a neighborhood which in the '60s and '70s had about a dozen pizzerias.  Having grown up with New York pizza, naturally it is my favorite type. Angelo's is the only pizzeria I've found in Pittsburgh that makes the pizza I grew up eating. It is, perhaps, better than most of my childhood haunts.  Reasons why: One, the crust is buttery, substantial, and cooked exactly right (when they don't leave slices in the oven too long when reheating). It is crusty along the edges, flexible in the middle--you can fold it--and with just enough char. Two, slices are super-big. Three, toppings that I've tried are very good, especially the sausage, pepperoni, and banana peppers. And, having recently moved into new space, it's clean and comfortable. One complaint: how about offering meatball as a topping option? Excellent pizza. When they're busy service can be slow. I suspect because they never have more then one staffer making pizza.  Also, the side salad is horrible--a few pieces of lettuce and hardly anything else. I love a salad with a slice or two.  Too bad the salad is not good here. But go for the pizza if you like NY style. Or if you're never tried it and want to know what it tastes like.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ElA-PSBNl45KFH6uMJhGaA"
  },
  "ShN2o52tL8-MaSnD1aHXrA": {
    "date": "6/2/2018",
    "text": "Ordered a deluxe (4 toppings) pizza and a small salad. I like that you can check off the items you want included in your salad and not get up charged for each one. The pizza was decent. The crust is good but the sauce a little lacking (for my taste). I prefer fresh mushrooms over canned.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D8ckGhPA9lMUPR5nTe1nIQ"
  },
  "Dr_8eBNFD5Ygh5AQnx-AdA": {
    "date": "10/18/2018",
    "text": "Pizza taste authentic! Very nice atmosphere and the workers are always super friendly no matter how busy they are. The cheese sticks and hoagies are very good too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2H3PyftDlizkICoTdm-4Bw"
  },
  "lQPZmsFAlCCocB0CppFk2Q": {
    "date": "5/12/2016",
    "text": "Another perk living in Bloomfield...Angelo's! The pizza is good but the hoagies are even better. I can't believe how filling the sandwiches are. Half hoagie is dinner and lunch the next day. However, I have eaten the entire half in one sitting because I just couldn't stop myself. My faves are the steak and Italian hoagies.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v30l_bKkJofX0QA-pDNjGQ",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States. Sicilian slice.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/v30l_bKkJofX0QA-pDNjGQ/o.jpg"
      },
      {
        "img_id": "GicYsbSXQfDcVjngYWpr6w",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States. Steak hoagie with green pepper and onion.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GicYsbSXQfDcVjngYWpr6w/o.jpg"
      },
      {
        "img_id": "KL825GimhYXvWIjBlBvQmg",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States. Onion rings.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KL825GimhYXvWIjBlBvQmg/o.jpg"
      }
    ],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "rhyCBSB26U1caHA-Zhrh6g": {
    "date": "8/20/2017",
    "text": "Thin pizza here is really damn good, some of my favorite in Pittsburgh and the highlight of Italian fest for me.   Nice job on the pizza Angelo.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9tGv2Qv7gwHFOmfBaRs1jQ"
  },
  "mP5Db0vwV67feTGH8sPmKw": {
    "date": "5/26/2018",
    "text": "Very frustrated!!! I tried Angelo's for the first and last time today! I saw they had online ordering so I placed an order. At the end it states you should get an email confirmation of the order. After about 15 min. of not getting a confirmation I tried to call...no answer so I waited a little longer. I did get the confirmation email but the delivery time was left blank. After waiting about 40 min. I thought I would try to call again to see how long it would be. Still no answer. I double checked the # just to make sure & it was right. I kept trying to call every 5-10 min. No answer & no emails. I would gone to pick it up but I didn't have a car tonight. After waiting 1.5 hours. I ordered from another place. Angelo's never came or called or emailed. They will be hearing from me tomorrow. I better get my money back. Worst delivery experience ever!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "g-y-j_kz-uXnpzkluQfHag"
  },
  "8HU4TzVK8pUqwCIA-Y7DRg": {
    "date": "8/26/2018",
    "text": "The steak wedgies are amazing as are the cheese fries. The pizza is delicious. The meatball hoagies are great. Finally, the fish sandwich is the best in the city. We eat at Angelo's at least once a week and thoroughly enjoy it. Thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ONXd--bEL_qnGLV0ozKsLg"
  },
  "LKKdsDx1_VqKHQc0mnMUiw": {
    "date": "11/20/2017",
    "text": "Some pretty good pizza. The sausage was in bits, like bacon, and as a result tasted like bacon. Good stuff, would recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g4ptSwb0C1b7PYDo8lHDpQ"
  },
  "Ah_Qii2IdLw1QBlsJz_EEA": {
    "date": "9/9/2015",
    "text": "Angelo's has by far and without question the best hoagies in town. In fact I'd be hard pressed to think of better I've had anywhere. Maybe it's the homemade dressing (a creamy mayo/Italian concoction they call mayonnaise), maybe it's the fresh meats and bread, maybe it's the way the name them is the pizza oven... I don't know. It's probably all the above. My favorites are the capicolla &  mushroom cheesesteak.   The pizza is also very very good, but the subs are so outstanding it's tough not to go with those. I also love the fresh made garlic knots.   The ambiance here is nothing special, but the food more than makes up for it. The only thing keeping me from a 5-star review is they don't do residential delivery. The hoagie is worth the walk, but someone else bringing it to me would just be perfect, especially if it's pizza I want them I'm probably being lazy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "rVpDJPkoTJir71fMzvQ_XQ",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States. Myriad readers choice awards for the hoagies and pizza.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rVpDJPkoTJir71fMzvQ_XQ/o.jpg"
      },
      {
        "img_id": "DJT9vikEuZ5rjJynjNRR3A",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DJT9vikEuZ5rjJynjNRR3A/o.jpg"
      }
    ],
    "user_id": "Rw1AysawQfy1Y8kLlO55ZA"
  },
  "-jP1W3T_IHYugIcMKiPpjQ": {
    "date": "12/14/2017",
    "text": "I've tried a lot of pizza places in Pittsburgh... and IMO Angelo's is the best. I've never gotten a bad one and they are consistently good.   Definitely a must try for \"Burghers\"",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KY2zBvBl_8G4uMZ9N1QUGA"
  },
  "CTnXURVnhxg1EvgybpBmDw": {
    "date": "6/15/2018",
    "text": "I love Grilled Chicken Salad, one the best around. Their homemade ranch dressing is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YaPOUAZPF2cC0CHSnZjUtA"
  },
  "3-TJvz1xDjSgzFQcEJWNHw": {
    "date": "6/9/2016",
    "text": "BAD SERVICE!!! I had never been to this Pizzeria before but was driving by and figured what the heck, I'm hungry. So I asked for two cuts, and they said it would be 10 to 15 minutes. I Shrugged my shoulders and waited. 15 minutes later I came back, the guy at the oven was pulling them out of the oven and he looked over to the guy next to him and said \"Shit, I fucked up, they were supposed to be cheese\" - and they had pepperoni on them. I was standing right there on the other side of the counter. The boss guy Shrugged his shoulders and said \"Here,  look out\" threw together another 2 slices of  cheese and put them in the oven and said \"it's handled.\" WTF!!?? UH, WHAT ABOUT, OH SORRY, DUDE , OR A FREE CUT!? BAD FKN SERVICE ---- And they knew I was standing right there!!! I walked over to the woman at the register and said what happened to my slices? AND she said \"They'll be out in a minute.\" Total cover up. It was all I could do not to make a scene. Fuck that I don't need to be disrespected like that. I'm not going to stand there and argue with him like an asshole... I just never ever will eat there again --- and the pizza was mediocre.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Xk6wSHl1tsMNF2oNRDIC7w",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Xk6wSHl1tsMNF2oNRDIC7w/o.jpg"
      }
    ],
    "user_id": "sfoKta649fOT6wgOeha3NA"
  },
  "zIlCfAUn7UuHvWb249Md7A": {
    "date": "6/14/2016",
    "text": "Nice neighborhood pizzeria with great pizza! We were nearby, waiting for a repair to be done and stopped in for a small pie. Friendly, and good food!  And of course since we were in Pittsburgh it was also a Pens fan-friendly place. Always a plus during the Stanley Cup Final!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fXoi8S5ChYiR5NVxqRhOCw",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States. Best tip cup ever!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fXoi8S5ChYiR5NVxqRhOCw/o.jpg"
      }
    ],
    "user_id": "6Xx6XF0AsmpESagQplDYRg"
  },
  "ULkdMIEwh6Z5Fu4EwWfFxQ": {
    "date": "8/8/2016",
    "text": "Always good, always consistent!  Quality meats and cheese.  Just the right amount of grease!  The only local pizza that is not disappointing that delivers to Highland Park.    Try the white pizza too.  Yum!  Wish they were open later on the weekends for late night pizza, but it's probably better this way (for my health and figure).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-w0DqWnMxVIuSCe8pMnn9g"
  },
  "HvAHhICGZzb9xWclsZszhg": {
    "date": "5/4/2017",
    "text": "Great Sicilian and normal pizza wish they had more traditional toppings like basil but it doesn't seem like any local spots do... kind of weird but still a great pie!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YNlWrL4_dKCkTWYxFJ8sMw"
  },
  "6RCSrXSE6TycSDPkOvqpig": {
    "date": "1/30/2018",
    "text": "Angelo's is definitely my favorite pizza joint in Pittsburgh. The delivery is fast, the food is amazing, the portions are huge, and the prices are affordable. My go-to food for this place is the steak wedgie, this carbohydrate wrapped, heart attack inducing goodness is so delicious that I find it hard to put it down once I get started on it. I definitely recommend coming here, I'd write down more but I don't know what else to tell people about a pizzeria that isn't already obvious due to it being a pizzeria.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_NAMDCaFiT1sjDVn16fYAA"
  },
  "VGB96HxSMxLHrErQiCswJw": {
    "date": "5/26/2017",
    "text": "This was our first time ordering from here and will be our last. We called at 11am on a Friday, ordered 2 pizzas (one individual and one large- nothing crazy) to be delivered 1 mile away, and waited 2 hours with no explanation upon delivery.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7rWhXj5ZgYRz-cOXz0dUbw"
  },
  "zOkselkPpD8AQ-DX2V-pug": {
    "date": "4/18/2019",
    "text": "I love Angelo's! Their steak hoagie is one of my favorite things to eat in Bloomfield. Their homemade mayo really kicks it up a notch!  Their pizza is really good as well - I love the doughy balance they achieve. If you like ranch dressing, definitely order a side of theirs, as it is also homemade, and absolutely delicious!  The staff is all really nice, too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jsqCuhjQeX_hfOdxkJpPNg"
  },
  "PcdKe5ioT0Y0ZNba2zI5pQ": {
    "date": "8/22/2019",
    "text": "I was really upset with the personnel here. Unfortunately, the woman working the cash register seemed to be very miserable. All of my coworkers said the same. She definitely wasn't nice and her attitude was extremely crappy. However, I will usually let that go if the food ends up being good! Well....they never put my order in at all. And I wasn't able to wait another 15 minutes for it. So I never got the food that I wanted. Instead, had two massive slices of pizza that were lukewarm at best. The only reason I'm giving 2 stars is because she did give me my money back without me having to ask. Only thing I liked about this place was the ranch!!! That they charged my friend .75 cents for......Not a big deal, but that seems a bit expensive for a little ranch cup.   I was definitely disappointed with the service here, and don't think I'll be returning. There are plenty of other places to eat in the area that I would recommend over this spot.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LC1N1SFW-MaLWiq6Du1oCQ"
  },
  "ZmsC5ffTtfedcxMucOXb1w": {
    "date": "9/4/2019",
    "text": "That special mayo sauce is so yummy! First time trying a hoagie and it was good! The bread was toasted just right. Tomato was cut nice and thick. Plenty of meat and melty cheese. The sauce is the extra ingredient that makes the sandwich. The pizza slice was very good and nice sized as well. We did delivery and actually came sooner than time given which was great because we were hungry! Driver was friendly and ensured we had the correct order. Will ordered from again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hRPv45L1XAgj1Fs2CLH9Xw",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States. White pizza slice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hRPv45L1XAgj1Fs2CLH9Xw/o.jpg"
      },
      {
        "img_id": "0RR696xE7EpkpDWtSglazw",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States. Whole steak and cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0RR696xE7EpkpDWtSglazw/o.jpg"
      }
    ],
    "user_id": "pLy8-MTpmY-xIKrfdSv1CA"
  },
  "WkwTkwGYLGW2W6ZNKAIFAg": {
    "date": "2/13/2019",
    "text": "Angelo's is my go-to place in Bloomfield when I want a good hoagie. I've gotten many different types and they have all been great. I especially like the steak one and you have got to get the mayo on it. They have their own homemade garlic mayo and that's what really makes it! I haven't had their regular pizza here but my usual is their white pizza. It is flavorful and comes with fresh tomatoes and ricotta. They are also pretty quick for takeout orders. Surprisingly I feel there are limited good options for pizza places in the area that aren't chains so I'm glad to have this as an option.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qrVAvNmRBAYsXuqjl7jR3w"
  },
  "fO7yzlrne6rBt7nYOAiojQ": {
    "date": "3/26/2019",
    "text": "Literally the best Italian hoagies in the city of Pittsburgh. With homemade mayonnaise and Italian dressing, you really can't go wrong. If you get the cheese fries, which i also recommend, DO NOT open the container for at least 5-10 minutes after you get your order. That way all the cheese melts and your fries are perfect, spend an extra 50 cents on the ranch dressing too. Totally worth it. 10/10 all around the perfect pizza joint",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s-LiEKAwOzBNIEVrZ9zvAg"
  },
  "W5WzrIvyMju5i3KJEPPt0A": {
    "date": "6/14/2019",
    "text": "This steak hoagie is good l, not the best I've had but the quality of meat is good. Size is great for the price",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SV9H5TaOjE9gucHb6lZg9w"
  },
  "FbWg8xkv2Pkf1hUlv9xXGw": {
    "date": "8/1/2019",
    "text": "Absolutely, positively the best steak hoagie on the planet. I originally got one when working in the area for a while in the late 90s and cannot be in the area without getting one. Also the homemade mayo is what beings it all together.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9o0dacYrXHhdRKhcUmrGwA"
  },
  "bVAkRjCFR4XXhxtGGoPPJw": {
    "date": "6/17/2019",
    "text": "This pizza is my FAVORITE is Pittsburgh! I am kicking myself for living so close for a long period of time and never giving it a try until a few months ago! It is seriously so good: affordable, generous toppings, average prices, and high quality. Customer service is always really good, the new renovations are bright and beautiful (though I still loved it before), and they deliver. The crust is also a perfect combination of chewy and crunchy; it's a great balance. Definitely give it a try if you're in the Bloomfield area craving some pizza! I feel hungry just writing this.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dci5kLLxI3KVZ5mLO9ShxA"
  },
  "8KGF5agfCOV7rLOOtJ6R_Q": {
    "date": "4/29/2019",
    "text": "Best of everything the Posteraro family does it right! Killer hoagies and pizza.   Amazing dressings and one of a kind \"Mayo\".",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WXnyrvnKzkFd0LAm4ahhZg"
  },
  "aygTPB9WuL7rAOmnD1HM1A": {
    "date": "4/24/2019",
    "text": "Im not one to get on here and complain but i figured i needed to address this situation. I tried to even see if i could email privately but no good. I dined in at 4-24 approximately 4:30pm and while eating i saw a lady who was making french fries, pick a sore on her right arm, grab a napkin (cuz it was bleeding) wipe the blood off and just continue cooking. She proceeded to grab bacon from the reach in cooler in the front of the restaurant with no gloves on and no hand washing went on AT ALL. If you dont believe me and you have cameras I'd check it out. Im in the industry and knowing what kind of peoblem this is i had to let you all know. My meal was absolutely fantastic and i hate im on here for this but something like that could potentially be really dangerous. I hope this gets handled correctly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SglxznMBrbESA2KyM50KYQ"
  },
  "5Bu4g_xkDC37gXqjs6qgHg": {
    "date": "10/16/2017",
    "text": "I'm yet to try the pizza here. I keep getting the subs or sandwiches. Eventually though. On a nice sunny day it's got a little patio seating. Couple of three tables . Nothing fancy. Quick service and friendly staff. Food is very good and haven't had any complaints. I like the mafiosi themed posters, not that they did not feel nostalgic at all.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RWrYvFS3Ky37jtsm6ioKng",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RWrYvFS3Ky37jtsm6ioKng/o.jpg"
      },
      {
        "img_id": "-8C5Obd3Vuf55zqnec0uJA",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-8C5Obd3Vuf55zqnec0uJA/o.jpg"
      },
      {
        "img_id": "Mt_K1Xm0qBLLZfHFkm40BQ",
        "caption": "Photo of Angelo's Pizzeria - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Mt_K1Xm0qBLLZfHFkm40BQ/o.jpg"
      }
    ],
    "user_id": "kD_FScl4YPpVFjN03GW2Cg"
  },
  "157hrviJewl0z3NviRdR5w": {
    "date": "7/21/2017",
    "text": "My coworkers have been raving about this place for a few weeks so I decided that I would give it a try finally.  My coworkers have ordered from this place for almost a straight week and a half.   I have been trying to watch what I eat lately but decided that today could be a cheat day, good thing I did.    Looking over the menu and you find that it is fairly simply and straight to the point.  Nothing extravagant, and kind of what you would expect from place like this in the city.  I wasn't looking to go over the top with what I ordered and decided to stick to the appetizer portion of the menu.  Even though I thought this was a good idea with the eating light thought I had going, what I got when it arrived threw that out the window.  I'm not complaining about that, in fact this will probably keep me coming back here time and again.  I had ordered the whole portion cheese fries.  I wanted some starch in my life today and that they delivered.  Tons of fresh cut fries smothered with mozzarella cheese.  I tried my hardest to down this monster of an appetizer, but my stomach failed me today.    My coworkers ordered an array of items which included garlic knots, Stromboli, white pizza and a hoagie.  All items smelled delicious but because my coworkers are like me at lunch time during work, there was no sharing.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "la4N23Pu8_jRnqdaEtsDrQ": {
    "date": "4/13/2018",
    "text": "The Italian Hoagie here is just the best. The half is huge - yet I never feel the need to stop eating until it's gone.   Everything I've had here is delicious, but gawd that Italian Hoagie is something special.   Their pizza is good too. For the price though, I'm all hoagies all day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wDzVVCChqZ3jXPa1ayHu7g"
  },
  "TcrverQLUlv1WJa9AzXfbA": {
    "date": "6/16/2018",
    "text": "I've been coming to Angelo's for about 3 years now and it has consistently been my favorite pizza joint. The boardwalk slices are absolutely amazing and fairly priced. They have award winning hoagies that are delish (but I always go for the slices) and their employees are very welcoming. If you're looking for pizza in the east end, Angelo's is your place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6CT1mzzfZHNl3gq-UKgwMA"
  },
  "Ggq7bnsiXFG990GE1lUXMA": {
    "date": "3/8/2019",
    "text": "Worst pizza experience ever. Three hours to get one large pizza delivered. Horrible customer service. Will never order from here again. Owner could not be bothered to get on the phone with me or come up to the counter when I went in to discuss the issue.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dp_2ngiYTQFHPT9mOn87kA"
  },
  "jKOwCtQOtCVfBNamqZt_pg": {
    "date": "5/1/2019",
    "text": "They forget your food and when you call they just say sorry and hang up. Terrible service when they are ready to leave. You choose the job so do your job!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hkyd36DwYnKjz-lgS5ia7g"
  },
  "K9oBdxO5n500OgwTaDOQww": {
    "date": "3/31/2017",
    "text": "I went here on a whim, and very hungry! I was surprised to find a favorite in their meatball sub. It is delicious on so many levels. The bread really makes it I think. I'm not sure if they bake it in house or buy fresh and local, but it's always toasted perfectly but soft on the inside. Plus, they pile on the mozzarella cheese and have a good ratio of sauce (I love my marinara sauce!).   Just keep in mind if you're popping in you may have to wait for about 15 minutes, but that ensures you're getting a fresh made dish. If you're really in a hurry make sure you call ahead. I really need to take a break from the meatballs sub, if possible, and try their pizza next!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 11,
      "cool": 10
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "1YbIWgjB62dj2OiXqXlWNA": {
    "date": "4/24/2018",
    "text": "Usually the food is great, especially the pizza however the customer service is deplorable and quite frankly their behavior is both racist and sexist.  Last time I was there the man working the counter was on the phone.  Naturally my sister and I stood at the counter and waited until he was done with his phone call which took about 5 minutes.  During this time the man looked up plenty of times, yet never really acknowledged our presence.  When he was off the phone he then walked toward the back talking with co-workers along the way, these other employees also never spoke to us or asked how they could help.  10 minutes after being completely ignored, I spoke up, kindly asking for help only to be met with looks and silence.  Shortly thereafter a white family of four came in behind us and were immediately met with warm smiles and a waive.   The father (I can only assume) walked up to the counter, now standing next to my sister and I, and he began ordering.  I cut in explaining that we were there first and had yet to place our order.  The father was kind enough to step aside and allowed me to place my order. Ultimately,  the wedge we ordered was dry and gross and the extra sauce we had paid for was not placed in the box.   My sister and I vowed to never return. We will happily take our cash elsewhere. I suggest you do the same.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "juKkxX5C3-xdjDxjGlQqYQ"
  },
  "Bz4viPvk2p_lua_65LLUCA": {
    "date": "3/20/2018",
    "text": "So good! Just SO damned good! Always perfect.   Angelo's expert balance of crust, sauce, cheese & toppings never fails to impress. We order a lot of pizza, and Angelo's is our new go-to. Probably 10 to 12 orders in the past 45 days, and they nail it every time. Try the garlic knots & hoagies, too!  On busier evenings, delivery to our home in Friendship may take a little while, but it is absolutely worth it and our food always arrives hot and delicious. Good things come to those who wait.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m70b-2orhnUlStKW8YFEHg"
  },
  "odsNnYZgbvirsK7pWGXRmA": {
    "date": "10/20/2018",
    "text": "Horrible customer service. Not sure if the food is good. I usually don't do bad reviews, but this has been a pretty awful experience. I ordered via Yelp/GrubHub with an 80-90 minute estimate. I called at about 95 minutes to confirm they received it. I was told yes, then they hung up. I called at a little over 2 hours and, seeming annoyed, she said \"its out\", then clarifying a delivery driver had it and hung up. It has now been 3 hours and 12 minutes and it has never arrived and no one has called. I think if they had just apologized or been polite when I called, or even given me an update in the last hour, I wouldn't be writing this, but the fact that they seemed annoyed that I wanted to know where my food was, was a little much. I guess its time to make dinner.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "D_CJloKW25Q92j-lzRVCWA"
  }
}