{
  "RehQEH9zOk0LB8jiptHsPg": {
    "date": "7/24/2016",
    "text": "Don't go.  Much better Italian places then this. Over priced, over coked. Got the veal parm probably worse I ever ate.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d4rqME3xW4Rw4L1fU6vFUw"
  },
  "mXGrhgp5I0qyWlAPsD7wGQ": {
    "date": "7/8/2016",
    "text": "I can't say enough great things about this Buca! Coordinator Ashley is amazing! Planning a wedding out of state while attempting to bring together families from two different cultures for a large event is a difficult task but Ashley and the Buca crew helped make that dream come True! Our rehearsal dinner was a huge success! Everyone loved the food! Everyone had a great time and it's all because of the staff being attentive, welcoming, and personable. They made us feel right at home! And huge thank you to Ashley the bartender who helped us out together a custom photo shoot for myself and the bridesmaids that I'll never forget! You guys are amazing! Thank you for making my special day one to remember :).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9McBTSA9QbRNcqRM8DlYog"
  },
  "fmLEtxiYcfDzTNFdyE20KQ": {
    "date": "6/25/2012",
    "text": "I had forgotten why I don't frequent these chains, but now I remember. I'm embarrassed that I even asked the bf to take me here after all the places we're used to eating in NYC.  At least the salad was good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zX51-P6DQA0iuH30EPH5CQ"
  },
  "7ZunKfxXfDKb39e1nBhAhg": {
    "date": "2/21/2016",
    "text": "I have always been a fan of Bucca's and never had any issues with the food or service. This was our first visit to this location and it was on Valentine's Day. Kids wanted a heart shape Pizza (which they had), but come to find out it was only for to go orders. The waiter never offered if we would like to purchase it. Which I probably would of paid for no matter the cost. The service was sub par. The kids personal pizza came out 15 mins after our main course arrived. A manager never cam to see how our experience was, or just to check on the table. Food was good, but this is a poorly run Bucca's. Sadly we will not be returning to this location. We will try other locations but refuse to come back to ROBINSON.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MlxP3NQGb5w4GrTFEMf6Dg"
  },
  "DhChIoCcZjtsQ0sxryFPPA": {
    "date": "8/17/2014",
    "text": "Tried Buca di Beppo for the first and last time tonight.Went with my brother we got stuffed shells .The stuffed shell may have been the worst I have ever eaten.My brothers home made ones are much better.We also got Mozzarella Garlic bread which was disgusting and two Italian Sodas which were good.It was 38.00 for a food which didn't include salad or bread.I'll never go there again.Piece of advice for Italian chained Restaurants go to The Olive Garden more choices,cheaper prices,better food and you can get bread and salad with your meal.I will give Buca di Beppo credit on one thing it was cool looking ambiance",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ul3BevINewTswGvGuEjYSQ"
  },
  "Z-FRIAxBhq8DahoUlQMhZA": {
    "date": "11/12/2015",
    "text": "The wait was very long which made us late to our flight . My food was okay I had the chicken parm with fettuccine not satisfying made me burp all day. I expected more out of this place . Will definitely not come back",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T6PkouP10PbFFqyjQDa2jg"
  },
  "JFbos7x9co53ShkVcRCqQA": {
    "date": "3/26/2012",
    "text": "The first time I went to Buca was for dinner, ordering off the family style menu. The food was great and the service was great. We particularly loved the gorgonzola and green apple salad.  This second time we went was for Sunday lunch and the food was disappointing. My side salad was warm and slightly wilted. As for the spaghetti and meatball, the meatball was great, but the spaghetti and its sauce was bland and tasteless. I actually salted my food, something I almost never do in a restaurant. The spaghetti didn't even taste like it had been cooked in salted water.  I'll give them another chance, just in case this was a rare occurrence, but I'd recommend going for dinner, not lunch. The family-style portions served for dinner are a good value and the food was very good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F43IUmEt__FB66Fr4c7JiA"
  },
  "DovFJBvMYnWdD8IHCBMleg": {
    "date": "6/15/2015",
    "text": "I was very disappointed meatballs were huge but bland tasted like they just rolled  hamburger into balls and added nothing to it .Calamari was rubbery which means it's overcooked. Very expensive and one of the worst Italian dinners we ever had. We were there June 13 2015",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jXRHkqLvgZQHX3x45YVqMA"
  },
  "qO11vWhq-eysThzEpRWBnA": {
    "date": "5/26/2013",
    "text": "My husband and I dined at BdB last night for the first and last time.  The reasons being first and foremost their prices are ridiculously high for what you get.  Secondly, the food was okay, but not what I would call spectacular.  I realize everyone's taste is different, hence the two stars and not one.  We've had far superior Italian food at The Olive Garden for less cost and the same level of service.  The two bright spots were the atmosphere (very colorful and interesting) and most of all, the service which was outstanding.  Since we'd never been here before, we wanted to check it out.  Our curiosity being satisfied, we can now safely say \"Arrivederci!\" to Buca di Beppo!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9kh_F3rrhdNvXWOSRYfvxw"
  },
  "vuU0fNM5HA__CsF7O7Hwvw": {
    "date": "7/15/2013",
    "text": "The worst thing about this restaurant is that it looks so darn dirty.  I don't mind all the pictures and knick-knacks, but please clean up the place.  The bathroom is hotter than heck, which, to me, is unacceptable in the summertime.  You can hear everyone's conversation next to you, there was no music playing, and the light fixture above our table had burnt out lightbulbs, so we could hardly see.  The waitress was way too chatty with us, and complained the whole time about the kitchen staff; very unprofessional.  On the plus side, we thought the food was excellent, fresh and plentiful.  Unfortunately, a return trip is not on the horizon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EL75pY9qGXwX_eYWzDfKAg"
  },
  "C1YIfpjebW9Htcutcz66GQ": {
    "date": "6/13/2013",
    "text": "The food is not very good, so expensive and they don't even listen to the customer's concerns properly.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d398FMRG3RKv54El2PY94A"
  },
  "fnhBIWK_5wI8pdb35aBUrg": {
    "date": "8/30/2010",
    "text": "As a party of two, you'll have to agree on an entree because they are served family style with enough food for 3.  We agreed on the rigatoni which was outstanding.   Service was excellent & staff was enthusiastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BCM8ksuvq6IWiwYlVNLx_g"
  },
  "8C7dvQi32-88ODWbCLlhMQ": {
    "date": "7/24/2013",
    "text": "I love this chain, but at this location the service was quite slow.  We had a big group, the only people in one of the 'rooms' of the restaurant, but it seemed to take a long time to get water, appetizers, entrees, etc.  Food was great though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w_FNJkJYFtz-Nepj3USkXg"
  },
  "-NCbm-En4efoNw3w-Xw8pg": {
    "date": "3/30/2016",
    "text": "Have a great time visiting with family friends from out of town, however regarding Buca, this will be our last visit here. Probably arrived before 6pm and for a restaurant with very few tables seated, this was the longest meal I've ever experienced. Including the 16 yrs I worked in 2 different restaurants. Got salad, then at least 40 minutes for 1 chicken dinner and 1 pasta dinner. You seriously know when you rarely see the server, including drink refills only when you mainly get up and have to ask for them, not a great experience. I always love the part when the server tells you they are short cooks in the back, yet you never see her back for over 25+ minutes, multiple times even for drinks. Which tells me she has more than she can handle. For $140 check, really difficult to even leave her 10% tip. Typically 20%, however whenever you never hear back about food coming, have to ask for drink refills multiple times, you have to wonder IF they are even staffed properly. Also as a note, the spaghetti with marinara sauce literally had a slight bleach kind of taste to it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qli_gtwCNJ9vZaQBwxxiXA"
  },
  "70v_MZqKj00T0jvv9E_0Ug": {
    "date": "9/15/2014",
    "text": "They offer ridiculous portions. They food is good but everything came a bit out of traditional order, and I think that is because we had 3 different servers coming by our table. The draft beer was flat...stick to the bottles here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LIHlbBXL5LsOyNpQVAU3lg"
  },
  "5imMg9L8qfslYUcRQy-FjA": {
    "date": "10/9/2013",
    "text": "So about two weeks ago my boyfriend and I went out to Buca for lunch. We had a awful experience and pretty much wrote off this location completely. Annoyed with how things had been handled (Aside from the kitchen manager Emilio) I decided to write a review explaining all of my frustrations and why I had only given them one star. Shortly after writing the review I was contacted by someone within the upper management of the company. I was pretty amazed to say the least because most complaints get swept under the rug in larger companies. Mr, Radevski was genuinely concerned about the complaint I had given, and the bad experience we had. He assured me that if I gave this location another chance I would not be disappointed, and boy was he right.  I decided to give the Robinson Buca another chance on a rather important night, my mothers birthday. I made my reservations VIA Open Table, and when we arrived we were sat promptly. As my family got comfortable our server came over to the table greeted us and really made us feel welcome. She even asked if we were celebrating anything. Dinner went splendid, our server was extremely attentive and we never went one minute needing anything. Everything came out hot and in a timely manor!  We were pleased when Chef Emilio came out to the table to check on everything periodically through the dinner. The food was absolutely delicious, the stuffed shells were to die for, and when complimenting them to the Chef he was glad to tell us a little bit about them and what makes them so tasty. Everyone in my family was very particularly pleased with the whole experience. Members of the staff even came out after our dinner was boxed up and sang to my mom for her birthday. Even though she was embarrassed, she loved it!  I couldn't have been more pleased and happy with a restaurant in my life. The Buca in Robinson really did whatever they could to make up for our previous occurrence from the excellent service this time around, to the great atmosphere from the other servers and the delicious food and desserts we enjoyed (with plenty of leftovers!)   I just wanted to extended a sincere thank you to Elizabeth our sever for the night, Chef Emilio and Mr. Radevski. The experience could not have been better and my family and I truly appreciate your concern in making our night the best that it could have been. We will definitely be back, and I will most certainly be letting others know of how exceptional the service was this time around and that you helped make my mothers birthday the best it could be.   Thank you very much Buca, I cant thank you enough, we will be back, especially for that Tiramisu!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RF-SvCJ9yMV8jvtVsQG-qQ"
  },
  "fx4aYAAwhhUG_9HbgUj8Xw": {
    "date": "5/25/2013",
    "text": "This place has really gone downhill. They used to give you a full size dessert free on your birthday and used to have pretty decent coupons. Now, the chicken is stringy and can't even be chewed easily and they don't even give you a mini size brownie sundae on your birthday. They are such cheapskates that they don't even give you a wedge of lemon to squeeze on your lemon chicken anymore. The management is just trying to squeeze you for every last buck they can.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rKr5N-KDgtFnRpGROh8-HQ"
  },
  "Y-zH6eFtqLikrR1gY-Exyw": {
    "date": "2/3/2011",
    "text": "I don't do Italian very often but on a recent trip to Pittsburgh I stopped into Buca di Beppo directly from the airport. I have been to one of this chains locations in Dallas and was impressed with the food and family style portions. The Pittsburgh location didn't disappoint. We ordered the trio appetizer that included fried cheese, calamari and perfectly done stuffed mushrooms. For the entrees we opted for the stuffed shells w/ marinara sauce (stuffed with spinach, ricotta cheese, Italian sweet sausage and Italian spices) and spicy chicken rigatoni. The portions where stupid big but cooked to a fresh perfection. The service was above average and the atmosphere was uniquely over the top Italian. If your into large quantities of Italian food done right, give this place a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jM15UpH-nMyHza0QZ8lBWA"
  },
  "XgzpN92oLeW1wJPu3FsttQ": {
    "date": "12/18/2011",
    "text": "This is my favorite restaurant. We go to Bucca's for anniversaries,birthdays and just because. We always order the spaghetti because it reminds me of my mama's. I love the food, the decor and the service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OzzcVMstnoHCZo3-iKvt7Q"
  },
  "62i-aRbibxlRHQzkpjGa4g": {
    "date": "9/5/2014",
    "text": "Myself, along with other members of my family  from Richmond, VA were visiting family in Pittsburgh when we tried Buca di Beppo. Not having one in Virginia, we thought it would be a great way to feed multiple people in the most economically way. Waitstaff was really friendly.  We ordered five different dishes that unfortunately had to be brought out at different times because there was a collision in the kitchen which sacrificed two of the meals. The food that came out was dry as if it had been sitting under a heat lamp. The server also inquired about one dish whether or not it had soy and reported that it didnt so we ordered... Come to find out it actually did have soy in it and told us when it was served. Had we known that, we wouldnt have ordered it. Although our time there was a complete disappointment, the head cook came out from the kitchen to apologize and completely comped our meal! I would give this restaurant another try solely based off the fact that they had outstanding customer service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M11Zl8zmkTlmLWP_jAW0rg"
  },
  "O54SxQ0iDyrGEmWcV7ZfWQ": {
    "date": "12/10/2017",
    "text": "My wife wanted to try something new as it's been a while since we have eaten here.  I didn't take me long to remember why this is not a regular place for us.  First of all, the atmosphere was like being in an empty basement with a small radio somewhere and a tiny table in the corner.  I was surprised to walk right in on a Saturday night at six anyway.  Get ready pay 15 dollars for a salad for two with bland dressing, 30 for three small pieces of chicken or veal, 24 for a larger bowl of fettuccine while they can't even include bread. We asked that they split the fettuccine into two bows as I like alfredo and she wanted marinara and I didn't want to pay another 24.00 for my own sauce.  So they bring it out mixed together!  They actually have a name for this like we were supposed to know.   That would be something for the waitress to educate us one upon the special request.  They take it back while we quickly ate the three tiny pieces of veal.  So then we wait.  Here it comes out and her's was ok but mine was terrible.  The sauce, which I was told \"made to spec\", sucked.  I had to go home and gargle to get the spoiled milk taste out of mouth.   Almost like I had unpasteurized milk straight from the cow.   We complained and they took the overpriced salad off.  My take on this place is as follows....   if you have a small appetite, big wallet, no taste buds, over abundance of patience and like a boring atmosphere, this place is a must stop for you.   Enjoy!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BQgmPIVydsCCwrk6kdhxGA"
  },
  "ntMGNHKnhqPTyp8JV38bjQ": {
    "date": "3/1/2018",
    "text": "We walked into the lobby and nobody greeted us for about four minutes.  Finally someone came and led us through the kitchen and then into another part of the dining room and sat us down.  The kitchen was filthy.  There was grease on the floor so when every customer walked through there....they dragged the grease on their shoes with them.  Why any restaurant would elect to walk customers through part of a filthy kitchen is beyond me.  We waited 65 minutes for our food from the time we sat down.  We ordered the Chicken Limone and some pasta.  They brought out the chicken without the pasta and we waited another 12 minutes for the pasta.  That would be like going to Lone Star Steak House and they brought only the mashed potato's and then said ....the steak will be out in 10-15 minutes.  The manager was apologizing to the table next to me as we were coming in....little did I know he'd be apologizing to us by the time we were leaving.  I had possibly the worst restaurant experience in my life.  Management tried to use the excuse that they had a coupon expiring that night and they were caught off guard....but that is still no excuse for dragging your customers through a grease filled kitchen and then making them wait 65 minutes to eat....and then serve them their food in intervals of 15 minutes.  Please don't waste your time with this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kV_-5fcIqQPbAsSOAEdsLA"
  },
  "OfKw-1nqtGopecsl0b6L_w": {
    "date": "5/26/2015",
    "text": "The hostess gave a bad first impression.  She said it would be 45 more minutes because our \"table was dirty,\" when we were one of only around 4 groups in the whole restaurant.  The restaurant made me feel like I was in a maze based on the movie Angels & Demons.  The decor was very creepy and all I could think about was how dusty it all looked.    The food was hit or miss.  I liked the salad dressing and the bread (not the mozzarella bread), but the baked ziti was dry, tough, and very skimpy on the sauce.  The worst part was the $24 for a carafe of sangria, which turned out extremely watered down since it was filled halfway up with ice.    I was glad they could seat our whole family on a few hours notice, but now I can tell why they had the availability.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eJfLNmqpAWhTLoSsC_nUmQ"
  },
  "ZoR43rkg80gewpY5JKL5Uw": {
    "date": "5/8/2015",
    "text": "I am just not a fan of this place.  It makes me say....eck.  I've been twice and both times I feel like i'm going into someone's cluttered house and eating leftovers for dinner.  The only fun thing is the wine...but even the table wine is eck.  But..it's table wine so I suppose I can't be too picky.  This place is just not for someone who actually loves Italian...it simply can't be.  It reminds me of frozen food.  If you try to go on a date here (why?  why would you do that you cheapskate?)  then get ready to get turned down for anything else that night.  This place is just blaaaaah.   If you want to experience authentic Italian in a home environment, go to Italy.  Honestly...your money will be better spent.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lIhiKmb1Bemhf4DeIY61rw"
  },
  "shrcOXha3VOTa7yyVtqnLw": {
    "date": "12/15/2015",
    "text": "The food is fantastic tasting family style Italian fare. That's where the positive review ends, however. Dining in here is simply not an option for our family. We tried eating here once and waited 35 minutes after being seated to simply place drink orders. After deciding to give it another shot, we waited 25 minutes after being seated before giving up having never seen a server. The manager in this establishment simply has no care for her restaurant and the wait staff is inattentive at best. There is no reason to dine in here when you can get more reliable service elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1on3YBEm5e4B9yhcI-xTvw"
  },
  "wPu6Bev_npJs9_Eb3uBtOA": {
    "date": "2/13/2016",
    "text": "We have been there a few times.  The service is great and there's something for everyone on the menu.  The kids love it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O5yWp-s_GDqpIER9efmjxw"
  },
  "olZaQkCUfa48V64F82dKUA": {
    "date": "4/2/2016",
    "text": "I'm currently eating here now. My server is terrible. It took 20 min to even get bread. The bruschetta is a pile of tomatoes in a large martinis looking glass. My drink has yet to be refilled. This sucks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NSmOZldcd32VBrWoRp_UYw"
  },
  "YVyrslK7ZJgjwI9C__DGqg": {
    "date": "12/27/2016",
    "text": "It's a fun atmosphere. And the help is super-friendly. Don't be in a hurry. And although the food isn't bad, nothing was remarkable. Prices are very reasonable. And the family style allows everyone to taste each item. Best things were actually the Bruschetta and the veggies. Meatballs were a hit, and many liked the sausage. Buca is more of a place to enjoy your large group of people over dinner. But if you are looking for great food, there are better choices.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F4fzipDpsDD9wrKr7LnJGQ"
  },
  "rR_bNbe7cbEtbrneV4cAPA": {
    "date": "3/29/2014",
    "text": "Delicious food, great service, unique decor  . it was so great we went back the next night. They serve family style. We had a Greek salad and manicotti with fresh made sauce. They offered our friend a gluten free menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D2m_k3IzGTTl-ixWSsJjxw"
  },
  "9lHUidR-3-2HX89KyW-QOA": {
    "date": "3/2/2013",
    "text": "My first time here (my wife has eaten here once before).  We were greeted at the door with a friendly smile and seated immediately.  Our server was helpfully explaining portion sizes (large- for two). Drinks and appetizer  were rapidly brought to our table.  Drinks never left empty. However, she was short on personality. Still, she did her job well.  This is very unique, with many quaint seating areas.  Nice swingy music at a nice level for \"background music.\" (not too loud like so many restaurants) Our meal came quickly.  Food was good.   I will return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J_g-Gp-EXQMKGZbAh6V8Kg",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States. One of the many quaint dining areas.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J_g-Gp-EXQMKGZbAh6V8Kg/o.jpg"
      }
    ],
    "user_id": "AIISrjQUO7MdG0bBBFwIyQ"
  },
  "ajAuFGCU9Q8w7orKLQDYuA": {
    "date": "12/27/2014",
    "text": "I normally really like this place, but today was the first time I ever got up and left a restaurant. We were seated for 20 minutes and no one even spoke to us to let us know he/she would be right with us. Not one of the servers even made eye contact with us, let alone offered us water. We are now on our way to Bravo.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "C-Fnl8F3CoxrDqAEkVpOoA"
  },
  "2IqB5NySmylo07K_0eS_WQ": {
    "date": "11/23/2015",
    "text": "Very good food and service. Had a group of 6 and we all shared a large order of the baked ziti (it says a large feeds 4 or more and all 6 of us didn't even finish it) and 4 of us shared a large order of the chicken parm. Definitely planning on going back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RARHY8DtvZ9-nu7SNrsMKQ"
  },
  "bXP1p59ewkVrpBM_w4m1pA": {
    "date": "8/11/2013",
    "text": "They advertise as being authentic Italian and family style. They didn't serve bread to the table. Any True Italian meal comes with bread.    I ordered a small pizza for 2. My wife and I left the restaurant very hungry. It's wasn't cheap either. $14 for the equivalent of about 2 slices of pizza. I mean we each had the equivalent of 1 thin slice. It's wasn't even great pizza. I can order from any local place and get tons more food for less. Very disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vzb1vwFJ4Mm7Cpn4QgZa4w"
  },
  "DkisOOlufO_txBfZxdHf2Q": {
    "date": "1/29/2017",
    "text": "I had my baby shower and her baptism here I love the ravioli and the pasta with broccoli and chicken pesto. The service was great as usual. Jackie was our server for the shower and baptism she was awesome. Karen P.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ardR6bLnMzP2yjmvgIwqQ"
  },
  "ctUR-j76AycBm7Y6jbtJhw": {
    "date": "10/15/2015",
    "text": "The worst Italian food I can remember The sauce is flavorless and the chicken bland. No idea what they were calling a cannoli. On The other hand, the service was absolutely fantastic. That's the only reason I gave it a two otherwise I would've been stretching to give it a one.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OUJlWFSdLLXApq8Iv_HlFA"
  },
  "-9aZM9NPWArq6OC1YDjLXw": {
    "date": "6/9/2016",
    "text": "Awesome! We came here for my cousins graduation with a party of 12. We got a table right away as we reserved one. I had pizza, mozzeralla triangles, and the COLOSSAL brownie sundae. Love it here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lEPY-D1m3YwPdpIhxMUroQ"
  },
  "rJNxCuTRO4_Jyvnnu86F2A": {
    "date": "5/7/2014",
    "text": "Worst Italian restaurant ever. Ordered the Shrimp Florentine and got soppy pasta and freezer burned shrimp. The garlic bread was Ok. If you're looking for quality Italian this is not the place. You've been warned!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MIeyTXhLwptND8s3910Vag"
  },
  "zuL3LrQCGiPPTEr_mGKwjQ": {
    "date": "7/3/2012",
    "text": "First time at this Buca restaurant, it qas a great experience. Came for my bday with family, a group of 7 totally (with 1 toddler). Food was great! We all shared 2 orders of the seafood sampler which was pretty good ( i usually dont like fried seafood), we also ordered the cheesy bread which was excellent. For dinner we ordered 3 main meals: (all large size) chicken cannaloni, eggplant parmesan and some stuffed chicken with pesto sauce. All was grear, but the stuffed chicken with pesto sauce was the best.  We split the brownie sundae, cannolis and raspberry cake for dessert. Our waitress was very nice and def worked hard for her tip. Thanks for making my bday awesome Buca!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lqxtoUXgAZ2CN9Q7Dxh_6w",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States. Eggplant=awesome!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lqxtoUXgAZ2CN9Q7Dxh_6w/o.jpg"
      },
      {
        "img_id": "LtFPc5HPXNySJEjyWSTK0Q",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LtFPc5HPXNySJEjyWSTK0Q/o.jpg"
      },
      {
        "img_id": "Fj5Wh4CWpU4lALU4ItQGTg",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Fj5Wh4CWpU4lALU4ItQGTg/o.jpg"
      }
    ],
    "user_id": "qtT-EzgNHS2bpweuuMloRw"
  },
  "lu9IKtpnGomlVBWgsTSaWw": {
    "date": "12/22/2011",
    "text": "Where I was raised \"red Italian\" was the default restaurant type, so it takes a lot to impress me.  Consider me \"impressed\" with BdB, I love this place; I would have never taken it to be part of a chain.  The atmosphere is what I would picture Tuscany to be, and there are winding walkways and secluded groves-- very nice.  The waitstaff is friendly and helpful, and the menu is extensive.  Food is very good, which is fortunate because the portions are enormous.  I've enjoyed ravioli, lasagna and, in particular, their chicken Marsala (among the best I've ever had).  A fun place with very good food.",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 11,
      "cool": 9
    },
    "photos": [],
    "user_id": "yXIFCpTAJkKzyoWXm4opqg"
  },
  "1JOsD92UBTzomqlqXxb0fw": {
    "date": "3/14/2012",
    "text": "We absolutely loved the entire experience!  The service, the food, the atmosphere, EVERYTHING!  We highly recommend them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "A3KlQ0bJdwDQAhOZZBPXlw"
  },
  "gk8hdnFq0k6U2M_DiMmugQ": {
    "date": "1/9/2018",
    "text": "The restaurant is a bit older and could use some carpet and flooring updates, but it really adds to the feeling that the place is something you would find in a little Italy section of any city. The ravs are great, not overdone and are filled with the right amount of cheese. The chicken parm was nice and crispy and well seasoned, but could have been flattened a bit more for us. The pomodoro sauce could have used some more garlic and salt, it was a bit bland. You will not be dissatisfied by eating at Bucca.  Go with a large group and request the Pope's table, you'll love it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F9ma_A1OJf0L9dXRsxHoXA"
  },
  "4pQB2gFrWhz5tLzGckRu0w": {
    "date": "2/8/2018",
    "text": "My husband and I have been coming here since it opened, both eat in and take out. The last time was my birthday in December and have NEVER Had a bad meal. It's always tasteful,hot and as always plentiful. The wait people have always been nice an helpful. We once stood in line outside the mall in freezing rain for 5 hrs and looked like drowned rats and went there to eat after and they still treated us with respect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y-JJ3YsvuGc9o6n5wb6d2w"
  },
  "Fx41P358DKcEs_zfYkWA8g": {
    "date": "1/19/2018",
    "text": "We had kids with us and I love how they took us through the kitchen to our table. The kids got a kick out of it. Food was delicious and plentiful!! If you go for dinner, it is served family style, which means everyone pretty much has to agree! It also means it can get pretty expensive pretty fast. I would still go back!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BWID32vBEJ86jp5vtc2H0A"
  },
  "DK6FsAMAlbSzlcBKJ9fN6Q": {
    "date": "2/3/2018",
    "text": "We waited for 20mins. No waiter came to take our order. We even asked for it. Eventually we left without being served. However, the atmosphere is nice and a lot of room. But overall, we left hungry and disappointed. I don't recommend this place. :)",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rXt686ljcevTO4Rc-_dtHg"
  },
  "Iw1Eij4OkYf2adDDrr7Elw": {
    "date": "6/7/2017",
    "text": "This is the second time I have been here and the second time the food was amazing. The service though... not so much, table behind me walked out because it took so long for server to take their drink order and she came to my table 1st. I tried warning server that the other table has been waiting but she ran into the kitchen. After 1 he and 20 minutes our server (Zane) came to tell us that we will get a complimentary desert for our food taking over a hr to be cooked. I then asked if there was any bread, and Zane told me they were cooking new batch. He came out told me that the bread was fresh out the oven. It was hard a cold. He lied... food was great service was horrible... 3/5 only because of the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "86FowNT6xEuos9i1JZlECw"
  },
  "Xm7xRnn2DNSlnhAQrUDhaw": {
    "date": "5/10/2016",
    "text": "Came here on Mother's Day so I knew what I was getting in to. Called around noon hoping to make a reservation. Unfortunately, was told they were not accepting any more reservations. They even went as far to say walk ins were being turned away and not welcomed due to overwhelming demand. I went on Open Table and found I could make a reservation at any time during the day for 15 minute intervals. Booked for 7 pm.   We were seated at 655 and were instantly told they didn't have high chairs available and my two year old would have to sit in a chair. The stack of four high chairs approximately ten feet away from our table said otherwise. I took one and she had a high chair.   We sat for 25 minutes and asked for our server to greet us twice before someone finally came over. The server apologized stating our original server had a panic attack and announced she \"just couldn't do it anymore\". The younger guy who waited on us was very nice and through.   The food was what you would expect. Given the hectic day, it was a positive to be in and out in approximately two hours.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VF3b_wmus4G5DNw2BuB50Q"
  },
  "YYEkosXYqgscvReQbBEbSQ": {
    "date": "2/3/2018",
    "text": "One of the worst serving experiences I've had in a while. We made reservations ahead of time and didn't wait long to be seated. After we sat, however, there was no waiter/waitress in sight. We asked one of the adjacent waitresses for our server, and then waited another 10 min, still without drinks, a hello, or any sign of our server. After waiting almost 30 min for a server we left - thirsty, hungry, frustrated, and positive we wouldn't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eY8KkoKRPIo3-EQJOkbwvg"
  },
  "uHM8darU4RO8vigL2_frwg": {
    "date": "12/10/2016",
    "text": "The food was ok and the service was awful. They bussed our table WHILE WE WERE THERE. The beer was hot and flat and in a hot glass. It's just not good. If you need to feed 20 people on a whim then it's manageable, otherwise avoid it.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MWJDwUbnQr7TzUyLLB_KZQ"
  },
  "lCJp0hJ5IEuGdckmkFsipg": {
    "date": "5/15/2017",
    "text": "I had a $20 off  $40 purchase.   We ordered the small veal Marsala, side of pasta and the small apple salad.  I drank water and my husband had soda. While the food was very good, it was costly. The bill was $60 but thankfully with the coupon it was $40. I left $12 tip but if I didn't have the coupon, it would have cost us $70 including tip. In retrospect, we should have ordered a large veal because it was only a few dollars more.  We did not have any leftovers.   The manager was very friendly. Our waiter was very nice and attentive but the kitchen could not keep up with orders. It took a very long time for our entree to arrive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zlGjGFkW5u8mfxG_MZlFIQ"
  },
  "28lQxStuL7ZlEGj0CGtY9A": {
    "date": "11/10/2015",
    "text": "Came here with a party of 12 and they were ready for us immediately. We sat down and the server was there right away to take our drink orders and came back quickly and efficiently to take our appetizer and dinner orders. There were a lot of people, with a lot of orders and she managed to do it very quickly. Our food came out correct and very fast! Everything was right on top of that!   The chicken saltimbocca, the enormous meatballs and the spinach cannelloni were amount the table's favorite dishes.   We did separate checks at the end and everything was right there too. Overall we were very impressed with the service and with the quality of the food, especially for a chain restaurant! We will definitely be coming back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HlY4Vku7lA1bis1zxsImlQ"
  },
  "5ZWtTN3IgQApVq0-JoLrHQ": {
    "date": "9/8/2015",
    "text": "I wish I could give better stars, the host and staff at the front were very nice when my husband and I came in for our pickup order.  We got home and were so disappointed with the spaghetti & meatballs we ordered. The sauce was so watery and gross... The meatballs had no taste. You know it's bad when your husband says that the meat balls he had on deployment in Afghanistan last year were much better. Not sure if it was cause the cooks had to work on Labor Day or what the deal was but it was a waste of money for sure. I've always loved this restaurant but I'm from California and I guess I just expected the same food quality here.  We don't plan on coming back and instead will just make our own pasta at home.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "o8xbLe9ymmV8_X0rlKRWAg"
  },
  "kO7ffDHq1MkO8EO3z_ZFTA": {
    "date": "4/9/2013",
    "text": "I ate at Bucca di Beppo a day after eating at Il Pizzaiolo in Mt Lebanon.  This was unfair to both my waistline and Bucca di Beppo because it did NOT hold up against Il Pizzaiolo.  Also, i'm doing Weight Watchers and I ended up so far over my point allowance I'm pretty sure I'm getting kicked out of Weight Watchers.  The food at Bucca is heavy, salty, full of garlic, and expensive.  I also do not like dining family style.  I was there attending a birthday party where I did not know everyone and sometimes food can bring people together but in truth I just wanted to order what I wanted to eat without having to ask if everyone else would have some too--because every menu item is $20.  I love chain restaurants and I believe they CAN have good food but the red sauce at Bucca is one step above chef boyardee.   I am giving Bucca 2 stars because I did enjoy the stuffed chicken breasts and I think the atmosphere of the restaurant is a fantastic place to have a party--we were in the Pope room and it was so fun!  But then, the food came out...  I feel bad for all the reviews where people say, \"This reminds me of the sauce my Mama used to make...\" :(  Your mama can't cook.  I'm sorry.  I will probaby be back because the desserts were good, but the next time I come back I'm going to take extra blood pressure medicine (even the salad was salty!), and stick with ordering a few appetizers.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PD3X7S70zXHeOx1NjeicjQ"
  },
  "rZXKUFeBC6bCKi2lfv1ssg": {
    "date": "8/13/2017",
    "text": "We have been to the us chain in other cities but never to the Pittsburgh location  Went for an early dinner with the family on a Saturday  Service was just ok  I know the look they are going for is not exactly classy but the red velvet on the wall as ripped and the my daughter was grossed out by gum she encountered under the table! (I assume I didn't examine it too closely!) not a good impression  The food however was worth returning for!  The chicken parm was fantastic and the Calamari was cooked just right! My husband really enjoyed the brussel sprouts also. The spaghetti and meatballs was disappointing! We always order it but this time the meatballs were not as good I think They must have changed their recipe and not sure if it was due to the spaghetti not being drained properly or the sauce but the bowl was full of water! Had the waitress drain it before she packed it up to take home. Defiantly will skip it in the future!  Think management needs to get on top of things to get it back to its former glory!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qMrzYpurzbas5eeIkJgR7g"
  },
  "_TfLGLuWE-X-JrQdHtyJZg": {
    "date": "3/16/2015",
    "text": "Okay maybe it was an off night or this is just a bad location. I was not pleased with the service, and our group were the only ones in the place. It was after 8:00pm maybe they were trying to close up.   Food was not cooked well  (cold) and the orders cam out wrong. The appetizer never made it to the table.  I've been to another Buca and had a fabulous experience so give them a try, hopefully they will read this and do it better next rime.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "r7YS4aVcP9TSlC02Hr2juw"
  },
  "xESE8cB9uQEXy1S0FmjSWw": {
    "date": "8/6/2017",
    "text": "Visited on Friday, August 4th. They were having some power issues and we asked repeatedly if they would still be able to serve food. They assured us that the power would be coming back on shortly. They seated us. And never came back. We did see one waitress going back and forth several times to another table, but no one brought us silverware or asked us what we wanted to drink. After waiting for 7 minutes, timed on my watch, we got up and walked out, RIGHT PAST THE GIRL THAT SEATED US. Not even a word from her! On the way out to our car we did see several servers in the parking lot on their phones, smoking, chilling, etc.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m3aYKi2Kijwm3XDkw97wAA"
  },
  "2wLblJ5hEkvS0MmC7Ogvxg": {
    "date": "7/19/2015",
    "text": "Buca Di Beppo is definitely one of our favorite chain resteraunts.  The food always tastes more home cooked.  We love this particular location.  The service is always fantastic.  We continue to come back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UAu2YHF-nByxbJoGhrYUFA"
  },
  "pBg1Usdq_DPR6b2AoTFJfA": {
    "date": "11/5/2017",
    "text": "We only went because we had a gift card.....Will never go back.  While waiting for a table, the people in front of us had asked for a booth.  They were told by the hostess that she was not going to clean off a booth just for them.  they walked out and we should have followed.  We were seated at a table, and there were tables around us that had dirty dishes on them.  They were not cleaned off the whole time we were there.  Ordered a salad.  It was iceberg and tomatoes for $15 dollars.   The garlic bread had a few pieces that seemed to have had something spilled on them.  We ordered chicken, which was just OK.  Don't waste your time at this place.  It is not run well, dirty, and food wasn't very good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AsXpGpb3ivJMArooERw4DQ"
  },
  "9qkACBBDc_KP_Oxe8k0zzw": {
    "date": "12/28/2016",
    "text": "Went out to Robinson from Youngstown to see what this place was all about. It was decent food. No salad or bread though? What kind of Italian place is this! The pasta itself was DECENT but just not up to my Youngstown standards. I would not make another trip for this place. Waitress was ok but really abrasive and pushy. The family size portions were cool but the concept is strange. You can't go in there with two people because you will have to order a ton of food and get charged and arm and leg for pasta. Ugh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Ac2J3waM4m3Ib5pmJ-sZw"
  },
  "qgIG9j4O6GV6wqsFGC2LFA": {
    "date": "6/7/2016",
    "text": "I've been coming to Buca's for over 5 years now. My main complaint for my visit yesterday was that Buca actually charges $10 for the \"side\" of green beans that is ridiculously small in portion size. See the actual picture when it was served. Will never order any \"side\" dish because of this experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TntAzGT6TY1DteXApIm8Xw",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States. Buca charges $10 for this little serving of green beans!! Ridiculous!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TntAzGT6TY1DteXApIm8Xw/o.jpg"
      }
    ],
    "user_id": "DCj47Eu0IDNowUyWlm3Fog"
  },
  "MOOYjQNtL27JJB7O6O0exA": {
    "date": "4/23/2016",
    "text": "After having a horrible experience at the Station Square location the VP of Bucca called to offer me a $75 gift card to give them another chance.  I switched locations to the Robinson location and it was much better! The food was a lot better but the service was great! We had Brian (dark hair) and he did an amazing job! We were there with 3 children and he was very good with all of them. He was very attentive and any time we needed anything he was right there to ask. We had the chicken  parm, caprese salad, spicy sausage Bolognese, stuffed shells, and the penne ala vodka.  Everything was very good, but the vodka sauce was especially delicious! I think this location make up for everything that was horrible about the Station Square location. Thank you again for the gift card!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A69QAmKSdW45kUIqd4FESg"
  },
  "eTFTmoBFCG1NpjXLgm0jYQ": {
    "date": "9/22/2016",
    "text": "Ordered a variety of items from this restaurant's catering menu for a work colleague's farewell lunch.   From the appetizers selection we got x2 servings of Buca Trio Platter (fried calamari, fried mozzarella and stuffed mushrooms, served with sauces), I thought the stuffed mushrooms was the best. The Mozzarella tasted stale, and I couldn't finish it and for the fried calamari, I thought it was too tough and oily.  Our mains were Penne alla Vodka & Baked Rigatoni with meat sauce. While I liked the Penne alla Vodka, I've had better. I liked that the baked rigatoni was topped with different kind of cheeses, and the ricotta especially added some freshness.  For desserts, we got the Dolce Platter (Tiramisu, Double Dark Chocolate Cake, Homemade Cheesecake and Italian Creme Cake) and Chocolate Chip Cannoli. The only one i liked from these 5 was the Italian Creme cake - it was really fresh and lemony. The cannoli was the one I liked least - too oily and weird chocolate taste. Tiramisu, the chocolate cake and the cheesecake were all just meh. The food was functional and served it's purpose but for me, there was no wow or oomph factor, hence the 3 stars (it was a-okay).  Note: #324 of Yelp 100 challenge for 2016",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "brTWiehIsnmD5Nibu-EEWg",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States. 5 different kinds of dessert - Italian wedding cake, Tiramsui, chocolate cake, cheesecake and cannoli",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/brTWiehIsnmD5Nibu-EEWg/o.jpg"
      },
      {
        "img_id": "B2Ojsn2Z6jXMe6S0erm4Uw",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States. Penne aka vodka &amp;amp; Baked Rigatoni with sausage",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B2Ojsn2Z6jXMe6S0erm4Uw/o.jpg"
      },
      {
        "img_id": "__1rnp7nEyNqh6kjC-3udw",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States. The appetizers - stuffed mushrooms, mozzarella triangles, calamari",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/__1rnp7nEyNqh6kjC-3udw/o.jpg"
      }
    ],
    "user_id": "Fd3GvZTer-2_EwMzL3ptAg"
  },
  "FfQX7hRiY7pI81TCN7T3cQ": {
    "date": "1/27/2018",
    "text": "We went with a large group and needed to be in and out, without delay. That for the most part was good. We called for in advance, because it was a Saturday night and I suggested.  There was a wait list at door, our group was seated quickly ahead of those.  Food was OK. Not Steller or anything great. Chicken parm was mah.. don't think they use real mozzarella. They could have used more and fired it up for a second in a salamander.  Chicken seems as its advance cooked. Fettuccine  Alfredo was bland and not very cheesy, it was all stuck together and undercooked. It's chain Italian for the masses. Family style Olive Garden. The server was pretty attentive. Some delay between food and desert.  When we left, place was pretty empty and most tables were left with dirty dishes,  there must be a bus boy strike.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DHbzl94Q-D0-PAn2oXdUCg"
  },
  "Is4Ta26oef2Ce6J-5GlpiQ": {
    "date": "2/22/2019",
    "text": "Went here with family first time today. My family reserved the Pope Room. This place is very interesting and has a unique atmosphere--which I enjoyed...except for that Pope head on the table. CREEPY and considering the recent incidents this past year--it would be a great idea to remove the popey junk. Creepiness aside--we had a great time and our waitress was awesome. The food was delicious and plentiful--our food arrived hot and tasty, nice presentation too. The salads were beautiful, crisp and tasty. The fresh bread sent us to heaven--hot, fresh, fluffy inside with a perfect crispy crust. The garlic bread was also scrumptious. Everything was perfect--until our waitress took my glass of water to refill it and when she brought it back, I took a quick sip as I was thirsty after all the food--I realized that there was a good bit of beige colored floaty particles in the bottom of my glass--which I thought was my lemon pulp but upon taking another good drink I realized it was pieces of garlic! My granddaughter looked at the glass and told me she thought it looked like a dirty glass that someone apparently had been dropping bits of garlic off of their garlic bread into! I told the waitress and at first I think she didn't believe me and must have thought I was one of \"those people\" who try to get a free meal. Not the case at all but I felt the waitress should know what happened. This was clearly an unhealthy situation and I must say it made me feel a bit nervous thinking I had taken sips from some stranger's dirty glass. The waitress came back and apologized and I believe she didn't quite understand the situation because she insisted the water glasses are \"nowhere near the garlic\"...clearly she accidentally grabbed a dirty glass and refilled it thinking it was mine. That said--I really enjoyed our dinner here and would just tell you to check your glasses when the waitress takes it away and refills it(her water pitcher was empty so she took my glass with her instead of normally filling it at table). Delicious food and plentiful as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Bhi59TIR5kSzM66kkDx8w"
  },
  "YLjyRpSS-vkZm3tzVQ2gdw": {
    "date": "10/9/2018",
    "text": "The worst , time for them to close this dirty place. Don't go. Food presented as slop with dirt in every corner and surface.  Seriously time for you to close up shop before someone gets really sick",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5PUspNAwuz7fZqiEln2F5A"
  },
  "ITpdm1MaMOxaOpA4LPUQKg": {
    "date": "5/25/2018",
    "text": "WORST SERVICE EVER. My boyfriend and I got seated all the way in the back in a corner when they weren't even busy. SAT THERE FOR OVER 20 minutes and no one ever came back to even get our drink order in. Absolute disgrace. We left after sitting there in the cold dark corner BUT on our way out, we see a waitress sitting at the bar shooting the breeze with the bartender. And then all the rest of the teenage working crew was huddled around the front door WASHING THE WINDOW GLASS. Then the cherry on top was the hostess quoting \"thanks guys have a good night!\" Yeah, we won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fziR1x_8qlHVS9-40Xf2VQ"
  },
  "ag1jFjIuNrD8qjxsM0Kt1A": {
    "date": "3/9/2019",
    "text": "I do not know where to even start!!! We dined here last night and felt like we were in 2pac video. Girls in bandanas, spandex, absolutely NO DRESS CODE!! I'm paying $25 for a chicken parmesan and can't wait to get the check because I'm horrified of my surroundings!! Extremely unclassy and unprofessional. Food and drinks were good though, but that staff..... Someone needs to enforce a DRESS CODE!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WryE3TIPmi9xX2FyuQg8xA"
  },
  "MKBFCMuHCTNErwPIPM-aIQ": {
    "date": "2/23/2019",
    "text": "Unique \"family dining\" concept unlike anywhere I've eaten before. My husband and i got a small size entree that is meant to feed 3 and we ate until we were full and even had leftovers to take home so they do hook you up. Only thing is, you have to be on the same page as far as what you want to eat with the other people in your group.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q5id8l-8neWf78rbe0qbeA"
  },
  "krmBg2HW-jXh6XXzd-Tb2A": {
    "date": "1/13/2019",
    "text": "National chain.  NO Gluten Free Pasta.   Seriously.    Called and that specifically said they had Gluten free pasta.    Ouch",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z38Tot21kPByrbmrl3y6gw"
  },
  "Dp3-da7hH3_zTkyqlR4h6Q": {
    "date": "5/31/2018",
    "text": "Food is okay, service was great!  We went with Caesar salad which had a little too much dressing but still good flavor.  For dinner we did spaghetti with meatballs and the cheesy garlic bread.  Bread was really good.  The spaghetti had good flavor, but too much sauce which also really oily.  This actually had more garlic than our bread if that's even possible.  We left tasting so much garlic!  Good place for mediocre Italian food - if you want something more high end or authentic I suggest elsewhere.  I will say our waitress was very attentive and checked on us regularly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UyyemsmLm6vB79E2QjXvHA"
  },
  "4VKYXLr2FIF3zrDwm7TmbQ": {
    "date": "4/29/2018",
    "text": "Do not recommend if going as a couple! We had a reservation for 2 adults through Open Table at 6:45 on a Saturday evening. We arrived 15 minutes prior to our reservation. As we were being escorted to our table at 6:45 we walked through a very quiet room with booths and small tables where couples were dining. We were not seated there. We were instead seated in a larger, very noisy crowded room with parties of 6, 8, and 10+ sitting around us. We ordered soft drinks, salad and 1 pasta dish to share. We were served our salad 30 minutes after ordering and our pasta 60 minutes after ordering. We were not offered bread at any time-we had to ask for it when the pasta was delivered. The pasta dish was served barely warm. We would have sent it back to the kitchen but at that point were disgusted and hungry and wanted to finish up and leave. We were never asked by our waiter how the meal was. He never came back to check on us until we asked for the check. I was prepared to let the young man know EXACTLY how it was! Didn't have the opportunity so I saved my review for Yelp. We were brought a refill on one of our soft drinks after we had finished our meal and asked for the check. We asked for a to go box to take home leftovers and never received it...had to ask for it a second time after paying the bill. It was over a 2 hour experience! Sorry-not acceptable for a party of 2 that didn't even order a cocktail prior to dinner or an appetizer. Clearly the wait staff was over run with large parties and were unable to tend to our simple needs. Waiters were also bussing their own tables which takes away from waiting on customers. Couldn't enjoy general conversation due to high noise level in the room.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "e-GIokAf3WutmOU_OLO9jA"
  },
  "RGpmyALXr4eZ8X1ZEdTnOQ": {
    "date": "1/14/2019",
    "text": "We spent about $300 for a To-Go order for us and a bunch of guests.  We ordered about 8 buca larges.  Our pick-up time was 1pm the following day.  We arrived at 1pm on the next day and waited over a hour for the pastas.  We got the pastas at around 2:30.  But that wasn't the worst, the salads were still not ready.  Who knew it took that long to throw veggies into a bowl.  It was almost 3pm before we received the two buca large salad bowls - which were only half filled, but we were still charged for buca larges on them too.  Our guests at home were really disappointed about the wait and felt bad for us.  Buca gave us nothing to compensate for the wait and never even apologized.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b2qlVHqhSMabi9BfIroovQ"
  },
  "5tccQHXqiXP-0yewl16AyA": {
    "date": "12/31/2018",
    "text": "Food was pretty good. Had a table of six and had some chicken and veal dishes and some apps. No complaints there other than our server seemed new, and forgot everything...... bringing our  bread, then bringing hot bread, then applying our twenty dollar coupon.  But the bone I have to pick with this establishment is this;  my wife and I asked for HOUSE Chianti. We didn't ask the price. Now they did ask us if we wanted 6 or 9 OZs. We opted for the 9's. We had one each, then we split one at the end of the night. Wait for it:  $18 for a glass of HOUSE Chianti at an establishment that offers $20 coupons? That same glass is half the price at Carabbas, and Buco, you ain't no Carabbas.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tbrsMoPwTJaDtuKYGa6nvA"
  },
  "I2g2cJ9Y5i-o029Vw2ugCw": {
    "date": "10/13/2018",
    "text": "This chain was recommended by a dear friend who thought I would enjoy the family style Italian eatery.   This chain is no longer in my area, so I can't readily visit. On my first visit, I had a small classic spaghetti and 2 huge meatballs. The sauce was fresh and tasty. The house bread with olive oil and a fabulous Italian seasoning blend was delicious. I could have eaten my fill of the bread and amenities.  I completed my meal with tiramisu, which was just ok. My server was friendly and attentive and the manager stopped by the table and wanted to know how I found myself there on my trip and thanked me for my patronage and looked forward to seeing my on a subsequent visit.   I had doggie bags and made additional meals out of this family sized serving.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ZTrRBGqVGkRvXC787OVWw"
  },
  "Rg6Cz_j1gH998wQeSa3fIA": {
    "date": "8/12/2018",
    "text": "This place is over rated.  When you walk into this place it has a really bad smell.  The food is ok, but is not worth the amount of money they are charging.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mvC-x4kQcwtYM0H3NwHU4g"
  },
  "7hVAzwkqRRzgaIm_79FJ4Q": {
    "date": "5/7/2018",
    "text": "The first time been there was when we gotten a coupon their so when we got to the place it was really weird how we inside of restaurant's kitchen it took it little long for our food so the server gave us garlic bread and it tasted really bad it was really spicy and strong that vampires would drop like flies.  When server gave us our food I got the baked ziti and it was the most disappointing pasta dish that I even put in my mouth. After that I never went to Buca do Beppo ever again",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jk1M9jhclF3QB4byUf3LQA"
  },
  "KYVtmhOLGWTogrLZ1KEWNw": {
    "date": "1/29/2017",
    "text": "Beware, terrible service.  It took 20 min for the order to be taken.  It took us more than hour to get food. We were ignored the entire time that we were there and forever to get drinks refilled.  The waitress instead was chatting with her friends and ignored us by not checking on us.  She arranged tables next to us instead of serving us.  She offered to get us bread and then forgot.  We had to ask for check and even that took a while.  Not coming back .    The food was okay.  Portions for meal were good but the side dish portions were small and not worth it.   It took more than 2 hours of waiting for a spaghetti dinner ....  avoid this location if you do not feel like waiting and being ignored.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "NbFWBvcmXQ2cgy_Qj_pbVg"
  },
  "CXP2oHgQRzizYj1xX_95BA": {
    "date": "4/23/2018",
    "text": "I was there for a bridal shower. We were walked through part of the kitchen to get to the reserved area. When we left, another guest told us we could walk through the restaurant but an employee redirected us through the kitchen. I felt this was tacky for a restaurant. To be treated as such is very disrespectful. The food brought to the table was cold and the Caesar salad was dry with barely any dressing. Another guest asked for more dressing but the staff never brought it. I would not recommend this restaurant to anyone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q1EUr_-EzPlEqwIJM0rsOA"
  },
  "mEtThjpwm-gr-UQwtTyT-g": {
    "date": "5/2/2016",
    "text": "Update note:    The Daily Meal on 4/26/2016 named Buca di Beppo as one of top 15 Italian Restaurants in the country.  <a href=\"/redir?url=http%3A%2F%2Fwww.thedailymeal.com%2Feat%2Famerica-s-12-best-italian-restaurant-chains-slideshow%2Fslide-6&s=71d31b03cd9401d6dc87a819c7e3f4fe18af13d32d558c8001ce77860343b954\" target=\"_blank\" rel=\"nofollow\">thedailymeal.com/eat/ame...</a>",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_oRwbDr0ddmVgVfD8WMw3Q"
  },
  "v55L-kExYMTIXSpbUBeSkQ": {
    "date": "3/20/2018",
    "text": "Great place to eat! The food was amazing and the atmosphere was like no other! The service was far from stellar but  it was all on the waiter. We are looking forward to returning with friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9lUPNmEIzqus5ljRSzPsA"
  },
  "MnPsj2rAmSaPa7zLXnVmaQ": {
    "date": "2/12/2018",
    "text": "Linguine fruitti di mare! That's my favorite dish from this restaurant with extra squid! Delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qayT6rFLcCVtB7VM_-NbJg"
  },
  "3etWaL59hNqdyUFolHchrg": {
    "date": "9/11/2019",
    "text": "Great team meal, great atmosphere!  Excellent service from Aydan!  Would definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4xpnKRQvodglzlHxoMUmcQ"
  },
  "wKKLLU8a8ElBor4Y1siuKQ": {
    "date": "8/17/2019",
    "text": "This is the first Yelp review i've done in a while where the Yelp comment for 2 stars of \"Meh; i've experienced better\" is so accurate.  Keep in mind everyone, the portions are huge and meant to be shared.  Go with a group of at least 3.   I was here for a lunch with some work colleagues, covered by our boss (just because), and I think i'll suggest a better place next time that's still convenient for everyone. I'm not gonna exhaustively comment on everything, but I'm gonna hit a couple key points.   1) whoever whipped up the cocktail sauce for the calamari just dumped a bunch of red pepper flakes right in the middle of it, so if you spooned out from the middle onto your small plate, you got all heat and no flavor.   2) The \"Spicy Arrabiata\" Pizza is a complete dud.  It's not spicy at all, and oddly has one of the strongest cheeses, gorgonzola \"mixed in.\"  Well, even that's being generous.  There's pockets of it amongst the other stuff and it overpowers any other flavor on the pizza, not that there is much.  Why's it (both the gorgonzola on the pizza & the not spicy pizza) there?  Just my opinion, but eh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6LK8019L37_snmMv0UkvBg"
  },
  "9hSvsoWeurOTB9f7kdhAKA": {
    "date": "7/14/2019",
    "text": "We finished shopping unexpectedly early so thought we'd pop in for lunch since it was just 1 o'clock.  Our server was prompt and friendly.  We had our order placed by 1:04pm.  Our salad didn't come for almost 15 minutes because the server was waiting for our appetizer.  When it didn't come, she brought us our salad.  By 1:30, our appetizer finally arrived.  At 1:50pm, the manager came out and explained that the kitchen is supposed to be alternating between filling dine-in orders and take-out but we just doing take-out.  She apologized and offered to comp our entree.  Pasta dish came out and tasted like absolutely nothing and the pasta was over cooked.  We were surprised when the bill came and it was still $56 for appetizer, salad, and garlic bread!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-tL6ekPblIWosbgirGgfew"
  },
  "ZETimQiTG1Smx5USc27m4A": {
    "date": "5/20/2019",
    "text": "1 star for friendly staff. Unfortunately 1 star is a stretch. This place makes me miss SpaghettiO's!! I've been unfortunate enough to have to come here due to family and functions.  Note to self:  Eat before I leave for Buca.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XMgBE0OtVVukai_-b3BYnQ",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XMgBE0OtVVukai_-b3BYnQ/o.jpg"
      }
    ],
    "user_id": "WrnUDgCUoiaMlb_bCUNrmQ"
  },
  "GwOWigWZfZsNEVIS9I7quw": {
    "date": "8/30/2019",
    "text": "Yelpers,  listen to the reviews.  This place is a mess.  I see that the manager replies to the negative comments and assures that they will improve but I personally think they are getting worse.  From the initial greeting, to the service, to the food,  they all deserve 0 stars.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a6bTzfVHpzmWff3KB93J6w"
  },
  "HTeeF1QjqjEa0vDI6gWscQ": {
    "date": "10/14/2018",
    "text": "It's been a very long time since I've actually sat down for dinner at Buca. Typically we just get the chopped antipasti salad to go. It was my birthday and my parents anniversary so we decided to celebrate at Buca.   Everyone at the table seemed to have a different idea of what they wanted to eat so we ended up picking 5 small dishes for the table. This wasn't the greatest idea because we still had a ton of leftovers to take home. I would highly recommend the chopped antipasti salad. It has always been our favorite and I would say it was the only dish I truly loved. The eggplant parmesan was very dry in my personal opinion and it barely tasted like eggplant. I think the eggplant to breading ratio was very off. I enjoyed the spaghetti but I thought the meatballs were too dry. The only entree that was better than I expected was the spicy rigatoni with chicken. I didn't expect to like it but I was pleasantly surprised.  We finished our meal off with a piece of the italian creme cake. Besides the salad this was my other personal favorite. I'm typically not a huge cake person but as soon as I see lemon or raspberry sauce I'm intrigued.  This cake was absolutely delicious!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "axI5VF0CAGdr82FUxyESXQ",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States. Italian Creme Cake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/axI5VF0CAGdr82FUxyESXQ/o.jpg"
      },
      {
        "img_id": "-fqZrwlCt82ybrkCO1BGdw",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States. Spicy Chicken Rigatoni",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-fqZrwlCt82ybrkCO1BGdw/o.jpg"
      },
      {
        "img_id": "29GpOm43L67FMqRgZMO_sA",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States. Eggplant Parmigiana",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/29GpOm43L67FMqRgZMO_sA/o.jpg"
      }
    ],
    "user_id": "-Y6tXYPYqeVy37-L5p0rMw"
  },
  "1Slqr-gUCmIEVKFW_PeD7Q": {
    "date": "9/11/2019",
    "text": "I took a large group here for a business dinner. Everything was excellent. Our server Aydan made all the difference! She was so accommodating, friendly and fun. She made our night extra special. Thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G6QwepXA9wUGXOW8orc00Q"
  },
  "WbNAmhvTA7Fn9ndxcU6yfg": {
    "date": "1/8/2019",
    "text": "Came here for a quick lunch... it was $50 for 2 people.  Now you may look at that price and think it's expensive but the amount of food we got could've easily fed 4-5 grown adults.  We only ordered 1 appetizer(spicy shrimp) and 1 entree(spicy chicken rigatoni) to share, both exceeded my expectations.  As you can tell by our order, we enjoy spicy foods and they definitely satisfied that along with having great flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_hsruQCw6UTnjlQiuSpScg"
  },
  "8c-Hc9CAEo9Iw3xY8cs8gw": {
    "date": "1/6/2019",
    "text": "I have been to different Bucas many times over the years.  It is a fun place to eat with a large group.  The service is also usually fast and friendly.  In terms of the food, Buca is a pretty average Italian place.  None of the dishes are going to really impress you, but it's not bad either.  They do family style meals, so each dish comes in a large portion.  My favorite appetizer I have had is the bruschetta.  The tomatoes have a great flavor and the bread they choose goes perfect with it.  My favorite dish is the prosciutto stuffed chicken.  It is served on top of a basil pesto sauce and has a really good flavor.  They also have some good meatballs and other pasta dishes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "mr_wGIWpHIa-wtoOC5ftRw": {
    "date": "1/2/2019",
    "text": "Buca is very just average to me. We come here once a year around Christmas with out of town family. The family sized portions are a great idea for our large group and they are always accommodating with our seating. (Gets the Popes room if you have a large group!)   Pros: the Brushetta and salad options! The Brushetta is one of the best I've ever had and the salad is always so fresh and delicious. The dressing on the mixed greens salad is a nice vinaigrette that compliments the salad perfectly.  Cons: the pasta. Which is sort of what you're here for. This previous time I got penne pasta for the table. I assumed it came with red sauce but it came with a cheesy sauce. It kind of tasted like lasagna which I'm not a fan of. The other dishes were all just ok. My husbands chicken was over cooked with zero pesto sauce on it like the menu stated. The spaghetti was watery in another dish.   Also usually we receive bread with oil and did not this time. Bummer :(  Overall a good idea for large groups, but not recommended for the average night out dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eY8pzn82zhVO95vBi-mzkQ"
  },
  "_stXvsGYGWjU5uPALaeT3A": {
    "date": "9/5/2019",
    "text": "When I walked into the restaurant, my stomach turned over. It smells like moth balls from one of the decor pieces and the table/menus/walls were disgustingly filthy. Had to tuck a curtain behind the table just so it wouldn't touch me anymore because who knows the last time that thing was cleaned. I was really worried about the food but it was actually pretty good! It's the only reason this place got 2 stars.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O4yu7MDY4ncZzZitSgJArw"
  },
  "g2PM6Sv0mIMdBXFcCW_pRQ": {
    "date": "12/28/2018",
    "text": "Came here for dinner.  Hubby and I had a coupon of $20 off, but we needed to order a minimum of $40.  Also had a free brownie sundae coupon.  We ordered the small caprese, small sausage and peppers and small stuffed chicken.  What's Hot - Quality of food.  The stuffed chicken was well seasoned and flavored.  The sausage and peppers were slightly spicy towards the end.  We expected there to be more spice, but oh well.  Our tolerance is higher than others.  Food is good, but it's not great.  I've had better. - Ambiance.  Buca's is a chain and their interior is always interesting.  Good for groups and families.  What's Not - Price.  Not worth it.  For the price you pay for the portions, definitely not worth it.  Dudes, it's almost $30 for 3 chicken breasts!  Not to mention you have to pay over $10 for a side.  None of their dishes come with a side.  Not cool.  Their small portions are definitely small and not enough to make you full.  If we didn't have the coupon, dinner would have been well over $60.  I'm willing to pay good money for good food, but it better damn well be good.  While the quality of the food at Buca's is good, it's not knock your socks off.  Definitely not worth the price.   - Portions.  The small portions are super small.  I don't recommend coming hungry.  It was just me and my husband and the portions were definitely not enough.  The sausage and peppers side only came with 2 sausages.  The small stuffed chicken was 3 chicken breasts.  That's about $9 per chicken breast.  No value for money.   - Service.  To be fair, the quality of their service probably depends on the day and time you go.  We came on a Friday and their service was crappy.  There was no hostess present when we got there, so we had to wait longer.  I don't know if they had a full staff, but our drinks were served by another waitress while their staff was getting it together.    Final Answer - Willing to come back, but only with a coupon.  This place isn't worth full price.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "le1VrZhxOVzFwua4rfgiaQ",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States. Brownie sundae",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/le1VrZhxOVzFwua4rfgiaQ/o.jpg"
      },
      {
        "img_id": "a4IjDs5x2y4hoWF2VDooIw",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States. Sausage and peppers side dish",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/a4IjDs5x2y4hoWF2VDooIw/o.jpg"
      }
    ],
    "user_id": "eYUt3Va-5w-NrCBxD_PrFA"
  },
  "cdi9uUkI7u1wsGAgemuiSg": {
    "date": "4/11/2018",
    "text": "Lunch was Wonderful ! The food was delicious as always!  We like the Buca in Station Square, out in Robinson it seemed to be the best place for lunch. We were not disappointed.  Service was friendly and quick to take our order and accommodating to our needs.  The kitchen was quick in preparing our order.  I just LOVE the Chicken Carbonara and order it every time. Small family size so complement other pasta dishes we want to try.  I love the wine bottles decorating the ceiling, decorative and function able as well.  Highly recommended !!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UYaJOEYhXy4UulGWvYlP0g",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UYaJOEYhXy4UulGWvYlP0g/o.jpg"
      }
    ],
    "user_id": "3egcdazws_x1wW35jgXfNw"
  },
  "bPuZNLEYQ-MjWaDI0LkxcQ": {
    "date": "6/29/2019",
    "text": "This is the 1st time we have ever went to this chain. The reviews were not very good and that always made me hesitant but Hubs got a coupon in the mail for his bday for $20 off of $40. There are 2 in the Pittsburgh area and since I hate going to Station Sq let alone during the construction.. I made a reservation at the Robinson location for 7 p.m. on a Saturday night per other tips in the Yelp section that was a suggested thing to do. We were ready early and decided to swing by the Station Square location to see what the wait was luckily hubs just ran in because it was an hour and a half wait . We left and headed to the Robinson location for our scheduled 7 p.m. reservation. We were seated right away, staff was nice friendly the place was clean and though there are no  windows it has a warm inviting feeling to it and you get to walk through part of the kitchen on the way to your seat.  Our waitress came over right away was very courteous, helpful, attentive and polite. We ordered the anti pasta salad and lasagna. For those who do not know this is a family style Eatery which means the portions are supposed to be big and feed  the table not just per person and what you order is what you get. Each plate only comes with what it is. They have a small and large portion. The small is supposed to feed two to four people and a large up to and over  five. The salad came quickly and was actually pretty good though, I can tell you it was not a $21 salad but was enough to feed the two of us and was pretty tasty. Next came the lasagna; It also came quickly and though it was enough to feed us it wasn't really worth the $27. I would recomend choosing the large selection for a family of four. All and all service was fantastic they really did a good job even though they were busy and the food wasn't  bad , considering the battery of negative reviews. I thought  it was pretty goid but to me was not worth the price. We would go back if we had the same coupon again or they started including a salad or side with your meal. One comment in other reviews is  that the portions are large and they would be if it would have been just to feed one person, not family style like it is. One thing's for sure we have been many other places, paid much more money and left hungry .   We at least left full and the whole experience was Pleasant..  a nice Saturday night dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-T1i9TahLDQbEWD1Mr4zGg",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States. Lasagna small portion",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-T1i9TahLDQbEWD1Mr4zGg/o.jpg"
      },
      {
        "img_id": "3DaIgA45V4EnZmXzrXhECQ",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States. Antipasto salad small",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3DaIgA45V4EnZmXzrXhECQ/o.jpg"
      },
      {
        "img_id": "N4YooOvpRdihL-as3PwUUA",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States. Decor",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N4YooOvpRdihL-as3PwUUA/o.jpg"
      }
    ],
    "user_id": "q3dIqTQTC_PFk95q_aEhHw"
  },
  "gKIDoBE7FWQ2-itzI2aEPw": {
    "date": "6/29/2018",
    "text": "I ate here with several colleagues while in town for a work trip. I agree with many other reviewers....do not eat here alone! It is a family style place and the portion sizes are made to serve several people!  We ordered the Brussels sprouts with prosciutto. They were delicious! Perfectly roasted with a generous amount of crispy prosciutto. We also ordered a chicken dish and spaghetti and meatballs. I wasn't a fan of the meatballs and the red sauce in that dish, just not my taste.   Service was good. It was difficult for them to find appropriate seating for our group of 7 and it took them two attempts of seating us and realizing the table wasn't big enough to finally find a table. But the end of the table was up against a wall, so the server couldn't reach the furthest 4 people at the table to serve them drinks or take their plates away, so that was awkward. It was also really loud in the restaurant. Lots of screaming children and the kitchen was really close to our table, so it made it difficult to converse with everyone at the table.   Overall, it was a good experience. Would I be eager to go back the next time I'm in town....probably not.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "XTM3INNj3liAZ-d_OcT8Dw"
  },
  "p-5exP9MkBzy62lD2MxOzA": {
    "date": "2/16/2019",
    "text": "Great place.. Family style... awesome atmosphere!! Really enjoyed it.. reasonably priced.. The waitress Alexis was GREAT!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "l2hwHkExipuOQrUNRUeozg",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/l2hwHkExipuOQrUNRUeozg/o.jpg"
      },
      {
        "img_id": "YQrblvtkBGwNMSndmErdCg",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YQrblvtkBGwNMSndmErdCg/o.jpg"
      },
      {
        "img_id": "WLmzl9KEcv0H5ncgIzaXLg",
        "caption": "Photo of Buca di Beppo Italian Restaurant - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WLmzl9KEcv0H5ncgIzaXLg/o.jpg"
      }
    ],
    "user_id": "T57CqtZK-Dc3vlnLb4wLmg"
  },
  "EYpEaxDgk9tHRgg7_49N5Q": {
    "date": "4/5/2018",
    "text": "It was a bad choice for people who don't do group food.  It was a work meeting.  We had the private room.  We were taken thru the kitchen to get there ... but there were 2 corridors next to the room that was a little weird.  Two large cutouts from the walls let us hear families in other rooms ... which made it hard to hear our conference call.  The waitress was very attentive and willing to split the checks from the very beginning.  The tomato soup was chunky and flavorful.  The small antipasta salad was dinner and lunch entrees.  Everyone enjoyed their meals but were overwhelmed by portion size.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rxw9BOhbTzVUP5rvd5Acdw"
  },
  "qtsVcUzefUM4suCcQ0MtxA": {
    "date": "6/16/2019",
    "text": "I eat at Buca as much as possible. I traveled from South Central Pennsylvania and arrived at 6:45 in the evening and was told no walk ins. I was not happy and had to sit at the bar. The reason I was given was the kitchen. How said. Then I walked around and saw empty tables. I plan to call corporate and complain.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A8AwNXuI483C1h_vCwVy7w"
  },
  "aQOWjdY2947ORH4VbCBZ7g": {
    "date": "1/5/2019",
    "text": "This meal was very much a mixed bag.  Like many reviewers, I do not dine here often and do so only when there is a promotion.  The family style service and pricing can be alright for a large party, but it does not work well for two.  Given the sizing and the high prices of items, both parties must be in the mood for the same dishes in order for this concept to work.  Portions for one are not available.  We drove over 20 miles, a significant distance, to dine here and were enticed to do so on this evening due to the 1/2 price spaghetti entree promotion, valid only on January 4, 2019.  We arrived at 6:55 p. m. We got off to a poor start: the young man who seated us was cold and brusk, unpleasant and unsmiling, showing no concern about making a good impression on the customer.  There were plenty of desirable tables available.  We were placed at one which was not, in close proximity to a large family party.  We were not asked if the table we were seated at was alright or whether we preferred a booth or a table.  It is disappointing that a restaurant at which it is easy to spend $100 for a couple offers one paper napkin rather than cloth.  I like that grated cheese, a pepper grinder, and sea salt are on the table.  We ordered a large spaghetti with meatballs entree, side order of broccoli, and house bread and butter.    We encountered the same situation we did when we dined at the Farmers' Market, Los Angeles location Thanksgiving night 2018: the bread was not ready.  It took about 15 minutes to arrive.  It was hot and delicious and we were provided a generous portion of two loaves.  We needed it as we were hungry and our entrees would not arrive for forty-five minutes after ordering.  As we were waiting, server Kylie kept us apprised of where we stood in receiving our food and was highly apologetic.  Before the food arrived, she said that the restaurant would like to provide us with complimentary dessert.  A lady who obviously is a manager came over to ensure that the dessert offer had been extended and to apologize.  She was kind and gracious and thanked us for our patience.  We were indeed patient: we remained calm and did not complain.  The spaghetti dish is enormous.  The pasta was cooked American style, not al dente/Italian style as I would have preferred, and the sauce was too chunky for my taste, but the pasta and the half pound meatballs were delicious.  The broccoli was lightly seasoned and delicious, done just right: not too soft, not too hard.  We asked for chocolate cake and two scoops of chocolate ice cream, which Kylie graciously provided, a $13.49 item plus whatever would have been charged for the ice cream, probably bringing this item to $20.  As we were finishing our entrees, a male manager came to the table to ensure our satisfaction.  I cannot say enough about Kylie and the management team.  A meal that could have caused us to leave in complete disgust was enjoyable and caused us to feel that we want to return!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1jXmA4__4UWIplZk6MJMQ"
  },
  "Xy_2StEg_kPdaQRezAtofw": {
    "date": "5/16/2019",
    "text": "I used to LOVE going here but it hasn't been so impressive the last few times. We went on Monday to celebrate Mother's Day (we DEF don't go out on Sunday) and the marinara sauce seemed to have some sausage flavor in it? The meatballs were 50 % off and spicier than before.  We think we know why....leftovers from Mother's Day.  It was disappointing.  It will unfortunately be a long time before we try again. This was our special occasion place but not any more. :(",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AmM1W6YCTmuCSh1MJ4X_bg"
  },
  "ej-eEJYKle_W4gddMAPRUQ": {
    "date": "5/17/2013",
    "text": "Food was really good and just a ton of food so plan on taking some home.  Deserts were just OK.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RUfA7xdmFVWDGybQLiqJHA"
  },
  "SqycuKAKENi0_fgsR1CcQQ": {
    "date": "12/1/2012",
    "text": "Not a huge fan. The food is mediocre and I prefer Johnny Carino's and Olive Garden over this place. It is always packed and the idea of family style is nice but there is nothing that I crave when I go there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "VJLqhJ-QFXYcafWWB-KCpA": {
    "date": "11/11/2013",
    "text": "generally, i'm not a fan of 'family style' restaurants.  as mentioned in other reviews the service was mediocre; however, the baked ziti and the chicken parm were above average.   if you've ever read any of my other reviews you'll find that's a lot coming from me.  the 'heaviness' of the meal was what it's suppose to be which is basically sicilian.  i've lived in nyc and was born in philadelphia; consequently, i found the cost not bad.  we had four adults and two children and our bill was under $100.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ULqViGvwvdfonimycOMrA"
  },
  "4DzD5KZ_Rhvdh2U6v-SFXA": {
    "date": "10/23/2006",
    "text": "Always love great Italian food! I've always had a pleasant visit at this establishment. Be warned though, everything on the menu is ordered as family style and there's a lot to go around! Great food though. Makes for great left overs the next day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "04eZExl6U1jH3-m46R9gfA"
  }
}