{
  "jp3p1IfoqyST_eQU7W8Ggw": {
    "date": "5/5/2015",
    "text": "The food was good, I had the table side guacamole and the Vallarta fajitas...I ate at the bar rather than a regular table.  The bartenders did seem a bit confused as I had to confirm my entree order 3x, but in their defense, they got the order right so I have no complaint.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jd7jVvEanZjheJTB0Ow9NA"
  },
  "KzvabSmiENi-Hkb-TiJNzw": {
    "date": "12/6/2015",
    "text": "I had fajita Texas,chick/beef/shrimp.  Husband had burrito San Jose. We both enjoyed our meals. 34oz negro modela $8. We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i6UtB3Rq1J1Bx0Vn-yA-vA"
  },
  "6AxN5oekJ-gpL0E2xhOh5g": {
    "date": "4/14/2015",
    "text": "Horribly slow service almost painful, waited for thirty minutes to get a check and pay for it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RRZZ-PXdRkpOoLkl09q61Q"
  },
  "Im8LcKAreIWnaipefgRmYw": {
    "date": "5/16/2016",
    "text": "My experience was the worst I've ever had in a restaurant in Robinson, and I didn't even get to eat here! However, based on other reviews that was probably for the best.   The hostess, who's name was Louisa, was extremely rude from the moment we walked in.  We were told it would be about a 10-15 minute wait. Based on the fact that there were about 20 other people waiting, we knew it could be a little longer but we still waited. We're pretty patient people. 40 minutes later, my friend walks over and asks to get an update on how much longer it may be, Louisa said that two more people were in front of us. So we waited another 15 minutes.  In that time we noticed that half the people that came in after us were getting seated, so we went back to see why.  We then noticed that 10 guests were crossed off after our name, people who had come in after us.  She told us that she had called our name. She didn't.  She had walked by us at least 10 times during our wait and never once approached us to tell us our table was ready.  She also acted like she was inconvenienced that she had to find us a table after waiting for an hour.  There was no apology.  We ended up leaving and convinced a few other people in line to also leave.  Needless to say, we will not be back. I will tell everyone I know in the area to stay away. Customer service should come first in any business. Also don't say 10-15 minutes if it's actually an hour.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HYHcrG_IlKCm0QPrZqeTYA"
  },
  "g5C7yHEUlNOTk3KXdFwqpw": {
    "date": "12/27/2016",
    "text": "Horrible time from beginning to end.   Ordered our food and ordered a house salad to start.   20 minutes into waiting for our food the waitress asked if I wanted my salad first.   She brought out a small bowl of shredded lettuce.   No dressing and nothing else..... just dry shredded lettuce.   I told her did not want it.   She offered to bring onions to put on it.    Food came out after about 40 minutes.    You could tell it sat under the heat lamp for some time because the refried beans were dried and crumbling and the sauce on the 'burrito' was dried up.    The tacos had a handful of cilantro on each one.   The food was not good and the service was worse.   Towards the end of the meal, the elusive waitress offered to get a few croutons and some onions for this 'salad' again and said she may be able to get some ranch.    Told her as I did before I didn't want it.  Just the check.  Took 15 min to get it, she also pointed out that she didn't charge me for my salad.   15 min to pick it up and 15 min to bring it back.   Bad food and worse service.  The salad thing blew my mind because I don't think she knew what a salad was.....   should have went to mad mex.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5P3Y0aTnz3SXZKFKyRyPGQ"
  },
  "DPUbioqSK-MGxQ4BWjq26Q": {
    "date": "11/21/2016",
    "text": "I am in town at least once a month - always quick and easy Togo process - food is really good!! Service is again quick and friendly - Thanks....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nCsH5FYeS2CHjoS5TonvZg"
  },
  "f4jS2I4Zt4Py87XPGLgemA": {
    "date": "5/7/2016",
    "text": "Mediocre food, ordered chicken burrito and got steak, service was more concerned with chatting with each other and $17 for a top shelf margarita........I won't be back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EAsMhWqB75fRXXqBVSgTuw"
  },
  "s65JE7hCsLtdM1zFbI0ytA": {
    "date": "3/13/2015",
    "text": "Situated in Robinson around several other Mexican-style restaurants, Plaza Azteca is one that stands out from the crowd.  The food and drinks are always great in the rustic atmosphere. The service is usually quick, so if you are looking for a good sit-down restaurant for lunch break this is a good option. I also recommend getting the table-side guacamole, it is a great fresh dish for an appetizer (bring change for a tip if you do not want to feel guilty about not leaving one).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rGuevqz7WCka0f4UfkHurQ"
  },
  "V8p4FpbtfG-MpH2AtVwQKg": {
    "date": "6/30/2014",
    "text": "TERRIBLE! Waited over 30 minutes for more salsa, waited over an hour for food, did not get order correct, fajitas for two were not worth $25, did not receive plates until probably 15 minutes after food was served, received very small plates, everyone else in our waiters section did not receive their food when we left, told manager of our bad experience and he laughed, told waiter of our bad experience and then he made the manager come over, and we got $10 off our meal.  First time here and will be our last.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "FOhGTOxip_7D4wJRHcgbDQ"
  },
  "tgnxbLg3YvJDaePfk6AmHA": {
    "date": "5/29/2014",
    "text": "I love Mexican food, so of course I wanted to try this new place...BIG mistake! this place is the size of most chain restaurants like TGIF Fridays or something with a menu that is fun; similar to that of like Chilis or something. Trust me, my pallet goes beyond crappy said restaurants, but I wanted to set the vibe of the restaurants. I expected typical Mexican platters. The decor was horrible, they really play up the \"Aztec\" theme with large Aztec displays, I felt like I was in the lobby of a Universal Studios Aztec themed adventure ride. The wait staff were wearing hokey Mexican garb uniforms. I was already starting to regret coming here. Very tacky.   The meal started with free chips and salsa, as expected in most Mexican places, they were decent.  I ordered the Tacos De Carne Asada, which is described on the menu as grilled ribeye steak, grilled green onions on corn tortillas for 12$. My boyfriend ordered the Ranchero Special which is listed as a delicious combo of grilled chicken and ribeye steak, chicken enchillada, pico, and corn tortillas with rice OR beans for 16$.   When they brought the food out they placed a plate in front of me with two flour tortillas with steak inside of them. Nothing but meat inside, no base made with onions, peppers etc, No sides on the plate, no salsa, just 2 plain tacos. So I asked if it was correct, they said they brought the wrong dish so took it back. I thought \"what a relief\". Boyfriend asked if his was correct, they said yes so he started eating (alot of Mexican dishes look similar so we assumed it was correct.) Then they bring a thin/long plate out with three mini tacos on it. (what you would expect as an appetizer anywhere else), actually mini tortillas, with a side of black beans the size of say a container they usually put dressing in or something. I looked at my plate and laughed. Again though, the tacos were nothing but meat, nothing on the side to put in them, no grilled onions as listed on the menu. The waitress brought the manager over; I explained that if I were at a Tapas or wine bar or upscale restaurant I may expect a meal this size, but not at a family Mexican restaurant!   Shortly after someone from the kitchen came out and took my boyfriends food from him and put a different dish in front of him! They said they brought the wrong food out, LOL. So the dish he ordered is now here, they didnt bring any tortillas, it was just a piece of chicken and piece of steak pounded so thin that it was the size of a slice of lunch meat! horrible. He was served a very small side of rice with the meal, no salsa, no pico. We are are laughing at this point. AGAIN, I told the manager how horrible service, portion size, atmosphere etc this place, he was very apologetic.   Then the check came and there was no discount. I didn't ask, but surely a discount would be given for bring out the wrong food twice, poor service, overpriced appetizer food called an entree! I had to talk to 2 managers to get a small discount on the bill.   The place is confusing; they serve crappy food in an elegant way. The presentation is small and pretty, like it would be in a nice restaurant, but the taste and value is comical. They had karaoke in the bar area, with about 2 people in the bar, they place is very very dark, not good mood dark, but just danky dark.   This is on my DO NOT RETURN LIST. I suggest going to El Campesino if you are in the Robinson area and want authentic great Mexican food.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ODmmPtp1EnKRedWFgeyKA"
  },
  "QCS-krs8a-8kBhknNNZW8g": {
    "date": "7/9/2014",
    "text": "This place is absolutely amazing!! hostess was so sweet, out waiter was a doll!!!! the food is priced great and the food is phenomenal. I have been here two times and already want more! chips and salsa are so fresh and out of this world- not to mention they are very generous and give you more before you are even done. Out server never let our drinks go half empty and was on the ball!! GREAT PLACE!!! I cannot stress that enough, anything you get will be nothing short of perfection. if you like great Mexican food, friendly people, and bang for your buck-this is the place to go",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZfZmjLV2HvksHVqMXg60HQ"
  },
  "qct6pd9rNKaM7QMHM37geg": {
    "date": "6/27/2014",
    "text": "Service pretty good from the bar tender.  He was quiet but attentive which I like.   Food, eh,  not real impressed.   I had the chicken and spinach with a salad.  One thing that bugs me is when the salad doesn't come out first.   After a little while I asked the bartender how the the salad was coming.  Next thing I know, everything came out at once.   The chicken was thin and overcooked.  The spinach sauce was tasty though.   The salad was shredded taco lettuce with what tasted like Kraft blue cheese dressing.  Probably won't go back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "CnO7WMcb2qI1REUMQUVVwg"
  },
  "OKBmNtFyPVfpc4A_3jX8hg": {
    "date": "11/28/2014",
    "text": "Just ate there.. Food was typical Mexican, but very good even the wife and kid liked it. It looked to be cleaner than other mexican restaurants I've been to. The bill was even reasonable. And they have 32oz beers..yea.. The funny part is none of us got sick after wards. Can't beat it.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-h4nHEPASpo_vL5cUvdQxA"
  },
  "BQNwQpkX84drQyYMB-pr0A": {
    "date": "4/2/2015",
    "text": "My husband and I ate here had great service,  but apparently we couldn't handle the hot sauce.  Our margaritas were really good a Lil on the strong side but very tasty.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-jMmzg8nqmBixp6AOjJiAw"
  },
  "n4g4tREJB1s9fWf_i3eybw": {
    "date": "10/5/2016",
    "text": "Our Favorite place for Mexican in the area! Service is always top notch! Guacamole is made tableside to order- and is sooo good! I Love the enchiladas de mole - but everything ive ever had here was excellent.  Def Recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OUSHVEmJBox3JMigWkCkyA"
  },
  "hp2d-c1e43nXitZPkXpk9g": {
    "date": "3/28/2017",
    "text": "This place is the WORST. Slow service every time, but my most recent visit was by far the worst. Had chips and salsa sitting at our table for 20 minutes before we even got a glass of water. Took 30 minutes to get our margaritas (which are the only good thing about this restaurant). Then they charge $4.99 for a serving of queso that couldn't have been more than 1/4 cup. We had to order 4 servings to accommodate our table of 4 people because the servings are so small, and they charged us $4.99 for each one. $20 for enough queso to accommodate two bowls of chips is ridiculous. I've never been to a Mexican restaurant that was so stingy. And to finish it off, they got 2 of our 4 entrees wrong. On our second conversation with the \"manager,\" he still wouldn't do anything. He asked me if he was supposed to just give everything away for free. I said no, but he wouldn't even agree that the 20 minute wait time for water was unacceptable. Don't know how this guy ever made it into management. He didn't appear to have any more authority than the hostess. I will be finding a new Mexican restaurant to frequent. Never again would I return here.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mq7b2xWDS9M3vycB7Tlk9Q"
  },
  "i6zQlSwzbi9hK68Oda_mlA": {
    "date": "1/6/2015",
    "text": "Loved the decor. Service was good contrary to some of the other reviews I read here. I have to say, I had the steak tacos and they were excellent. I really loved the black beans that came with, enjoyed them much more than the usual pinto beans. Our chip basket was refilled, which worked out well as my friend ordered the big bowl of guacamole, which was prepared tableside. I wasn't really impressed with the salsa, but it was not bad. The chips were warm and tasty. I liked that they give you water without asking, my coffee though did have some grounds in it, but was ok till I drank the last sip. lol. I have a feeling the wait staff is a bit quiet , as they may not be confident in their English. Just a thought. Over all I felt a good dining experience, and I would go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RL7HLEBCuD5a-qFneAigeA"
  },
  "Bz1IJuphIS7f4UYwYIWICQ": {
    "date": "5/9/2015",
    "text": "This place has great food, fair prices and good service. It's tucked away but worth the effort. The bar is decent and they have a great menu. Give it a shot",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ygpTWieOmS1nE4Ft-qdWg"
  },
  "HtP0rjHo70DxK0v1yl8rHQ": {
    "date": "2/13/2015",
    "text": "I've ordered takeout several times from here and loved the food!  I need to eat in sometime.  Delicious and nice portions!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BKA3043OY0ue7cykkB1wOA"
  },
  "mDbTkFcQKOvOCSsr_hk8HQ": {
    "date": "11/5/2016",
    "text": "We were seated quickly, the decor is really beautiful and quite amazing!  Our food was awesome and perfect.  It's our new favorite Mexican place in Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-JCgs75rLU4B-py4yVnsGQ"
  },
  "5hEksESuvxCN8ZAIEZc3uQ": {
    "date": "2/19/2018",
    "text": "We ordered spinach enchiladas with chicken and shrimp with rice. I don't remember complete name but it is the first one in seafood section. We liked the food. And my toddler too ate the shrimp.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vPeAn214j8q2amzIfB3pFA",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vPeAn214j8q2amzIfB3pFA/o.jpg"
      },
      {
        "img_id": "u7Nb4QtQ8g11---KfJcsOg",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u7Nb4QtQ8g11---KfJcsOg/o.jpg"
      }
    ],
    "user_id": "xhKEnhJKvoxhKmjOij306Q"
  },
  "ePSBRrp8M6Ss-S_-IfPTbw": {
    "date": "10/4/2017",
    "text": "It was surprising that we drive into town or Leetsdale or North Hills for Mexican food when so close to Plaza Azteca.  The different flavors in the dishes; the hospitable staff; and clean, pleasant environment.  So nice that each dish had it's own flavor.   We were probably their last table of the evening and they could not have been nicer and the food really fresh.  We had appetizers (empanadas, table side guacamole); beef and chicken enchilada's and fajita's... Their salsa is the best I have had outside of (forgive me, that well known place downtown across from Heinz Hall).  Yes, that good.  Nice to note also that their seating/lighting allows for people to have privacy.Sounds as though this family owned business will be opening another Azteca in Washington PA in the next few months.  Good Luck!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "S_cHkh_cCyv0_LR18dkmyg"
  },
  "8z5LM8L5ALDdi4w7n4M1ag": {
    "date": "7/23/2017",
    "text": "I enjoyed the food so much!      I like that it is actual authentic Mexican food!! And that they played Mexican music so I felt like home thanks",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SvsXUDxW5zkPJY9tiMQDlA"
  },
  "Ts7ei1YTF18_drk5H_MzuA": {
    "date": "12/2/2016",
    "text": "So after our last visit to this place in March of 2015 when my wife got food poisoning, Luis S. was kind to message me and encourage us to come back.  We did and thanks.  The three of us headed to Plaza Azteca the day of the November election to escape partisan politics and had a great time with great food and terrific service.  Thanks Luis S. for encouraging us to come back.  We'll do it again soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x3_WktDd9Xw96-OuKPG-nA"
  },
  "pRRTTiUz_lYbviulnsNcmA": {
    "date": "10/9/2017",
    "text": "I have 0 clue where these bad reviews come from. I work nearby and frequent this location. The servers are ALWAYS great, friendly, etc., food always comes out very very quickly and with a smile. The table side guacamole is delicious, and each entree I've had has been great! For local Mexican fare I think this place is great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aGxySE4K3XEFMQUpIFpScg"
  },
  "0vi_svqb5bh3ktMNkto4KQ": {
    "date": "9/22/2017",
    "text": "We were staying at the hotel across the street from his restaurant, so we decided to check it out for a drink and some appetizers. It was actually pretty good experience. They had a nice decor and very friendly staff that was constantly checking on us. The Camarones were absolutely amazing and went great with the chips and salsa they gave for free. I also really enjoyed the Pinot Grigio they served and thought it was smooth and sweet. I'm usually more of a Sauvignon Blanc person but this was an excellent substitution. We're staying here a few more nights so I will most definitely be coming back to try more of the delicious menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZXPUxdvBc4hSt3oyw10dTA"
  },
  "pokgykxsms7qlYPO-s010A": {
    "date": "6/9/2018",
    "text": "This has the best table side guacamole and their pina coladas are equally as delicious. I always get the nachos supreme with ground beef and it's my fave!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xyRePkTTGbgqrCDrwpY1sg"
  },
  "-_OiTikcFKfwnoPg-U7oAQ": {
    "date": "1/27/2018",
    "text": "We went for a late dinner which is good because I think we missed the dinner rush. The decor went with the restaurant name. We were seated right away. Our server immediately brought us waters and chips with salsa. We got the cheese dip as well, so good. We both got the number 15 combo. The chicken quesadilla is delicious. Only thing I didn't like was that you didn't get a lot of toppings. Only one of our combo items had lettuce. Everything else was just meat and cheese. We always got xango and fried ice cream for dessert. Dessert was okay but probably won't indulge again. Our server was efficient and quick, not very friendly but she was okay. We will probably go back. I want to try the Pina loka, all the reviews mention how good it is!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9LaK7tBxhmCkUNkupIlJsQ"
  },
  "VUMzynmXUWCWRs9OEYUWyw": {
    "date": "12/6/2016",
    "text": "Very good Mexican food and tableside guacamole you can have made to your preference (spicy level). It's my favorite Mexican restaurant in the area. They don't rival SoCal Mexican food, but they're very good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZnIaEvJwrxlBUjimIpx2Qw"
  },
  "TYlu02tZ7NUb8ZU0nQDapQ": {
    "date": "8/10/2017",
    "text": "Good service and decent food! I've easily had better Mexican food, but the staff here was great and so were the margaritas! Not sure if they had any happy hour specials as they weren't being advertised - they should make this more clear. I had the vegetarian enchiladas (one bean, one potato, one cheese) and they came with a side of rice. I wish they'd serve all plates with lettuce, tomato, sour cream, salsa, etc. Most places I've been to do this - the meals look much more appetizing this way. Chips and salsa served complimentary before the meal were good - the salsa has a strong cilantro taste! Nice location in Robinson right by a lot of shopping.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "-sv8-a09Psq5CMzmg6E4OQ"
  },
  "P8Ay3USAuzbHYBcNFyniAQ": {
    "date": "7/29/2017",
    "text": "Great food. Had the watermelon margarita and didn't realize how big it was going to be. My husband didn't mind though.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "yzbCms1GsWQMxM5xoc76UA"
  },
  "8ilH_bEJWrzN0bKmIF1oew": {
    "date": "1/3/2018",
    "text": "This place has it all. Great food, reasonable prices, atmosphere and excellent service. The menu is diverse and extensive, portions are generous. Even if there is a wait you'll find the turn around time is pretty quick. We were impressed how quickly our food came and how filling it was. The staff is knowledgeable about the dishes so if you have questions they can answer on the spot. Would love if they had a location closer to city centre.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mXgY4EZ83dwxNVmoo5RZmA"
  },
  "4Sw2SFcieFGbOwEef8YGFg": {
    "date": "11/20/2017",
    "text": "To start off: I love Mexican food. My family loves it, and we all enjoy cooking it. The first time that I went here I had a coupon and enjoyed it immensely. The decor is beautiful. The original margaritas are delicious. The food is delightfully plated and tasty. Since my first visit, I try to go fairly often. It is usually busy and the staff is rushed. But like most places, you need to have some patience and enjoy dining out. It is a treat and I usually try to get something new every time we go there. I highly recommend the jumbo original frozen margarita with salt on the rim. It is huge and a little pricey but totally worth it. For meals, the Burritos are always a good choice. They are always delightfully cooked.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0W7lrumTRk0h0H8KMmdCXA"
  },
  "4GhB08SAm-MyWuBub1KnKw": {
    "date": "10/31/2016",
    "text": "I have been here a couple times, some good, some bad. The guacamole is pretty good, and prepared to your liking, however it comes at a hefty price- 8 bucks plus a tip.  Other meals that my family/ friends have eaten looked pretty good, however I ordered the Fried Fish tacos both times I have went. The first time, they were So good... I basically devoured them in a minute. Unfortunately, the second time I went and placed the same order, I got over-breaded, over-fried tacos. The kind where the batter has turned very dark brown, with a burnt taste. Upon biting into the taco I realized 50% of each taco was burnt batter with little to no fish. I ended up eating half of them and throwing away the rest.  Its a shame because they were so great the first time, that I am tempted to reorder once more, but so bad the second time, i think I'm shooting myself in the foot.   Only other mention- sides here are pretty small.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "obDniOx83CJxLtgENZevqg"
  },
  "d43IFYHjwyOc3CRCVDse6A": {
    "date": "6/13/2018",
    "text": "The guacamole that they make in front of you is amazing! I have had good food and good service every time I've gone there!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "psokAwsdoiDXt98ZzcM5Sw"
  },
  "tM1mLKx-0afUDglK2dUdhw": {
    "date": "11/27/2017",
    "text": "Best Mexican fare in Western Suburbs.  We have eaten here many times, and have always found the staff courteous and responsive.  Nicely appointed, clean yet casual atmosphere great for gathering with friends.  The food is always well prepared and never leaves us unsatisfied.  A great place to stop as a destination or just to end a day of shopping in Robinson.  Highly Recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3vV3uzGZ9w99qfs58rQsrQ"
  },
  "7zLjY7KmfbvVvn1pnFrePw": {
    "date": "9/24/2017",
    "text": "This place is fine, but nothing amazing. The service was good, the food was fine, but it was not worth the price. I got the combo 12. It was $11 for three small items. The taco was on par with Taco Bell. The tostada was fine. The chicken quesadilla was pretty good, but a pretty good quesadilla and some \"just okay\" other items were not worth it. And I'm still hungry.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D164VEmvan4WNjg6kz0GXA"
  },
  "XZSmvsRKzieOc_LfVDOoBw": {
    "date": "9/2/2016",
    "text": "Unique,  fun decor! The food is good and the service was fine as well! My husband and I shared the Nachos and queso fundido. Both were very enjoyable! We will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GvYZa5Vt6gsKeKebuJMnKA",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GvYZa5Vt6gsKeKebuJMnKA/o.jpg"
      },
      {
        "img_id": "hoG0BnyEDAzmUUvHoZlGpg",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hoG0BnyEDAzmUUvHoZlGpg/o.jpg"
      },
      {
        "img_id": "X7Dvddy7Tg8kzDzHhSvaBA",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X7Dvddy7Tg8kzDzHhSvaBA/o.jpg"
      }
    ],
    "user_id": "GmCd14ZOmdmD_QUYWxxn-g"
  },
  "PU3TrAGvM3BdBpUhC4-YwA": {
    "date": "5/20/2018",
    "text": "One of the best places to get Mexican food in the area, everything always comes out sizzling hot with delicious aromas and it tastes just as good as it looks and smells. margaritas are fantastic, slightly on the stronger side but won't here any complaints about that from me. Service has also been above average and servers have always seemed to be friendly. Will definitely be continuing to visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ho2qxbaHA9jHPXvp3_mwEw"
  },
  "VSuvWXA77LpyEy0tR25cpw": {
    "date": "3/23/2017",
    "text": "Great food and Excellent service.  Eddie was very attentive to our table, even long after we finished eating, paid the bill, and we're just sitting for a chat. Definitely recommended if you like Mexican food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGCjNw44kzmWwZhpDlnlWw"
  },
  "g59ENK1KXc5W8oHR4guCOg": {
    "date": "4/6/2016",
    "text": "I thought I was going to love this place seeing as how much I like Mexican food.  I thought what a great place to get a tamale, or a relleno, or simply some yumm-o chips and salsa.  The chips and salsa came as expected.  But they tasted oily, like they weren't fried correctly. I don't if they fry up their own or buy them bagged in bulk, but nevertheless not the greatest.  But that isn't really cutting into the star count.  I got the kale salad with shrimp.  I knew I was splurging since the salad is $8 plus an additional $5 for the shrimp, but I didn't care because I love Mexican flavors _and_ kale and I thought this is going to be great!   But then the plate came, a cool looking square white plate.  My first thought was - I see the romaine, but where's the kale?! The little pieces of kale I found reminding me of what you see on the floor in front of the produce fridge at the market. I mean really, hardly any.  It should be called house salad with kale garnish.  And the shrimp? 4 pieces.  For $5. And that is why 2 stars - the high price for such a skimpy salad.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "QYKexxaOJQlseGWmc6soRg"
  },
  "dcw5uG_tM1wLcnebZqLlQg": {
    "date": "4/14/2018",
    "text": "Well we have been coming here once in a while since I wrote my review a year ago. Not impressed this time. I think they opened the new one in Washington and sent all the good people there, leaving the B team.  Ordered the fajitas Texas... 3 shrimp... 4 small pieces of steak.. ridiculous!?? Always have been plentiful in the past. Consider driving to the Washington location from now on.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZMJNcf_r1UWNRQzyvpMJuw"
  },
  "8xXGRlo8si_qDig0yaUqTg": {
    "date": "4/2/2017",
    "text": "Not great but not horrible. Just your average 3 or 2.5 star place. The reviews are accurate if not generous.  We liked the warm chips, salsa and queso. We had chicken quesadillas and they were fine. Had some tacos that were okay as well. No major complaints.  Comfortable interior with roomy booths. We liked this as well.   Polite wait staff. Looks like a full stocked bar with plenty of tvs in the bar area.  We probably won't come back because have other Mexican places that are a bit better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "I6GB4ruDaWAUsjfvQQ8ikw"
  },
  "9DmFkddyfENyEtbKPStQrg": {
    "date": "1/24/2015",
    "text": "I sat at the bar and service was good.  I had chips and salsa.  The chips were good but the salsa was meh.  I could taste the fresh lime but it was rather bland.   My awesome friend loved it - makes sense because she likes no spices whatever so ever.   It had no zing to it and was kind of bland.  I ordered the \"tableside guacamole\" which was amazing!! I recommend.  Made to order guacamole - can't beat that!  It was the best I've ever had.  I had the lunch special - taco and enchilada. It was good but just the same as any other Mexican restaurant.    The menu is quite large and the place was clean.   Sure I will visit again - to order the table side guacamole!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "37C8f85vZwlP5Fsxe_Z8Bw",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/37C8f85vZwlP5Fsxe_Z8Bw/o.jpg"
      }
    ],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "Ao8mTb-_l_wgifOvmZyLyg": {
    "date": "3/24/2019",
    "text": "I usually don't leave reviews but everyone needs to know how the service is absolutely terrible and the food is just beyond disgusting. My roommate and mother couldn't even finish it, nor could I. I ordered a drink, what they brought out tasted like salt water. I had asked to switch it which wasn't a problem but the server came out telling me he was going to still charge me for the other drink. The queso they use tastes like it's 5 years old and the food is just bland and cold. Plus it's hard to communicate because almost no one speaks English. I have been to many many Mexican restaurants and this is by far the worst place ever. To top it all off, I was not going to tip because he was already charging me $7 for a drink he took back, so I left the change from my bill which was probably $1.25. He follows me out of the restaurant to give it to me while shaking his head. I'm sorry, what did you expect? Never coming back here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w5XC2ykH4sCpEIWFHm0RuQ"
  },
  "FH2xXeRolK_RWABGhFY5VA": {
    "date": "6/7/2016",
    "text": "I want to start by saying THANK YOU Christan  for the fantastic service.  I called for reservations for 15 girls. 17 showed up. He worked his butt off.  Everyone ordered drinks, sides, dinners, and salads . The reason we picked this place is because of the great prices for great food.  You can spend 15 a piece and have an amazing dinner!!!  We all will be returning for the authentic mexican options!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "A-7h6vIteSixFcRgguOFKQ",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A-7h6vIteSixFcRgguOFKQ/o.jpg"
      }
    ],
    "user_id": "nOTyFqCXzyyeD-iSmRXcIA"
  },
  "xX4kqOCeT51t_rDAZzP-1Q": {
    "date": "2/24/2018",
    "text": "The food is decent, not the Mexican cuisine you get in other places of Pittsburgh. The service is terrible though. We had to request plates, cutlery, napkins separately. I would say the 1 star is for the food and the other 2 is for the ambience/interiors",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qeKjWZ-V6o435O-LXhjyqA"
  },
  "-2cyBUgP6KHHtKfz9urqBQ": {
    "date": "4/20/2018",
    "text": "This place is amazing.  Food, service, atmosphere.  You cannot imagine how expansive the dining area and bar are looking from outside.  We love this place and will be back very soon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D2on7SZKmCaHzcJ4Z01dIQ"
  },
  "pWq0oLATJy3sKIK9xGPb-A": {
    "date": "4/22/2017",
    "text": "First, I just have to say that the food was fabulous! I haven't had really good Mexican in years! This was top notch! We both had the seafood chimichangas and they were great. The service was the worst service ever! I asked for sour cream and it never was brought to me. There waiter had no time to listen at all. No one ever smiled.  Bad service is the one thing that usually ticks me off the worst. This time however, I will give the restaurant another chance only because the food was that good!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dA-KJEfOZBbROWOu1rszQw"
  },
  "uFFjQbkIEilRJhwY1iC3bw": {
    "date": "1/21/2017",
    "text": "Stopped by for lunch the other and I have to say I really enjoyed it. The interior was nicely done and looks typical Tex mex authentic.  I had the enchiladas and they were good. My wife had the fajitas which she really enjoyed. Our waiter was attentive and stopped by often. Nice place and easy to get to if you are doing some shopping in the Robinson area. Will definitely stop back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "NTSVW_Um4847glX-GfjjEQ"
  },
  "7d0agO8XPo1ceTS56lFh8A": {
    "date": "9/2/2018",
    "text": "First time experience and I loved it!  Drinks were strong and the chicken fajitas I ordered were amazing!  I even had an extra one to take home.  Everything tasted so fresh!  Can't wait to return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IvFJD442Kf6JY14fZ_ywqQ"
  },
  "7-rqLI53vAqEvBSCLFcSOw": {
    "date": "1/9/2015",
    "text": "Great Staff - Undercooked food.  The place is clean, the wait staff was great.  My meal was okay but the rest of my party had issues with their food.  The have a great selection of fajitas.   I ordered the Chorizo, Steak, and Chicken fajita.    The meat was dry - I think may have been over cooked a little.   I really did not have any problems.  My friends selected the restaurant for the their stuff poblano peppers.     The first time, the peppers came out hot but the cheese inside was solid / cold.    The server immediately had new orders made and came back out with their meals.   Unfortunately the same result.      My friends mentioned that they never had this issue before.  I think this place continues to evolve and have high hopes.   The competition is stiff with 3 other restaurants close by for my Mexican fix.  I hope they improve.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "glggoqur8F2uDDMriPQJDg",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Fajita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/glggoqur8F2uDDMriPQJDg/o.jpg"
      }
    ],
    "user_id": "JgOcyMF1lTwSVCarSZrrrA"
  },
  "KBdFqzB1KQBNJZONvJFVRA": {
    "date": "5/9/2017",
    "text": "This place put French Fries on my enchiladas and I've been thinking about it ever since! I expected my tropical margarita to be the star of my experience or the fact that they make homemade guac at the table (I don't like guac but it was cool). These pulled chicken enchiladas were as Pittsburgh as it gets. French fries! I savored every bite and I was saddened that it was so filling that I couldn't finish them all. As someone that has lived in Queens, NY and had authentic Mexican I have never experienced anything like these enchiladas! They came with refried beans and rice and I couldn't have asked for anything less. Kuddos for that fact that it was super busy when we showed up but it was okay because I had enchiladas that kept me occupied. The staff were super accommodating and everyone at the table seemed to be enjoying their food. My only gripe is that they're not as close to the city as I want them to be but they can't help that. I'm glad to have accidentally roamed into this place and can't wait to randomly be out in this area and order this same exact meal again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j9ueJma3VK4xQn_ME2aEKQ",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Shredded chicken enchiladas with fries on top.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j9ueJma3VK4xQn_ME2aEKQ/o.jpg"
      }
    ],
    "user_id": "tekHDsd0fskYG3tqu4sHQw"
  },
  "BCe4vHxOFIv6kRHbaDpIbA": {
    "date": "1/21/2017",
    "text": "The first time I went there it was fine - pretty good Mexican food, nothing amazing, but good.   Upon checking it out a second time the rice was under cooked, the chicken in my burrito was rubbery and it came to the table lukewarm.  I gave it year, before giving it another try, thinking it was bad night for them; I was very wrong.   The most recent visit was even worse, the waiter was rude, straight up ignored me, and got short with me when I calmly tried to get each other on the same page. The food took almost 45 minutes to get to the table, and it was lukewarm. The chicken in the burrito was so fatty I wasn't able to chew some of it, and the rice was - once again - under cooked, it was like gravel.  Once we got our food it took another 30 minutes before our waiter returned to the table (while he waited on every other table around us).   Overall, don't bother, they are just taking advantage of the fact there's so few Mexican restaurants in the area that white people will eat whatever they give them.  Go to Los Cabos in Lawerenceville/Bloomfield area instead.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gxe0rxg1p_Va1oQxy36E6w"
  },
  "QUs3A1DmQhWppDkRCi1DHA": {
    "date": "2/14/2017",
    "text": "I went for lunch and had Texas fajitas. The meat was very flavorful and juicy. Service was great. Salsa lacked flavor a bit and chips were not warm but other than that I enjoyed my meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ro7GFXQDjd2w3v8aFQgrxA",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Texas fajitas chicken steak and shrimp",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ro7GFXQDjd2w3v8aFQgrxA/o.jpg"
      }
    ],
    "user_id": "ngULspqU8a4XieWOJtvEsQ"
  },
  "SfhbUM4u6ZcudsXx9wkYJw": {
    "date": "3/15/2018",
    "text": "I give this place a 0 for horrible service, we'll actually no service at all. We walked in tonight and they sat us in a corner with dirty tables all around us and employees continued to walk by us and never asked us if we've been waited on. We were there about 15minutes and never even got a water (they weren't busy). When we walked out the same person that sat us told us to have a nice night without a care in the world. :(",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E__WevJFojWHCRV1aVgraw"
  },
  "IhbCvA9QYmIaSnJ2Z0_EdQ": {
    "date": "11/29/2017",
    "text": "The positives, cool environment, great decor and friendly service although slow.   I love Mexican food, but this may be the worst I have had sadly.  I really wanted to like it, but if you like Emiliano's, El Paso, etc you will be disappointed here.  I had to say my order multiple times and said no beans many times and they still had beans across half the plate.  I really can't believe this is rated as high as it is currently.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z-dCUf9Jt9uVnAsuR1_SkA"
  },
  "AYAvwo3yuh0ektbLrK9q7w": {
    "date": "12/31/2015",
    "text": "I wasn't expecting much and was pleasantly surprised.  It was busy for a Tuesday night!  Their specialty is a homemade guacamole at your tableside.  FOOD:  Decent chips and salsa.  I started with a pina colada which was a little strong, so I asked for extra pineapple juice to make it less potent.  They added the juice and remade/remixed the drink again.  For dinner I had the CA fish tacos on flour tortilla.  Fish, cabbage, and pico de gallo on two tortillas with a side of rice was a good portion of food.  3 tacos and rice, but no beans???  Not bad at all.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sv5K9wQ04MqxtvytKXORFw"
  },
  "x4OBWDQYtXN3uU0-9yL6TA": {
    "date": "6/23/2018",
    "text": "A group of us at work got takeout and I picked it up. While waiting for the food, the owner (I assume) hit on me. When my friends and I started eating, my friend realized that the guacamole she ordered specifically without cheese had cheese in it. She called, and they did not offer her a refund or a coupon. So I called, since I had paid for it all on my credit card, and requested a coupon for the price of the guac that she couldn't eat. When I called, the hostess picked up, and then I heard her say in a very rude tone \"everyone is asking for a manager tonight!\" Very unprofessional. The manager said he would mail the coupon, but I don't think my friend ever got it. Also, this same guacamole had whole sun dried tomatoes in it - several inches long - that obviously you couldn't scoop up and enjoy with a tortilla chip. I'm very disappointed because the food tasted good, but the customer service was atrocious, so I won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C-Fnl8F3CoxrDqAEkVpOoA"
  },
  "pBk7fpoF9SaYKqfDSts3mQ": {
    "date": "8/28/2018",
    "text": "The chicken fajitas were a nice size however they were totally flavorless. I've never been in a Mexican restaurant where there was an up charge for cheese to put on the fajitas. Overall it was not the best food I've ever had. We have been to other Plaza Azteca locations that were awesome. This one is definitely lacking.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LNZrQtiZLVvCNJ6SAK3fSA"
  },
  "E4QkYwh0Kkj98qi5JtUw0w": {
    "date": "8/4/2014",
    "text": "Tableside guacamole was awesome!  You can get it made mild to very spicy.  Unlike some of the other local Mexican places where you get the same ground meat in 4 different dishes, this place has a variety of meats prepared different ways which makes it very enjoyable and good.  Service was great and almost too fast...lol.  We will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jnn4g_Ydkj152omk17L7Rw"
  },
  "DVDWS2vou1SYgRx72_aEJQ": {
    "date": "3/13/2015",
    "text": "Just ate there the place is awesome looking,the staff was super friendly. Went there with girlfriend and daughter they liked it. The food was fast and delicious. My girlfriend had a Beer-Arita it was huge and tasted great. We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QaejDXw-NmBgSEpncjBAVg",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Tuna Appetizer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QaejDXw-NmBgSEpncjBAVg/o.jpg"
      }
    ],
    "user_id": "bK_iKdEJ3OxneuIzF6-dJQ"
  },
  "gz-XoZZohRwK4J9uybm4SA": {
    "date": "8/24/2014",
    "text": "First time to Plaza Azteca. I was so impressed by all aspects of my experience that I'm typing this review while I'm still sitting at the table. The wait staff is efficient and courteous. The food was impeccable. The two of us shared one appetizer and one entree and are still taking home a box of leftovers. I would highly recommend this place to anyone, and will be back often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "phsDm7coAiXBV4rCEURedA"
  },
  "QKY149QGXhxcL0g6JW85Ng": {
    "date": "5/14/2014",
    "text": "THE GOOD: -Didn't need to wait to be seated -Very polite waiter + exceptionally fast service -Food was delicious and reasonably priced -Very generous portion sizes (free homepage chips, salsa, and chipotle sauce included!)  -Guacamole was DE-LICIOUS (even just the dab on the \"OMG Nachos\" -Building and interior was clean and tastefully decorated  THE NOT SO GOOD: -Only real (very minor) negative I could probably mention was that only two flour tortillas included with the chicken fajitas (but the manager checked in with us and offered more without us asking)  BOTTOM LINE: Definitely worth returning back to - convenient place to grab a bite to eat when driving into the Pittsburgh International Airport!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zP6JBa1brxV5GrDl9fNIAA"
  },
  "q_Fc_nQ5pZ3_v8pUS4qxXQ": {
    "date": "7/17/2017",
    "text": "Ok,  I'm giving it 3 stars but 2 1/2 would be closer.  The food is fine.  Not mouth watering fantastic but pretty good.  I was here for a late lunch and there weren't many customers.  I was seated quickly and the waiter was quick to bring chips and take my drink order.  He seemed to speak very little English but we got through it. About 5 minutes later.  He came and took my food order.  The food arrived quickly enough.  That's it.  Never saw any service again.  Nobody ever came by to ask how things were or find out if I needed another drink.  I found bushed my meal and after sitting for about 15 minutes,  flagged a young lady down and asked for my check.   I may try them once more in the future but it's not a given.  This place has now been around long enough to get their service issues worked out.   It's starting to appear that they just really don't care.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "65Td8e0HTqPwsF-ksap4UA"
  },
  "-ND4MayIyBM1qrBQOVlTXQ": {
    "date": "12/24/2014",
    "text": "Very good food and fast service out from the kitchen, but the wait staff needs to move a little faster. The waitress we were assigned to moved a little slow, took a long time just to take our drink orders, and longer to take our food orders. Once the food orders were in, however, the food came from the kitchen very quickly.  The food was excellent and the lunch portions are a perfect size. My enchiladas suiza had tender chicken and the creamy tomatillos sauce was great. They also have some of the best rice I've had lately.  We'll be back to work our way through the menu, but I hope the wait staff is a little more responsive next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F43IUmEt__FB66Fr4c7JiA"
  },
  "a0pKqsOTggNI2eronnL30A": {
    "date": "5/18/2014",
    "text": "Really friendly host, waiter, and chef. We saw waiters for other tables were also very polite and attentive.  We got the OMG Nachos and a chicken fajita platter. Both reasonably priced and delicious. Some of the best nachos I've ever had.   The name of the nachos aren't exactly evocative of traditional Central American fare, and that unusual identity exists in the ambience of the restaurant as well. On one hand, the walls resemble old Aztec ruins, but on the other hand, there are TVs playing sports and Spanish pop music playing over the speaker system. Kind of feels like the place has an identity crisis; maybe it doesn't know what it wants to be; or maybe it wants to be in this weird in-between place. OMG Nachos limbo.  I couldn't help but feel that if they closed the blinds a bit, put on traditional Mexican music, and removed the TVs, they could probably get away with charging an extra 20% on their meals.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Ib9WmBBLObx341Ue5VhVQ"
  },
  "ZUNKKwX-vMnQbKJunC_yIA": {
    "date": "12/23/2015",
    "text": "The place looks attractive, menu is original, and the food and service lived up to expectations. However, I urge customers to check their bill closely. I suspect they practice systemic overcharging and it's a profitable business model for people who are less diligent. Luis didn't address our concern; be especially careful when ordering sangria. Oh and also the handicap stall was out of toilet paper.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VnmnZ0q7EfH-x5-q3U0VTw"
  },
  "v1iygC-7kvtYsfG2SLA5AQ": {
    "date": "2/25/2017",
    "text": "Great service from Carlos on a Saturday lunch break! Lunch specials are every day (including weekends) from 11-3. We ordered the queso fundido that had plenty of chorizo. I had the lunch fajita burrito & it was very yummy. Tender, juicy meat with just enough caramelized onions. Sides were a bit small but just the right size after having all those unlimited chips & salsa! Will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VK5yOO8aIz4-8HekT7NQ1Q"
  },
  "MzHKX9t6VrXNVKMuHW3QTA": {
    "date": "6/20/2016",
    "text": "First time visiting, sat at the bar.  Best thing about the visit, service at the bar receives all 3 stars.  Maybe it's what I ordered, had the taco salad with ground beef, didn't find the beef under the mound of lettuce, rather, refried beans with little flavor, very soupie.  Atmosphere is there, very clean and welcoming - may try again during next visit?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "20FdC5LiCxCuxue6o2qn-w"
  },
  "udH2O_2Qx_Z5f6x2QTjUjg": {
    "date": "3/16/2015",
    "text": "Friendly staff. Great service. But there's a 50/50 chance your order will be cooked or made right.   Relaxing, chill atmosphere. If you're just in it for a great time with friends and are flexible with your diet, you'll have fun.   One of the few places in robinson that never feels overcrowded or has a wait.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "207M5mcAlUgha36e78Geqg"
  },
  "lrBEIuypAci33GCJx17Evg": {
    "date": "3/30/2017",
    "text": "Had the marinated chicken tacos with pineapple salsa, very good.  Service was slow while sitting at the bar.  Chips and salsa average.  Margaritta was not authentic quality for the price.  Close to hotel but I wouldn't drive to get there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o50iPwXz4rZ7wxGMhHyliw"
  },
  "CwlbvTp0Lq3teibUUeALIw": {
    "date": "5/22/2016",
    "text": "Yum!  I was sooo bummed out when I found out that Don Jose's Mexican Restaurant in Robinson closed, but I have found a place just as good, maybe better!  I have been here four times in a couple months. The chips and salsa are ok, chips are unsalted thick corn and salsa is smooth and mild, with a cilantro kick, and they're free!  The fajitas are delicious!, lots of peppers and onions, we get the mixed steak and chicken, they are equally good. But they only give you 3 tortillas, and you could probably make four or five decent fajitas from what they give you.  The quesadillas are the best!  I don't know how they make them, but they have a buttery/almost toasted marshmallow flavor that is to die for!  The burritos are good, just meat and onions inside.  The rice has a delicious flavor on its own. The table next to us got the handmade tableside guacamole, and they said it was very very good!   The service was excellent, refills came quickly.  The check could have come sooner, as I've read in other reviews.  Maybe they don't want to rush you?  If you were in a hurry, I would let the server know.   This place is pretty busy and there are usually lots of Latino people in here, which I think is a good sign. A warning about the fried ice cream, it's a toasted coconut crunch coating that wasn't very crunchy.  I was expecting a cinnamon crunch coating like Chichi's used to serve and was disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Lg1__qyKbHqhF7FjId_Lg"
  },
  "hR-l914ti947ulWQp8vuyQ": {
    "date": "5/14/2016",
    "text": "This is a fabulous restaurant! Great atmosphere wonderful food perfect service! Love the coffee",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RoErV9NZlo5Cx1g6jQDbjQ"
  },
  "dUt5Rj14RV7gGoCE85tQjg": {
    "date": "2/25/2016",
    "text": "Has the pleasure of visiting for lunch, there was a decent crowd in the restaurant and they were fairly busy, I am not a fan of Mexican food but my wife is. I was surprised my enchilda supreme was very good but I wish I had ordered the burrito as my wife's was excellent, the service was very fast considering it was lunch. Would absolutely visit this restaurant again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BRJpV6pCMljPLqROG_WhGA"
  },
  "7GRaMbEL0BwokRYAdaSnFg": {
    "date": "12/28/2014",
    "text": "Had a nice experience here. Good atmosphere, great table side guacamole, decent service.   My only complaint was the weird BBQ sauce marinade on the shrimp for my La Flaka chopped salad. For a dish with so many varied flavors, it seemed a bit like overkill.   Overall, however, I was pleased and will be coming back in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vDxy7PavN5L7U4IgoZ3Ijg"
  },
  "rJPQkH3aSfNaZTxKMWoyag": {
    "date": "8/13/2015",
    "text": "Like the other reviewer, I am very surprised by the low ratings for this restaurant as I think this is the best Mexican place in the neighborhood. I have been here many times for dinner and lunch and never had a bad meal. They are very generous with their chips and (rather hot) salsa, and the tableside guac is always good. Everything is fresh and there is a great variety of unique dishes. This is so different from the cookie cutter Mexican restaurants in the neighorhood where everything is smothered in cheese and beans. The only problem that I can think of is some of the waiters don't seem to understand English very well, but that is a minor issue for me as they are always friendly and attentive, whatever problem we had was always resolved quickly with a smile.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FjMQ4wfwTOeNZToQir4ulw"
  },
  "cVnO92IVIwAn3Oy_pzMrVg": {
    "date": "12/10/2015",
    "text": "Service at the Plaza is always outstanding. We never wait for a thing, service is fast and friendly, and everyone is interested in making sure you are taken care of.  And the food is just the best. Tonight I had the Enchiladas de Mole and they were heavenly.  I've been her a bunch and have never had anything that was less than stellar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2N4VBte7Pn9joYiGSj21QQ"
  },
  "ImB4xCg8s0m8Wru3W371mQ": {
    "date": "9/9/2016",
    "text": "I'm not sure if this was a really off night for them or what but it wasn't worth the money. We never got our appetizer, we only saw our waiter TWICE and then the food was not what it was supposed to be. The quesadilla was tiny and not what you would expect as it has a drizzle of cheese inside it and mainly just meat. The fish tacos were supposed to have a slaw on them and all they had was some red cabbage and sliced carrots. The rice with both was just super, super dry. It wasn't terrible by any means but it wasn't good. Going to chic Fil a now bc portions are tiny. We won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JpBieIvIXDJiptJQFP_IRw"
  },
  "dydUlUD0R1Vr7e_KOQPj2A": {
    "date": "9/12/2015",
    "text": "I am in agreement with Norma G. - I'm surprised by the lesser reviews.  My wife and I have been to the restaurant a number of times (over 6) and we have had very good service and tasty, well presented food.  Let me put it this way - this restaurant serves authentic Mexican food.  It is delicious and as \"real\" as I have had since my stint in Texas.  Unlike other \"Mexican\" restaurants in this area, and other places, the food is made as Mexicans' make it and not all spiced up as some purveyors do.  We LIKE it, a lot!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qPEyMG_E9McBWgIrSTOn2w"
  },
  "cLEJ5qqM0bs_C_5KAigEJQ": {
    "date": "3/24/2019",
    "text": "Very average food. We ordered vegetarian fajitas and there was a piece of chicken in it. Drinks were either small portions or diluted. Better places to eat in the area",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aPLWav9KX3rO1pSSPlKU_A"
  },
  "d7yzT_Hgkt5Mlp2QpMSoRA": {
    "date": "11/1/2018",
    "text": "Get there early or they won't serve you.  Hours show they are open until 10:00 pm.  Came at 9:45pm. The host said we could not sit in donning room but we could eat at bar. We walked into bar and three employees at end of bar said they would be with us and continues conversation for 5minutes. before coming over and telling us kitchen is closed. I went back to host and asked him why he would send it to bar when we asked to eat. He went back to kitchen and said they had already cleaned up.  I suggested he turn off the open sign in the window. I'm sure he left it on in case his manager does a drive by. Clear no management actually worked in this place.   Try somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PPMPjwLNmTUW5Lofkbx7Gw"
  },
  "FyaXInQJ7rc4eF2MEK2Rxw": {
    "date": "4/6/2019",
    "text": "Service was excellent. We were a large party and were seated almost immediately. After dining at multiple plaza location I will admit that this was quite good. I order the carne asada tacos, they were quite good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tJQkN8r8Akyr9X0PcKSCIQ"
  },
  "ED8y-G3AeUzIIE1pcdGHRA": {
    "date": "9/15/2018",
    "text": "I have frequented this establishment many times, and this experience has been absolutely horrible! It was somewhat busy, but our party of three was seated rather quickly. We literally sat at the table for almost 15 min before we had to flag down the waitstaff. Come to find out our waitress (Cyndi) had passed us and made eye contact with us several times but refused to greet us. She finally tended to us mid-meal. We were the only ethnic party in her section, so it's fairly obvious why we weren't greeted but other parties were greeted with a smile immediately. I even asked her who was supposed to be our waitress, and she replied she was. I was in utter shock. I am a master's student and to be treated like this is absolutely disgusting. I will never patron this establishment ever again.  This needs to be dealt with. Period.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9s0LYXf8xntWiNB27edocA"
  },
  "9icXIzP43SQIqh48SKa7bA": {
    "date": "4/4/2019",
    "text": "Damn I am disgusted I even had to leave one star. Came in starving. Ordered the OMG nachos because what's better than a big plate of nachos when you're starving? I was brought out a plate with 9 (yes I counted) Tostitos rounds on it and a little bit of veggies on top. I was honestly waiting for Ashton Kutcher to come out and tell me I was getting punk'd. I ate my 9 nachos and then sat their wondering why I ever decided to come here in the first place. 0/10 would not recommend, and I am currently calling border patrol. Amen",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "izFXTVcpQi4j6N3cDyUFkA"
  },
  "Tsq7tSyMwOWvbzTNIWj9vg": {
    "date": "10/8/2017",
    "text": "I just moved to Robinson this week and thought the perfect way to end a long move was some good Mexican good and a margarita. I had heard good things about this place and the yelp rating was pretty high so I thought I'd try it out.  I was somewhat disappointed. The food was subpar. It wasn't bad, wasn't great. The margarita was awful. It tasted like tequila mixed with floor cleaner. And it was $15! I'm not from the area, so maybe $15 is normal, but where I'm from a monster margarita is $10. The worst part is I couldn't even choke down half of it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sK3RHCmgkvMu3tzfMABrkw",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Chicke. Chimichangas with rice and beans and a tropical margarita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sK3RHCmgkvMu3tzfMABrkw/o.jpg"
      }
    ],
    "user_id": "Xx7cy3AkqeI_LQUwlLybrw"
  },
  "Q6dqUMjgxNlWaT68w8QGiw": {
    "date": "6/25/2018",
    "text": "I was not impressed with this restaurant at all. I thought the food did not taste nice and the service was just okay.  I'm a vegetarian and my server was so confused when I told him I would like some vegetarian enchiladas. I had to explain it at least three times. The margarita I got was mediocre and the food was less than that. When my bill came out my server didn't know how to explain the charges (there was a funky charge on the bill which was later explained by a different server). I wouldn't visit this establishment again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "B-9iWvsWhih06nY6z4WBbA"
  },
  "PyE3IMCmXxVYiZVo4yJtEg": {
    "date": "3/16/2019",
    "text": "The food was greet also so was the service. My complaints were that I paid $5 for three pieces of shrimp. Then the waiter didn't even bring my change back, he assumed it was his and kept it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q0C1A2wf4oyC5eXjzijYJw"
  },
  "V8cA6zPHBfYkBBAIPkK8jw": {
    "date": "2/18/2017",
    "text": "Great service, drinks, and food. Gauc was super delicious. We ordered the fajitas for 2 at a reasonable cost given all the meat we got.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "axMi325QeQ6-q2Te7fNYxw",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Tableside gauc",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/axMi325QeQ6-q2Te7fNYxw/o.jpg"
      },
      {
        "img_id": "Im5CkxX9iFQ6GS-fNao1Mw",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Fajitas for 2. Super good.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Im5CkxX9iFQ6GS-fNao1Mw/o.jpg"
      }
    ],
    "user_id": "T_mcCDS5mfVfGkYX799aBw"
  },
  "kNrD6JNk1EWocwXa0PqX-w": {
    "date": "12/11/2016",
    "text": "We stopped here for lunch. We had about 10 in our party.  We waited about 20 mins to order drinks which was mildly disappointing. We all finally got drinks but then waited about 10 more minutes to order our food. The food came out about 15 mins later so we really had to rush and eat and pay so we could all get back in time.  The restaurant was not packed but the service made it seem like it was over flowing with people.  The food was pretty good and the marg was big. I would say if you have the time , it's worth a stop !",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AKMRMIIPSHzp4KD76Z9Tgw"
  },
  "Ae-okXVnWCuQprC54rsomg": {
    "date": "8/11/2018",
    "text": "Very disappointing experience! Had been to other restaurants in this chain and this was by far the worse! I personally will never eat here again!   Check your food when you send it back (incorrect order) to make sure you don't get the same food back covered in cheese~",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OelGvtozlOd3ZC677QIb4w"
  },
  "r5MncaQ4vlJ2jNnl8mtGzg": {
    "date": "11/16/2016",
    "text": "A very nice experience we had here for first timers. I've been wanting to try this establishment and I'm happy I did.  The host was quick to seat us and he actually was our server. The drinks were brought out quickly and order was taking accordingly.  The complimentary  salsa and chips were very good with a nice spicy kick. The dinner came out quickly but slow enough we could devour the chips.  We ordered tacos to fajitas and I picked #12 I think it was. I was stuffed after killing my plate. I did have some help with I don't likes from other plates. The black beans with cheese were killer. (In more ways than 1).  There was way too much food and not enough shells for the fajitas.  We ordered fried ice cream which was good and enough for the four of us.  We decided to get a sopopia(sp) also and they forgot the ice cream. No idea how a server could allow that happen. A very nice dinner out. Give it a try....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oUd5AZExMh45J7its5DMfg",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oUd5AZExMh45J7its5DMfg/o.jpg"
      },
      {
        "img_id": "dTrA-VUh5wRcbNNwR3Ejyw",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dTrA-VUh5wRcbNNwR3Ejyw/o.jpg"
      }
    ],
    "user_id": "5Ci7FP9Qh_Kw21Doy9WCYA"
  },
  "PmWnkop3liS6pkKP9mRRuA": {
    "date": "10/15/2016",
    "text": "I went out on a whim and gave this place a try. After reading negative reviews; I hoped that my experience would be different, but it was not. We walked in and no one was at the hostess stand, so we waited a little while to be seated.   Once we were seated our server did come over right away to take our order. My mom ordered shrimp over rice and I order my usual chicken enchiladas all rice no beans. When the dish came out it came out with beans, it was a simple fix so they brought out another one in no time. I wasn't very pleased with the enchiladas themselves. The chicken was diced instead of shredded (which I prefer shredded). The shrimp to rice ratio on my moms plate was extremely off. She barely got any rice with hers and the dish itself was $13. Rice is cheap, I'm not sure why they skimped her with the lack of rice. Overall, this isn't anything special and I wouldn't be eager to come back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qzlHOYARcFUufhX3w-jPeA",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Chicken enchiladas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qzlHOYARcFUufhX3w-jPeA/o.jpg"
      },
      {
        "img_id": "Xz_ygQVI9U-xl2Cd-lUYmw",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Chicken over rice, with barely any rice.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Xz_ygQVI9U-xl2Cd-lUYmw/o.jpg"
      }
    ],
    "user_id": "mYJW4-M4tcRygSwdT3A6Ww"
  },
  "GF-CPfyIv2arStreBL4-Vw": {
    "date": "6/12/2018",
    "text": "FIRST OF ALL BITCH.... we waited 20 minutes for him to come back and take our order, the waiter poured water in my glass full of sprite, which he had gotten for me in the first place. I also waited 10 extra minutes for my food to come out after everyone else got theirs. We are going on 20+ minutes for our check to come. Service was ridiculous.  don't come here! the two stars represent how many brain cells I have left after dealing with this experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F3U2GZgA4v7ZOWn-voMGDA"
  },
  "bnwm3fGAw42T-9Kp6vKbkw": {
    "date": "12/2/2018",
    "text": "Costumer service was good and the food was good. I'm taking one star off for the cleanliness of the bathroom and one star for the amount of food they give you. For the price that you pay which is not cheap, you get barely any rice or beans. We asked for more and even the side was just for kids.  If I'm paying $20 for a tiny steak, at least give the costumers more rice and beans to satisfy and adult.  Will never go there again. Too expensive for the food you get.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Bv7l_W0oG0lYqYY3FV0dA"
  },
  "dnKJlspVH4G26COhg3dVfg": {
    "date": "11/28/2018",
    "text": "Stopped there after Costco and before the airport. Thought we would share a plate of nachos before dropping off a guest. The worst nachos ever. Had to ask for a vegetarian version and they brought out chips with sauteed onions and green peppers and cheese on top. The vegetables were a bit greasy and the salsa was like ketchup. The service was good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rly1BsseO48KJWWDoMgBfg"
  },
  "70g-jnQosV-kSbfvclcSzw": {
    "date": "2/2/2019",
    "text": "VERY POOR SERVICE, BUT GOOD FOOD The drink menu has no prices, this would be ok if the wait staff knew what the prices were.   \"How much is wine by the bottle?  Specifically the Cabernet\".   The waiter goes away,  comes back and says \"$20\". Ok we will have the Cabernet.  He comes back with a Malbec, \" Sorry no cabernet...\". And shows the Malbec.  We say \"no we don't like Malbec \" he insists it's good \". :)) Now we have to start all over.  We order tequila and a Mexican mojito.  We don't know how much it costs.   At this point in time we still haven't ordered any appetizers, why? because the waiter has not asked us yet.  The chips for the table have been refilled twice so far so that's good, but we didn't come here for the chips.   This place need to train its staff.  A waiter carrying the rolled napkins and forks dropped two on the floor.  One set was left on the floor the other was given to the customer. Ewww.  Our  waiter mistakenly knocked part of our chips on to the table, he picked up a few, left the others on the table and walked away, while he popped the few chips, he picked up, in his mouth, NOT Professional!!! The highlight, up to this point the Guacamole, which is prepared fresh in front of you and is quite exceptional.   We ordered veggie and chicken fajitas for the main course and it was really quite good.  The service throughout the entire meal was quite pathetic.  It's a pity, if the service was given a bit more attention, this place would put some of the other wanna be Mexican restaurants out of business.  Would I come back?  Maybe, after I have time to forget this experience!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3jneq1N6ct_2nUHsTlnGFQ"
  },
  "-mzQb7KJ1XhHNorkAhLNpQ": {
    "date": "6/12/2016",
    "text": "Our second time here. I think this is a hidden gem in Pittsburgh for Authentic Mexican food.  The table side guacamole had to be some of the best I've ever had- I'd put that ish on everything :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zuEX0q5juPOn_7eSkl3CsA",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Fireplace",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zuEX0q5juPOn_7eSkl3CsA/o.jpg"
      }
    ],
    "user_id": "wkokiWbTL9yf-NJUK6cb8Q"
  },
  "GZepC4JQrNOxPnRAkvxdCw": {
    "date": "6/6/2018",
    "text": "My friend and I were seated right away, however, it took about 10 minutes for a server to offer us water and then another 10 minutes for the server to come back and take our order.   The food was OK not great and there are no sides served with entrees. I was expecting to get at least rice or beans.   I will not be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yhB2CmSkHhmpPN1cRm0zmg"
  },
  "VtJkFBknZaa_FU8c3SRVfg": {
    "date": "10/15/2018",
    "text": "Some of the best mexican in pittsburgh. The tacos al pastor were so amazing. Margaritas are good and strong",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bcPhNhKMIXHqrjNc8_nEug"
  },
  "AeXqpOEgv8gwGTy15w7EOw": {
    "date": "12/23/2018",
    "text": "Just had the most remarkable lunch experience. Post stressful holiday shopping popped in for a quick bite and had a wonderful experience! Sweetest servers, excellent food, tasty cocktails and I even got a little present that I will be rocking back in Phoenix, thank you Marlyn! If you haven't been, you need to come and spend time with these darling people. Merry Christmas",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W7ThCXg0ldkwaPxrQr9C-g",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/W7ThCXg0ldkwaPxrQr9C-g/o.jpg"
      }
    ],
    "user_id": "yyKnddI0lKfgr0zW8CObLQ"
  },
  "apmMkSOxPm_cAAwVl10FMg": {
    "date": "4/23/2017",
    "text": "Plaza Azteca is what I would call your low budget end of Mexican restaurant. It took a while to get waited on but after that things went smoothly. They do have a lunch menu till 3 where you can get smaller portions for less money.  Since we were celebrating my son's birthday he ordered a special guacamole dip. You can choose how hot or how mild you want the sauce. They give you a never ending supply of tortilla chips. I decided to go for the lunch portion of the chicken fajitas and he had a two burritos. Both came with sides of rice and beans. Portion size on these side were fairly huge so I was glad to order the lunch portion.  The food was okay. I'd probably compare it to one of those Mexican chain restaurants that no longer exist. We were able to get our food fairly quickly and were done within the hour. The place does get crowded on Sundays but they seem to have plenty of room to seat you.",
    "rating": 3,
    "rated": {
      "funny": 7,
      "useful": 13,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "5Xar2siTMPuPeQniJrwigQ",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Chicken fajitas",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5Xar2siTMPuPeQniJrwigQ/o.jpg"
      },
      {
        "img_id": "WmX1x-dG2fIjJmOo7Qtf0g",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Burrito and rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WmX1x-dG2fIjJmOo7Qtf0g/o.jpg"
      },
      {
        "img_id": "xyRmGL8U6nj_G_H78-gkIA",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Table side guacamole",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xyRmGL8U6nj_G_H78-gkIA/o.jpg"
      }
    ],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "HSCWc9lCg6cht1_NY56kTg": {
    "date": "7/1/2018",
    "text": "Stopped here on a family road trip Good was excellent.  Some of the best fajitas we've ever had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "b3L0xbSnWkS8hyrlNiTVFg"
  },
  "zlaTAT7-xFN3Daa5rWkZzg": {
    "date": "6/30/2018",
    "text": "The food was good, service was very good, the atmosphere was just ok.  The place lacks energy, because it is a converted Johnny Carino's.  If you have ever been to a trendy, vibrant Mexican restaurant you will know what I mean when you step in.  The experience falls short, but it is easily worth 4 stars.  The shrimp fajitas were good enough for me to polish off, and I would return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9_PT31RxTMpKJYGC7BI8aQ"
  },
  "hgUn3o-t3JLuUKxbq64YWQ": {
    "date": "3/14/2019",
    "text": "So yummy in my tummy. My husband and I had lunch here for the first time and the service was great Food came out quickly and tasted very good. Very authentic I will go back again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ewCx5Fbd97W8d5vPscW-fw"
  },
  "2B5gGjRzGokun5PbnKCoig": {
    "date": "7/31/2018",
    "text": "Got chori steak this time, chorizo was very good, steak was like eating a rug.  One quarter was tender and tasty, but the rest was dry, tough and very hard to cut.  Wont order again and may not patronize the restaurant again!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LGXlkLvjylax593u-evS7w"
  },
  "hcd807vGCv8_7pUxm8anyw": {
    "date": "2/13/2019",
    "text": "We ate at this restaurant 2/13/19 for dinner. It was very clean and was fairly busy. We were seated right away and the service was outstanding.   The salsa that was served with the chips was very good. My wife had the taco salad with a side of guacamole. I had the chicken fajita salad with a side of the cheese dip. Both meals were very excellent, filling and reasonably priced.   We much enjoyed our dinner and would recommend this restaurant to anyone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CybpVOKOlUK2wllUjXMhpw"
  },
  "PK1-CgRbUU7j6GmQFyKmHw": {
    "date": "9/2/2018",
    "text": "Amazing food.  Never had any issues with this place and flavor wise love it! Anytime I'm in the area I need to stop and get something. Don't forget the margaritas!  YUMM",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6-BmbOWNq5uLZ2-Xe8KbYQ"
  },
  "C6wQlxzI4pzlpYcd7BxT6A": {
    "date": "3/27/2019",
    "text": "3/27/19 It's day three after our lunch here and my boyfriend is still experiencing violent food poisoning. I am VERY upset with how disgusting the food must've been to make this sickness happen. He should receive a personal apology from the kitchen and manager here. This is ridiculous.   Do not eat the meat here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q5poNt2YBpy5a6C0amm7ZA"
  },
  "4d1bnQM7EsFFFl8JSfx-hA": {
    "date": "10/16/2018",
    "text": "I don't think I'll come back here anytime soon. The service is slow and the servers don't understand or speak English. It's very hard to communicate in that situation.  We came because we had coupons.  The food is just average. I didn't like that there were no prices in he drink and dessert menu.  I had the vegetarian enchiladas and my friend had the shrimp fajitas.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dyJeQm97lEZ1LgrUFp_kSA"
  },
  "8nFWaNsMp6EQFOqX89m4LA": {
    "date": "7/10/2018",
    "text": "Amazing guacamole made right at your table!! So incredibly fresh!!! Highly recommend as an appetizer!  Other meals were also excellent!  Atmosphere was super cool, like a Disney experience!  Service was fair.  Very inattentive.  But food quality makes up for it.  Highly recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NiVNIj1RDO6gFhBKHJUA5w"
  },
  "xSbDDxz96cRq89sGk4lKZA": {
    "date": "5/27/2019",
    "text": "I go here often for lunch as they have pretty cheap lunch specials. Everyone is always very nice, and the food comes out quick! The queso cheese sauce is amazing, and I would recommend. Their margaritas are strong and delicious! If you are looking for more authentic Mexican food, go here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KvQXCPMf4TyLbjHZ2OyH_Q"
  },
  "AERXAaOl_iXCCvUN3Kq4Tg": {
    "date": "3/3/2019",
    "text": "Beautiful atmosphere, kind and attentive waitstaff and reasonable prices not to mention amazingly delicious food. What's not to love about this place?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f-jlEgkwgRgFL3yzGEnWNA"
  },
  "TCAalOx9isL-VEVsTcyMPA": {
    "date": "8/6/2018",
    "text": "One of my favorite Mexican places in Robinson! I always go at lunch time and the service is pretty quick. Their queso is your average white cheese dip from Mexican places. They have a chopped salad that is so so good, tastes very fresh! My friend had their chicken tacos and they were excellent as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ve-1onm-GP6YivBVb3MPmg",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Chopped Salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ve-1onm-GP6YivBVb3MPmg/o.jpg"
      }
    ],
    "user_id": "L-7CbkwG4by1yoS6RqSGmw"
  },
  "Uy3CKUVZgbpm469Vmqy1tA": {
    "date": "1/26/2019",
    "text": "The meat was so greasy bin was inedible. No taste to food very overpriced. I had to not eat mine it was so greasy",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AoUuV2NVV8gvjEr-n4yOow"
  },
  "2cH4LmYCwk3ga4Wl5Fdaaw": {
    "date": "2/19/2019",
    "text": "Easily our favorite Mexican food spot in the area. Always great service and delicious food. Our 7 & 5 year old boys love it here too. My wife and I can't get enough of the table side guacamole!!! Keep up the great work!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ThDU6vhUi57GpXBdMhRzYg"
  },
  "gtg4HTjHEgys-oiM3oUK1w": {
    "date": "1/12/2019",
    "text": "I had a horrible experience at Plaza Azteca.  I was about 20 minutes late to dinner with friends. When I got there they had already ordered the table guac.  Didn't have drinks or silverware and got a bowl of busted chips.  I asked for a round of water that took a while.   My friend asked for a glass of wine that never came and she got charged for.   I ordered a taco salad and a fajita salad was brought out for me.  They fixed that but then charged me more for the fajita one.  The table next to us had all the same problems.   They got their meals before the appetizer.  Then it took a good 20 minutes for her to bring our checks.  Then another 10 for us to pay.  She took our checks the same time as the next table and sure enough brought back the wrong cards to the wrong people.    Was told it was her \"first day in that section\".   It seemed all she was worried about was the cash register.  It was really bizarre.    The table guac was the only reason I gave this review 2 stars.  Otherwise it would be a -1.  I didn't like guacamole until I tried this and it will be the only reason I go back....IF I go back.  The taco salad portion was ridiculously small.  Proportionally, imagine a quarter on a post it.  That's no exaggeration.  In the end, my friend made the waitress cry and the manager gave us 25% off of our bill, but most any other place would have comped our meals.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uqLrCORgJmEnhDhbrf2JAQ"
  },
  "hsk52MOan0hOR_nOYQle1g": {
    "date": "5/5/2018",
    "text": "My go to for fantastic Mexican style cuisine. I've ordered so much of the menu and have settled on the following over the course of a year:  Vegan Burrito Bowl - without sour cream and cheese  Tableside Guacamole - everything, made medium  Salsa + Chips  I'm serious people, the tableside guacamole is knock your socks off good. It's the best I've ever had and considering my mission in life is to find the best guacamole...this says a lot.   The complimentary salsa is perfect with a bit of spice. The roasted garlic adds another dimension. The chips are typically served fresh and warm.   The vegan burrito bowl that I have an addiction to is black beans, rice, lettuce, and pico de gallo.   I don't order alcohol while there, I'd rather fill up on the food. Service is always good. The interior of the restaurant is spacious and always clean. No matter how busy the parking lot is - go in, there's very rarely a wait. I eat at this location numerous times a month and every time is consistently delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "asbO7KLh00WrheXa2-IjDQ"
  },
  "IH5sN77rOUHkf3263qVmgA": {
    "date": "8/28/2016",
    "text": "This place is hit or miss.  The burritos are amazing.   The salad I had the last visit was just ok.    Service can be hit or miss as well.   We do like their food a lot and would return.   I would just order the burritos!  Also,  I would definitely say the table side guacomole is a must! You can request mild, medium or spicy.  The spicy wasn't too spicy but it had the perfect amount of kick.    Hands down the best guacamole we ever had...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LrWzWhixHQQ92ZsWak0YCQ",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Probably the best guacamole we ever had",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LrWzWhixHQQ92ZsWak0YCQ/o.jpg"
      }
    ],
    "user_id": "UAu2YHF-nByxbJoGhrYUFA"
  },
  "qM7bYA-L1-kpqwI5NsZsdg": {
    "date": "6/18/2018",
    "text": "Service was quick, friendly, and attentive. Food was excellent and served up fast. Atmosphere was casual, family friendly, and featured some televisions around to keep up with the World Cup. I'd definitely visit again. Like all PA \"Mexican food\" options, I wouldn't call it \"Mexican\" but \"Tex mex\" or \"Mexican inspired\" - and it was a really great version of just that. Try the queso!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "zfk7l2aOZKoAh05OoXRTwQ"
  },
  "4_58FeGLHqOJSMhHTHyHUQ": {
    "date": "2/14/2015",
    "text": "We have been there many many times because we really did enjoy the place but after today I will never ever go back. We are used to having some servers who speak very little English but today I couldn't understand a word and he was so awkward. Once we ordered he never came back until i flagged him down for more chips. Another server brought our food and again had to flag him down for more things. After that he literally never ever came back. Another server had to take the check and get us cashed out. When we went to see the manager he was too busy on his cell phone laughing it up. So unprofessional and down right ridiculous. You lost our business forever.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WadGCPywkapkt2hmLVb1YQ"
  },
  "REahX4H-tmIPzOnje4aZdA": {
    "date": "5/30/2015",
    "text": "Wonderful little mexican restaurant. Table side guac is a must. They were all friendly and clean the food was delicious and plentiful. And the drinks were spot on.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-RnVAr6q734KjWt2mEDuuA"
  },
  "JG8p2RsyckUpIApzjmtg5A": {
    "date": "6/29/2014",
    "text": "The waiter we had was not the best.  He was not very attentive to us.  We had to constantly ask for refills.  One of the plates had two chips we had to get the manager to get a new plate.   The food was extremely salty.  I don't recommend anyone going here for Mexican food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QF4_WwRBFj3Uw89-McVB9g"
  },
  "jXAlqSMZCfYSApU-LwuQ-A": {
    "date": "5/27/2014",
    "text": "My wife and I really enjoy Mexican food. We gave this place a try, and were very satisfied. The staff was very friendly. The food was pretty good. We ordered the table side guacamole, which was excellent, and fresh obviously. The tableside preparation was a nice touch. We also ordered the fajitas for two, which includes chicken, steak, pork, and shrimp. That was very good as well. My only complaint would be that the entree took a little longer to come to the table, especially since the restaurant did not have many customers at the time.  Overall, it was good. I would go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nzxGuaQixh9CYxk4BjRC7A"
  },
  "pCTgvSrVEl85djYMLSCe7w": {
    "date": "4/3/2019",
    "text": "My family and I absolutely love this place! Amazing food and fantastic fast service! They have something for everyone and it's always a nice experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zQgATLON4JSeVytL_ySt_Q"
  },
  "r6V-407b7OBRUl9hZGD76Q": {
    "date": "7/20/2019",
    "text": "This place seriously needs to clean their menus (either that or someone tried cleaning that was salsa).  The good:  The cheese dip was delicious. A good size, too.   The food was okay, nothing to write home about.  The bad:  The food was cold when brought out. My steak was burnt, but I powered through it anyway and it actually wasn't too bad.  The waitress took forever (and it wasn't even that crowded, several staffers just sitting around).  The dessert menu didn't have prices (and the waitress didn't even know).  The beans literally tasted like canned black beans you buy for $1 at giant eagle.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LunuH7AD6gwJ0rgLzqmkmg",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Fried Iced Cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LunuH7AD6gwJ0rgLzqmkmg/o.jpg"
      }
    ],
    "user_id": "OXc3IHk-5vEQ-tjHASRfOw"
  },
  "U1dKctnzKn4k0BSw75Z5Iw": {
    "date": "4/1/2019",
    "text": "Not recommended. We used to come occasionally in the past, but at our most recent visit we realized the menu changed, taking off our favorite items. The salsa tasted exactly like jarred marinara sauce. The table side guacamole was okay, but we asked for spicy and got very little to no spice. We also ordered the OMG nachos, expecting a pretty good portion for $11.50. Instead, 9 Tostitos Crispy Round chips piled up with a couple of things. Each \"nacho\" was priced over a $1! We were quite disappointed.   Summary: not great service, way to expensive for sub-par food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TB9alcTqg0DKPDap4wVx9g",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. OMG nachos (8/9)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TB9alcTqg0DKPDap4wVx9g/o.jpg"
      }
    ],
    "user_id": "qIn0v5aSXWo9rHMSE8z8AA"
  },
  "zoPO54EEevIPFCZzUkoZlA": {
    "date": "3/27/2019",
    "text": "Dry rice. Tortillas like they were made hours ago. Bottled salsa. Returned an entree and was recommended hard shell tacos that did not fill me up.  Bartender was missing (was sitting at the bar) . Experienced sucked.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ycgWp1Rh04mTXdiakASjVQ"
  },
  "YsNidztEZknsID1thHQu_Q": {
    "date": "8/4/2019",
    "text": "I love when Mexican restaurants start out with chips and salsa at the table!  The salsa was a great restaurant style salsa.  There were a lot of margarita options but they had an odd taste, which was hard to place.  I got the build your own combo with one hard corn and one soft flour tortilla taco shells with shredded chicken.  The tacos were great but not much on the taco other than the filling, lettuce, and cheese.  I swapped out the beans and rice for more lettuce and guacamole because the table side guacamole looked so good!  My fellow luncher had a taco salad, which was quite soupy.  Also, the floors were very slippery but the overall ambience was good for lunch.  Everything was very filling and overall ok to return again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fS1HfJOKHziAJp5LG67Zgw",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Shredded chicken tacos - one hard and one soft tortilla",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fS1HfJOKHziAJp5LG67Zgw/o.jpg"
      },
      {
        "img_id": "ZSppSC7CxmoikjO0vNf0sw",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. House and pomegranate margaritas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZSppSC7CxmoikjO0vNf0sw/o.jpg"
      }
    ],
    "user_id": "_EPzTjxyIths4TOsMogalg"
  },
  "2vUH4Vkl9J_B7KDM_WeO0g": {
    "date": "8/25/2019",
    "text": "This used to be one of my favorite restaurants. It's seems that they are going a bit downhill lately.  I've eaten there twice in the last month.  The service has gotten to be very slow.  This is during times when they don't seem busy.  The food quality has suffered too.  Portion size has decreased.  Presentation isn't as nice. I ordered the Carne Asada, the beef was horrible.  I was served an over cooked, leathery, fatty piece of \"sirloin\".  I'm very disappointed.  I really hope that they change things up and go back to the great restaurant that they used to be.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uAjINzkF4Ss_GA5vx2xQkg"
  },
  "PX_K6huh9sv9RZ3VCMYFbA": {
    "date": "5/22/2018",
    "text": "I've been here twice and the experiences were completely different from each other. I usually look for non-chain restaurants and Plaza Azteca is one of the few non-chain options in the Robinson area. The first time, I stopped in on a Saturday night after a day of shopping and it was a great experience. The restaurant was packed, service was good, and my pastor tacos were delicious. My second time, I stopped in during Sunday lunch. This time, the service was oh so slow, despite having a nearly empty dining room. Our waiter was miserable. However, my steak fajitas were pretty good.   My reason for a four star rating is mostly for the decent food. For all other aspects, a three star rating would be more accurate based on my experiences. For it being one of the few non-chain restaurants in the area, I will most likely visit again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 5
    },
    "photos": [],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "sY-X_EAWlSnNN3ndOySPyw": {
    "date": "1/7/2019",
    "text": "Let me start by saying that I grew up frequently visiting various parts of Texas enjoying fine Tex-mex and Mexican foods.  I had high hopes for Azteca based on what I had heard. I went in with the same expectations that I have with any Pittsburgh Mexican restaurant. \"There's no way it can compare to Texas.\"  We were seated promptly. It's a Monday night, no surprise there. We are one of the few couples seated on this side of the restaurant. We are brought chips and salsa and our drink order taken.  First, the chips are thin and fantastic. They do seriously lack salt however they are likely one of the best chips I've had in Pittsburgh. The salsa was rather average. Based on the chips and the \"table side\" guacamole I was getting a little excited as I browsed the menu.   We ordered the table side guacamole. True to form the avocado was halved and cut right there. The server asked our spice level and preferences on cilantro, lime, tomato, and onion. The guacamole being fresh was rather solid. It was under seasoned and everything but the avocado was prepared beforehand.  Then we get to the meal. Combo Fajitas with flour tortillas and a combo meal of two beef tacos in a corn tortilla with rice and beans.  The rice was dry. The meat was under seasoned and greasy. The tortillas were literally from the grocery store.  It amazes me anytime a Mexican restaurant serves anything but homemade tortillas. In Texas, everywhere you go, even \"fast casual\" restaurants have a form of fresh tortillas. There's a huge difference.  Overall it's an average Mexican restaurant in Pittsburgh. I give them points for the chips and guacamole.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8LUc2Zlqy56Trr8OV2HkGA",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8LUc2Zlqy56Trr8OV2HkGA/o.jpg"
      },
      {
        "img_id": "VbZ_e9dCtZ8nqEN4TfmAoQ",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VbZ_e9dCtZ8nqEN4TfmAoQ/o.jpg"
      }
    ],
    "user_id": "V1EPjABOPbtxUntripH2bA"
  },
  "VPCLsFXw3THYyuZtrlaAMQ": {
    "date": "5/26/2018",
    "text": "This restaurant was within walking distance from my hotel. You can't beat that! The decor is nice and people are friendly. Nothing that says WOW but friendly.   I was seated right away but waited a while for water and a server. I ordered a vegetarian option that included a cheese enchilada, bean burrito, and a mushroom quesadilla. The food was yummy! If it was hotter, I would have given 4 stars!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P5YUWkBLPlO8jqZJxpy5ag",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Mushroom Quesadilla- order this!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P5YUWkBLPlO8jqZJxpy5ag/o.jpg"
      },
      {
        "img_id": "v3vT9poy3pCa6n7y5TpuFQ",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Bean Burrito and Cheese Enchilada",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v3vT9poy3pCa6n7y5TpuFQ/o.jpg"
      }
    ],
    "user_id": "DpkYPnW-TvDOuYAyArm5pw"
  },
  "SF-aNP7Urp9mmy-hG2nhQQ": {
    "date": "3/21/2018",
    "text": "B and I visited Plaza Azteca last fall while exploring the Pittsburgh area. This place was so good! A random stop turned into an amazing dinner!  We started our meal with a couple of  margaritas. They were great! Really tasty, and definitely strong. They were not lacking in tequila!   Since we hadn't been to the restaurant before when we ordered we asked our server how large the entrees were. This was our only issue, as he told us they weren't large enough to share, and they definitely would have been. All this meant was that we ended up with lots of extra food, since we both ordered an entree. This would be great if you live in the area and can take it home with you, but as we were only visiting we had a lot of wasted deliciousness left over at the end of our meal.   We started with Cheese Dip. You can't really go wrong with cheese and chips, and it was wonderful. We both ordered the Chicken Fried Rice, which sounds like an Asian dish, but was actually grilled chicken over a bed of Mexican rice smothered in queso. It was awesome! And one order is definitely enough to share. We shared an order of refried beans and flour tortillas. Everything was served hot and fresh and the service was fast and friendly.  If you're in the area and looking for a lunch or dinner spot I think Plaza Azteca is excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "pgxart9p71LvZQ_W8EJc2A"
  },
  "Eb6nBpoIqU6J5jeGpFLmGw": {
    "date": "7/21/2019",
    "text": "It's been many years since I've been here. I decided to get takeout. This place is VERY over priced for what they give you. I don't remember this place being that expensive and they used to give you better portions. The food was very good it's just pricing vs the amount you get. Decided to get the build your own combo. The quesadilla is more like a slightly larger taco. The price they charge for beans and rice is ridiculous for the amount you actually get. I've got side of rice and beans and it was triple the amount for the exact same price at other restaurants. The taquitos the ends were so burnt and then the meat was actually burnt to a crisp towards the ends. 10.00 for guacamole and you don't even get that much. Very disappointing!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CqBrxPACu1fP5bk5vA6jVQ"
  },
  "pgNRQl_yb7eQdfgxNetjzQ": {
    "date": "7/25/2019",
    "text": "This place used to be a favorite of mine, as well as my boyfriend. Over the past few years it has only declined. They have significantly raised their prices and the food is no longer up to par as far as quality goes. The staff is unprofessional and the kitchen staff are incompetent. Super sad to see such an awesome spot go down the tubes. We've kept giving the place chances, but after our most recent experience, we won't be coming back. RIP Plaza",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x5fsdq-vdr1Otcc8ylj10Q"
  },
  "pcIEBg2KqBeoOJIM4Qn-zg": {
    "date": "3/15/2018",
    "text": "Not terrible, but nothing to wait in line for.   I was recommended this place by a co-worker who said the food was amazing. The reviews on Yelp were so-so but I figured I'd give them a shot.   The service was fine. The food took a while to come out but they were super busy so I get it.  I got a margarita and I wasn't super impressed. That's probably my fault though since I got a flavored version which overpowered it. If there was less syrup it'd be much better.   We ordered queso with our free chips which I would've enjoyed more if the chips didn't have a stale texture.   My boyfriend got three enchiladas. One was ground  beef, one was steak, and one cheese. The cheese one just had queso in it which I thought was odd. For some reason I imagined it would have shredded cheese in it.   I got the burrito mex and it was decent. The chicken was pretty dry and not super flavored but it was satisfying.   I don't think we will be back because there are much better places in Pittsburgh like Mad Mex, Condado, etc.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZoaQYJZ7hA5gUwXXe9oS8g",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZoaQYJZ7hA5gUwXXe9oS8g/o.jpg"
      },
      {
        "img_id": "VWiHXR0Xkh-E0san3Zgtnw",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VWiHXR0Xkh-E0san3Zgtnw/o.jpg"
      },
      {
        "img_id": "5uymiZDukSPwzg2t3iclzw",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5uymiZDukSPwzg2t3iclzw/o.jpg"
      }
    ],
    "user_id": "dTMhVGbU-BGpnCDmikhgfA"
  },
  "z5isq8g4y4Hy_G76E7-ucw": {
    "date": "1/12/2019",
    "text": "Well this appeared to be a rather decent establishment . And if you're looking for a taste of Mexican style cuisine, this place is for you. Lots of places with different cases of ethnic foods . But this is just one to DEFINITELY check into .",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vDgsrkqpv9KtQndt0c8W1A",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Well I love Mexican food and twas a wonderful thing that my friends brought me out for my birthday  !",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vDgsrkqpv9KtQndt0c8W1A/o.jpg"
      },
      {
        "img_id": "_vEj96s_j6jT2CXwW1pRYg",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. OH ! Think someone&amp;#39;s coming  ! HIDE !!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_vEj96s_j6jT2CXwW1pRYg/o.jpg"
      },
      {
        "img_id": "9Qzt4Cpd-SX9KuwPXu4pkw",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9Qzt4Cpd-SX9KuwPXu4pkw/o.jpg"
      }
    ],
    "user_id": "qjD9SpQHHStpRGpM7sBHbQ"
  },
  "dEDZPsCvMdtzA0AkQzhUwQ": {
    "date": "12/28/2017",
    "text": "We were doing some shopping in the Robinson area, craving Mexican for lunch and stumbled on this place.  We were pleasantly surprised!  The complimentary chips and salsa are great.  Chips are warm and the salsa was deliciously spicy!   For lunch, I ordered one of the combos, burrito, taco and rice with shredded chicken.  Portion was huge for lunch, chicken was very good and the red sauce on the burrito was great.  My partner ordered the burrito San Jose (chicken and chorizo) and subbed with the shredded chicken for grilled chicken.  This was good, but a bit salty for our taste.  It could have been our fault by subbing the shredded chicken plus chorizo which is naturally salty.  Again huge portion!   We did not experience the service issues others did.  Service was speedy and our drinks and chips/salsa were always filled.  Would definitely come out here again, better than patron, on par with the Emiliano's down the street from us in the city.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wAmvlnpKmCZfUmPSQaGUNw",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wAmvlnpKmCZfUmPSQaGUNw/o.jpg"
      }
    ],
    "user_id": "cAvlJ-lvBywOjcG1FTC_7A"
  },
  "uIBtiO9fWBtNmrgqlpmbcg": {
    "date": "7/2/2019",
    "text": "I received food poisoning from here last week. I ordered nachos and a burrito. Was up all night will horrible stomach pains.  Do not eat here",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5FzeWztrjf1sORJNeBNIXw"
  },
  "pr3dND0jRjIW19XZYjIEPA": {
    "date": "12/7/2018",
    "text": "This place is pretty excellent! Food and atmosphere really great and customer focused. You HAVE to get the table side guacamole.  I took a star away because the wait is too long typically. But I still recommend it , just plan more time than usual for a Mexican spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7DqeBTqaOVv_LSA99a-7wg"
  },
  "cdkc_wpqcHjcAY6TVI9MnQ": {
    "date": "6/14/2018",
    "text": "This place is kind of inconsistent. I've never had to wait for a table despite the place always seeming pretty busy. The service is extremely variable, sometimes it is great and sometimes it's pretty bad. Their frozen margaritas are really good, almost like a \"liquid ice\" consistency which I think is the best as far as margaritas go. Their chips and salsa are really good (and free!). The food is really good at times and sometimes just pretty average, I usually get the same thing every time I go there (chicken chimichangas). I do like this place and as far as all the options go out in Robinson (chain restaurants galore, blah), I think it's worth trying though hopefully you catch them on a good day.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xAD3WCiOpKyfIuZ1-L0aGA",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Chicken chimichangas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xAD3WCiOpKyfIuZ1-L0aGA/o.jpg"
      }
    ],
    "user_id": "0KhRPd66BZGHCtsb9mGh_g"
  },
  "f--WaGvxh8F_YzLsihBVIw": {
    "date": "11/12/2018",
    "text": "I've been driving past this place for 4 years. Finally stopped from a busy day of shopping and went to lunch here. Kicking myself for not doing this sooner. It was wonderful! The homemade guacamole cart made at our table was the best since we were in Cancun.  I had taquitos. The presentation was lovely. Everything was fresh. The meat was tender and good quality. White meat chicken. Shredded beef was not fatty. Fresh pico. We were all very please with our meals. We will be back again soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sd_pK8Ga4Q4TEXRWG4ZAmQ",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. What Mexican restaurant would be complete without chips and salsa when you sit down?",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sd_pK8Ga4Q4TEXRWG4ZAmQ/o.jpg"
      },
      {
        "img_id": "xXUGEsHuwy1kL2IAxnEi9g",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xXUGEsHuwy1kL2IAxnEi9g/o.jpg"
      },
      {
        "img_id": "OrvFgvY0nDqyBC3TrAPrvA",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Enchiladas chipotle",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OrvFgvY0nDqyBC3TrAPrvA/o.jpg"
      }
    ],
    "user_id": "zbDxorDLlftt4N1YvJdxfA"
  },
  "r2ZqAskQGk88YFhVIzlOFw": {
    "date": "11/19/2018",
    "text": "Tonight was my second visit here and it was awful. I came here with my two friends who were visiting the burgh for the first time. They love Mexican food. And the food here tasted like leftovers from the afternoon.  We ordered combos and the enchiladas had the chicken inside cold and hard. The plate was warm but looks like the food was not cooked. They seemed to be in a hurry. Never ever coming back here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qu4wLhmt9iZlQCRI-XRNbw"
  },
  "CnuUlO0FTBiUzsv6KcnAMw": {
    "date": "6/29/2014",
    "text": "Good service, excellent food. Some of the best Mexican Rice I have had ever! Refried beans also excellent. Very friendly, nice atmosphere, good food, good prices, what more can you ask.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "625ddPE_2vp6m6jsFyQ8EQ"
  },
  "NqjAAU-1iCuhOAR-O6EfmA": {
    "date": "11/14/2014",
    "text": "Excellent Mexican food. Delicious. Nice ambience. Clean and simple decor. The best in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_r0rdLOL01YFKtzL3mVbzg"
  },
  "RE3cpFZEyQ9MrAHKyrOjAQ": {
    "date": "6/11/2016",
    "text": "5 stars all the way, amazing atmosphere amazing food, great service, phenomenal drinks OMG loved everything",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YWCk-TxeMny36sCIJbstTg"
  },
  "TdBychbDic1UcNdscVUzug": {
    "date": "11/16/2014",
    "text": "The food is good!!! Service is horrible!!!! After you get your food. Its like you don't even exist. We had 3 different waiters. I asked for some plates for the salsa and extra lemons for water, and they forgot. I waited 20 minutes, and nobody came to pick up my check. So, I went to the front were the hostess is to pay. Thats when one of the waiters came up in his undershirt, i guess he was on break, but uniform shirt was not on. Thats why I gave it 3 stars. Good for picking food up to take home with you, but not for dining in.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SeWLddwE5dnMcUqjG1JmiQ"
  },
  "itUJnBcOC7aCF8WkRt6Tyw": {
    "date": "7/12/2016",
    "text": "My wife and I went here today for lunch. It was our first time and it will be our favorite Mexican place from now on.  Fast friendly service and tasty food. The prices were fair.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gr3vSTuuTJYWeLCFFEH9AQ"
  },
  "UgyFm4rcCo8-IS1tkrGMhA": {
    "date": "6/28/2014",
    "text": "Delicious food: fresh tortillas made right there in middle of restaurant. Great prices !! Super sweet staff and awesome service !! We were very pleased with the whole experience !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bIYloexBNWqfdqogPkj6LA"
  },
  "CxSrbDikPHi0cDRaEaFlbA": {
    "date": "5/12/2014",
    "text": "You must order the tableside guacamole.  Amazing!  And the Spanish rice that is on the side of several items is so fluffy and good.  This restaurant is very close to Costco and Robinson Town Centre, so if you are out this way shopping, it is definitely worth a try.  Service was really good as well.  Very kid friendly too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-w97ixdca92JmfcSot7FOQ"
  },
  "kShxxNtjZIUspc2a5IGriw": {
    "date": "2/18/2015",
    "text": "Wasn't the worst, but it wasn't the best for sure.  The portions aren't as much as I've had before at other places, but it's decent sized.  As far as taste goes, eh...As long as you have sauce at the table you're fine I guess, but I'd go elsewhere next time.  Location is prime where I'm at, the service was definitely good, but the food just didn't hit the spot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jOEv6hJfc64gov0gG-wnUg"
  },
  "Fl3pzFsZ0MYdT4EMkNYAiw": {
    "date": "10/25/2015",
    "text": "First time there, never going back. Hands down the worst Mexican food I've ever had. We walked in and there was no one there at the desk. We wandered through the restaurant to confirm they were open at which point we got seated. (every employee we saw was tucked away in a different corner of a room with their noses buried in their cell phones) I ordered the chicken chimichanga with rice and refried beans and my spouse ordered the arroz con pollo. Where do I begin? The chips and salsa came out quickly and the chips were good but could have been out of a bag. The salsa was awful. It had so much oregano in it that it was like dipping in spaghetti sauce instead of salsa. There was no cilantro present, it was like they used oregano instead of cilantro. Luckily we didn't have much time to eat the chips and salsa as our food somehow miraculously came out literally five minutes after we ordered it. This seems like an impossibility to me unless of course  it was already prepared and sitting in a bin under a heat lamp or in a chaffing dish in the kitchen, which is where I'm putting my money. My chimichanga was somewhere in size between a large sharpie magic marker and a cardboard paper towel tube.  It was not fried like a chimichanga is supposed to be. The rice, refried beans and chimichanga were all completely bland and flavorless. How do you even get bland and flavorless food to happen in a Mexican restaurant? I was still hungry when I left it was so small. My spouse's arroz con pollo is supposed to be made with thigh and leg meat over rice. His dish was made with tiny chopped up chunks of breast meat instead and also lacked any flavor or spice. We had to get up and again hunt someone down to get our drinks refilled. Bottom line is we would have had better food and experience for less money if we'd bought something in the freezer section of Giant Eagle and ate at home. Never again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YD56o1h40GhF4L2vgRU5lg"
  },
  "w9ZqF0rtujA0uKkbjOCRrA": {
    "date": "7/14/2015",
    "text": "We first at here July 5th. Had I written a review after that visit they would have earned five stars. The meal was flawless. Tonight (July 14th) we tried them again and it was a totally different experience. Two thirds of my entree was actually cold, like right out of the refrigerator cold. The plate was too hot to touch, but most of the food was cold. I complained - actually what I asked was to have it reheated. The waiter honestly did not seem to be able to comprehend what I was asking. He took my meal back into the kitchen. The manager came over and actually began to argue with me over whether my food was actually cold. He insisted that it was only room temperature. Pardon me, but that is unacceptable. Food should not be room temperature out of a holding bin and a manager should never argue with a customer, especially over a clear health code violation. He left and I wondered if they were going to reheat mine, bring me a new one or forget the whole thing.   The waiter came back and asked if I wanted my check. When it arrived they had reduced the cost of the one entree by about 50%. Normally I would have had another talk with the manager, but he seemed so clueless that another attempt would have been futile. There are many better Mexican restaurants in the Pittsburgh area. Hopefully a better one will take its place after this one closes. What is a shame is that our first experience there was so good. It shows they are capable of being a great restaurant. I doubt if I ever would give them another chance. I should mention that on our first visit the salsa was great. Good flavor, nice mix of spices with just the right amount of heat. On our second visit it tasted like tomato sauce right out of the can.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3GLZbeJIOIhoZvjeziRv6A"
  },
  "LMbE5qSkv9HWEXDkDruCJA": {
    "date": "11/21/2014",
    "text": "A tad pricey but the food was really good. I have a feeling they won't make it. just a bit expensive for what you get. mad men is still a better bet.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hjo_jYTGOTFoUOLjkFdPgg"
  },
  "MCW6S-B5vQZkTC2S6T3KEQ": {
    "date": "10/3/2015",
    "text": "Good food. Interesting variations on classics, like shrimp potato enchiladas. Bright and festive in weekend nights. Good for families and groups.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5HKItRQ_Qkw5q_CECGhyVQ"
  },
  "gjYR34NVOqzpFZ8YAGRmrg": {
    "date": "1/19/2016",
    "text": "After several visits (6+) can say Plaza Azteca is consistently good. Have enjoyed the table side guac and a variety of traditional dishes. I'm a Mexican food lover who thinks Azteca gets it right and is a better taste experience by far than either El Campesino or Mad Mex. Also want to add I've never experienced a problem with the pace of service. The menu is extensive, contrary to overly critical posts.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lx4qae4sfIovjT-MT57Axg"
  },
  "1pcJ2y-I1--bFnL2Kwzbyw": {
    "date": "11/13/2014",
    "text": "Had dinner there with my wife.  She had Brochetta Brava (beef tips).  I watched her trying to cut it.  It was a rubbery un-chewable mess.  We sent it back to be cooked some more.  It improved slightly.  Flavor was OK but too tough to eat.  I would have been embarrassed to serve this to quest.  I had the Steak Azteca.  It was listed on the menu as a NY Strip.  It tasted good but did not look like a NY strip steak.  It was something that had been run through a tenderizing machine to make it, well, tender.  It was $16.99 so maybe I should not have expected the kind of NY strip I am used to seeing on a plate.  When I ordered I asked the waiter about another item on the menu as I wanted to know what the sauce was like.  He proceeded to tell me about pico de guillo.  That was something else that came with the dish but was not what I asked him.  I tried again but realized that he had no idea so was just telling me what he did know and was averting my question.  His English was just passable enough to get the job done.  The staff appeared to be mostly Mexican.  It gave some authenticity to the place but at least with our waiter, did not help with our service.  He seemed more interested in getting back to talking with his buddies in Spanish than giving us any kind of service beyond the bare minimum.  It was memorable.  Note to self: Go somewhere else next time we want to eat Mexican.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "C5kl-fQYEcN7jpjVU83v2Q"
  },
  "kRrENpHqWyX1uh6Uoken0Q": {
    "date": "5/31/2014",
    "text": "I'm not a Mexican Food Aficionado-   however the service was friendly and fast and food was hot and plentiful. Side bar of special guacamole was asked for spicy, but was not.  I told coworkers and they went and were more experienced in Mexican food and they said it was the best they've had in a long time. They'd know that more than me on that note. I would recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oEAOgI7vslCMnp_FW7wMVg"
  },
  "6ahhN6NTawRIBOgVnyO0KQ": {
    "date": "7/23/2014",
    "text": "Ok, so my wife and I went to this restaurant this past weekend,  Absolutely horrible!  Service was ridiculous.  Waited long for our food.  Rude management and server.  Had to ask multiple times for items, drinks, etc.  Will not return - ever!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Zvas1ezVq-NDRESG3IxcYg"
  },
  "Z6l6DVHFgB1Ni4-hLt4BwQ": {
    "date": "11/6/2015",
    "text": "This place is gross the food was bland and not a lot of it for the price. Guacamole was nasty. My daughter makes a better guacamole. Would never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1s3O5T4_iKkPfka4dNn_4g"
  },
  "Z1QY31QxG4BYMDSH_dQC3A": {
    "date": "10/25/2015",
    "text": "I'm another reviewer surprised by the low stars. Atmosphere was nice and low stress. Server was friendly and courteous. Salsa and chips were awesome. Margaritas were delicious and not shy on the liquor! Fiance and I had 2 different enchilada dishes - so we had a variety with different sauces. We were very pleased with everything we tasted! We will definitely be returning!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yTii4xepVgNsl_j07XTwzQ"
  },
  "2kpxWqGbboIaaK47jAYXyA": {
    "date": "5/11/2015",
    "text": "The service was horrible. The chips and salsa were nothing special. I ordered the Azteca salad for lunch and it was the first time in my life that I had to request additional lettuce for a salad. I'm not sure why but, they served me VERY little shredded lettuce, and a TON of shredded red cabbage instead. Cabbage wasn't even listed as one of the ingredients in the Azteca salad. I also didn't receive any avocado in my salad, which was an ingredient listed on the menu. When I requested additional lettuce and avocado, the waiter seemed rather put out. My dining partner also ordered a salad, and did not receive what was listed on the menu either. There seemed to be a lot of confusion as to what kind of salad dressing that they had as well, though this could have been due to the language barrier. The salads, for lunch, were $12 dollars each, and not only were they lacking listed menu items but, they were rather skimpy in nature. We discussed this with our waiter and he pretty much said there was nothing that he could do about it. After paying, we asked to see the manager to express our disappointment. He offered us no apologies and did not give us any reason to come back. He didn't seem to care if we did or not. With that kind of customer service, we definitely won't be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OSkfGPf8J1wtAL7rvSZRaQ"
  },
  "R-Pgjsc6w78qprLAqLmDpw": {
    "date": "12/22/2014",
    "text": "Was here once when they first opened and was impressed by the food. I'm a huge fan of fajitas and ordered the steak and chicken ones. They were fantastic! The cheese and charizo wasn't as good as some of the others I've had.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hb4hhtEzrHcV7Y2xAkqUYw"
  },
  "M_8wu0DSzXjv7AgxAT0THA": {
    "date": "4/15/2016",
    "text": "This place has the worst service and very very overpriced.  Will never go back here again.   The waiter thought it was a bother when I asked for more salsa, asked once,  didn't receive, asked again and was told \"in a minute\" in a rude fashion.   My friend ordered a margarita and it was awful.  It tasted like cheap tequila was poured into a already poor quality mix and not blended correctly.  When she complained, the manager  told her to pay three dollars more and get a better drink, which she refused and said \" um  no thanks\".  This manager was also very rude to me.  I again asked for more salsa for my chips, ( I use salsa on my dinner and always keep one for me and one for my friend.), well the manager looked on the table and saw the small cup that my friend had and said to me \"um there is some on the table\".  Really? Guess salsa is a big deal there.      Finally onto my dinner.   Paid $10.50 for the number 11 combo.  One burrito, one enchilada, and one taco.  What a rip off.  The portions were so small.   I am so over this place. I will never return.   From The waiter to management to the food.  Horrible.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "GIGQkLFJ0H9npyyvNuSh3Q"
  },
  "jnshDjFL1L15mXTMtmxIKQ": {
    "date": "10/21/2014",
    "text": "My friend and I came to this restaurant with our kids for dinner. She got a booster seat for her kid, I asked for a high chair for mine. The first chair they offered me had one string broken but the girl that sat us replaced it right away; the second chair had a different string broken so I decided to keep it after I joked that maybe they were all broken, the girl walked away almost compliant to my comment.  I kept an eye on my baby but soon after I had to hold her on my lap, she was wiggling around in that high chair way too much.   I ordered \"Sonora\" from the vegetarian section: a bean burrito drizzled with (very salty and average tasting) cheese sauce, a quesadilla and a cheese enchilada. A meticulous presentation but there wasn't any rice and beans or any other side to accompany my meal. Needless to say, it was not satisfying.   My friends salad looked small to me, too.  To add to my excitement, a server breaks a glass next me. It smelled like rum and it was all over my leg. One of the servers apologized but did very little to clean it up, I later found broken glass in one of my shoes.   The restaurant has been decorated beautifully but they need to train their servers a little better. They all seem to walk around like zombies; they spoke low, they did the bare minimum to help. I was not impressed.   Dang I miss Taco Loco!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "y-OW396z2nqGyyklOLnVjw"
  },
  "72LL7LDXcfV0pVss_l9H5g": {
    "date": "8/3/2016",
    "text": "I'd stay away from the combo menu. Apparently the combo \"burritos\" are different then regular burritos, in that they are just enchiladas with a different color sauce. Beside that, the combo menu is just a disorganized magical list of certain groups of 3 items you can order, and for some inexplicable reason, you're not allowed to make any substitutions, even though you can't hardly tell them apart once they arrive on your plate, anyway. The chorizo sliders weren't very flavorful. The desserts are good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cUfRUTR4Yeaxyy9yQGBJ3Q"
  },
  "xpQy2mwiBmvSgt_zZrbQKg": {
    "date": "5/17/2016",
    "text": "I came for a quick bite before an appointment. Their lunch specials seemed like a good deal- $8 for a basic entree. I ordered the chicken enchilada and chicken burrito. It came with chips and salsa. The chips were cold and greasy. Salsa was watery but had a little zing. The meal was small, but I guess it was a lunch portion. Though honestly the burrito was the tiniest burrito ever. I was literally confused which was the burrito or the enchilada. They were actually filled with the same stuff too. Weird. Only difference was the tortilla (flour versus corn). The flavor was just ok. Overall I wasn't impressed. I've had better food at King Taco. Quick note on the service: typical for a suburban chain kinda place. Neither friendly nor committed but gets the job done.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "84spE2TAH0FhoRw1JEelVw"
  },
  "qUT1CpP2Mk5hSA_szTWlsg": {
    "date": "9/28/2015",
    "text": "Went here on a Local Flavor certificate with my wife on date nite...     The ambience and decor was quite nice.  We were seated promptly and the waiter named Jesus was polite and courteous.    We viewed the menu online prior to arriving, and my wife eyed up the Pina Loka.    That's what she ordered, and was not disappointed.  I ordered shrimp and chicken fajitas... Also not disappointed    They food was incredible.  We both agreed it was the best Mexican restaurant we'd visited in some time, and we will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fT0KNWzDjn6UK0Qdk8CQww"
  },
  "7PiK0RrlGG-ceDA52T1BXQ": {
    "date": "9/10/2017",
    "text": "Easiest Mexican menu I've seen with lots of good looking items we haven't seen on other menus. I had the fish taco and they were very good the fish was grilled perfectly as was the sauce and slaw on them, my wife had the seafood chimmi's and really liked them. She got one fried and one soft and preferred the soft and really liked the sauce. We had the tableside guacamole a bit expensive at $9 but it was a nice touch having it made in front of you as opposed to a bowl being brought out from the kitchen. I thought the staff was friendly and very courteous and the price was about what I expected. We will definitely being going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7taFT1LpO3yuLhFJToXCgQ"
  },
  "2T2JyQyhyN7p8hMsurbGTA": {
    "date": "3/13/2015",
    "text": "When it comes to a Mexican-style fare, it has been difficult for me to find a non-cookie-cutter establishment in the Robinson region. I stumbled upon this South American inspired eatery that would have made the Inca empire proud. Their portions are generous and there drinks are tall. You will find a prompt and friendly greeting upon entering, and more often then not, will be ushered straight to your seating area. The servers are friendly, fast and knowledgeable. The dining hall is very large, so even when it is busy, you will find the experience and intimate one.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ew2ETPj2CsWJwtzGfweI7Q"
  },
  "uKoSdU4hRyYQiayuXryDFQ": {
    "date": "6/17/2014",
    "text": "Up until now I felt I could live on Mexican food.    We were doomed from the start. The place was empty and yet the host was panicking about seating us.    After we sat down my girlfriend and I ordered 2 cokes. Her glass was full of ice, mine had none. I wanted to leave but the girlfriend wanted to stay.    We ordered queso sauce. Had enough salt in it to stop my heart.    We ordered our meals. They brought me some sort of burrito that I did not order. The waitress said it was what I ordered. Who am I to argue? ;) There was no beans or rice with it.    I took one bite, even though the grease was floating on top of the cheese sauce on top of it. It was the most disgusting thing I ever tasted.    I sent it back and had lost my appetite. The manager came over and offered to bring something else. I refused and just asked for the check. Lucky me, the charged me for it!    At this point I just wanted distance from this place. I paid the check and have made it my life's work to tell everyone I come in contact with about how bad this place is.       Ordered",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jk9YVOSd8NNUHPycjFnHNw"
  },
  "fG1x5YQfc34t3mSJez1SRw": {
    "date": "11/9/2017",
    "text": "I took my sister to Plaza Azteca for her birthday Saturday 11/5/17. It was 3pm in the afternoon so the restaurant was not busy at all. I have dined there before several times since it's opening a few years ago with family and friends. The only past complaint would be slow service.  This particular visit was the worst and I will not return.   As soon as we were seated by the host, the waiter approached us wanting to take our food order!  We just sat down and did not even have our menus open yet! He then asked if we want an appetizer also! WOW! We did give him a drink order at this time. He returned with drinks and we told him we are ready to give him our food order. When we told him our appetizer choice, he then literally interrupted us from ordering and stated he will get the appetizer in and walked right away from us. WOW again!  After a short time, he did return to take the rest of  our food order. Not a smooth process just to order! The appetizer of shrimp nachos was good, but not worth $15. With the food now at the table, we began a constant stream of little FLIES flying over our food! Not sure if they were fruit flies or what the bugs were...they were not normal flies. Thus, begun the process of 'shooing' flies away...that lasted through our entire meal! It is NOVEMBER so not sure where these bugs are coming from! Then, the dinners arrive. My sister ordered a Fiesta Chicken salad with chicken added, NO chicken and it came with shrimp on it instead!  I wanted to tell the waiter it was wrong but she was fine with it as she likes shrimp, so we did not correct such. I had enchiladas.  They were good, but there were no beans or rice with them. Just enchiladas on a plate! We had to continue to wave away bugs through the entire meal!! We also had to listen to loud and rolling guacamole carts being banged around and travelling by our table at least 8-10 times during our meal; interrupting our conversation and ruining the atmosphere of the restaurant and our celebratory dinner!  So very disruptive, I felt like we were in an airport luggage claim area.    Sad... So, for a $50+ dinner visit it was very disappointing and I would not return anytime soon!  Bye Bye Plaza Azteca, I would make another choice for the next Mexican craving!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7warjaOKfjf-AE8f5VKWBg"
  },
  "RDKjZ0yqpDx3GQI1avwqMg": {
    "date": "9/23/2014",
    "text": "My girlfriend and I ate here last night, as I was interested from her first visit being a good one to her.  It looks like your, should I say, typical, well...Aztecan surroundings.  My girl said it looks like a Disney theme ride, but as a compliment...neat!  Our server, Samuel, was very friendly.  It looks like the whole staff is Mexican, and as his English was a little broken, he was easily understandable.  He was attentive and got everything right.  The bathrooms were clean, too, and that's always a good sign, as it tells how the kitchen probably is (most likely).  Now, for the food...DELICIOUS!  The complimentary chips were probably the best I've ever had, and I've eaten a ton of authentic Mexican restaurants' chips.  They were crunchy, not greasy, and flavorful.  The salsa was good and spicy, too.    We started with the Ahi? Tuna Tostadas.  I'd never, knowingly, eaten raw or seared fish, so I was skeptical, but my girlfriend assured me I'd like them.  They were awesome...much tastier than cooked tuna, not slimy at all, with a nice peppery crust, served on top of a big avocado slice, cheese (not sure what kind, it was white, tasted between mozz and feta), lettuce, and a slice of tomato, on top of a fresh tostada.  Everything tasted fresh and satisfying, and just right, portion-wise, for two people.  For our entrees, she got the Shrimp & Potato Enchiladas, and I got the Burrito San Jose.  Man, good stuff!  Her dish was huge (both of ours were pretty large), and mine was equally as delicious, with no flavors really overpowering each other.  I LOVED the crusty sausage in my burrito, and I don't know if it was Chorizo or what, but it was really tasty.  I finished my burrito, and my girl ended up taking almost 3/4 of her dinner home...WITH rice not even touched.  Great portions and quality for the money...HIGHLY RECOMMENDED!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ls-tOw2iwmz_P4n0Sl_7qw"
  },
  "IoAVlEjqI0F5FfqPA-T0cQ": {
    "date": "5/9/2014",
    "text": "Found out this is a smaller chain out of Virginia that was  started by two men from Jalisco.  Most of the staff seemed to be Mexican.  The bar will probably do well.   The Margarita's were good.  Mojitos on the drink menu along with beers and frozen drinks for those interested  The chips were warm and good.  The salsa was spicy.  The enchiladas Nortenas consisted of three corn tortillas, a chicken topped with spinach sauce,  one with potato and chorizo topped with cheese sauce, a cochinita pibil.   All the enchiladas and the meats were good.  Really enjoyed the chorizo.  However, the cheese on top was not my favorite.  Tasted like some of the less expensive cheese from the ball park",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 9,
      "cool": 5
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "HXUP5e9BXuaZayP3cCmBJg": {
    "date": "5/13/2014",
    "text": "This place used to be a Johnny Carino's.  The exterior and some parts of the interior are clearly from its formerly Italian restaurant past.  But, the inside has been pretty impressively remodeled into its current iteration as a Mexican restaurant.  I passed on the house margarita because the drink menu said it used the Island Oasis mixer.  Instead, I opted for the Ultimate Margarita with Don Julio Blanco and fresh lime juice, on the rocks.  It was really good and definitely worth the $6.99 price tag.    We also ordered the cheese dip ($4) and our kids went with the mac and cheese with fries and the other was the taco and enchilada.  The kids meal seems a bit steep at $5.99 and then I was reminded it included a drink.  So, not bad there.  For the grown up entrees, I ended up with the chicken and spinach enchiladas ($9.99) and my wife went with the tacos al pastor ($11.99).  I loved my entree.  The chicken was tender, corn tortillas tasty and the poblano pepper sauce was just great.  My wife's 3 tacos seemed a bit on the small side and didn't seem like a full entree - instead, it looked like a starter with an entree price tag.    Our bill was $48 before tip.  Service was attentive and we'll most likely be back.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "oF8Efb3fBrwWZvmsl6e-pw"
  },
  "i7GH5I1b9MjRoLU30DZMvg": {
    "date": "5/17/2014",
    "text": "Not everything here was bad.  The table-side guacamole was delicious as was the rest of the food.  Most everything else was not worth it.  My margarita was very tiny and not worth the $8.  The waitstaff was very slow and we sat and waited a lot from start to finish of our meal.  Not all of our food came at once and some items we ordered were out of stock.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5OlpqHmnLiqilAHJU6KMjQ",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Notice how small the $8 drink is compared to my normal sized straw.  It was closer to a double shot than a drink.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5OlpqHmnLiqilAHJU6KMjQ/o.jpg"
      }
    ],
    "user_id": "P_mdJ2F74kP3ruyq8fUuTg"
  },
  "MoZfMqjXRz__Srw4tm514Q": {
    "date": "6/24/2016",
    "text": "the best on town table side guacamole  margaritas  happy hour 4-7 sun - thr  desserts  pribed rooms for party meetings  etc   nice clean friendly staff",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T-UIPgkeXo_RAvhIAr2jAg"
  },
  "5DKJNb5ew3HzAokLJX9new": {
    "date": "3/16/2016",
    "text": "It was my favorite mexican food until today. I eat with my daughter there and the service was so bad to the point that I ate my dinner with out a drink because the waitress forgot to bring it back. With my order I ordered 2 orders more of tacos de carne asada y tacos al pastor. Inside the bag was so many hairs rapped around the containers of beans and inside the tacos al pastor my husband found a plastic tag holder that we cannot understand how it got inside the tacos!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2ml-asiNYNOPLciT04zhmA",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. This is the object inside of one of the tacos from Azteca Mexican food.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2ml-asiNYNOPLciT04zhmA/o.jpg"
      }
    ],
    "user_id": "ioHIXq_VGKGYhr6kujYiUg"
  },
  "mUUrZkNaogT5MocnALMBPA": {
    "date": "9/16/2016",
    "text": "We stopped for lunch n for the price of a burger joint you can have something off of the lunch menu with fast service. The food was flavorful n very good. The restaurant was clean with an awesome Aztec decor. We found our new Mexican restaurant in the Robinson area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "82ehC2i06WwVoHxDnk45MA"
  },
  "G3mNnNscHfbzWBmne8IeBA": {
    "date": "6/29/2017",
    "text": "Love the table side guacamole. Nice wait staff, fresh food. Prices are more than fair.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QAYy7tvYDLfTOrdrSf5htw"
  },
  "qtV4Cxuw3dEi2Ex4kP7daA": {
    "date": "5/13/2016",
    "text": "I eat here at least once a week!!! Absolutely great staff and food! They're so quick. Great spot for lunch too. Their lunch specials are around $7.29  dinners are reasonable too. They have great salsa they give you when you sit down. Coke products too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-m9VlH-YZ3DDTlelvaj9LQ"
  },
  "u09vJqazjz9s7_9yav2bCw": {
    "date": "6/24/2017",
    "text": "Server couldn't speak English well enough that 4 out of 6 meals were wrong. Most were cold. I like authentic but if you're in Pittsburgh you should understand what your customers are ordering.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X8lKpdXhFGq2PjFnJpXJlw"
  },
  "l5xOJPJ921yDmA6Kc5646A": {
    "date": "3/11/2018",
    "text": "I will start by saying my wife and I love Mexican food, however there are much better options around.  Giving this one star due to the guacamole being good, however the rest of the food (taco/enchilada combo and Burrito Mex) was not great.  Ultimately, the reason for the 1 star is due to the terrible service.  We went here on a Monday evening around 5:00 pm after looking at their menu online and seeing happy hour was 4-6.  Upon arrival there was no one at hostess stand to seat us for a good 5 minutes.  When seated, the waiter did not provide any information on current happy hour deals and/or refer us to a happy hour menu.  When we asked the waiter, he had no information and just said \"like a dollar off the margaritas\".  With that we ordered 2 small margaritas, not knowing the price, and they tasted a bit like chemical/cleaner.  When we got the bill, there was no happy hour discount on the drinks and they cost.  Overall this place has very sketchy management and pricing.  Would not recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1TNpWkfb5xkvCtSnLE_-dA"
  },
  "VwcK9d1Ig686SWuj-Rlh7w": {
    "date": "8/21/2016",
    "text": "I'm always looking for a good Mexican restaurant. This is one of the better ones in the area. While their salsa was a little on the sweet side for my taste, the chicken chimichanga (my go to entree when trying out a New Mexican restaurant) was delicious. The cheese sauce on it was the right amount of saltiness. The meat was flavored well and had some nice acidity to it. The sides of rice and beans were flavorful as well. I got the dinner entree with two burritos. It was a little small compared to what I'm generally accustomed.   The kid's cheese quesadilla was a little overpriced, IMO. It was just a regular sized flour tortilla with a small portion of rice for $6.   I plan on visiting again. They have a nice variety on the menu that I want to try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7kwfHRkiP_1u6NtxZt_fPw"
  },
  "4xjqGwCf1ASOrWT_DQ9jow": {
    "date": "1/29/2018",
    "text": "We went there with a group of friends for dinner Sunday night. We arrived around 7:45 PM and although they don't close until 9:30 PM we were given some 'surprised glances'. Our waiter was nice and courteous. We asked him if they had any specials on the drinks menu and he told us about the Margarita. We were a party of 9 and 6 of us ended up getting the margarita special. It turned out to be a bad decision to get it. Seemed like we were drinking the $2 margarita specials at a shady bar. Barely any alcohol in it and compensated with WAY too much syrup. Needless to say we didn't get a second round.  I would say the food was priced OK for what it was. It was nothing special though. Food you'd find at any other Mexican chain restaurant.  BTW....when the check arrived the Margaritas were $13 each (on special) LOL. This was the tipping point. Not returning again. Thank you very much!  I would recommend Emiliano's or Patron any day especially because they don't have a 'gotcha' drinks menu.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kZz6Kl5NZ3CPc8dAundiKA"
  },
  "yTp_VPimTr-b2R04wWH1_Q": {
    "date": "2/27/2017",
    "text": "Nice restaurant, good prices and very good service.  Would recommend to a friend for Mexican cuisine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rYyJqTc3wRILQmfIH6WWiQ"
  },
  "oejfs4dcNUwoDoPWOzlXnw": {
    "date": "4/10/2017",
    "text": "Everyone likes something different when it comes to Mexican food. In Robinson, right outside Crafton Borough (edge of city limits) this is the best place to go for Mexican in the Town Center (Robinson area). Plenty of Mexican restaurants in town but no one else serves the grail of Mexican food. (Seafood Chimichangas) These are a classic dish that not many Mexican restaurants serve. They make Guac at the table, good salsa, service, not that expensive and delicious tacos. This is a good date night spot or if ya wanna grab a bucket of coronas and wash that down with a steak burrito. Also, if you dare to try a desert, that's not too bad either.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "B3piSjG93U2zRxxXGFcvPQ"
  },
  "8lCTCxSqUEdK8V--8TikdQ": {
    "date": "6/10/2017",
    "text": "The food is good I'm from the south and have had a really hard time finding good Mexican food in the northern states so this is by far the best I've found in the north . There salsa could be spicer and less chunks but if you don't like spicy food and don't mind chunky salsa then you will love it ! The quesadillas are good but I would get steak not chicken because it's not fajita chicken it's shredded chicken juices and all so makes it very messy and hard to eat but the steak is good also the  queso is pretty good as well just small size so if you want a lot I'd suggest ordering two.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VlK8adzosCT8S_-hagc-ag",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Steak quesadilla",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VlK8adzosCT8S_-hagc-ag/o.jpg"
      },
      {
        "img_id": "QdGba_ID-EH_Iamq6U7TyQ",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States. Salsa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QdGba_ID-EH_Iamq6U7TyQ/o.jpg"
      }
    ],
    "user_id": "S-kW3i5XqprwUjyyQGFu2Q"
  },
  "6f7Tg5c-n-MMB-gc-orS7A": {
    "date": "1/30/2016",
    "text": "The new manager at Plaza Azteca sent me a message, asking me to give the restaurant another try.  We went back a few weeks later, and things were MUCH better.  Our waiter was attentive, the food was much better, and the whole experience was much closer to what I expect in this price range.  We got the guacamole, which was fantastic!    My wife and I didn't order any cocktails, so I can't comment on the strength of the drinks (I don't like when drinks are overly strong, but my wife couldn't even detect any alcohol in the massive drink she ordered the first time we visited).  If the other changes are any indication, I'd assume this issue was fixed as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mI9fK0uk7DXF5LC-Q_ItPw"
  },
  "xfETv9Bfn39LGuT-kmoTCg": {
    "date": "9/18/2017",
    "text": "This place has the worst service I've ever encountered. When you need to ask for water and to order- there's a problem. Food is average at best.  I won't be back, nor will I recommend. The only recommendation is to go someplace else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xwTN2fhEjdVKlBLpJmf6ng"
  },
  "kccrtNj3AcYx_kB9A5zc9Q": {
    "date": "4/9/2017",
    "text": "Service is terrible. Servers does not understand english which makes it confusing. Even if you have a special request for your dish, you will never get it.  Food is good and cooked perfectly.  Prices are high and servers always expect that you have to tip them 20%.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FKIKLzNR5u0SZqQB5J-wwQ"
  },
  "mwZ9RNWY7LreWBC-ePn8dg": {
    "date": "1/6/2017",
    "text": "I love their food! The salsa is nice & chunky like I prefer. The prices are fair. The service is always good. The lunch menu is even wonderful too. I know that I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EpXUpwebSyhhGX7mnJrFng"
  },
  "W-NN35qJdwBIMDg2GCFs6w": {
    "date": "3/26/2017",
    "text": "1 of 2 of the best Mexican restaurant I have ever been too.  Food is fresh.  Service is great.   Price is reasonable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6BZc0qCmsGQ5GtpTZf5z_A"
  },
  "EzO1-SIGAKl5jkiSdrCPNg": {
    "date": "6/6/2016",
    "text": "We eat vegetarian meals and this was a perfect choice for us. I don't understand why the place is currently only 3 stars. The food is delicious and flavorful. The service is kind and prompt.  We got the table side guacamole and it was the best. Neat to watch and great to eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lDBm9Lgrai6Fo5TkZCqz_w"
  },
  "cKDT25GXMx-eLiGSJxLplw": {
    "date": "3/12/2017",
    "text": "Simply awful. The food is not spicy or flavorful what so ever. They charge WAY to much for their food and drinks and the servers are not very friendly or efficient. Won't be back. Our Mexican restaurant back home is WAY better than this.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WYpc8TXn-CHMPVxD-LN1hw"
  },
  "v2YzW5zEGefqxMWhnDc0xw": {
    "date": "12/15/2015",
    "text": "We had such a great experience! My husband suggested eating here because he knew I had been wanting to try it out. We asked to sit at a booth in the bar area. Our server was the bartender and he was wonderful!  He gave us plenty of time to look over the menu and explained how their all you can eat taco Tuesday works.   The prices were very reasonable and there was a lot of food. Service and food were top notch. We WILL be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_O5ajREINPG9zeyhW5Dmqg"
  },
  "5vRStlLPOcHl-GiAwtu_oA": {
    "date": "1/19/2018",
    "text": "Delicious food, great people, great drinks, it doesn't get any better. Reasonable prices, great service. They get really busy on the weekends, and they still manage to interact and delivery excellent customer service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fwh1ZYRx9Ms_FNB1czfypQ"
  },
  "S_uuiUJrywSDCr6aQCElng": {
    "date": "6/28/2016",
    "text": "So sad.  This is the 5th time I have been here.  They have really gone down hill.  I was born in SoCal.  I get real Mexican often.  This was a great place before.  Everything was fresh.  Now, even the salsa is from a can.  I think it is spaghetti sauce.  The beans and rice are no longer house made.  The tortillas are from Costco.  36 salsas, we tried 2 and both were bad.  Just skip it.  It has become a poor version of TexMex.  Definitely not the authentic Mexican cuisine that it was a few years ago.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGRVI0Xfgz1r4OrWrtKxPA"
  },
  "fcuR7sE95yKpkZIzxMX4Tw": {
    "date": "12/18/2016",
    "text": "Love the atmosphere, service and food.   My favorite is any combo with a chili relleno.  We always request the guacamole made to order table side.  Yum.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8y_HzKFXEh3POYRTdDNZDw"
  },
  "FPYvfexJLOSXNuY-isNk9g": {
    "date": "12/10/2015",
    "text": "excellent food. Wife had mango margarita and enjoyed it. The Pina Loka was amazing; it's a half pineapple filled with fajita steak and chicken, peppers, onions, pineapple chunks and cheese.  Would definitely go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8nBm1E2Q3yJxWaHL3o3FgA"
  },
  "pl842BgGMolcoil52nPQdg": {
    "date": "4/26/2015",
    "text": "I really wanted to be able to give this place at least 3 stars, but I was somewhat disappointed.   The actual atmosphere was nice and I liked how it felt 'Aztec' so to say... and that they actually played Spanish music... I really don't like going to a Mexican restaurant and hearing pop music.  The server was super nice, but the service was super slow.   The chips and salsa were not great, but not bad.  I ate alone, so I ate the whole thing by the time my steak burrito showed up.       The menu was not very extensive, it was missing quite a few of the items you normally see in Mexican restaurants, and they didn't seem very inclusive.    So, as mentioned above I got the steak burrito that had rice in it.  The burrito itself was pretty good, and I ate it all, but it just took forever to arrive.  I was mainly underwhelmed by the selection of menu items.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MQOXalbozCE9cT1Kui_ZxQ"
  },
  "h3BWZxA8XpPSCEdy9dxTsw": {
    "date": "7/22/2015",
    "text": "I don't know why this place only has three stars. First time here and everything was great! The quest fundido was amazing. We also had chile rellenos, enchiladas, burritos, and a chicken quesadilla. We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E7cVQtJMey8A7NL7bAIMpw",
        "caption": "Photo of Plaza Azteca - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E7cVQtJMey8A7NL7bAIMpw/o.jpg"
      }
    ],
    "user_id": "xb9-sVUs7gDjDrnRNPSyag"
  },
  "JhYE6k_GBB7UzZ_Q37bwMw": {
    "date": "1/16/2016",
    "text": "Visited this place for the first time tonight with my husband and we were thrilled with the atmosphere, service, and food!  We ordered the fajitas for two and WOW. Beef that was so tender it fell apart, juicy marinated chicken, giant shrimp done perfectly and nicely grilled vegetables.   The service was on point. We were greeted at the table with freshly made chips and salsa. There was no pressure to order before we were ready and the food was out on the table quickly.   Overall, I couldn't have asked for a better experience and will definitely be returning!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q6HlZKAapvAnzQ2CgmRVMw"
  }
}