{
  "A8TBIlCb_Og-iWD9Ga0JNQ": {
    "date": "9/24/2016",
    "text": "Very simple food, like a chippotle for greek food. I really like being able to grab something and just seat down in market square at night and have good food without having to wait hours for a waitress. I would definitely come back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e-8d1xSb2qDKgg7q7VfY-A"
  },
  "6HjIS2j6G3wKcbS0IKIaTw": {
    "date": "7/4/2015",
    "text": "It may be a good idea for Mr Lemonis to come by to do a quick run through.  why did  the restaurant open 20+ min past its stated opening time?   the restaurant was kind of dirty, empty ketchup container, no napkins at table, no cheese pies, place looked disorganized....the food was good, but i expected a better experience. Also... napkins instead of paper towels in bathroom... and the place was suppose to open at 2 for lunch on 4th of Jul.... Isnt that kind of late???",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jKP6swYtRCdIxCa29VKGLQ"
  },
  "rODhwsCb4nZvD3t3ro_Kqw": {
    "date": "2/7/2016",
    "text": "Good food but questionable cleanliness. As I sat and ate I noticed 1 of the workers wipe their runny nose with their hands and get back to preparing food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OxkXnDI9ZpsiqvIg2ZJy5A"
  },
  "39WPdWXzVZ3ziyqm3zxIbg": {
    "date": "7/21/2016",
    "text": "Good food. Very packed at lunch time, but the line flys! I would stay with the traditional gyro meat as the chicken tends be be pretty dry. Altogether great service from a friendly staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FQT1DQVA0QwhEDs2i-ZNDA"
  },
  "JnkZddaqGlgopQlgisVmDw": {
    "date": "12/23/2015",
    "text": "This is basically Chipotle bowls for Greek food - and I am a fan!  I had the chicken which was really nicely cooked and seasoned over lemon rice.  I added Tzatziki, cucumbers, beans with kale and tomatoes, olives, feta, chick peas and red onion.  It comes with two pieces of pita bread.  I also ordered grape leaves as they are my go-to Greek food item.  These left a bit to be desired, but the rest of the meal was delicious.  They also have a yogurt bar which I will have to try out next.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2JjI8DCyrpabtg36iL5lrw"
  },
  "ueA3BWADKZOM3y88i5JCAQ": {
    "date": "7/20/2016",
    "text": "My family and I are big fans of \"The Profit,\" so we thought we would give The Simple Greek a try while we were in Pittsburgh.  Overall, we were underwhelmed.  The restaurant was understaffed and the interior looked like it had been a while since it had been cleaned.  The ordering process was simple as advertised, and the cost was reasonable for the large amount of food we received (about $12/person).  Our food was ok (I got a gyro on pita bread and lentils w/rice), but it wasn't anything special.  After seeing it on \"The Profit,\" we hoped the quality would be better.  The Simple Greek is a decent option for Greek food if you're in Market Square in Pittsburgh, but it's not worth a special trip.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kLnvtBVRKQ6BQtwLNE7n5A"
  },
  "aifbVxFnYMDb90hSBuOLow": {
    "date": "7/17/2016",
    "text": "Pleasant staff, great food. Not too much for vegetarians, however. We had a big lunch and went with sides for dinner- fries, pita bread, salad. While the food is somewhat bland, it was filling and the hummus and fries were delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QrWbXAmd-aE5UdutjH5j1Q"
  },
  "_qRzKdFomY4NI6nblk82Pg": {
    "date": "5/3/2017",
    "text": "Food isn't terrible but way overpriced. There are also much better gyro places in town.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_3rZlm5U_swLPHLuyzw3zg"
  },
  "EhdmsWtJxt0DLb_B1tZpBQ": {
    "date": "8/13/2015",
    "text": "The Simple Greek was good. That's it. The staff wasn't organized but they were friendly enough. My friend ordered some steak and they were out (not a big deal) but it took everyone in the kitchen to figure it out and they looked terrified when she ordered it, which was weird. I had a gyro and it was good, they did load it with too much meat for my taste, but I'm sure a lot of people like that. They do have a nice outdoor area that looks across the farmer's market, so that was pleasant. Like I said, it was good. But nothing special.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4aNnUNkYZNsnAUWNvX_H6A"
  },
  "e0X5NqV16LDQnjKAu98e6g": {
    "date": "11/18/2015",
    "text": "The worst part about my review is that I can't even comment on the food because I didn't get that far, due to the myriad of complete morons that work there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yv976ljGm8iBQvft70-u7g"
  },
  "WUdGZuXxfJABu9pd0KiIgg": {
    "date": "9/3/2015",
    "text": "Great lunch spot in market square.  Quick, tasty, and simple.  The rice and salad bowls are great, as are the gyros.    Downside is that it could be a buck or two cheaper.  The grape leaves aren't that great, which is disappointing.  Would be nice to be able to get a greek salad with no meat and tons of vegetables for a few bucks cheaper than their bowls.  In the end, one of the better spots in market square to grab a quick bite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CsDsLShRwj8VJUl-23CtiQ"
  },
  "z7kk7o3TBOq5qkNnZY73Uw": {
    "date": "9/3/2015",
    "text": "Gross. The chicken was bland and super dry, the grape leaves tasted like dry cat food smells, and the whole expensive ($15) meal smells vaguely of fish. Can't even bring myself to take another bite, and I'm a pretty gracious person with food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LjsaERLKfh_GtLqLcEw9Hg"
  },
  "aSYz-2O1-2pKqCogyJrDag": {
    "date": "4/21/2015",
    "text": "These guys do a good job of making quick gyro and other items. HOWEVER they need to know the difference between sour cream and yogurt. Today I asked for yogurt and they gave me sour cream...even after I questioned what they were putting on my salad.  Otherwise, a nice quick downtown lunchtime option.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ALqXitny2TTOUm4wRJOU5A"
  },
  "_e0POe02z1U2Eg7LD-skeg": {
    "date": "7/14/2015",
    "text": "Just ate there for the first time.  It was just ok. I got a chicken bowl.  Chicken and lentil rice were both really dry.  I did come at 2:30 pm at the end of the lunch rush, so maybe this had something to do with it.  The green bean garnish was just ok, the cucumbers and tomatoes were very fresh and tasty.  I also ordered fries.  You get a lot of them, but they were not cooked long enough at all.  Soggy and undercooked.    I will try them again during a \"lunch rush\" now that I know how to order and see if its any better.  The food probably won't be sitting around as long.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xHyJ2AUvvCfKjMTfSPPI2g"
  },
  "3YmvSXhuiqfaiTR-Q8K_qQ": {
    "date": "6/12/2016",
    "text": "Really disappointing. On a Sunday evening when there is the arts festival, two sporting events and the gay pride events, the restaurant was immensely underprepared. When ordering, I asked for lentils as my protein but they were only a few left. The server substituted rice for the protein without asking. Both the rice and lentils were undercooked. Additionally, I ordered a spanakopita and was told they would bring it to me shortly. They never brought the spanakopita so I asked the server and was told they were out of spanakopita. There just didn't seem to be any communication between staff about what was on the menu or what needed to be refilled in the bar area.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lRzU66Ck71ZTNcammWlCZg"
  },
  "ctYD6wB6k0kCTigw9cHxJQ": {
    "date": "6/9/2016",
    "text": "Girl wiped her nose with her bare hands then automatically began handling my food with her bare hands. Needless to say I walked out",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hOk-tB2MWh8CGRsWC6ax8w"
  },
  "oIewoJFg8DCEeFIkWVWwhg": {
    "date": "5/7/2016",
    "text": "I came in and got a gyro during lunch. The line was long but moved through pretty quickly. Good service.  The gyro meat was great along with the yogurt sauce and other toppings.  I'm definitely coming back in to try the chicken next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x40MuOeyOgIQlB7t4Pn-Qw"
  },
  "eU_1zxPl0he9vlb612lwdQ": {
    "date": "4/30/2016",
    "text": "I have only eaten at Simple Greek in downtown one time, but I have tried to go multiple times. While I admit the food was pretty good the one time I was there, the service has been regularly subpar. The first time, there was a really long wait for my fries and multiple orders were accidentally screwed up or given to the wrong people. It was hectic and confusing trying to make sure my group got the right food. Despite this, the food was good, so I wanted to go again with my husband.   So, on 4/29/16, my husband and I drove into the city to get some Simple Greek for dinner. I checked the hours online which said it was open until 7pm. We arrived at the restaurant at 6:36pm. The lights were off, but the door was open, so we stuck our heads in. Two young guys were standing down by the counter. I said hello and asked if they were open. The one guy grunts, \"no, we're closed.\" So I said, \"I thought it said you were open until 7pm online?\" He mumbled something which I couldn't understand - never coming any closer to my husband and I - so I said, \"We can't understand anything you're saying. It said online that you're open until 7pm - is that not accurate?\" He completely ignored me the second time and turned his back to us. Then my husband spoke up and said, \"We asked you a question. If you're not open until 7pm- how late are you open then?\" The guy finally responded, \"We're only open until whenever it's not busy.\" And then walked even further away from us.   Ugh- if there's one thing I can't stand, it's poor customer service because it's free. It costs nothing to be polite. If the young man would have walked over to us and said, \"I'm sorry, we're not open right now\" and \"Yea, our online hours aren't always accurate we tend to close around 6:30pm\" we would have felt a lot better about the experience. Instead we were left with a terrible taste in our mouth from the two immature and rude employees.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "01CCQrUEBpWpqtE2WOMzHg"
  },
  "7F1fMJnAqUEe6rplLCRN5w": {
    "date": "10/8/2015",
    "text": "I was really impressed by my yogurt bowl with hummus, vegetables, and pita, topped with honey, lemon and sea salt (an interesting combination that I completely enjoyed). The staff kept the line of customers moving (around 12 pm) and were very polite. A terrific place for lunch to go -- and the food was fresh and had great flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5q-IYU3zFQcoQ_YD4nBJVQ"
  },
  "BdP2lnE7xi159AamBiFEYg": {
    "date": "6/13/2015",
    "text": "Went in at 11:05 to try the new menu and the girl looked at us like why are you here and said they don't open till 11.  We told her it was after 11 and she said \"Oh than 20 more minutes\". How do you just randomly change your opening time. Not very organized obviously.  We really wanted to try their new menu but just left and went somewhere else.  Not very good customer service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W5NAODYv0_NrEcor-62dkA"
  },
  "i8nKwgDL5E2HxPv6mVPrZQ": {
    "date": "10/27/2017",
    "text": "This place is great!  Got chicken bowl with brown rice and a lot of toppings. Very flavorful. And yes, Amy's my wife!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y2Y0wfjVArnkq8hBRkRu2w"
  },
  "e5Bi04T5Ae_tjPUzqhbx5A": {
    "date": "4/2/2018",
    "text": "Delicious, quick, and healthy (nutrition info on the website)! The food here, especially the lentil soup and green beans, might be my favorite anywhere... shhh don't tell my Greek mama. The pita bread is toasty, the hummus is tasty and garlicky and I love that you can create your meal however you like. It's my go-to when I'm not sure exactly what I want because I love everything! It doesn't hurt that the service is always welcoming, thoughtful and kind.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kLDsCg3C_C_01jktDIgf2g"
  },
  "uj5BDdcdWCtDFYnBC0AckA": {
    "date": "3/13/2016",
    "text": "Delicious Greek offerings and speedy service.   Gyro = very good Grape Leaves = adequate Lemon Rice = my favorite item  Great lunch spot. Grab something to go and enjoy your meal in Market Square this spring / summer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "aoJ7B4HPlugEf4R4QPLbog"
  },
  "AG-wl_8c7YB9Q-P0WXF-7w": {
    "date": "2/28/2016",
    "text": "Yes.  A great small shop in the Market area.  If you are in Greek venue, this is a nice place to visit.  And far better than the $40 a person across the street.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "GsFr15zUG8wO9fsSHwvZUw"
  },
  "fH1ID_vAXtuK8c1HTpKBiw": {
    "date": "4/22/2016",
    "text": "Whomever called this the Chipotle of Greek food pretty much nailed it.  You start off with a decision between a pita wrap, rice, or salad base, and take it from there with proteins and toppings.  There are lots of side-dish options too.  It can get crazy at lunch time because of its location in the epicenter of the downtown business district, but you get through it pretty fast and if you're lucky, you can snag some outdoor seating and people-watch on Market Square.  For what you get, I find the price to be reasonable and the food is tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "3FjdHwnoz-vfw6hBBtckqg"
  },
  "0xjzaQRicclDE1plpkw-KQ": {
    "date": "4/14/2016",
    "text": "This place is an upgrade from its previous gyro place. It is on the pricey side for lunch, but I am happy to pay for a customized salad once in a while.  You can pick your own meat - gyro is my favorite and chicken is my least favorite. They have pork and steak but you have to wait for them to make it. You can select from a variety of hot sides and cold sides. Hot include potato with green beans or just green beans. Cold include tomato, lettuce, onion, hummus etc. However, just watch out for anything you ordered on the side to make sure they didn't forget to put it in. I also found myself having to watch carefully to make sure they follow my requests. I caught them a couple times coming close to giving me the wrong item. Good lunch spot if you crave a gyro salad nearby, not worth going out of your way for it though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpkdFgOVRX43fV0begAaOQ"
  },
  "P--lVEGrA2yVXyJkIFPG8g": {
    "date": "4/22/2016",
    "text": "Ordered Spanikopita .. It was hardly that. It did have spinach and crust but was a gooey mess. Nope won't go back if this is their version of Greek food?! This little thing wasn't worth the 3.75 I paid.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ww58PIOQEbTVl5XkiJxKlA",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Spanikopita ???",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ww58PIOQEbTVl5XkiJxKlA/o.jpg"
      }
    ],
    "user_id": "S8LIsjizMyzR-3xAqJGP0g"
  },
  "j37-eI4xf62RsAmqJN8hZw": {
    "date": "4/18/2017",
    "text": "As a fan of Mediterranean tastes, this place could not be any more delicious. The salad bowls can be loaded up with everything you crave when you want some Greek food: fresh olives, hummus, gyro meat, green beans, etc. It's a little pricey, but you get what you pay for.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HUb8D1Q-g-0GISjh8gzlGQ"
  },
  "5ZstfLCcQo2bWG09vd65BA": {
    "date": "3/16/2017",
    "text": "The chipotle of greek food. Not bad quality, a bit expensive, a bowl cost about 11 bucks.  Hold back on the onions if you don't want to have onion breath at work.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DRM-xU8QIANJfnF5CIbYWg"
  },
  "Wb9IMkr0AkIIpZ9MfToyBA": {
    "date": "5/15/2017",
    "text": "Great lunch spot. The chicken bowl is one of my favorite things to get for a healthier lunch out and keeps me full for a long time. Everything is very tasty. Occasionally the chicken has been slightly overcooked, and the menu is not the most diverse, but still remains one of my favorite lunch spots.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iDvBqaj0jQCNFDL3AqxTcw"
  },
  "MOQ_OykYmQLOWm2Huqnq0A": {
    "date": "11/1/2016",
    "text": "This joint is amazing. I always get the bowl with salad and steak. The steak is made to order, very fresh and delicious! You can make the bowl as healthy as your want or as carb filled as you want. I come here at least twice a week during lunch. Top- come before 12 or after 1 when the line is short! Be sure to get the green beans and potatoes as well, delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EidaNo796ZKeuE_c_Avk4w"
  },
  "th-iJolONpwm6p9E077Qlg": {
    "date": "12/29/2015",
    "text": "This place should definitely have a higher rating! This restaurant is basically the Greek Chipotle. The food is prepared and served by Greeks so the tastes are authentic. This was the best tasting gyro I ever had because then meats and sauces were so flavorful! I got a gyro bowl and it was a great deal! Greek food is somewhat scarce in the area and to provide it in such a quick, efficient manner is great! This is definitely not much of a sit down restaurant and the space isn't super inviting but there is plenty of room in the plaza to sit and eat. I went here during Light Up Night and was able to get my food fast even though the line was practically out the door. I also love the customizability to the meal. Great concept, location, tastes, and services. Only downside is the interior of the restaurant, but if you don't plan to eat inside, then it's easily overlookable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "87yDspNg9HFoPqV0A-heZg"
  },
  "49k_9BitL-T2BknJkaKIBA": {
    "date": "9/18/2015",
    "text": "Total disappointment... This place WAS going to get a great review.   I've encountered the Simple Greek three times thus far. The first time was great! They were apart of a delivery service, and it was so awesome to have great Greek food delivered to my door. The chicken was overcooked, but I still enjoyed the gyro.  So... Of course I wanted to order again. I put an order in on Mr. Delivery through the Eat24 app. Typically, it takes some time for actual restaurants to deliver the food, but no big deal. By the time my 'estimated delivery time' came about, I get a phone call from Mr. Delivery... They've called to tell me the restaurant isn't currently taking delivery orders, and my money would be refunded... Okay, I understand, maybe someone was short staffed on the restaurant side or the delivery side. I was disappointed, and still hungry... But not angry.  A couple days go by, and I figured there's no way that hiccup can happen again. So this time I ordered Mr. Delivery through GrubHub. At least they didn't wait for my delivery time to call to say the restaurant will not deliver.   I guess the restaurant decided to not participate in the delivery game any longer... That's cool, but maybe have your vendor take the restaurant off of their websites, so customers don't place orders. Both times- I prepaid with my credit card and included the tip. Which I normally do since I'm a frequent online food orderer.   Long story short, I'm out $45, yes $45 until the whole bank processing time is completed...  and HUNGRY! DO NOT ORDER FROM THIS RESTAURANT ONLINE.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ueY3vHSY0qqKtIHjmjnvmA"
  },
  "ZuhhN6N32h3LAgMGVkPjfA": {
    "date": "5/23/2015",
    "text": "LOVE LOVE LOVE LOVE. I would give it 8 stars.   This place is so GREAT, so much that it deserves ALL CAPS OH MY GOD. It's basically set up just like a Greek chipotle and the food is soo delicious and fresh. For basically the same price as a burrito bowl ($8.50 with tax) you can have truly delicious Greek food.  I went for the rice bowl with lentils and chicken. They give you a huge portion of meat (no skimping here!) and all the greek yogurt/veggies/feta/olives you want! Be careful though, olives are not pitted. Sorry molars ...   And when I teetered back and forth over getting a side of hummus, the gal putting my bowl together said to just get some hummus in the bowl since it comes with pita, so I didn't' have to pay more. (My wallet thanks ye kind lady!)  Super excited to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "fFPc6xeOebK1ns8qYuUfew"
  },
  "-9DlS6swuHApYfxqq9r8yA": {
    "date": "8/20/2015",
    "text": "I don't like lines. Who does? I especially don't like lunch lines at high noon in Market Square. Yet there I was, at the stroke of 12:30, with four companions. What to do?  Well, we met in front of Simple Greek, so we thought we'd take a peek inside, where we found ZERO line!  To be honest, I'm not sure why, given that after thoroughly enjoying a greek/lentil salad, I left thinking it should be more popular.  It's a little pricey for what you get, but sometimes it's worth it to splurge for a warm, soft pita, great service and awesome flavors.  Check it aht!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ARdx8hOcEWlMDjzwLYZ_g"
  },
  "sfvbG6IKbTYgN4kzQhDjTQ": {
    "date": "8/19/2016",
    "text": "While in Pittsburgh, we had to try The Simple Greek, having seen the episode on The Profit -- one of my favorite shows. We already had eaten lunch somewhere else, so we stopped in for a yogurt. There was a line, but it was moving along. A young man took our order and asked another young man to make the yogurt (just one -- we were sharing). Well, it didn't happen, and we arrived at the register before our yogurt and had to step aside while 5-6 people behind us all got their food and went on. Very awkward, and not a good experience. I was really disappointed. I suppose we might try Simple Greek again when we're in town, but that visit will have to go really well to keep us as customers.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OhnALTDVbffslbYNzhw4qQ"
  },
  "jdIuwqqbjIkG7DMUr0WTcg": {
    "date": "6/25/2015",
    "text": "Have you been to Subway?  Imagine that system but with gyros and Greek salads.  You go in and pick if you want white pita, wheat pitas, or a salad.  Then you go and pick your meat, tzaki sauce (they have 2 choices yogurt or sour cream based), and veggies.            There will be a line here at lunch, do NOT let that intimidate you, it typically moves very quickly and the staff is good at keeping it moving.  They also have alot of outdoor seating right there in Market square.  I highly reccomend grabbing your gyro and sitting outside on a nice summer day and enjoy the ambiance of Market square without the need to fight for a table and enjoying a great gyro.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nbVhicAu_-rOrXKh7xV2dA"
  },
  "ecZCTqdEALPQXQtcx-gOQw": {
    "date": "4/28/2015",
    "text": "Great lunch spot in Market Square.   Friendly, fast service and fresh food. I love the concept of their \"rice bowl,\" which comes with a lemon rice (lentils optional), your choice of protein, and then various delicious toppings such as olives, feta, onions, green beans, etc. The bowl is topped off with your choice of sauce as well.  Great decor and a nice addition to downtown. I will be returning soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ySFAoZqGrDkql7ulAm5kGA"
  },
  "8sKkHSIqnwvKocVeop3vEA": {
    "date": "3/1/2016",
    "text": "I was expecting more. Don't get me wrong, they load the gyro up with meat and toppings but the meat is where it's at. While making it I seen him get the gyro meat that was soaking in I guess water (ew) tastes dry and makes my mouth dry after eating it, had a weird taste. Why wouldn't they use the rack of meat that's spinning behind them? The sauce wasn't that good either.  I also got the fries Greek style, nothing special, but they were good. Probably won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N2Xnp4e62lSPoN6XOZG2_A",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Gyro wasnt that good.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N2Xnp4e62lSPoN6XOZG2_A/o.jpg"
      },
      {
        "img_id": "l3-k1Ysd8Y-XoRV0VYhTuA",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l3-k1Ysd8Y-XoRV0VYhTuA/o.jpg"
      }
    ],
    "user_id": "1WM9rK8lkct03GWKmrHFww"
  },
  "mMUZF7mO4XvrYwO5s8QzUg": {
    "date": "7/26/2015",
    "text": "Delicious salads and pitas! I have come here for lunch during the week and the line can get a little out of control... I would like to give them some advice to make the queuing a little faster but it's worth the wait for their salads. It's basically what you would expect at a greek restaurant, I do like that you can choose what you want on your pita/salad.   I've had both the pita and the salad before, they offer different meats and proteins and then your choice of mix-ins.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gXImJoYiK1tVQQFownvDOg"
  },
  "BsllWXd-yZlkAKhn9Fi5VQ": {
    "date": "9/12/2018",
    "text": "Pretty good food, nice sized portions.  I would change it to $$ instead of $. This isn't McDonald's after all.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "beQHq9SIFUwVnACWaolJEA"
  },
  "WptTNfqqyWjASklFgmDmwA": {
    "date": "5/22/2018",
    "text": "We had a catering delivered and my guests were so impressed ! Not the normal salad , pasta buffet  Well done and our sincere thanks ! We will be back !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XWUCQsBsPp1sKgSgpYH27A"
  },
  "85FAoyAkvsO_L0ri7OiwCA": {
    "date": "10/12/2018",
    "text": "Spontaneously decided to check it out while downtown and I have to say I was pretty impressed. Essentially I would call it a Greek style chipotle where you get to build your own bowl or gyro. There's lots of meat choices and rice and veggies as well, best of all you can get as many toppings as you like, including hummus! They also have side options as well such as fries and pita (which comes with a bowl, also with white and wheat options). Serving size is fairly large as well but only reason I would give it four stars is because of the authenticity of the food, being someone who has gone to Greece, I would describe it as a little bit \"Americanized\". Besides being on the slight pricier side for fast food I would highly recommend if you're in the area and want to grab something quick! Lunch hours seem pretty busy but the line did move fast, there's limited indoor seating and some outdoor seating but it's market square so if the weather permits finding seats outside shouldn't be a problem!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fZI7Cqj3QOnOfcBNGtLWlQ"
  },
  "eexN9bcCdlodeW4KGemskg": {
    "date": "5/18/2018",
    "text": "The most amazing potatoes, gyros and green beans!    I frequent many Greek restaurants but this one is the best!  Service is wonderful too!    I will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n3orFIB7vv--HMssVx7ArQ"
  },
  "fFvl70VnozgOC6IhvOXKyA": {
    "date": "7/26/2017",
    "text": "I had high expectations after seeing this place on The Profit. I was surprised by how messy it was, in front of and behind the counter. The staff were not engaging nor was there any 'flow' once I walked in. The guy that prepared my food was very polite, but offered no explanation of the options and didn't curate an experience.   The food was good, not great. I'm not sure why a Greek spot uses American hot sauce and not Siracha hot sauce?",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2-kjdWn-5W6pN_HY9Z8XjQ"
  },
  "yUymJ0MZPdK9D0Sa8iw5Eg": {
    "date": "10/3/2018",
    "text": "Great little place. Super friendly staff and great service. Fresh yummy grab and go Greek food made to order. Yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-8jKG49WWYP18GQBVjrAEw"
  },
  "MM3KkIEpsD9Ch065zhhkAQ": {
    "date": "10/18/2018",
    "text": "Food is good but their online ordering process is seriously messed up. 4 out of 5 times they do not have the food ready by expected time for pick up because they \"missed\" it and they start working on the order while you are made to wait for several minutes and are simply unapologetic about it. This beats the purpose of ordering online.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3d1FxAHgHJak0l88teaI5Q"
  },
  "hGzscQTpg74zP4e70adCfw": {
    "date": "1/22/2018",
    "text": "Now that I work nearby, this has become such a reliable lunch spot.  Like other folks have mentioned, this is a counter service spot where you build a bowl or a wrap by going down the line and picking your ingredients.  The food is solid: fresh and healthier than most spots in Market Square.  A regular bowl is big enough for two meals if you load up on toppings, which makes the price positively reasonable!  The line moves quick, but they tend to run out of a topping here and there when things get busy (no chicken gyro meat today, womp womp.....)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YMv6hD-8VIPu6ax4XZcEGw"
  },
  "mNY_bGRyNUbYvPqYP1pyfw": {
    "date": "8/16/2018",
    "text": "Excellent spot and the location is right in the market square. I wish they had one in Chicago!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "69XgLZ1aJnlZNDCSeeDDCw"
  },
  "8MlHUPEKC0dgWyAZZv4UYA": {
    "date": "12/1/2017",
    "text": "It was Friday evening and we just attended an event in the square. We stopped here to grab a bite. This place is very small and casual. The decor was bright and clean. This place is the Greek version of chipotle. Good fresh, flavorful, food at a reasonable price, entirely customizable and a decent bit of options, including desert. My family includes a 3 year old and a 1 year old. They eat just about anything but this evening they enjoyed pita bread with hummus and fresh cut french fries. The hummus is very flavorful, strong garlic which I liked. They forgot to give us the hummus at first and when my hubby asked for it the owner or manager came over and gave us a free piece of baklava! I tried it and I think most people would love this. It was everything I like in baklava except I'm a huge anti-cinnamon person, so no thanks. We also ordered gyros which were very large and pita bread was soft and fresh. A substantial amount of meat but wasn't impressed with it, just average meat. We ordered the spanakopita and village salad too. Both were fresh and tasty! For our entire order, including 3 drinks it was $40. We could have spent less and walked away full but we wanted to try some of the appetizers. The gyros are huge! Just a gyro would have been enough for an average person. We took half of them home as well as some fries and a little bit of hummus. Basically 2 more meals. I didn't think it was a bad value considering the location, quality and amount of food we ordered. I would go back again but would like to try a different entree next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-K4EMFKWRGUFakSHY9yN8A",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Spanakopita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-K4EMFKWRGUFakSHY9yN8A/o.jpg"
      },
      {
        "img_id": "_oR4GkYsupqjWE94Tx0vNg",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Village salad and fresh cut fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_oR4GkYsupqjWE94Tx0vNg/o.jpg"
      },
      {
        "img_id": "bZLLRcjeQEUAjpu7EUEMrA",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Hummus and pita bread",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bZLLRcjeQEUAjpu7EUEMrA/o.jpg"
      }
    ],
    "user_id": "ZxJyREek5tBD6rSewexkGg"
  },
  "LcH9Ybuig3FlPfBDvPJSbA": {
    "date": "10/4/2018",
    "text": "Don't bother...if you truly know Greek, there is nothing authentic about this food. You'll be better off crossing the street and going to Chipotle.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5I-nBelvyWVCxcam1yKnQw"
  },
  "C_QdTkJy4OdEpDR-trcumw": {
    "date": "12/4/2016",
    "text": "I stopped here for a bite to eat during Open Doors Pittsburgh. There are many restaurants in this little area but the smell of the gyros sold me! It was basically a Chipotle for gyros. I got a salad bowl with gyro meat and all the fixins. The food was good but not great. The seating area was not very clean and that made it hard to find a spot to sit. verall, i was pretty underwhelmed with the experience and would pick somewhere else next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lERZRwk62EnGDjECwTj_sQ"
  },
  "i5j1MTfGHcdYsOj3bqdmIg": {
    "date": "10/27/2017",
    "text": "Looking for fast casual food in a great setting and The simple Greek was PERFECT. Food was fresh, tasty and as a vegan, lots of choices. Sat outside and enjoyed the ambiance of Market Square",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mmaoD2qi-GPaSY4HmO5lTQ"
  },
  "hH-C85uCoEryqFIkCV8gjw": {
    "date": "6/13/2018",
    "text": "Great place to grab a quick lunch! Although not as authentic as some places, if you're looking for something good and quick I would highly recommend. The chicken gyro is fantastic as well as their Greek salad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZvGqY40B6ycyMDQzg2KV0Q"
  },
  "QSaII5AqoFlj1IBgUn16OQ": {
    "date": "4/19/2017",
    "text": "Stopped in for a quick bite. The Gyros are good, meat was plentiful and was seasoned well. Fast Chipotle style assembly of your Gyro or bowl. Menu is limited but it's worth a stop if you want something quick and not so bad for you. I'd eat here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kzHAbgXpxaED7Bnp7IVheg"
  },
  "RFUcoyTAsk0NtUaToGWQJw": {
    "date": "12/25/2017",
    "text": "For not the wait, it would have been a 5 star. The food is delicious and flavorful with all Indianess. Loved all the ordered items. This place closes late and they do home delivery, so if you don't want to wait in their palce, just order online.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "COYbG6qoAap-4kXsf73W9Q"
  },
  "jA7pkPNDWOIpTDLBXbU93g": {
    "date": "1/26/2018",
    "text": "Great food quick service. First time here and it's better than the Greek place back home",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wJ_CytG6WEFlacOV9TY5Wg"
  },
  "_tHy84kAR3OpVoZbTROELw": {
    "date": "6/15/2016",
    "text": "Decided to give this place a try for lunch the other day.  I went with the small bowl with rice (as opposed to salad), chose rice with lentils, gyro meat, yogurt/tahini sauce (as opposed to the sour cream sauce) and topped with veggies.  The small was the perfect size for me but I could see how most folks were getting the large.    I was disappointed that with the small size you only get 1/2 pita (2 pita quarters) as opposed to if you ordered the large size you get a full pita.  I think next time, I'll opt for the pita rather than the bowl.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NnrCwpS1i5mZtkGGzmIk0g"
  },
  "Tg0pGyPjexWenz3EH7YuKg": {
    "date": "8/11/2015",
    "text": "This was a tough one to review. The restaurant needs a makeover. It is disorganized and dirty. The restaurant had so many flies flying around, I can't believe my husband ordered food from here. With that being said, I was surprised that it was actually pretty good. The gryo was tasty. They are set up like subway. You add whatever you want to the gryo.  The veggies were fresh as well which was a nice surprise.    I am torn on recommending this place. I would give it 2.5 stars.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rD25AK8lc0r-TgDtYgzATA"
  },
  "wS68xbh8K7DYNPEbZYiLkA": {
    "date": "10/23/2016",
    "text": "I like how they prepare everything in front of you kind of like a Greek Subway or Chipotle. Loved the outside seating and the TVs inside. I work downtown so I had enough time to get in and out for my lunch break. I was pretty shocked that a Gyro and Fries was like $12-$15 for that price I could have walked down to Mike & Tony's and ordered 2",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "likXkXQrmE-zOXdv2lTyTA",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Nice indoor atmosphere... Patio seating outside",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/likXkXQrmE-zOXdv2lTyTA/o.jpg"
      },
      {
        "img_id": "VnVUNCOyxa8DMyY1y-jDwQ",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Fresh cut and hot!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VnVUNCOyxa8DMyY1y-jDwQ/o.jpg"
      },
      {
        "img_id": "VZ1saKLYcMug_GwuJgsd1w",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Who doesn&amp;#39;t love a Mid Day GYRROOOO!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VZ1saKLYcMug_GwuJgsd1w/o.jpg"
      }
    ],
    "user_id": "WPxGkR2h-v6CQqMcXL_PwA"
  },
  "xIAc-8k2ARbtuc1T8X9sRg": {
    "date": "4/13/2019",
    "text": "Like a Greek Chipotle, but with friendlier and more helpful staff. Its location is great - right in Market Square with nice outdoor seating. The food is delicious and the menu is easy to understand.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "htEEUbx_vIz-AqqYhdrBSA"
  },
  "kmshCToqLdp3fex8Iqaryw": {
    "date": "10/11/2018",
    "text": "Wow! I came here for the first time yesterday and it was the best decision I've ever made. Chipotle style set-up inside, where you go down the line telling someone behind the counter what you want. Soooo many options. I got a small bowl (which was the perfect size, leaving me full but not too full) and their grilled chicken with rice & other delicious toppings i picked along the way. They give 2 little pita slices as well for an extra. The garlic based white sauce is 2 die for. Everything was so flavorful and I'm so excited to go back. Establishment was also clean and staff incredibly friendly.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oQ1gvM6zXqUkUD2eQVskGw"
  },
  "OeZlW2P7sGdKD_TlgnnBLA": {
    "date": "6/13/2018",
    "text": "Tucked in the middle of Market Square, this place is like a Greek version of Subway (in a good way).  Fresh ingredients, delivered assembly line-style.  I was able to get through the (long) line at the top of the busy noon rush and got a tasty, customized Greek meal in record time with no muss or fuss.  Bonus points for having lots of Keto-friendly choices, lentils, spicy(-ish) hummus and a solid tzatziki sauce (the mark of a True Greek joint).   T'was tasty!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nlKFcgvZm_KYTjZXUF-d0g"
  },
  "UppRIXkPfKsJQds9RywLug": {
    "date": "3/6/2018",
    "text": "Located in the heart of Market Square in downtown Pittsburgh. The Simple Greek is a delicious and quick Greek restaurant. They have the meat rotating and they heat their pitas on a grill. The customer service is outstanding, they so kind and helpful. I was in Pittsburgh on a work trip and went to the restaurant Revel & Roost to try to get a table, that was a recommendation from one of my friends who lived in the area. They told me since I was alone they could not seat me. I thought that was extremely rude. It's hard enough being alone on a work trip and having to dine by yourself and then to get such snobby attitude from a local establishment, was unfortunate. After that, I The Simple Greek and I decided Greek food would be amazing. I ended up getting a bowl. You can choose getting either a bowl or a pita. I decided to get lentils for my base. I got grilled chicken and a lot of different toppings with hummus, all mixed together. I got it to go and I ate half of it in the restaurant and ate the other half later. The portions are very generous and it was a delicious meal and good choice on my part. The price was ridiculously affordable.I highly recommend going here for quick, fantastic Greek bowl or pita.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "UXDNDthyd5pX_00_pq9A_A",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. This. Is. YUM!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UXDNDthyd5pX_00_pq9A_A/o.jpg"
      },
      {
        "img_id": "ls0hco-SnBK54thr3MtjvQ",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. No, THANK YOU!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ls0hco-SnBK54thr3MtjvQ/o.jpg"
      }
    ],
    "user_id": "hA2X9akTxboda17YqbF20g"
  },
  "KUU9RhmtaXk2lEEiwFjNvA": {
    "date": "11/1/2017",
    "text": "4 stars for many reasons. 1. Portion size was really good, large enough to feel satisfied but not too full. 2. Little to no wait time during peak hours due to the way the line works. 3. Delicious food.  The negative downfall and the reason I couldn't give this place a 5 is the pita. My pita was severely freezer burned and I could even eat it due to the taste. Need to step this up! Good thing I got a bowl..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6BnvEluqfazShd1tg9kqGg"
  },
  "LsELyFn2DKYNOEW0PZrAwQ": {
    "date": "2/17/2018",
    "text": "I love this place. Fresh, delicious ingredients. Great service. Never disappointed. The Greek fries are awesome. I usually get a chicken pita or chicken bowl and add all the yummy toppings...tzatziki, olives, feta, cucumber. Highly recommend The Simple Greek.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ra4K7XTx_rmcbdeuMbQD6A",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ra4K7XTx_rmcbdeuMbQD6A/o.jpg"
      }
    ],
    "user_id": "0DOcKIhLkCGkvzMOXvr1Hg"
  },
  "rQ0Qwu8cAyjCV7tokoIskQ": {
    "date": "7/16/2018",
    "text": "Awesome Rice Bowls!  Great Gyros! Come Eat!  This place serves up a rockin' tase of Greek entrees.  I tried the make your own rice bowl and it was fabulous!  The Simple Greek also has a great rewards program and is registered with Yelp as a cash back business, which is a major plus!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "epHK0OJPEdu-6jHwH0dg-w",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. They are having a contest to win a $100 Gift Card at Simple Greek!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/epHK0OJPEdu-6jHwH0dg-w/o.jpg"
      }
    ],
    "user_id": "lckAPhjEwQK5NX6HrG_Jgg"
  },
  "w3jlHWrmYD2bNWBEXIYTDQ": {
    "date": "6/3/2017",
    "text": "On the plus side, it's speedy, reasonably priced,, with vegetarian options and  made to order. The staff were friendly and helpful.  To the negative, some of the food was rather greasy.  We particularly enjoyed the made to order salad. We added the delicious Greek olives, green beans,  tzatziki sauce, beans, hot peppers, tomatoes, and cucumbers.   The spanikopita was just okay, nothing like what I bought at the Greek Fest. The Hummus was okay.  There were plenty of places to sit, especially outside. Tables were relatively clean.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "lTR63Fkbbjte6-CNn_VFgg": {
    "date": "12/5/2018",
    "text": "I must of ordered the wrong thing ! I got the Greek lemon soup ..... so much salt and  pepper , and couldn't taste any lemon . So disappointed I threw it away.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mDA2BlxYxjTIoufG5ips1A",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mDA2BlxYxjTIoufG5ips1A/o.jpg"
      }
    ],
    "user_id": "DDGcj2n7lhKpWr-2F44kOw"
  },
  "kNO8s12armIJoL4GNAzbeQ": {
    "date": "1/26/2018",
    "text": "A little pricey for lunch, but I really enjoyed The Simple Greek. I had a salad bowl - added lentils, potatoes, cucumbers, tomatoes, onion, olives, tzaziki, chick peas, feta cheese, wheat pita. So yummy and filling, but light enough that you feel good. We also had an order of the Greek fries which were fantastic - crispy and hot and hit the spot. I wish the prices were a tad lower, but love all of the fresh ingredients. This is basically a Chipotle style place with Greek food!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8q_GkRdu8UKTm3A1e37kkg",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Salad bowl",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8q_GkRdu8UKTm3A1e37kkg/o.jpg"
      },
      {
        "img_id": "RqDC2UibVc6VcTkjQQd-pg",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Greek fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RqDC2UibVc6VcTkjQQd-pg/o.jpg"
      }
    ],
    "user_id": "-sv8-a09Psq5CMzmg6E4OQ"
  },
  "TNpJBvHofB8rj4PR0WyaUg": {
    "date": "2/22/2017",
    "text": "I may not be a Greek food junkie, but I am a huge fan of The Simple Greek! It's so hard to find a quick meal in Market Square  that won't clog your arteries and fill you with regret (I'm looking at you, Primanti's). Although there are times I can eat an entire vat of french fries, it's nice to have an option available that's not only delicious but healthy.  As everyone has mentioned, this is the \"Greek version of Chipotle\" - aka fill up that bowl or pita however you like it. Although I have to pass on the gyro meat, they do not fall short on their vegetarian options. I generally choose the salad for a low carb option, load on the lentils for protein, then top that baby off with a load of veggies and tzatziki. Oh an bonus! You also get two pieces of white or wheat pita.   Although I love the salad bowls, my absolute favorite item is the greek yogurt. These bowls of magic are the absolute bomb (yes, I said BOMB). You get full reign on the toppings and they have many delicious options you can choose from like almond butter, fruit, and nutella. They're surprisingly very filling for what seems to be a small bowl. I am obsessed!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "6KUA3-IfHoAhQ3FL2djQoQ"
  },
  "BanZbhM0OdasyAAiyt0tLg": {
    "date": "7/13/2018",
    "text": "Always a good lunch time spot for a (mostly) quick \"to go\" lunch. The lunch time line is usually out the door but they work quick and the line moves along at a good clip. Seating available indoors and outside, plus the usual market square seating/ambiance as well. Solid food and lots of combinations for your Greek food fix.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X90b014BpTSkN6M7MZ-wVQ"
  },
  "jq3Nrpx4x7Cj94W8M5q3Qg": {
    "date": "12/9/2017",
    "text": "Chipotle but for Greek food. A couple TVs in there to watch the games while you're dining. Very friendly staff, fairly priced. The Greek fries in particular were good. The baklava was delicious.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "2gh3pr_AWbl0PYT_SmwxyA"
  },
  "xukLhpWuHeEDYPFzjo76FQ": {
    "date": "12/5/2015",
    "text": "I was looking for a bite to eat for lunch in Market Square and was curious about checking this place out, plus I love Greek food.  I was a little skeptical of another \"build your own\" type place when I first walked in, but The Simple Greek delivered.  I was surprised that they were actually visibly roasting the lamb (much like in other authentic shops I've seen while traveling). I ordered a salad bowl and the staff seemed to encourage you to add as much stuff to it as possible. They had an enormous variety of topics, well beyond the basics--3 choices of cucumber/tomato mixes and grape leaves for good measure.  The interior was decorated minimally, but had various seating options inside and out. The staff wasn't too friendly and this place is definitely a cafeteria style-clean up after yourself type place. Maybe it's just that it's not ANOTHER Mexican restaurant in its spot, maybe a little refreshing to get a little fancy with that salad bowl, but the food was 4 stars for a lunch joint!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "P6aO3cRkMx6qn26HMzMOBw",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P6aO3cRkMx6qn26HMzMOBw/o.jpg"
      }
    ],
    "user_id": "NxtYkOpXHSy7LWRKJf3z0w"
  },
  "3ukKiBxTdEQLDfP_zgf4GQ": {
    "date": "6/13/2018",
    "text": "This is probably my favorite place to grab lunch during the workday; however, lately the regular sized bowls are being filled less and less. It's reaching a point where the cost of a regular sized bowl doesn't correspond to the proportion of food that you receive and that sparks an issue. My suggestion is simply add a bit more rice or lettuce at the base and it will set the rest of the bowl up for success. Just my two cents.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_bo5qthOhXKMGMLB550u_w"
  },
  "jw3WjYoPNlu6xV5s5RncuQ": {
    "date": "2/1/2018",
    "text": "First timer. Lunch. It's kinda like a Greek \"Chipotle.\" (And I love Chipotle.) The customer line was long, but they moved it along at a good clip. The staff was efficient and a little friendlier than most fast food places of the sort. And they had drafts! (May not be for every lunch, but it's a nice amenity.)   The food was good, really good for the price, and the staff acted like they own the place (in a good way).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gGmyJhXfxpjB8n-BdDhvyA"
  },
  "QEWRLNQ4xcAzHpXFUwWHOw": {
    "date": "5/27/2018",
    "text": "Very fresh! They were flexible and creative with making vegan bowl for me. It was awesome!!! Lots of lemon olives cucumber er tomatoes green beans and more. I was surprised how much I liked it. Staff was fun music was good too. Not sure why they are closed on Saturdays... I could understand in winter... but in spring/summer there's so many festivals on Saturdays!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NUsNwmTpfHbzjU_2KvaNZQ"
  },
  "9hEmOSt0cn9GIHfyj0iItA": {
    "date": "5/18/2015",
    "text": "As a first time visitor to Pittsburgh, I asked the hotel concierge for a good place for lunch and she pointed me to Market Square with it's host of choices. I honed in on The Simple Greek as I prefer to skip chains whenever possible and there were a fair number of these to be found in the square. Additionally the line was at to the door so either it was really good or grossly inefficient. I am happy to report the former rather than the latter.  The line actually moves pretty quickly but I did feel some pressure to know exactly what I wanted to order to keep things moving and not screw it up for all the regulars in line. I selected a gyro salad bowl on to which I had green beans, cucumbers, tomatoes, red onions, feta cheese with Tzatziki sauce added. Everything was quite fresh and yummy. Despite the line, there were several free seats available for eating there. Most folks seem to be taking it to go to chow back at their desk. I found their prices to be quite reasonable and the meal overall quite satisfying.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "EwsuVlmZ3H9K0-T1ndwlTw",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. These guys hop around and do a good job keeping the line moving. Lots of fresh ingredients to add to your bowl.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EwsuVlmZ3H9K0-T1ndwlTw/o.jpg"
      },
      {
        "img_id": "2w8SDUmcvsml8MJ6UZuXQQ",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. You can feel the heat coming off the cooker from the line.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2w8SDUmcvsml8MJ6UZuXQQ/o.jpg"
      },
      {
        "img_id": "v3diTQTpr7OjyzRVGfoV4A",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Limited outside dining which is a shame with all the space out front.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v3diTQTpr7OjyzRVGfoV4A/o.jpg"
      }
    ],
    "user_id": "ksU2qmS288fldkUcL0kRGA"
  },
  "sHpknV09C6OdTZGwRuiBhw": {
    "date": "1/18/2018",
    "text": "Chicken was over cooked Lentils were undercooked I had the bowl and towards the end it was more of a soup, even though I asked them to drain the veggies. Also overpriced",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AuSB69SSnaPNTwwbFk93MQ"
  },
  "GN5wBg9DIlFju0XP8hmVEQ": {
    "date": "10/1/2017",
    "text": "My favorite lunch spot in Pittsburgh. It's like Subway for pitas. Love to get the Greek salad with chicken and all the toppings I choose. Their Greek yogurts are also delicious! Great prices, too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K0a_wuOCcjiNn2C6zz4DpA"
  },
  "M4RIict-zXgTdF8JkFU5dg": {
    "date": "8/17/2019",
    "text": "Tressa prepped our food ( and she has a wonderful personality! Supper friendly!!) My Gyro was on point! Very authentic!! Ethan  was work had keeping the place clean! And Sasha need to expand to Morgantown!! We need a amazing restaurant like this !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GRvRYe0tkRDeTns_jKzZtQ",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Gyro &amp;amp; small bowl",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GRvRYe0tkRDeTns_jKzZtQ/o.jpg"
      }
    ],
    "user_id": "_u3WdFjVFkH8MoG8r1I3Lg"
  },
  "PtWVlNQprRWL0kr-rjvVYA": {
    "date": "8/3/2019",
    "text": "Yes. Yes. Yes.  If you are thinking about going please do. You will be glad that you did. This is one of the healthiest restaurants in Market Square.   They have a huge selection of my favorite greek ingredients and you can literally assort ANY way you want. They let you have as little or as much you want of each ingredient as long as you can fit it in your bowl. Nothing here tastes bad. Everything is fresh and of the highest quality. I especially like the tzatziki sauce, gyro meat, legumes and crispy lettuce greens.  From a Dietitian standpoint this place has all the foods you should be having more of: dark greens, legumes, and the freshest most amazing toppings. So much flavors at once.  I also love how they organized the layout. Despite almost always being busy they have a very efficient way of making their food so that you never feel like you have to spend too much time waiting and it is always very much worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cgecfJZ46npwKX2iOIbVWg"
  },
  "uq9hB802CJariaSWo7vyFw": {
    "date": "3/23/2019",
    "text": "I really wanted to love this place.  Greek is some of my favorite cuisine and isn't as plentiful in Pittsburgh as it was back home in Buffalo.  Strolling through Market Square I saw someone eating a delicious looking bowl and asked them what it was.  I was intrigued and decided to check it out.   I have now been there a few times and am giving it three stars because of the mix of experiences I have had. Overall, I love the concept.  You can choose either a bowl or pita and then choose your base, protein, ingredients and sauce.  There is a nice variety of options and they do let you mix and match.  (For example, on my most recent visit, I chose both lentils and white rice as my base.  They also let you sample the sauces if you have questions about the flavors.   The reason I lowered my rating was because of the inconsistencies in service and serving sizes.  One time I visited there was a nice portion of meat, add ons and the staff was very courteous.  On my most recent visit, I had about five small pieces of chicken in my bowl and the person was very stingy with the add ons.  They also seemed like I was bothering them to be there.   Overall, not a bad place and I mostly enjoy my experience and the food.  I just wish that there would be more consistency in the amount and quality of food and the level of service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VTEyUzzH92X3w-IpGaXVA"
  },
  "Q7BGiWog4ILUIoJTB12OOA": {
    "date": "6/21/2019",
    "text": "This place has been here but I've never noticed it until a few days ago so I definitely had to try it. The concept is very similar to chipotle which is you build your own but for greek food. The food wasn't bad but they didn't have beef as an option the day that I went. It's a great healthy option but it doesn't taste as good as some smaller pop and mom restaurants. I built my own bowl which was good but the village salad did not taste as great as I had imagined it. However, you must try the greek fries though! They were sooo good!! As for dessert, they didn't have much left so we didn't get any. There's plenty of indoor and outdoor seating which is always a plus.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fCYdaWSMIsGijy3b8Gln9A",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Greek fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fCYdaWSMIsGijy3b8Gln9A/o.jpg"
      },
      {
        "img_id": "LwEZHsIYVZcw49I_ZyOc3A",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Build your own bowl",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LwEZHsIYVZcw49I_ZyOc3A/o.jpg"
      }
    ],
    "user_id": "gmCK2ARSx22S_4_RQF9Jwg"
  },
  "1FExiu9SP0IXtEWPT_yWvw": {
    "date": "12/4/2018",
    "text": "Placed an order online for pickup. Had a bowl with extra grilled chicken and Greek fries. It was delicious! Not only was it prepared correctly but napkins and plastic wear were provided. All you need to do is go right to register to pick it up. Skip the line! I ended up staying there to eat it and while there I witnessed one employee offering to help a pregnant woman carry her takeout bags to her vehicle. It is not often that you see that type of service.  Great food and service! Check them out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bKOYANgdvfYhREXvobNvIA",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Greek fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bKOYANgdvfYhREXvobNvIA/o.jpg"
      },
      {
        "img_id": "tiWhxUTnQpbmIo4u1wGsqg",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Bowl with spring mix, extra chicken, sauce on side.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tiWhxUTnQpbmIo4u1wGsqg/o.jpg"
      }
    ],
    "user_id": "T_mcCDS5mfVfGkYX799aBw"
  },
  "L30zw6RZX8vB83BbN7Cfkg": {
    "date": "10/1/2018",
    "text": "Think chipotle for Greek food...and yummier! I love getting a salad with lentils and chicken. This is one of the few places that are healthy where I can go, feel full and still feel good about what I ate. That's quite an accomplishment in a city that is known for putting fries on salads.  PRO-TIP: ask for fresh lemon; it makes everything brighter.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W0qebqdYypRAuDRgHM5jwA",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/W0qebqdYypRAuDRgHM5jwA/o.jpg"
      }
    ],
    "user_id": "JycRhQNd4qKb9cJkVQ07cw"
  },
  "wQvOYRIlEYmbqEYvxUhbuw": {
    "date": "2/14/2019",
    "text": "Convenient location right in Market Square, with fair prices. The staff is very courteous and helpful. Not crazy about the food though. Tried the hummus last week and it was a runny consistency. Today opted for wheat pita with traditional gyro meat, tzatki sauce, tomatoes, cucumbers, and feta. The pita tasted really sweet and the meat wasn't very flavorful/savory. Not a great gyro by any means. Time to go back to Mike & Tony's.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Uw-Hahkspwy-EOwrxZJ72Q",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Uw-Hahkspwy-EOwrxZJ72Q/o.jpg"
      }
    ],
    "user_id": "QuLMz9jLUPTCM4OX9VBIHg"
  },
  "dAWegJahVJTmEeFRRxuLyw": {
    "date": "2/6/2019",
    "text": "Stopped in here for lunch today. It's a cute little spot right in Market Square with indoor and outdoor seating. This place is like Chipotle for Greek food because you can customize your pita or bowl. They also have standard menu items in case you don't want to customize your pita/bowl. I got a chicken gyro bowl with salad greens. I topped it with garlicky green beans, banana peppers, \"village salad\"( cucumbers, tomatoes, and onion in an oil and vinegar sauce), and taziki (sp?) sauce on the side! All of the ingredients were fresh and flavorful. This is a great place to go for healthy options. I will definitely be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "38ZZVOdQjnyEU0OL1GScyw",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States. Create your own bowl",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/38ZZVOdQjnyEU0OL1GScyw/o.jpg"
      }
    ],
    "user_id": "K515IDRsyrZskeKl0ydtYg"
  },
  "1vAI45mqLlFdyxcYIsTzYQ": {
    "date": "7/28/2019",
    "text": "Service was fantastic! As a visitor, I had never been. The ladies and gent working the day I was there were so helpful in discussion options! I liked the ease of ordering and then relaxing outside while I waited for me food. The biggest plus for me was that I could pick what I wanted on my gyro and it was amazing! When I visit Pittsburgh again, I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cRxrIo0Wm-yO8O09Cj2ILA"
  },
  "yYBgcR8AoC2YGqp1UgeOSQ": {
    "date": "8/19/2019",
    "text": "Place was average at best. The guy who served me was stand off ish and rude and just seemed like he was hurrying me up to get me out (meanwhile there was no one there except me.) The young lady at the end was very sweet and nice as I payed for my meal. The fries were honestly some of the worst I've ever eaten... they were sooo greasy and flavorless I didn't even eat half of them... I ended up just throwing most of them away. The gyro itself was average. The guy put so much freakin onions on it every time I took a bite I got a mouth full of onions. Probably wouldn't eat here again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_YtQn70FoYRpSl1uT1yESQ"
  },
  "C0X4_zMaFzh-KWdqDq2IUQ": {
    "date": "8/2/2019",
    "text": "I work a few blocks from The Simple Greek, and today was my first time eating there--and my last. A friend recommended we order online and then eat-in because she was pressed for time. When we arrived, the orders were ready and the wait was minimal. I had ordered the traditional gyro meat on a base of lentils. I was surprised that I could add shrimp--I love shrimp--as an extra protein, so I added that. I received a bowl with no gyro meat. So I went back to the counter and asked for the meat. I was given the meat. I bit into the shrimp. It was so overcooked and flavoreless, it was inedible. The lentils were undercooked. The garlic green beans were cooked to mush. To say I was disappointed is an understatement. I won't go back. There are too many good lunchtime options downtown, in Market Square and beyond, to settle for low-quality food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9wesrqrMS0PKwMBOZDobfg"
  },
  "JEB-vLM8IsqH6tzPE8PEWg": {
    "date": "5/7/2019",
    "text": "Great lunch spot with plenty of outdoor seating and located in the center of market square. Bowls are the best option as you can get a mix and get a half pita on the side. Generous portions of meat and you can add as many toppings as desired",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kv3uj1tYwr7sxoDCquc38g"
  },
  "eukE_afMO0anNDcC4djnUQ": {
    "date": "7/30/2019",
    "text": "My most recent order from here was very unimpressive. I got two of my usual favorites (a side of garlic green beans and a side of lemon potatoes) and I wanted to try a side of the new Mediterranean shrimp. I paid $4 to receive five very small and over cooked shrimp. The garlic green beans were lacking in flavor and the lemon potatoes were submerged in oil. I'm pretty disappointed in this lunch overall and this used to be one of my favorite spots.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "diXzVCsE-M8pptiGw8IMEA"
  },
  "Opc3qoCh3aQdNUn8lVP3ig": {
    "date": "7/18/2019",
    "text": "I was so happy with The Simple Greek. Everyone was efficient and kind and the food was wonderful. Great atmosphere for people watching. I would come back here in a heartbeat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m-YeiKO58BQO5LBBjKWkMA"
  },
  "B_o0XvhomtUoLcYpgURojw": {
    "date": "8/4/2018",
    "text": "My friend described this place as \"the Greek version of Moe's\" which is a great way to describe it. It's fast food but the food is all fresh and flavorful and it's build your own which is awesome! The staff was very nice and patient while I was ordering which was helpful for my first time being there.   I got a wheat pita with chicken gyro, spicy red pepper sauce (my favorite part!), lettuce, cucumbers, olives, and feta. It was delicious and filling, I couldn't even finish the whole thing. I will be going back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "suGyAnfEjZo52DxaKbDD7Q"
  },
  "BRZruqJtokb2NK_O7wDgDg": {
    "date": "11/21/2018",
    "text": "I expected better service from the employees here, they were very rude when I picked up my order and on top of that by the time I picked up my order it was cold.  I have been to Greece before and the food here is more like Greek fast food not very authentic.  Food is also a bit overpriced and the portions are small most local Greek restaurants that I have been to give you large portions. Very disappointed with the quality of food and service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W40B1zLVNT8dnNZQt90mpw"
  },
  "mFWa9UUKtI1vp0a4b1ByKw": {
    "date": "4/25/2017",
    "text": "Nothing like a gyro to brighten a challenging day!   Greek food has always been my #1 favorite.  I have always wanted to check out the Simple Greek but anytime I've been \"dantahn\"   they are about to close or all ready closed (close at 7).  Simple Greek is no doubt a Greek food lovers palace !! Build your own bowl or pita - with your choice of meat, toppings and even sauces people!!  Everything was so fresh and could barely finish the gyro I ordered... it was big. The staff is super friendly too.   Two different types of fries offered- Greek and Fresh cut fries!! I just love that!    It was pure ouranos!!!    You can buy beer and wine there too (limited availability in the fridge case) Theres so much more The Simple Greek.. I totally recommend. 5 stars easily ...  I cant wait to go back and try something else..                       Efharisto  \"the Simple Greek!\"",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "FVj-DZpWwbZvwnkT-L6_Yw",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FVj-DZpWwbZvwnkT-L6_Yw/o.jpg"
      },
      {
        "img_id": "XOeokEKKAOuBPmEmNl7R_w",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XOeokEKKAOuBPmEmNl7R_w/o.jpg"
      },
      {
        "img_id": "cQxNJllcgNnS4qwjbRK78A",
        "caption": "Photo of The Simple Greek - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cQxNJllcgNnS4qwjbRK78A/o.jpg"
      }
    ],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "49PKufWyO8uriJB5NptzBA": {
    "date": "4/1/2019",
    "text": "I really enjoyed this place. Good sized portions with the regular bowl. If the meat portions were bigger, I would have given 5 stars! You can mix and match the bases, meats and toppings. Staff was very friendly. Would definitely come back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kqizZoa-mu7oweHWEtCtFA"
  },
  "3PETSIcD4iTQSTaczn5iNA": {
    "date": "8/3/2018",
    "text": "This was my first time eating here and I will definitely be going back. I had no idea how the ordering process worked and the work staff was very patient and helpful. I got the lentil bowl and with being able to add a bunch of sides made it a very large 1 meal or 2 normal size meals. My only knock is there was slightly to much sauce on it, but that's a minor issue.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rVLTC95ZV7yCmbQbSVdX1w"
  },
  "XjlM8DwjrZNWBxg1rgv64A": {
    "date": "4/13/2019",
    "text": "Super fast for a quick lunch. The traditional gyro was very tasty. I would recommend this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "46aavKhxsuPHbj3xj4daBg"
  }
}