{
  "wQPcACswon0ChNileFUBhA": {
    "date": "4/15/2011",
    "text": "We were in Pittsburgh on a family reunion two weeks ago.  My wife and I wanted to try some of the local restaurants and stumble upon Jimmy Wans.  The restaurant looked interesting with a great decor.  The staff was very responsive and the service was good.  Unfortunately, the food missed the mark.  For the starter, I had the wanton soup and my wife had the spring roll.  Tasteless, similar to Glenn C. opinion.  We had already ordered the entrees - kung pao chicken and  szechuan beef  -- They were large portions but again tasteless.  The Staff tried to help, but they were not the problem.    We talked to other at the reunion later, and were total the Fox Chapel restaurant was new in the chain and that it had some growing pains.  Maybe it will get better after they \"season\"  the chef.    After eating int the Strip District, this just didn't cut it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "jstPDQ20nfuLlCJTAmV2WQ"
  },
  "0_sqrM9uYYDkS7CEvldJ1Q": {
    "date": "5/24/2014",
    "text": "Absolutely the *best* Chinese food in the city! The sushi is amazing as well... we have always been treated well and had a great experience! Would recommend to anyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WHNKL8iYjFrS801fABew-g"
  },
  "Ck1smIZ7cWM_ztT5gA6lTA": {
    "date": "4/7/2013",
    "text": "\"OVER PRICED AND MASS PRODUCED\" We had a bad experience at Jimmy Wan's restaurant at Freeport Rd. It was  like eating at  a fast food restaurant. They took our order and immediately brought the food to the table before we got our drinks. It was a 15 minute meal.  We complained to the owners.  They were not concerned and never apologized for the bad service. The food here is MASS PRODUCED. The food is already prepared; that is why they bring it right away to the table. It is also overpriced. We won't go back.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "105c-Rv42eIf7Zm3GbOcoA"
  },
  "K-Xj5HYLiynx2EVM27R28A": {
    "date": "2/2/2014",
    "text": "My boyfriend and I were really in the mood for a better than the fast food version of Chinese food, so we opted for Jimmy Wan's. He'd been here before, but it was my first time. It was around 9:30 on a Saturday night--over an hour before close--and the workers seemed annoyed that we showed up. Our server was lackadaisical and rather inattentive. I ordered the seaweed salad and General Tso tofu and, despite the tofu being a little cold, both were VERY delicious. My boyfriend opted for the dumplings and the sushi-shashimi and was pleasantly surprised when he got one dumpling more than he was expecting. Huzzah! The food was great but the service was terrible, as our server didn't refill our water until he brought the check. I'm eating my leftover tofu while typing this, thinking \"I'll give it another shot\".",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mYn168r789uidfdLbbmtbg"
  },
  "ivr2dZQOERbq70R7CIBeTQ": {
    "date": "9/21/2015",
    "text": "Jimmy Wan's is a comfortable, sleek and beautiful restauraunt with great decor. Like most, I'll say that they're slightly overpriced, but the options of food and drinks (both alcoholic and non) are a very rich spectrum. I wouldn't go here regularly. I ordered the General Tso's, and asked them to make it ludicrously spicy, as much as possible. It might be my seasoned (burnt out) taste buds for spice that couldn't really appreciate what they put on it, but I picked up no spice from it at all. I've been there multiple times, and the service is a hit or a miss, but more times a hit. Neither of these downsides are enough for me to rate it any lower than a four star, so consider it a high four, almost five stars. I recommend this place majorly for the atmosphere and experience. A great place to take your signifcant other on a date, or to take a large party where they have a massive amount of space for just such a thing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IwX2R4oEEysK3kEI_FSetw"
  },
  "ApxIyQai1LGTr-YyOxNqpw": {
    "date": "5/2/2011",
    "text": "Traveling to Pittsburgh for business and this was right by my hotel.  Menu and ambiance reminds me of PF Changs but I thought the food was better.  Had the lettuce wraps and general's chicken.  Both were outstanding.  I will definitely be back if my travels take me that way!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hK6yIxs_JAE-l2swKVf-Kg"
  },
  "rpysfwuAtskU1mlEO6cl5w": {
    "date": "8/6/2014",
    "text": "Came here for sushi, I would have to say its the worst sushi place I have ever been too. Service wasnt great at all. This place is very over priced. They charged me 44 dollars for sake, Which I thought was the most I have ever spend on 250ml of sake. I would never go back to this place. I would never recommend this place to anyone!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "-uOdhwWe9CCoAitS_UeWMg"
  },
  "WoOLaoIr47nMuzMvtK4tOQ": {
    "date": "6/26/2010",
    "text": "My girlfriend and I went here because we were looking for a place near Pittsburgh that served Dim Sum. We got there at open on a Saturday and were the first to be seated. The service was excellent, and the waitress spoke Chinese to us (my Chinese is terrible but my GF's is good).   I'm use to eating Dim Sum in Philly at Ocean Harbor and Joy Tsin Lau, and I'm use to eating  (Shanghai soup dumplings) from Joe's Shanghai in NY. The selection for Dim Sum is very limited, with only maybe about 6 items on the menu, 4 variations of dumplings, 2 variations of flat noodles. So we ordered some Shanghai soup dumplings and some Dim Sum dishes.  Food taste: 3 / 5  The food tasted okay, not that great compared to the other places mentioned above. The soup dumpling was a bit bland, and the sauce for that was odd. The turnip cake was pretty good. The flat noodles with beef, and with shrimp were not very good, seems like a college student could make better dish. However, it seems like this is apparently one of the better Chinese restaurants in Pittsburgh, so I wasn't that disappointed, just glad that I could eat Dim Sum. A bonus was 25% off dimsum on weekends before 3pm.   Overall the atmosphere and service was excellent, but the food wasn't very authentic, selection was limited (for Dim Sum), and the taste was sub-par compared to restaurants in Philly and NY. If you're use to eating at places like that with a high level of authenticity, then you'll be disappointed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 0
    },
    "photos": [],
    "user_id": "fi1S9w-wAJijOi_YYlJuqQ"
  },
  "e8WENUzeErCnMr3xUgbeHA": {
    "date": "10/25/2015",
    "text": "I love this place! The food is fresh, the place is very clean, and atmosphere is quiet. Booths are very comfy. We eat here often and the food is always delicious. My favorite is the egg drop soup, the sushi and the  scallion pancakes ( they are addictive). I highly recommend this eatery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8nikABrTLHDh4IaQ2PpevQ"
  },
  "2VpUAdTrspzEN1uqU5zxWg": {
    "date": "8/9/2014",
    "text": "Diffident waiter, over salty and over sauced food, over cooked soggy vegetables. Careless and sloppy presentation.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "aTgubK2Qfwpogd4tKrchqA"
  },
  "raaqzm6AL3215m9YAd7pSA": {
    "date": "4/10/2013",
    "text": "Best General Tso's Chicken in the valley. Higher priced but you get what you pay for. Love the option to get all white meat and brown rice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "47V6bqSU_3aQzzFrW6Y9Tw"
  },
  "SLU9hO1acOuin8cHhaPKxg": {
    "date": "2/25/2013",
    "text": "Jimmy Wan is an interesting place.  It has some of the best dumplings and noodles around.  The atmosphere is funny with white table cloth's, etc.  If you grab a spot in the corner, its not too bad. The drink menu is nice with a great beer selection, local and imported.  I would recommend this place if you are hungry for dim sum, especially since there are not many other options around.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zlTw3kIe7UcFk831WBRIXw"
  },
  "93dvjjZdteZKVmK7SWpNkg": {
    "date": "1/18/2010",
    "text": "My wife and I specifically went to Jimmy Wan's to try the Shanghai Soup dumplings.  We had been to China earlier this year and had some unbelievable eats; so we came here hoping to find something close to the what we had in China.  Let me just say that we were pleasantly surprised and since our first visit we've been there three more times.  The dumplings are about 50% larger than what we had, but the taste is very close to the original. You'll find that you may need more than 2 bites to get them down.  The Jimmy Wan's House dumpling is also quite good.  If Dim Sum is what you're after, they offer 25% off on the weekends before 3PM.  If you like Sake and Sushi, you won't be disappointed with the lengthy Sake list and fresh sushi.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Q-gQdK0kiK7GF905w8tMw"
  },
  "irQp9oJkPmbYUMX9bvLftw": {
    "date": "11/22/2010",
    "text": "Was passing through Pittsburgh and decided to google dim sum restaurants Jimmy Wan's came up so I decided to try it.    I am origianlly from NJ have been to most of the dim sum places in NY Chinatown, and now live in Chicago.   I probably do dim sum at least twice a month.    First impressions,  it was Saturday about 12:30 in the afternoon,  two people at the bar.  four people in the dining area.  That should have been my clue to turn around and leave.  Most Dim Sum restaurants that are good have a wait list on a Saturday afternoon.   Ok checked out the menu and they only have about 8 dim sum items.  The two typlical items on a dim Sum menu  Hau  Gau (shrimp dumplings) and shu mai.  pork dumplings.   one of order of each  14.00 yes not kidding.  Were dim sum smaill 2. 50 to 3.00  Jimmy Wan charges 7 dollars.     Me, a dim sum nut decides to order anyway, take out for the road.  took 20 minutes to get my order.  Shrimp Dumplings.  Skin was like rubber.  I make these and they use too much tapioca flour.  Also it was over cooked.  and there where shrimp shells.  The pork dumplings.  (shu Mai)  if it could be tough it was.  No flavor.  The colored roe they put on the top bled out on to the dumpling.  If I was very upset very disappointed you would think paying 7 dollars an order the quality would be outstanding.  would not recommend this for dim sum at all.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yya4uEZhLzN3gVp09rLMtA"
  },
  "hkfzBVOYr5W8oQogrp76dA": {
    "date": "4/21/2011",
    "text": "I'm actually extremely surprised at the number of 2 or 3 star reviews. I've been going to Jimmy Wan's since August and I go at least once every 3 weeks. The key to any good restaurant review is going more than once so you fully get the idea of the whole place. The funny thing about these reviews is that this place is packed 7 nights a week. You have to wait for a table most Friday and Saturday nights; the dining room Sunday-Thursday is usually between 50-80% full. This is highly unusual for a suburban restaurant. But consistently good food and quality service is why people keep coming back.  The restaurant is white table cloth but the prices are reasonable. I've had a variety of appetizers and dishes; from spring rolls to dumplings to cold sesame noodles, crab rangoons, and scallion pancakes are all fantastic. The cold sesame noodles were noted in Post-Gazette food critic China Millman's review.  The peking duck is genuine peking duck (90% of the time you're not getting \"real\" peking duck) and is authentically delicious. I've sampled a variety of my family's different dishes in addition to my own. Here is what Jimmy Wan's does best: chicken with cashews, chicken with broccoli and hawaiian chicken. The chicken with garlic sauce is in a total league of its own; the vegetables are ample and extremely crispy, the chicken is just cooked through, the portion is huge. Now that I've been going for several months, 9/10 times it is what I order.   The fish entrees are very good and an excellent healthy/diet option too. I've sampled the sea bass, tuna, salmon teriyaki, and salt and pepper prawns. All are very good and worth the money - but the stand out here are the black pepper shrimp and scallops.  The kung pao filet mignon is good, not great. I have never had any pork entree here and I have never had the sushi here. The only dish I don't recommend here is the spicy cantonese noodles; I felt the dish was lacking in vegetables.  Overall I would recommend 3 dishes restaurant stand-outs: the peking duck, black pepper shrimp and scallops and the chicken with garlic sauce. Sit at the bar for a very relaxed, comfortable but not sloppy ambiance. Enjoy an appetizer and a drink there and then move to a table. Service here has never, not once been less than 5 stars. Perhaps what is most impressive is not the food but rather the service. In 8 months of routinely going here I've never had bad or even average service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKrXZY_OjTZ1yg7a3HH_4w"
  },
  "FmhaUQe_XO3i_buw_i13oQ": {
    "date": "12/24/2013",
    "text": "I have to honestly say they are one of the best Chinese restaurants around. The food is incredible. The black pepper shrimp and scallops is to die for. The wait staff is  pleasant and always attentive. They truly are one of my favorite restaurants,  if not my favorite. They really have one of the most diverse selections of food. Never have I ever been disappointed from my experience at Jimmy Wans.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ApdTV2qLIc02qLXEwjf1rw"
  },
  "4kT33SIr2FUtnEDLOoB7kg": {
    "date": "5/13/2011",
    "text": "One of the best asian restaurants in Pittsburgh!  The portions are generous, the service is fast and friendly, the decor is stylish and classy and the food is fresh and delicious.  The prices are a bit high, but you definitely get premium gourmet food for the premium price.  I haven't had a single thing on the menu that didn't impress me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MDeA-Gx8NScCyAdziq7IeA"
  },
  "w8rTjwxtfcOkt6nGpJSo1w": {
    "date": "9/5/2011",
    "text": "A big step up from the local competitors and distinctive decor that is as classy as the clientele. Best Asian food and venue in the area? I think so. Superb service for families and groups plus cool servers at the always busy bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VnMrXjHXV-fNf1LSkJNkkA"
  },
  "ftMHpHqdwe8PRBo5FZ-BoQ": {
    "date": "3/24/2015",
    "text": "This was my first (and last) visit to Jimmy Wan's.  I was drawn in by the Peking Duck, hoping to re-live an experience I had in Beijing. I was not greeted and waited at the host station while a person shuffled papers and took a phone call.  Eventually I just went to the bar, and the server there was very nice.  She took my order and was relatively pleasant throughout my entire time at the bar.  However, the duck arrived in record time, and it was cold and tasted old--like leftovers from the day before.   Although the skin was crispy and flavorful, it was not enough to make up for the blandness of the meat. I was so excited from the reviews that I ordered the whole portion instead of half to the tune of $45. Boy do I regret it!  I packed the rest of my dead duck up and left quietly, while the owner and host continued to ignore me as they welcomed other customers, and or bid them farewell.  Over all I am very disappointed with my experience and will not return to either location.  My search for great Peking Duck continues....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rveFLStP2lPGo-jO9-NK7A"
  },
  "0j0Iflp2C4SIdAPYnLbi8A": {
    "date": "10/3/2010",
    "text": "I'm from Los Angeles, but visit Pittsburgh frequently. I was on the mission to find good dim sum in Pittsburgh & found it at Jimmy Wan's in Fox Chapel. Before I ordered, I asked about their dim sum & the server told me that they hired a chef from Hong Kong, so it was all prepared in-house and fresh.  What we ate:  Shanghai Soup Dumplings - Delicious and this was the best. Authentic. Definitely get this!  Steamed Shrimp Dumpling - Great  Pork Shu Mai - Larger than a normal Shu Mai and filled with meat. Very good.  Cantonese Rice Noodle Roll - A small portion, but still good.  Steamed Egg Custard Buns - Delicious! Another favorite. They are traditional white round buns filled with a sweet egg custard cream in the middle. Try this one too.  The Good: Jimmy Wan's dim sum is definitely authentic and a great find in Pittsburgh.  The Bad: The only criticism is the price. Most dim sum dishes are about $2-3 in Los Angeles, but Jimmy Wan's averages $5-8 per dish. BUT, Jimmy Wan does offer 25% off dim sum on Saturday and Sundays. Even at a few dollars more per dish though, their dim sum is a great find in Pittsburgh.  There was also a 15-20 minute wait for the dim sum to arrive at our table, which is understandable since fresh dim sum is steamed right before eating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AVjXpsuVfGVRQec_xOXpRg"
  },
  "Jo3R5zNaFs-raUr2LD58aw": {
    "date": "1/19/2017",
    "text": "Went with 8 co-workers after a meeting. On the way to dinner read the reviews noticed some service concerns. However this was a great experience. Not only was the food excellent but the service was very good. Would recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NL3sXmEyxk1ej5K22XOOug"
  },
  "aVmn8IatUd3OnGq_siLuDA": {
    "date": "3/4/2017",
    "text": "Ordered a family-style takeout for a birthday party.  Ordered for 12 but had enough for 15! Generous portions of the entrees:  beef broccoli and general Tso.  Egg rolls so big you only need one.  More than enough rice.  Very good lo mein.  Excellent 48 piece sushi platter.  Can't wait to have leftovers for lunch tomorrow!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "49GkAEkcq0P-my4z9jJ13g"
  },
  "__vCLulNjv6N7ZXf_L6htw": {
    "date": "2/15/2015",
    "text": "The ambiance is great compared to other Chinese restaurants. I got the egg roll, General Tso's and hot and sour soup.  It was a solid meal, but definitely overpriced.  I doubt I need to come back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "YTuksHb6YsMI62BqEG_eRA"
  },
  "IhocpOwZ1DqTVr_1BFycYg": {
    "date": "7/29/2015",
    "text": "Love Jimmy's. Over priced , but I will pay for it any day of the week. Jimmy Wann used to own Tai Pei back in the day, and started his own gig which has been terrific. Such high quality dishes and options, just a memorable time whenever I enter Jimmy Wanns in house or for delivery ! Steamed and fried dumplings INSANE. Lettuce wraps, and chicken and broc all day!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y-wZ6OfqZfRqNwp1wKiu6w"
  },
  "aoNnaOx0mY0AS2wPNN7_cQ": {
    "date": "1/19/2013",
    "text": "Likes...very good sushi, love the dim sum/dumplings and mixed seafood.  Also has a great bar and clean.  Knocks...pricey, stuffy upscale feel",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "JEfQk9SVGmPGSjNlBkyJaQ"
  },
  "HUytGq5Ys2W5IaY-PYUCaQ": {
    "date": "12/6/2014",
    "text": "Very underwhelmed. It's overpriced Chinese food that isn't even that good. I got the Hawaiian chicken which was pretty much chicken tenders on top of their sauce. Everyone in my party admitted to their meal being bland. I can get better cheaper Chinese food without their white table cloths and high prices. I did enjoy the ambiance and the service, so that's why it got 2 stars. Regardless, we won't be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "eYnS0WVYYykN_gRuMUzoOw"
  },
  "a5NpDD2Z4Fqbm8uxt4cr6A": {
    "date": "8/6/2014",
    "text": "This has to be the worst sushi place I have ever been too. Service was horrible i would never go back to this place. Everything was way to overpriced for the quality of the food",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 10,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZmPhJdfastWNW82rGGD7VQ"
  },
  "kUCxg5Lzv0KNMNJYeWL2WQ": {
    "date": "10/19/2014",
    "text": "Great ambiance, decor is hip and well designed. Food is nothing special, tastes like every other Chinese restaurant that I have been to. The first older woman who came to our table was less than friendly, actually made us feel unwelcomed. Younger male waiter was friendly, but he kept getting yelled at by the older woman, so that threw him off his game, I think!  (All because he didn't ask me for my credit card for the $30 deposit for my Moscow mule copper cup!)  Drinks took forever, food slow.  Don't go out of your way to get here!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "70sSlkooEgL_TEjWDQbr3A"
  },
  "6GJHuRPFZm5JmfkaK0Srww": {
    "date": "1/31/2014",
    "text": "Tried jimmy wans for the first time a few months ago and have been back twice since. It's really good Chinese food. Love the general tso and beef with broccoli. Did not like the crab Rangoon but really like the fried dumplings and order them every time. I will say its pricey- about double what you'll pay elsewhere- but it is better in my opinion (which you all wanted- right?) Service is a bit over the top and I get slightly annoyed with the \"yes ma'am's\" over and over again but they are efficient and we had everything we wanted when we wanted it. Beer selection is just ok. Haven't tried any of the mixed drinks. In conclusion go there. Prepare for sticker shock. Ignore it. Enjoy.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "UwV6jBuTR1S9acT6bPTBPw"
  },
  "y4VC3sfoQpr7K7tbRfDSow": {
    "date": "11/29/2014",
    "text": "If Chinese food can be a comfort food, it doesn't get any better than Jimmy Wans.  One of the better egg drop soups I've had.  What keeps me coming back is the chicken with black bean sauce, the veggies are crisp and fresh and sauce is out of this world.  Definitely my solid go-to restaurant for just about any occasion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tZTjzTI562CGEq9CJn5YNQ"
  },
  "R29UaLU1gbumuEHGUl7NSg": {
    "date": "8/1/2016",
    "text": "This place is absolutely unbelievable!  Moved out of town for a few years and moved back to the Fox Chapel area and was very unaware for months that this place even existed.  But now after my first 10 dining experiences here I will never be able to go anywhere else. Thank you BV for letting me know this place existed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OteNLIWQvX-cbnhBoe-Ajw"
  },
  "iXO6qP4zgMgc3ufZdHHIPg": {
    "date": "4/12/2016",
    "text": "When I walked into Jimmy Wan's restaurant in Fox Chapel with a party of 3 on Sunday, April 10, 2016, the host looked at us as if we were aliens. Not sure if it was because of our \"dark skin\".  I put up 3 fingers and without saying a word, he lead us to a table, placed 3 menus on the table, and walked away.  The first waiter, named Paul, (I had to ask him his name) who was neither personable or friendly, came to the table and asked us what we wanted to drink.  He brought us our drinks and proceeded to tell us that he was going on break in 12 minutes.  It was a good thing that we knew what we wanted to eat, albeit we still felt rushed.  He took our order and we didn't see him again until it was time to pay the check.  In the meantime, a female waitress brought out our meals which were delicious.  The egg rolls are out of sight!  During our meal the three of us talked about how we would never patronize this restaurant again nor recommend it to others.   Then another young man who was a waiter, named Tin, came over to our table to see if we were enjoying our meal and to find out if we needed anything.    He did this SEVERAL times and was very accommodating and even joked with us.  I told him that he was turning a bad experience into a rather pleasant one.  At the end of our meal, he brought us our check and I gave him my credit card.  I then noticed that the first waiter Paul had returned from his break.  Tin then came back with the receipt which I signed.  Instead of adding the tip to the receipt, I handed Tin a 25% CASH tip at which point he said he was going on break.  I did not want the first waiter Paul to have any part of that tip because he was not friendly. As we were leaving the restaurant, Paul had the audacity to come running out behind us asking why I had crossed out the line on the receipt for the tip.  I told him that it was because I had handed the tip directly to Tin.  As previously mentioned, the food was delicious.  However, the service, with the exception of a kind waiter named Tin, leaves a lot to be desired.  5 stars for food.  2 stars for service!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "F1jwIMfR3uR00dSxbQridw"
  },
  "eJJymiOgRM-vrx2YEobaPg": {
    "date": "7/25/2016",
    "text": "Best Chinese restaurant in Pittsburgh and the best restaurant in the Fox Chapel area. I've been coming to Jimmy's restaurant for over a decade now and will continue to do so. Great for dim sum and appies. Sesame noodles, chicken lettuce wraps, dumplings, etc. Don't forget to ask for the hot tea (it's free).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NXvAkoovxXcFKQbSRlzVLA"
  },
  "QFlHCJNhaz4Pl0HB05LRLA": {
    "date": "6/8/2014",
    "text": "I have to say it did not disappoint. For appetizer we ordered the black pepper calamari it was a very generous portion and it was well seasoned. We had drinks, my sister had a special drink which was milked based she loved it. I ordered a Long Island Ice Tea, it was not good,it  lacked liquor. For our entrees I ordered shrimp, chicken Singapore Mei Fun. It was so much food I could not eat it all. It was tasty too. My sister ordered the half duck entree she said it was delicious. All in all we were happy!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vUyr0O72btWjs1HqZRc4EA"
  },
  "0uaXEsqSz45cuxbSGXSjjA": {
    "date": "1/30/2016",
    "text": "Spent a couple weeks in this area and tried Jimmy wans. Incredibly friendly service. They even learned my name. I've tried a few items between dim sum and sushi. All very good. Favorites would be the shrimp roll, pork bun and volcano roll. I cannot find any validity to other reviews I have read.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l33BzuCZQMMGBscG6CGNfQ"
  },
  "S8v7Qge4iQ2lnKFdYalMxw": {
    "date": "12/28/2011",
    "text": "Solid slightly-upscale asian fare. I went for sushi and was pleasantly surprised by how legit it was.  We sat in the bar area which had a nice atmosphere, and the service was great. It's in a random spot, but worth getting to as non-greasy-gross asian food is always a plus.  Looks kind of like a PF Changs knockoff from the exterior, but was pretty classy once inside.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "EpZFiJxo6RO8a6QwDwC7TQ"
  },
  "pPZMb3-9FXfve5f5t0vKUw": {
    "date": "12/26/2013",
    "text": "Meh. First time we've had Chinese food that was just...meh. Little flavor. I had the Moo Goo Gai Pan and my wife had the sweet and sour chicken. Her was watery..thin.  We both added salt.  Waiter was lackluster as well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2FXeCdOBkYxu20_hqU9vrg"
  },
  "0-3E6F2FcNXp2IHxQza0fw": {
    "date": "3/11/2011",
    "text": "My wife and I recently had lunch at Jimmy Wan's.  The restaurant space is very nice and trendy-appearing.  They have a lunch special that comes with an egg/spring roll or soup (which has an extra charge).  I had the shrimp and scallops and my wife had the sushi roll lunch special.  Although the service was fine, the food was virtually flavorless.  It was extremely unimaginative and pedestrian, even for \"American\" Chinese fare.  I have had more flavorful food at the food court in the mall.  This place isn't cheap.  Lunch for 2 with only tea to drink ran us up to $40 with tax and tip.  It is a terrible value.  I don't know why anyone would ever come back to this place after eating here once.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 9,
      "cool": 1
    },
    "photos": [],
    "user_id": "9VDrCkfj0I_MDSDPgsPKFA"
  },
  "ZhYUYz1Rh6zF3Tnn_CAENQ": {
    "date": "12/2/2014",
    "text": "Best Chinese food in Pittsburgh!  Hands down the best Chinese food I've ever had. Great sushi, in addition to other food as well. Steamed shrimp dumplings are my favorite. Service is excellent - extremely polite and efficient. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6NqwPd5YG49GdpCj_CkQjg"
  },
  "VujVRFwz7eujNeW3deTEvQ": {
    "date": "10/12/2014",
    "text": "The food was good, better quality than most other Asian restaurants we have been to in the area. The service was nothing spectacular. Our waitress came back twice Ina 45 minute visit. The really odd part was the host or the older gentlemen seating people. When they felt you should be done, they made it very obvious that they would prefer that you move on and free up a booth. That made for a very rushed and uncomfortable date night for parents of four kids that rarely get to go out alone.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fdOuL1XobFQKq4bFORwInA"
  },
  "e47qZTX6_8hApEe6Wbs42A": {
    "date": "1/1/2017",
    "text": "Carefully prepared Asian fusion cuisine made with high quality ingredients. Service was attentive without being annoying. Interesting cocktail selections with premium spirits and fresh squeezed juices and house made syrups. I loved the seasonal sangria.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Gn73kaYwzYl5_LiEm4big"
  },
  "30YuUP5aeh8RZCWBZ5r_hQ": {
    "date": "8/26/2016",
    "text": "I guess we shouldn't have had high expectations for good Asian food in Pittsburgh, but my wife and I were pretty unimpressed.  The food was a bit too oily, the roll she ordered was very small (but good; fish seemed fresh).  Maybe we've just been spoiled by too many great Asian fusion places on the east coast.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qhhz9UDHVugyDx40_mL1tQ"
  },
  "i_4rsRrPGPfd64pjCkUFSw": {
    "date": "6/28/2015",
    "text": "This is the best local Chinese food. I highly recommend getting the chicken general tso's. The food always comes quickly and there is usually not a wait in my experience. It's not cheap but the quality is good and the portions are generous. Usually I end up eating a few different dishes family style with my table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lsLuVKmdh45yommr53zfRg"
  },
  "-la_WYbAbTb-yEdnhgsHUg": {
    "date": "8/1/2016",
    "text": "Great atmosphere and a great Friday place for happy hour.  The food has always been great and I think they have one of the best lettuce wraps in the city.  I had Greg as a waiter and he was pleasant, knowledgeable and served us with a smile.  I took my nephew here for his first experience of pan Asian food and he loved it.  He thought it was very fancy and loved the bigger dining area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AxFluVrPUVN0pPBX7LD--A"
  },
  "Fb8rJGTGx3wLu7Pb8na5mQ": {
    "date": "4/12/2016",
    "text": "I've been going to this place since they opened (the owners had a restaurant nearby before they moved to this location--I liked their other restaurant, too.) I often order sushi here, it's always very fresh. They have quite a few selections of sushi, but we usually order the spicy tuna roll or rainbow roll. Both are very good. My current favorite is their Chirashi--thick slices of fresh tuna (I get the big eye tuna) over either brown or white rice. Heavenly! Their Chinese dishes are some of the best Chinese food I've had anywhere. The beef with broccoli is amazing: tender strips of melt-in-your-mouth beef with just enough sauce to flavor the dish but not overwhelm it. The Peking Duck might be the best choice on the menu. The skin is crispy, and although it's very moist it's not a bit greasy.   I hosted a Chinese New Year dinner for my daughter's six friends who are exchange students from China. I ordered take-out from Jimmy Wan's. They each chose food from the menu and we brought it to the house. They loved it (and no, they weren't just being polite--they are willing to diplomatically share their opinions about Chinese restaurants). If six Chinese teenagers approve of the food, it must be good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RI_oOkpJXxfzR-WOChqy6g"
  },
  "8aQ55SzdZz8S1y1CZoyRLA": {
    "date": "11/5/2014",
    "text": "This is by far the best Chinese I ever had. It's a little pricey but worth every penny. I been going here for a couple of years now and I haven't had anything I didn't like. The general tso's is great. I recommend any of the beef dishes. The beef is so tender. The sushi is good. The have great happy hour menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mNy3YPlyaOsD6FDUtU7mxA"
  },
  "Rz1uH0w5lVzNA_CcaWh46w": {
    "date": "7/6/2016",
    "text": "I saw on this Pan-Asian restaurant's website that you can make reservations, but we did not need one. The restaurant was mostly empty when we visited for a Saturday lunch. It is a bit more upscale than many others, but dress code is casual. The teriyaki chicken-on-a-stick appetizer was very moist and tasty. The crispy shrimp entree was soggy. My tangerine-orange filet mignon tasted odd. My ginger salad appetizer still had not arrived after I received my entree, so I had to ask for it. When the salad was eventually brought out--with no apology for being very late--I saw that it was a large size, but I did not care for the taste of the ginger dressing, which I really like at other restaurants. Waitresses gave us drink refills and brought our bill promptly. The bill was $60 including the tip. I would be willing to give this restaurant another try, but it needs to make some improvements.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FW5F5QzzMoeRdIib1OyNOw"
  },
  "llJoeD9L7ZpxXvUyFFA3zg": {
    "date": "10/23/2014",
    "text": "This has to be hands down one of the best Chinese restaurants around yes they are a little pricey, but first class the whole way also I recommend trying their dim sum. Also for cost effectiveness I recommend going for the lunch special.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "La-cYx2F5J6HL3mQwW-byA"
  },
  "JQt7WzICdPf6iRrp1LX9sg": {
    "date": "3/1/2016",
    "text": "This was a great place for a family meal. We had rainbow fried rice, general tso's, mandarin chicken, sushi, and potstickers and everything was gobbled up quickly. Rice portions were on the small side but other than that, I'd go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NxcVQ-4RPz9diNO9xCAiiw"
  },
  "w0Xt3UhWolT_Y_6zqVvgQA": {
    "date": "12/28/2013",
    "text": "In town for the holidays and this place was high in everyone's list. Ordered for delivery, and the very nice women who took the order assured me this was the biggest take out order of the night. We were feeding 10, so it was several hundred dollars. I specifically asked for chopsticks as well as a few order mods(extra spicy, no wasabi, etc). All the modifications were missed and NO chopsticks. Was provided a full pint of spicy mustard and duck sauce (ridiculous). Not trying to be a pain, as it may seem minor, but it's their job to get it right.  Several of the locals commented the owner doesn't care about this type of complaint and he's the only \"real\" Game in town. Final bummer was the Food was average at best. $3.50 for 1 egg roll?  Really?",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "SqWkVJ3mQKuVpTuhnv5Bfg"
  },
  "EuSXd83zUZzbLy1oBQa_Uw": {
    "date": "6/9/2017",
    "text": "Love the food at Jimmy Wans. The service is a bit slow, but the food is worth waiting for. Everything is fresh. The triple crown roll is to die for, as is the crab salad. Not a bad meal choice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9wZadkKC0xWtwjsAOCgpEg"
  },
  "oWgBv22_oD2axsI7sPOADg": {
    "date": "9/24/2015",
    "text": "Well.....stopped last night and it was just not up to par.  Ordered chicken/asparagus and it pretty much tasted like chicken asparagus and soy sauce.. the sauce was thin and not the good sauce that I am used to at JW's.  My friend got the general tso's and it too was way thinner than normal, and lacked in taste.    The drinks at the bar were perfect- the bartender was nice, but she was far from attentive (esp since there werent many people in the bar AT all).....will definitely be back- hopefully it was just an \"off night\"",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "-PP4h-uX2XdV4EHCNO2_2Q"
  },
  "i0UksZXobpNOR8T3EMq3hQ": {
    "date": "7/15/2014",
    "text": "The food was super tasty. I had an egg roll, hot and sour soup and the General Tso's chicken.  Server was attentive and nice.  I was traveling from out of town, and it definitely hit the spot for Chinese.  I dined at lunch and the restaurant was pretty crowded.  My only complaint was the table they tried to sit me at, had a large spider web.  I would return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cOhc-WBYnkpGJppJvdPxkQ"
  },
  "HkrW9HpBpNgzFchHx-oikw": {
    "date": "8/24/2015",
    "text": "I've been here many times before and always had some great meals. However this time was different. Started off with an order of sushi and dumplings for an appetizer. It took almost 45 minutes for the sushi. And then when it finally did come out it wasn't even correct. I even argued with the server explaining that my tuna avocado roll was not the same thing as a crunchy spicy tuna roll. After arguing with him he just apologized and that was it.   Our meal however was also just not that good. The best item that we ordered was the all white meat general sows which I think they do very well there and is a little bit sweet. The server also made an error with another order regarding the tofu. They did however offer to make us another one. But at that point we were just ready to finish our meal and get going. They did also offered to comp the tofu which was nice but did nothing with the sushi error.  I think the one in Wexford is always better it would not hesitate trying that one but probably going to stay away from Fox Chapel for a little while.  The worst part of the experience was the entire next day. I was sick in bed all day the next day with stomach cramps which I'm guessing was from the sushi. I was the only one out of our group that had sushi and within one hour after eating the sushi was not feeling well.  The service there is just not match the cost of their meals. I feel that at that price point you should be getting much better service.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "R2WPxxtYsVeODrJexPVpww"
  },
  "QtjHIzh_ZNg9TflXnJ6SYg": {
    "date": "4/17/2016",
    "text": "Excellent food, great service, friendly ambience.  Favorites are filet in orange sauce, walnut shrimp, Mongolian beef, and basil chicken.  Hot and sour soup is best this side of Beijing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M_QPzwgrSWaD_K-gESQNjw"
  },
  "JaAVOG-OoVCKfHjJKINqsg": {
    "date": "5/17/2013",
    "text": "Soy allergy update: After learning I am also allergic to soy, I was afraid my chinese-food days were over. This is not the case at Jimmy Wan's. A few of the items on the Gluten Free menu are also soy free, including the Ruby Chicken and Chicken with Broccoli in white sauce. You can also get the Rice noodle dishes made with white sauce. I was very pleased with my meal after being Chinese food-less for 5 months!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "u3OCn-7UTb2g_zIRXwrJdw"
  },
  "dnMCBIYHLnMUAj10Sk7AMA": {
    "date": "2/16/2011",
    "text": "One of the best Chinese/ Japanese food places in the Pittsburgh area!  The decor and ambiance were excellent and we got decent service too.  The dishes are good sized - made for sharing. We had a lot of food (there were 8 of us) and so I got to taste a variety of dishes. Here is a review of all the dishes I tried (out of 5 stars):  Appetizer: Hot and Sour Soup - 4 stars jimmy wan's dumplings - 4 stars rainforest sushi - 3 stars fresh wonton  soup - 2 stars avocado salad - 4.5 stars!  Main course: chicken with garlic sauce - 4 stars egg fried rice - 4 stars black pepper shrimp and scallops - 3.5 stars sauteed eggplant - 4.5 stars! general tso's tofu - 4 stars  Overall - good dining experience and definitely worth trying!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "_fqINvA1SYEbqC_RR-egLQ"
  },
  "F_Ce_kqypmro9h-DnqZ9_g": {
    "date": "1/11/2014",
    "text": "Okay food. A little high priced though.   Had sushi as an appetizer. That was very tasty. The mains were a little underwhelming. The presentation of my $22 shrimp dish was little more than lettuce with the prawns thrown haphazardly on top. Then it turns out that \"Szechuan Style Shrimp\" is actually code for the typical \"Sweet and Sour Shrimp\" you see in every Chinese restaurant in this country. So I feel a little mislead. The shrimp were good tasting, but for the price I think the dish should have been something other than par for the course Americanized Chinese.  The service was okay. But it was funny that over the time we there we had five different servers service our table.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cumtfh4fq38yN3ViMN0O2A"
  },
  "NriF2fkgIvxT6CmG6s5XYQ": {
    "date": "3/28/2017",
    "text": "Jimmy Wan's has the best sushi and Chinese food!  My husband and I usually sit at the bar and we get the best service from bartenders Steph, Adam and sushi chef Alex.  Alex is creative and has us try new things.  We always leave happy and full! We will continue to go because if the great service and food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tF0ZmCaspd6Ox6g6yjCETw"
  },
  "IylCqE8niHghNQYCHlXXQA": {
    "date": "2/11/2017",
    "text": "One of my favorite places. Sushi is good and so are most  of the items on the menu. Only problem is they don't devein the shrimp in the fried rice and that is an appetite killer.  If that would become their new practice, I wouldn't hesitate to give it five stars!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MSkqGqB5BnQ6_3Oht4j2eA"
  },
  "NwzUYQ1z9XAwRfn3XKFBCw": {
    "date": "1/7/2018",
    "text": "I LOVE this restaurant - the atmosphere and the food both amazing. My favorite is the chicken lettuce wraps and the chicken with broccoli. I've never had a bad experience here and genuinely enjoy my dining experience each time I visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iPlOCAQp5EqtOqLZV34rGQ"
  },
  "yZPTFG7YFXdwIydga4sMXQ": {
    "date": "6/28/2018",
    "text": "This is one of my favorite restaurants in Cranberry.  Food is excellent and the bar tenders are great! The owner and staff are friendly and truly care about their customers.  Best Asian food in PA!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ejvm1IUoLptw_wnHC--qQ"
  },
  "N9NPnNrsMSGUJqElJ3OPCA": {
    "date": "6/23/2017",
    "text": "Food was undercooked and had no taste. Young lady at the front who took my order was very rude and seemed annoyed by my presence. I won't be back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "APAaJ70S8gChceoW5fWV-w"
  },
  "a6S6AUYrf1CXGBqu67bGzA": {
    "date": "5/13/2017",
    "text": "Best general tso chicken have ever had! The service was fast and friendly. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "t1xzosdCqaDhx3a4Cr8bkg"
  },
  "rHF3TEoIA4g_ZU6B0IHgQg": {
    "date": "2/26/2015",
    "text": "They offer an amazing happy hour special with deals on drinks and food.   We tried the crabmeat Rangoon (delicious but not our fave in the city), jimmy wan's dumplings, and spicy crunchy salmon roll. We also ordered the barbershop, which was not on special. The dumpling was the star of the show with the spicy pork filling. Both rolls were good but the barbershop had the best overall flavor. My husband felt that the spicy salmon was a bit bland.   Everything that came out of the kitchen looked delicious. We look forward to going back and trying more rolls.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ufGKLZnidvLVP1-0vI6ghQ",
        "caption": "Photo of Jimmy Wans - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ufGKLZnidvLVP1-0vI6ghQ/o.jpg"
      }
    ],
    "user_id": "SKre6GKJAA3FLgb2e875Rg"
  },
  "-biwjxx1bnpY5NMGm4R8hw": {
    "date": "1/30/2015",
    "text": "This place is great.  The service is top-notch.  I am always greeted at the door, usually by Mr. Wan himself.  The restaurant is spotlessly clean, and yes, even the washrooms are clean.  The food is well above average.  I like General Tso's Chicken, and Jimmy Wans does a nice one - chicken is just crispy enough, and the sauce is sweet but has a little bite to it.  Want more bite?  Eat a pepper!  I've also enjoyed the Mongolian Beef and the Broccoli Beef.  The hot and sour soup is both.  Very nice.  Give this place a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yVMvS4Q7JTxHALm8CTwSZQ"
  },
  "nAGu8NXJ9bPcAZRJpAK1mA": {
    "date": "1/27/2016",
    "text": "This restaurant was recommended from my co worker so I decide to have a company dinner at this location. First Of all I thought this restaurant was serving Chinese food but they also served a Japanese food as well and they called it a Asian fusion restaurant. I didn't see any fusion dishes but typical Chinese menus and sushi. Fusion ? Really ? Why ?   \"Asian fusion restaurant\" , yes I get it but they should be focusing more of Chinese food because sushi wasn't good at all. But their cheese food was amazing.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eNG-tisvgC6TmJAzMaw_2Q"
  },
  "LEwqq7MRl3S3CvAKtU9zIw": {
    "date": "8/17/2017",
    "text": "My boyfriend and I and our 20 month old went to Jimmy's wons recently for dinner. He had the sesame chicken ( it was cooked very well not overcooked and tough), I had spicy tuna( I had only six small rolls, very disappointed, my boyfriend's had a large enough portion of the sesame chicken I was able to have some), and our child had chicken nuggets and rice in the side( nuggets were a great quality grade if chicken and it was lightly breaded . Easy for our child to chew). Our waiter was very kind and teased our little one he also gave us a couple of fortune cookies for her something to munch in while waiting for dinner. I was most impressed with this! All in all we had a lovely dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ogueuHMtEl4p8EKMVzCj1A"
  },
  "uLMXK2X5_7yto1ytqcuvsA": {
    "date": "11/30/2015",
    "text": "I have been to Jimmy Wan's 3 times now once for dinner and twice for lunch (Fox Chapel location).  They offer great lunch specials at a good price point.  This is the kind of old school Chinese restaurant you love, real table cloths and napkins, the crispy chips with duck sauce and tea.  I wish there were more places like this around.  For being old school it does also have a modern flare as well.  I normally dine with my BF Michael and we get a Mr.Pink Roll and split the Beef Hu Fun or the Spicy Cantonese Noodles.  Both are excellent and enough for lunch for 2 ppl the next day.  The service is excellent as well.  The specialty drink selection also really impressive for a place like this and the drinks do not disappoint.  Overall this is a great Chinese/Asian Fusion restaurant in Pittsburgh",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "exlziNg-2I1-7JZcYPgWJg"
  },
  "NpF5reJWL2wRQnHtFBL8qw": {
    "date": "9/30/2013",
    "text": "I have been a fan of a different sushi/chinese restaurant in Fox Chapel for many years.  But continue to give Jimmy Wans a chance.  Sadly, I've come to the point that I won't be going back to the one in Fox Chapel.    Yesterday (Sunday, Sept. 29th) I placed an order over the phone for 2 sushi rolls and a cold sesame noodle appetizer.  I stressed that onions could not be included in either roll or the noodles due to an onion allergy.    Once I got home with my order, I had onions overflow, no soy sauce and my noodles had no peanut sauce on them.  I picked out onions, but my bf was not able to eat anything due to his allergy.  Sadly, the sushi tasted old, not fresh.    This is not the first time of having problems with my orders at this restaurant.  This was the third time I gave them a chance - I give them up to 3 shots...sadly, this gal won't be going back to the Fox Chapel Jimmy Wans.  However - the Jimmy Wans in Cranberry has yet to disappoint.  Maybe they can take some pointers from each other?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "WPI0YGOSA13eZ5eThfMFkQ"
  },
  "-zgXvyzx3EU8uCtA7g3Neg": {
    "date": "5/15/2017",
    "text": "Prices .. a little High .. Quality of food .. awesome ... Quantity .. Too Much .. Had Black Pepper chicken and  sweet n sour  Prawns .. amazing .. 8 Prawns ... with Rice ( of 3 Choices )  and soups ( Choice of 4 Soups) .... Fresh and clean linens ... smiling n cute waitresses ... Best n best of Chinese/Japanese/Korean/Indian cuisine .... If U want south Asian Cuisine ... visit here",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_gYppkabnCNKx2a699-_Nw"
  },
  "uD1AzkdVgUf4rznat_3PjQ": {
    "date": "2/18/2016",
    "text": "Went here for lunch on Presidents Day, was pleasantly surprised. I ordered the lunch special General Tso's Tofu, with brown rice. The tofu was crispy and really yummy, and the brown rice was sticky, just like being in Shanghai. My one complaint, was they asked on a scale of 1-10 how spicy. I asked for 10, and there was literally NO spice. NO heat, no nothing. I don't know if they assumed because I am pale white girl I can't handle it, but really I CAN.   Servings were ginormous! Both myself and my friend had more than enough to take home! And also the Shanghai Soup Dumplings were slap your momma good! I will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ztXtmGgI7l-ImgD9ewJdIg"
  },
  "M3BK3x18AltiG_-eCem1tw": {
    "date": "4/25/2016",
    "text": "I've been getting Jimmy Wans delivered for almost 3 years and I've only now finally gotten around to giving them a review. My apologies!  The good: First and foremost, Jimmy Wans appetizers may be the best I have ever had. The beef teriyaki is almost to die for, but I'd rather live so I can eat more. The crab rangoons, the spicy wantons, the BBQ pork... you literally cannot go wrong with their appetizers. They are truly exceptional and unequaled in this area.  Secondly, the entrees are well portioned and quite tasty. I prefer the Mongolian Beef or Eel Don if you're feeling a little more \"Eel-y.\" Prices feel a little high but in the end the quality of the food justifies it. The sushi selections they are offer are always fresh and perfectly prepared.  Finally, having eaten in and ordered delivery, I can happily say the staff is professional and very swift. They usually arrive well under their quoted time for delivery and rarely have they gotten the order incorrect.  The bad: As a control, I buy the Broccoli with beef at every place that offers it. Jimmys is acceptable, but far from the best in town, in addition to the fact that they want almost twice as much as my favorite places Broc & Beef. If they could master this dish, Jimmy Wans would be a solid 5/5 with no hesitation or caveat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n8yuqk8pArtQePo7qcrVCA"
  },
  "vQZfMmY21h2ZXSVfF98Epg": {
    "date": "4/2/2013",
    "text": "Like a few of the other readers, I was surprised by some of the low star reviews for the Jimmy Wan's in Fox Chapel. (Including one from someone I really trust with regards to restaurant reviews...)  All I can say is that we have never had a bad experience here. We order takeout at least 1-2 times a month, and dine in once in a while. Even though their prices are a little higher than the usual Chinese restaurant, we have always felt that the ingredients they use are better than the usual, and well worth the price. Like their ads say, Dim Sum items are really good here, and we always go for the vegetable dumplings, Jimmy Wan dumplings, and pretty much everything on the appetizer side of their menu.  Best item in our experience? Singapore noodles. We love that dish, which is packed with shrimp, egg, pork, and chicken. Definitely try it! I also love their Dragon and Phoenix,  and Mushu Chicken. Their sushi is definitely not cheap, but they have some really nice and different rolls, like the Sexy Muchacha and Barbershop rolls, which are worth a try.  We are glad to have this place so close, and will definitely continue to enjoy it fairly regularly! It's great for kids too!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "4r33dXcE1oYZxjONrhxTiA"
  },
  "YBmCks4Qtb-vywp3Zp3iPQ": {
    "date": "5/22/2016",
    "text": "the take out... take it back immediately   sushi sloppily made probably yesterday , chicken dumplings a mess without any flavor whatsoever   even the wasabi and ginger  looked old and dried out how's that possible?!   ya can't fake it with sushi either its fresh or it isn't .",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "HIFxjqFOeVBgDj0oPrtrrg"
  },
  "6hvfHC2ynXMwdbLBlsdf1g": {
    "date": "11/30/2015",
    "text": "Not bad for the what it is. Had schezcuhan beef and also some yellowtail roll as well. Roll was pretty good, beef was salty ,salty and somewhat oily. Rice was average .Server was super fun and a nice part of the atmosphere. I'll be back one more time and try something different and see if this place will sell me on the hype.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tpLWXsk3Uyx_qyxcN_tEA"
  },
  "ubdCT8TGWIDaziG9t-NaXA": {
    "date": "9/19/2016",
    "text": "Went on a Friday around 9p sat in the bar area. Before we were in ours chairs the waiter was on us asking for a drink order. Wife ordered a glass of red wine and I a beer from drink menu. Drinks came, took our food order. Literally One minute after food arrived waiter checked back to see if everything ok. About 30 minutes go by and I'm looking for a second round of drinks and some extra rice. There was plenty of staff behind the bar, but no one would look at us. Thinking its almost 10p. They must want us to leave. I flag a bus boy down 5 minute later later and have the waiter bring our check. Wife pays and we leave dissatisfied. I look at bill once home and realize glass of red wine was 26$. Never saw that on drink menu. Called to complain and was told Jimmy would call us back. Never heard back. I'm done spending my money there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MseZx00kQHCzbXPTlMMjOA"
  },
  "3coJl1f-4n4_y_cO1rpiPA": {
    "date": "10/15/2016",
    "text": "I'm picky when it comes to Chinese food. This place ROCKS! Fresh, tasty, and large portions. I ordered Moo Goo Gai Pan for lunch with egg roll. White rice was sticky and perfect. Chicken was lean and tender, sauce was delicious. We ordered takeout, so I never went inside. The containers the food was in were solid, easy to eat out of and easy to clean up. Jimmy Wan's is tops!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EkFKfkT6AsaV9aLoU3pr8A"
  },
  "9_XLGrpdpxuWyu3hyBmvFQ": {
    "date": "11/17/2014",
    "text": "Went to Jimmy's for lunch and walked out with a lunch bill of $74 for TWO people.  There was NO alcohol on the bill. Ridiculous.  To top it off, we waited for 15 minutes for someone to wait on us, and that was only after I finally got up and spoke to the manager.  It wasn't even at peak lunch crowd, in fact, it was about 2pm and we were the only people in the restaurant other than a group of ladies who had been there for some time.  I ordered an appetizer of chicken pot stickers and 6 pieces of sushi.  My business partner ordered a gluten-free meal of salad and shrimp.  Why my bill was $74 I will never know. I guess I should have been more observant.  Won't make that mistake again.  I want to add, this was the Jimmy Wan's on Freeport Road, not the location in Seven Fields/Cranberry TWP.  I've always had good service in that location, although it's still pricy there as well",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "-JvwMFZjkJnvpnMV9-adLw"
  },
  "jXhgt9mVBXTOCiFYZgN5gg": {
    "date": "4/19/2015",
    "text": "Service left a little to be lacking. General Tso's wasn't as spicy as it should have been.  The crab ragoons were delicious, and the sushi was just as good.   I think if I come back it would definitely be more for the sushi and less for the chinese.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CSe3dRei3fAAmfm64vm0pQ"
  },
  "Up1-dKh3YwDfdnlFvPB_ew": {
    "date": "9/9/2019",
    "text": "Always consistent ! Good dim sum- we like it all . Chicken dumpling is in very thick dough and is meant to be that way .  Try the crispy beef. I like to make mine extra spicy to balance how sweet it is . We have never had anything we just don't like .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dp8zKjF973g4LjxeWa2CrQ",
        "caption": "Photo of Jimmy Wans - Pittsburgh, PA, United States. Pork Shumai",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dp8zKjF973g4LjxeWa2CrQ/o.jpg"
      },
      {
        "img_id": "SRFntDGAPE8W1ylVR-rXng",
        "caption": "Photo of Jimmy Wans - Pittsburgh, PA, United States. Chicken dumpling",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SRFntDGAPE8W1ylVR-rXng/o.jpg"
      }
    ],
    "user_id": "8q6PZzKm79kmRgHZDhZOVg"
  },
  "o2vlSAGNgfyhzyu5mHdl4g": {
    "date": "7/25/2019",
    "text": "I'm conflicted with Jimmy wan's. There's tons of pro's to the restaurant that I could list. The restaurant has good service, great bathrooms, lots of table space, and a lengthy menu.  I can't explain my check. When I ordered off the menu I picked the Dragon & Phoenix which I thought was listed for 14 dollars. But I was surprised when my check came to 24 I thought I have made a mistake in ordering. Until I got in the car, I could have sworn it was 13 or 14.  Error or miss understanding aside. I liked my meal a lot. It was instagram pretty, it was delicious, and you can tell the veggies were fresh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PmGluGdkbD4-E--TYHJ3SQ"
  },
  "8X6BZYFjHjBebnU-42vqJA": {
    "date": "3/14/2019",
    "text": "It has been about a year and a half since I ate here with my girlfriend, but will comment the best I can from memory. I do not recall what we had, but I remember it being very good.   I am pretty picky about Chinese food. My mother studied for 20 years under the woman who oversaw all menus and preparation for President Nixon's historic  trip to China. She also had a syndicated cooking column in a Taiwan newspaper. As a result, I grew up eating Chinese food regularly, prepared just as if it would be in China.  We had arrived around 4:30 PM, and the restaurant was not busy at all. We were seated quickly and our drink order was taken right away. The waiter returned to our table to take our order, with our drinks.  While we ate, the restaurant gradually filled up. Still, the excellent level of service did not waver at all. I truly believe that this is the very best Chinese food that I have had in Pittsburgh, in many years.  If I lived close by, I would be a regular. It's a little bit of a trip for me to get there, but it is a trip I absolutely will be making again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hzp9vt1dk78v48fKISMB0A"
  },
  "GmEVOoSDOnJfD1umgz8lyQ": {
    "date": "5/5/2018",
    "text": "Phenomenal! Jimmy Wans never disappoints. This seriously may be the best Asian food that isn't hibachi in the city. Jimmy Wans goes above and beyond in the quality of their food and that's what separates then from the rest.  Each time I come here I'm amazed at how delicious the food is. It's like the first time every time. The sushi bar is second to none, with rolls and sashimi to satisfy every craving. I still have yet to find better sushi in Pittsburgh.  All-in-all, Jimmy Wans is an awesome experience. Don't believe me, go ahead and see for yourself.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S9I5Q_vLdNZBhv4rFb5rgw",
        "caption": "Photo of Jimmy Wans - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/S9I5Q_vLdNZBhv4rFb5rgw/o.jpg"
      }
    ],
    "user_id": "zg6LAy9gGLVH9JtcYP9gJg"
  },
  "ZTeNPHbORJ_ToUodzAomHQ": {
    "date": "4/21/2019",
    "text": "Wasn't crazy about dinner here tonight. It wasn't too busy (it was a holiday) but despite this and seemingly enough staff, the service was pretty lousy. Our waitress did not seem very happy to be working. We were seated right near a kiosk where there were frequently staff members standing right next to our table with their backs to us. It took awhile for starters to arrive, the barbecue pork buns were pretty good. I ordered the crispy chicken and broccoli as my entree and I didn't really like it. As you can see in the picture, there was very little broccoli which is why I ordered it in the first place. The chicken was more of a \"sweet and sour\" type chicken and not what I was expecting, it didn't really say this on the menu. This place is on the pricier side, the food I had tonight did not really stand up to the price. Our waitress took our checks and forgot about them because we sat and waited for nearly 10 minutes before asking what was going on with them. Overall, just not a great experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cq2oXzNa3_2OlIJsl8_fdA",
        "caption": "Photo of Jimmy Wans - Pittsburgh, PA, United States. Crispy Chicken with Broccoli",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cq2oXzNa3_2OlIJsl8_fdA/o.jpg"
      }
    ],
    "user_id": "0KhRPd66BZGHCtsb9mGh_g"
  },
  "wJDoq6tcXDeOnW235q_bvQ": {
    "date": "6/22/2019",
    "text": "I like to eat here on occasion if I'm in the mood for this type of food. Service is usually good. I've never really had a bad meal here. I've experienced a few poor seating situations (NOT RESTAURANTS FAULT) as the same \"regular\" couple who is clearly there every time I am- will interrupt your ordering with the bar tender to ask for something for themselves. They are so rude and want their you-know-whats kissed. Super rude, classless. Note: get up and move if you know who I'm referring to!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NQv5jRAbVxuZfvQK-8SgXw"
  },
  "6NxbbLKSsVufyHmljV-YRg": {
    "date": "10/7/2018",
    "text": "I went here on a Sunday evening with a party of 9.  Our reservation was for 6:00 and after receiving our beverage order we found ourselves waiting.  And waiting.. and waiting.  A family of four had been seated across from our table and they too were growing frustrated.  The woman from that party got up and tracked down the waiter.  We thought great, he'll turn around and take our order too.  However, that didn't happen.  He instead left the back room and wasn't seen again.  One person from our party went to the front to alert the Manager/Owner.  A few moments later he (owner/Manager), appeared and took our order.   He was curt, to say the least, however, we were just happy to have been waited on.  It was 6:40 at this point.    In the interim the table opposite (of 3 ladies), of the family of four were loudly lodging a complaint that their food still hadn't arrived yet and they just wanted it to go at that point.    How much worse could it get right.  Well when our orders came out only 8 of the 9 of us had our dinners.  They clearly forgot to put in the one order as evidenced by it being added to the bottom of the bill once we received our check.  By the way, that too was a painstakingly long process.  Not only didn't we get an apology from the owner/Manager and waiter, there also wasn't a single comped meal or appetizer.  Frankly an apology or acknowledgement of our troubles would have carried some weight with us.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "KfJQRh0bxsnR-EkxqI8XvA"
  },
  "9b3eFHJ7-PhrJhon2Sl2aQ": {
    "date": "3/16/2019",
    "text": "The stars are only for the food, which certainly wasn't bad and came in good portions. The pork buns were quite tasty and the eight treasure rice and spicy Cantonese noodle both gave food for two days and tasted as good the second day as they did the first. However, the service was completely deplorable. When we arrived and said we had a reservation (we did) we were told it would be thirty minutes because I had \"just called\" I'd assured them I'd called seven hours earlier , and then they checked a list and said \"oh, yes, we will get you seated right away\". Multiple groups came and were seated before us without reservations (I know because we were seated directly in front of the hostess stand) and it was over 45 minutes before they found us a table, and did so without apology for the wait... once we were seated attention from our waitress was extremely sparse and the food was slow to arrive. The restaurant was not busy enough to warrant this treatment, and the food was not so much better than any quicker, less expensive, more convenient option. I'd encourage setting your sights elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gwUNrClCimj5Tk4lRmrPSQ"
  },
  "zVCiEsN0eo8wQEGMdKvvlg": {
    "date": "6/22/2018",
    "text": "This is fantastic Chinese food. A friend told me about this place, and I was craving good homemade Chinese food. This food was excellent and was very fresh.   We ordered the crab rangoons, ginger salad, honey walnut shrimp, and six seas rice. Foremost, the ginger salad was a very nice portion. We only ordered one, and we split it amongst the two of us. I would hope you can't mess up rangoons so I won't go into it, they were right. The six seas rice was entirely phenomenon. It was rice, chicken, shrimp, pineapple, scallions, and eggs. It is cooked and then add soy sauce; the flavor profile is entirely unbelievable and so unique. The honey walnut shrimp was also very delicious and tasty. If you're looking for the panda express style honey walnut, this is not that. It was so crispy, and the sauce was even better.  Highly recommend coming out to eat at this restaurant!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "3gwqM0K5iPDugcy75Qal5A"
  },
  "h8USPGxcwY1vasepXHKM-Q": {
    "date": "5/24/2019",
    "text": "I've been to here a few times and have always enjoyed my experience. However, my most recent visit was not great. Since the last time I have been there they have changed the way they do their chicken. It's almost like chicken tenders covered in sauce.. not a huge fan. The most disappointed part was our waitress. She was rude in the way she responded to our questions. She was not friendly and almost made me feel uncomfortable. Thankfully, by the time we went to pay we had a different server who was great! I wish we would have had him the whole time we were there!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ByeMlCri_RKOBMf3DjUwAQ"
  },
  "JA5ViZ7lP6MEkKQCsBJWtQ": {
    "date": "5/12/2019",
    "text": "We eat here at least once a month and have good service anytime we dine in or take out.  The staff is friendly and will suggest menu items when you just can't decide.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CmWm2mi8hKUjuk8hgCAb9A"
  },
  "QNkXLCai_X90YydHyUhw6A": {
    "date": "11/25/2017",
    "text": "Great Chinese restaurant with good atmosphere and tasty foods. While the amount of food is few, so if you want to eat as much as you can, it is not the right place for you; if you want to have a different and delicate flavor, it would be a must to try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HubnuxeZJoDd86uyGndsJw",
        "caption": "Photo of Jimmy Wans - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HubnuxeZJoDd86uyGndsJw/o.jpg"
      },
      {
        "img_id": "udnELKg2zvFg1v9a1ffbbg",
        "caption": "Photo of Jimmy Wans - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/udnELKg2zvFg1v9a1ffbbg/o.jpg"
      }
    ],
    "user_id": "H0PwhZCsL_qp3d6Bba_FhQ"
  },
  "psSdZMQyKhET16KZfsLh2w": {
    "date": "6/15/2018",
    "text": "Visited here for the first time with our family, and it was delicious! The food is a little pricey, but the portions are good. The quality of the meat is not like any other Chinese Restaurant, it is really good quality meat. The general tsos chicken with white meat was awesome, great meat, good portion, not too bad of a spice level (but they gave my husband the option to add spice and he did which was good). I would definitely come back here, or even get takeout. definitely make a reservation if you're going to be here on a weekend evening, as it stared to get pretty crowded when we were leaving the restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gKU45Tq9JJ9Z7HiZChu3ew"
  },
  "Hgiz56Oco-I87HQZ2YaNuQ": {
    "date": "10/14/2016",
    "text": "Jimmy Wan's is Pittsburgh's answer to overpriced basic Chinese food. It's listed as Asian fusion but in not entirely sure why. From my experience, it's mediocre staple dishes and too expensive.  We put in a large takeout order tonight and of course, they gave us the wrong order and we didn't realize it until we got home. After driving back down, not even an apology, just general confusion and no discount to show for it.  There are better Chinese restaurants in the area and I suggest you try them first.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhQOA8-FdpA6D0hNhXEYIw"
  },
  "XUg1X76DMnz2uCutK_OtLQ": {
    "date": "12/10/2018",
    "text": "Best in the city or surrounding areas.  The crab Rangoon's and cold sesame noodles were on point.  Everything from the sushi to the garlic chicken (my absolute fav) was delicious and fresh.  Ice cold beer and hot sake were a perfect combo.  Great ambiance and service.  Cannot wait to return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PCNb2eKpOyRe6oaa19Y2ng"
  },
  "SjFV34XSbyrQIgRrMNrewg": {
    "date": "5/27/2018",
    "text": "It's a nice place for a sit down Asian meal, but the price is a tad too high. I was annoyed that when my wife and I were being seated, one of the hosts took the drink menu away from the person who seated us as if we were not of age? I'm not sure what that was about, but I don't think we will be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Tkw65M5WB6TH6dmg9H8b2Q"
  },
  "lbPZEyxbSF6OprCFyijc4g": {
    "date": "4/8/2018",
    "text": "Best sushi in the area!! Our go to favorite neighborhood restaurant. Kitchen is also open late until 10:30 pm. Love that",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nuj_NnFFDRbn4qFCqQAi_A"
  },
  "SYdrFR1JMadX1I-qP2P5kQ": {
    "date": "5/1/2017",
    "text": "Was invited to this place one time and since I have been here for lunch three times. Great food. Love that both their Sushi and Chinese food is great. Great tasting soups, sauces and big pieces of fish. I recommend this place to all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ByBCQ_47EGs35KBBxAoA7A"
  },
  "42eoMB5tht3LXM0Y6dyfbw": {
    "date": "3/12/2018",
    "text": "I love Jimmy Wans because the food and drinks are fantastic....and so is the service!!!! I'm always remembered and I remember them!!!! My favorite Chinese cuisine!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "--Dt9dHHvfAjRN8Bh7Kz2g"
  },
  "Ij6_aSIb-F1QtGAlJuAOdw": {
    "date": "2/28/2017",
    "text": "Pricey but each experience eating here has been right on par .... Never disappointed but never blown away by any of their dishes   When your craving Chinese food and you don't mind spending a couple extra bucks head to JW",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X1TH9Y9iltnaOWEmgOCOAg"
  },
  "zhVVYZks2KwUA60j_J6PCA": {
    "date": "10/4/2012",
    "text": "My parents like this place, but I don't think it's anything special. Nothing I've had there is amazing or makes me want to try it again. I guess it's nice that it forces you to try new things? The hot and sour soup is really peppery, but other dishes seemed kind of bland. I'd just as soon not eat Chinese food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xZV_WXfK67NJEwi0bLEVfQ"
  },
  "6k_k6gwPGqHyJ9UIHp6YYg": {
    "date": "7/26/2012",
    "text": "Quite the variety of menu items. Try one of their speciality dumplings.  Solid service.  Attractive.  Wish they had some outdoor dining.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fDiPHILHixqRxEeCjWTwQg"
  },
  "k3ViLXNzjmnfm3mnBqpZsA": {
    "date": "7/11/2011",
    "text": "There is nothing bad to say about their food.  The sushi is delicious (I strongly recomend the crunchy spicy tuna) and the main courses are even better.  The portions are about normal size for a chineese restraunt (enough to eat and have leftovers the next day).  The only thing I have negative to say about Jimmy Wans is it is very pricy for chineese food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3lT6qRRr8gHqJBccIdXVlw"
  },
  "NZsjd-JgBKT40T9LMx-Txg": {
    "date": "4/23/2009",
    "text": "This review is for the brand new Fox Chapel location conveniently located across the river from my home.  I was happy to find this location.  Interestingly enough I would check the website occassionally and they would say and still do \"Fox Chapel location coming soon\",,, well let me be the one to break the news its been there for months and is a great new addition.  I am a self confessed sushi addict and am constantly looking for good places to feed my addiction.  So, I've been here three times over the past two weekends.  I feel I've been there enough times to give a worthwhile review.  The location is \"old freeport rd\", which is the back road located between freeport rd. and the apartments/club by the river.  There is a very large parking lot and unfortunately is relatively empty.  The building is beautiful, you enter the main area and above the entrance are hand blown glass chandelier type thing.  It's kind of like the one in the bellagio, vegas entrance but on a much smaller level.  Directly in front is a big marble bar and sushi bar to the side.  If you keep walking too the right there is comfy seating in an open air space because the windows have been open every time I've visited.  The bathrooms are very nice with marble and one door leading to the rr and then seperate entryways for the different sections.  The dining room is pretty large and they may even have a private dining room.  I've never sat in the dining room, so I can't comment that much on dining room service or comfort.  However, the bar has been my home on my last three visits and haven't been disappointed either time.  The first time the gals behind the bar were Sue (she's also the marketing person for penn ave. fish) and another gal forget her name.  There was one other regular at the bar.  The sushi chef didn't speak much english so I didn't get his name, but he was a True professional.  I started with my standard white tuna and salmon sashimi, cut perfectly,,,wonderfully fresh and presented beautifully.  I also tried the seafood salad which is a delicious healthy serving of various seafood prepared in a very spicy sauce with delicious scallops as well.  They also have a great sake menu, with plenty of text on the medicinal qualities of good sake and how it doesn't give you a hangover (kind of have to disagree with that fact).  I tried their best sake which was $18/glass, but also sampled another at $10/glass that was just as good ask the bartender Jess or the other gals, they'll let you know which to choose.  They also do samplers with the sake.  I'd suggest staying away from the samplers because they tend to mix sweet, with dry, and clear with cloudy,,, chances are you're not gonnal like all of them.  On another visit Jason was the sushi chef who Jimmy Wan recruited from NYC.  He's a True pro and made me this incredible spicy scallop warm salad served in 1/2 of a baby avocado.  It was unreal.  He also made these cucumber thin slices stuffed with some type of crab that were really good.  He suggested I take my raw white tuna and fry it for a second, totally different texture and taste (however, sashimi white tuna is stil my fav).  A couple last points one of the reasons Jimmy Wan has such good chefs is that he was the president of the chinese restaurant association nationally and was able to recruit from all around.  And, don't get this place confused with Tai Pei fox chapel which also is referred to as Tai Pei and is located on freeport not old freeport rd.  Jimmy and the owners of the other place are rivals and I was told he moved back so close to put them out of busines.. The food is just as good here as cranberry in a much better space.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "1TkFY3Z_g62uZ6xNhAhXoQ"
  }
}