{
  "uRRHbMUMhTA5PVrJfq0bIA": {
    "date": "10/9/2015",
    "text": "Have run the menu; food is terrific,  well prepared and timely; nothing disappoints; friendly staff and experienced bartenders. If you are in the SHALER/Etna area, this is a must try.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZOC6ZgapSwfEVVTn5zcq0w"
  },
  "hvVB2aD26eA-LHC0QByYZQ": {
    "date": "8/27/2014",
    "text": "We just moved to the area and tried this place and we were so disappointed the pizza was aweful and the salad I had was soggy and I found a black hair in it which made me loose my appetite we probably will not be ordering from aliotos ever again",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xw0Fl91KVWSVdJKZxhSt5w"
  },
  "8Gk-l5zLiVp8zE1kab_fOw": {
    "date": "8/18/2010",
    "text": "Every neighborhood needs a great pizza place/restaurant/bar, and this is that place for Etna & Shaler. Pizza, wings, burgers, etc. are all great, and nothing is overpriced, especially if you get it on special. Bar selection is a bit limited, though, so I have to knock off a star; beer & especially wine are limited to primarily domestic fare.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "1mcgbwomMGV3wuPN1BqglA"
  },
  "VmX5hmnMqMOz7HzzQkufug": {
    "date": "4/2/2013",
    "text": "Been going to Aliotos for years.  Unfortunately it has been sliding downhill for the past year.   Tonight the food was fine.  It usually is, but the service was horrendous.  Tonight was the worst. There is usually one waitress who is good and one who is not so good. Tonight was one good, one awful.  She got our drinks fairly quickly and then spent the rest of the evening sitting with her friends at another table.  We couldn't place our order. We couldn't get refills. We couldn't get our check.  If you go there and a large (tall and wide) woman with a mop of black hair is your waitress, do yourself a favor and leave!.  I miss the old staff.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RbZ5TolpHzjGFQrp6unppw"
  },
  "vt_rrTTlTBlZeQC6vR_PUQ": {
    "date": "6/17/2014",
    "text": "Pizza is terrific, perfect combination of sauce, cheese and toppings. Beer is real cheap and bar is non smoking. Haven't eaten much other than pizza. Not impressed with hoagies, but i'll stick with getting their pizza and beer. Defiantly will return/",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_7XJIbwOuBBmWKei9HMxVA"
  },
  "7qsd4I8gyU0vT3nuUi3ZhQ": {
    "date": "10/4/2012",
    "text": "Went there often for pizza. It tastes good, but they always have flies! Even when it was snowing last year the place was full of flies. When I found a dead fly in my salad, that was my last day. They didn't seemed concerned at all about it. I have never saw anyone try to control the flies in any fashion. The same day I saw them let a person back in who the day before got so drunk he puked all over the bar where people were eating.. He had been standing there gagging from too much beer and belching, and they let him continue to drink until he puked. It was massive and awful!  He made no effort to clean it up. Then they let him back to drink at the bar the next day. This place is nasty!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_gsbfPbkiP5mpYEoAmTNjQ"
  },
  "HPXwqW0BsIrcHX9gCPWzOQ": {
    "date": "9/15/2013",
    "text": "Seriously amazing pizza. And amazing calazones. We always get takeout, so I can't speak for the dining experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JTtzEyQIIjz7ld4FCPS2xw"
  },
  "glQarOL-Q9ub4jNlZtmKjA": {
    "date": "1/8/2017",
    "text": "Amazing food and service. We are never disappointed when we come here! I <a href=\"/redir?url=http%3A%2F%2Ffeel.as&s=4925c57f59614adee2d2cb46557c565f48fda537406e9a6202523a666e4e4d55\" target=\"_blank\" rel=\"nofollow\">feel.as</a> though this place is a bit of a hidden gem.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fVAr-9ICfZMfJk9ow95cBg"
  },
  "vghaStb3Hwfl-HtRfZBqXg": {
    "date": "12/1/2014",
    "text": "Good pizza, decent prices, lousy staff.  I've never sat at the bar, I've only done take-out and dine-in.  The pizza is very good, though sometimes it's a bit greasy, which I personally don't mind, I just dab at it with a paper towel.  My advice:  DO NOT SIT.  I've sat in the dining area 3 times over the last 6 months and every time THE TABLE SERVICE HAS BEEN AWFUL-- I've had to wait to get a server's attention, I've had to ask for items two or three times, and the last time I was there, 2 servers sat at the empty table next to me to do some side work, eat their own food, and bitch about how tired they were.  I realize they're human too, but as a customer, I'm there to be waited on and enjoy my meal, not listen to the staff whine and moan.  DO NOT EXPECT *ANYTHING* FROM THEM IN THE WAY OF CUSTOMER SERVICE AND JUST GET TAKE OUT FROM THE CURT PEOPLE BEHIND THE COUNTER.  If they manage to be pleasant to you, consider yourself lucky that day/night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "vnZhfpFkDQAob2B-4Q_dhA"
  },
  "676IYdpfb7yeZzp1b9J9zw": {
    "date": "6/28/2015",
    "text": "This is a classic hole in the wall with a lot of character. It's a mix of Italian and bar type foods but there's almost always a special going on. It's a cheap eats place that usually even has a coupon in the local circulars. Overall the food is average-good. Lots of TVs make it a good place to watch a game with drink specials usually going on too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lsLuVKmdh45yommr53zfRg"
  },
  "Uwl7IXhloGDcXmusryO_5A": {
    "date": "4/19/2018",
    "text": "My husband and stopped at Alioto's for dinner tonight.  The restaurant was not crowded at all, but the bar was pretty full.  We seated ourselves and waited a while until we were approached by the waitress.  we place our drink orders and then our food order.  He ordered a burger and I ordered a bowl of chili.  After some time i heard the waitress say to the cooks to put that burger back there until the other thing was ready, meaning my chili.  after another five minutes or so a new waitress who had just started brought us our food.  My chili was lukewarm and tasted as if it had just been thrown together.  The peppers and tomatoes were not cooked and tough to chew.  It was obvious that the sauce had not thickened yet and the different ingredients had not blended together.  I mentioned to our waitress that it tasted as if it had just be made and she said she would tell them in the kitchen.  she did offer to get me something else, but by that time I was done and just wanted to leave.  shortly after she asked about the chili she and another server want to the front of the restaurant where the tables were all empty and had a 15 minute discussion about how dissatisfied they were with their work schedules.  By now we were done with our food and just wanted out check so I had to try twice to flag down the young waitress to ask for our bill so we could leave.  This place continues to fluctuate in the quality of it's service and food quality, which is disappointing since it is convenient to our home.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bkc7CwjUUWbnqBCc-Fe0vA"
  },
  "lDcZMVcq69ASZrXwElDgKA": {
    "date": "8/6/2017",
    "text": "We love it here.... one favorite dish is Cajun chicken alfredo and we've tried other stuff which is also yummy!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Ap_yYy5hkDRyqS6p-xuRQ"
  },
  "YX8jcd3RLYbgk4TVO6I0Jw": {
    "date": "6/24/2016",
    "text": "This is my 'go to' pizza spot! Love the thin crust. Also, gyros are delicious and wings are great for a night out watching a game. This is my favorite neighborhood haunt!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T1WN9xegnavNfxhZN2kEUg"
  },
  "EivDjbbdFSWOyminpKVrIg": {
    "date": "8/8/2016",
    "text": "Some days they're on point, a lot of days they're not. Typical bar food/pizza joint. Every time we order delivery, at least one thing is wrong with the order. Gets annoying but food is alright and it's close and fast, so we'll probably keep them in our lineup for the foreseeable future.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XKJU7TfVyO23t1MdrT26Yw"
  },
  "eG27zUk3wM3ysdTivEsRiQ": {
    "date": "12/24/2015",
    "text": "I tried this place twice. The first time i tried to sit in... TRIED. The staff was so rude, no one said hello ir even looked at us. We waited 15 minutes and left. Then i ordered a pizza a few nights ago... It was fine... Basic pizza",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_h4UlHXy5pTJpetOl6tWxA"
  },
  "N1ryvpdqrPuO3K_aCdXD3g": {
    "date": "6/17/2016",
    "text": "Wanted somewhere close, so I decided to check out Alioto's. It is very small inside, but the food was good with a decent selection of beers. I went on a Monday, with the special being $3 off all Italian dishes. I ended up having the Cajun Chicken Pasta, which was very good, with the fresh grape tomatoes highlighting the dish. The bartender was friendly and service was fast. I would definately return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rH52Fq2GSxw97NdhYju5OQ"
  },
  "eWwOgy0OvotbtSh4RHkxzA": {
    "date": "10/23/2013",
    "text": "Wing special Wednesday. Karen likes Black and Gold wings and I stay True to hot. Good wings. Also had a large pepperoni pizza. Very good right out if the oven.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ERfIlweXI0UmcsMawNUQ8g"
  },
  "AFYgo0to8mZU4GoOPlaQtA": {
    "date": "6/9/2015",
    "text": "I live locally, so eating here is very convenient. The Italian dishes are very good, portions are generous and I've never been disappointed with the tasty sauces. I usually sit at the bar and order carry out or dine in for a special. Overall pleased with the service and attention given. I'm surprised after reading these reviews to see that some folks don't like their pizza. I think they serve some of the best pie in town. They also have some great features, like half price burger night, pizza specials and $3 gyro's on Saturday.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wN5ej6CXRlAU13nBJPNXdQ"
  },
  "FltOZABL8o6zrzYysAtqnA": {
    "date": "2/6/2016",
    "text": "Tonight I ordered from alioto's pizza . I ordered 2 pizzas and an Italian hoagie . I placed my order and the man repeated my order I repeated it again. We picked up the order and it was all wrong. I have not had pizza there for 15 years decided to try it tonight and honestly it tasted like a pizza chain pizza . Nothing special like I remember.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nPvPTSYSQsvqWCXGJ-MFpw"
  },
  "pYmpXorsz1eQmg6PMk6D8g": {
    "date": "7/8/2015",
    "text": "Usually a place that i like to order from..close to home good food..and usually fast service...i put an order in tonight at 745...2hrs later...no food..i called afyer the hour mark and was told all deliveries went out...at the hour and half mark was told there was a mix up in the kitchen food will be there in 10 minutes..20 minutes later my food shows up probably cold from sitting around and then still asked to pay the 30 some dollar bill...well my time is worth more then that let alone seems like they didnt even care....i guess aliotos didnt appreciate my business or any of my friends",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mBrBcRDB2pPZmTn0AEJhVA"
  },
  "8sI7g8TQVR9PwGudA-5Bqg": {
    "date": "1/29/2017",
    "text": "Aliotos is less than 2 minutes away from my home. And every time I order food from there it arrives cold and they always have something messed up Absolutely will never order again. Which is a shame because the food is very good",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9VPfeNviWbfwE3P22PPqpw"
  },
  "JHM5icE_ASFGZvoJ9ozTOA": {
    "date": "1/28/2016",
    "text": "Never again.. Normally i give places a three strikes and your out. I just could not handle doing it a third time. This is cookie cutter pizza at best, calzone was watery and empty both times, wings left alot to be desired, and the pizza is a step below dominos.. Not good,",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vMCbWPN6gshQVIy1hwNFfg"
  },
  "2YWaffv9PvrEOFqhMdgD6A": {
    "date": "5/5/2015",
    "text": "Not sure what's dirtier , the place it self or the people that work in it. Ordered a take out Pizza. When to use the bathroom , guy walks out of the toilet stall and not even slow down at the sink to wash his hands. I thought okay some people just don't have good hygiene. I came out and low and behold he was behind the counter making a pizza. No thanks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tjoOS2WviFKRrOyQqwwXnA"
  },
  "OWA6X-VB9GSpu04nqedhEQ": {
    "date": "9/23/2014",
    "text": "The Italian Hoagie, the Italian Hoagie Pie (get this!), the Carbonara and the Alioto Burger are my favorites. All are super tasty and I highly recommend trying. It's also a nice place to watch a game, have an easy family get-together, and it's kid-friendly too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-NnADpikTs6IWM9tbNO3Zg"
  },
  "Wqytjyd_535ckE9pTHfjDw": {
    "date": "8/17/2014",
    "text": "The only reason I went with four instead of five stars is because their pizza is just meh. Everything else is always great: chicken parm hoagie, gnocchi, any of the appetizers. They deliver to my house and it's always faster than expected and always hot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "z9gzNYnjaCq_oIKEpCUzNQ"
  },
  "_T7TdTZIcgde_5Pi_oxuxQ": {
    "date": "5/12/2014",
    "text": "Alioto's is a good neighborhood joint I have been to twice now. The fish sandwich is giant, the burgers are ok and I really liked the gyro. Service is fast and attentive. I would recommend staying away from the Italian as it was a bit of a letdown for one fellow patron (they got the eggplant parm) but I did have a bite of a meatball that was pretty appealing. Decent choice and the best in a small neighborhood.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "9olpPYmaiCqIgOyLrmT24g"
  },
  "Hnb1NYvvPCCbmMgcEyLRQg": {
    "date": "7/22/2014",
    "text": "My family loves their pizza & calzones! Dough, sauce, cheese & fresh ingredients can't be beat. My fav pizza shop. Friendly employees & fast service! Gave 4 stars only because they screw my order up periodically when ordering by phone. They always fix it tho & make good on it by delivering a new one for free or the next visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "r7NNIC0r75-efLav9IGGnw"
  },
  "nLOXkrmh4tjubJkUfw84Vw": {
    "date": "6/2/2019",
    "text": "Local family run spot. Great atmosphere. Calzones and pizza were awesome. We've been there several times now.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vB4fRlIJhvCSqq82_1VAqQ"
  },
  "lf3bizEhiGRkqrqhG_45ZQ": {
    "date": "9/11/2019",
    "text": "My wife and I used to stop in there quite a bit for a quick drink and a bite every now and then. Place has really gone downhill last several years. Pizza is still decent but the service is typically really slow and the bathrooms are disgusting. The clientele there can be a bit rough and loud. Doesn't bother me much but, if you have kids, keep in mind they have to walk past the bar to access the restrooms. Also, they constantly have Fox News on at least one TV - I'm not political but the headlines alone provoke a lot of negative talk across the bar. Bad vibes all around.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YP6Qc51s5lJIxVPF6V7oEw"
  },
  "ntJrQg17V-46qEMZKpofgw": {
    "date": "8/19/2019",
    "text": "Just got a 16 cut square and the whole bottom was burnt the crust was burnt not happy at all",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oWVtA5p8RkcG0HfCeod1Bg"
  },
  "H-Iwhj6fyyAwkwFXpeKa3Q": {
    "date": "5/30/2019",
    "text": "Service was slow, from the minute we walked in, the hostess/waitress was sitting a table gabbing instead of seating customers. Food came out with no flatware, asked for a riser to put pizza pan on so we could have room to eat, she completely blew us off.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1W_hOz-69G5YCoYsmdi3gA"
  },
  "BY5OtnL2sqAdxW3oAuZKQg": {
    "date": "5/29/2019",
    "text": "The food is very good.  I keep trying to be a loyal customer but they keep getting in my way.    Last time I ordered the person did not know there was a difference between sweet peppers and hot peppers.  So he guessed...incorrectly.  This time they misread Allioto pie for fries.  Sometimes the last thing you want to do is wait for the order to be corrected, while the hoagie gets cold.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bnNy_c2htIIDUK7PY6qOvQ"
  },
  "ceJrkNw0dK0E-4WWjMZ05Q": {
    "date": "3/1/2019",
    "text": "One of my favorite restaurants. The Alioto fries are amazing, their wings & sauces are always on point. They have great specials on week nights & the bar is open til 2.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uVJcciezPruqqWsngzYsFg"
  },
  "iXZWcpxhwfeQ5g27EJrJ5A": {
    "date": "6/1/2019",
    "text": "Really disappointed! One of my favorite dinners at this place was the eggplant parmesan.  Not anymore.  It was greasy and slimy.  My husband got Baked Casserole with stuffed banana peppers.  He said on a scale from 1 to 10 it was maybe a 4. Not sure what happened but don't think I'll be ordering from there anytime soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QXGlyGKF1lhXpUa0V0tcJQ"
  },
  "bz-7PIt5fmfQ6qr5iDzWvw": {
    "date": "7/5/2018",
    "text": "I've eaten at Alioto's for a couple years. The food has remained relatively consistent during that time save for the Sicilian pizza (that's ALWAYS served undercooked and cold now). At first, it was a great quick bite with friendly and welcoming staff. I fondly recall a bartender named Joyce who was the same welcoming presence whether you were there for the first or thousandth time. That's changed in the past year. There is undoubtedly an Alioto's clique now that carries a subsequent hierarchy in terms of service. From the bartenders down to the owner, it resembles the Cheers theme song more and more with every visit. The owner is frequently present chatting with regulars and it's clear the place seems to value their buddies more than making money.  The most recent visit, after eating and ordering two beers, I attempted to order a buffalo chicken sub to go. While the food was cooking, I would've undoubtedly had at least one more beer; thus, spending more money and upping the bartender's tip since the tab would've been larger. Win-win for restaurant and staff. The restaurant carries buffalo chicken and subs but not a buffalo chicken sub. I was shocked that when the bartender asked the manager, she was informed that the order could not be completed. Previously, I took several buffalo chicken subs out of the establishment without any issue. No matter the willingness to pay an up-charge, still, no dice.   I don't love bashing establishments in the community but when an establishment sours its relationship with some in the community, my hope is that constructive feedback from locals can enhance the trajectory of the business for all.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Nxy_cOa5h0Nsptiu2M1NQ"
  },
  "tHUNAZ2cNld0z3H3Ilgijg": {
    "date": "10/28/2018",
    "text": "Placed an onlone order and got a call 2min later that they were no longer delivering. Should be able to know that before you hit the delivery button. Hours say delivery until 9:30, placed order at 9.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uAze_Oo_FJxF24SrcrTCww"
  },
  "vUQVrBWK7EdAxmx1EWkT9w": {
    "date": "3/9/2019",
    "text": "I love this place because it is very kid friendly and the food is always good.  I gave this place three stars because I wish the inside of the restaurant smelled better.  There's a distinctive smell of artificial pink bathroom deodorizer back by the bar and it is just nasty.  Inside is very dark with 1-2 windows and needs to be remodeled.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m9-g8ci6uRc-zEmiEwpmbA"
  },
  "la84bo5t_4ZiIeSfAJQAWQ": {
    "date": "8/25/2018",
    "text": "Usually love this place. But not tonight. Got delivered food was cold. Keep in mind we are literraly a 3 min drive if you hit red light. Never paid attention before but don't get a dozen wings only 10. There black and gold wings are still my favorite from them.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gly8E7Wxbd5KFRBXiBiRCA"
  },
  "moeuldccol-Dg-2EMo2oEQ": {
    "date": "7/25/2018",
    "text": "Had Huge Calzone and beers last night.  Great bar and bar food. Pirates on tv, sat at bar.  I'll be back.  Thanks Alioto's.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e826mGx8fLBJriVH9S8FFw"
  },
  "s1k7EFZ14cbyn-jaORs5WA": {
    "date": "2/16/2018",
    "text": "I am soooo over this place. An hour and 15minutes for cold dry pizza. I ordered online and that was fine but my pizza is cold and has no taste.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8s_aH2-YOz2TNhjNFHehhw",
        "caption": "Photo of Alioto's - Etna, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8s_aH2-YOz2TNhjNFHehhw/o.jpg"
      }
    ],
    "user_id": "bI9wGaTMq8qwwkmRmDAYig"
  },
  "yysHxvUg9fwRoIq6cdj08Q": {
    "date": "7/25/2018",
    "text": "Restrooms are horrible no privacy can't lock stalls and very dirty food ok at times very disorganized nobody knows what to do when something goes wrong   !!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SuOK1ej0JWnSwug04b0fAQ"
  },
  "dg3862UWX15R0SD35jHWNw": {
    "date": "2/18/2017",
    "text": "Awesome!! Calzones and lasagna were so good  you could tell its all homemade   All of my picky eaters were thrilled   Service was awesome  Anxious to go back !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oyp_r6ll7sTeWBPyWs9OWg"
  },
  "IIziX1urmbC1MMKO1QxiDg": {
    "date": "1/7/2018",
    "text": "Don't waste your money. We ordered pizza and a chicken salad. The pizza was warm, the salad however was cold. The chicken, cold. Fries, cold. On top of that they did not include ANY PLASTIC FORK OR NAPKINS. When I called, they acted like I was stupid for thinking a salad would could with a fork or napkins.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cWYq2s9RLLzkLsS0T5UkDw"
  },
  "nokCT5aP5-0dyEr6crmnUA": {
    "date": "5/17/2016",
    "text": "Is it a restaurant or a bar that also sells food?  I say this joint is just a bar that happens to also sell food.  We tried the pizza, Italian hoagie, burger, and fries.  The pizza is typical, hoagie was bad, burger was dry, and the fries were way over cooked. On the other side of the coin, the beer was good.  My opinion is order drinks and keep the food money in your pocket.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "maHYYbhATZnQ3_ggjfvkmQ"
  },
  "EoKP2Y_TbITmoc5TvASprg": {
    "date": "9/25/2012",
    "text": "Pizza, Pizza!  This is a brief review.  I stopped to pick up a pizza pie on my way home.    The place appeared to be a busy pizza making factory with a restaurant on one side.   The restaurant was very quiet but there was a bar in the back with many locals hanging out have beers.  The pizza was good but not great.    I will try it again.  Atmosphere - It seemed to have a good vibe by the bar but many were locals.    The tables were mostly empty.  Price - $10-20 for a pizza depending the craziness.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JPXLcPoeL4sX2arZFbHoiA",
        "caption": "Photo of Alioto's - Etna, PA, United States. Pep pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JPXLcPoeL4sX2arZFbHoiA/o.jpg"
      }
    ],
    "user_id": "JgOcyMF1lTwSVCarSZrrrA"
  },
  "vgQ813yTKPGH_FXbr3zpug": {
    "date": "10/15/2015",
    "text": "I ordered delivery from Alioto's for the first time today. Our meal consisted of Chicken Alfredo, Gnocchi, Stuffed Banana Peppers, Chili, an \"Ivan Cup\", and a couple of salads.  First the good: The delivery man was courteous and fairly swift. The price of the food was acceptable and the Stuffed Banana Peppers were quite good. Unfortunately, that's where the list ends.  The salads came somewhat different from each other. They didn't share all of the same ingredients and had several pieces of old/bad lettuce, some pieces were in fact slimy with decay.  The Ivan Cup came missing the Graham crackers, which wasn't a massive problem but left it feeling kind of hallow and lacking texture.  The chili and Alfredo were okay, though the portion size on the Alfredo was modest for the price and seemed like it lacked sauce and meat. The Gnocchi was simply not very appetizing.  All in all I do not expect to order from them again.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "n8yuqk8pArtQePo7qcrVCA"
  },
  "1ffLornfa238SmpOuyKhcA": {
    "date": "1/18/2017",
    "text": "Their pizza and wings are soooo good and I'm hard to please. I love the thin garlicky crust of the pizza always crispy! The wings are crispy but just enough buffalo sauce that they are not soggy. This food is awesome. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WKD5HqlyK_JEWb8pqGZTrQ"
  }
}