{
  "5CUXKFVp6MjsMrlgIaMXYg": {
    "date": "12/18/2014",
    "text": "Food is out of this world.  Wing night every Wednesday till 11pm.  Best flavor = honey jalapeno, simply amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Tgm7JC2FHASS8bb8cTnC2w"
  },
  "4436PAXMneIV1D9mo3Rj5A": {
    "date": "2/12/2012",
    "text": "LOVE THE CHICKEN NACHOS!!!!!! We've been there 20+ times and never been disappointed by the foods. Nikki the server is the best.  Beer selection is great, half price apperizer after 10pm every day is a great deal.   The only reason it does not get 5 stars is because it is smoky.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAtyWWIoY4sx2dqtVgGb7w"
  },
  "TcDcMKZW0-W26iEQSODpvA": {
    "date": "1/30/2013",
    "text": "Love this place. Awesome food and great beer selection and reasonably priced. Also the service is excellent. Highly reccommemded.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7y6n4aZGPY3uxOGgVX-SVA"
  },
  "mqgGs3tTYhKOFVrXOsnUPw": {
    "date": "8/16/2016",
    "text": "My wife and I had not been to the Hop House but were looking for a new place to play Buzztime Trivia games so we decided to try it out.  The staff was incredible, extremely friendly, attentive, and even through in a few jokes!  There is a different beer special each day.  They have at least 15 beers on tap, including craft beers.  Plenty of tv's to watch sports, dartboards, pinball, pool table, and a cool video shuffleboard type game.  We ate the chicken nachos and then brought home a wood fired pizza.  My wife said at least 6 times that this was the best pizza she has eaten in the past three years in Pittsburgh.  It was REALLY good.  The only downside, and we are not sure we will be able to get over this to return again, is the smoking.....it is bad.  We really would make this bar our new place to hang out, but the smoking is hard to bear, we smelled awful, even the next day.  Otherwise, this bar is a perfect 5 in our book!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yvSs0inP4iGJo3_3sJ4iJg"
  },
  "cQRxb4yYKz3Ugb656q2ZhQ": {
    "date": "12/29/2010",
    "text": "The menu here is not real big, but I've been here a few times and the food has been good every time. Plenty of beers on tap too. Decent atmosphere, although I have never been here at night when it was crowded. The bartenders/waitresses have all been friendly. I personally don't care for the fact that it is a smoking bar though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ryz2Vk10V7z-yfOJhwJjzg"
  },
  "1-HwYporHgnloYzCNQMZ2w": {
    "date": "1/21/2009",
    "text": "Pretty good wings.  One of the best burgers I've had in a very long time---and that's even though I got a medium-well instead of the medium-rare I asked for.  Fried cheesecake was one of the strangest-sounding desserts I've ever been offered, but it turns out to be completely and totally awesome.  They've got twenty-six beers on tap and another two dozen in bottles; while they've got Coors and Yuengling, most of them are micros or mid-sized national brands (Sierra Nevada, Otter Creek, Dogfish Head, etc.).  If you can't decide what you'd like, you can pick one of their six-beer sampler racks, and if you *really* can't decide, you can make up your own sampler rack from any of what they've got on tap.  Parking is a little tight in the fairly small lot that's directly in front of the building, but if you're there in the evening, the businesses on either side will be closed and you can park in their lots.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tg0hfRkbzErkvNDL7W5lZQ"
  },
  "DnWSVs3k1Ga_W2i-cRmL1A": {
    "date": "3/23/2013",
    "text": "We go there all the time. Sometimes the parking is hard to find. All the bartenders and waitresses are really nice and helpful. You can really tell its a local joint. Fells like Cheers in there. I don't smoke but it does not bother me. The wife does not like it. She hates coming home smelling like smoke. So far I did not have anything bad on the menu. They got rid of me favorite burger though.... Maybe ask if they can do it for me.....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "d9a0JCq3VAFceiiv3jH_CA"
  },
  "WdZeGGfV4UtxG1qa9BQsKw": {
    "date": "3/6/2013",
    "text": "In a sea of chain places off McKnight, near Ross Park Mall, this is a great find off the beaten path.  Tucked away on a curvy road less than 5 minutes from the hotels and Mall, you'll find a cool dive bar with great beer selection, super friendly service, good music, EXCELLENT ambient lighting, eclectic patronage mix of ages/people/professions. I dig the mix of everything, and this place could hold its own as a \"locals favorite\" from coast -to-coast.  While it falls into the \"DIVE\" category, it's in a loving appreciative way - It is NOT a dump by any means.  The signage and neon graphics outside do indeed give a heads up that it's probably gonna be cool inside.  As to the smoking:  I'm a non smoker, and I don't give a shit that a bar allows smoking.  I love hanging out in the company of people out to have some fun.  I'm here to drink and chill.  Note to those worried about breathing second-hand smoke onto their precious toddler at home the day after, or having their clothes stink, there's a sanitized, institutionalized solution: Applebee's.  No comment on food.  I come here to booze and write Yelp reviews ;)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "n1dDZfXcqw2A3iNwU5xlzg"
  },
  "TPew2wviLoy7xDNq7rCuLg": {
    "date": "9/3/2011",
    "text": "Have been here a couple times now. I had the wings one of the times and thought they were great. The honey jalepeno sauce is awesome. They also have a huge selection of draft beers and everything is reasonably priced. My only complaint and the reason I dropped a star is the smoking. It's ridiculous. I walked out of there smelling like an ashtray. It's the only reason I don't frequent Hop House.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kkERYB7BHvADjc-JOq_Flg"
  },
  "Smwv8bqlxoBw_nZitPsrIg": {
    "date": "2/21/2009",
    "text": "Our first visit to this restaurant. An enormous selection of beers. We went on a Saturday night when all the chain restaurants in the area are overrun with crowds and were pleasantly surprised to find we could be seated immediately.  The decor is nothing to write home about and the layout of the dining area is a bit odd, but I was there for the food and was not disappointed. The service was good and \"Pittsburgh friendly\" (the waitress may call you \"hon\"). Wings were 25c before 7 PM so I grabbed 5 as an appetizer. Very good, and served with a few wetnaps and a pile of napkins - too many places make you ask for the wetnaps.  The menu is extensive but not upscale. I went with the meatloaf platter - it was homemade meatloaf and a large serving. Fresh mashed potatoes as well.  My wife had pesto pasta with chicken, and she gave it a thumbs-up.  Neither of us could finish our meals so we took the rest home.   Five wings, two entrees, two drinks came to under $25 before tip.  Good value.  Other notes: smoking allowed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tdAOfrdNHBeWkASn90Lk6A"
  },
  "ZpGYii18TxaO_SGH2jv6LQ": {
    "date": "5/4/2016",
    "text": "Again, just a review on the takeout.  Ordered the same thing, Guinness French Dip with fries. The sandwich was yummy and the fries were super great compared to last time. A++",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gWLeQBH2tgHk6OsBAUzNxA"
  },
  "qnjwWpu3dbEwgc8Wve9_Lg": {
    "date": "1/4/2016",
    "text": "Low brow all the way, caters to yinzers and smokers . Actually I'd give a 3 but the pizza was very poor, went yesterday. The crust was stale, yes old and stale and about the worst one I've ever had at a restaurant. The crust looked nothing like a wood fired pizza except for black dusting on the bottom.  Down market! Oh well, there are plenty of Pittsburgh palates that will appreciate them, go steelers. Lol",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iH_fFp5HO4DI1DmZM4vQcA"
  },
  "9Snmttt2UVPIGmYmx-bXPA": {
    "date": "11/4/2017",
    "text": "Great food and drink specials, it's nice that there is a non-smoking section. Wings are great when they aren't undercooked.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wDEUVdBgVqNhqj5v3WFzYQ"
  },
  "OUzrKI48JbqQpU-nnsex4A": {
    "date": "8/9/2016",
    "text": "This is a good local bar to watch a sports game and have a few drinks. If you want bar food they have it. I wouldn't visit this bar with a large group due to the bar's size/shape, but it's a fun place to meet up with a buddy for a few cold ones.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LzZPZDlXiEv9adPzdN4gzw"
  },
  "xVje2rTQCLm2VneyAJ8ybQ": {
    "date": "12/12/2012",
    "text": "There are definitely things I like about The Hop House and then there are things that I don't.  Overall the place looks and feels like it could use a good cleaning.  Perhaps the smoking contributes to that.  And the service can be hit or miss: sometimes I get great service and other times I feel neglected.  However, if you can look beyond all that (or find a seat where a fellow patron won't blow smoke in your face), you might just enjoy yourself.  I used to frequent The Hop House weekly for wing night.  They have a decent selection of wing flavors that will not disappoint.  I used to enjoy their salads when they had fresh ingredients and eye pleasing presentation.  The last time I ordered a salad, however, it seems things have changed.  Perhaps the salads are a gamble.  Items of note do include the house pretzels that come with this cheese dip unlike anything I've ever tasted and the amazing spinach dip, possibly the best I've found.  My go-to favorite, though, is the Secret Club sandwich.  Everything about it says yes: Turkey? Yes. Ham? Yes.  Bacon? Yes. Smoked Gouda? Yes. Sundried tomato spread? Yes. All on sourdough focaccia? Yes again.  Their draft beer selection isn't too shabby either.  For me, The Hop House is a good local standby.  The location has changed names and owners a few times but it always seems to turn into a place with good beer and good food and a place I find myself when I just can't decide where to go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WoKCLSctS7G2547xKcED-Q"
  },
  "T71HPQdqzZj5P4kxJxhZ6w": {
    "date": "7/25/2014",
    "text": "I highly recommend the wings! Their wing night is Wednesday 0.35/each from 7-12. They are reasonably priced if you get them outside that time frame too. Be forwarned, wing night is PACKED and it's hard to get a table or seat at the bar. favorite wing flavors: honey jalepeno (not spicy at all), southern bleu, and garlic parmesan.  If not getting wings I highly recommend the pizza. large pizzas are on special on Thursdays. favorite pizzas: Buffalo chicken wing,The classic (no sausage,no green peppers),the chicken and spinach, and the bbq chicken.They always have a wide selection of drafts too and run various specials throughout the week. Always a great local stop!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gFsqraWQfG46ohVFRg_d3A"
  },
  "211Kw600NGGtWnFedt0d7w": {
    "date": "4/21/2013",
    "text": "This is a smoker friendly restaurant, so make sure you understand that before you go.  You will definitely leave smelling like cigarette smoke, so I can't recommend this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "qIWAplNo75TBMhXRcXoyrg": {
    "date": "2/29/2016",
    "text": "This is our 3rd time here and we will be back again. So far the food was really good (pizza crust was awesome on all 3 pizzas we tried so far and appetizers were quite yummy), service is friendly and welcoming. This is not a fancy place and they are not trying to be - just a good spot to come after a long day and enjoy a drink and a smoke (yes, there are people who like being able to smoke during their dinner)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vYuIYxzWiDAOOlRuIOd5vQ"
  },
  "mXflzBMwuzJmRZBkZq16eA": {
    "date": "1/4/2015",
    "text": "IMPORTANT - 18+ ONLY. There are no non-smoking sections and smoke flows free throughout. Not recommended for people who don't like or can't take smoke.  The food: - The food is decently priced, but chips come with the burger instead of fries. Cheap. - All of the food kind of has a twist on it. If you don't like surprises, choose carefully. Everything has some odd spice or sauce to it.  - The fries have a strange seasoning on it. The actual fry is good with the fry being long but I'm not a big fan of the seasoning. - The burgers are good, but come on more of a hoagie bun than a normal bun. - The pretzels are large but the cheese sauce that comes with it is nasty. Stay away from the jalapeno cheese, as I wouldn't call it cheese. The beer cheese is okay. - The chicken strips/tenders have a panko type of breading on them.  The venue/staff: - Parking is a bit odd and fills up easy. - The place is set up odd as you walk right into the smokey bar and then there are 3 rooms added on without a ton of people in them. The last room looks deserted and should become the non-smoking room. - The staff isn't very good. The place is big and not so crowded and the waitresses consistently enter and exit from different area's.  Would I go back? Once you maneuver around the food and get rid of the twists, its okay, but the smoking ruined it for me. I won't go back until a non-smoking area is created.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "7nIzgNF7YzI-UAyYr3y9hw"
  },
  "IEzyWfnnN33L30K00_N4Zg": {
    "date": "12/20/2012",
    "text": "Smoking is allowed in this place. Wing sauce was very oily. Not going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "5maKYe53uqZXZRqoJEFuJA"
  },
  "-LCCR8wpgZGBj4vOIYkJWw": {
    "date": "9/6/2012",
    "text": "I ate here this past week with my girlfriend for dinner.  While I have been here in the past, it has definitely been awhile and so we decided to come here for a relaxing evening with some bar food.  The restaurant sits off of Babcock Road and does not look like much from the outside while the inside of it is friendly enough.  One thing to note though is that smoking is allowed inside the place.  They have signs on the door saying as much so you can't say that you are surprised whenever you get inside but it was not something that I was expecting.  Since it was a seat yourself place, whenever we got inside my girlfriend thankfully pointed us towards the dining room in the back and away from the people that were smoking at the bar.  The dining room actually had a surprising number of TV's inside of it and it you would be hard pressed to be facing a direction in which you could not see at least part of a TV.  I imagine from that standpoint that this would be a good place to catch a game.  For dinner my girlfriend and I decided to start off with some friend pickles while I ordered the Crispy Chicken Sandwich for my entree and my girlfriend the Balsamic Chicken Wrap.  The pickles that we started out with had a good tasting breading that we enjoyed even though our server seemed to forget the dipping sauce that was to come with it.  My Crispy Chicken Sandwich ended up consisting of a fried piece of chicken covered in BBQ sauce and topped with onion straws covered in hot ranch, which were more like onion rings, and finished off by a piece of mozzarella.  It was really good and I have to admit that I was happy to have ordered it.  The side of fries that came with it were hot and crispy which helped to make them almost as  good as the sandwich.  My girlfriend also said that her sandwich was good too.  Thankfully, we were able to get our check and sneak out right before a couple of customers next to us began smoking.  The bottom line for me is that I will probably not head back here in the future.  Its not due to the food as it was cheap and I was very happy with the taste of it but more with the smoking.  I am surprised that smoking is still allowed inside of here and while I personally am not a fan I understand that many are.  However, I just don't see myself coming back again while it is allowed as it makes for a poor experience for myself and my girlfriend.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "WbLh1U9NwmhosC_mhPdGLQ": {
    "date": "8/23/2011",
    "text": "The first thing that greats you when you are about to walk in the front door is a sign welcoming smokers. After walking out I smelled like I had been smoking for years. My coat, cloths, and hair smelled of cigarettes. I was originally drawn here because they have $.20 wings on Wednesday nights. The wings were good but on the small side. Bottom line, it's just too smokey for me, and I probably wont return.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 10,
      "cool": 2
    },
    "photos": [],
    "user_id": "DOajn8AtMjNtCZ87YoIlwA"
  },
  "tJC4bmCMdSm52haTIx0jbA": {
    "date": "11/13/2013",
    "text": "This Hop House location used to be my absolute favorite. This was my go-to place when my friends and I were craving good bar food. Sadly, over the past few months this place has started to go down hill. Waitresses take forever to get to you to even take your order. Then when you finally do receive it, it's cold. Yuck. I could excuse this if it has only happened once or twice but it has happened quite a few times now. I work in the restaurant industry, I know when I'm being served food that was possibly a mistake order and has sat around for about an hour. I wouldn't feed that to anyone, and I would expect the same. We used to visit this place at least once a week. Now it's just no longer appealing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "IXD-jdycm7m34b_Nliy82g"
  },
  "H_pVkHgNzx5_EF9J_AHWUQ": {
    "date": "3/16/2012",
    "text": "I pulled up and it had this dive/diner kind of feel to it.  I was skeptical, but it's much warmer once you get inside.   I was a bit late to dinner, so there were already some soft pretzel appetizers sitting on the table waiting.  They were good.  They were probably the only good thing I ate all night.  The woodchuck cider was also equally as good.  The fish sandwich was okay enough.  Kinda over-fried though.  The fries were not good.  I mean, there are so many places that do fries well.  Fries are kind of a Pittsburgh thing (I mean we put them on everything...) so you gotta do better.  I think these may have been frozen ones out of a bag or something, but they were something you'd expect at some high school baseball game concession stand.  Not pleased.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BTKtAXjPHjH5B3xuT4uiIw"
  },
  "MdSW-L1VSCWGnBfsUKhfjQ": {
    "date": "2/14/2012",
    "text": "The Hop House has a great menu at a great price, especially because they have regular specials on the food. Their appetizers are regularly half price at night and the chicken wings have some fantastic sauces. I'd have to say that the best part is the beer selection, any beer snob will find a few drafts worth exploring, and they rotate in enough new ones to keep me coming. The walls also have plenty of TVs so it's a great place to catch a game. It's a smoking establishment, so if you hate smoke you'd better prepare yourself (there's some booths out of the way of the bar area that you might want to sit at, its generally a bit less smoky there).   This may be a personal rant but I really don't feel like it's fair to snub this place because they allow smokers, if you don't like Asian food you won't like an Asian restaurant, if you don't like smoke, it's fair to say you won't enjoy a smoking establishment. No reason the business should suffer low ratings because they choose to allow something you might not like. In terms of smoking establishments that serve food, which are fewer and fewer in PA, this place is pretty darn nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QkZqYX7zxQOZewe1e6RjAQ"
  },
  "N9IkUn2-wp9uk6a6_9jHZA": {
    "date": "9/15/2015",
    "text": "I've been here a few times, both with other people, and on my own.  As a non smoker, it takes a lot for me to come here, but the food is marvelous, and the selection of beers has few equals in the area.  However, there is an issue which may prevent me from going back      Every bar has it's regulars, people who seem to be there just about every time you go there.  There are just people who love being at a bar, and/or have nothing else to do.  There are two regulars at this bar, who appear to be a couple, whose arrogant, crude, and obviously inebriated behavior turned me off, and I've dealt with these people more than once.  He is a larger, bald man who apparently believes everyone should be afraid of him, and his companion loves to be drunk, sing into her bottles, and berate the servers/bar staff if their service is not up to speed, in her badly skewed view.  Another problem seems to be, that, from what I've been told, these two are friends with the senior bartender, a heavy set girl who clearly has control issues, as she constantly berated/corrected her co-workers, despite their appearing to be doing their jobs satisfactorily, while I was there.  I wonder if the owners even know about this.  If they do, you wonder why they let this continue.      If it were not for these issues, and the smoking, which is beyond my control, (the law is the law), this would be one of my favorite places.  Sadly, when you avoid part of the building because the bartender's friends are drunk and belligerent, and you see the bartender obviously doesn't care, I might be more likely to stop back more often.  I do not know the schedule there, so it's hard to gauge when these people might be around.  There are other bartenders there, who's service is fine, and who are genuinely friendly, even when it's busy.  Not their boss, clearly, who seems more interested in getting her friends drunk and being a bad boss.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HGN2YMZAhp1Swkb9f3rEIg"
  },
  "vK84I71pDcUDk4V9r75wiw": {
    "date": "7/28/2013",
    "text": "Service is just awful, which is a shame because the prices and beer selection are very good. Still cant give this place anymore than a single star because the service is that bad. Come on servers... If you hate your job that much work somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "CnlxPu4hFgmu5HZzJ-PdLw"
  },
  "3FrQWpjzAS4cMcZhvmxQrQ": {
    "date": "8/6/2013",
    "text": "This was the worst service i have ever had.  Where to start : first i order a beer and the waitress pours the wrong one and the one i wanted was out. Then i order a wrap and my husband got a pizza. Waitress puts in the wrong wrap and when i tell her that its wrong, i don't get an apology i get \" oh haha i entered the wrong wrap\" then she waits on 5 other tables and puts my order in last. so i have to wait over a half hour. i tell her to just make it  a to go order. i never got an apology.  just very rude.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZmwCRCzrpSq8Bd1Yps3oWg"
  },
  "sJ8HuXkMtv_5gN80lzKwoQ": {
    "date": "3/14/2016",
    "text": "The place empties at night because some of the staff at the North Hills location, get off work, sit at the bar, and load the juke box with god awful Hip Hop / Thug music.  They act like they are in the hood.   This ain't the hood girls.   You can actually watch the place empty as these employees take it upon themselves to give everyone in the place a splitting headache.  You can play your own music, but the moment your songs are done, get ready for a barrage of non-stop thumping, repetitive garbage.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GL9r2hwguu1oUa_MYqPsPg"
  },
  "WRL6_aE0GVtwzeMkOvqxcg": {
    "date": "11/26/2012",
    "text": "Well the reason i dont go here anymore is because the smoke just overwhelms you. The food and the beer are great. But it just feels so packed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "x7m8WLepkOjdA5FKimxyXg"
  },
  "Mw5GONBiR0VnpSUkftx50w": {
    "date": "6/1/2019",
    "text": "We haven't had any issues with Hop House and enjoy ordering from them frequently. The Mac and cheese is delicious. The pizzas are pretty good. But the pot stickers are really where the secret is. They're SO. DANG. GOOD. even my toddler tried to steal them from us when we order them!  Disclaimer: we don't frequent the actual restaurant, we only do delivery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tAZpSK7xTst3YZAnSOIiew"
  },
  "QFXbjXtWLGjiU-cobSLvZw": {
    "date": "8/7/2019",
    "text": "I went to the Hop House for dinner and drinks on a Saturday night and it was mediocre. The bar area is smoking so if you are looking to sit at the bar and don't like being in an area surrounded by smokers, this might not be the spot for you. Food was mediocre but our waitress was very nice and accommodating ( I'm sorry I cannot remember her name).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r35IgvyOy-6A30ieweQUGQ"
  },
  "dncqbPduJWN5V89alJS_HQ": {
    "date": "7/7/2019",
    "text": "I've lived in the area for about 6 years now but only just tried Hop House because I knew it was a smoky place. We sat in the restaurant area which is separated by a door but it still had a bit of a smoke smell. And the bathrooms and entrance/exit are through the bar so you have to go in there whether you like it or not (I'm in the \"not\" camp). We ordered hot garlic wings and the sauce was so strange. It was thick and creamy. I've never seen wing sauce like it before. We had to scrape most of it off. The loaded fries were decent but I didn't like the buffalo chicken dip. I thought it was bland. For an entree I got the steak sandwich and the onions were very sweet so that turned me off to what otherwise would have been a good sandwich. The server was nice and helpful and I appreciated that she managed our big group well but I will probably not be returning.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEUSn63CFm79Cr3o0hTUtQ"
  },
  "wEjb6A_TMv2ijOESrd9IYQ": {
    "date": "7/27/2019",
    "text": "We tried for the first time after being in the area for 4 years now. The food was decent and what we expected. My chief complaint is when entering you, from the signs we seen you are forced to walk through the bar/smoking area to get to the dinning area. Now I'm not sure if it was just a slower day and the closed the other doors until the picked up, but everyone was forced to go through the bar. We will be back as for the quality of food and price we will be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VZCOaWFsgPeEL_4TTMFl3w"
  },
  "d9bqETWTRCR8Zk08ZtpCCw": {
    "date": "5/29/2018",
    "text": "We tried The Hop House through GrubHub because we had a decent promo code. First and last time unfortunately. I got a chicken wrap. The wrap itself tasted burnt and it was filled with old, brown lettuce (see photo). The fries with it were very cold, beyond the 15 minute delivery cold that you may expect. My husband got the Mac and Cheese and said it was okay.   Two stars because if the fries hadn't been freezing, they would have been pretty good and my husband didn't hate the Mac and Cheese. But that wrap was unacceptable.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0MI4QFA-7zP7cGmFvXqi_g",
        "caption": "Photo of The Hop House - Pittsburgh, PA, United States. Old brown lettuce that came in the chicken wrap",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0MI4QFA-7zP7cGmFvXqi_g/o.jpg"
      }
    ],
    "user_id": "xKR85VrcBBsIVfNmDT6ADQ"
  },
  "5PY1lededaF5-sCtE-ZEdA": {
    "date": "3/18/2019",
    "text": "I come here almost every week for wing night, and I always love it. The servers are all great, and the food is consistent and tasty. Only one really bad experience I've had was last Wednesday, we went late and we always sit in the non smoking area. When I say late I mean around 945ish. Halfway through, 5 obnoxious guys come back and light up cigarettes. Not once since we have ever been there since they made the back non smoking have we seen that be acceptable. I said something to them about how it was non smoking, and they yelled at me that the bartender gave them permission. It really was ridiculous and all the waitresses ignored them. I spend a lot of money here, like I said, I come here probably once a week, and that was really obnoxious. There's a reason the back is non smoking and I didn't appreciate that. I'll be back though, hopefully that doesn't happen again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zEYmgx7hj3_azHkk8anJuw"
  },
  "ksRswJtIn61WZSSIYXKOxw": {
    "date": "11/12/2018",
    "text": "Dayton the bartender is amazing we went there three times and she knew our names and what kind of beer we liked to drink. The wings were delicious and you can't beat the price! The lower score comes from the old beer bottles(stick to domestics) and the smokiness of the bar they need a better ventilation system.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fM6BuLXeoxo7_jfCTavVQg"
  },
  "Wh7fbejh1CpI0oYZnavTUg": {
    "date": "12/29/2016",
    "text": "So in total fairness- even when I lived in Pittsburgh I thought the North Hills bar scene was pretty pathetic. When my friend wanted to meet up on the evening of Christmas Day, this bar was at least open at 11 pm.  This is your standard Pittsburgh dive bar and is comparable to Shenanigans down the road. My mixed drink was $2, which as a resident of D.C., left me shocked. The drink was mostly sours and small, but I almost wished to move back to somewhere so inexpensive. The kitchen was closed, but they do $4 pizza and appetizers later at night apparently. The kitchen closes early, though, most week nights. I might have been interested in trying the food another time, if not for other issues.  As other have mentioned, you will be thrown back to the 1920s and shave five years off of your life as you inhale second hand smoke. My friend and I went in a back room where there was no one smoking, but you cannot really escape the stench. The people drinking in here could be defined as Yinzer trash, as it was all white people making audible racist remarks, while throwing food at each other. The bartender was rude and did nothing to stop this, which was really not OK. I am more than ecstatic to be a city dweller, and had I not forgotten my ruby slippers, I would have clicked my heels to go home. This is not the scene for an educated young professional, to say the least.  All in all, two stars for being cheap and being opened when nowhere else was. I hope to not come back here.",
    "rating": 2,
    "rated": {
      "funny": 8,
      "useful": 13,
      "cool": 9
    },
    "photos": [],
    "user_id": "Ic6-gs1_FjrWGx6JIr95Mw"
  },
  "vE0NYRD1L99DYu-M1NFaBg": {
    "date": "9/2/2018",
    "text": "This place looks divey from the outside but their menu is amazing and they have a good beer selection. Our waitress was friendly attentive and our food came out quickly. Definitely will be coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2zJksXKy-Hfeh94bCIINBA",
        "caption": "Photo of The Hop House - Pittsburgh, PA, United States. BBQ Mac n cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2zJksXKy-Hfeh94bCIINBA/o.jpg"
      }
    ],
    "user_id": "TT1uF1-WNZchdYwQ0U7x_A"
  },
  "a83BB9Kp7-eW9VFuCdpDSw": {
    "date": "11/11/2018",
    "text": "Terrible,,, Bad service by waitress that didn't want to be bothered with food and drink  orders or any questions we had concerning the menu.. food was below par and wasn't worth what we paid. Draft beer came out warm and every time we ordered another drink we inconvenienced the waitress with an attitude. The place was dirty the kitchen was filthy,,our table was situated right out front of the kitchen door.. i'll never spend another penny in this place again...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ncJL8CTuO6SUB_ETx6OXXQ"
  },
  "xAEwgbsS6sq9EmJgKpaUaQ": {
    "date": "4/26/2018",
    "text": "Did an over the phone order. Went to pick up, and it was really busy. The waitress/bartender had brought out a to go order and I thought I might free her hands and let her know it may be my order she had.  She then gets attitude and says, \" Well, it's not, and who are you and what did you order?\" She then realized how she acted and came over to apologize.  Waiting, they told me they didn't put the phone order in. So, I waited for my order. The other waitress was really gracious and apologetic. Word of advice: A lot of your customers see if you're busy and stressed, don't hang your attitude up on those who are patient.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "50I2yugofcxQwfBB_FSrQg"
  },
  "3tvPCDQhcKebgdf1uUxeCQ": {
    "date": "3/19/2018",
    "text": "I've tried this place twice and I just can't get on board with it. The first time I ate here and it was mediocre. I had a pizza. The second time I just stopped in for a drink at the bar with my husband. It was very smoky and I got some dirty looks from the people I would presume are regulars here. The prices weren't great but they did have a fair number of beers on tap and TVs over the bar with sports on. One thing I did appreciate is that the music playing was really random and spanned a lot of genres, so that was fun! Sadly this isn't a place I'll go back to though.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3RCyqHVXIgUFZbUVgr73A"
  },
  "-4gvsLA_9zyqpmNdFUDglA": {
    "date": "7/28/2018",
    "text": "Decent place. Updated from the last time I was here years ago. The food was decent for bar food, good beer selection and they allow smoking! Surprisingly fresh and good salad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KCHbs_KET1F4bbTlrrt5bQ"
  },
  "5wGR9BTZ7It7NO16dEw0nw": {
    "date": "11/22/2017",
    "text": "First time we went, left feeling like it wasn't worth trying again. Months later, I returned for the 35 cent wing promotion. The bartender was very friendly and the wings were great value with unique sauce options. There was no tap list but the bartender politely offered to read them all off to me. Returned for a promo I saw on their menu and website. At 915pm I asked to order the pizza special. The bartender told me that was only Thursdays despite what I was looking at on the menu. I then asked to order the $4 appetizers on special from 9-10. The bartender again said no...it was now an 11-10 special despite what the menu said. I left without ordering and passed on my review via Facebook. I was shortly thereafter contacted by the owner who apologized for a miscommunication but said \"there is only a pizza special on Thursday, but we do have $4 specialty pizzas 9-10 every day.\" So yes...there was a pizza special that I was not allowed to order due to a miscommunication. After offering a gift card, I turned it down. They then asked me what it would take to take down my negative review. I basically said I was not one sided about my review. I pointed out the quality wings. I even chose not to review until my 3rd time here. I said I would change my review when service gets consistently quality to where I don't have to leave the establishment not able to order food. It appears that since then they even took down their Facebook review option. I just found it fair to share my thoughts and it said a lot when the Facebook feature got taken down over one constructive public review",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y0p4w18vaUtU3K0zyMcR0g",
        "caption": "Photo of The Hop House - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Y0p4w18vaUtU3K0zyMcR0g/o.jpg"
      },
      {
        "img_id": "xZnbxfZknJZNSAnIYOFQbw",
        "caption": "Photo of The Hop House - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xZnbxfZknJZNSAnIYOFQbw/o.jpg"
      },
      {
        "img_id": "2hfqLkB2dVE3NpgkFJeC2Q",
        "caption": "Photo of The Hop House - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2hfqLkB2dVE3NpgkFJeC2Q/o.jpg"
      }
    ],
    "user_id": "yBQ48jYofc1Ob2idVCZgEg"
  },
  "xojC0O3ECB06mdkCBOeOxA": {
    "date": "3/7/2019",
    "text": "First off, let me say, I've never been to the restaurant, so I'm only reviewing the food.  I've ordered delivery from here a bunch of times, and I'm always very pleased.  First off, the prices are cheap, too cheap in my opinion (hopefully they won't read this and raise them), but it's only $7.50 for a half pound burger and side.  They are not the best burgers I have had, but I'd give them at least an 8 out of 10.  Their \"seasoned fries\" are really great to go with the burger.  I also order the BBQ pulled pork pizza.  It's $6.95, and they put so much pork on it, I can never finish it.  I'd definitely give the pizza top marks.  I order through Uber Eats, and it's a way better place to order from than their competition on the app, which is Stokes Grill, which is higher priced, and their food isn't that great.  Definitely a good place to order from, I get food from there at work at least once a week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Gn52HDDe_aYUN2lYHLQWQ"
  },
  "73WcpGQHiyiDQYaoFhTjZg": {
    "date": "11/18/2017",
    "text": "The food here is amazing! Best wings in town. I cannot bring myself to eat here though because of the smoking in the restaurant. It's completely overwhelming and makes this place impossible for me to eat at. If you can deal with the smoking this is a must try. I fully support the businesses decision to allow smoking -power to the business owner- also the service is pretty terrible",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w73qkHAVHjDN4ET6QX4hdg"
  },
  "fhXcaC6wtcS1KUc4nxoy8A": {
    "date": "12/16/2017",
    "text": "The service at the hophouse couldn't be better,  nikki, deighton,Jen, tiffany, Jen, Melissa and deb are best staff you can find in the north hills.  I continue to frequent this location because of the amazing staff,  introducing me to there ever changing beer list and delicious menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "92xi_OHnZcFWSDgb_BZEEg"
  },
  "767BHSzblsi_ycZI5gYXxg": {
    "date": "12/5/2017",
    "text": "We've never been to the actual restaurant but with the food we have gotten on two separate occasions (on UberEATS) we may just have to go! The Mac & Cheese is literally the absolute best Mac & Cheese I have ever had (I make a good Mac and I am jealous of their recipe). We just got the wood fired pizza tonight and it did not disappoint. But that Mac & Cheese. Will definitely have to go for that again (and maybe try on their wing night!)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ne8PfMEbtSuhL8hKApYm3Q"
  },
  "NQNtGT1ita-qr6KCMUE7Ow": {
    "date": "11/26/2014",
    "text": "First and foremost I need to warn anyone who goes here that is a \"Smoking Allowed\" restaurant. What? Is it 1998 already?  We were there on a Tuesday and I guess it was busy for a Tuesday because the service was super slow and there were a lot of people there. Luckily I was in good company and had no where to be, so it really didn't matter.  The drink specials were pretty sweet, my mom and I treated ourselves to Pumpkin Martinis, they weren't very strong but they were delicious. Unfortunately our waitress did not have talent in carrying multiple martini glasses because a lot of the drink was dripped down the sides!   For dinner I had the Secret Club on a focaccia, not bad. Typical bar food and the fries were fresh cut but waaaay overdone and hard! I stole a couple of my bf's fried onion bits and they were delicious!! I would recommend the Siracha BBQ sauce to dip them in, very yummy!  All in all it was good, could definitely leave out the patrons at the next booth smoking, but the atmosphere was fun and it was clean enough. The menus could definitely use a wipe down!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "yUjc3tYhBFHKUIVGKYWKFA",
        "caption": "Photo of The Hop House - Pittsburgh, PA, United States. Hop House",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yUjc3tYhBFHKUIVGKYWKFA/o.jpg"
      },
      {
        "img_id": "op9o96wKwnyMHmQbeNu9bQ",
        "caption": "Photo of The Hop House - Pittsburgh, PA, United States. Secret Club",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/op9o96wKwnyMHmQbeNu9bQ/o.jpg"
      },
      {
        "img_id": "eg2YQ-GhpxfKYiB3j9erYg",
        "caption": "Photo of The Hop House - Pittsburgh, PA, United States. Pumpkin Martini",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eg2YQ-GhpxfKYiB3j9erYg/o.jpg"
      }
    ],
    "user_id": "FKr7b-cAe-3JW7sl8IqqHA"
  },
  "NPUFiah45tXyKhKyeyhQ6g": {
    "date": "4/27/2017",
    "text": "Come here for the food and prices not the service. Great wing prices and late night menu. But I have to pull teeth to get a drink under 12 minutes.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nKqqytfqc_I_-nDZBOFw7A"
  }
}