{
  "5rw6Ya0khDNT7zAPmAGx9Q": {
    "date": "4/10/2017",
    "text": "The food was yummy although it was a little pricey, but that's not the reason for the three stars. Our server was miserable. As someone who has worked in the industry for nearly a decade, I understand what it is like to be stressed out or in a bad mood at work, but that doesn't warrant you to ignore your tables or be flat out rude. I would give a name but there was no welcome, introduction, check-in, or thank you from this server. She seemed annoyed at our presence the entire time despite the fact we are laid back and go out of our way to be kind to wait staff. The rest of the staff that we interacted with was very kind but this server in particular really but a damper on the whole experience. Judging from the other reviews, it seems as though others may have had a negative experience with her as well. For a place with such yummy food and a cool vibe, I really hope that you are able to cultivate a friendly and accommodating staff in the future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eZ_70OEpRlGKOYxf_i3V6Q"
  },
  "hjeVHGoIx3WOOf1i-3m-0Q": {
    "date": "10/1/2014",
    "text": "After hearing so much about Dinette I finally tried it with my granddaughter..  My bill was close to 50$ and all we had were two pizzas and a single glass of wine.. The pizza was mediocre with burned toppings and the crust was way over done.. Also the toppings were sparse and ungenerous... I am used to gourmet pizza and seek it out; yet this does not qualify..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aKF49J-SnbHxWhX5XOx-Xw"
  },
  "0Dkgr_-m--Qv1ng3Z9dJtQ": {
    "date": "7/28/2015",
    "text": "*****This is what pizza should be, reminiscent of the great pizzerias of Naples and Tuscany. *** Best pizza in Pittsburgh***** Great variety of personal pizza that is meant to savor freshness of a few toppings. This is a concept very much unlike the vast majority of  greasy, cheese-product drowned so-called pizzas around town. Ingredients are local produce, fresh, different sauces. The starters are just as excellent. +++ Great place for simple pizza dinner paired with among the best Italian wines, and yes great family restaurant too. +++  The chef/owner is very inventive, truly deserving of the awards she received since the place opened.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SaIpptv0CgJP9LdHOzDRtA"
  },
  "FFngOeIM7GCCnEyIgq_X-Q": {
    "date": "11/17/2015",
    "text": "This is one of my favorite restaurants in Pittsburgh. The menu is small but they do a great job of everything. The pizzas are very thin and topped with fresh and inventive combinations. We usually share a pizza (even though it is sized for one person) because then we can order more starters. Our all time favorite is the Frito Misto. Sonia Finn is a great chef!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jNVXXXxJPIGhs0OTd7DokQ"
  },
  "rKQ97irhaWCJH1UwyE5OKA": {
    "date": "4/24/2015",
    "text": "Always perfect! Must be our 40th visit in 7 years. Try the salt cod toast and the jalapeno, anchovy and caper pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P7Z2_uEbFi4yHirLMnQFOg"
  },
  "y6fUAocKo9TOLVZjoeDTWg": {
    "date": "12/28/2012",
    "text": "The restaurant was very crowded and noisy. Some baby was screaming throughout the entire meal. The noise was exacerbated by the lack of any carpet or tapestry to muddle sound. The menu had very small print; it was practically illegible. The waitress was very helpful at interpreting the menu. The pizzas took a long time to arrive. I expect this is normal. I recommend ordering an appetizer to mitigate the long wait. Once they arrived, the pizzas were excellent. I need to try roasting fennel now.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oCXlO9gzXBG5R_68fnV8Fw"
  },
  "AJaH_mxPZIaK3HvV4kRXWw": {
    "date": "6/14/2014",
    "text": "Dinette is a beautiful little place, surprisingly so for what is essentially a mall location. Lots of natural light and great western exposure, providing a nice, warm ambiance. Their pizzas are good as well, nicely crisped thin crust and good quality ingredients. The menu changes frequently, but the seasonal roasted corn and zucchini pizza was very good. The simpler ricotta pizza was also good, although it would been improved by chopping the basil. Overall a nice place, although the price point is a little steep.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zVPw5ldTG3xCktNZ2N_EYQ"
  },
  "lCSKoSh52YLvZn17iP9TLg": {
    "date": "10/27/2015",
    "text": "I will never attempt to go to this restaurant as long as I live. We were told the wait would be 30 minutes. At around the 30 minute mark, we inquired again and she told us we were next. The restaurant did not have enough tables to sustain more than just groups of two. Our group of four was just too many for this place. We watched as 6 couples, that came after us, were seated before us. They never updated us or apologized, they chose to ignore us. At 55 minutes, we had enough. This place may be okay if you and one other person wants to dine, but they cannot accommodate any more in a timely manner. This place wasted our time, but it will never waste it again. A little customer service goes a long way.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z3M9UvHzSNsVXH5A1SsqTw"
  },
  "dwU9RzbthaDiBuLdYeOFEg": {
    "date": "6/1/2016",
    "text": "Undoubtedly some of the best authentic pizza in Pittsburgh. These excellent thin-crust pies are sized for one, and could come straight off of a plaza in Florence or Rome. The menu is short, well considered and delicious. A favorite with the kids that will leave even serious foodies delighted as well; complimented by unfailingly gracious service. Very highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bE7y-PVHGzAaWOX_fq4Ulg"
  },
  "EtnvyhemVXrttqEX6N3vUw": {
    "date": "1/16/2016",
    "text": "Just tried to call and place a takeout order (it says they do takeout orders) and the person on the phone told me they only do takeout orders if you come in and place the order...i.e. causing me to have to wait there while the food is cooked and waste my time...since not all of us live within 2 blocks of the place.  So yeah my response to that is....first of all WTF - that doesn't make sense.  Second of all....are you kidding me?  I was about to be a first time and repeat customer and now I'll never be a customer there because now I think they're either trying to be elite and hipster or are just plain dumb.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gjxCPUu2ACMk_6y2m0-bAA"
  },
  "3pqTs4cFc2Tb5JglhvUZFQ": {
    "date": "7/18/2012",
    "text": "My husband and I consider Dinette one of our go-to places for dinner. Two appetizers and a pizza to share is perfect for our appetites. We have consistently enjoyed their creative salads and starters, and you really can't go wrong with any of the pizzas. The fact that they try to stay on top of what is in season is only another plus, in our book. The only downside, in terms of food, are their desserts. We haven't tried a single one that we've liked, and usually go across the street to Spoon if we are in dire need of some sugar.  It gets a bit loud, and it toes the line between being a nicer sit down place, and more casual eatery. Highly recommended. If you are familiar with Delfina Pizza in the Mission district of SF, this is pretty much a blow by blow copy? predecessor? to that. But with less hipsters.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ckMFtaljrmXWaSiQqk9ZWA"
  },
  "sHBpPNbQZhusSpriDkNn0Q": {
    "date": "9/17/2015",
    "text": "All of our group of 7 agreed we would not go back. Pizza was just OK, toppings sparse, and expensive for even really good pizza. The noise level was terrible. High industrial ceilings and crowded room with screaming kids = unpleasant dining experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "InH4_bRBik5jpD992WHEkA"
  },
  "6iqLGAF9CVXIb5H4QuKJpg": {
    "date": "8/31/2014",
    "text": "Great pizza in a cool atmosphere. Liked being able to sit at the counter and watch the cooks at work.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7GIRIMa4YftEZcwagANzMQ"
  },
  "2Ty1FsHMafUWseUncWVGJQ": {
    "date": "2/2/2014",
    "text": "A terrific, trail-blazing restaurant by a James Beard-nomimated chef. Dinette has been serving locally-sourced, terrific food years before it became hip to do so.  It seems like the biggest problem people have is that even though the entrees are all pizzas, this is not a \"pizza place.\" They don't do substitutions (other than for allergies), as each pizza is carefully created by the chefs.   But their appetizers are criminally underrated. Simple but perfectly executed, these are some of the best dishes in the city. The changing fritto misto, the grilled shishito peppers (on the menu for years before Butcher and The Rye debuted them), the tartare...amazing!  I also really like their carefully chosen wine & beer selection. So many people love that they offer $1 cans of yuengling! And having each wine available by the glass or bottle is an excellent touch.  Man I wish I was eating their pizza right now.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wSyyIXD587rqo4Ep_DPFaQ"
  },
  "eS9gEeNcceeFQ8whzW53hA": {
    "date": "4/14/2011",
    "text": "This is an adorable little restaurant.  Many of the walls are covered in large windows, and the room fills with sunlight in the evening.  Also since the restaurant is up high, you get a nice view of East Liberty.  Parking was easy, in the lot just off Highland.  They don't take reservations, and its a very tiny place, but we didn't wait more than about 20 minutes and there were TWELVE of us, so that's pretty amazing.  Everything at our table was just cute - the fun orange chairs, the simple flowers in glass vases - the decor was clean, with just a hint of quirk.  IKEA chic?  The menu is small, and the ingredients are fresh.  Tomatoes and herbs are grown in a rooftop garden.  Also, the chef is a very talented woman who is a James Beard Award semi-finalist, so I had some pretty high expectations!  I love supporting restaurants with female chefs.  So the wine by the glass was a wee bit pricey (about 1/4 the cost of the bottle, around $8-10 per glass).  I wanted some wine, but since they had beers for much cheaper, I settled for a Victory Prima Pils, which the server poured for me.  Dinette also offers $1 cans of Yuengling, which many of my dining companions enjoyed.  Pop is $2.50 for just a small bottle, but they pour it into your glass and give you a *metal* straw to drink with.  I got a huge kick out of that - don't think I've ever seen a straw like that before....  My boyfriend and I started with the Grilled Shishito Peppers.  The dish comes with about 10 small grilled peppers, about the size of a jalapeno but less spicy.  They had nice grill marks, and were hanging out in a bath of luscious olive oil (really fruity, high quality stuff) accompanied by some creamy goat cheese and crunchy fried almonds.  All the components of the dish worked well together -the flavors were simple and well-matched.  I just hated to waste all that olive oil still pooling at the bottom of the bowl!  Then we had the Grilled Chicken Wings.  I was excited about the \"romesco sauce with ancho chile,\" but I have to say the overwhelming flavor of the wings was....chicken.  Grilled, a little charred, chicken.  Which was good, but I didn't get the spice, the pizazz.  Less flavorful than I expected.  Simple and high quality no doubt, but I like a little more zing to my food.  We also split the prosciutto pizza, which was very good.  The crust was thin and crispy (occasionally a little char taste, but that's what you get with thin crust, oven-fired pizza).  Sauce was light, and there was delicious bite from the arugula and the parmigiano-reggiano.  I really enjoyed it.  Next time I think we might skip the starters, maybe just some marinated olives or something, and get two pizzas.  The pizzas are definitely the star of the show, and I wish we'd gotten to try more.  I had a bite of the fingerling potato pizza and I wasn't wowed, but I prefer my pizzas with tomato.  Oh also, the service was lovely and the host guy was cute and funny.  I had to leave early and snuck behind the host stand to read a menu to add up my total cost, and then the host comes up to the stand and goes \"table for two please!\"  hilaaaaarious!  I'd love to come back and get a few pizzas and maybe suck it up and get a bottle of wine.  Very cute place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "yaBIVHDxaUBN2YHQ8-YiuQ"
  },
  "iNvHIXIdxp2THVukQOv8Mg": {
    "date": "1/14/2012",
    "text": "Dinette is a cute modern space with a relaxed feel. There is a small bar where you can watch the happenings in the open kitchen.   I went for dinner on a Friday night around 6, and shortly after we got there it was packed! Definitely get there on the earlier side, or be prepared for a bit of a wait on a Friday or Saturday night.   We started with some $1 Yuengling cans (can't say no to that deal!) and the salumi plate. There was three kinds of meats, and a lot of it! I kept seeing other delicious appetizer plates go by, so I'm definitely looking forward to trying others in the future. I ordered a pulled pork pizza, and my husband ordered one with fresh ricotta and basil. I loved the crispy thin crust, but the chimichurri sauce on my pizza overpowered the other flavors a bit. My husband's was delicious, and fortunately he let me steal a slice. The pizzas are definitely a good size, and we were able to take home leftovers.   The menu changes often, so there's always something new to try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SQLAsm4gDiHyeKKlpO0PMQ"
  },
  "03THVeexmLoM1SB9NoXWEg": {
    "date": "5/16/2011",
    "text": "Dinette rocks! Its gig is about offering individual artisan pizzas and wine. I've been here more than a handful of times though I've only sat at the bar once which was cool to see the chefs at work. No funny business happening!  The shishito pepper appetizer is one of my favorites and have gotten it each time. The shishito peppers are grilled then combined with olive oil, goat cheese and almonds. Oh man, salivating as I write this!  The pizzas I have eaten have been scrumptious too though do have to say the one with the fried egg and chorizo was probably my least favorite. The egg seems like a great concept but it made the middle of the pizza (where it was placed) soggy. I wasn't a fan of their chocolate desert but when I go to Dinette I'm going for wine/beer and pizza. My favorite so far though has been an anchovy one, which has a bite to it from the hot peppers.  It's usually pretty packed on weekend nights so either come early or late or be prepared to hang out at the bar for a little bit. Since it is gourmet pizza be prepared to be spending $10-$20 on a pizza, which I think is reasonable considering all ingredients are fresh.  Waitresses have been friendly and attentative too so a great plus to the overall experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "57tf_RmT5o3BiFj2gpV-Jg"
  },
  "kejvIg3K-ex3ehVaFupn7g": {
    "date": "1/18/2012",
    "text": "There is something to be said for doing something better than anyone else.  Dinette has a limited menu, but the owner/chef keeps a perfectionist control on everything served in the restaurant.  Right down to the bread sticks, which are awesome.  I love the wine list, it's one of the best and most imaginative in the city.  Sometimes you should go for the bottle, because the price point often works out better.  I don't care for the chairs, I wish they had some funky old dinette chairs, but that's the only thing I can think to criticize. Check the hours before you go, they are not open on Sunday or Monday, and not open for lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "M6mxVaD5yWnaOvQFTrn00w": {
    "date": "5/14/2014",
    "text": "Great food!! The pizza's are amazing with great fresh ingredients!! And you can't beat $1 Yuenglings!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B35GfL-HjY5Od8NVPmy-kg"
  },
  "vfOTtfdKbtxcPqotNDU2bw": {
    "date": "11/6/2010",
    "text": "Somewhere, right now, in a New England liberal arts college, there's a badass cook who has been working on her pizza dough recipe for a few semesters telling her friends over good wine in terrible Ikea glasses that she wants to open a third wave-feminist, mod, pizza joint that has a decent selection of wine.  She probably won't.  She'll probably finish her degree in architecture and go on to design green buildings.  Which is sort of a shame, because if she followed this dream, there would be more places like Dinette, and that'd be a good thing.  Dinette does one thing (Neapolitan pizza + fresh ingredients) and does it really really well.  You won't find ground breaking pairings of ingredients, but honestly, I don't think you can really improve on prosciutto + arugula or squash + sage.  (This part of Penn Circle has really become a hotspot for Pittsburgh dining in the last few years, every time Belle and I were going to one of the nearby places without a reservation, she would \"hint\" that if the wait was too long, we could go to Dinette and see if the squash and sage pie was on the menu)  One of Dinette's strengths is knowing when discipline and restraint are called for.  It's pizza, good antipasto, and maybe 4 other items from cooking school.  If you don't like thin crust pizza, Dinette isn't for you.  If you want a generic pepperoni and mushroom, Dinette isn't for you.  Otherwise, go for it.  Another positive sign is that one of Dinette's early weaknesses, an uneven wine selection, has been addressed and is becoming a strength.  Specialty restaurants only have so many ways that they can distinguish themselves from one another.  Dinette's selection of wines by the glass is one and its decor (a take on mod Scandinavian) is another.  Both work to make Dinette stand out from the pack.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "VX5we4cQoXTLEGdhM-MXdQ"
  },
  "gr9oEpRHmnkfWCoudsatow": {
    "date": "11/17/2013",
    "text": "I've come here for dinner a few times since they opened a couple years ago and I've never been disappointed. The wine list is incredible, I'm always trying something I've never even seen or heard of before. The waitstaff is also very knowledgable about the wines and how to describe them.   The grilled shishito peppers with goat cheese and almonds is amazing, I order them every time. The menu says that the pizzas are \"for one\" but you might be surprised when it comes to your table. Depending on appetite, I think it would be difficult to eat a whole one, but who doesn't love pizza leftovers? If you want something sweet, go for the chocolat pot de creme and an espresso.   No reservations here, but they will take your name and text you when the table is ready. If the bar here is full, there are a several places to get a cocktail within a few blocks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cKeMks0yFeItSlkUKnZW0w"
  },
  "DKuLep_y7l6uv0fLGyn19A": {
    "date": "8/25/2014",
    "text": "Big fan! This place is easily one of my favorite places to eat in Pittsburgh. I like that they only have a few options - makes my life so much easier when trying to decide what I want to eat. A couple of months ago, they used to change the menu almost every day, not they keep the basics the same, which I like.   I would highly recommend their Pepperoni Pizza, and whatever desert they have (all of them are always delicious). I like that they keep changing their wine options everyday, I get to try something new every single time and improve my wine knowledge!  The location of this place is very convenient, super easy to walk to especially if you live in Shadyside. The staff is very friendly and it is the kind of place that you can go with jeans or you can dress up, depending on your mood.   For the summer. they have high-top tables outside, which is nice.   I really enjoy going to Dinette!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jt3HLBDWb5q6g_Vqbm4tSA"
  },
  "6y-mP3fUhNWiPStnds5qBA": {
    "date": "10/6/2013",
    "text": "Dinette is a pretty cool place. The pizza was delicious and their menu changes often so you can always try something different. The decor is is pretty trendy with a lot of shinny metal and clean lines. It's pretty small in size but it doesn't feel too cramped.   i have to admit however that my favorite part is that they have $1 Yuenglings in the can on the menu all the time. Now the pizzas were great but anywhere you can get a $1 Yuengling in a can I'm in. They had other good beers as well for a very reasonable  price 4-5 bucks.   They also have a rooftop garden who's produce sometimes finds it's way onto some of their pizza offerings.   All in all it's a pretty cool place to get a unique pizza and have a drink with friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PSZZB1mfoJGSx7YxqoQmfg"
  },
  "jdwxzAc6zRbKJFqI7P_U5A": {
    "date": "3/21/2013",
    "text": "Tucked away in the Eastside development next to the defunct Borders and a T-Mobile store you will find a welcoming eatery:  Dinette.  The ambiance inside is minimalist and chic with nice cloudlike lamps floating overhead.  Dinette's pizzas are thin crust and Neapolitan style as one might also find at Mercurio's, Piccolo Forno, etc.  There are usually a variety of interesting topping choices, some of which rotate regularly.  In our group, anchovy/kale/lemon, sunny-side-up eggs, Rosemary ham, and Chorizo with poblanos graced the tables, with a general crowd favorite being the ham and leek.  The pizzas were a good size for one person and the crust was a good mix of chewy and crispy.  As has been mentioned before, a hidden gem on the menu is a $1 Yuengling which can be a nice accompaniment for a hot and tasty pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "2iD_yIdPmwbVdrlcr5loVQ"
  },
  "G0qu19MkaHL-DgLrWiVZmg": {
    "date": "12/6/2014",
    "text": "I finally got around to trying this place. It's nearby, but I always find myself at either Noodlehead, BRGR or Chipotle. My boyfriend's parents were in town so I wanted to take them someplace a little nicer. We went to Spoon last time they were in town, so we decided to give Dinette a try.  We arrived at 9:30pm on a Saturday night. The restaurant was mostly empty, there were 3 other occupied tables in the entire restaurant.   They were out of 2 dishes that we were interested in, the salmon salad and one of the pizzas. We ended up ordering the following items: -Grilled Shishito Peppers: Came w/ goat cheese and fried almonds. Yummy! I would say this was my favorite dish, wish the size was larger. $9 for 7 small peppers, 5 chunks of cheese and 7 almonds. FYI, the peppers weren't spicy at all. -Butternut Squash Soup: I didn't try this but it smelled good. I was surprised at how small the portion was for $8. -Grilled Romaine Hearts: Again, I didn't try this but the boyfriend's parents each ordered their own, and they described the dish as having \"interesting flavors.\"  -Roasted Broccolini Pizza: Also had feta, olives, tomatoes and fresh mozarella. Meh. Very sparse toppings. Flavors didn't go together as well as I had hoped. -Chorizo Sausage Pizza: Also had tomatoes, and I forgot what else. Taste was slightly above average, but again, very sparse toppings. I think there were probably 7 or 8 very small pieces of sausage on the entire pizza.  Service was mediocre at best. The server was friendly but he was pretty absentminded...or maybe he just didn't care that much about doing a good job? He had to be flagged down to refill our water pitcher even though he had walked by our table and the restaurant was not busy, he poured water into my boyfriend's cup but not mines even though mines was empty, he brought us red pepper flakes for our pizza when we were halfway done w/ eating them, etc. Also, the cooks thanked another party for coming as they exited the door, but did not say one word to us...huge pet peeve of mines. We had still tipped 20%, but it was not deserved.  I don't think we will be back, we will stick with Spoon next time we are looking for a nicer restaurant in the area.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "g7S7fGfZC9ow_wIsK848MA"
  },
  "rs1KayeoAbfUSWPOz01UcQ": {
    "date": "1/30/2015",
    "text": "I have been to Dinette several times. It's convenient because there is abundant parking and is easy to access. Most of the time we have had to wait a few minutes for our table, but we can usually snag a spot near the bar to grab a drink while we wait. I was so excited to have a pizza & wine place nearby but unfortunately their wine pours are so small that it usually turns out to be pizza & beer, because I hate the idea of spending $12 for a half glass of wine.  The pizza selection is pretty inventive and you can find some unique pizza and appetizers on their menu. Unfortunately we had a pizza that was burned pretty badly, but no big deal, I like mine crispy.   I often wonder what it would be like owning a small restaurant, and I know a lot of work goes into the menu and experience. I think Dinette put a lot of effort forth to make their restaurant different, but they may have some kinks to work out so I'll return after a while and check it out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "KZnpsTOPHKZpw1jPWfys0A"
  },
  "Mf1-YATvXMiLa6tWkF4Rug": {
    "date": "4/14/2014",
    "text": "A great place for a different taste that is THAT good. Friendly service and cozy. Not romantic but an open feel The better beer is expensive but can't beat $1 Yuengling can.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x__GmA3sQuSobxCh1h3urw",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x__GmA3sQuSobxCh1h3urw/o.jpg"
      },
      {
        "img_id": "IU8tiudB3T0sAlqaFGkC1Q",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Great service, excellent food. A great place to go for a taste of pizza that&amp;#39;s THAT good. Cozy for a date or laid back treat.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IU8tiudB3T0sAlqaFGkC1Q/o.jpg"
      }
    ],
    "user_id": "YzD1C8Edyeq56bSM26gxkg"
  },
  "SnsMBCIS0zjv28VBl4JTzg": {
    "date": "9/4/2015",
    "text": "Every time we go here the food is delicious and fresh, the wines well-priced and yummy, the service prompt and attentive and the overall vibe is just great. The appetizers and salads change often and are always worth trying out--sometimes, as much as we LOVE the pizzas, we love the starters even more. they are inventive and fun and always so good. It is lovely to have the pizza oven right behind the bar and to see the pizzas being made. The space itself is fresh and clean and delightful. We love Dinette and recommend it to everyone we know.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "scEkP2An0-__Ek_54-KjzA"
  },
  "RtlYqPaW196Vn0xK8P5BSw": {
    "date": "11/15/2013",
    "text": "Dinette is one of my absolute favorite spots in the East End. I bring friends and family here all the time, and no one has ever been disappointed. It's very unassuming in its decor, and I like that. Not at all pretentious, just fresh, local ingredients used to make delicious food.  I love asking the wait staff about what is going on with the rooftop garden. I love knowing that what I am eating often comes from the garden on top of the restaurant. Obviously, sustainability is a common trend in restaurants right now, but I love that Pittsburgh is picking up on those trends. Yay Pittsburgh.  The menu changes all the time, depending on what is fresh and in season. Although, you can always depend on the pepperoni, fresh ricotta, and prosciutto (my favorite), because they are always on the menu. Because I know I can come in and get the prosciutto pizza topped with fresh arugula anytime, I usually try to do something different. The fresh corn pizza that was on the menu earlier in the fall was absolutely spectacular with its combination of crunchy, salty bacon with sweet, juicy corn. In October, my favorite was the salami pizza with sweet potato and fennel. Always ask the wait staff for recommendations because they have tasted everything and have never steered me wrong.  The starters change frequently as well, but the shishito pepper with Marcona almonds and goat cheese dish is usually on the menu. This starter is a must.   I love the wine list, and if you ask, they will let you sample a few before deciding. You must must finish with the pot de creme, I don't care if you're stuffed, just do it. One of my favorite desserts in the city.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xsZ4s7a4MaBIh48MdMkkPw"
  },
  "LX0dn2WQuSPhtNBRcNjiCA": {
    "date": "1/4/2014",
    "text": "I went here tonight for dinner, and I was quite happy with the experience overall.  Unlike many other restaurants aimed towards attracting the \"hip\" crowd, this restaurant is actually very pleasant to dine in with no obnoxious decor, menu choices, or loud music.  We were seated quickly, the wait staff was very attentive, and the food came out quickly as well.  I had the pepperoni pizza and my girlfriend had the prosciutto, both were excellent and delicious.  We will definitely be coming back here again due to the combination of a very inviting atmosphere and good food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u_noxxraWD3Jo-WDdLl6Sg"
  },
  "bl2tLFoSZCWqMxf_rlOfWQ": {
    "date": "10/8/2012",
    "text": "A pizza place where all the tomatoes and herbs are grown in a roof-top garden and you can whet your palate with $1 cans of Yuengling?  That alone should say enough.  I typically don't go out for pizza (probably scarred from too many memories of 4am college pizza specials where you wake up the next day and realize that you were basically eating cardboard) but for Dinette I make an exception.  I have been multiple times and each time been treated to a different seasonal pizza with great topping combinations.  Ham and sage, Anchovy (with jalapeno), Ricotta and basil... all deliciously served on a thin crust.  I have always opted for pizza and have not tried anything else on the menu, but anything that comes out of the kitchen looks delectable.  A couple negative points-  One pizza is not quite enough for two people so an appetizer and/or second pizza (with some leftovers) is necessary.  Not super expensive but ends up costing more than the average pizza dinner.   This place often has a long wait and does not take reservations... I like to take that as an opportunity to take advantage of $1 beers while waiting for a table, but Dinette draws more of a wine and sweater vest crowd than a rowdy Yinzer crowd so be prepared to take some judgement with each empty can.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "zTCC1-ITmJvo14PxINcw6g"
  },
  "wRAjxOJp_5e-xvbk7YP8Rw": {
    "date": "6/15/2012",
    "text": "The pizza, which is described as for one, is sort of a tweener.  If you have the stomach of Kobiyashi, perhaps its for one.  Otherwise, it's too small for two, but too much for one.  The pizza itself is okay.  The gourmet ingredients, such as pancetta or gorgonzola cheese, are there.  The flavor profile is good, and the thinner crust/bread is awesome.  I just don't know if I'd get it again for $16.  As for the dining experience, we only tried takeout.  Let's say you've been with a girl for sometime: you spend weeknights watching The Amazing Race, she's the first person you call when something cool happens, she emails you first when she reads a funny article, and she has half her clothes in your closet.  BUT, she still introduces you to her friends as \"a good friend,\" and when her parents are in town, she doesn't invite you out to meet them.  So, what are you?  Dating?  Friends with benefits?  Stop stringing me along!  I'm crazy about you, but what are we?  Am I your boyfriend?  You don't like labels?  I don't get it, it's just that...oh sorry, I lost my focus.  So, we tried to order takeout, but you have to do it in person.  Well, that kind of defeats the purpose of takeout.  And then, we discovered that you can only order the pizza as takeout, and not any of the appetizers or starters.  Argh.  In my mind, Dinette should either do takeout, with call-ins and the full menu, or just not offer it.    Off to try the next pizza joint.  Suggestions?",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Q9DAJCpeKdzS6WuMvWOX4w"
  },
  "_Vc4xgDvCLZcj8qY5ZD58g": {
    "date": "6/3/2013",
    "text": "This place is adorable. The decor, the little flower on the table, the totally awesome metal straw that I got with my bottled Coke... All of it, adorable!  And the food. The food was spectacular. We each started with a shaved asparagus salad which was fresh and delicious. The meal was the pizza with truffled pecorino, asparagus and an egg RIGHT SMACK in the middle. OMG, I want to put eggs on everything now. This pizza was the absolute tops. Loved it. I took half of it home and reheated it a few days later and it was STILL the absolute tops.   This place is great to bring a vast array of people to: coworkers, your parents, a date, your girlfriends on girls night... It fits all types of situations. If I am ever back in the Pitt...rather, WHEN I'm back in the Pitt...I would definitely hit it and not quit it. This place has definitely made my food booty call regular rotation list. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eQDp0YN-wyE8A-jV1RadLQ"
  },
  "4ZSt4FHWlqdaaT_4AMfX-w": {
    "date": "6/19/2013",
    "text": "Food here is awesome! It can get crowded but its worth the wait.  Not great for large parties but awesome for catching up with a friend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L8SX1Wh4GjQXKWspmyhoaw"
  },
  "1HUVDTRKGxWXIJ9lpMirrA": {
    "date": "5/20/2015",
    "text": "My girlfriends and I love this place. The food is good (especially the shishito peppers) and they have a great wine list. It's a bit pricey which is the main drawback for me and the atmosphere is kinda uptight from being on top of each other. The food is great and it's a great time but not worth the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ktghbGWJm-4A6dk6NL-xYg"
  },
  "52OHDeq4N5uhG-EDFKHHrQ": {
    "date": "10/21/2010",
    "text": "When I asked a friend where his favorite places to get dessert were in Pittsburgh, one of the places he named was Dinette, for its chocolate pot de creme.  I decided to try dinner there, making sure to leave room for this magical dessert.  I split the fritto misto, lightly battered and fried slices of sweet potato, fennel, and onion, with my dining partner in crime.  The lemony flavor from the salsa verde went well with the light, crisp batter.  I've never had fried and battered fennel before, but it was good.  As my entree, I ordered the beet greens pizza with chevre, fresh mozzarella, and sliced \"inferno\" peppers.  This was a good balance of flavors--not too salty or spicy, but just right.   The crust was just a little too thin for my tastes, though.  I would have liked a little more chew, and a little less crunch.  For the finale, we had the chocolate pot de creme, of course.  Very rich and chocolaty.  Definitely a solid dish, but I'm skeptical about it being one of the best desserts Pittsburgh has to offer.  Overall, I'd give this restaurant a 3.5.  The service was fine, but not particularly friendly or warm.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zh8-XfjqlwAxf--RS4azzg"
  },
  "xMPbpHfU06L6-y_rCWDVCQ": {
    "date": "1/18/2015",
    "text": "Yes the pizza is pretty good.  It has a nice crust, oven cooks to perfection and topping combos are unique.  But a good pizza and night out should not cost you $180 for 4.  No reservations is annoying and people mill about the bar staring at your table. Wine list is very average if not sub par and after some olives and salami, an average salad and regrettably average wine... Even a nice pizza could not save me.  Proper pizza is making a comeback and with il pizziolo and mercurio's on walnut... There are better options than dinette.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2dRnCjV4UbYGSfwJCKVRsw"
  },
  "rtJ4uy_-RKV2vOhiYxZATQ": {
    "date": "7/21/2015",
    "text": "Dinette is a wonderful restaurant for an informal but high quality meal. Although it seems to have lost a step in the last year or so, the pizzas are still some of the best in the city.  It's hard to compare Dinette to the more traditional pizza restaurants in the city like il Pizzaiolo because Dinette uses less common toppings--usually resulting in amazing and inventive pizzas.  But like I said, it just feels like it has lost a step in the last year or so. There seems to be less changes among the pizza offerings and less creativity on display. While I'm happy that some of my favorites remain on the menu, I'd like to see some new ideas on the menu.  I'd probably give it 3.5 stars now if that was an option, but I'm rounding up based on the goodwill from past years.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KosPNYI23Sp0iIZn3rj8xQ"
  },
  "hCQkLsb5KaCEFxSLCzfoYw": {
    "date": "9/10/2010",
    "text": "4.5 star, one of my most enjoyable dining experiences to date.  The pizzas and apps are delicious. The pies are neopolitan style with a cracker thin crust light saucing and ample cheese.  The ingredients are incredibly fresh. Everyone always mentions \"freshness\" but you can really taste the difference here.  I really loved the ambiance of the place, and the staff was incredibly friendly and knowledgeable.   I can't wait to go back to sample more of the menu.  full detailed review with more pictures on my site",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "myXOyHixNbxTtkQsM-AE9A",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Mixed Veg Fritto",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/myXOyHixNbxTtkQsM-AE9A/o.jpg"
      },
      {
        "img_id": "cc8XGoOw7DxY3UEN3I9DGQ",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Chanterelles w/ sunny side up egg",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cc8XGoOw7DxY3UEN3I9DGQ/o.jpg"
      },
      {
        "img_id": "PE8dU_d1Q8Qn5W7UKFC8UQ",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Prosciutto w/ arugula and parm",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PE8dU_d1Q8Qn5W7UKFC8UQ/o.jpg"
      }
    ],
    "user_id": "7VTgkFaJ49ftsK1PlRDGrQ"
  },
  "0bVgiJolNFQaL5ee8BxDiw": {
    "date": "9/11/2014",
    "text": "I loved the food, but thought the service was really awful.  Especially when they weren't very busy.  That really kills it for me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "21W8iTZGWdCk1utgudcToQ"
  },
  "FDzXJ6ZGNlZyiJfDleWnWQ": {
    "date": "2/13/2011",
    "text": "Great food! Loved the brussel sprout pizza, and the beer carpaccio was better than I expected Pittsburgh to pull off. Glass of beaurdeau was great too. Had the Pot de Creme which was tasty but had a film on the top from being in the fridge too long (I assume, unless that's how it should be and I'm ignorant), and it was a little too chilled. Our server was friendly in a not-trying-too-hard way and attentive. Def going back asap.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y8T3SiKsZ-Q_fYMMcYcDhA"
  },
  "JZoas66SZ1T5osWXBDS6pw": {
    "date": "8/25/2010",
    "text": "I don't understand how anyone could have a bad pizza here as some have claimed. Some of the amazing, unexpected, and fabulous toppings I've had on pizza at Dinette i the past include: fried egg, fingerling potatoes, garlic scapes, arugula, thai peppers, etc.   The pizza is perfectly cooked, has a great rotating list of toppings, is just slightly bigger than what is needed to fill you up, and the staff is great. The wine list is impressive and the small beer list also includes some good choices.   It's a bit on the pricey side for pizza, but you more than get what you pay for. Appetizers and desserts are good, too, but the pizza is why you go to Dinette.  I just wish they were open on Sundays. It's always sad when I crave Dinette on Sunday...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "h2dAxHXBzaUHwXWfiev7KA"
  },
  "Flzsg7xQGuYXlXVynIw4dA": {
    "date": "4/3/2011",
    "text": "I found the food impressive.  The artisan pizza was good with interesting choices. The night we went they had a portobello mushroom soup with a citrus oil-- it was fabulous!   Red wine is all imports-- I enjoyed a Cab from Mendoza.  The experience did not start off well-     It was a challenge to find the location, it is upstairs from a FedEx location, and signage is lacking. There are signs in the window but, you have to be looking up to notice it.  (The valet across the street had never heard of the place). Once you find it there is a great parking garage if you enter by Walgreens you can drive up to the second floor and park near the restaurant.        They do not take reservations or call aheads. I did call to inquire about the restaurant and they told me there was currently a 20 minute wait. When we arrived 10 minutes later we were told a 30 minute wait (fine) but, the reality is we waited an hour. (I'm fine with waiting but, I like to be told longer than the reality.)     They do have a tiny bar to wait at but, it is not adequate. We walked over to the Boarders next door (currently going out of business). They will text you when you can be seated and they do tell you about local bars you can have a drink at while you wait.  Overall- I will go back for lunch or early dinner. Currently it seems they are a new establishment and haven't worked out the kinks yet. In all fairness it was ~7 on a Friday night when we decided to go to Dinette.  Once you are in the atmosphere is good and the staff is friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3tBPQ0r3jQDGEOP5YP0qQw"
  },
  "7SYiXwVvLnFdZi1o1Zm7DQ": {
    "date": "3/27/2009",
    "text": "Simple. crisp. voluptuous.   That's how I would describe the Grilled Romaine Salad. Grilled romaine is something most people only fantasize about after they read about it in their food porn purveyor of choice. I think I saw my first in Gourmet Magazine. And I thought, looks so tempting. But I just never get around to it. And it sounds so simple too. And so I had it at Dinette finally. And it was just as I imagined it would be. Smoky and crispy and sweet all at the same time. A whole heart of Romaine, sliced lengthwise, oiled and grilled. Flecked with lardons, shaved ricotta salata, spring onions and dressed with oil and saba (a sweet vinegar that reminds me of balsamic). Each bite was, as my friend Stephanie would call it, \"saucy\" -- a perfect bite. I resolve to make it at home.  I could have made a meal of salads. It was tough to choose. The other selections were Endive and Watercress Salad with Lentils, Roasted Cauliflower, Fried Shallots, Sherry Vinaigrette and Baby Red Oak with Cabrales Blue Cheese, Red Onions, Walnuts, Buttermilk Vinaigrette. I would have just ordered all three but the pizzas seemed too good to pass up (although, I always say, its more fun to eat the appetizers than the main course).  Bill ordered the Salt-Cured Anchovies, Onions, Nicoise Olives, Marjoram, Mozzarella Pizza and I got the Fingerlings, Pancetta, Gorgonzola, Rosemary, Mozzarella Pizza (I was torn between this and the grilled Fennel). The Fingerling Pizza was good but not distinct. I really should have ordered the Grilled Fennel. I broke a cardinal rule of restaurant eating -- order the item you would probably not make at home. I mean, I don't have fennel in my weekly grocery list (nor do I have potatoes but, you know what I'm saying). Food-envy prone me, the anchovy pizza was the winner hands down. Because the anchovies were salt-cured (its not mired in salty oil, but encased in a salt crust -- which I have only seen done with larger fish), the pizza was not as bitingly salty as I thought it would be (especially since it was paired with olives). The onions were key to playing off all the flavors perfectly.   What I love about the pizzas is that its not crowded with ingredients as pizzas are often served. Its just the right amount sprinkled so that you get a sampling with each bite, just enough to appreciate the chef's intent.  The wines we had were simple as well. I had a fruity Toscano Rosso and Bill got a drier Chianti. 2 glasses of it, in fact.  In the end, all was good. My palate was happy and I didn't feel overwhelmingly stuffed. Just the nice, satiated, fulfilled afterglow from experiencing an honest but inventive meal.  Other notes: The design reflects the food -- the lines are modern and spare but visually arresting. The open kitchen and kitchen bar invites conversation and interaction with the good people making your food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "OahJAfPLwzvZ9BFb5c817A"
  },
  "8adamUQgMtcoqzaL4hJMSQ": {
    "date": "6/12/2010",
    "text": "Excellent - my favorite restaurant in Pittsburgh. The grilled shishito peppers appetizer alone is reason enough to merit five stars.   The pizza ia always impeccable, delicious and I love the always-changing choices.  The wine list is particularly good in that it has a small selection of bottles that are all available by the glass or as a whole bottle. It's a great idea (and the $1 Yuengling cans are fun too). The staff has always been excellent, accommodating, and very friendly. My only complaint is that the dining room lights could stand to be dimmer. That's it.  Really, I'm posting this review more out of frustration with some of the other comments. First of all, people accuse Dinette of not being vegetarian friendly. I've never been there when at least half of the pizzas weren't veg-only, often more. There are always salads, & veg appetizers. The bigger problem seems to be the reaction people have to the idea that Dinette doesn't do substitutions.  Everything about the experience of eating there, from the clean, modern dining room to the simple menu to the daily changing and locally-sourced ingredients, makes it clear that this is a high-end dining experience, and not something like Pizza Sola (which is also delicious! But very different). Could Dinette do substitutions on pizza if they wanted? Of course. But then the pizza wouldn't have the taste that the chef intended, which is the entire point of going to a restaurant. Why second-guess someone who has twice been nominated for a James Beard Award?  In short: kudos to chef Sonja Finn and her staff for one of the best dining options in Pittsburgh, and for sticking to her guns. I'm always happy to go there and order something, knowing that I trust the chefs to deliver something delicious. Isn't that what going out to eat is all about?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7IswBkmh6AG5X91lFgzEdQ"
  },
  "IxkCQzSMOCybcnwg4wylRw": {
    "date": "4/2/2012",
    "text": "It's awful! Pretentious and overpriced. I paid $16 for a broccoli rabe pizza-it was dough, cheese and burned broccoli. No kids menu. Service was incredibly slow. Go to Brgr across the street instead!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1k3VKcGvH45AhyOOJTrd3A"
  },
  "9O7lNd74JV-i5xCH3P9x4w": {
    "date": "9/4/2011",
    "text": "I have to say Dinette was a fun, little find. My boyfriend and I were headed back from getting a few drinks at the Cantina in Lawrenceville and remembered someone telling us how great Dinette was. We thought, \"Let's give this a whirl.\" So, we did. The menu isn't expansive, but has enough on it to suite most palates. We both ordered pizza. Dave got one with arugula, proscuitto and shaved parmesan and I had one with banana peppers with a sunny side up egg in the middle. How have I gone my whole life without the discovery of egg on pizza? It was DELIGHTFUL! The pizza is light and very thin-crusted-- which I really enjoyed. Some of the crust's edges get slightly charred while cooking which added to the texture and taste of the pizza, in my opinion. I ordered a Coke which came in a retro glass bottle and was decanted tableside-- how fun! The decor on the inside is very simple (but clean looking), I think I would've gone with a different accent color than tomato orange for the chairs-- but that's a minor detail. I imagine having a leisurely glass of wine at the bar or coming here with a good group of friends would be an absolute blast. And suited us for a date night just fine! My biggest gripe with the place is that we both felt the prices of the pizza were a bit steep-- $15 and $16 dollars respectively-- I mean that's getting large and XL pies from a great pizza shop, usually. These pizzas were little and good, but not $15 and $16 good, you know? The pies are cooked in the open kitchen, clearly seen from every table in the place and from our experience, it seemed to be a predominately female run restaurant. The vibe in Dinette was relaxed, our service was great and the view from the huge windows encasing the place is neat. We will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JRwacA7kVVeP_L42hM8hlQ"
  },
  "lMhAEbezfI-sgy9NHO8EQw": {
    "date": "8/10/2011",
    "text": "I wish all restaurants were modeled after Dinette. I appreciate the fact that Dinette is focused on using local ingredients as much as possible (with some from the rooftop garden). I had the grilled chicken wings, prosciutto pizza, the fresh ricotta pizza, and the arborio rice dessert. All were outstanding and unique to say the least. I didn't think pizza could taste like this until I visited Dinette. The bread-sticks that come with the meal are awesome too. Highly recommend. It seems that some people love Dinette while others hate the restaurant because of the prices and size of the pizzas. I fall in the group of loving Dinette and I don't think the prices were outrageous for the quality.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "E-Zw6rR5avvbyjcxjxNjEw"
  },
  "cH1CSk8VE3tOgg7cuY4mpQ": {
    "date": "3/28/2010",
    "text": "Fresh, cool setting. I like the format of this place and I think it's a great place for lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RFXkujfrPWXb5DFTR9MVYQ"
  },
  "QDV2Jm2oBlkLwDKhKv-qhQ": {
    "date": "10/3/2009",
    "text": "Fantastic pizzas. My favorite is the pie with arugula, freshly grated Parmigiano-Reggiano, and just shaved prosciutto. Thin, crisp crusts. This is a gourmet pizza restaurant- so don't expect greasy pan pizzas or a NYC style slice (delicious in its own right). Yes, it's pricier than Pizza Hut, but the ingredients and execution are in a whole different universe. The fritto misto is also delicious and perfectly done (as it should be- it's straight out of the Zuni Cafe in SF, where the chef/owner worked). A great addition to Pittsburgh and one of the places I miss the most since moving.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OKr-hLIHYqai3OhL8zJXAw"
  },
  "EFDk5IYplH364k33vyzT9g": {
    "date": "11/12/2011",
    "text": "I've been to this restaurant three times. I will never go again. The owners of this place are the most obnoxious people in Pittsburgh. I went with a friend and tried to order a pizza. We asked for them to add a topping to one of them. They wouldn't do it. We obviously offered to pay for it, but they refused saying the chef perfected the recipe and wouldn't allow customers to change the flavor. This ain't NYC - it's Shittsburgh, East Liberty no less. Another time I called there and tried to order some food to go. They refused, and said I have to wait in line with everyone else. Forget this place, Piccolo Forno in Lville is 10x better and the folks are way nicer. They let me put whatever I want on my pizza.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ug6tUpqXI_Os63bIPh2xmw"
  },
  "_L6PPwvGsRcnquWbdgIcxQ": {
    "date": "12/21/2011",
    "text": "I've been to Dinette twice and the pizza is top-notch. The dough, cheese and toppings are incredibly fresh and always cooked perfectly. I love that they have a garden on their roof. I look forward to going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZvNTUmccoWNI2B-SJc9_wQ"
  },
  "bbWEygD1Kr9JwjDVsgf9Jw": {
    "date": "4/3/2013",
    "text": "We don't eat out much, I grant you.  But when we do, we expect the food to be memorable.  Nothing is worse than a restaurant that cheaps out on flavor by layering on the fats and salts.  None of that exists at Dinette.  The bibb lettuce wedge salad had fresh tarragon, avocado and freshly made green goddess dressing.  The arugula and prosciutto pizza screamed freshness and flavor.  The sommelier made excellent wine recommendations, using well-chosen evocative language to describe what we were in for.  We sat at the counter, and were treated to engaging conversation with the cooking staff working the kitchen.  The supplies on the open Metro shelving next to the curtained windows reflected an orderliness and attention to detail, which -- interestingly -- we observed in the meticulous, almost ritualistic, way the kitchen staff went about their clean up.  We really enjoyed Dinette, and would recommend it to anyone looking for a casual, sophisticated place to eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YjlGCstVzBGOtICWA9k7tw"
  },
  "mv9jcxWLm02CD8nUQeVxqg": {
    "date": "11/26/2008",
    "text": "This is yet another new good addition to East Liberty.  This new little restaurant is located basically above Richard Chen next to Borders.  There is ample parking and the space itself is very nice.  It's a small restaurant with about seating for 40 I'd guess and a small bar with about 6 stools.  The restaurant is surrounded by big floor to ceiling windows and makes you feel like you are sitting in a fish bowl (in a good way).  It has an open kitchen with a good looking pizza oven.  I'm not sure what to make of the furniture itself.  Most of the tables and bar stools are metal and the chairs are orange.  It is bright and seemed a bit out of place on a dark, cold, wintery (sp?) east liberty fall night.  However, I'm sure it is better appreciated in the summer.  This is definitely a kid friendly restaurant and I saw many families enjoying their delicious pizza.  My friend Liz and I sat at the bar and had very good service all evening long by Sean who had about an average palate for wine.  The wine prices were quite good and I don't think there was anything over $10 per glass.  I enjoyed a nice italian Syrah and I think Liz stuck to Sauvignon.  They keep the menu small choosing to focus on just doing a few things really really good.  We started with the salami platter.  It was very good quality proscioutto, salami, and some type of other italian ham.  It was served with caper berries which are really good if you have never tried them.  The meats were high quality.  Next we shared the steamed mussels.  The broth was delicious.  The mussels were I'd estimate only of average quality.  You know when you get really good and fresh plump mussels and these were not those.  It also came with a slice of grilled ciabatta.  The bread was good, but since we were sharing I would have preferred another slice to soak up the great sauce.  Then we split there pizza \"for one\" which was really good pizza.  If you try nothing else when you come here try the pizza.  The pizza had a great thin crust and high quality ingredients like fingerling potatoes, good onions and a fried egg on top.  Lastly, we split a dessert which was really rich and reminded me of something I couldn't quite place from my youth.  It was the \"pot de creme\" which was like some kind of chocolate creme brulee'.  We had two espressos' before we left and the whole night was about $95 for everything.  The portions are smaller by Pittsburgh standards, but I thought it was perfect.  This is a good date place I'd say.  At the end of the night we spoke with the chef/owner who was very nice and has an interesting background.  They try to do the whole eco friendly thing here which is a plus.  This is a good spot and hopefully soon I'll consider it a great spot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "1TkFY3Z_g62uZ6xNhAhXoQ"
  },
  "OMMT8d4FYix5azCtlZpuRw": {
    "date": "9/16/2009",
    "text": "I REALLY like this restaurant and highly recommend it .  It is one of my favorites in Pittsburgh.  I have been a few times now and the pizza is really very unique for Pittsburgh and quite tasty.  I shared a zebra eggplant pizza yesterday along with a prosciutto pizza with arugula.  The restaurant  decor and menu has a California feel to it.  I think this is a great date place; family dinner place; and friend dinner place.  I don't understand how the reviewers below don't see how good it really is.  The service is quite good.  It may just be pizza and wine but they don't claim to be anything else and they are REALLY good at pizza and wine.  I'm not sure what the person below ordered by my friends and I spent $30 each with wine, two pizzas between the three of us, and two appetizers.  We were really full by the end.  Also recommended: go to Oh Yeah for icecream afterwards!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cyDZ02DWiw-NJDpk9TtMNw"
  },
  "IGddZbOt3l2txW3PZcIlSA": {
    "date": "8/27/2009",
    "text": "I went there for the first time with family and friends to celebrate my birthday. The meal began by my mom making a simple request for lemon in her water and she was denied. They don't have lemons. That is fine but the response came with attitude. When I went to order, I wanted to select a first course but was limited because I am pregnant. I am not at all a picky eater but I am following the basic no raw meats or no uncooked eggs that all doctors suggest. The one salad on the menu was with a dressing that contained raw eggs. I asked if I could have the other dressing listed on the menu with a seafood salad. The waitress informed me there were no substitutes. I explained I was pregnant and could not consume raw eggs. So no salad for me! The other choices for a first course contained raw beef and seafood that can also not be consumed during pregnancy. We did not fuss or ask for anything other then a dressing substitute and lemon for the water. The kitchen design is open and it was evident that we were being discussed throughout the meal. It was a terrible birthday dinner and big disappoint. The food was good but I would never go back after being treated so terribly. Poor service is one thing but this was beyond. The food was pricey for what it was and the wine was improperly stored and served too warm.",
    "rating": 1,
    "rated": {
      "funny": 7,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "HHXsD-RHsc-jhJJjyZWq_w"
  },
  "M7_HSzACifdmSkf7WIrmDg": {
    "date": "3/28/2015",
    "text": "A+pizza! Lots of flavor and unique pizza combinations, wood fire, fresh ingredients,  my rating would be 5 if I were only rating the pizza.  The atmosphere could be a positive for some, but a negative for me, personal preference.  It is clean but very very small, crowded, and noisy. You are eating practically next to other guests, trendy vibe.  Complaints: no fountain soda, only cans and they are 2.50$ each so kinda high. 2nd, they serve drink with a reusable metal straw. Gross and weird.  Nice wine list. A neat little place, the pizza is worth the annoying atmosphere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ODmmPtp1EnKRedWFgeyKA"
  },
  "iINp6240Am0CSdPeTKBabg": {
    "date": "4/27/2013",
    "text": "Why yes, it's another 5-star review from me!!!  \"Why do you have so many 5 star reviews, Alex? Shouldn't it be the other way around?\"  I would normally say \"Yes.\" to that question, but after thinking a little bit about it, I realized that the reasons I have so many 5 star reviews is because:  1) Pittsburgh has some really delicious restaurants to choose from. You don't have to be a 3-star Michelin restaurant for me to give out 5 stars, but you gotta try hard to be something unique, delicious, and True to your concept. Dinette does this flawlessly  2) I've found that Yelp really does steer me in the right direction, more often than not. Dinette was no exception. Not only did the reviews for this place hit the nail on the head, they matched with the verbal \"reviews\" all of our friends had given us .  This establishment is awesome. I know that by now, the concept isn't \"new\" anymore, but I really like what they have done here. The space is simple, clean, and well thought out. I personally like the open kitchen concept - it was fun to see the three chefs working at their craft. You can sit at the kitchen bar or drink bar if you want to - the staff seemed very friendly, and would converse with the patrons, but not too much, since they were very attentive to the rest of the place. Nice touch! I also liked their use of the SodaStream machine to provide sparkling water; it kept with their eco-friendly theme by not generating oodles of empty bottles!  Our waiter was an extremely attentive young man who kept us well served and really was nice. His advice on the various appetizers and main dishes was spot on - we loved the frittato (lightly battered greens, rosemary, portobello mushrooms, and sweet onions), the carpaccio (with a delicious mustard sauce and radicchio garnish - China Millman was right, even though I often disagreed with her reviews...), and our pulled pork shoulder/pesto and roasted ramp and yukon gold potato pizzas were delicious.  Gotta love the wine selection and the beer selection - thanks, guys for keeping it simple and tasty! It was a little expensive $72 before tip, but I'll accept that in exchange for the delicious food and wonderful service.  Will DEFINITELY be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4r33dXcE1oYZxjONrhxTiA"
  },
  "XC1ewpT5dvq46otQjdit5A": {
    "date": "3/17/2015",
    "text": "All the pizzas were super greasy and the taste wasn't that good. The beer selection is also very limited.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZbJ_IVVjY-k2y4-g273qKg"
  },
  "9iyZdXUWAY_3gsrNWhPcww": {
    "date": "5/5/2017",
    "text": "If you're a beer drinker, this is the spot. They always have some reasonably good domestic for $1. So you can have 3 beers and a gourmet pizza for $20. That's tough to beat!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "htplhg_et00tq-Tlxu-3Rg"
  },
  "r4EDYGWyG-3ECK4G9nsdOQ": {
    "date": "11/23/2016",
    "text": "This is our go-to restaurant in Pittsburgh. First for the pizza, and second for when we want a relaxing night out. The prosciutto pizza is always delicious, and they do a good job rotating the menu with ingredients they grow on the roof - everything is very fresh. The fritto misto is also a star appetizer.   Lastly, I appreciate the ambiance. Even when the restaurant is more crowded, it is not too loud inside and easy to have conversations.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xZI2BMDzm9QoQuUAECzu3g"
  },
  "DRS09bCIpk_7Qs2wiYHStA": {
    "date": "12/10/2014",
    "text": "Definitely a fan! The appetizers and pizza were delicious, the atmosphere is trendy yet cozy, and the yuengling cans are only a dollar! Great spot for a later mid-week dinner, as they had plenty of availability.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MXE5dJEqzzfKDLEGkHbdVA"
  },
  "852vzSKMTHJ_6VazH7WcoA": {
    "date": "6/19/2014",
    "text": "DOES NOT DESERVE BUSINESS!  The food was for ok, but nothing special considering the prices. My real issue is the refusal by the establishment to make any substitutions for ingredients. I could understand if the restaurant was too bus, but there was only a single other table seated when I was ordering. I asked why they were unable to substitution ingredients and I was told that \"the owner creates complete designed meals\" and \"customer requests would hinder the experience.\" All I know is that if I am paying for a meal I should be able to get them to hold an ingredient. This pretentious attitude should have no place in the customer experience and the owner should be embarrassed to have her staff tell people such nonsense. This tone is disrespect to her paying customers and the community.",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7YOKngJ-dMa_a4AppAY-tw"
  },
  "H1CCB-tPW6ReQaxKxhcSAw": {
    "date": "9/16/2017",
    "text": "This is a wonderful spot and well worth repeating visits! The celery soup was excellent and the peaches and burrata was absolutely to die for. Service was perfect and could not of been more nice and helpful; the wine selections both white and red were excellent and really tasty. We tried the Anchovy pizza which was a little bit of a stretch and it was very nice, although the next time I would go with spicy sausage. The ambience and light were great and I highly recommend that you come here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SOmjEpruPtZxjLTWTqS_FQ"
  },
  "nt1WkaTL8xPLbXoxnqrUew": {
    "date": "1/3/2014",
    "text": "Yelp needs a category that goes beyond \"good for kids\".  Maybe \"romper room\". Just to warn people that, for whatever reason, a place has been well and truly conquered by screaming, unruly tots.  It's possible we caught them on a bad night but it was approaching Park Slope Stroller Mafia-level. So maybe come as late as possible or wear headphones. I realize there's only so much a place can do. The real star-docking is that, for a focused menu (which I am always in favor of), their calling card - thin, gourmet-level pizza - just didn't knock it out of the park for me. I thought the ingredients were plenty good but the crust was just too dry, too bland. That said, there is no way I'm staying clear of an ambitious pizza joint for too long, even if it does trigger severe Chuck E Cheese flashbacks.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "YGHp8XlRkzbXQyGLh7U0Eg"
  },
  "qMB5KBIKoC8Ilwbx3j7MmQ": {
    "date": "11/8/2014",
    "text": "I have always had an amazing meal at Dinette. I've only tried their pizzas, which their  menus change periodically. But everyone I've tried have been very good!  As for the rest of their menu, first, they have those \"cracker bread sticks\" on the table, which nobody ever likes so they should get rid of them. Also, I tank they only serve sodas by the can and not by fountain. But I have the impression that they have a pretty good beer selection.  Parking is very easy because it is in a large lot that is shared with Chipotle, T-Mobile, a bike place, and others.  Overall, definitely high quality pizza and one of my go-to places!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-kHD8sV1xywLv_Um3IsfkA"
  },
  "qAMUk3DvxhU9wgVZv5xBvQ": {
    "date": "2/22/2014",
    "text": "I don't see how anyone would give this anything less than a 5 star. The pizza is the best in the city! The Fresh Ricotta and Prosciutto are always good but all others are worth a shot. We tried the Leek pizza and the Spicy Cacciatore...absolutely amazing. I have a daughter with me at all time and they're always very accommodating to us. This place is definitely one of my favorites!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CJqPJIqhpvlc0cL5hyfJVg",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Prosciutto pizza!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CJqPJIqhpvlc0cL5hyfJVg/o.jpg"
      }
    ],
    "user_id": "FUYNQf7_9sp5uK3spyC7ow"
  },
  "KpHv81PVpFyiGyaiuDLrYg": {
    "date": "8/19/2011",
    "text": "Dinette was one of those places that kinda went under the radar for me.  It wasn't anywhere I was just dying to go to but it was never a place I would have been opposed to going either (obviously)...it just never came up!   I'm glad it finally came on my dining radar because it totally won me over!  I walked in and my first thought was \"whoa, it's tiny in here!\"  Probably only about 50-75 people max can be in here at a time.  Everything is completely open, even the \"kitchen,\" which is a brick oven.  Just my style though, everything is in red and whites with a mod feel.    My lovely friends informed me that they had read up on the place (such smart ladies!) and saw that they have their own garden on the roof where they grow their ingredients.  I was immediately intrigued...this place had better be good...especially the tomatoes...since I am the urban tomato gardner.    I was NOT let down.  We started by splitting three different salads and apps.  The Grilled Shishito Peppers w/ Fried Almonds, Chevre and Fleur de Sel, Rooftop Nebraska Wedding Tomatoes and the Eggplant w/ Red Onion, Sungold Tomatoes, Arugula, Capers, Tahini.  FRESH FRESH FRESH!  Everything tasted amazing!  I was really into the Eggplant and Yellow (yay, my fav) tomato salad.  The peppers were good but my gawd, those almonds were awesome.  How did they taste so good?!  They were just almonds dipped in olive oil....but I kept grabbing more secretly (it probably wasn't secret though!).   We also decided to split three different pizzas.  The Prosciutto w/ Rooftop Arugula, Parmigiano Reggiano, Fresh Mozzarella, Fresh Ricotta w/ Basil, Fresh Mozzarella, Tomato and the Zucchini and Squash.  All of them were again FRESH!  My fav (which surprised me) was the Prosciutto.  My Italian relatives may roll over in their graves, but I've never been a big Prosciutto fan...I think it was the fresh parm cheese that really did me in!  I could have had a totally parm pizza and been perfectly fine!  I also enjoyed the Zuc and Squash pizza with lots of veggies!  Ricotta came in third, although there was absolutely nothing bad about it as well.  Just a little plain.    The ONLY thing I wish for...and this is just me being cheap...is for Happy Hour wine specials.  Aside from that I think the prices are pretty reasonable.  With 2 glasses of wine, salad and pizza our bill came to around $32 (not including tip) per person.    I will be back to enjoy my little Dinette very soon and perhaps steal some mod decorating tips!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "Sz5igd85ZVwCaVSmjpuJmw": {
    "date": "10/26/2014",
    "text": "Pizza!!!! I love it!  I have been wanting to try this place for such a long time.  I know I am a grown woman, but my inner child loves pizza!!! Especially unique pizza toppings.  My husband was such a great sport and we ordered three pizzas for the two of us.  (No starts or anything). We ended up eating all but three slices.  I recommend this approach because once you see the pizza selections you will have a hard time narrowing down which one you want.  I/ we went with the prosciutto, the eggplant and the hot banana pepper.  The banana pepper was my fav!  Not too spicy but really tasty!  My hubby liked the prosciutto.   So the only down side....the price.  Pizzas were about 17$ each and wine was 38$.  Our bill was close to 100$....for pizza?!?  Too much!!  I would go back, it was good.  I just won't be going back frequently.  There are many other pizza places in this city!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qQRmnbKI84Up4a2MBFfaFg"
  },
  "N0RAOUhhzohYgCRU4INtNw": {
    "date": "9/28/2014",
    "text": "It took me a long time to try this place, but I am so glad that I did! It's a cute little place and I had a great experience when a couple of friends and I spontaneously decided to stop in for dinner.  We started by sharing the marinated olives and the grilled shishito peppers with chevre and fried almonds. I could not get enough of the peppers. So freakin' good. They also brought these thin, crispy breadsticks for the table. They were unusual, but we were starving and polished those off as well.  I ordered the prosciutto pizza (arugula, tomato, parmesan, and fresh mozzarella). It was great and piping hot! The pizza was thin (in a good way) and everything was so fresh. Apparently they grow a lot of ingredients on the roof, which is pretty awesome in itself.  Our server was very friendly. We sat outside, but I did venture inside to use the restroom, and restaurant's interior was simple but pleasant and trendy. I'm hoping to return soon and try some of the other items.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J9OSJ7Xl9wnS0tL709AIqA"
  },
  "DO-GyWgOyCTkaIAfZRM8Gg": {
    "date": "9/7/2014",
    "text": "Dinette is fantastic! Great wine, great coffee, incredible pizza and salads and of couer the dessert is good too. The atmosphere is casual, trendy. Our wait to be seated was long, but well worth it. Much to love about Dinette.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WFGdFjt4RbIb5OC1oEURTw",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. The wine good and so is the pizza...that&amp;#39;s reason enough to try it ;)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WFGdFjt4RbIb5OC1oEURTw/o.jpg"
      }
    ],
    "user_id": "LvvoQxhXd0bvAdpzwpBpRg"
  },
  "-wGe9Cr6XWueaI1qvxlXsA": {
    "date": "5/13/2012",
    "text": "I ate here recently with 4 other dining companions on a Saturday night.  Since we got there at 7 and they do not accept reservations we had a little wait for our table.  Whenever we got to the bar I saw that they had a nice selection of wines, some beers and $1 Yuengling cans.  Man was I sold on those cans!  We decided to start off with both the salami plate and frito misto appetizers.  The salami plate had a nice selection of salty meats that tasted good while the frito misto had some delicious fried vegetables with a nice sauce.  For my entree I decided upon the prosciutto pizza.  It was good with a nice and crispy crust.  One of my dining companions got a bacon and asparagus pizza which I was lucky enough to try and thought was excellent.  The bottom line for me is that I would come here again in the future. Just be aware that their entrees are pizzas.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "XGbrSSgd8c1EKsjjpd9o9A": {
    "date": "5/10/2012",
    "text": "We spied this place while we were across the street at another restaurant and we entertained the idea of ditching our reservation to go eat some pizza at Dinnette!  We didn't that night but we made our way back there before long.    I love their concept--fresh grown ingredients and a menu that changes daily.  But for some reason the pizza fell flat a little bit.  Our portabello pizza skimped on the portobello so much it kind of seemed like a cheese pizza.  Our prosciutto arugula pizza was good but nothing special.  Probably what we will remember most is the stick bread in the glass!  Overall, an okay experience but I'll have to keep searching for that \"eat pray love\" pizza moment I really want.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SX_SMrddkDU5dySbsZMu9A"
  },
  "glHvfdtKOq-tUrgcVojP-Q": {
    "date": "3/10/2014",
    "text": "The food is amazing and the staff is friendly, what more could you ask for?    The shishito peppers will rock your world and the prosciutto pizza can't be beat. I love how they are always changing up the menu and experiment with all kinds of flavors.   They are always busy so make sure you're ready to wait 30mins+ for your table. It will be worth the wait!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "t5l4DiZmoc7BN2IoG1lzWQ"
  },
  "BRZl-o7NKjhldphjtwwrcg": {
    "date": "3/24/2014",
    "text": "I think their pizzas are fantastic - very fresh ingredients and satisfying!  Service has always been friendly as well.  The wine selection is decent and I like the fact that you can see them cooking in front of you.  The paranoid diner in me is reassured that food isn't falling to the ground and disgruntled employees aren't spitting in your food.    I'll tell you what I don't like about Dinette - the bill.  While I'm all about paying for quality food, I do feel that $18 for a (personal) pizza is a bit excessive.  That being said, this is definitely a place to check out but maybe not too frequently so that you're wallet will thank you.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NnrCwpS1i5mZtkGGzmIk0g"
  },
  "5FsihO5vPR089U6EC0RF1w": {
    "date": "6/24/2013",
    "text": "We heard it can get crowded, so we went early (geriatric hour of 17:30). We liked that there was an age-diverse crowd: tables with children, older couples, young professionals. Nice small selection of wines and beers. Great Neapolitan-style pizza.  To eat, we ordered the shaved asparagus salad (with toasted hazelnuts and baby lettuce with a nice light dressing); pizza with roasted garlic scapes and spinach; and pizza with shitake and onions. All of it was wonderful and we took a box of nearly a whole pizza home. Our server was friendly, as were the cooks making our wonderful meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ElQ0j6KGwXgf7z8SS7PYAw"
  },
  "q8QiGdL-2whoWgLs-XTnQw": {
    "date": "11/10/2014",
    "text": "It got two stars because \"Meh.  I've experienced better.\" is an apt description of this place.  I probably would have upped it to 2.5 if that were available, but that's it.     So why the low rating?    Strike 1 - They don't take reservations.  I could get over this for a place that's stellar, but I had a party of 8 and it's tough to walk into a small place with a crowd like that without one.  And...they didn't mention when I called ahead about the reservation that coming early to get my name on the list wouldn't help because they won't put your name on the list unless half of the party is present.  Strike 2 - My party of 8 was whittled down to 5 since 3 didn't want to deal with the no reservations thing.   So they stuffed the five of us at a table for four.  We were pretty cramped and chose not to order appetizers with our pizzas because there wouldn't have been room.   The bar area was also cramped - you can't sit there without getting hit every 5 minutes by someone walking to the bathroom.    Strike 3 - The first two strikes wouldn't have mattered as much if the food had been spectacular, but it wasn't.  It was actually pretty bland overall.  The complimentary \"breadsticks\" were more like crackers - no flavor or anything special about them.  I then sampled three different pizzas - the sweet potato, the mushroom, and the prosciutto.   The prosciutto was great, but the other two were lacking some punch.  I dressed them up with the little bowl of red pepper flakes, but then they were just spicy.    The menu describes the pizzas (ranging from $12-$16) as \"for one\", which is a little off.   It's definitely more than one person should eat, and not quite enough for two unless you order an app.   I'd recommend sharing one and getting an app if you choose to try this place.    There were a few good things about this place.   The service overall was decent, albeit a little slow for a pizza joint.  There's plenty of free parking.  The wine list included some good selections - 5 oz pours just so you have an idea.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "h9LPugJk2cpIh0gmQb5LnQ"
  },
  "wUeHkGDTH6EE5gq0oi6dcQ": {
    "date": "10/25/2017",
    "text": "Very small but upscale pizza restaurant. Individual pizzas the size of others medium pizzas. Limited offerings, but, there is something for everyone on the menu. Was with a longtime friend. Each of us had our own appetizer, pizza, and dessert. I had 2 beers as well. Came to almost $95.  A bit pricey but this place is something you must experience.  Give it a try.  A great place to impress your friends. It's a real treat! It's also a non tipping restaurant, too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IWvudS8h803mKFqkxhNtKA"
  },
  "0CDXUqg7EimaAwGK0mQmJQ": {
    "date": "4/16/2017",
    "text": "This might be the best pizza place in Pittsburgh. They have delightful little pizzas with exquisite locally sourced toppings.  I had the anchovy pizza and it was amazing. We also had the ricotta and the mushroom, both were expertly prepared and crispy.  The only thing I don't like about this place is that they don't bill themselves as a pizza place. They have fancy appetizers, and fine wine, but they don't serve any entrees that aren't pizza. So they're a pizza place, a very good one but let's be real here.  Still, I enjoy eating here quite a bit and I'm sure I'll go back again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uRRuulSQNLwa4gF599EE9g"
  },
  "PIymJk7jb5lXeQKvrGWPxg": {
    "date": "10/8/2017",
    "text": "This was my first visit to Dinette. I had a $50 gift card from a raffle, so I didn't have quite the sticker shock that I would have had when I first looked at the menu. Having said that, it didn't end up being quite as expensive as I would have thought. There were 2 of us (middle aged women). We had 2 glasses of wine, one appetizer (fried zucchini) and one pizza, then we each had the chocolate crime pot for dessert. The total check was $70, which included the tip, because of Dinette's no tipping policy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oQBrfRN0QyO4nrwnKH1wdg"
  },
  "OdV9thcg9w5Q3cSiqGSq9A": {
    "date": "10/19/2017",
    "text": "Just saw the promo for the Anthony Bourdain show where Dinette chef said Pittsburghers were not used to good ingredients and food. While I did not post a review after eating there several weeks ago, now I feel I must. The mediocre food was one thing, but the pompous attitude of the chef was beyond belief. We had the vegetable tempura for an appetizer - it was incredibly dry, with a thick, pastey coating, so we asked if the sauce was missing. The waitress came back and said no. We asked if we could have a little something - an aioli or marinara. The poor waitress had to come back and say \"no, the chef believed in the INTEGRITY\" of her dishes\". Seriously!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "dqM7YYpDxXT_oletsoqCjg"
  },
  "cnxQ4zAmBb2RwMW921WWjQ": {
    "date": "3/21/2014",
    "text": "I finally tried Dinette for the first time last night!  First impressions: super tiny, nice staff, funny looking breadsticks, small water glasses, decently varied menu choices.  My date and I sat at the pizza bar, as there were no seats left in the house. We had good, friendly service, and we got to watch them cook the whole time. The cooks are professional, clean, and look like they are enjoying what they are doing. I love eating at a place that lets you watch while they cook (I'm looking at you, Salt of the Earth!).  I got the mushroom pizza, and my date got the salami pizza. Mine was really good, perfectly cooked crust, not too dry, flavorful, and a good size. My date said his was excellent and that he really liked the scrambled eggs on top of the pizza. It's weird because the eggs don't look like eggs on top of the pizza. We were trying to figure out how they did it. I think they have raw egg in a squirt bottle. Haha.  Consensus: above average food, nice atmosphere, and I would definitely come back and try some other things. I think as far as the food goes, Mercurios does it slightly better (at least with the pizzas, but Dinette appears to have the appetizers beat), but Dinette provides much better service.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "U7UfQMVPn-Xmdq7nRzO4Sg",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Portobello pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U7UfQMVPn-Xmdq7nRzO4Sg/o.jpg"
      }
    ],
    "user_id": "6z9ERfBvRF3HOXLNTNkdpg"
  },
  "sfVJbjT32D0yq8Cx_LG6BA": {
    "date": "3/4/2017",
    "text": "A very causal open, low-key space that is light, airy, and kid-friendly. A strong focus on pizzas and wines, both of which were commendable. I don't think there was anything extraordinary (especially given all the pizzas range from $13-$15) but it certainly was good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tjv8T8n-HC_bsUmqHpdfsA"
  },
  "yiRetBA0jf6pL03IqbTsDQ": {
    "date": "4/1/2017",
    "text": "Long wait on weekends, no substitutions on pizza...the pizza was fine, but if im spending $16 on a personal pizza, it's gotta be amazing. Otherwise I can just order my own creation to eat at home om the couch.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eUXw5suYSX5_t3ZFXxOleQ"
  },
  "3SyRMAyw7wIy7ozvcwQ6Hw": {
    "date": "6/27/2015",
    "text": "I've been to Dinette twice now and the second time was a big improvement.  I ordered the asparagus pizza and I was wary.  Asparagus, Ricotta, Eggs, Mozz.... somehow it works!  It was amazing and delish.  The crust is thin and really complements the fresh toppings they use (roof top garden to boot).    As usual, I ordered two desserts and pretended one was for my H.  I had intended on crushing the chocolate pot de creme and the rice pudding solo.  Alas, as soon as they put the pot de creme down in front of H, I knew I didn't stand a chance.  He barely came up for air.    The service was pleasant and the food top notch.  Highly recommend.  The reason I dinged one star was because I ordered sparkling water and received a Soda Stream canister (with no cap) of said fizzy bubbles.  As a result, I paid for air.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "xIdXYxcSxF5WPpq1S5Uw8Q"
  },
  "3X9Ed6QGo-gEeJHcno5PHw": {
    "date": "10/24/2017",
    "text": "Appetizers were fine. The pizzas were mediocre. We had several and they pretty much tasted  the same. The service was blase and the gratuity was included so absolutely no motivation to be the least bit attentive. Dinette was not a good dining experience...kind of sad.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "InAoDd5ZAAs9krdAcuqf-w"
  },
  "MRinMTcuvWI7yhKRtUFYeA": {
    "date": "10/5/2011",
    "text": "San Fran dining in The Burgh... who would have thought?  Trendy and posh is the setting. Light and fresh is the pizza. Friendly and nice is the service.  Def try this place out, it's a delight.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "as-qPpEJ74kLev--AADWZA",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/as-qPpEJ74kLev--AADWZA/o.jpg"
      },
      {
        "img_id": "jJ0DnZvlZY7KFOVdMt4MGA",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jJ0DnZvlZY7KFOVdMt4MGA/o.jpg"
      },
      {
        "img_id": "5oBAS0IC0iZksHP8F_W2rw",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5oBAS0IC0iZksHP8F_W2rw/o.jpg"
      }
    ],
    "user_id": "OgYi5x02MBukfxPNFe1ePg"
  },
  "tAhZF5SI414_B71mLXhsZA": {
    "date": "1/6/2014",
    "text": "I can finally check Dinette off my list of places to try and add to my list of places to frequent.  It took only a split second to decide to come here after attempting to go elsewhere, the best split second decision I've ever made.  When I pulled up and parked, seeing that the inside was jam packed was a good indication I was in for some awesome food.  I waited for a friend to show up before I ventured inside, giving me time to scope out the place as I chatted on my phone.  The dining area itself isn't very big, but it is set up in just a way that they make the best out of what they got.  Tables enough to make it comfortable, and there is seating at the bar.  There are bar seats that are situation in front of the prep area as well, so you can watch them construct the pizzas as the orders come in.  A little thing I liked about this place is that you get to see the kitchen area as well from outside.  You can see them preparing the ingredients used in the pizzas being made up front.  When I finally did walk in, I was greeted instantly, was told there would be a wait (expected), and that we could mingle at the bar and the host would come get us when a table was ready.  The bar area is kind of fun, kind of intimate.  It's a small area towards the back, dimly lit, and fun.  Only four stools to sit on and the rest is standing.  But no need to fret, even if you stand you have a place to put your drink of choice.  If you do stand, you get to look out at the East Liberty skyline, or watch the people pass by on the street.  The handrail doubles as a place to stash your drink.  The drink selection is limited.  If you are expecting a place where you can choose from a huge list with only beers on it, this place isn't for you.  Yes, it's True they have $1 Yuengling cans here, but set your sights higher.  A few bottle beers, one from Church Brew Works, and a long list of wines.  The bartender was nice, and fast.  After asking if eating at the bar was permitted and being informed it was.  I didn't move for the rest of the night.  I finally ordered my pizza and was quite delighted by it.  Who knew that hazelnuts would taste amazing on a pizza?  I didn't, but I do now.  Mix it with some red onion, Gorgonzola, and, chevre, might as well call that a masterpiece.  My friend had the pizza with a fried egg in the middle, I was jealous for just a second that I didn't order that one, but that jealousy faded fast when I went back to my pizza.  I like how on the menu it tells you that it's a pizza for one, but then they bring you what would be considered a medium at one of those national chains.  Even though the crust is thin, no reason to try and devour this whole pizza, take those few slices home and enjoy them for breakfast the next morning.  Dinette, you are a hidden gem in East Liberty.  One that is not lost to me anymore.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "bhRR2WrKc9S2iwKDbyea9w": {
    "date": "7/30/2014",
    "text": "Not the best brick oven pizza in the area that I've had, but a wonderful experience overall.  Affordable prices including $1 yuengling cans which I thought was a mistake. Good appetizers and an excellent waitstaff.  We'll definitely come back again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhQOA8-FdpA6D0hNhXEYIw"
  },
  "zfoMWcEnv7xruRuUvjydMA": {
    "date": "7/5/2015",
    "text": "I loved this place! No reservations, but also no wait for an early weekend dinner. The place is minimal, clean, and open (open kitchen!!). Some of the ingredients are harvested right from the rooftop garden! Blistered shishito peppers were amazing, packed with all 5 flavors - definitely making this at home. Lightly breaded and fried lemon slices were refreshing. Calamari was perfect -- lightly breaded with crunch without being weighted down, cooked just right before turning rubbery. \"Individual\" pizzas were great also, except the anchovy one was too salty and way too spicy. I love eating at places that inspire me and expand my own repertoire.  The menu does change daily. I heard their rice pudding is amazing. I don't eat the biggest portions, and had 2 pieces leftover for snacks the next day. Probably plan on 35pp with one drink. Our service was on target.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "jWiwVsVh111TlU8Uhq7g8w"
  },
  "D-x661xiRGTKXdaMqZ6neQ": {
    "date": "12/8/2013",
    "text": "A mid-sized pizzeria located on the second level of the shopping center at the corner of Penn Circle South and Highland Ave. Let me reiterate, it's on the second level as is the entry. Just in case I have not been explicit enough, Dinette is on the second level! Now that I've clarified the location let's talk about the food and the experience.  There was only a 20 minute wait for a table for two on a Saturday night. The host is able to text you when you're table is ready, so you have a chance to walk around the East Liberty / Shadyside area.  The menu is limited for food yet intriguing; (there is an extensive selection of wines and four craft beers as well as cans of Yuengling). There were about five appetizers, four non-pizza items, and about a dozen pizza combinations. All the items seemed while thought-out and uncommon which made choosing amongst the select items a challenge. For appetizer, we opted for the Fritto Misto which included fried shrimp, chickpeas, lemon slices, and I believe onion slices (though I'm not entirely sure of the last item). The dish was sour and salty. It was a bit strong for me as I sparingly cook with lemon and salt. I really liked the crunch of the dish.  For dinner, we opted for the Ricotta pizza. It's a basic margherita brick oven pie with chunks of ricotta cheese. I thought it was excellent. The freshness and purity of the ingredients really show through. I was especially impressed with the crust which was thin, crispy, yet strong enough to support the toppings.  The service was excellent too. Our waiter offered to clarify anything on the menu. He was also quite attentive without being invasive. Generally, all of the waiters and waitresses seemed to have this approach (which was noticeable because the tables are close together). The entire staff appeared to enjoy being there which translate to a very positive atmosphere for customers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SqVUNVeYJblyoUz4e-Fiqw"
  },
  "LV_A-uB9gO7dQO6rrN7ksw": {
    "date": "8/31/2015",
    "text": "I have mixed feelings about dinette. $1 beers are amazing, but other things seemed overpriced for what you got (peppers and cheese app, desserts). :-/ The pizzas, which are their main food, were amazing! I would say, stick to the pizzas if you go, because anything else is going to be twice as expensive as it probably should be (for the amount that you get). Oh and of course try the $1 beer... Duh",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "3DltS5Wr9MOntnc8StBFBA"
  },
  "hPeaD9immVH7mENKvGCqZw": {
    "date": "11/11/2016",
    "text": "Have been looking for an Italian-style pizza place since coming to this town... FINALLY found it! Was rhe best pizza have had in quite some time. Had the pepperoni and also the prociutto. Will be a regular spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5iTdaHwTbms9D-Th3DNweQ"
  },
  "UWXdVgJdino0nu7bX__tfQ": {
    "date": "4/20/2017",
    "text": "Dinette: billing themselves as a pizza place and wine bar, which should have been my first clue that they didn't truly understand. (Pizza is for beer or pop.)  The toppings on their pizza are good. They put together interesting combinations and use good ingredients. I have no qualms with the toppings.  The crust is another matter. It seemed to be aimed at people who thought that Domino's crust was too soft and flavorful. I've made better crusts at home by opening a tube of a Pillsbury product. They could have definitely improved the toppings by serving them on a pizza box instead of the crust.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EKl773AHwDD5fTdAPHWEMQ"
  },
  "7dWWGtRu4swhLvNwTuNoeA": {
    "date": "5/9/2015",
    "text": "Tried this place for the first time with my family today. Such a bummer. The food was great - so on food alone, I'd give it 4 stars. But holy crap - we thought we were being pranked or something by how crappy the service was!  I mean - bad. I don't think our server said a word to us the entire time we were there.   For the price - not worth it at all. There are plenty of places in Pgh where the food is as good and the experience is a hell of a lot better.   Save your money.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UQBBrEz-Wm40R7a1tBVf7Q"
  },
  "7lDU_YhNScOg41h3DEdvdw": {
    "date": "11/8/2014",
    "text": "Typically I would give this place 4 stars but tonight was different.  My wife and I decided to sit down at the \"bar\" (observatory) to eat and wait the usual 5 or whatever minutes to get a drink. This is per the usual and were fine.  Ten or so minutes pass. I'm looking at the menu wishing for something a bit more spicy and ask the waitress if I could add jalapenos to the pepperoni pizza.... NO  Then comes questioning angry blonde lady whom appears to run the place. I also asked her for jalapenos for my pizza. NO. Angry woman. Don't like customers. go away. Are you kidding me??? (the latter couple sentences were my interpretation)  The woman goes on to tell me \"You're not welcome here\" in front of my wife and every other patron in the place. Are you kidding me?  Terrible experience for me and my wife.  Have fun people.",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "N7r2Jol1osU5CyLs94T9eg"
  },
  "epq3M8owkKSKIRUoPdGx_g": {
    "date": "8/1/2019",
    "text": "My friend and I went on a Saturday night. They have a special that night for any pizza and wine for $25. Which is a great deal when you look at the cost of the pizza and wine alone. Because it was a Saturday night we thought it would be packed. Far from the truth. We were of 3 tables that night. I'm not sure if it's because there are so many places to eat at now in the area but a bit taken aback by it. We got the fresh ricotta pizza, which I highly recommend, and the zucchini pizza. All in all it was good food and wine and a great price!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RX8gC8dMNhRNMyQx0g3Zjw",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Zucchini pizza (top) and fresh ricotta pizza (bottom)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RX8gC8dMNhRNMyQx0g3Zjw/o.jpg"
      }
    ],
    "user_id": "UJaI94I_fxd4--ngts3gDA"
  },
  "D3cuHTHnVoO-VjloP4ECug": {
    "date": "8/10/2019",
    "text": "We like the concept but felt that the price point was a little expensive for the pizzas we got. The pizza was good but not substantially better than other options in the area. Have a good variety of pizzas.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eQGCn7KpoRho0C_EOF3kdA"
  },
  "pisGQFu7oOtVLiXGcZuaeQ": {
    "date": "5/3/2018",
    "text": "I REALLY REALLY wanted to like this place more than I did. The pizza, although good, was way overpriced. My friends and I got the Berkshire Prosciutto and the Fresh Ricotta - no complaints there, but I truly couldn't find the unique taste or flavor that made the $21 (per pizza) I paid worth it :/   The interior was super cool - very simplistic and modern (I love!). The floor to ceiling glass windows overlooks S Highland Ave area on an upper level of the building. Our service was great - the waitress was so sweet and checked in on us periodically to see how we were doing. I did read online that it is a sustainable restaurant - so that it ensures the staff have health insurance and good pay, which is something I love supporting. However, there wasn't much special about the flavors in the food I ordered.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TLXW9NysDRseCRHMCX5WDQ",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TLXW9NysDRseCRHMCX5WDQ/o.jpg"
      },
      {
        "img_id": "xhQIvgyUoENrGKDRW-ituw",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Table setup and menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xhQIvgyUoENrGKDRW-ituw/o.jpg"
      }
    ],
    "user_id": "M0YTvLhWhuUCa1BQ-v4-6g"
  },
  "ecK_hwgAOvb9jO4hJNZ_gA": {
    "date": "9/4/2018",
    "text": "Went to dinette on a Saturday night, not long after opening (5pm) for takeout. I placed my order when I arrived, one Berkshire prosciutto to go, and was told that I could wait at the bar area. I was immediately impressed with all of the awards that lined the walls around me, the cute decor and the natural lighting. I also could watch the chef make my pizza at the bar through a glass window, and every one of the wait staff was extremely friendly to me. It could have been mindless scrolling through my Instagram feed that made the wait seem so short, but regardless my order was ready in no time! When I got home, I devoured the beautifully made pizza and spent the rest of the night reminiscing. Everyone in Pittsburgh should definitely try at least once, and if you can't convince any of your friends to splurge, I'd recommend the take out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5MLPAEChQmkiljssWjBiHw",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5MLPAEChQmkiljssWjBiHw/o.jpg"
      }
    ],
    "user_id": "pOPz77TAtvj4DSxrhEC9HA"
  },
  "6EFkWZ-p9q-IM5wpnpZjvg": {
    "date": "2/2/2019",
    "text": "Excellent inventive pizza. Interesting wine list from around the world, reasonably priced. Friendly staff. Owner is a delight if you get to meet her!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pzpkx0tCdCORANffdF5rGQ"
  },
  "Osp3Tci2ptXvZtekISTWmQ": {
    "date": "10/21/2017",
    "text": "I went here for the first time recently and will definitely go back.   I had the pepperoni pizza and it was very nice. There was a bit of kick to it that I really enjoyed. I also tried the fingerling salad which was different but good as well. Then a glass of chardonnay which was great. Overall the service was attentive during the meal.  The menu prices are a little higher for a pizza place but there is a no tipping policy to balance that out.   The interior is small with modern decor and then tables or a \"bar\" style seating option. I noticed they were on the NoWait app which is great for getting in line when you're on your way to the restaurant if it's a busy night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lsLuVKmdh45yommr53zfRg"
  },
  "jYpE9b7gnZZJ-154wwpe7w": {
    "date": "3/23/2016",
    "text": "I have been here several times over the past couple of years.  Yesterday i want for a family dinner.  We went early on a Tuesday and had no trouble getting a table.  In the past I have had to wait, but I guess 5:30pm on a Tuesday is not prime time.  Be warned-- they do not take reservations.    As you can gather from the reviews, this is an a pizza joint.  I have had most of their pizzas.  Most recently I had the pepperoni which was fine.  I mean it is hard to completely screw up pizza.  That being said, there was nothing exceptional about this pizza other than it was single serve and cost $15.  There are several other places in the city that do a better brick oven/wood fired pie for less.  My sis had the Brussels sprouts pizza.  The list of ingredients sounded quite good, but somehow they did not work together and I was overpowered by the salty taste.  For starters, I had the red new potato salad.  Now this was probably the best part of the meal.  It was essentially a deconstructed potato salad.  The addition of avocado really made it.  Of course at $9, it is one pricey potato salad.  As for the drinks, they had $1 Yuengling cans so you cannot complain about that.  One could complain about the wine.  The cheapest glass was $10 which I think is a bit much for pizza.  As for the service, I cannot complain.  It was prompt and curteous.  The server knew the menu and gave appropriate recommendations.   To summarize, the pizza is average but the prices are above average.  Will I be back?  Sure because I have friends that like to go there because it is close to their house.  Would I choose it on my own?  Unlikely.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EOa2xOYPYXQ6Uhk184sChg",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Red new potato salad   was tasty",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EOa2xOYPYXQ6Uhk184sChg/o.jpg"
      },
      {
        "img_id": "KUD3bNzVlRZtkZMvhM6bYQ",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Pepperoni pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KUD3bNzVlRZtkZMvhM6bYQ/o.jpg"
      }
    ],
    "user_id": "VCj__r1jfuZVpnBRrzuTNA"
  },
  "7Ep5hlswj4uyCPTI46tUPQ": {
    "date": "2/26/2018",
    "text": "I don't know how it is that I haven't yet reviewed Dinette.  I have visited maybe a dozen times in the past 3 years.  I return not for the Pizza (wood-fired, Real Italian) which is very good, but for the small plates/appetizers, a few of which were MEMORABLE, as in when I eat or see something similar, it is compared to Dinettes version:  Potato Salad: unlike anything I've ever had, the salad is room temp with olive oil, greens, sliced egg -- all the ingredients of a potatoes salad without the mayonnaise goop, and with a slice of avocado.  Simply inspired!  Stuffed and grilled Seshito peppers: served warm with salt and olive oil Mac almonds, oh my!!!  Grilled peach: I can't recall if this was served with cheese or not, possibly - but it's the peach itself I recall.  Perfectly grilled. Perfect ripeness.  Warm. Literal perfection.  Soups can sometimes be amazing but often too under seasoned for my personal taste. But I get why they are not.    So keep up the good work.  People notice your work and appreciate it.  Just need more new dishes to add to my flavor memories!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4OxlHCvgF20kZHY7D4-gbQ"
  },
  "By6sg4ahJ0Zh7aPn-rpwQA": {
    "date": "11/10/2016",
    "text": "Have been wanting to try for a long time.  Stopped by with a few friends and really enjoyed our food.  I had the Berkshire Prosciutto that was very tasty - the salty meat with the nutty Parmigiano-Reffiano and the arugula was a well balance pizza.  The ingredients are fresh and high quality.  Service was relatively fast and so was our waiter.  He was really busy and made sure we had refills.  Had a glass of Italian wine that was a good match with my pizza.  As others have mentioned the pizza and wine are a little on the expensive side but you do get a quality product. Wish there was a little more to chose from like at C.Bella, that is similar but a little better and a larger selection.  The menu is short with about 8 pizzas a soup, a salad and about 2 apps.  I did see a desert but we were to full to think of a desert.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 15,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "xa2R5fKZMYF5xBftwbNlbg",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Berkshire prosciutto pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xa2R5fKZMYF5xBftwbNlbg/o.jpg"
      }
    ],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "3x0L7_YqnIvoVp7W8vtW8w": {
    "date": "11/21/2015",
    "text": "The breadsticks here are actually sticks! Taste- (presumably) and appearance-wise.   I got the banana peppers pizza not because I like banana peppers but because I liked everything else on the pizza: spinach, egg, feta cheese. It was not bad. Boyfriend got the mushroom + bacon pizza and liked it. Each pizza is made from scratch, comes out faster than you might expect, and comes in six thin slices. Although they recommend one pizza per person, I was only able to finish half of mine.   The bright orange chairs and all the children at Dinette kind of reminded me of a daycare center. There were these gray fluffy-looking objects hanging from the ceiling, which we thought might be flour or dough or something. Cute!   Taste | 3 Atmosphere | 3 Presentation | 3 Service | 3 OVERALL | 3",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OVSFBhFdW_MhtXzit6EKNA",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. mushroom, bacon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OVSFBhFdW_MhtXzit6EKNA/o.jpg"
      },
      {
        "img_id": "rcxLYAgsPGQRU5CaoLK2wg",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. banana peppers, feta cheese, spinach, egg",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rcxLYAgsPGQRU5CaoLK2wg/o.jpg"
      },
      {
        "img_id": "Q6-8fah6nXrfE5IoGn3frw",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q6-8fah6nXrfE5IoGn3frw/o.jpg"
      }
    ],
    "user_id": "HC5zLdut4caN1VPqxqRsMw"
  },
  "ENCOHwoCS4IFVwdaraBbdw": {
    "date": "6/21/2016",
    "text": "I visited Dinette with a friend last Wed. for dinner.  We were looking for somewhere with convenient parking, and my friend originally suggested another restaurant in the Eastside complex.  Remembering that Dinette was also located there and that I'd been meaning to try it, I suggested it as a substitute, and my friend agreed to check it out with me.  Because my friend drove and I was trying to keep the check within reasonable limits, we decided to forego the wine and focus solely on the pizza.  I ordered the fresh ricotta pizza ($14), which was a basic pie consisting of marinara sauce, mozzarella, ricotta, and basil.  My friend ordered the Berkshire prosciutto pizza ($17), which consisted of the eponymous ingredient plus arugula, shaved parmesan, mozzarella, and marinara sauce.  We split and shared the pizzas equally, which allowed both of us to enjoy both pies.  Of the two pizzas, I definitely preferred the flavors of the prosciutto pie.  The saltiness of the prosciutto complemented the nuttiness of the parmesan and the pepperiness of the arugula really well, creating a varied and balanced flavor profile.  By contrast, the flavor profile of the ricotta pie was much more subdued.  The contrast in this pie lie in its components' textures. rather than their flavors--the moistness and softness of the ricotta complemented the dryness and crispness of the crust and the delicateness of the basil leaves. The marinara sauce of both pies had a bright, fresh flavor, and the mozzarella complemented it well, in turn.  It was very evident that the ingredients of the pizzas were high-end, resulting in a high quality pie.  The decor is quite modern, consisting of bright red chairs and glass tables.  Service was alright, but our waitress didn't spend a lot of time on us, probably because we didn't order wine.  While I found the pizza enjoyable, I also found it somewhat overpriced, esp. in comparison to the other fancy pizza place a few blocks away.  While I realize that this isn't a completely fair comparison given that the cost of rent, parking, etc. factors into the price point, I personally have trouble justifying paying more for a product of comparable quality--I'm happy to cycle or take the bus over or else (have a friend) drive around for a few minutes.  3.5 stars.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 14,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "rt5Bn5c60WfwJ_cGe-TsHg",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Ricotta pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rt5Bn5c60WfwJ_cGe-TsHg/o.jpg"
      },
      {
        "img_id": "9v4Ybe4Q4UrfRdf8FIAIeg",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Prosciutto pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9v4Ybe4Q4UrfRdf8FIAIeg/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "MszI1QP0yESGs9pKmvy_DA": {
    "date": "6/26/2018",
    "text": "Overpriced, mediocre food.     Will not be back  Don't like the no tipping actually.  If a wait staff is good I want to reward them as such.    There are better places in the area",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KEodD7jrJIE1y6_crQGSiw"
  },
  "e8CtyuyfD2BdCguzXV6bKw": {
    "date": "2/3/2018",
    "text": "Mediocre.   We were excited to try this place as we heard good things. We asked for Seltzer/Club soda to drink and the server said they only had \"bottles of sparkling water\". We were ok with that, thinking we were going to get Pellegrino. She brought over a reusable plastic soda stream bottle - like the kind you make at home. I would be fine with this (as it does save waste/recycling) if we were warned that it's a $7 charge. Then, I ordered the Ricotta pizza - and asked if I could have some chili oil on the side (they serve it on the meat pizzas). The server informed me that they do not allow additions or adjustments to anything - only that you can remove something if you need to. The chef doesn't want her recipes messed with. Look, I get it - but it's a condiment! Come on. I was so disappointed with the pizza. It was bland and very unsatisfying. The ricotta was plopped on to a below average Margherita after it was cooked so it was still in cold lumps. And there was barely any red sauce on it. I couldnt even salt and pepper it, because there wasn't any on the table. The ingredients are of high quality, and if you like the thin crispy type pizza, then this is your place. Apparently their apps are better, but it was advertised as a pizza place - so...",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VQDI1SenFQn0N7jcG-jB5Q"
  },
  "2Bd0LyAX-ndLj1AsZxvygA": {
    "date": "1/31/2015",
    "text": "Dinette has good food but I'm not overly impressed. My husband & I will eat here usually a couple times a year. I really like that they are always changing up their menu so it's a chance to try different pizzas each time you go.  The food is a bit pricey, almost $20 for a small pizza.  The service is middle of the road, not awful but could be better.   I'd say Dinette is definitely worth trying but sometimes its better than others.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zzA9l09SZzUQEJaJHFIXdg",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Salted cod toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zzA9l09SZzUQEJaJHFIXdg/o.jpg"
      },
      {
        "img_id": "_8AkRFexw_nyxK1a2813Zg",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Pizza with brussels sprouts &amp;amp; butternut squash",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_8AkRFexw_nyxK1a2813Zg/o.jpg"
      },
      {
        "img_id": "NRBsZrYiIQ2B5kma6ZGBcw",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Mushroom pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NRBsZrYiIQ2B5kma6ZGBcw/o.jpg"
      }
    ],
    "user_id": "9pbOJFanh66_QnIb5Fjblg"
  },
  "FvwXmVeADkf-N_il-nzRAA": {
    "date": "4/1/2016",
    "text": "My hubby and I just came here last night, and when our waiter greeted us with a \"welcome back,\" I knew that I simply had to update my review of Dinette!  When I've had a long week and need some comfort food, Dinette is my go-to spot. I love how innovative their menu is and that it changes constantly. I can come here once/month and still have a new, fun, seasonally appropriate pizza to try. Plus, with $1 Yuenglings and two of my other favorite beverages (Full Pint White Lightning and white wine), I always leave happy as a clam.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "cCke3VtFLtqgzkgYSrSE2g"
  },
  "H_m27gtlmhG6LiBVnU32aw": {
    "date": "1/24/2016",
    "text": "As my mission to try all brick oven or wood-fired pizzas in Pittsburgh continues, I stopped in here after a coworker recommended it as his go-to. Upon walking in, I immediately noticed the place was tiny with a bar surrounding the kitchen/oven. And it was packed.   The food was alright but just a bit overpriced. My husband and I ordered the Grilled Shishito Peppers to start and the Pepperoni and Salt-Cured Anchovy pizzas for our entrees. The Grilled Shishito peppers were delicious: they're served on a plate of olive oil alongside fried almonds and bits of goat cheese. I'm not usually a huge fan of goat cheese but theres was very mild. The peppers were sweet, almonds were salty and cheese was creamy. Overpriced though. You only get seven peppers for $9. The crust on the pizzas was super thin. The pepperoni pizza wasn't all that great, according to the hubby. It was a little too greasy with both the pepperoni and the addition of chili oil. On the plus side, they're generous with the pepperoni. I really enjoyed the anchovy pizza, although really salty since it didn't have much to contrast the saltiness of both the anchovies and capers. However, the freshness and spice from the jalapenos were nice.   The service here was quick and overall, the food was decent but overpriced. I can't say for certain when I'll be back, but I will say that you can't find anything like Dinette anywhere else in Pittsburgh. None that I've tried, anyway. They have quite the special, one-of-a-kind pizzas with their paper-thin crust and unique offering of toppings. Plus, they have $1 Yuenglings all day, everyday.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dN6UhBI2zMVFkYYcA6eXEA",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Pepperoni",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dN6UhBI2zMVFkYYcA6eXEA/o.jpg"
      },
      {
        "img_id": "ElMrydjBge1cNxJ9nqi21w",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Salt Cured Anchovies",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ElMrydjBge1cNxJ9nqi21w/o.jpg"
      },
      {
        "img_id": "Y2FWVdc6sGbxWEv6x1PJOQ",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Grilled Shishito Peppers",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y2FWVdc6sGbxWEv6x1PJOQ/o.jpg"
      }
    ],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "3X6H_CzfAk7GKuFEgDGTag": {
    "date": "8/22/2017",
    "text": "Mercurio's is 100 times better. This is place is double the price and twice as bad. If you think this is good you don't know pizza.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "vw5_mVTImolRIJ-Gb5qJ5Q"
  },
  "F4gaH5hTPg2cLqh7UZU0IA": {
    "date": "10/14/2016",
    "text": "Stopped here on a Tuesday night. I've had a giftcard for a while and kept not getting around to it. I really wanted to compare it to Pizza Taglio nearby though. They share a lot with the rest of the stores in the complex so you should be able to find a spot. It's a fairly big lot. Luckily on a Tuesday evening, it wasn't too crowded and we were seated right away. It's a pretty small place so I think it would be packed sometimes.   I got some wine and my boyfriend had a $1 Yuengling, which is a pretty good deal. We ordered the Prosciutto pizza and the pepperoni. Both were very good. I liked that the pepperoni was crispy and the prosciutto pizza was really tasty too. The salty prosciutto went really well with the arugula and parmesan. I'd definitely eat here again. Service was quick and the food was ready pretty quickly. I imagine it would be slower when busier since the pizzas are only enough for 1.  I loved how crispy the crust was and thought this was really good pizza, but I wish it were a couple dollars cheaper. It's not somewhere I'd be back to too often because of the price, but it is tasty and would be worth a splurge every now and then.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6djyuTKCGCJHMk79AeiFYg"
  },
  "CoIiI7VTAkcD2EbKQiJz7A": {
    "date": "2/21/2017",
    "text": "Very nice and romantic place! I came with my husband for the beef carpaccio and the prosciutto pizza. They no longer serve beef carpaccio (very disappointing) but the pizza was really good. Perfect place for a date night!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IYxadXSgEJLVy-NN6jTYEw",
        "caption": "Photo of Dinette - Pittsburgh, PA, United States. Prosciutto pizza :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IYxadXSgEJLVy-NN6jTYEw/o.jpg"
      }
    ],
    "user_id": "Xpm_g8PcLqBsCVGd8FofRA"
  },
  "z83TTiLhXE1itks_aD4PcA": {
    "date": "4/19/2018",
    "text": "Don't kid yourself. At best, it's worth half the price.  Nothing extraordinary.  The emperor has no clothes on.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYRncZrcY-VyKYf1k821Ug"
  },
  "90ZDx8CGsd3ZP3DvCkgyYw": {
    "date": "7/8/2011",
    "text": "\"How have you not heard of Dinette?\"    My foodie dinner mates were surprised that I had never been to the restaurant in East Liberty.  How could this be?  I live for pizza, especially homemade, and Caesar salads are my favorite.  I arrived a few minutes early, and was taken to a seat by the window.  The decor at Dinette might be described as modern, with the polished stainless steel tables and contemporary-styled orange chairs.  It's not a large establishment, and probably seats approximately 50 people; 15 or so extra in the summer with the outside tables.  Large windows provide a view of Penn Circle.  As I nibbled on a breadstick, I noticed the clean open-kitchen.  You can watch as the dough for your pizzas are being hand-stretched, and thrown into the oven by the culinary staff.    My dinner companions arrived, and we began to look over the menu.  The choices are few, but enough to accommodate any palate.  There was a fresh Caesar salad (my favorite, remember?),  Tabouleh with avocado and fresh mint (from the roof garden), Marinated Olives, Mixed Salami Plate, and a myriad of hand-made pizzas.  I was told by my friends that the menu changes on a regular basis.  Dinette has an uncomplicated wine list.  We sampled a Lebanese red which was fruity and delicious.  There was also a nice selection of imported beers.  We started with Caesar salads.  I love the furry little fish which are the main ingredient of these salads, so asked for a side of a few.  Our server gave me a strange look, and said, \"I can ask...\"  When she appeared with our salads, there were no extra anchovies.  Apparently, providing the customer with a few extra fish (on the side) would have compromised the integrity of the dish.  It's always better to accommodate the customer.  That being said, this was one of the best Caesar salads I had ever eaten.  The romaine was perfectly ripe, green and slightly sweet.  The dressing was tart, spicy, and had just enough anchovy taste and plenty of black pepper.  The croutons with the highlight of the salad; roasted ciabatta bread seasoned perfectly, doused with olive oil, and not over-cooked.  The shaved parmigiano-reggiano was strong; a perfect contrast to the natural sweetness of the leaves.  Pizzas were next.  The pies served at Dinette aren't huge- they're enough for two, maybe three people.  We opted for the prosciutto pizza with tomatoes, arugula and fresh mozzarella.  We also ordered a garlic-scape pizza with frilled corn, peppered bacon, and mozzarella. The crusts on the pies at Dinette are thin and crispy.  Even better, the bottom of the crusts are crunchy as well- even with moist toppings.  The prosciutto pizza was delicious.  The combo of cured meat, fresh mozzarella and spicy arugula was intoxicating.  The garlic-scape pie was delectable, with naturally sweet corn, peppered bacon and more fresh cheese. We ended our meals with a chocolate pot de creme.  Our dessert arrived in a small ramekin- three to four ounces of chocolate bliss topped with fresh whipped cream.  The dessert was perfect- not too sweet, and just the right amount of sweet to end a sensational meal. Pies at Dinette range from $12.00 to $16.00.  Overall, the food being served at Dinette is some of the best I've had in the city.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 9,
      "cool": 6
    },
    "photos": [],
    "user_id": "nHxQfB9CRettoPKJmkDx_A"
  },
  "9seoqxVv7L3SjG1aiCxuIg": {
    "date": "3/10/2015",
    "text": "My favorite pizza in Pittsburgh.  The menu is inventive and creative.  The shishito pepper app is to die for.  The pizza is always perfectly cooked and I've tried some things I have never had before on a pizza (ie. fried egg, kale, etc.) and have loved every pie.  Love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CblWTB5Bv-1i8ZnS-8614Q"
  },
  "pnN6c5sq0D9Y4sue8droEw": {
    "date": "6/16/2010",
    "text": "For a bit of a change, I decided to check out the menu at dinette. So, I did a quick search and decided to place a pick-up order.  When I called in, I was told that you had to come in to the restaurant to place the order,that they did not take orders over the phone. I was a little disappointed,but I decided to go down there anyhow.  When I arrived I was greeted by a very friendly wait staff that directed me to the counter. I began to place my order and was told, \" oh, we only sell pizza to-go.\" Again, another disappointment. I said ok and ordered a pizza.  For all the effort and at the price of $15, the pizza was at best medium. It was somewhat dry and burnt in places.  I am not eager to dine there anytime soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UhFRprWEILP9Fg2R7mU1uA"
  },
  "ssW157wVBCQHPDZRe1IpzQ": {
    "date": "2/3/2013",
    "text": "I don't think there's anything wrong with Dinette's pizza (thin, crispy crust, gourmet toppings, seasonal ingredients), and the space is really lovely, but eating at Dinette just never seems like it's quite worth the trip and price.  It's usually noisy and crowded, and in the winter, try hard not to be seated anywhere close to that door.  I've yet to have a great wait-staff experience, the wait is quite length, tabletop space is small and crowded (especially if you're not sharing a single pizza), desserts are sub-par, and I do think the price-point is a bit high for the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oOrTAswjcLcMOqNQqSP9AA"
  },
  "g1ggJnetjw7pUVM_lYV9Uw": {
    "date": "8/22/2012",
    "text": "Dinette was a welcome surprise after a long drive. As a New Yorker, I admit, I wasn't very excited about eating pizza outside of New York: their pizza is a revelation - better than many many pizzerias in New York. I ordered a simple pizza - basil, mozzarella, and fresh tomato. The crust was absolutely perfect: not too thick, and not too thin. I give them five stars, despite the fact that it was very hard to find their location - even with Google Maps: the reason is that they have no sign on the city/streetside. It's not their fault, though: it's the landlord's! So, even if it takes you a bit more time to find it - go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "INHS773IcMC9SKqsh78DQA"
  },
  "Avpfjfv9snm4oSOvMfbMSg": {
    "date": "7/9/2009",
    "text": "I would give Dinette 3.5 stars if I could.  To start, my date ordered a lovely cucumber/barley/tomato/basil salad that was possibly the highlight of the meal.  I started with a caesar salad which was basically half a head of lovely romaine with an ample portion of Parm-Reggiano and their house caesar dressing, which I found a bit strong on the anchovy side of things.  We followed the salads with a grilled eggplant pizza that was just right.  While some might consider it scant on the toppings, the 4 or 5 pieces of grilled eggplant, kalamata olives and cheese was well seasoned, full of flavor and didn't need to be weighted down by anything else.  My main complaint is that service was sub-par.  I appreciate being left alone and don't mind a cold, unpersonable server but this was a bit to the extreme.  Seem to have a good thing going, hope they can make it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ME1-IwMQMHkowOxffKUx7w"
  },
  "qP3B-5TX7_Iz3mitZzravg": {
    "date": "7/12/2011",
    "text": "This was my third time here.  The first two times was in the first month of it's opening.  Last Friday evening, reinforced my previous opinions.  The pizza is good.  Yes, it's fresh.  The service is adequate (not horrible, but nothing to rave about).  The ambiance is simple.    However, when it comes down to it - it's pizza.  Every time, I have still left hungry because I like to eat.  One slice at Pizza Sola is more sufficient than a personal pie at Dinette (and 1/3 the price).  I understand I am paying for \"quality\", which it is; however, the pies aren't all that impressive in terms of creativity and inventiveness.  My boyfriend had the Ricotta Pie (tomato, mozzarella, basil leaves); I had the Zucchini pie (mozzarella, onion, olive, and rosemary). My boyfriend's pie had 4 small pieces of basil leaves on it - so much for wanting to taste basil.  The sad thing about my pie, I ate the entire thing and tasted rosemary about three times; while the zucchini was unevenly placed and the onions and olives almost non-existent.  The crust was burnt on one end, but I dont mind a crunchy pizza.  The flat bread pie is good when the plate first hits the table, but after your first slice, the center of the pie starts to get soggy.  Towards the end of your pie, unless you're a champion speed eater, the pizza is soggy to the bone.  But there is mozzarella on EVERY pie; so not too many options for the lactose intolerant (goat cheese anyone?).  There is even proof of this Mozzarella overload on their recycled business cards with their summer hours printed on it; on the back, you can see it's an old menu with the words \"mozzarella\" running down the entire card.  My boyfriend and I got a chuckle.  I'm still waiting to be blown away with this place, but its just not there for me.  In the end, my boyfriend and I went home and still made Shakeology meal replacements for \"dessert\", which was way tastier, more filling, and includes more organic ingredients than our $50 appetizer \"meal\" at Dinette.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oWKM-KpfsyNrwfYsdfTLVw"
  },
  "CEiIpOXIM09yBZ-YttSoqA": {
    "date": "1/29/2011",
    "text": "Food: Dinette's specialty is specialty pizza made fresh with organic and unique local ingredients.  We ordered an appetizer, a salad, soup, and a pizza.  The pizzas are meant to be ordered for one person, so two people order two pizzas.  They're 8-cut pizzas.  If you are really hungry and order nothing else, one pizza is probably a solid meal, but if you aren't starving or order appetizers, a pizza could definitely be shared among two people.  The menu is changed daily, and is dated at the top to prove this.  There were 3 vegetarian options when we went.  It doesn't look like you can create your own pizza or change toppings.  There were about 10 different pizzas to choose from with many options including different meats and vegetables.  We had a grilled pepper appetizer which was the best part of the meal.  It was fresh and delicious.  The mushroom soup was very good too.  The grilled romaine salad was exactly that, a half head of romaine grilled with some veggies and dressing tossed on top.  It required a decent amount of effort to cut and eat.  The pizza is very fresh and tastes good, but not great.  Its slightly better than a \"specialty\" pizza from a delivery shop.  Its thin crust, and the dough is the best part.  The toppings were very scant.  A unique type of olive was one of our toppings, and each slice had exactly one piece of olive on them.    Price: Unique ingredients are expensive, but the price is the main downfall of Dinette.  We ordered two drinks each, one appetizer, one soup to share, one salad to share, and one pizza each and our bill was over $80.  True, it was a decent amount of food, and everything was at least average tasting, but $80 for essentially pizza seemed to be too pricey for us.  The average pizza price was $14-15, appetizers ranged from $4-9 and the salads were around $8 and appetizer size.  Drinks: Dinette prides itself on its pizza and wine selection.  There are many wines to choose from and they are reasonably priced.  They have 3-4 beers to choose from ranging from micro-brews in bottles to $1 Yuengling cans.  You have a choice between sparkling water or flat water that is served in a glass jar.  Atmosphere: Presentation is key at Dinette.  All of the food is served in an esthetically pleasing way more likely to be found at a fancier restaurant.  The location within the Borders plaza is somewhat strange, but the huge windows provide a nice view of Centre Ave. and people walking by.  The tables are nicely arranged and spaced apart from each other with some having individual coat hangers for your coats.  There is a small bar to sit at while waiting for a table.  I don't know if it is the windows or the small overall room but when even half full, the restaurant is very loud.  At times it was distracting and even annoying how loud the conversations became, and there was also a strange rumble noise.  We couldn't determine if it was from the unit below, the restaurant itself, or something outside.  Regardless, it was loud.  Service: The service was Dinette's strength.  The hostess was friendly and we were seated at the bar and subsequently at our table very promptly.  Our waitress was also very friendly, answered our questions, and checked on us frequently.  The bartender recommended a good wine.  The food takes a while to come out, particularly the pizza which is made fresh, so ordering an appetizer is probably a good idea.   (+): unique concept, good ingredients, nice atmosphere, great service  (-): too expensive for what you get, loud  Would I go back again? Probably not.  It was worth a try, but if I want pizza and wine I'll order delivery, get a $10 bottle at the liquor store, and save $50.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZpTrjeZQ4c_9YA018SXnwA"
  },
  "9MUzlBmxCgDq1ZiQYA1yeA": {
    "date": "5/2/2013",
    "text": "Let me just start off by saying:  I loved the food.  Everyone who was with me liked theirs, too.  Nice atmosphere, great service, all that.  But it's... really overpriced.  It pains me to say it because we did have a nice time, but man, $15 for a one-person pizza, plus $9 - $14 glasses of wine, that's just way too much.  I can buy two BOTTLES of decent wine for $14.  I know every restaurant marks up the bar prices, but really.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aua1raVVfc5WAJcq3-cdew"
  },
  "NksxG0ShB6IIYzNWasNH2w": {
    "date": "3/25/2009",
    "text": "Dinette's menu consists mostly of pizzas with interesting and unusual toppings which are changed on a daily basis. I got to sample several of these which were all decent, but none of them were super exciting. The clam pizza, for example, only had five small (in shell!) clams on it and otherwise tasted like a cheese pizza.   Appetizers were fairly tasty, and they have a small selection of beer and wine to choose from as well as a few desserts. This is not a bad place, but it's also not nearly as exciting as I'd hoped from all the good things I've heard. For the price, I was a bit underwhelmed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ZZNOoMQ7WFvFoxDUFw1wg"
  },
  "GMgUPOwGFUouZzs3QsdZrg": {
    "date": "3/27/2009",
    "text": "Pretty small place with a very nice menu. We ordered a few appetizers and 6 pizzas (they're sized for individuals, but like most places, that means 1.5 normal people worth of food). They offered to bring out the pizzas as they were ready so we could all share, which was nice. The pizzas were all excellent, and they had some unique selections. They are definitely italian-style \"light and healthy\" pizza, so you can eat one without feeling disgusting and bogged down in grease afterwards.  Lots of parking in the big garage right nearby; Dinette is on the third level. (Random note: the bathrooms have awesome jet-engine hand dryers.)  My only complaint was that the wine there was pretty bad. Order a Yeungling instead. They also have $1 cans of Iron City, but why you would want that anywhere near your mouth is beyond me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z1BeADAICao_9Zree6O6wQ"
  },
  "uCq_nKN2-npU-9LDAEwZig": {
    "date": "7/24/2012",
    "text": "Great!  The BEST thin and creative pizzas.  But also some delicious \"real\" food as well.  Everything is seasonal, local and super fresh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BNWKrplb5za6RXAKS4exYg"
  },
  "nbKff45WNx9j5N0ZA8ht-Q": {
    "date": "9/17/2009",
    "text": "Dinette is chic and fresh. Inside this stamp-sized dining room, I could have believed that I was transported to Georgetown or Bethesda.   They keep a short rotating menu (in keeping with their local sustainable philosophy, I suppose), though the changing items seem mostly like minor variations.  Of their offerings, I like the starters better. The preparations seem more original, and the ingredients more interesting. On this outing, I had the baked bone marrow, which was really excellent. Although their pizzas are made well (crispy thin crust, piping hot), nothing really screamed out unexpected creativity. My eggplant pizza was tasty (though it would have been better with a few more eggplant slices), while my companion's cardoon pizza was sort of bland. I had their chocolate pot de creme for dessert, which was nice and rich. It would have been perfect if they served hot tea in addition to espresso.  The restaurant does end with a Georgetown-sized bill, but I think it was worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tGx9-4LpdahotPuNuVfNVQ"
  },
  "sXxJuVMUKWfpDPc65VK_IA": {
    "date": "10/8/2011",
    "text": "A nice, cute place to have dinner at. The pizza is very nice (plus not greesy), but I would say slightly overpriced. The people at the service are nice and polite, however it can take a long time before you start eating, so don't go starving at the place :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SfRlZcoYPw76lNsw7TEO7w"
  },
  "OvMBDHeoRZpfKlykFHkTCg": {
    "date": "12/3/2010",
    "text": "FINALLY!!  I've been searching for years in many various places for a new favorite artisan pizza place, and I found that in Dinette.  (I miss my Positive Pie pizza from Vermont.) Highlights: --Little Neck Clam Pizza tasted like sopping up great bread in a big bowl of perfectly seasoned clams.  By far it was the favorite! --Anchovy and Jalapeno Pizza had the flavor of the anchovies all through it, and the spice was just right.  I had been eying this pizza on the menu for weeks, and was thrilled they still had it!  Please keep this item forever! -- Radicchio Pizza was a bit too bitter for me, but the others thought it wasn't bitter enough.  They loved it. --Great wine list!  I recognize most of the wines on the list, and they are beautiful representations of great off-the-wall wines for great off-the-wall pizzas.  We brought our own wine, and the Oregon Pinot Noir was the best match of all the wines with the food (the Cabs were too strong).  Corkage was $20, which is very reasonable. --Service was friendly and attentive.  She never missed a beat, and put up with my drunken friends. --Decor was simple and chic.  I love the location and the open kitchen.  My only disappointment was with the appetizers.  I felt they were drowned in oil.  The oil was a good tasting oil, but I felt there was too much of it.  Wonderful restaurant!  I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "EuMjBy5Ul0p-FF3IvvbzXA"
  },
  "mjLvTE7deBK4KPZ7a4mSXQ": {
    "date": "5/7/2010",
    "text": "The only thing this place has going for it is the interior, which is a very well designed and clean modern space. Sadly, I'm reviewing a restaurant and not a museum or gallery, so that's where my positivity ends.   Perhaps it was a bit hyped and that is the reason for my intense letdown, but this is honestly one of the worst dining experiences I've had. The menu was very sparse, but I'll accept that if what they specialize in - pizza- is very good. I'm vegetarian, and pizza is a very vegetarian friendly food, but there weren't many options on the menu. Mushrooms are one of my favorite items, so I opted for the rather expensive mushroom pizza. What came out was basically a piece of dry cardboard covered in bad cheese with 3 mushrooms that were disgusting.   Beyond the letdown of the pizza itself, I thought I'd get their olive plate to try to get something in my stomach, and it was yet another letdown. I've never gone back, and don't plan to. In my opinion this place is just pure hipster hype, and nothing more.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "J2Jx6mOZBVydg2Y6CPkJsg"
  },
  "nqObT_FVavj4JnCYlyPvNA": {
    "date": "11/4/2008",
    "text": "Dinette is a new restaurant in the growing East End area.  Red Room, Red2, Richard Chen and Typhoon are all near by. While Dinette is smaller than the rest it definitely holds it's own.  The menu is small and local which is a plus, it was difficult to pick what to get.  While most of the menu is pizza, all are gourmet and very tasty.  We went on a Saturday night at around 8:30 thinking that it wouldn't be too long of a wait.  While the wait ended up being about 30 min, the initial 15-45 minute wait time frame through us for a loop.  We didn't mind much since the pagers they offer give you quite the range, to have a drink we headed to Kelly's Bar down the street and still got the page.  The wine list has a lot to offer and the ambiance is spectacular.  The simple decor and floor to ceiling windows that let you look into the kitchen are all a plus.  It you don't mind waiting (and you shouldn't) you need to check out Dinette.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "84F_UxRVby3WqFIxt3Wshg"
  },
  "Id5kL-r__BErBHPTXAmygA": {
    "date": "3/5/2010",
    "text": "NOT kid-friendly. Kid-tolerant maybe, but a limited, inflexible menu with no True kid choices. And no kid drinks even!  Food was fine, but not fabulous. Perhaps a little pretentious, because its just trying too hard (battered fried poached egg??).  Service was acceptable. I won't be back.  it just wasn't THAT good.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "0oum8QakI1St-_zzlRjD8Q"
  },
  "XZZ2VDcqqyzE8LHfrzJVpg": {
    "date": "10/18/2011",
    "text": "Dinette scores with its fizzy, airy dining room, its friendly staff, and its concept, which is: a limited menu of enticing appetizers and fresh-ingredient-based pizzas, served with wine.   But there are problems. This diner and his companion arrived on a recent Friday night at 8:45, quickly found two seats at the pizza bar, and didn't actually begin eating pizza until nearly an hour later. \"Thanks for waiting, guys. We were really swamped,\" was the chef's comment. No big deal, of course, but Friday nights tend to be busy. Perhaps more than two people should be making the pies?  The service was friendly but unpolished. A bottle of ordered wine was  quickly presented, for example, but opening it proved bizarrely taxing. An awkward two minutes of silent, tormented cork extraction.  To start: Some marinated olives, which were fine, and \"roasted\" bone marrow, which was not. The trouble here was manifold. The dish costs $10 and yet comprises just one one four-inch bone, sliced lengthwise and grilled, olive-oil-oozing toast, and a bit of salsa verde; clearly the restaurant believes you'll pay for novelty. Surely you aren't paying for bounty. Or taste. Slicing the bone and grilling it is revealed a foolproof method for turning gooey, delicious marrow hard and dry, and drowning toast in olive oil yields a fatty background for a fatty leading player, which isn't smart. A dish that has been simplified and perfected elsewhere is needlessly complicated and muddled at Dinette.   The pizza was good, not great. One with spinach, cherry bomb peppers, garlic, and cheese left the diner wondering whether scant slivers of red can verily be called a topping. A prosciutto concoction--with arugula and two cheeses--did better, dripping with salty, thin slices. Crust was unremarkable; diameter generous.  Pizza, made with good ingredients, is simply expensive. The prosciutto pie at Dinette, built for one eater, is $16. The bill for two single-person pizzas, with a bottle of wine and two meager starters, was about $100. Not terrible, not wonderful. Perfectly passable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uC8QW4tUce_lhBjhFINLlw"
  },
  "KqaJ0jBnjZhJNpsSEwQqDw": {
    "date": "10/29/2010",
    "text": "Took me a while to get to this gourmet pizza place, but now I go at least once a month. Really excellent food and wine, and pretty easy to get a table after 8, even on weekends.  The chef has a great sense for pairing flavors. I always have a hard time choosing a daily special pizza over the few standards (fresh ricotta with basil, mozzarella, and tomato gives me nice flashbacks of Roberto's margherita; the prosciutto is always a winner too) but I've never regretted it. I had \"English Peas\" a few months back and the peas were so sweet and pea-y but perfectly balanced with ham (I think it was pancetta) and a sweet cheese. I haven't ordered the anchovy pizza myself because I'm not a jalapeno fan, but when I traded for a slice of my friend's pizza I understood why they were there - it all fits.  They also have a freakish ability to stock each plate with the right amount of each flavor. No need to save almonds for the last bite of your grilled peppers, it actually will all come out even!   Great wine list, lots of French wines and other imports. Good beers and froofy sodas too. If that's not your thing, they also have Yeungling in a can for $1.    The dining room is bright and cheery, funky silver tables and plastic chairs. The bartender and waitstaff are professional and friendly (though I don't understand how they all end up wearing the same color shirt every day). You can go casual with your kids or a little dressy with your date. Parking is free and right outside (near the Borders at First Side) and since the dining room is all moveable it's no problem to come in with a wheelchair.  Everything's good. Starters, salads, pizzas, desserts, awesome. Fresh ingredients and an excellent, creative set of chefs - what more could you want?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YjZv-FJZVymiywZDWHhLeQ"
  },
  "sUjYvvq7YqqcApIzOqsvCQ": {
    "date": "3/1/2014",
    "text": "Love most of their pizzas minus the Salt-Cured Anchovies, its real salty. But one of the few places in Pittsburgh for great Gourmet Pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uy6dw6-sBxpxuZvHpPb8iA"
  },
  "ATkf_K4G7ZCEMg0vozKLMw": {
    "date": "12/11/2013",
    "text": "I figured that a second visit would bump this place up to a 5 and I was definitely correct. This time around, I ordered the portobello soup and the sweet potato + chorizo pizza. I can't decide which was the star of the meal (they were both so amazing). The portobello soup was full of flavor and had a rich but not heavy consistency. Easily earning a spot on the best soups I've ever tasted list (and I'm king of a soup nut). And the pizza...the pizza was out of this world. It helps that sweet potatoes are perhaps my favorite thing on earth; however these were particularly well done even for my dining companion who isn't normally too wild about the tuber (roasted in strips so that they came out almost looking like a softer veggie chip). The chorizo was flavorful/spicy and the peppers added the perfect extra kick. This was the perfect winter night meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cU6f0FfwVwGwj4NYf2cdcg"
  },
  "HTgxBFRCNLRlfT7fMK7tQA": {
    "date": "2/16/2014",
    "text": "The food is amazing.  The service is wonderful.  If your lactose intolerant just add Parmesan and cut out the mozzarella.  Thank you for the food and wonderful service.  We ordered an appetizer and 4 pizzas. It fed 5 people very well.  Try the home grown peppers they are great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WhjD2Rlu01WQC4XwlmPJJQ"
  },
  "xzZbVMiGuQ7vlirufnkxxA": {
    "date": "3/14/2014",
    "text": "The pizza is so delish! I bring my out of town guests to this place and it has them wanting more! Their pizzas are cooked perfectly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aQ_d-v2IlAAYDUJq4CaOxg"
  },
  "2H0fACpaauf5td3jsFDvWA": {
    "date": "4/30/2015",
    "text": "Nothing spectacular here at all.  We decided to try this place because we heard good things from other people.  I wish they had at least one alternative to the already limited selection of beer and wine.  Maybe a hard cider or milder beer?  As most other reviewers stated, the service was nothing great by any means.  Especially since they weren't very busy at all.  We chose to start with the shishito peppers and bone marrow.  Both were good.  The bone marrow came with 2 pieces of toasted bread.  The peppers were served on a dish of flavorful olive oil that we wanted to continue to enjoy by dipping some bread  in it.  We asked the server if we could maybe get another couple slices of bread, like we got with the bone marrow.  We were told no because the bread is portioned out.  We found that odd.  Our pizzas were brought out by our server and the manager.  We again asked the manager about the whole bread situation.  She explained that they do not like to \"waste food\" and so they portion out 2 pieces of bread each SOLELY for the bone marrow appetizer.  We said we were willing to pay for a couple more pieces of bread, but she refused and told us they only had 3 portions of the appetizer and the bread was reserved for those only.  This was maybe 45 minutes before they closed, mind you.  Could more people have come in that time frame and ordered those 3 portions of bone marrow?  Well yes, but highly unlikely for a Tuesday night.  So I suppose the bread just sits there day by day waiting for people to order the appropriate amount of its requisite counterpart until it is finished up before making more.  Because that would be wasteful if not.  We didn't quite get that business tactic.  Being as it was not spectacular bread in the first place, I can only imagine the insanely small cost of making a loaf.  And as it were, the bread was charred.  Not just grill marks you would expect from either the grill or wood fired oven.  We did not choose to complain about that fact because we were hungry enough to ignore it.  However, if we voiced our displeasure with the state of the bread, would they then have brought out the sacred new pieces of precious bread to replace them or just let us sit there with burnt bread?  One may never know.  And we surely won't know because the arrogant and snotty way in which this was handled was more than enough to turn us off to this place.  We were not looking for a basket of endless bread.  We simply wanted to not let the excessive amount of olive oil on the plate go to waste.  Which did go to waste.  So I guess the \"waste not\" theme was thwarted by themselves.  And I know for a fact that the crispy long breadsticks they place at every table go to waste.  Their idea of not wasting food product is basically pick and choose.  It's conflicting and confusing.  Was the pizza good?  Yeah, I guess.  It was hit and miss with the selection we chose, but not good enough to go back for and put up with the attitude.  I never would have expected  to be completely turned off by a business over a couple pieces of bread, but I guess there's a first time for everything.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ae_Mb4w14DZBi_Nr6GhC4Q"
  },
  "iH_ERDVtuVE5DD3Ri9Q4tQ": {
    "date": "10/16/2011",
    "text": "Very trendy, upscale, and modern pizza place in the Burgh.  They have wine and beer here, and the Yuengling cans are only a dollar.  I had a taste of the grilled romaine app, which was excellent.  I ordered the prosciutto pizza, which had arugula, parmesan cheese, and prosciutto.  It was great!  However, there definitely has to be some more arugula on that pizza.  I've had it where it was piled 4 inches high, and it tasted amazing.  For people who may have been enticed by ordering the pizza because of the arugula, they surely would have been disappointed.    I also asked for some ricotta on the pizza, because I was craving it, and I was told by the waitress that they can't change the pizzas.  Now I must say, that is a bit ridiculous.  However, I can understand in some strange way that the chef/owner would not want to spoil his pizza by a bad topping choice by a stupid customer.  Therefore, I asked for it on the side.  The waitress accidentally brought goat cheese instead, but I love goat cheese too, so I applied it at my leisure and it was fantastic!  Additionally, the dry cured chorizo pizza, was a bit of a loser.  I believe there's a picture of the pizza below.  It comes with miniscule slices of chorizo, that hardly have any flavor, and some what looks like potato chips, and some type of green again without much flavor.  I guess the presentation of the pizza may look nice with such sparse toppings, but when it's called a chorizo pizza, you expect to taste chorizo!    Furthermore, I have to say that if you order a coke, it will be from the bottle, and they pour it in a glass, but..... you use a metal straw.  Loved this feature!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tOMztypmq06beq-zncxjiw"
  },
  "Vb8Xuo41lPsH1vEPvlrLcg": {
    "date": "6/18/2011",
    "text": "I've been to Dinette three times now and enjoyed every one of them and intend to go back.  Personally, I am a little tired of gourmet pizza, as it usually ends up being a mash of ill chosen high end toppings on an average pizza.    Not so at Dinette.  Their pizza selection shows that someone with a palette worked them out carefully.  They are delicious and understand that simplicity is the sign of True skill.  Their appetizers are good and offer healthier items like a fresh farro wheat salad to the more indulgent frito mixto.  Dinette is small and they do get quite busy on the weekends, but there's not much that can be done to fix that.  They have a cute little bar where you can have a beer or a glass of wine while you wait for a table.  I would happily give them a fifth star if they expanded their wine list a bit and gave their servers a lot more training on it.  So far, not one has really known one wine from another, and one repeatedly suggested the same wine to everyone at the table, because it was her favorite.  Ouch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ra_Q8gm0ckIKGeyEiyoMfg"
  },
  "hKnyU5s4pzCI1EJyW2px_g": {
    "date": "3/11/2012",
    "text": "Tasty pizzas and $1 Yuenglings. Excellent service from friendly staff. Cool vibes and well decorated. Worth a visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qhu-afDpwUbxPuVmwL27dw"
  },
  "XU9LvJIt5V12vXYyR6Q9KQ": {
    "date": "8/10/2012",
    "text": "Dinette looked so cute but was a big let down. We ordered an appetizer, fritto misto, which was really good. The zucchini flowers were crispy and delicious, the batter wasn't too heavy, and the portion was surprisingly big for an appetizer. And yeungling cans were $1. So far so good! BUT none of this can make up for how bland our pizza was. We got the grilled corn pizza to split (which was a perfect size for two people considering we split that large appetizer) which had grilled corn and brie in addition to a few other toppings. The toppings were scant and placed mostly in the center of the pizza, leaving about 60% of the pizza as just break with cheese...not too exciting. I can see why people like the crust (it was thin and crispy) but if there's nothing to spice it up it's still just flat bread. Considering the price of the pizza they need to increase the amount of toppings and make sure the entire area of the pizza has flavor. Adorable atmosphere but I'll go somewhere else.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "hvqdeCkGtQK4Ba7OP_WNvA"
  },
  "T_PY7fq2OndEEPhrd8K31w": {
    "date": "12/14/2013",
    "text": "The prosciutto pizza is awesome! I've had several other of their pizzas (ricotta, mushroom cauliflower pesto, chorizo), all are tasty but can't compare to the prosciutto pizza. You can't beat the $1 yuengling cans!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aR9488UbXBuGdbIP7NJ2IQ"
  },
  "mswJaX4-UBVh0hRglirBhQ": {
    "date": "1/18/2010",
    "text": "Contrary to previous reviews, I wasn't too impressed by the interior at Dinette.  I found it to be far too bright for that type of restaurant.  My legs were too long to cross them due to the short tables and chairs.   My friend and I arrived on the later side on a weeknight, and the place was relatively deserted.  We split the farro salad which was a little greasy and uninspired.   I ordered the savoy cabbage pizza with leeks, feta, and mozzarella.  The crust was delicious and reminded me a lot of Arizzimendi in Oakland, CA.    I think I'll pass the next time this restaurant comes up in conversation.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "uCvbrFJNgDuTSvzdoOmjww"
  },
  "2ZOiYtQ0YiE4t_uyCnYgdw": {
    "date": "3/28/2013",
    "text": "This is a cute little wine and pizza bar with a modern design and friendly staff.  The wine list was really nice for the glass or by the bottle and there were a few decent beers as well.  When we weren't sure what bottle of wine to get, the server was nice enough to let us try a couple of samples so we could decide.  As for food, I had the \"Sunny Side up Eggs\" pizza and was disappointed they wouldn't let me add prosciutto to it, as I thought it would have made a great addition.  Apparently you can only remove, not add things, even for an extra fee.  Given the name with \"Eggs\" in plural I expected there to be several eggs but there were only 2, both on the same side of the pizza and right next to each other so that 75% of the pizza had absolutely no egg on it :(  However, I chopped up the egg and spread it around myself and after that it was still quite delicious.  All the ingredients were fresh and it was made to order.  I just wish they'd be a little more flexible with the toppings and add another egg or two (or at least make it even!).  Most of the menu consists of pizza so if you don't like pizza you might have a hard time finding something.  I saw a guy behind the bar with a big mustache who reminded me of Mario from Mario and Luigi and he was constantly making fresh pizza dough.  The advantage of this place seems to be how fresh and well prepared everything is.  It was a little pricey, but the quality was worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3bo1FXvQnxw2hmO0CHH4Nw"
  },
  "56bzmR2KYFgqDKmAeREQug": {
    "date": "9/9/2012",
    "text": "Dinette is a unique restaurant in Pittsburgh. Specializing in interesting, original pizzas which are sized perfectly for two, or one person with a big appetite. The crust is phenomenal, thin, flavorful and crispy. Personal favorite is the one that has anchovies and serrano peppers on it. They also have some interesting salads and appetizers. It is a small menu, but has something most people would like. Criticisms; not enough good beers. Beer and pizza is like peanut butter and jelly. Either one is okay but together they're great. Their wine selection is pretty good. Atmosphere is kind of quirky, not really the kind of space you'd want to linger in. That could be by design...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fIySfdebw0FcEhRooxa0cw"
  },
  "o0kgfmTIcD80-riY8N_j4Q": {
    "date": "4/29/2010",
    "text": "Excellent gourmet pizza. The menu changes nightly/weekly based on availability of local fresh ingredients. I also had a cauliflower soup that was pureed and drizzled with spiced olive oil. Amazing. I highly recommend this place!  As far an setting, it is loud so it's perfect for a group of friends to drink wine together or even a date because the loudness makes your table seem private.... Dress is dressy, although I went totally casual. Do what you want.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HlhXvI-USOhL58Iv-WESOQ"
  },
  "e_cdX6rFILohAeoxkZreeQ": {
    "date": "8/3/2014",
    "text": "It's fine. I mean, honestly...it's fine. I like the dollar Yuenglings, the arborio rice pudding, and the appetizers (especially the yummy oysters) across the board in general. But...I just can't get excited about any of the food here. Maybe it's because I'm in the camp of slightly more substantial crusts, but the pizza just isn't my thing. The crust is cracker-like and well-charred, with a thin tomato sauce on many of the pies. I know the herbs and veggies come from their roof garden, but I always find everything pretty flat-tasting. Every time I go, I always think that *this* is the time where I'm going to taste something new and original and fun. And I always come away with the same ultra-thin pie with an uninteresting tomato sauce, uninteresting cheese, and blah toppings. I can't tell if it's a problem with me or with the pizza, because so many people clearly love and appreciate this place (including my father, who would move in if he could, and the James Beard Foundation), and I *do* have a healthy appreciation for the other stuff on their menu (seriously, get the oysters), but I'd rather join the East Liberty locals picking up slices and garlic knots across the street at Pizza Sola.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SUJpWth0v5OPFjPkt0H2jA"
  },
  "h3HdB1_8-yBI128t-wwa5w": {
    "date": "8/6/2015",
    "text": "By far my favorite pizza place in Pittsburgh. We visit at least a couple times a month.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clBPG9c0lqgCxIMnD9RL2g"
  },
  "_5CtLJkfJTi4i3u5Gnndzg": {
    "date": "7/22/2012",
    "text": "This was a recommendation from a local and was a super find !! Located close to the university and a number of other great local haunts ...this will be a definite place to come back to.  The best part is that most of the veggies come from the roof top garden maintained by the restaurant.  One of the best thin crust pizzas I've had in a while.  Service was awesome as was the beer !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8b8W5GeycPH9pdROYtPKDw"
  },
  "R0F1BEGXT8NCZhnt13zhJA": {
    "date": "7/31/2014",
    "text": "This place had us wait outside for an hour for a table and while we waited outside we opened one beer that we had and they charged us a corking fee of 20$ without letting us know of the fee ahead of time.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C7GS7kmnWnA0DEyUehrzPA"
  },
  "B_5GniqYgQBz4f0M42Wdgg": {
    "date": "10/12/2009",
    "text": "Dinette is a bright cheerful restaurant in East Liberty serving up delicious food right next to Borders.  Their main focus is on using local and sustainable ingredients.  I ordered their Prosciutto pizza which came topped with arugula, mozzarella, and beautiful strips of Parmigiano Reggiano.  My buddy ordered their Salt-cured Anchovies pizza which came with chilies, capers, tomatoes and mozzarella.  After we ordered, we saw another table get their appetizer which looked absolutely delicious, so I asked our waitress what it was called (it was the Fritto Misto) and if we could add an order of it.  The Fritto Misto was basically battered onion rings, broccoli and portobello mushrooms topped with small chilies.  The batter was super light and well seasoned and everything was cooked to perfection.  The portion is just right for two people to share without it being overwhelming.  The pizza is of the thin crust variety and they are BIG.  Well, bigger than I expected.  I was sufficiently full 2/3's of the way through, but I did finish my pizza and get a dessert too (gluttonous what?).  So first of all I absolutely LOVE thin crust pizza.  Also, I like how the pizza isn't greasy.  It gives a clean feeling and lets the ingredients be the main focus of each pizza.  I tried a slice of the salt-cured anchovie pizza and I liked it more than my Prosciutto pizza.  It's not that my pizza was bad, I think in the end I just prefer my Prosciutto cold.  They have a good number of pizza choices so I'm sure I'll find one that suits me the best.  I ended the night with the \"Chocolate Pot de Creme\", which was super dense and rich.  Would I recommend it?  Yes.  It's slightly pricier than I expected (30-ish per person), but then again I did add an appetizer to split and a a dessert at the end, which makes it perfectly reasonable.  It's more spendy than what I would want for a weekly trip so I won't be there too often, but I really like their fresh ingredients and the clean simple tastes have me feeling guilt free afterwards.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "sWo7bAIUY_XBe33LKmNK9w"
  },
  "b5UCzisn5ItyafxBkccq1A": {
    "date": "3/12/2010",
    "text": "Dinette is perhaps my favorite restaurant.  Having eaten here at least a dozen times, I can honestly say the food and service are consistently excellent.  Located in East Liberty in the 'deck' above Whole Foods, this tiny and trendy place is exactly what Pittsburgh needs more of--a chef/owner who has made a commitment to using local, in-season ingredients and sustainable practices.  The individual oven baked pizzas are the menu's staples, but a rotating mix of salads, mussels, the fritto misto and other small plates keep it interesting.  I usually get the anchovy pizza (to die for if you like that sort of thing) but was recently impressed by the shaved ham pizza with fingerling potatoes.  This place is refreshingly different, offering terrific tasting food and a restaurant concept that is worthy of our support.  To the reviewer who gave it two stars and complained about the lack of offerings for kids--please use your head.  This is a restaurant and wine bar, much more suited to an adult clientele.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tUFpWGbeMhC75zzkzGMrqQ"
  }
}