{
  "pOO5XMbfEthHtY19Ko8YJg": {
    "date": "12/27/2016",
    "text": "The food is great! Gluten free pizza came fresh and tasted fantastic. Awesome atmosphere and friendly staff. I'll be back if I ever return to Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0gpz3DQpS2DII0x6GRFC_A"
  },
  "Z38HvXq-b7lbtbhTGqCzqQ": {
    "date": "7/28/2016",
    "text": "I really enjoy their pizza. The best I can order delivery from in the strip district area. The crust is really yummy and their veggies are fresh. I have never had an issue with their delivery people either.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-lH7y5tOBoAWvF4vjDznqg"
  },
  "POc-2d3FTYLDpXSs0VeSeQ": {
    "date": "5/9/2017",
    "text": "Went at lunch but it wasn't overly busy. Good was done quickly and good. We had pizza and sandwiches which were the specials at lunch. All was good and will definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QlLAtmpXVKgGFHArXu9hjQ"
  },
  "KUuFRuQnjWi7MfYSaerLSQ": {
    "date": "7/7/2016",
    "text": "Tried this place today, was amazing. We had the chicken gyros with cucumbers, slice of pepperoni pizza and hot chicken sandwich. The restaurant is clean, friendly and attentive staff. Open space lay out, with plenty of tables. Everything was delicious. The gyros yogurt sauce was  very light but filling. The pizza was good but not greasy. Hot chicken sandwich was good and a decent size for the price. Everything tastes very fresh. Bathrooms and very clean and the vessel sinks gives it a classy touch. Definitely will come back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QYdQEvpU2rXHZPJJ9BAZig"
  },
  "s9FELeLPzWKdJ37kvBWmMg": {
    "date": "6/29/2017",
    "text": "I had this delivered. Gyro, side salad and chocolate chip cookie. Everything was delicious! The salad didn't have iceberg lettuce, it had spring mix, which was amazing. The salad also had lots of veggies on it. I had the lamb gyro which was very good! Everything was fresh. Will definitely be ordering from here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bvLh_CWY758WhdJVa_f2BA"
  },
  "vJMKTZ1zSjO2QzoaXOVANg": {
    "date": "4/8/2017",
    "text": "I'm in town for a convention and have eaten here once for breakfast and once for dinner.  The food is very good, well priced, and plentiful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EZyqQsig4CAje5PkjaBHQQ"
  },
  "7tB4rD6zR2Q9xvMHGJvUbg": {
    "date": "5/29/2017",
    "text": "Great concept, poor execution. Breakfast sandwich with egg \"over medium\" the egg white was not completely.  I expect to have a runny yolk, but the whites should  be firm. The meat in the meat lovers omelette was completely dried out. Waited 15-20 minutes for a cup of regular coffee. I thought the \"Joe\" was a play on coffee, apparently not.  McDonald's would have been a better choice.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-G95sQafKOVobq5G9I4cWw"
  },
  "nKCgrixRD0JjovXbXIzuiw": {
    "date": "2/15/2016",
    "text": "Just had pizza and the Italian crepe here at Joe and pie.  It was absolutely delicious!!  The pizza crust was so light and crisp.  Perfect ratio between crust and topping.  Can't wait to go again.  By the way, great coffee too.  Love this place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zsVWNOYrXVJJKwpARljfCA"
  },
  "LQDLhMi11dV4ScelZxQdlQ": {
    "date": "6/3/2016",
    "text": "Very good basic pizza...nicely browned toppings.  The Lamb Shawarma was fantastic, served in a whole wheat wrap, lots of fillings...just delicious.  We will definitely order from here again...  Oh, and they deliver breakfast, too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T1KwjlS-L9Muj4Ur8g6eBQ"
  },
  "sxO2Q46_fkxKD3rSW33F2w": {
    "date": "2/24/2016",
    "text": "Yesterday I had the shrimp crepe. Today I am off from work due to the inability to keep even liquids down. The crepe was a soggy mess of oil and cheese. Though the array of ingredients sound delicious, it seems one of those components lead to me being ill. I hope the restaurant is keeping up to the highest food safety standards, as I was very excited that a new independent restaurant was opening downtown. But my advice is to leave crepes to the French eateries.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NC7AdkcnKKBasH7nzxU7uw"
  },
  "NUfmnyZiWAtpRT3bXplBHg": {
    "date": "4/21/2016",
    "text": "My pizza was great!  Finally so happy to have good and decently priced food downtown!  Thank you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7GGWgHG_Dk45erk4U6yYCw"
  },
  "Kge0Wigm5J7V3w2QsltjCg": {
    "date": "5/19/2016",
    "text": "Though the food is just okay, they make you wait 20 minutes or longer for it to be prepared. Today I called thinking I'll call ahead so my food would be ready when I got there, nope... Whoever was in there told me to call back in 10 min. I told the man I could just walk down there in that time frame, which I did. Turns out they were closed and seemed an hour late opening . As a customer this place lacks business sense.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "THAM352c_NK2ClLtkMLMLA"
  },
  "GYfBvIZWXTArgT7Nksy6dA": {
    "date": "12/27/2016",
    "text": "Walked in and were the only customers in the dining room. After waiting 30 minutes for 3 slices of pizza, we went to the counter and asked what was going on.  They forgot our order and quickly gave us our slices. We opened the box to find one slice on top of another, and it was cold.  Manager refunded my money after complaining but very disappointing nonetheless.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JdG8pVxMAG1OpSK4o8lz-w"
  },
  "G-GOG1lopZ5Z7x4Glc8SjQ": {
    "date": "5/3/2017",
    "text": "I've been here several times and don't have any serious compliants. The fountain drink machine seems to malfunction pretty often, but the lunch specials are good deals. The pizza is even better if you get a fresh whole one.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_3rZlm5U_swLPHLuyzw3zg"
  },
  "Y8k4PB5DprbY9T4kZXAVxg": {
    "date": "3/3/2016",
    "text": "Ordered here for the first time tonight. Got here in 30 mins. Ordered 2 gyros, which were good. The breadsticks are AMAZING and so was the side of marinara which makes me wanna try out their pizza next. Their fries are crispy and have that flakey crispness, it's the kinda fries that taste bomb cold they were excellent lol.. sooooooo good. Please give them a try! Delivery guy was super friendly too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ualeyg0oT_Nh7m_rEs2t4g",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Their breadsticks are BOMB ;)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ualeyg0oT_Nh7m_rEs2t4g/o.jpg"
      },
      {
        "img_id": "Xxz2rVZspcV9ncf0SDwOQw",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Gyro",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Xxz2rVZspcV9ncf0SDwOQw/o.jpg"
      }
    ],
    "user_id": "1WM9rK8lkct03GWKmrHFww"
  },
  "MCl6Yb3akBFfIJZ3e3X0_Q": {
    "date": "10/6/2016",
    "text": "They got the order wrong. Then they very obviously took my food apart to take off what I ordered it without. Then they lied to me and said they made a fresh one. Also- the pepsi machine was totally tasteless. $12 wasted.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DS3GV5iLR16aosGe6E0RPw"
  },
  "UHkBCWQmIH2Kq6MgC_LdKQ": {
    "date": "8/9/2016",
    "text": "If you go for lunch, just get slices of pizza. Anything else took forever. The gyro was ok, but the pita was crunchy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bBpm4zr1VXjZXa3UHNRn6w"
  },
  "7UDG0DrfeFWszdYjdkGSfA": {
    "date": "5/31/2016",
    "text": "They are open late. Pizza I had there was decent...hot and crispy. Fairly sparse menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4-3nNWDx6VtwGUVDwzR86w"
  },
  "MmPqXxLLfGnG5y4n20K9OQ": {
    "date": "6/4/2016",
    "text": "Got here at 910 am for breakfast.  Wife had hair appt at 10 around the corner, so figured had plenty of time, since place not crowded.  Wrong.  Food, which was fine, got to us at ten til 10, about 35 minutes after we placed order.  It was eggs and toast people.  I wouldn't go back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "937XbZ2Hxf8PzP62OIqcuw"
  },
  "DXSRE3_8Zr_NgsjdU456SA": {
    "date": "5/14/2016",
    "text": "Super fast delivery and yummy food! The pizza is solid and the breadsticks was a huge portion for a good price. Would def eat here again next time I am in Pittsburgh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WK1qXo8kW3OoPjfcBuwffA"
  },
  "reGmNXVe_0Noz1MX6o24cw": {
    "date": "3/31/2018",
    "text": "Do not order online. It took us over 2 hours (and 3 messages / phone calls) to get our order, and when it finally came we didn't even get exactly what we ordered.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-GAxQeKi4Qwey-62p12f8A"
  },
  "_cDROhOAbZVl5qgyw877jw": {
    "date": "1/9/2018",
    "text": "I've been here three times now and the service and food have both been meh. First time I ordered a slice of pepperoni pizza.  It took a few minutes to come out from the kitchen and it clearly looked like they had reheated a slice that had been sitting for a while. I decide to give it another try but the next time I went in and ordered a slice of pepperoni pizza I was told they didn't have any pepperoni. I got the plain cheese and again it was a barely reheated slice that had been sitting for a long time.  On my third visit I skip the pizza and order a Greek Salad, no onions, to go.  I get home and the thing practically had half an onion worth of slices on it. What it didn't have was any dressing.  I paid $10.99 for a salad covered in nasty onions and with no dressing.  Lesson learned.  I won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vlUXqMgw3PWev9I3Vhh4nA"
  },
  "XOLB5J1evLGtMbHSgNkQeQ": {
    "date": "9/8/2017",
    "text": "Delivery was fast but this pizza was not very good at all. The buffalo chicken pi was passable and had an interesting with the potato medallion on top. The white pizza was gross, totally slathered in grease and moisture making the whole pizza a soggy sloppy mess... same with the meatball Stromboli. Definitely won't order again...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TI7EgTsD2_3mSkL0dK-grg"
  },
  "twvgpOsXyr4Y7mfsyxraoQ": {
    "date": "5/26/2016",
    "text": "Ordered meatball hoagie n fries for delivery . The meatballs were really good but didn't care for marinara sauce on there would have preferred pizza sauce. Also ordered fries. Definitely ordering again form here, wanting to try more items. Satisfied w my lunch overall.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zMOFE9_D-bOsGcIEpfXsqA",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zMOFE9_D-bOsGcIEpfXsqA/o.jpg"
      }
    ],
    "user_id": "M7W1KYYzQXB_sCudLkqwUw"
  },
  "LewTALV70KjfWjsorD5-Cg": {
    "date": "4/16/2017",
    "text": "First time ordering.  It was really good.  We got a gyro and the Joe and Pie pizza special.  Both were delicious and delivery was right when they said it would be.  I never had a pizza with lamb on it and I loved it.  We'll definitely order from here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xtpe7A9fFOtslwC9Hp32Rw"
  },
  "N3IXocgdIO84FaMVcf0Plw": {
    "date": "8/29/2017",
    "text": "Great straightforward pizza place in downtown Pittsburgh. Went with my family, we ordered a large vegetable pizza pie and hot wings. When they say vegetable pizza at this place, they don't mess around. LOVE that the pizza had broccoli on it, and that it was cut into 16 slices instead of your ordinary 8. The restaurant itself was large on the inside, spacious with plenty of seating and very clean, and the guy at the counter was helpful in explaining the menu and topping options, both of which have a large variety and are very affordable. I certainly wouldn't mind coming back here next time I'm in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iWJj7Eow2UdEmatQY_4SOw"
  },
  "h3hUzOlz2A2wUI0-UwwKzg": {
    "date": "3/10/2016",
    "text": "If you are staying in town and do not want to eat hotel breakfasts, this place has a very reasonably priced menu and good selection including breakfast sandwiches and baklava as well as other interesting deserts.     I did not get to try their pizzas.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XGLu0VfJVrcMVJmSc3dfIQ"
  },
  "ZwZTNLVfVdhP5x968_hbnA": {
    "date": "1/4/2017",
    "text": "Didn't smell like a food place when I walked in.  Like, i didn't smell ANY food.  I asked about the steak sandwhich and he couldn't even tell me anything of note about except that it was better than fast food.  We ordered anyway because it was late and didn't know what else was open.  I had to add salt and pepper to my sandwhich.  Eventually just threw it away when I was unsuccessful at adding any flavor whatso ever to the sandwhich.  I forgot what my wife oredered but she didn't finish it either.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OJPFRCHiZ9YrdlFx0p5X6A"
  },
  "XEeHKcdCFo5MiJcskNw9qg": {
    "date": "3/3/2018",
    "text": "Food was on time and delicious! Only thing missing was napkins and utensilsMust try chicken rolls and provolone sticks!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_zutBbcy6HlHwkGxBC0QYQ"
  },
  "xl3WEPtI3qAcnRi2uB8SbA": {
    "date": "4/4/2016",
    "text": "I arrived not not very hungry and ended up eating more than I wanted, it was so good! Crust was crispy and cheese was great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Du-2JxMljWfZWUYDCN5Tmw",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. #joe&amp;amp;pie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Du-2JxMljWfZWUYDCN5Tmw/o.jpg"
      }
    ],
    "user_id": "1r8zHCcB-zVy1XgZ2FKq1Q"
  },
  "KnqWJtRYpEarIEsbzpcN8g": {
    "date": "1/22/2017",
    "text": "The menu says bacon and ham several times on it. However, the menu also says, in small print, that there is no pork on the menu. While I think its cool they don't serve swine (likely for religious reasons), I don't appreciate being told porkless bacon is bacon. Bacon can ONLY come from a pig. No such thing as turkey bacon or beef bacon. Bacon is bacon, bruh.  Food is just not up to snuff. Plus their menu practices are deceptive. Will not be ordering again.  Also, they have a $20 omelet on the menu. $20 omelet? That thing better come with a 12-pack of beer or something.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NHwqfU8b_8cf1H05FDt9Eg"
  },
  "ND17JjsQCPXZw-_eJDKQuw": {
    "date": "12/5/2017",
    "text": "Pizza arrives 45 minutes later than expected (1.5 hour wait) and it was luke warm.  Don't bother, too many other good pizza joints around...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EqORocgr65IxyLSakf_S6Q"
  },
  "wlGTjp9xPd9-3W1_Dl1vjA": {
    "date": "10/6/2016",
    "text": "If your constipated, this is the place where you want to go. Seriously, the worse breakfast I have had in a very long time. Sunny side eggs with no yoke, potatoes and sausage tasted like they were left on the grill for hours then served.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P2JJfXHAZGSyTslGbWz6ug"
  },
  "RXqPrdu3D2ivDTcx_LxyWw": {
    "date": "6/29/2016",
    "text": "Joe and pie special for a pizza is a winner, winner pizza dinner! Add a steak salad and you are set for a meal for two that cannot be finished.  Delivery was before promised time and food was well worth any wait we would have had. Awesome.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MMSwMPHIT2aauTShYDDcvA"
  },
  "Jvzcd2G7F6qggDDqYq6AMg": {
    "date": "1/28/2017",
    "text": "I visited Pittsburgh for a few days and ordered from this place. The first night I ordered spaghetti and meatballs. Overall, it was really good. The sauce could use a little work though. It came with a side salad and garlic bread. The second night I ordered the chicken parm which also came with salad and bread. Overall very good food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TaCdfAv_F8zVueB67dI7vw"
  },
  "HMUOclv85I6RqLeKo9a4Bg": {
    "date": "12/29/2016",
    "text": "This place is the worst. I had to go to the counter and ask for my meal 3 times because they forgot about it. It came out 30 minutes after everyone else's food, and everyone was basically done with there food when I got mine. The worker also made an inappropriate comment when he finally brought my food to the table. Won't go back again. Also the wings are terrible!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TqmLddVJW7A5NKEeSzRIDw"
  },
  "h3BxdGLi6fCy9BdirrFGVA": {
    "date": "9/23/2017",
    "text": "My wife tried to order food from your new place in Robinson. She asked if you guys would deliver to Oakdale. He asked for the address and said we deliver to a five mile  radius. He said You are 5.6 and hung up on us. Never gave us a chance to place an order for pick up. What a great way to run a business. Your menu went in the garbage and I made sure to tell are neighbors. They all wanted to try a new place but it won't be you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_pwhd-FU0HNpVDGIVia2Gw"
  },
  "NHHmc6Ipv_ZUem_7O8nYkw": {
    "date": "12/1/2016",
    "text": "My husband and I just ordered from the Edgewood location and it was absolutely horrible. The pizza was cold and the wings were not cooked all the way( as in they were pink in the middle with blood). We called the store to let them know and the manager told us they put their wings down in the fryer for 10 minutes and then they pull them out and if we would have told them earlier that we wanted them well done they could of left them in there for another 5 minutes. My husband politely said that we never had ordered from there before and asked how we were supposed to know that. The manager responded by saying \"that's how we do\". We will never be giving them business again. Undercooked food and horrible customer service!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nVqqfAq1FZIdJf8Pl5sv7A"
  },
  "V7KPKmBYG3G1VuhZqz2u3A": {
    "date": "10/25/2017",
    "text": "Shittiest place ever. Bad people. Dont know english very well. Once I ordered a chicken gyro and it took them to 30/40 mins to make it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fYGXnWBh-RVYTKa9177Afg"
  },
  "_qGw8W9jJz6RzAiqTWtxtg": {
    "date": "11/28/2016",
    "text": "This location is so friendly! My boyfriend and I stopped in here for breakfast and it did not disappoint! I had the western omelette filled crepes and he had the two eggs breakfast - both meals were enormous, filling, and served by friendly guys behind the counter. Such a wonderful experience. We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5yxzfBJatHfoM8No8Zvjmg"
  },
  "76HNW6IKWS5dh_JKm3paow": {
    "date": "3/3/2016",
    "text": "Love this place. Tried it 3 times and loved it each time. They serve breakfast til 3pm and they offer so many items from Greek Salads, omelets and shrimp fettuccine alfredo. The place is clean, the people are friendly and its spacious. Looking forward to trying more menu items real soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bb05ZwLB_x3q-dYl0M-WGQ",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Shrimp fettuccine alfredo with side salad  (also comes with delicious garlic toast)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bb05ZwLB_x3q-dYl0M-WGQ/o.jpg"
      },
      {
        "img_id": "znOP4V1AvZ2Y58Ss02Ntmg",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Greek Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/znOP4V1AvZ2Y58Ss02Ntmg/o.jpg"
      }
    ],
    "user_id": "pr8_C12oHakeNB4ZPp_dig"
  },
  "gVmXBLhyCtjJgy3bRpXN3w": {
    "date": "11/6/2016",
    "text": "I'd been wanting to try the food for awhile now. I'd walk by daily to and from work and never had a chance to stop. Seeing them on Grubhub made me want to try them out as well. However, I wanted my first time to be you know, special. I needed the in person experience. We stopped by after attending Wizard World. It's a very clean and spacious restaurant with immaculate bathrooms. They have quite an extensive menu that includes breakfast. Daily lunch specials as well. Food is priced just right. I had a cheeseburger and fries that really filled me up. It tasted really good and what you would expect from this type of establishment. My boyfriend had the gyro and fries. He liked it and said the cucumber sauce was tasty and up there with most gyro places. If he had a complaint at all it would be to have a little more meat. We're definitely going to patron them via Grubhub. If you're downtown and want a decent meal that's inexpensive Joe & Pie is the way to go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "pbSiuqKrbEc1XFUGewQp-A",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Exterior.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pbSiuqKrbEc1XFUGewQp-A/o.jpg"
      },
      {
        "img_id": "tkXLvfEpM14XXztP9ae-OQ",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Cheeseburger and fries.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tkXLvfEpM14XXztP9ae-OQ/o.jpg"
      },
      {
        "img_id": "2lfSIm_VrhHHiFUrd-AuvQ",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Interior.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2lfSIm_VrhHHiFUrd-AuvQ/o.jpg"
      }
    ],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "Z6_7hf2ZxbBzfNb_JV4mQA": {
    "date": "12/10/2016",
    "text": "Food was absolutely terrible. Ordered a supreme  (one of their specialties) and it arrived soggy and lukewarm. Literally a pool of water had formed in the middle of the box and soaked it through. Called to ask about a replacement and was told that the pizza is meant to be that way because of all the toppings and avoided doing so. Thankfully I used eatstreet and they refunded my money without a hitch.    Drove downtown to return the pizza and the cashier said the pizza had been made fresh and sent out immediately. No excuse for crap Pizza and even crappier customer service.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wOP_ITiCNTlMIgGDJAirQA",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wOP_ITiCNTlMIgGDJAirQA/o.jpg"
      }
    ],
    "user_id": "87SOM-VPfNoJsEWd7USkyA"
  },
  "N_2OXy5HizTIY2ncugOxBA": {
    "date": "12/6/2017",
    "text": "Decent pizza. Great price. Clean shop front. Fast service especially at peak lunch hours downtown.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DStayl2b3kag3k-HUoOw6A"
  },
  "VcXrlEcM9gHpHdhGOEQXDg": {
    "date": "10/6/2016",
    "text": "Website - 3 stars - Not all items in their paper menu were listed on the website, so we ended up phoning in our order. Delivery - 5 stars - The delivery person arrived in a short amount of time, and he came up to our apartment rather than make us meet him in the lobby. Strawberry spinach salad - 5 stars - Good amount of spinach, strawberries, walnuts, feta cheese, and dressing. Greek salad - 2 stars - Good taste but too little lettuce and too much feta cheese and olives. Turkey oven-baked sandwich - 4 stars - Good taste and amount of turkey, cheddar, lettuce, tomatoes, onions, and dressing. Chicken Parmesan - 1 star - Lots of spaghetti and only a few tiny pieces of chicken.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FW5F5QzzMoeRdIib1OyNOw"
  },
  "qsNkJrMe9LBaVXnxNc3Mhw": {
    "date": "7/21/2016",
    "text": "this was an ok place.  Went twice.  First time was legit.  Kai was a great person to talk to about the business and the food.  Was impressed by his willingness to try and get me the best food and not just more food.  Really cared about what I wanted to eat.  Place is open late, which is great for late night project work.  Second time was lacking.  Kai was not in the store on that day and the food was a bit dry, almost as if it was sitting around for a while.  Overall, it's a safe place to check out food at late night.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "l3ZOlvTD2Rcq1fARLq65Iw"
  },
  "5xFljVAzIfuDw7swnE9j8w": {
    "date": "7/3/2017",
    "text": "It sucks that I'm writing this review because after looking at some of the pictures and other reviews, their pizza and some of their other items look great, and sound great according to said reviews. Unfortunately, I'll never order from here again because of this experience so I won't get to try their other food. I ordered their chicken shawarma sandwich, which I have to mention wasn't even anywhere near what shawarma is supposed to be. I've had chicken shawarma at several places and I've got a good idea of what it is supposed to be, and this is not it. I am 99 percent sure it was not cooked on a vertical spit, as shawarma traditionally is. The chicken was more likely cooked on a pan or something. The garlic sauce (which is something that often accompanies chicken shawarma) was not any real kind of sauce, rather it was some kind of oily mixture that barely had a taste, only making the \"pita sandwich\" one of the soggiest things I've ever eaten. On that note, the \"pita\" that it came in wasn't even pita, but instead it seemed like some kind of cop-out tortilla that fell apart and barely held the contents within. It wasn't pita bread by any means whatsoever. They also put a ridiculous amount of lettuce inside of the sandwich to make it look more filled up, which added to the displeasure of the sandwich. Also, the fries on the side that I had ordered were incredibly soggy and I can absolutely say they were some of the worst I've had. High School cafeteria fries were better than this.  This isn't even half of it, though. The second fault lies in the actual ordering/delivery itself. Upon the first delivery, I received a lamb shawarma, not chicken. I ordered online through GrubHub and I don't see how there could have been any confusion as to what I had ordered online, not even through calling. Ordering over the phone could've easily caused miscommunication of some sort. I also ordered a drink over the phone with my card when I called to inform them that I hadn't received the correct thing, and upon redelivery of the chicken \"shawarma\", I didn't receive my drink. So not one redelivery, but two instead. How many times does it take to get an order right? The world may never know. I did eventually receive my drink though, long after I got my sandwich.   But anyways, as I said, it is unlikely I'm ever going to order from them again. The shawarma was not good and shouldn't even be called shawarma. The garlic sauce wasn't real sauce, and the pita was pretty bad too. I honestly don't have anything good to say about their food. The only reassuring thing is that the delivery man seemed very nice, and the man I spoke with on the phone didn't give me any issues.   It's really too bad, because they could be a great pizza place that serves some Mediterranean items. Unfortunately, the chicken shawarma is some kind of cop-out short cut so they don't have to cook the chicken on a spit. As I said, the fries were also terrible, which makes me concerned that their other food might fall short. A lot of these reviews (and pictures of their food) describe what appears to be a delight, but alas, I'll never know the truth.  I sincerely believe that they need to take this off of their menu. Or at the very least, make it how it's supposed to be made.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cZWJRxWnPmszbg5yMjKEKw",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cZWJRxWnPmszbg5yMjKEKw/o.jpg"
      }
    ],
    "user_id": "sRq34bGFt4vzIO1BzT9vdQ"
  },
  "Y6HmBJwXXfT-lVuyJmVW7w": {
    "date": "7/23/2017",
    "text": "Best gluten free pizza. Hot damn, this pizza was heavenly. Get the tomatoes on it if you love yourself.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ph4xKNnuYJVy2uIgnaUxsA"
  },
  "6trobQviKBMX7tsKdMmEBg": {
    "date": "7/3/2016",
    "text": "I was staying for the weekend at a nearby hotel and this new restaurant looked like it was worth a try. I went to Joe & Pie for both breakfast and lunch to try a variety of food. For breakfast, I had a combo with sausage, eggs, and French Toast. There was quite a lot of French Toast in this platter. The sausage seemed a bit too dry but aside from that, everything else was fine. For lunch, I tried a lamb shawarma. This was actually pretty good. Overall, service was pretty good and prices were reasonable, especially for the portions I got. Definitely a contender in the Liberty Avenue row, although I'd probably suggest trying the two Middle-Eastern items on the menu rather than their more conventional menu items.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VIyHyHo4vwkdTe-eXnvd8A",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Lamb shawarma",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VIyHyHo4vwkdTe-eXnvd8A/o.jpg"
      },
      {
        "img_id": "NRzrTisUlUBa4-x1wCzDTw",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Sausage, eggs and French Toast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NRzrTisUlUBa4-x1wCzDTw/o.jpg"
      }
    ],
    "user_id": "cFaHx-FkCnzdfF8BccukIg"
  },
  "If57I7Ov0vGtYog5lWb1mg": {
    "date": "5/17/2016",
    "text": "I travel a lot and I'm pretty use to plain dull breakfast joints.  I admit I wasn't impressed with the Spartan decor, nor ordering at the counter but once the veggie omelette showed I was a fan.  Probably the best omelette I've ever had. Omelette was fluffy and packed with enough veggies for two omelettes.  Taste was of complex with the veggies cooked to perfection.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "CfKzojcCLBW5yMGJ8otq6A",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CfKzojcCLBW5yMGJ8otq6A/o.jpg"
      }
    ],
    "user_id": "AES-tUWO1MW6eMqSQcx9dg"
  },
  "KXhjNs94cq1FxxFfjfCSDg": {
    "date": "8/23/2016",
    "text": "I primarily go here for their pizza. I usually get a large pizza with pepperoni and chicken on it, it is divine. The sauce is perfect and the crust is soft. They are generous with the cheese and toppings. The meat used at Joe & Pie, is Halal. There are very few good Halal pizza places and this one is on the top. I'll try the Cheeseburger the next time around. I hope it is as good as the pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4DEQ-S3OVLQ2ox0T8azCLw",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Half Chicken and Pepperoni pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4DEQ-S3OVLQ2ox0T8azCLw/o.jpg"
      }
    ],
    "user_id": "bz_ftbCqpnWEkQ6ACXbhFw"
  },
  "wqhbgciWzX5DK6LHVbvvrw": {
    "date": "5/27/2017",
    "text": "One star because the pizza and antipasto salad were made to order. Service was poor. Ordered online & received email confirmation.  When we arrived to pick it up they didn't have the order.  Had to sit and wait for them to make our food which defeats the purpose of ordering online!  Was going to try them for breakfast but not now.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Nk5jVndrGVuRIhMsTo1VA"
  },
  "pOSRMcJicCniSPQgxiOy4w": {
    "date": "2/15/2016",
    "text": "An oasis in the pizza desert known as Downtown. Almost anything is better than the overly bready, cheep cheese blanketed pizza that all downtown delivery options offer, but Joe & Pie is head and shoulders above the competition. The cornmeal dusted crust has flavor, is thin, crispy, and has a nice chew. The other thing that makes Joe & Pie a winner is the ratio of crust to sauce to cheese to toppings. Everything was balanced, consistent, and had their individual flavors. I ordered a medium pizza (14\", 8-cut) with pepperoni and black olives. It was delivered hot to the Northside within 35 minutes, and won me over as soon as I dug in.   Joe & Pie may be new, but they know their way around a pizza. Other pizza joints should take note.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 6
    },
    "photos": [],
    "user_id": "DOajn8AtMjNtCZ87YoIlwA"
  },
  "eXCWAuYDLBvKsHgaCdOXYw": {
    "date": "5/23/2016",
    "text": "I am from NYC and NY food there is nowhere near what Joe & Pie has to offer. I have been here with my wife and we both loved the food. Breakfasts have big portions, very delicious and well cooked. Pizza and sandwiches are just excellent! Its all beef and turkey based halal meat and they make fresh own dough, pizza sauce, ranch sauce, and even burgers are freshly made. Great place for dine in, fast delivery and very justifiable prices! LOVE IT!!! HIGHLY RECOMMEND this place, trustful owners and very nice staff!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jYLUvYKhUW0JcRXz0uUxxQ",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jYLUvYKhUW0JcRXz0uUxxQ/o.jpg"
      },
      {
        "img_id": "oTJxc_5lUWJLhV9Z-zTYwA",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. DELICIOUS!!!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oTJxc_5lUWJLhV9Z-zTYwA/o.jpg"
      }
    ],
    "user_id": "aTCIEEgMG1ccfwauQcqRlw"
  },
  "ajnhGvnO_lZ0YS-U-Zpx6g": {
    "date": "6/21/2016",
    "text": "Joe's is Ok. It was quite cheap, so that factored into my decision...  My white pizza was a little greasy, and the restaurant space smelled like industrial cleaning fluids...",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9ulaHHrixn_yfAtgEj0Bw"
  },
  "Opc4ZKQrYLxIis-1mG78Zw": {
    "date": "9/3/2017",
    "text": "Stopped in this morning with my family for a quick breakfast before we headed home. It's set up so you order at the counter and they bring out your order. The breakfast menu had many choices and we quickly got our orders in and grabbed our drinks. And then we waited, and waited, and waited. It took about 30 minutes for the four of us to get our orders. I don't think they were ready for the number of people that came in for breakfast. Many were baseball fans who were in town for the Pirates games over the holiday weekend. The food, when we did get it, was good. Nothing great. Not sure I'd go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HS7jIBqPYcBDi9KXqJrOxA"
  },
  "7y_FR9zgL6dJchgBNQRjDA": {
    "date": "4/7/2016",
    "text": "Great downtown lunch spot.  Quick, clean and good food.  Had the chicken parm sandwich.  Order at counter and food delivered to your table.  The sandwich was great.  Fresh crusty italian roll, thin chicken parm smothered in a delicious homemade chunky tomato sauce.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FwdBjYrUbtW3xIzsN1J8CQ",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. 6 inch chicken parm",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FwdBjYrUbtW3xIzsN1J8CQ/o.jpg"
      }
    ],
    "user_id": "d8gwCFvNWu7ZKpsqy9r83w"
  },
  "E1NdbD5pvHQxM84BbyQ3Qw": {
    "date": "2/23/2016",
    "text": "I've had a pizza delivery from Joe & Pie to my place in the strip, and this morning stopped in myself to sit down and order from their nice breakfast menu. The pizzas I had a few weeks ago were both great, I think they pride themselves on their white pizza with gyro meat, feta etc. and rightfully so, it was very good, same goes for the standard pepperoni and mushroom we tried also.  The breakfast was great, I had an awesome omelette, very smooth coffee, and this being my first time physically inside of the business, I was very impressed with how nice and welcoming and clean it is- also the customer service here is very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "PsKLE5o92H7vwNyXL1xHPw"
  },
  "rSe-fycvwMjTYsI5Eb9jmQ": {
    "date": "8/13/2017",
    "text": "BEST BREAKFAST DELIVERY... and just really darned good breakfast, too. After order-up screwed up our order, the folks at Joe & Pie personally delivered our order. Fresh eggs were perfectly cooked (over medium- white done and took deliciously runny). French toast and pancakes good and not wet from condensation because they were packed with bakers paper (just remove the bakers paper before you eat or you might eat some extra fiber).  Bacon was great quality. Our first time experiencing Joe & Pie. Won't be our last!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8GoRiC1egDGVxeC7Jt1RRQ"
  },
  "UPgWo9gzCKCKFx34H_G1bg": {
    "date": "3/10/2017",
    "text": "Not sure what to rate this as I never received my food I had ordered for delivery on seamless.   I did call the restaurant twice to inquire about why my order had still not arrived over 90 minutes after the initial delivery window. On my first call, I was assured that my order was out for delivery and it would be at my doorstep in about 10 minutes, making it only an hour or so late. Happy days.   About 20-25 minutes later I called back and was assured that they had never received my order. Wow. Nailed it guys.   Here's the greatest part. After I contacted seamless and had them investigate, it turns out that Joe & Pie had missed my order ticket.  The restaurant was resent the order by seamless and they graciously offered to deliver the food to me with a wait time about 15 minutes longer than originally estimated and over 3 and a quarter hours after my initial order. So you drop the ball and then no hustle to make it right?  Hard no. I cancelled the order on the spot on principal. What an utterly disappointing experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yiPl7TR0LVq6rvWtBa8r3w"
  },
  "ua3BDNMrb-zihAgm5JIxag": {
    "date": "9/29/2018",
    "text": "Terrible just terrible! I had the chicken pasta from here some time back and the chicken tasted uncooked and had a weird stench. I ordered the cheeseburger and nuggets 2 days ago from DoorDash, and the meat felt weird the fries on the side tasted like they were old and re-fried.   I kept it in the refrigerator and heated it later, and it was just awful! Tasted completely spoilt and actually made me sick. I wasted 17 dollars on this meal, was hoping to eat something halal and was very disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vLK2M2WnNyPcWpugh5S5DQ"
  },
  "4BWSDfmtekn0CW3Kp6WckQ": {
    "date": "11/13/2018",
    "text": "Possibly the worse food, service, and atmosphere I've experienced in 30 years. Had to ask for my coffee twice. Came with no condiments. Employees do the absolute bare minimum. Stay clear.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K_tkOOpK7ObMbmTo76rrdw"
  },
  "Q5p02gGCGz1FIQIBpOnsbw": {
    "date": "5/27/2018",
    "text": "Food is ok at best, customer service and delivery is horrible. I ordered food from here, never received the food, then called to ask where my order was, was put on hold, then hung up on , not once, not twice, but 3 times!!! Who does that?! HORRIBLE EXPERIENCE... THEN TO TOP IT OFF, THE WORKER FROM THE RESTAURANT PERSONALLY MESSAGES ME TO CALL ME A \"DICK\"...WOW! Now that's customer service",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "CuHoZu0l31oefhAx9_w_2w"
  },
  "mIMUd-fo6c1pkbAOzhWMnQ": {
    "date": "6/25/2018",
    "text": "First, the delivery guy didn't want to come up stairs using the elevator. I had to insist that he come up to my company's doors to deliver my food. (All other delivery guys deliver to our doors.) Then they tried saying I didn't pay for my food. Which I used this app to pay for my food and it was a pending transaction at my bank. Had to have the delivery guy call his boss and sit there for an extra ten minutes arguing with the guy that I paid through Yelp. Food was okay but the customer experience was awful.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_OPUcj0Av2DcgcC11G1GVQ"
  },
  "x2tLjkB3DnWJb3QJpwrFBw": {
    "date": "3/30/2019",
    "text": "Service is fast and friendly and the restaurant is conveniently located right next to the Westin Convention Center.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UES1rVWLut2hSVFbrhab7A"
  },
  "Vjf85ly6paU8f32jCYgDMQ": {
    "date": "5/21/2018",
    "text": "Unfortunately our order was delivered and was wrong.  It had pizza toppings we did not want.  The stuffed shells were dried out and tasted old.  Then, those who ate the pizza became ill within hours of eating.  Could have been an odd coincidence, but I'd rather not take my chances again.  We will not be reordering.  We pitched the leftovers to not risk any further illness.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tx35cB_IL4B1AihMa3A2Yg"
  },
  "cxNDNOvPVq8dv0BUOib8nQ": {
    "date": "12/27/2016",
    "text": "I just gave 2 stars because of the orange juice that actually pretty good.  I barely eat my dish, I order the meat omelete and was horrible, the sausage taste like meat loaf, the potatoes were burned and the croissant tasted like very old.  My husband ordered the egg with sausage and pancakes, the sausage were gross and also tasted like a cheap meat hamburguer. He said the pancakes were decent tho.  I totally regret going to this place. We paid about 33$ what is pricey to a breakfast place and the food was just terrible. I wish we had just stay at the hotel and ordered room service.  Don't waste your time! There is very good places on the area.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "vorzx9BhMVorhvoSM8x84g",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Sausage taste so bad. Looks so weird also.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vorzx9BhMVorhvoSM8x84g/o.jpg"
      },
      {
        "img_id": "kFfZ09x8Vortx46C76VTgw",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. I barely ate! Taste so weird. The croissant taste very old and the sausage taste horrible, def not breakfast sausage. Put 13$ on trash.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kFfZ09x8Vortx46C76VTgw/o.jpg"
      }
    ],
    "user_id": "P5bZ3RyaKz4Ul43kk8oy5A"
  },
  "UIC-Hruol7hE9AM4IN5efQ": {
    "date": "11/19/2017",
    "text": "Well, it's certainly a strategically located spot, being down the street from the convention center and all of the transportation spots that would take one to Pittsburgh. It certainly wasn't the most flavorful or quality pizza I've ever had, but it satisfied the hunger, the slice was warmed up pretty quickly since there was only one other person in the store on the misty evening. I could already tell that it was the type of place one goes when they just need food and don't really care where it comes from, even if it means carb-city. If you're downtown and really craving a slice, go for it, but if you can wait to find a quality establishment, I definitely think you're better off doing so.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VN3apynnuv00bFwNOnXqqg"
  },
  "CHnB2TQIoxPF_en8-Ht-cA": {
    "date": "6/10/2018",
    "text": "My now go to delivery place! Everything we ordered was amazing! We ordered pizza, sandwiches and cheese fries. Everything was delivered hot I would recommend this place 100%",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iG3v7ytw7QRe_cFzgD6fNA"
  },
  "Dlz-aCfuHg2uIAOx79yrwQ": {
    "date": "11/7/2017",
    "text": "An alright delivery place for when you don't feel like leaving the house. Their pizzas are super cheesy, just the way I like it. I tried the stuffed shells, which were okay. Could have used salt but their marinara sauce is really good, and it came in a HUGE portion for the price. One order can easily fill two people. The garlic bread is a little bland in my opinion. The good thing is that the food was at my door not too long after we placed the order.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zw_V_Hd-2bDCymvfII-8uQ"
  },
  "44mDBD2uHuem3NxKZgkWrQ": {
    "date": "9/14/2017",
    "text": "I've never did a review before. Had to go threw a whole sign up just to let others know this place makes the WORST breakfast EVER! I ordered the most simple breakfast. Two Scrambled eggs with cheese with a side order of bacon. You'd think, it really is that simple. I get my food, and the egg was tougher then a rubber boot. The bacon tasted like old frozen meat. Then I realized I have no cheese. I go back and tell the dude you forgot my cheese. The dude then  argues with me cuz he said it doesn't come with cheese. My nephew who is 11 told the guy respectfully that I did order cheese. He asked for my name I gave it and that's when he pulled my order up and realized they forgot the cheese. 8 minutes later I get the same tough two eggs with two slices of cold cheese thrown on top.. like for real? What moron just throws cold cheese on a rubber egg and expect to get good feed back? Not to mention I bring it up to the dudes attention and he's looking at me like I'm at fault for this horrific meal. My order just got here and here's what it looks like now...   In all, I won't ever recommend someone to come eat at this place. HINT: THERES NO ONE HERE and it's 10:20 am",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EjkAi_bs3b9-ashwAopuew",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EjkAi_bs3b9-ashwAopuew/o.jpg"
      },
      {
        "img_id": "nFDyklOFmFDB3AvoXLdWnQ",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nFDyklOFmFDB3AvoXLdWnQ/o.jpg"
      },
      {
        "img_id": "t4uRpP-RW34lDswb964PpQ",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t4uRpP-RW34lDswb964PpQ/o.jpg"
      }
    ],
    "user_id": "pjiyFULLXNwwrneGKxEdPw"
  },
  "ulMGY5On0w_fSdf9GG4I0w": {
    "date": "8/12/2016",
    "text": "Joe & Pie is probably one of the best places to grab a quick bite to eat anytime during the day while in the downtown area.  My most recent visit here just happened to be after midnight and I was pleasantly surprised to find a place ready and willing to serve me at this time of day.  I had to ask to make sure the kitchen was open when I walked in and I was assured that it was.  With it being late at night there weren't a lot of people in here, only two other customers and they were nearly finished.  I approached the counter and was greeted quickly and walked through the menu.  Most times after you order your food you are done with interacting with staff until you are served your food.  Not here.  I suppose it could have been the late hour, but the employee was very chatty and informative about the business.  I found out all sorts of things but the few that stand out is that this place is supposedly really good for breakfast.  Some evidence for that is the fact that they serve breakfast until three in the afternoon.  Other things that I learned is that they deliver within a four mile radius of downtown (give or take a bit there).  A really good thing I learned here is that they are invested in Veterans.  So much so that they offer a discount to active military, Veterans, and those who service the returning military (i.e. those that work with a Veteran based organization).  As far as the food, it is fresh and hot.  So hot some times that it warps the containers they come in.  They also have some of the best salads that I have ever had from a pizza place in the city.  Not your typical salad made with iceberg lettuce.  Instead they use a mix of greens that are tasty.  A regular house salad nets you cucumbers, onions, tomatoes and as their menu states \"a hint of peppers.\"  Which I appreciate.  Peppers can be overpowering if they are in abundance.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "8ngcdFvS_IE5-HkWXZ9_qw": {
    "date": "6/26/2016",
    "text": "What the heck happened? I'm so confused. The first time we ordered here (about two weeks ago) I ordered the cheesy breadsticks and got something resembling a yummy white pizza cut into strips. They were cheesy and garlicky and delicious. I just ordered them again and, after almost an hour(!) I get some regular ol' breadsticks with half-way melted cheese on top. The cheese was dry and gross and actually cracked as I bit into it. Plus, it wasn't attached to the bread, so it kind of just crumbled off. These \"cheesy\"  breadsticks do not even come close to resembling the ooey gooey goodness I got two weeks ago. They look and taste completely different. I'm stumped. Did they recently change the product? Or was this a mistake?   I'm so bummed as I've been raving about these darn cheesy breadsticks for the past few weeks. BUT I won't be ordering from them again. So long, suckers.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "DtzguIRjy-oRbrwVidAxQQ"
  },
  "2fHzTZUk_9-IhiTw8LcnQw": {
    "date": "7/31/2017",
    "text": "I ordered Joe and pie on a whim this weekend. We have had the fliers for a while and decided to give them a shot. When the pizza was delivered we were initially pleased. The pizza looked exactly like the pictures on the flyer. We were so excited to try a piece. That's when the disappointment slowly began to sink in more and more with each bite. As I continued to eat, my opinion of them plummeted with every bite. The pepperoni tasted like they got it from a below average grocery deli. And the cheese, that initially looked amazing, was low quality, and sat on our stomachs the entire night.  One person was quoted as saying \"Joe and pie is to pizza what Two Broke Girls is to comedy. - flashy on the outside, but lacking substance upon closer inspection\".",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "w0utfon2BcRsKdwp3Bty3Q"
  },
  "W0zOik3u0WSvYsuG7eTQRw": {
    "date": "9/17/2016",
    "text": "So far so good. Heard a lot about this place from local downtowners. Diner style, actually pretty good breakfast. Was hoping they had servers, but, a guy brings out the food from the back and shouts your name. Goodmorning I guess!!?? Maybe I should of given a stage name instead.   Staffing must be hard to find. Place is clean and neat. Just needs some ambiance to create a mood.   Pizza, Sandwiches,  Fries, Gyros are also available.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Xhk0p9a2eM08MeTr-VQHDQ",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Mediterranean Omlet side of Bacon (extra crispy)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Xhk0p9a2eM08MeTr-VQHDQ/o.jpg"
      }
    ],
    "user_id": "mtrwciirsnKJGleYFfXYCQ"
  },
  "gj7Qq0pVPBBwKUDgcs6lmg": {
    "date": "5/6/2016",
    "text": "I work downtown, and I frequently just end up at chains because most of the options are overpriced and not very good.  I just recently noticed Joe and Pie when walking from the P1 one day so I figured I should try it out.  I am thinking it's newer, but I have no idea.  The great news is that they serve breakfast until 3:00 PM, which is awesome, as I usually have to go to McDonalds to solve my mid-day breakfast cravings.  While I cringed a little at the price for a breakfast sandwich ($6.99), I figured with 2 eggs and three slices of bacon, it was worth it.  The sandwich came on a massive bagel with bacon, egg, cheese, lettuce, and tomato.  The bagel was standard, but the food was still hot by the time I walked back to my desk since they use nice plastic containers.  The inside area was nice for lunch too if you want to eat in.  The best part was the friendly staff.  The guy I talked to was super nice and told me about the free delivery and their lunch specials.  I have never seen so many happy employees at a restaurant in my life.  If the prices are a little higher to have happy employees and long hours, I am so game to pay extra.  Credit accepted.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 14,
      "cool": 13
    },
    "photos": [],
    "user_id": "Ic6-gs1_FjrWGx6JIr95Mw"
  },
  "kxqapZ4cOz-cirqrLODkMw": {
    "date": "4/27/2016",
    "text": "I stopped by for a quick dinner today prior to a show at the CLO Cabaret.  Given that I'd already eaten not too long before, I wanted something quick, and Joe and Pie fit the bill.  I ordered a slice of the chef's white pizza and an order of breadsticks, which came to $7 and change together.  While the slices aren't made to order, they're the best option if you're in a hurry, and they're not half bad, esp. in comparison to other downtown pizza options.  The chef's white consisted of white pizza topped with tomato slices, spinach, and feta, and was quite tasty.  The breadsticks consisted of a large portion with a cup of marinara dipping sauce.  While I found the dipping sauce a bit watery, the breadsticks themselves were great--I particularly liked the texture and seasonings on the outside of them.  Overall, I was pretty pleased with my quick meal from Joe & Pie.  While I find the idea of a combination pizza place and coffeeshop a bit strange, they're definitely a contender in the downtown by-the-slice pizza market, so I suggest giving them a try if you're in the mood for a slice!",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 14,
      "cool": 16
    },
    "photos": [
      {
        "img_id": "8yJAr-JrzpI8ZqenpQoH5A",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Slice of chef&amp;#39;s white pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8yJAr-JrzpI8ZqenpQoH5A/o.jpg"
      },
      {
        "img_id": "w2xgidmc5pYH-BZN9nPRuQ",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Breadsticks",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/w2xgidmc5pYH-BZN9nPRuQ/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "BVEncbG9rZk8cBiFx8MoCg": {
    "date": "5/7/2017",
    "text": "Should have Known in the beginning when the DT location referred me to the Edgewood location and Edgewood location back to DT location my experience was gonna be terrible.   THEY FORGOT MY DRESSING!! 2 salads and no dressing. This was delivery too so I'm up on mt Troy . I called in to complain and all they did was pass the phone around to the cooks and mgr and whoever else.  After that it didn't matter if the sandwiches were the best I ever had we didn't enjoy them and I tipped the guy over $15 I feel like I got ripped off!   People make mistakes I get it but I feel I just got robbed.   Let's see if they make it right and I'll delete this review or update it with how they totally came through and care.   It's on you guys",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "X3fYkqlfQFNI3vP2sS-JWw"
  },
  "CZ3-CIdxOYBiDDCKOdXWbg": {
    "date": "9/3/2017",
    "text": "Its was ok pizza at best. I had a free coupon for moving to the area which lightened the curse of it. I doubt I will order from here again.   I had to repeat my order several times over the phone. The confidence in my order being correct was not high. The order was correct though.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j4EQI3Q_ah9rS4EKiIyE-Q"
  },
  "vVBxueqM2Z0pSGfxMEAboA": {
    "date": "3/22/2018",
    "text": "What a nice find!  Really great pizza.  The crust was light and the toppings were top rate.  Easy online ordering and they were 5 minutes early with delivery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bP9vRWcLRaO3qas7TO472w"
  },
  "W7WhH9-KIiU6acI7dLRg2g": {
    "date": "4/19/2019",
    "text": "This was really good pizza. They delivered and received a discount from my student who has a relationship with the owners.  The pizza and sticks we're great. One if the best pizzas that I tasted in the burgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_-Tvg5rZiPC-e-jM04DzKw"
  },
  "2v0vRZnZVceazJkSUgqBXw": {
    "date": "9/14/2019",
    "text": "Cheapest slice that you can find downtown barring the 7-Elevens. Unfortunately price is indicative of quality. This pizza will get the job done but just doesn't stack up compared to some of the others in the vicinity. The slice is smaller, the cheese is stringy, there is too much crust and not enough toppings and the sauce really doesn't have anything special to it.   Again, if you're price conscious or going with people who are, this is a great place right off Liberty to fill your belly and get your pizza fix.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lr5wJV4QnWJC18EqkKTvQg",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Pepperoni pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lr5wJV4QnWJC18EqkKTvQg/o.jpg"
      }
    ],
    "user_id": "Iicg8bnAevUC20LlXRNv8A"
  },
  "BFtWOQ7sFTEmQuad-kn1eA": {
    "date": "9/12/2019",
    "text": "This is my go to pizza shop in downtown Pittsburgh. I was blown away the first time I had it and have been loyal ever since. I usually just get the XL pepperoni (it's halal) but this time I switched it up. I got half pepperoni and half with pepperoni, ricotta, mushrooms and spinach. Regardless of what you get in the pizza it's really good! I usually ask for extra sauce bc it can occasionally be a little light. Definitely Recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y1DksgWHuNT4bUskQMxElg",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Y1DksgWHuNT4bUskQMxElg/o.jpg"
      },
      {
        "img_id": "wDN4xqtNwDnBohaXqjTMCw",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Half pepperoni, half ricotta/mushroom/spinach/pepperoni",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wDN4xqtNwDnBohaXqjTMCw/o.jpg"
      }
    ],
    "user_id": "exMcVUxhd_SKTV2ZZvek9A"
  },
  "mdzzJV5P2AW7bRgxL0CRyQ": {
    "date": "7/28/2018",
    "text": "Joe & Pie is a quick service breakfast & pizza spot. It's in walking distance of the convention center, you can order online and I'm pretty sure they serve breakfast until 3pm (don't quote me). I have to say, I was a little disappointed with my order because I guess I was expecting more of a gourmet breakfast sandwich. This spot is much more fast-casual, the eggs were puffy and the bacon was super greasy. The home fries were okay, came in a large quantity. I found myself picking a lot of the egg off of my sandwich and in all honesty, I really didn't need the home fries on the side. The sandwich itself was a pretty big portion size.   All in all, I would recommend this spot to someone looking for something quick, inexpensive & within walking distance of the convention center. However, if you're hoping to start your day with like a banging breakfast, I would check out other options (but that's just me).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CzU0Dcf4gxOZOnuzcga98w",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CzU0Dcf4gxOZOnuzcga98w/o.jpg"
      },
      {
        "img_id": "lZ79OcdDeh5YcVB8DhR8ZQ",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lZ79OcdDeh5YcVB8DhR8ZQ/o.jpg"
      }
    ],
    "user_id": "k_PlEjlkkcoYBQh3jSiUuQ"
  },
  "Lp1ssz8_QrGAkGWAHt5EIw": {
    "date": "9/11/2019",
    "text": "Great GF Pizza and grilled veggies and potatoes for breakfast.  We ordered online for takeout to our hotel.  Great food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DmxwDTWMwJmqMYp1k5V7GA"
  },
  "ItSoPdm3sKk5ssXSQ7_5tQ": {
    "date": "9/8/2019",
    "text": "Wow is this place awful!  We ordered pizza when my wife's parents came to town and were told 30 minutes for delivery.  After an hour, we called to check on the order and were told, \"the delivery driver was sick\" and our order was delayed.  It arrived 2 hours later...cold.  I'm an understanding person and gave a second chance.  Mistake!  The next time I ordered I was quoted 20 minutes.  An hour later, I called and was told, \"the driver just left\" (looking at other reviews, this seems to be common theme). After another half hour, I ordered from a different pizza place.  NEVER AGAIN!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k64xdc2Wyuawar3966JkJA"
  },
  "fUQsaPb4sL7FsYQCCKWsYA": {
    "date": "6/24/2019",
    "text": "I stayed in the Westin Hotel so this was right across the street from me.  I did not expect this place to serve breakfast too.  There breakfast options are okay, but I liked the coffee more.  Their pizza is pretty good and so was their service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wwlYnOgllKVmwwy2CXfqyQ"
  },
  "ItW4zrstOrVH2RQX3XE7HQ": {
    "date": "6/9/2019",
    "text": "The service was very slow. I ordered a chicken parm sandwich. I couldn't even stand to eat it all. It was a major disappointment. I wouldn't recommend it at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tKmwBa76TNZISid4DpiPqw"
  },
  "wwX--xg5P5-QBQLykcvqMA": {
    "date": "8/18/2019",
    "text": "Would rate 0 stars if possible. Large order placed for breakfast (for about 10-12 people) with time estimate of 40 minutes. After over an hour passed, we called and were told food was \"just leaving\" to be delivered. Twenty minutes later called again. Again told food was \"just leaving.\" Food finally arrived close to 2 hours after initial order. Eggs were over cooked (burnt in some cases), chocolate chip pancakes had no chocolate, and coffee had clearly been very old. Our party included a groom who needed to leave for his wedding, so he was unable to eat due to the late delivery. During our numerous calls, we were told we could not have a refund of any kind but NO BIGGIE since they instead have us a 2 liter Pepsi to go with our breakfast. Woo freaking hoo. Don't waste your time or money here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6mfKhJ5RmhvE9PSFGf7P0w"
  },
  "EyGrWzJWikZibYTfM90eLQ": {
    "date": "2/10/2019",
    "text": "Really disappointed. Ordered two large pizzas for delivery. $35.66. But these \"large\" pizzas had 8 slices each. Looked at the driver and said \"are you kidding me?  We ordered large.\"  He said they were.   Ripped off, big time.   I would really like at least a partial refund, because there is no way that was correct.  And if it was, The pizza was definitely not high-end.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BPdNhaNQt2_cZVV7Z15_kg"
  },
  "YIcOkUEuv8Gk8AMVjXRsWQ": {
    "date": "6/23/2019",
    "text": "Ordered wings well done and they were RAW!!! They also had barely any sauce. Pizza was okay but a little burnt. Maybe they got them mixed up. Never again!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ALRukDyvOZtjlBOOFesHEg"
  },
  "l790GsgEIRxEt7-tmqlDnQ": {
    "date": "7/23/2018",
    "text": "Ordered from my hotel. Person who answered the phone and took my order was pleasant and helpful. Ordered a steak salad and a six inch turkey club sandwich. Delivered in time frame quoted on the phone. Food tastes fantastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mfrK2hckNy42OeCkrGZfwQ",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. 6&amp;#34; turkey club",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mfrK2hckNy42OeCkrGZfwQ/o.jpg"
      },
      {
        "img_id": "FpH3IOjnR8fxej-Uq4sOqw",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Steak salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FpH3IOjnR8fxej-Uq4sOqw/o.jpg"
      },
      {
        "img_id": "GXtC0HVKa0e_cm0KkCQ-Qg",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. As delivered",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GXtC0HVKa0e_cm0KkCQ-Qg/o.jpg"
      }
    ],
    "user_id": "wackZZt8qSJtUkWz_gbtmA"
  },
  "FL1rZpnmUEoilp1EujPYFg": {
    "date": "4/19/2019",
    "text": "Ordered a steak hoagie with no cheese cause I'm allergic, something I've ordered from this restaurant many times. When I received it there was cheese on it. I called about it and though they apologized, I was told that \"Hopefully I can eat around the cheese\". They gave me 10% off my next order but now I'm stuck with a hoagie I can't eat. Thanks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "55Ol5tSXEuNsLZsR1N5cpQ"
  },
  "gHtBoZM2zK-gPROtg8pKMA": {
    "date": "1/20/2017",
    "text": "Joe and Pie opened not too long ago and is a welcome addition to the area.  Items I immediately notice:  1) CLEAN dining room 2) simple menu 3) reasonable pricing for lunch 4) guys behind the counter are pretty cool and personable.  So let's see what Joe and Pie means:  Joe means coffee like \"cup o' joe\" and breakfast, Pie like Pizza Pie so a creative way of saying \"breakfast and lunch\".  Ha.  My usual lunch option here is the meatball hoagie.  The bread is toasted hot and inside is soft, meatball and sauce come out really tasty.  I hate to say it but I would rather eat this meatball sandwich than a nearby competitor that sells meatballs exclusively at a fraction of the cost.  I tried the salad and was not as thrilled mainly due to the cut of meat used for the steak portion.  Rather than hearty steak, it was more pieces of sliced beef.  I'd skip that next time and try other items like the White Pizza slices or stick to my usual.  Overall, decent choice for lunch.  If taking to go, better to call it in first and then pick up to save time.",
    "rating": 4,
    "rated": {
      "funny": 55,
      "useful": 75,
      "cool": 69
    },
    "photos": [
      {
        "img_id": "ZmjR0ATIGvvauZU-wvymYA",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Italian Hoagie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZmjR0ATIGvvauZU-wvymYA/o.jpg"
      },
      {
        "img_id": "kmuRirg-qccj67UWDIlxLg",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Gyro combo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kmuRirg-qccj67UWDIlxLg/o.jpg"
      },
      {
        "img_id": "X_uU9aKf7mUyKVm9xig-NQ",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Meatball Hoagie combo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X_uU9aKf7mUyKVm9xig-NQ/o.jpg"
      }
    ],
    "user_id": "6tbXpUIU6upoeqWNDo9k_A"
  },
  "VHRofkp_iHSb249J1HkuwQ": {
    "date": "11/4/2017",
    "text": "My husband and I have been on the search for a good pizza place for months, after our local favorite was bought out and they changed the recipes. About a month ago we discovered Joe and Pie, and I thought we were finally done searching.  For the past month or so we have ordered about once a week. I have tried their pizza and calzones, and both were good. The quality of the ingredients was high, always fast delivery, and no real complaints.  However, tonight we placed an order and are extremely disappointed. We repeated the order over the phone multiple times, and were read the order back. I ordered a veggie calzone with only green peppers and onions in it, and we specified twice that I wanted marinara sauce in it along with all the cheeses it usually comes with.  The calzone I received has no marinara sauce, and barely any cheese. About half the calzone had no cheese in it, just piled veggies. There was also broccoli, which I didn't ask for. Oil also leaked out all over the place, which was pretty gross.  We called in to let them know they messed up the order. I understand everyone makes mistakes, so we just wanted to let them know. However they didn't seem to care at all. The guy on the phone looked up the order and said that he did key it in correctly, so he didn't know what happened.  The reason I gave this such a low review is because of the customer service. The guy on the phone said he didn't know what we wanted him to do. We asked for a credit off our next order. Like I said, we understand everyone makes mistakes and had intentions of ordering again, but I didn't want to wait for another calzone that night. He offered us $3 off! A $13 calzone! I couldn't believe it. That is terrible customer service. Even though every other time the food has been good, we won't be returning. And not because of the food - because of the poor customer service we received.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "obaLxwGA7gB5IQ2pSua1cg",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/obaLxwGA7gB5IQ2pSua1cg/o.jpg"
      }
    ],
    "user_id": "_oNthTV94Evx9qGkJOTXLQ"
  },
  "g07LC15kcWZDR-trV_WguQ": {
    "date": "3/30/2019",
    "text": "Friendly staff great breakfast big portions...will be back again for sure........also right next to convention center",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mFzT3lRstsa3LqKsesMyxw"
  },
  "ff_GwsXh-NxWCJkeaXjilg": {
    "date": "3/27/2018",
    "text": "My order was wrong, I ordered a breakfast sandwich with sausage. I received hamburger patties in my sandwich instead. Asked for refund and was told that I was wrong it was just hot sausage, there's a big difference in hamburger smell and taste and sausage smell and taste. Never received the refund or a new order. I will never order here again. I wish I had read reviews first cause this apparently is something that happens often.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fmzAJ_uKZMRnffyinwvbpA",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fmzAJ_uKZMRnffyinwvbpA/o.jpg"
      },
      {
        "img_id": "YdBFj18owSo5rzbZ64TM_Q",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YdBFj18owSo5rzbZ64TM_Q/o.jpg"
      }
    ],
    "user_id": "4fyjx5oBvVVHdaOwbBH79w"
  },
  "9h2evEdUtOtKeE2vyojudA": {
    "date": "8/11/2016",
    "text": "So nice here! Thank God they got rid of Jonathon! And thank God Donovan and George are still here; they have much better personalities, and actually work. Okay. Deep breath.  I was ravenous, and had those golden brown babies  on the brain,  so pancakes it was.  They did not disappoint. They arrived in minutes, served by Kai, the ever-smiling, friendly owner. And they were just as expected. PERFECT. And George made my dirty dishes disappear like kids on a day off from school.  If I had any complaints, it was that George told me they now have WAFFLES (!), right after my pancakes came out. I had asked about waffles months ago, so I'm one fat, carb-happy camper.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "l5ra8sRLTdXFNbfO2aDhiA",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Eggs MTO, perfectly ( the second time).",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l5ra8sRLTdXFNbfO2aDhiA/o.jpg"
      },
      {
        "img_id": "B-DTD7SZNh9Qt6pgF3IlKA",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Blueberry waffle. So not sharing!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B-DTD7SZNh9Qt6pgF3IlKA/o.jpg"
      },
      {
        "img_id": "0P4IQRhRYZRlrWRpf-8sUA",
        "caption": "Photo of Joe &amp; Pie - Downtown - Pittsburgh, PA, United States. Grilled Steak Salad: Romaine, cucumbers, mushrooms, red onions, cherry tomatoes, shredded mozzarella, ff. ($9.99)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0P4IQRhRYZRlrWRpf-8sUA/o.jpg"
      }
    ],
    "user_id": "wrUYC0wc987XBBAoskOCHA"
  },
  "yxKYjuCZ5_q9ukGfPveahg": {
    "date": "7/8/2017",
    "text": "While I'd like to give a review based on the food, that would be impossible as we never received it. Called for delivery, ordered a medium pizza, breadsticks and soda. We were given a delivery time if 45 minutes.   After waiting an hour I called to check on the order and was told it was out for delivery. After another 30 minutes I called again to check if the driver got lost. The manager tried calling the driver and got no response so I cancelled the order and we prepared to leave and get dinner.   As my hand opened the front door to leave, there stood the driver. I told him we cancelled the order and I doubted the pizza was even still hot. He stuck his hand into the bag and said, \"It's sorta warm.\"  I promptly told him to take the pizza and leave.  We'll never order from them again.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "7J6tPUjl4iJWBd8rPH3-Xg"
  },
  "yG8-73qCtHiQ5Sgo2sptzQ": {
    "date": "9/29/2016",
    "text": "I was one of the first people to patronize and write a review for this company.   I believe it was at the beginning of the summer I ordered a steak salad with cheesy breadsticks.  It was awesome ! Tons of meant and veggies in the salad and perfect dressing.    I just ordered the same thing to its and I was let down.  Dressing was beyond watery, hardly anything in the salad... Minimal meat,  hardly any fries and a miniscule amount of lettuce.   While it tasted the same the portions they used is much less than before when they gained my good rating,  approval and recommendations.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "96Fkfz5Q7LU0gWEYkQzs4g"
  },
  "h0p44xs44mmnhxtPCuFjgA": {
    "date": "4/9/2016",
    "text": "This is such a cool place to eat. the sandwhich that I had was great. They have so many options to choose from from breakfast to lunch and dinner and they aren't expensive. I highly recommend to my friends who are in downtown!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qX9gVF_T7BeCl6Dsrs3s4Q"
  },
  "TBS2U-88qDmBxSlr7etLFw": {
    "date": "11/26/2016",
    "text": "the syrup tastes like butt wipes and the eggs were so hard to the point they were crunchy. everything else was okay",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ImqJngN22e2nRb-zm-FDQ"
  },
  "Lv6HjdmFttNpkgQsapd2Pg": {
    "date": "7/21/2016",
    "text": "ordered a small salad for $4 and believe me, its small. just a warning don't even bother with the $4 for this one",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EvbEktHkNCxTtxJBHDnp4Q"
  }
}