{
  "ARVywc0Q4UoaND6OGoJvKA": {
    "date": "2/28/2013",
    "text": "Fried zucchini and fried pickles. Uh...if you love grease and no flavor....have at it Hoss! I love me some food as I'm a fat guy...a vegetarian for over 10 years...but, still I love good tasting food. Can't honestly remember the last time I was disgusted with food that I threw it out....bottom line, I threw it out! Let's just call it was it REALLY was...fried batter.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c-geEqyt3Ko6yTEydoCYTg"
  },
  "Rug5LNujm8IaN64xcUYGmg": {
    "date": "6/23/2012",
    "text": "Sideliner's sits is in the old \"Little Athens\" building on Locust street in the heart of Sewickley Village. Little Athens sut down and had another name for a while after a interior redesign.   The bar is alright... lots more seating at the bar itself than there used to be. There are lots of beers on tap, so that is good. This is also a good alternative to the Sharp Edge for six packs. The coolers along the wall are a nice addition (now that it is Sideliner's) having a much larger selection than Pizza Roma (and no smoking!) and far better prices than Sharp Edge.   The food is alright- no real complaints, but it isn't anything special. The wings are alright and most recently I had a burger there that was pretty good. I ordered it with gorgonzola, and it could have used a little more cheese. My girlfriend had a buffalo burger (cheeseburger with buffalo sauce... not a burger made from Bison) and it was alright, but it lacked some of the stronger flavors one might expect.   The prices here are maybe a little more than you'd pay for the same in the city (everything is served in plastic food baskets), but the prices are far more reasonable than most of the other places in town. This is Sewickley, afterall, so most places are upscale, and the food is really nice.   Overall this is place is alright and I would (and most-likely will) go back here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VSptyGMTy1KuWN0aZxhM6w"
  },
  "11KESGcERDK3bhlmPZ9IEg": {
    "date": "9/15/2014",
    "text": "Great wings! Try the garlic fries. This place is generally busy, but there is always room to move and mingle.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LIHlbBXL5LsOyNpQVAU3lg"
  },
  "SGK7WOtsLEsl79_K8lCJgw": {
    "date": "2/1/2015",
    "text": "I would really like to fall in love with Sidelines. But I've been there three times and it is always just meh. They have a good beer selection, but their bartenders always seem rushed and aren't very attentive or friendly. The ambiance is loud and chaotic and doesn't have that warm and friendly pub vibe. The tables in the dining area always need to be cleaned off. The food is bland. I've eaten there twice and literally can't describe what I've had...boneless chicken wings and fries? Maybe? So why do I go to Sidelines you may ask? Because Sharp Edge Sewickley's kitchen closes at ten and Sidelines' kitchen is open until (I think) one in the morning. Sometimes it is not good to drink on an empty stomach. In that case, Sidelines it is.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ssBqXW-hWvtmM4q8uj0vDQ"
  },
  "Y1ryHnXhV4rY7rz2k6HzXQ": {
    "date": "11/3/2014",
    "text": "Slowest service in town, got here at 650, still waiting for our food at 740pm. I have no idea if the food is good, because it is never going to get here. Help.  I'm hungry, 8pm still waiting, never ever come here!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLzyPaX1eHoje7zJ4EQqhA"
  },
  "vYwC9okgSqWLVDn1ckD4tw": {
    "date": "11/1/2012",
    "text": "We expected better.  The food was not good.  The fries are plentiful but they're tiny little nubbins - and, even worse, ours were cold.  I had the buffalo ranch wings and they were terrible.  It was like wings swimming in a thick barb-a-que scented vinegar.   Just bad.  My husband had the sloppy joe and said it was so-so.  Our kids ordered a hot dog and a PB&J.  The report on the hot dog was positive, but we had to return the PB&J because the child couldn't fit it in his mouth.  It was made on very thick Italian bread with a hard crust - honestly, how they expected a child to be able to eat it I'll never know.  We returned it for flavorless Kraft mac & cheese that had obviously been cooked days before and just reheated.  They have the nerve to charge $5 for it.  The service was terrible.  The waitress's breath and clothing absolutely reeked of cigarettes and beer, and she seemed high as a kite.  This was at 4:00pm on a Thursday.  There was only one other table occupied in the dining room yet our service was very slow.  We had to try Sidelines once, but we won't be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "UMrt8aUYRexoL3V4X4LbsQ"
  },
  "IjDnIrEOUbVy0iG6WhYNZw": {
    "date": "6/2/2016",
    "text": "Truly the best wings to be had! I am not much of a drinker but I had 2 orders if the wings. It was very fun as many of my friends were there. It was my first time going there and I will be back for sure!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NOR93THAvtPUrJlzP9a3pA"
  },
  "n7TQb2pOLXgzxVxmrwor-Q": {
    "date": "2/26/2014",
    "text": "I was pleasantly surprised by the Beer Cheese and Sourdough Bread.  This is a unique appetizer, and if you go during happy hour, it's half price!  I also had the Black and Blue Burger.  The burger was very good, but I thought the fries were just okay.  Service was quick and friendly.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "DYmbRviQ9k90d406wA6SPg": {
    "date": "12/29/2015",
    "text": "Great lineup of beers, great service and banging awesome wings!  What more could you want.  Very impressed with the variety of wing sauces.  Def will be back when I'm around swickley",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xPfnNS_k5GqWkTPp_lMlTA"
  },
  "fVHBAvY_rjjxLJtdhQzgOA": {
    "date": "7/25/2014",
    "text": "The wing night here is an awesome deal ($0.25 from 7-midnight)! They are actually my boyfriend's favorite wings in general. I usually like wings with sauce but last visit I tried the garlic parm rub and it was surprisingly good without any sauce! My boyfriend liked the Jamaican Jagoff flavor. Other winning wing flavors: medium,BBQ, honey BBQ, and fit to be thai.  I have also tried the buffalo chicken soup-the flavors were good but it was not hot. We have also tried their version of loaded fries which were great bar food however they could have been hotter. If I don't order wings I always order the buffalo chicken quesadilla and it's awesome! Since it's been a hit or miss with some other things, I recommend getting the wings or a quesadilla.  Their drafts are cheap too and they have a wide variety of choices on tap!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gFsqraWQfG46ohVFRg_d3A"
  },
  "5B938Dm7KO3AKQXpGsLahw": {
    "date": "4/17/2014",
    "text": "The only reasonably priced place to eat and drink in the Wick.  Burgers are top notch.  All you can eat crab legs on Thursdays.   A great local addition.   Nice ambiance for a local bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FpXs6r-8l2HQy6QOejV--g",
        "caption": "Photo of Sidelines Beer House - Sewickley, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FpXs6r-8l2HQy6QOejV--g/o.jpg"
      }
    ],
    "user_id": "j59gZVA79eef39wJ11MLng"
  },
  "8fzD05rwd4Z-SFawy9mDYg": {
    "date": "10/5/2016",
    "text": "The first time I went to Sidelines was on a Friday evening. My parents live out that way, and my mother said it was a good place for happy hour. I didn't expect much, as it doesn't look like much, but found it to be really solid bar food and a pretty great drink menu. Any place with Arsenal on tap wins points in my book from the start ;). Our waitress was super nice and very helpful. I ended up going with a burger and was genuinely surprised how good it was. Also, the make their own fries and chips, and while I'm not a potato fan (I know, I know) for what they were they were pretty damn good. I thought to myself then, 'I should definitely do this again sometime!' Fast forward to this past Monday... the place was packed! (good for them :) But the staff handling the crowd was not exactly prepared. The poor guy working the back section had a table of around 20, and seemed to be having an actual panic attack. I felt really bad, because anyone who has served knows how crappy it is to be slammed so hard. But that didn't make me any less hungry... Needless to say after quite a bit of waiting we finally ordered a couple burgers. Apparently Monday is create your own burger night (for only $6!). By the time they fed the extremely large party, and the rest of the crowded place, it seemed like they had just about given up on our food. The burgers kind of stunk. The fries were a grease pit, and my chips were way burnt. Also, their Arsenal keg had tapped the night before. Overall it was really disappointing. So maybe I will give them a third chance sometime in the future and see if it's more like time 1 or more like time 2... but for right now I think 3 stars is fair.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9z8jGHimbdno4SJGG_3esA"
  },
  "YHXFnLRdwVxMBmBw59MVVg": {
    "date": "1/11/2013",
    "text": "Wings and Suds!  Great place for a few beers and a snack or quick meal.   The Wings were rated the best in the Burgh by the City Paper (last year).   About two dozen beers on tap and a vast number of bottled beers in the coolers.    The bar area is nice with some high top tables, a U shaped bar, lots of TV's.   There is another area for seating with tables that is large and a plain jane area and you have to walk up a few steps.  Also, lots of TV's.  The menu has about two dozen types of wing sauces.  The medium wings we ordered were meatier than most other places and nicely cooked.  Good sauce, too!  Partner had a burger and said it was very good.  The menu has some other items but did not really look for anything but the wings.    Service was friendly and good.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "20ya-tY6TPUHHz61w_8yiQ": {
    "date": "3/5/2017",
    "text": "Great food and great service! Nick was my waiter the last two times I was there. Nick is awesome. Nick is the real MVP",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zcZ7FFHrNXYlAeiueL7S3w"
  },
  "QVlCEd--dYLOGb-kX4PaTw": {
    "date": "3/2/2016",
    "text": "Had the very best fried oysters ever here tonite. Love their hot wings- always cooked to perfection. All around great bar food at excellent prices . Superb staff. Friendly atmosphere and clientele .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XgpzxC2nnmoI1d32AZF6Kw"
  },
  "-Sg8uiwQRQciBoow9FWwJg": {
    "date": "2/28/2017",
    "text": "Presently waiting over an hour for our meal and they are not overly busy. Service is abysmal. The only appetizer that made it out was cold. We won't be back",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DF0fnk5Ibm7YXfWypMnxqA"
  },
  "3AVMjnVNch-hoy9rK3Z6Ng": {
    "date": "2/27/2015",
    "text": "This is a cool little sports bar in the heart of Sewickley.  It's a great place to sit at the bar with a beer and watch the game on one of the many tvs.  The people who work here are very nice, and the food is pretty good too- but it's not really my social scene.  I always feel a bit awkward when hanging out in Sewickley because it's a bit uppity.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2oTG2GrBpikkonRxQywI7Q"
  },
  "riJOue-aVRp3vIBFuIlG_g": {
    "date": "5/25/2013",
    "text": "My wife, daughter and I were going out for my birthday and I was jonesing for some wings and a good beer selection. I googled it and Sidelines came up. The bar itself was nothing fancy but had that neighborhood bar kind of vibe.   Our daughter had a grilled chicken Caesar salad. My wife and I had wings and salt and vinegar fries. The food was beyond our expectations. The wings were crispy and I would highly recommend the hot bbq or sriracha honey wings. They had a great selection of drafts and a whole wall full of coolers of bottled beer.  The staff was friendly and there were plenty of flat panel TV's to catch the game. I am a fan and will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_0NCaHwUJK6-loi2Qgqcxw"
  },
  "GDnA_cG-aWz25g9Mhn_7Cw": {
    "date": "7/7/2012",
    "text": "Food was ok, although every order was wrong. They mixed up the burgers and served us ones we didn't order.  We also heard the waitress tell other customers they were out of rum and limes.  So you'd be out of luck if you wanted a drink.  The waitress was ok but she also messed up our check.  Probably would not go back again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DbhaUxlgtn8cwFMnyjASiw"
  },
  "ZKiaA--erFRo2xFXkt1teA": {
    "date": "1/3/2016",
    "text": "Tons of beers on draft and in bottle. Places has a sit down section and a bar on the opposite side. Good bar food. Tons of wing sauces but watch out because they are spicier than you would think. I'm a huge fun of hot stuff and 8 has a definite kick. They have daily food and happy hour specials. Crab leg night is awesome Bc for $20 you get unlimited salad and fries along w buckets of crab. The turn around time for crab isn't too bad but make sure that you order when you have one or two left Bc I've been there when they start to run out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "HeuQPs2okakxhdAkDiDUyQ": {
    "date": "7/11/2015",
    "text": "The name pretty much says it. This place has a great selection of bottled beers and a decent selection of drafts which is constantly changing. They offer modest happy hour discounts and have a typical selection of bar food (wings, burgers, etc.) with a few vegetarian options. Prices are reasonable especially in Sewickley.  The wine selection is awful and there are few premium liquors so your best bet is to stick with the beer.  The place can be crowded and noisy, especially at happy hour, and the bar is unusually high; uncomfortably so.  But for the money, it is probably one of the best values in Sewickley, if bar food fits your bill.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JkHGn2WpOLxq7ENbQMxObg"
  },
  "EU28D9uqM--wC8F6NH7jcQ": {
    "date": "12/25/2012",
    "text": "As I would have suspected Sewickley's finest are a bit too pretentious for this place.  It's affordable good food with a good wait staff.  Sideline's wings have been voted best in the burgh a few times and the product in Sewickley is the same product in Lawrenceville.    I have been to this location a few times now.  The place has been packed every time.  It can't be that bad to have that good a following.  In fact, my friends and I will typically default to Sidelines if we are looking for good food, good beer, sports and music.  It's probably not the best place to bring little children.  After all, it is a beer house.    The wings are the best there are this side of I79.  They offer a good mix of flavors both hot and not.  The beer selection is one of the best in the area.  With mix and match six packs to-go as well.  In short, go try it for yourself.  If your from Sewickley, loosen up a bit and enjoy.  If you can't, I don't mind because that's just more for me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ekK_0AWR8UgweYngO8ls8g"
  },
  "d1CHkVXbql7nGSWh4jWUCg": {
    "date": "8/15/2014",
    "text": "I really enjoyed this place. By far the cheapest bar I've ever gone to and surprisingly didn't get cheap/bad service. We got the garlic barbecue wings and they were delicious. We also got the beer cheese fries which were not my favorite since I was expecting the thick beer cheese, but it was thin. However, due to the fact that I spent barely any money and got quite a lot of drinks and food I'm very happy about this place. Honestly I'm not kidding when I say this is the least expensive place I've ever been to. We got a couple American honey shots and they were only $2.75 each. Like what?! I live in the city and wouldn't be able to get those shots for even $4. They had some good beers on tap as well. I wish this place was closer because I would certainly be a regular.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d6JltKIeAbPj415bwSm7eA"
  },
  "dF6XBPTNlwEqe1hbmUZ8sg": {
    "date": "12/24/2015",
    "text": "Been here several times. Service is good sometimes and horrible others. Food is good. Lots of beer. Creepy atmosphere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YCDlsi52o4o8CLrOAWCZzg"
  },
  "TtzFmA0QMMMSWUPXXKs3Cg": {
    "date": "12/16/2012",
    "text": "A lot of potential, but just falls short.    Sewickley needs a casual, mid-priced, sports-friendly pub and I had high hopes for Sidelines.  Unfortunately after three trips, Sewickley still is in need of such a place that is worth frequenting.  Menu:  Typical bar food with a focus on wings...many flavors.    Food:  Very average.  The focus of their hot wing sauces seems to be just how hot can we make them.  Too bad, as several probably have great flavor (Jamaican Jagoff for instance) but are simply so hot there is nothing left to taste.  Note:  I love hot wings and am no wimp when it comes to spicy food.  The fries are usually \"pieces\" of french fries, laden with grease and room temperature at best.  One notable exception are the Beef Sliders - good, but still suffer from the fries.  Service:  The wait staff is pleasant, attentive, but knows very little about the beer they serve.  If you are going to call yourself a beer house, you better know the difference between Porter and Stout...other than they are \"dark\".  In limited exposure to the bartenders, they seem to just be \"doing the job\"; not very customer service oriented or, in any way, go out of their way to serve.  Here's a hint - smile, greet people, be helpful and your tips will double.  Rocket science.  Atmosphere:  There wasn't much to work with going back to the Little Athens days; nothing has changed.  The bar is, well, a bar.  The upper dining area is cafeteria-esque with flat screens.  No big deal if the rest of the experience made up for this - it doesn't.  Overall, a sloppy execution of a concept that can, and should, have a great and loyal local following.  Not from me at this point.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "k2Bsnh6CV0HFX8RgGR1p9A"
  },
  "kBz4inFdAkd7VtZYwKvl6g": {
    "date": "11/29/2015",
    "text": "Decent wings, great beer selection and ok service.  I was not disappointed, above average sports bar for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E8O44KAJI8wcfKxSH09fuA"
  },
  "8hlO12rcwNFvUYj_Htvgfg": {
    "date": "5/5/2017",
    "text": "Only one way to describe this place: 'eh.' Eh to food. Eh to beer selection. Eh to service. Eh to atmosphere.  Not the worst, but not even close to the top. Only thing going for this place is that it's the only middle-of-the-road price point in the area. Worth it to spend a little more and go to a bar/restaurant down the street.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XPkEl6t9Nw3yyGwka8h72Q"
  },
  "nXRzt9tG1UwU0llcUlcQzA": {
    "date": "1/25/2017",
    "text": "Overall good place with good food and great staff! And some days have really great specials!! I go here twice a month about and have no reason to stop!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5ANTPYq47qR4GV3j9J9ELQ",
        "caption": "Photo of Sidelines Beer House - Sewickley, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5ANTPYq47qR4GV3j9J9ELQ/o.jpg"
      },
      {
        "img_id": "x0aijhTkKgyM3OdRHP7eiw",
        "caption": "Photo of Sidelines Beer House - Sewickley, PA, United States. Large draft selection!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/x0aijhTkKgyM3OdRHP7eiw/o.jpg"
      },
      {
        "img_id": "D7mWOqBUP8uioEaU7u4Ydw",
        "caption": "Photo of Sidelines Beer House - Sewickley, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/D7mWOqBUP8uioEaU7u4Ydw/o.jpg"
      }
    ],
    "user_id": "SPPieDvwnkvQoI7lj5vFYg"
  },
  "bZxSn6I-5gWoW4uclL9Lww": {
    "date": "3/10/2018",
    "text": "This place is good. There food is really good and has lots of drinks! The staff is really amazing!! They have really good wings. This place is really clean (except the bathrooms)! They have a big big projector screen. He food comes out really fast too! The only problem is the bathrooms need some attention!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HMGbLlcpdQjctZlgAMf64g"
  },
  "YbnrE9K-9_X9ZvmIPduugA": {
    "date": "10/31/2017",
    "text": "Meeting a buddy for a beer to watch the game, GREAT place.  As a place to take your wife for a nice dinner, not even close.  Imagine your young child wants to please Mom and Dad and make you something - thats how the nachos were.   Ordered drinks, mine came in a glass, my wife's came in a plastic cup.  Wings were okay.  We were in the room off the bar and I think with the wait staff \"out of site, out of mind\".  We were left alone a lot.   I had high expectations given the number of great restaurants within walking distance.  Sidelines failed.  Like i said though, to sit at a bar and drink with a buddy, great.  As a restaurant, it failed miserably. Also, had to leave quick at the end too  (mens room out of order).",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BJBuCIOznUoTPcoAl6Wc6w"
  },
  "p13W1CcCV4RAvRu35LkS1A": {
    "date": "12/4/2016",
    "text": "My buds and I like to come here for happy hour for some drinks and wings. Their wings are awesome!  They have a ton of sauces to chose from; I recommend maple bacon siracha.  It's a little overpriced,  but their food is pretty tasty.       On the other hand, the service here is awful.  I've gone here and they've never brought out my drink and I could not flag down a waitress. I was also charged for said drink that never arrived. There never seems to be adequate wait staff no matter when you go.  Make sure you tell your waitress everything that you'd like to order,  because you'll never see her again. TL; DR great food, terrible service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "21EOJ63lvhandiRvUcqnJQ"
  },
  "-dasdnn4iBM00mNH223CIw": {
    "date": "3/12/2017",
    "text": "This is the best place in Sewickley to go grab a beer.  The food is really good bar food with good prices (especially for Sewickley). Great draught beer selection.  I loved the buffalo ranch wings....extra crispy. Done to perfection.  The only complaint was the service was a tad slow.....but acceptable as we were just conversing and not in a hurry.  Great place sort of hidden in Sewickley.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "pyJ0OuvrMc0sX0TdufQQbQ"
  },
  "8FgEWEqv25bKGIBNNEt-Ew": {
    "date": "8/24/2017",
    "text": "Always a very yummy meal. Love to get them for carry out on a busy night. Also love there on house specials. They best fries! Could spruce up the decor, but hey... life is tough.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "81XlqBtOwWS4u703VYbrgw"
  },
  "_t3ytkxtvmHV_q2bPC_Brg": {
    "date": "1/13/2013",
    "text": "I want to write an informative review but I must be honest to the other yelpers!  The night was a blur.   I had a great time.    I consumed many good spirits.    I left in a happy place.  Atmosphere - Jukebox was playing and dominated by Hard Rock (metal).  The crowd was younger.  It was a good time.    Try it - Review it :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JgOcyMF1lTwSVCarSZrrrA"
  },
  "ijmzMeFCaci17m6XAEaNvA": {
    "date": "6/23/2016",
    "text": "My husband talked me into going back and I have to say, I'm pleased that some changes have been made to improve the quality of served food. Wings appeared to be fresh made, and hot in temperature.  I'd go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q6S6gYh62JrDhl6t7zjWLA"
  },
  "qiWMBh3hTG7o-RH2puzkAw": {
    "date": "9/20/2017",
    "text": "First time there. On a recommendation for my brother. My wife got the wings and they were fabulous. The flavor she wanted was not on the menu but Rob the cook made them exactly the way she liked them. Amy the bartender was very friendly. Service was exceptional. Good atmosphere. If you're a you're a chili fan. I recommend the chili.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MQizQytT0GEVjNiisjD8hA"
  },
  "ehS8cjvEiK35ZXCHmDCNQw": {
    "date": "9/19/2017",
    "text": "Food is ok but won't return. Terrible service. Manager, Tiffany, had an attitude the whole time we were there. She took a phone call and loudly took issue with whoever was calling. Then rolled eyes when only other customer needed something and she had to get up from seated position. Then my dining mate ask a question and you would have thought he asked for her weight. She openly took joy in reprimanding him (he simply said management must be doing something wrong when they're so close to the hospital and it isn't crowded during lunch). She was like \"I'm the manager and this place is always packed. You don't know what you're talking about\". Her outrage was clear. First he was talking to me, not to her. Secondly he is right. And thirdly, he more than knows what he's talking about as he's spent is life working in the resturant field, mainly management. She was out of line. Not our first time there and it's always dead. This place won't last with her managing it.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "eAilABANFxd1adq9gY9C-A"
  },
  "zz3H_5esPWHOe6Z-zntEzg": {
    "date": "2/26/2014",
    "text": "I really don't understand the reviews of 3 stars or lower.  This place has a fantastic ambience, great service and a beer selection that is second to none!  I mean come one, Cocoa Porter and Young's Double Chocolate Stout on the beer list?!  We sat at the bar and had wings.  Their menu says they are the best wings in Pittsburgh.  I have not had enough wings in P town to support that but I can say they were very good.  We had Hot (they were hot!), dry cajun and wet cajun.  I think the dry ones were my favorite.  Only \"negative\" is the street parking.  Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v2PkGI7MjkmyRzht2bMWQw"
  },
  "n5OM93ivewMbSGms3GlXhA": {
    "date": "10/18/2015",
    "text": "I've been to Sidelines in Millvale quite a few times. I love it there but it is small and crowded 24/7.    So now we're close to Sewickley and decide to give that Sidelines a try. Super excited! Great stuff on tap for my beer drinking husband and my cider-drinking self.   We go and there's, like, a table! So far, one up on Millvale. The staff is nothing nearly as endearing as Millvale's but they try.   The reason for 3 stars is two-fold.  1. It is so understaffed that instead of ordering another drink or dessert, we just asked for our check. Please get some more waitstaff! Your workers are drowning! Even though our waitress couldn't get back to our table more than once after food was served (total of three times during the night for initial drinks, food order, and then request for check), we still tipped well for her. It's not her fault that she's having to rush table to table and hope that she didn't forget anyone.  2. The food was just OK. It took super long to even get the food. I had high hopes for the burger as I love Millvale's. No where close. My husband got the wings. The sauce was awesome. The wings were small and seemed pre-cooked. Half-passing grade there.   I'll probably go back since they're close to our house and for the cider selection but maybe just stick to apps and wings.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "axsC3r21Udnrn1pjhRepCg"
  },
  "qFxIc2wubhoppktQ8n9I6g": {
    "date": "6/19/2015",
    "text": "Local sports pub with decent food and great draft selection.  The beer selection is awesome and regularly carries some of my favorites on draft.  The wings are pretty good although I'm not sure 'best in Pittsburgh' as advertised.  The rest of the menu is pretty standard pub food, burgers, sandwiches, some entree options; nothing noteworthy, but all solid options for watching a game with beer.   Thursday is all you can eat snow crab legs for $20, my personal favorite thing about this place.  Sidelines uses a seat yourself policy and sometimes wait staff takes a long time to notice someone has sat down.  This has happened 3 of the 4 times I've visited.  The wait staff is friendly once they get to you, but can be forgetful about getting menus, silverware, any requests that deviate from standard menu, which is why I'm giving the 3 star rating.  It's a great place to stop by and grab a beer after work and hang out, particularly during summer when the front windows are open. If only the service was just a bit better...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hn4BFBJnrqaBiTXC0lWLA"
  },
  "WqfkwQ9aN38EMCdTgwOE2Q": {
    "date": "11/25/2017",
    "text": "My rating is mostly influenced by the service.  The wait staff were all pleasant and working hard but they were clearly short staffed, on a Saturday which was baffling, and we waited over an hour for burgers and fries.  Food was decent but not worth such a long wait.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QNW4C_37CzJ1l2JXvaHxvg"
  },
  "Cn1ASvMpmhKG2oqHTbKvnA": {
    "date": "1/9/2017",
    "text": "The garlic Parmesan wing flavor is absolutely divine.  I'm going to watch some Kobayashi videos and return to conquer Rebecca's Revenge, which is some grotesque 5 patty burger with a pound of fries.  Their beer list is also extensive, and they have Fathead's Head Hunter on said list... sold",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2u_N2umWr3mBph452JANnA"
  },
  "-Yv3__unYBhvDHfSVL7vOg": {
    "date": "3/29/2015",
    "text": "Con: slowest service around. This seems to be a Sewickley thing. It literally takes a good 45-60 minutes to get food, especially when you order the special for the night (ex burger night on Monday). The place isn't huge but everyone working there always seems to be rushing around. We've said something a few times but they didn't seem to care much which may be the most irritating part. There's one lady who may be a manager who gets really defensive if you say something.   Pros: beer selection is good. The food is very good should you get it before your hunger goes past the point of recognition. They have fantastic wings and the burgers on Mondays are $6 and awesome. Wraps on Tuesdays are $6 build your own as well and are really good. Good atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aK7g13lvpwOnkniNtXbOiQ"
  },
  "B8XJz_lDe0G-hUQZSJ3Q4w": {
    "date": "5/6/2016",
    "text": "Although good, the soup was luke warm.  Everyone's fries looked (and tasted !) like grease - how do you mess up something so simple!!! Some burgers in the group were ok but one was very charred on the outside that you could pick the black stuff off.  Seafood roll was good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m2uTGkOKcXqQJSmvsYvtMg"
  },
  "moFWOY6-92sWU1TRVIZjHA": {
    "date": "10/24/2017",
    "text": "My most recent visit is the reason I am leaving this review. A short blonde hair kid was waiting on my wife and I's table. He was extremely cocky and disrespectful, paid no attention to our table, and even charged me for drinks I did not order. I have been here several times and my most recent visit will be my last after this experience. Very disappointing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8nMp69gEnlDArhJtPADzRw"
  },
  "TMrbArMf-qKbeheqBGQbkg": {
    "date": "10/10/2017",
    "text": "Sidelines is the best bar/restaurant in Sewickley Village by a mile. I've tried just about everything on the menu, and the food is consistently good.  While I love their burgers, wraps and fried pickles, their wings are arguably the best wings in the Pittsburgh area. They have a ton of wing sauces to choose from!  The beer selection is extensive and they have great monthly specials on cocktails (although I would suggest a grey goose vodka special every now and then).  Aside from the great food and drinks, the best part about Sidelines is the service.  The entire staff (shout out to Amie and Natalie) are the most welcoming and friendly people!  And I am truly puzzled by some previous reviewer's comments about the Manager, Tiffanie.  She is the best! She always greets me and my friends with a smile and has a great sense of humor. It's because of her that my friends and I keep going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NuO4ERdAP7HXbGAFJWpYfA"
  },
  "1X8pK1QxWa10oPQU5i6ATQ": {
    "date": "9/2/2019",
    "text": "Only reason I give it a three star is because the food is good, especially their chicken wings, and they usually have a good draft beer list. Tonight was a disappointment. They were out of bells two hearted and they their IPAs on their beer list. We had to order 4, yes FOUR, times to get our beer order correct. I guess the person was new but to come back to the table FOUR times to get our beer order right for 6 people was ridiculous. We would have left then if we weren't somewhat excited for trivia night. I usually look forward to this pub but the lack of average service is disappointing. The bar area is better but the wait for food is ridiculous, almost like they're \"forcing\" you to order more drinks while you wait. Besides their tasty wings, I've decided to spend my money elsewhere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r5iu6xjD9UEwSlAIiTmaNQ"
  },
  "-M2ndmVBI2bD_1F2lPW_Ew": {
    "date": "7/12/2019",
    "text": "Just mediocre. This was my first visit here but I don't think I'll be back. Food was just ok; both of our sandwiches were too greasy. Most of the fries were congealed into each other. The buffalo cauliflower starter was a neat concept, but poorly executed. There was far too much sauce. Also I know this is Sewickley, but I felt the food was overpriced for the quality. I don't think I'll be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VmRRY6ecwc1UqDwIfwwfnQ"
  },
  "no6FNYQjQGC15AecYncfWQ": {
    "date": "8/28/2019",
    "text": "We were a small group of six on a Tuesday evening after a run through Sewickley. We ordered beer from the list and waited for our waitress to return. When she did, we were told that all of the beers we ordered were not available, so we ordered different beers along with our food. She returned awhile later to tell us that these beers we ordered were also unavailable. Third time was the charm. At least the food came out correctly, although my receipt and change were for someone at another table. At that point, we all just wanted to leave. Unfortunately, this is not the first time this has happened to our group with poor and very slow service on a not so busy evening. Most likely we will be looking for another place to try.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "srBYOZh394Erl0npmPl1YA"
  },
  "PzEdvJ2lTYcg3iAA6ABpGA": {
    "date": "8/18/2019",
    "text": "Love sidelines but the food takes FOREVER!! If you're in a hurry or on a time schedule don't go!! Went tonight and waited over an hour for wings and it wasn't even busy. At the most fresh cooked to order wings should take a half hour not an hour. They were good but not worth the wait! And the bartender had a much personality as the pen I signed my credit card copy with!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8awbtmKlD_J2FOnx70JZtQ"
  },
  "ZU-s31hZITrSIe3-96VSfg": {
    "date": "6/13/2019",
    "text": "The waiter was amazing. The food was quick. And the Peanut butter and jelly wings were fantastic",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EKX_EQBVebeDiDoNyZRAfg",
        "caption": "Photo of Sidelines Beer House - Sewickley, PA, United States. Peanut butter and jelly boneless wings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EKX_EQBVebeDiDoNyZRAfg/o.jpg"
      }
    ],
    "user_id": "f-hL-QSYtI5EtjzOEcPwTA"
  },
  "OrRCJE6seyCayKR6cCGICA": {
    "date": "4/6/2019",
    "text": "So, we went here for the Saturday gourmet tacos and they were really good! We also had the pickle chips but ate them all before I could take a picture. So, I think that speaks for itself. Anyway, the bar area in warm weather is great with the open window concept.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8yuPb7xrrkx3zhmmybovtA",
        "caption": "Photo of Sidelines Beer House - Sewickley, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8yuPb7xrrkx3zhmmybovtA/o.jpg"
      },
      {
        "img_id": "xSHbprIlIYgblS9zDAsyoA",
        "caption": "Photo of Sidelines Beer House - Sewickley, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xSHbprIlIYgblS9zDAsyoA/o.jpg"
      }
    ],
    "user_id": "Ig5VKMfTGOWx_c6BOEGKRA"
  },
  "hyr8Qmui3YaKiMuy8wKE2w": {
    "date": "6/20/2019",
    "text": "Stopped in on a quiet afternoon for a couple of drafts. It is a beer house after all. Had my first and then a group of six sat at the next table over. The rest is predictable and according to script. The waitress got busy catering to the group and I never saw her again. So I left after one beer. This should have been the easiest '5' they've ever gotten. Instead it's the most unnecessary \"1\".",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "12bjmgnsy4p8yvlk60IN7A"
  },
  "NBc08_CyuInNeUdwDQdy5w": {
    "date": "4/28/2019",
    "text": "Stumbled upon this place and glad we stopped in.  we were seated immediately and the staff was very friendly and provided great service.  it was gourmet taco night and delicious!!  beer selection is good and restaurant had a great ambience.  looking at their menu, there was definitely something for everyone but was impressed by their daily specials.  seems to be good quality food!!  will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hPABI1F13P43ROFzMZusrg"
  },
  "ogpTkIvFYu_Mu4jbL6FgIw": {
    "date": "4/27/2019",
    "text": "Best way to make your service better...refuse service because of a critical review!  Wow, just wow! I am appalled.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "d-kQzEU-PRnVJrH4W5rXhw"
  },
  "vULZU_ICqeoIZ4cMJzFcnA": {
    "date": "5/8/2017",
    "text": "This is a really nice bar in the heart of Sewickley. I came for lunch and sat at the bar. It was pretty quiet but there were a few other customers on a Monday.   They have a really good selection of beers on tap. I got a coffee espresso porter and a Belgian style IPA. The prices are good too. The pint of he Porter was $7.50 and 10 oz of the UPA was $3.50.   The Turkey avocado wrap was tasty, and the fries that it came with tasted like they were fresh cut instead of frozen.   Service was friendly. They have several screens around. In evenings when there are games it looks like it would be a good place to have a drink and watch a game.   This place is highly recommended for those interested in good craft beers if you're in the Sewickley area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "E7RtGeFZ7sMESZyylQAwFQ",
        "caption": "Photo of Sidelines Beer House - Sewickley, PA, United States. Turkey avocado wrap with fries--$9 as a lunch special.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E7RtGeFZ7sMESZyylQAwFQ/o.jpg"
      }
    ],
    "user_id": "dz8CFWEWuR_4S1zlZhWCMQ"
  },
  "tedUtu_emNTzW1GT0ibRXQ": {
    "date": "11/9/2018",
    "text": "Not surprised by the low ratings.  Flew in for the Steelers' Game and walked to dinner with family. Waited over 45 mins for a table as they continued to sit others who walked through the door.  Never tried the food, we left after we were asked to vacate a table so they could sit someone who just walked in.  We had ordered a round of drinks but apparently were not allowed to sit while we enjoyed them, only stand in the doorway which has got to be a fire hazard.  They have NO wait area.  Do not waste your time, you will be disappointed  The waitress/hostess was extremely rude, had no manners.  Ended up walking around the corner to 424 Walnut and received excellent service and food.    Also, tried Yama Japanese and their Sushi was fabulous.  Had Breakfast at Cafe des Amis and again great food and portion sizes.  So many other choices with excellent service.  I will be posting positive reviews on their websites.  Sewickley is a wonderful little town to visit.  Wow, wished I had read the reviews before we went here.  Pretty much everyone felt the same way we did.  We would of avoided this place, if we had.  The waitress was just nasty, zero customer service.  Will let our family know that lives there to check the reviews.  Whoever owns this place, is clearly not reading their reviews.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UCf7smm_vxrrB47ICMR0eg"
  },
  "Yppl97tpXnX8B8Tyopz2IQ": {
    "date": "3/30/2019",
    "text": "The barstools are too short for the bar. The bartenders  are not educated about the beers on tap. We got a 10 oz. pour on a low Abv/mediocre beer due to what were were told was a concern on cost. We didn't bother to eat. Will not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QUhEAgPJhr2SgGIcmc5zcw"
  },
  "OCJbKkOUxqdPXZwYaxwKHg": {
    "date": "5/19/2018",
    "text": "Waitress #1 told us to wait a second for a table and disappeared. Waitress #2 then appeared and same thing. Waitress #3 next arrived and asked if we've been waited on yet (not sure if that's a yes or no)... wife went with a no and then she proceeded to identify a table... as we were headed to the table, waitress #4 told her that there was a wait and that that table wasn't available (place was fairly busy but no line and several tables empty).  A lot of discussion ensued between the waitresses (chaos) and finally we were seated at that table.   Got the wings and a fish taco (tacos are on special on Saturday at $4/per) and wife got a grilled buffalo chicken sandwich. My wings were pretty good, crisp, but really lacked on sauce (no sauce in the bottom of the basket or anything). Up charges for both ranch and celery (just 4 pieces of celery no less). Taco was oddly big, more like a small burrito, decent. Wife's GBCS tasted like they don't clean the grill.  Fries looked dainty but my wife said they were pretty good.    Beer list was good if it was 2013 but nothing too exciting in 2018 (nothing local). Prices weren't bad though.  Overall not terrible but I'm not itching to go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SZzV3W5UoMDlOHCm1PV7pA"
  },
  "1a36i_zE_ylNwycJ86oIYg": {
    "date": "5/3/2018",
    "text": "I've tried this restaurant multiple, multiple times and every time it's a bad experience. They have done everything from burning my food to giving horrible customer service and everything in between. Every time it happens I tell the manager and they encourage me to come back and they promise my experience will be better next time. And time and time again I'm very disappointed. After this last time today I highly doubt I will ever go back. This restaurant should be ashamed of themselves!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1gJw6DxTrf0Zmp9gDgYlrQ"
  },
  "cRny7hqDtWvMLU0C1Yo_CA": {
    "date": "7/16/2018",
    "text": "While we survived our first visit to the Sewickley location we won't come back. Food is mediocre at best but more importantly the service sucked. The water tasted really bad, they forgot my beer and asked couple times what I ordered. Service was unnecessary slow for a Monday night.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "27-ipS8hVlSExXga1HDBXA"
  },
  "I8nZHskIQQgjJCemLoSVgA": {
    "date": "10/1/2017",
    "text": "Agree with Susan B.'s review of service: Tiffany, apparently the manager, had a huge attitude from the second we asked her to turn up the Steelers/Ravens game. It was palpable and you could hear her sarcasm with every further interaction.   Food: the nachos were cold. That's cold dripping cheese, my friends. I ordered an Irish coffee and the Baileys curdled. The gentleman next to me acknowledged that the Baileys itself tasted \"soured.\"  They claimed to not have any more Baileys. That evening around 11pm, I became very sick with food poisoning. Was it the sip of soured Bailey's? The buffalo chicken wrap? The ice cold nachos? The beer cheese pretzels? Tiffany's revenge? We'll never know. But I guarantee you it came from Sidelines, and I promise you I won't return until Tiffany is no longer the manager.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xBTyPHI7jVRAH08i_uhZ1A"
  },
  "iiWQBFFopRdVC0w9jfE2dQ": {
    "date": "2/23/2018",
    "text": "Not gay friendly at all bartender bragged about driving transgenders away because they wanted to use the female bathroom... food is obviously not fresh and bought at the store.... great selection of beers thought the waitress had to tell us the several that were no longer available but they haven't the time to update their beer list....",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LQrkhlBReTeGMvC2z7cYtw"
  },
  "zDh2xXxehJpGs3i7b451Cw": {
    "date": "5/12/2018",
    "text": "I used to love sidelines but the picture speaks for itself. Asked for a MEDIUM WELL burger and get this and even if you asked for a rare burger it should be more cooked. This was seared at best.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oawsGObyueOonlVFx3jbFA",
        "caption": "Photo of Sidelines Beer House - Sewickley, PA, United States. Medium well",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oawsGObyueOonlVFx3jbFA/o.jpg"
      }
    ],
    "user_id": "OypRa8Vn2PVfNvOjbsIynw"
  },
  "sVKtP4yFml8n3VZxBAjgsw": {
    "date": "5/3/2018",
    "text": "What a great hometown bar! everyone knows everyone, but they still welcome new faces. Was in last night and the staff was excellent. Very friendly and knowledgeable. Will definitely be back every time I'm in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cbm29ZqvuXvDVw3cf1buTg"
  },
  "P4UxEb-vJ04v-4w3Fs366Q": {
    "date": "3/24/2018",
    "text": "We went to dinner here the other night the waitress wasn't friendly at all. She got all of our food wrong. It was a Huge disappointment not going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CzHI7bjdvjS9CC7w_rgcMQ"
  }
}