{
  "swn8KjeWXTqrkzbNlCBAxg": {
    "date": "11/10/2017",
    "text": "Charming little breakfast/lunch counter with fresh veggies and well-sourced meat... and lots of quirky personality.   Also, best coffee in Bloomfield BY FAR!!! I'd definitely recommend stopping in here instead of Crazy Mocha before your morning commute.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "t9mJdia0o-sjl5ZxMMfW9w"
  },
  "dlnnBL3lQ1LA7agfreRZOA": {
    "date": "11/10/2017",
    "text": "This place feels like walking into a warm hug. Super friendly staff, cute furniture/decor. I can't wait until I have a weekend free to bring a book and order multiple rounds of magical sweet treats. I always love a place where you can watch people prepare things right in front of you. The first time I went I had an egg sandwich and a side of charred squash. Both exceeded my high expectations. I then also had apple cake which blew my mind.   I used to go here a lot in grad school when it was the Sandwich Shop and drunk-eat pancakes at 2 am. I'm so happy to see this spot in its current iteration to match my more... grown-up lifestyle.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f7Ds_py9tuQSC9VhuvRhew"
  },
  "8oSJGSxIozq2hYhPF8x5fQ": {
    "date": "6/26/2018",
    "text": "Stopped by for breakfast. Good options for the vegetarian crowd. Had a donut, a veggie hoagie, and an egg sandwich. Very messy with lots of greens, but all delicious. Bread is great quality and fun to see it cooking at the back of the restaurant. Kind of reminded me of the quiet storm (dating myself there), in terms of atmosphere of collected 70s kind of stuff. Would have liked a different coffee choice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "emHfTOT1Ps7WgBmac9i15w"
  },
  "fWeit2zlSZ_8ns5gqE4hzA": {
    "date": "12/2/2017",
    "text": "AMAZING. Went twice in 2 days- soup sandwiches potatoes iced tea- everything is fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sQkzMnJfFmcz5cS4As95Vw"
  },
  "Ue9TElefkUcdkF6mztNhRQ": {
    "date": "12/7/2017",
    "text": "I've never posted on Yelp before but my experience here compelled me to do so. My $6 + tip vegetable soup, which I got to go, is in a container that is less than half full. Not to mention it is the most tasteless thing I've ever eaten and that is not an exaggeration. On top of that, the service was slow. I will not be back.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "eOBto5rMdXpQwBrVF_41GQ"
  },
  "gRd4Kkxn7_x3OmAQ0Q8e9Q": {
    "date": "4/4/2018",
    "text": "We were really excited to check this place out. Had coffee, scones, donut, griddle cake, and veggie hoagie. Everything tasted so fresh, really complementary flavors. Space is quaint, great colors, home-grown feeling. Wished I didn't live 5 hours away from this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JnYLRQCEBofiqNC4bFa_XQ"
  },
  "kV3Or4a3YfqlON4l5EDIRQ": {
    "date": "2/23/2018",
    "text": "The food at Bitter Ends is easily some of the best I've ever eaten. I just tried the breakfast hoagie and chicken sandwich and there was an incredible amount of flavor packed into every component of both. Check it out, you will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tDKg3L-xt-iu2V0FqiLsfA"
  },
  "ZEYK0qqvnvDDzrTZlF9pPg": {
    "date": "1/26/2018",
    "text": "So happy there is a place in the neighborhood to get a great veggie sandwich!!! Service was quick and friendly and the atmosphere was cheerful",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DqaWQLI6KVfMvN6AO-6XQQ"
  },
  "7ohlcMNgAv1nnHYWekcSJw": {
    "date": "1/10/2018",
    "text": "Scrappy little place.  Just had their breakfast sandwich and coffee.  Very flavorful sandwich with lots of greens, egg, thin sliced potato and baguette like bread.  Very good coffee. Reminds me of Brooklyn.  Love this type of place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Env01nUVvjyK0nSaPWU3Ig"
  },
  "xrG6YrY_5GiZ5lPjQdLk5A": {
    "date": "12/7/2017",
    "text": "I've been wanting to stop in at this new luncheonette with farming roots, but kept missing their schedule.  Today I finally got to see the inside and ordered coffee and a veggie hoagie to go.  The veggie hoagie is a standout - the flavor coaxed out of each element was really well done!  Too often a veggie sandwich is a gloppy formless monolithic thing, but this bread was substantial (held up until lunch time, and didn't get soggy), and you could discern the distinct textures and flavors of pumpkin, radishes, carrots, and a lightly dressed lettuce and herb mix.  I loved it.  The folks inside were delightful, too.  I will look forward to returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bafAoNxKMnbPU2mZcAGxWQ"
  },
  "S-u1anT024Dy3hfPwBfbng": {
    "date": "12/22/2017",
    "text": "Love this place! Quaint little cafe / breakfast spot with great food and coffee at a good price point.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mhgc5aEQ4TiJIC0tYK3ZYg"
  },
  "gAh3TO8tC4U-mHPO8REclw": {
    "date": "1/9/2018",
    "text": "I absolutely LOVE this place and I can't wait to go back!   I was so excited to check this place out when I heard it was opening. The owners have an organic farm just outside of Pittsburgh in Verona. I spoke to the one owner when I was there and he said what they are not able to grow or make themselves, they try to get from other local farms or vendors. A great way to support local! They make the pastries, the bread and anything else they can.  We both tried a breakfast hoagie, mine vegetarian and my partner's with sausage. The sandwiches came out topped with greens tossed in a light vinaigrette and shredded parmesan cheese. It was fresh, it was unique and it was absolutely delicious. We split a side of breakfast potatoes which had bits of toasted up bread on top to give it a nice crunch. We also split a ginger chocolate glazed doughnut because I couldn't pass that up. I don't have a huge sweet tooth and I couldn't get enough of it. One of the best doughnuts I've ever had--crusty, flaky and a perfect hint of ginger.   The menu is small, so I wouldn't recommend it for super picky eaters or someone looking for a traditional diner bacon-and-eggs breakfast. Some folks might think it's expensive if you compare it to...say...Denny's...($30 for what I described above plus a coffee and tea)...but believe me, you are paying a few extra dollars for GREAT quality. It's quite a small space, so expect to wait a little, but I promise it will be worth it!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "5IaHGddT0RLq1-S5LbP1iw"
  },
  "Oa32oL9zUmxTnaa0rXZtxA": {
    "date": "5/28/2018",
    "text": "I only have fantastic things to say about this dive of a diner! I'm a huge breakfast/brunch foodie and my breakfast here on a Sunday morning was hands down the best breakfast I've had in Pittsburgh. I had the bottomless coffee (in a quirky mug selected from the mismatched mugs), an egg breakfast sandwich, and a whole wheat doughnut. Everyone who works here is so pleasant, making the entire experience just perfect. I absolutely want to go back and experience seasonal menu changes. PRO TIP: Parking in this area is free on Sundays!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Cur0Lj4qA3Pp6NaAFsX4AA",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Cur0Lj4qA3Pp6NaAFsX4AA/o.jpg"
      },
      {
        "img_id": "SFdoM46Td1MTE2ePuQTmbQ",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SFdoM46Td1MTE2ePuQTmbQ/o.jpg"
      },
      {
        "img_id": "pWe3iBJhXlcb9JFLBer4WA",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pWe3iBJhXlcb9JFLBer4WA/o.jpg"
      }
    ],
    "user_id": "KVCwoGrS_zhmvzauEfat-Q"
  },
  "lwQJlPgR3iA2nVLCijqxdg": {
    "date": "7/26/2018",
    "text": "Interesting little Shadyside option.  Very good lamb sandwich, limited seating.  Love the atmosphere and staff!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Q0FESf36rmp6g-A77bo1Tw"
  },
  "XyQTEsNyN0EL6Gk7sep3yg": {
    "date": "12/15/2017",
    "text": "I really want to give this place more stars but I just can't.   The food is good but nothing magical- I tried the egg & sausage sandwich, the vegetarian sandwich, the vegetable soup, and the cabbage and apple salad.   The place itself is very small and intimate, which I like but the seating itself is awful! The benches are wobbly, small, and not confortable at all and one of the tables is positioned so that the bread rack is right over one of the benches making it easy for someone to hit their head (like my mom did)  If anyone from luncheonette is reading this please invest in new tables and chairs!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "war8vMvCDNuVaB5FQ-ObcQ"
  },
  "2KcHJGoOth8XmHpKEJKZVw": {
    "date": "7/2/2018",
    "text": "I believe the reviews of this place are overrated.  It's okay but the food is overpriced.  The staff are nice but I I think if your not a vegan who wants to go to a vegan restaurant with options, it's pretty much okay.   Portions are small.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tTmw7gQyXbukvysBBcbvHA"
  },
  "Pgl5MXpU9pBZ5g4BxfztyA": {
    "date": "1/28/2018",
    "text": "Really cute place! The food is made with fresh ingredients and the staff is really friendly and attentive! I had the chicken salad sandwich and winter tea and both were delicious. I was there until they closed and as I was leaving they gave me a bag of donuts for the road on the house- so nice! There is very limited seating as it is truly set up as a luncheonette.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N8XXNR8bGMFWF1G4FKVV2g"
  },
  "NDci7GY7_67GF6CLG2q7hA": {
    "date": "4/29/2018",
    "text": "The sandwiches here are awesome. I also appreciate the super hipster vibe. However, the extremely limited menu leaves something to be desired. I consider myself a foodie and will eat anything but I would like more than 1 or 2 options for lunch.   This place is also super expensive. I am all for paying more for quality and ingredients. But I cannot justify coming here for lunch weekly and spending 12+$ for a small sandwich with no side. A lunch with a drink and side are over $20.   Overall the food is 4-5 stars but the prices and lack of options lowers my rating.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "a0-Lv095eNh5r5ghtl7d4g"
  },
  "g4lQAikq3unmAzK0jmGtlQ": {
    "date": "8/5/2018",
    "text": "The tomato sandwich, cucumber salad, and French toast were all fantastic. Everything, from the bread to the vegetables, was the absolute freshest and full of flavour. If we lived in Pittsburgh, we'd come here once a week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "58IVproJ3YRICFEZt4b6Yg"
  },
  "1c3cZQkjDrhnWuvlH6dCCw": {
    "date": "11/13/2017",
    "text": "Had such a fabulous lunch at Bitterends--was so happy to see their new spot in Bloomfield! I was always drawn to their stand at the various Farmer's Markets around town, and often heard friends rave about their food. They weren't kidding. Everything they make it simple, fresh, and SO flavorful. They take it back to basics and truly prove that it's all about quality. I believe just about every single thing on their menu they grow. Their new store front is super quaint. Order up at the counter, menu posted up on the wall, with one little table + four chairs, some counter seating for eating, and a long bench along the wall for seating/waiting. For lunch I ordered the vegetable soup, vegetable hoagie, smashed potatoes, and iced sumac tea. 10/10!!  Portions were small and the items were pretty basic, but everything was cooked to perfection. The soup was more of a veggie broth, with a few onions and potatoes. Crazy how something so incredibly simple could be so good. Not sure how the soup is seasoned, but it was fabulous. The vegetable hoagie was chock-full of flavors, fresh + toasted to perfection bread, some awesome vinaigrette, truly so simple but amazing. The smashed potatoes too were just perfect! Even the flavor on those was different but so great. Great spot for lunch, so happy to welcome them to the neighborhood! Will definitely be coming back regularly. Oh staff is so sweet and welcoming as well. Tons of different baked goods, coffee, etc. Welcome to the neighborhood, can't wait to be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "HdEM0xeldw4QAweECyOwcQ"
  },
  "kw8H5awdISnoZeba-j8q6Q": {
    "date": "6/12/2018",
    "text": "Amazing breakfast but pricy. If you are going to treat yourself- do it. If you don't like sitting near people- don't go here. I give all edible places in Pittsburgh a 3 stars but this was memorable. Not a big plate of food- but I really don't need that. I am still gaining baby weight and Dani had the baby over a month ago. If you are still hungry after eating here- grab a box of Cheezits. Or Goldfish. I mean seriously- those things should be illegal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3yqfsTxMeoSNxFY4JGkD4g"
  },
  "fioF6xsNqRkB_8UNi2K5uA": {
    "date": "6/15/2018",
    "text": "This place is everything. Becca's vibe makes the neighborhood more real. Love you kids.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "83_TeCRisRdbyziA4m_nOQ"
  },
  "DKdf9U51J2cBeRr1_ja8kg": {
    "date": "12/29/2018",
    "text": "I went here for breakfast, it was pretty frickin awesome. They accidentally dropped my breakfast sandwich, but then made up for it with a delicious donut",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gxgpTIbg2LBColfcVFKWkA"
  },
  "HsbzAsesxBxrQFmRwVAjaQ": {
    "date": "12/28/2018",
    "text": "I made a point to go for lunch after recommendations from some foodies.  For the good, the ingredients are all pretty much spot on and the balance of flavors is great.   The bread is exceptional. I For the just ok, the place is exceptionally small with a very limited menu. The staff all seemed friendly but the vibe was sort of distant and funky. Three sandwiches and no drinks were $34 which was fine with the ingredient quality. Overall really good sandwiches but the limited space and menu probably make it more of a novelty than a standby.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WXdt0CMbwpF6gSYjigvz2g"
  },
  "SVaArePJg7R7uohdPLjRdw": {
    "date": "3/3/2018",
    "text": "I would eat here everyday if I could. The food is simple but astonishingly delicious. Many things have micro greens and thin sliced onions and some sort of magical vinaigrette on house made grilled bread that will put a huge smile on your face. It's small but we didn't have trouble getting a table and the people are lovely.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "ME1-IwMQMHkowOxffKUx7w"
  },
  "cAq5GNEC1ZXh_NJI929a_Q": {
    "date": "4/29/2018",
    "text": "Great local spot for breakfast. Staff was friendly even though the little place was packed. We had the French toast and sausage breakfast sandwich and both were delicious. Coffee was served in the mug you grab off the shelve of unique ones.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gWFpCQCuOAQsH4fuo_wYJA"
  },
  "LX3snA8-s6IZzTPo9RPy6A": {
    "date": "12/6/2018",
    "text": "I had the squash, goat cheese and egg sandwich. It was wonderful. Quality ingredients combined perfectly. So yummy. This is my new favorite lunch spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U7sFGJ2KXIuCU6LCVM-JxA"
  },
  "BHCO26Y5934mwppERWHTow": {
    "date": "3/17/2018",
    "text": "A friend and I stopped in for lunch and were pleasantly surprised with great food, strong coffee with refills, and good vibes. Will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qU6WVAAHIgaQSnlcT7ppgQ"
  },
  "6L457-zPLHwTAlBiW09Jww": {
    "date": "11/10/2017",
    "text": "This place is amazing. Charming space, hilarious staff, and some truly great food, whether it's a donut and coffee for breakfast or soup and a sandwich for lunch. Places like this are rare and special, don't sleep on it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "8BZJ9u_t9jmE7LKRTmqSQA"
  },
  "QD12SvscKs5-txt9-WNtPQ": {
    "date": "12/17/2017",
    "text": "A yeast and carb driven wonderland! Each dish my husband and I tried was creative, vegetal, and generously portioned. The well seasoned potatoes and leek frittata sandwich between two slices of masterfully perfected Tuscan bread were delightful. Also a highlight was the carrot glazed yeast doughnut...spongy and sweet goodness... a little less impressive was the vegetable soup, the stock fell flat despite the wholesome sprouts and radishes lovingly lavished within. The decor is shabby making space for the food and warm friendly service to take the center stage.  We will be back and thanks luncheonette for the great experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TI7EgTsD2_3mSkL0dK-grg"
  },
  "rnd191ZZw7xjRT1Zw_MGuA": {
    "date": "7/8/2018",
    "text": "Food is delicious especially the sausage egg sandwich.  The prices are really high so it's not a place you can go daily.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGAzg3eD07AKbQLX_psfbQ"
  },
  "Sghol11spJcLiZNSf4z7ww": {
    "date": "8/15/2018",
    "text": "The health conscious palate will fall in love. The food here was so fresh you'd think someone plucked the lettuce washed it and stuck it on the sandwiches. The bread was delicious and the service was prompt and very friendly! You definitely pay for the lifestyle you're committing to here so I can't see myself frequenting this place but if I wanted something tasty my body wouldn't hate me for I'd have no issues here. I tried their donut because the tomato component had me intrigued, I would consider that decision a very expensive mishap. It tasted like rolled up and whole wheat toast covered in frosting. Now, to be clear, that might be a taste you like but for me  I want to leave a donut feeling guilty, not like I just did a fiber flush...to each his own. Very tasty overall!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QyR0611kQ3ASniWfeeilEw",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QyR0611kQ3ASniWfeeilEw/o.jpg"
      },
      {
        "img_id": "q1eGQlXiInuSroNAhFnTPA",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/q1eGQlXiInuSroNAhFnTPA/o.jpg"
      }
    ],
    "user_id": "gwUNrClCimj5Tk4lRmrPSQ"
  },
  "4nEYGYWOmMISLZMJmP7RsQ": {
    "date": "3/17/2019",
    "text": "I'd been wanting to check this place out and when I finally went it was not what I was expecting. While the food was good, it was over priced in my opinion. It is very small in there with only a few tables. You order at the counter and seat yourself. It has a dive diner feel which doesn't match its high priced menu items. The food was good, however I will not be back.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qXH33niWN2UxVB-MueCNDA"
  },
  "1n2TWJHb_oPCFF2KJMaF6w": {
    "date": "12/16/2017",
    "text": "Really enjoyed the breakfast and experience at bitter ends! The place is small and cozy, with the kitchen in full view. We were welcomed and directed on how to order by Sarah, who was super helpful and attentive. We got there right when It opened and could sit right away, but with limited seating It did start to get crowded by the time we were finishing up.   They offer commonplace coffee - yum! And you get to pick your own mug from their collection, something different that I thought was super cute! We ordered the sausage sandwich, the veggie hoagie, smashed potatoes and the bread pudding. All were delicious! The homemade bread really made the sandwiches. We ended up ordering food to go as well!   The menu said It was a daily menu so I am excited to return as see what the will offer next!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sp6UTMHajjmZ5rYA4qLrcQ",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sp6UTMHajjmZ5rYA4qLrcQ/o.jpg"
      }
    ],
    "user_id": "7wAdctG3920KcBLSVXlZdQ"
  },
  "lI5Gk2tL2Xcbh7x8jjWP7Q": {
    "date": "6/20/2019",
    "text": "Delicious and quirky. I had the sausage and egg sandwich. I have no idea what they dressed their salad greens with but it was delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y7Q-VHOon91K4wq9kkqWXQ"
  },
  "i6w4XRlN5Da7BQRDN3dFRQ": {
    "date": "12/16/2018",
    "text": "Great little joint with creative, inexpensive food. Maybe 5 seats at counter and only 12 more seats at the tables inside. Check the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "tR12WeWha2DGhUrKcvTttQ"
  },
  "UkR9cEc6pFNdXdIFyag6tQ": {
    "date": "4/9/2018",
    "text": "I don't know what my favorite thing about this breakfast spot is. Maybe it's the early morning hours in the cozy atmosphere. Or sitting at the bar and watching your egg cook to perfection while you drink coffee out of any quirky mug of your choice. Or maybe its the fresh made bread, locally grown produce, delicious and meticulously made morning pastries.  I really love the egg sandwich and the dressing on the salad and the freshly shaved cheese that is piled to a mountain on top.  Breakfast here is the greatest, alone or with a friend. It's all my favorite thing.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 7
    },
    "photos": [],
    "user_id": "xhVlmdU1sPVH6GBJw6AZtQ"
  },
  "gIDN7XcKfcqtdo_-eiHHxg": {
    "date": "1/27/2019",
    "text": "EXTREMELY good and cute! You choose one of their eccentric mugs for your coffee and tea and get free refills. The sandwiches are so good, with lots of vegetarian options! I've tried the breakfast salad and the squash goat cheese and egg sandwich and both were super delicious and filling. They make the bread in house and it's quite crusty good. It's a little cramped, especially on weekends, so the only downside is you can't linger for too long. Could not recommend Bitter Ends more highly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x9nQbcpKEFcs5Q2fCUGDng"
  },
  "0SjqSRzEJX5LJoV9XCwqhQ": {
    "date": "5/25/2018",
    "text": "This is my second time eating here, and it is absolutely delicious. So far I've gotten the breakfast hoagie, the parsley donut, the griddled potatoes and the hot herbal tea. All of them - delicious. You really get that farm fresh feeling when you eat here, plus, I love the cute decor that makes me think I'm eating at my great grandmother's house (complete with kitschy mug selection).   The *only* thing I wish is that there was a larger menu, but considering the size of this place, I completely understand why it's relatively limited. I also wish it had longer hours, since I hardly find myself in this neighborhood at this time of day, but considering it's a \"luncheonette\", I get that too.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "eBtIBKFZisY13016QyrSLw",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eBtIBKFZisY13016QyrSLw/o.jpg"
      }
    ],
    "user_id": "iNO-rT-7tFhFIAqXA82QcA"
  },
  "ghHKpHzMagVV7beOEItTbg": {
    "date": "5/18/2018",
    "text": "Nice little space on the main drag on Liberty Avenue in Bloomfield. Their sandwiches are really tasty and full of flavor. The place's ambiance and decor is very hipster.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WkMcbrdnK-XSvjix0QmanA",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WkMcbrdnK-XSvjix0QmanA/o.jpg"
      }
    ],
    "user_id": "MyHcEGnIx5BFJF6PfSzOPA"
  },
  "CBewj4-FS-QbqQJCDFHBQg": {
    "date": "10/7/2018",
    "text": "I had an incredible breakfast here. The pumpkin parsley donut was spongy and rich and had a flavor that I've never had before. The breakfast egg and cheese sandwich on toast with greens was salty and eggy and I didn't want it to end. The place is tiny but I managed to get a seat by myself at the counter. I can't recommend this place enough. It's a gem.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "h5e3Lt-rkc4l0rL_J31XHQ"
  },
  "FBeXLueelMXZT_OjsmsKfQ": {
    "date": "9/6/2018",
    "text": "What a unique, healthy and tasty menu! We ordered the peach and black bean toast, honey and goat cheese toast, the potatoes with bread crumbs, the veggie hoagie and the donut with plum sauce. What a delightful assortment of tasty vegetarian ingredients perfectly balanced - the vegetables were fresh, the bread was delicious (and hardy), and the light vinaigrettes helped bring all the flavors together. I loved that I was eating beets, eggplant, black beans and peaches all at the same meal and that it all went perfectly together!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "cgecfJZ46npwKX2iOIbVWg"
  },
  "4hf1zRHDf_JcFhV3-_ctUg": {
    "date": "7/27/2018",
    "text": "So f*cking good and simple and beautiful and delicious. I've got nothin else to say about it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "np3K2dKr5QBSg7RrX0yx_Q",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/np3K2dKr5QBSg7RrX0yx_Q/o.jpg"
      },
      {
        "img_id": "PXDKAz-HXdYOUyNr2URa_w",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PXDKAz-HXdYOUyNr2URa_w/o.jpg"
      },
      {
        "img_id": "j-MfvBEEGGGcLRAD1U9_1g",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j-MfvBEEGGGcLRAD1U9_1g/o.jpg"
      }
    ],
    "user_id": "zuoNOQcSJT8igbbMx89kBg"
  },
  "6_I1ffhdpkp3RAtCi6_C9A": {
    "date": "6/21/2019",
    "text": "My favorite weekend brunch. So good, so healthy with all the veggies, such amazing bread. Love the decor, it is the cozy brunch spot I would envision myself opening in my head, except they really did it! The coffee cup situation is so cute. The only problem is that I can never get there early enough and by the time I do, half the menu is crossed off. Is there any way you can order more food?!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "a_tIaNF2OSVvI5gpVDKdhA"
  },
  "IABUytwj13onXNeaScLuFg": {
    "date": "6/7/2019",
    "text": "Heard a lot about their donuts and finally tried one.  It was very good, but unless you are purchasing it in Times Square, or on the Champs-Elysees, it should not cost $3 for a singular donut!  And it wasn't oversized by any means, average to below.  Yes it was better than Dunkin, but not 3X the price better on a single donut.  Doubt I would be back at that price level.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YjD68kl7Qzbnj5u_wjhCnw"
  },
  "LzgwXAVU1W_nRdJZHkjaNg": {
    "date": "11/8/2017",
    "text": "Nice little spot opened up in the old DJ's sandwich shoppe.  Open for breakfast and lunch Wednesday thru Sunday.  They use fresh farmed veggies from the Bitter Ends Garden.  Small menu with 3 sandwiches, some pastries, bread, and dessert.  The menu today had a beet sandwich, a veggie hoagie and a egg with spinach and you could add lamb sausage on the menu along with a couple types of scones and a pumpkin desert.  Only about 10 seats and a church bench; the same as DJ's. I had the egg sandwich and a ginger scone.  Both were very good.   Nice little place that adds to the neighborhood.",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 14,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "bkro7luXd3y2At74qh69gw",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bkro7luXd3y2At74qh69gw/o.jpg"
      },
      {
        "img_id": "ijN0X7rNm7n5_kayAy1QbQ",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Ice tea",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ijN0X7rNm7n5_kayAy1QbQ/o.jpg"
      },
      {
        "img_id": "JYa3KUeCnYJOzSRdasLrZg",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Ginger scone",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JYa3KUeCnYJOzSRdasLrZg/o.jpg"
      }
    ],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "elgy6q39AMMOWyNTo5KNvA": {
    "date": "11/7/2018",
    "text": "Before coming here I had heard plenty of great things about this place. I was eager to try it since it replaced a longtime favorite local spot, DJ's Sandwich Shoppe.   My friend and I got the sausage sandwich, coffee, and a pastry. The sandwich was just gross - the bread was so over-toasted that you probably could have seriously injured someone with it... had it not been soaked in a puddle of grease which had accumulated from a single pathetic, shriveled sausage patty. On top of the patty was a haphazard mess of greens drenched in some kind of sweet vinaigrette that mixed in with the yoke from a slimy fried egg.  The pastry wasn't memorable in any way - I don't even remember what it was. The coffee was some over-priced crap from some hipsters in Lancaster.  Given the rave reviews and the fact that it replaced one of the best sandwich joints in the city I felt personally attacked by the lack of dignity the owners had serving people these sad sausage sandwiches and passing it off as elevated brunch. In reality, this place is more of a bougie middle finger to the residents of Bloomfield. I'm really surprised the locals haven't run this place out.  If you live in one of the new loft-style apartments that are popping up and/or enjoy the thought of pricing your neighbors out while cackling over a wet, sad excuse for a breakfast sandwich and hee-hawing about your tinder hookups then look no further, head on down to the LuNcHeOnEtTe for a fancy brunch.",
    "rating": 1,
    "rated": {
      "funny": 7,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "EX6kEt2atiTPF5-qR0PmEg"
  },
  "BoDIequxq3ERE1gXly7_JQ": {
    "date": "1/17/2019",
    "text": "I've been meaning to check out Bitter Ends for a while and finally visited last week for lunch with a co-worker! We visited on a Friday around 12:45 - it was pretty crowded! Keep in mind this place is quite small, so seating is limited. We ordered our food and a table was ready for us in about 10 minutes- which wasn't bad at all. I went with the chicken sandwich (braised chicken, cabbage and apple slaw, special aioli $11), my co-worker went with the egg & cheese sandwich (sunny egg, lettuce, aged cheddar $9) and we shared the goat cheese & honey toast ($5). The vibe here is like your sweet granny's kitchen. It's just plain adorable in here. I love that you can watch the employees make the food and the smell of homemade bread just fills the restaurant and warms your soul. Water is self-served and they had plenty of silverware and napkins on the table. One of my favorite things about this place is if you order coffee to drink at the restaurant, you can choose your own mug! So cool! Service was super friendly- like REALLY friendly, which made me feel so at home. Now to review the food- we both LOVED our sandwiches. They were so decadent, so buttery, and the bread was so crispy and delicious. They were also very large and filling sandwiches, making the price just right. We honestly didn't need to eat the goat cheese & honey toast, as the sandwiches were filling enough, however I'm glad we tried it. They were really generous with the goat cheese, making it a killer deal at $5, however, I do wish there was more honey or a jam or something to compliment the goat cheese. Overall, we had a really nice time and our bellies were super happy and full when we left. I am looking forward to coming back here soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "A7Zk4ywGNROeAA-plmbaZw": {
    "date": "11/9/2017",
    "text": "This place is so quirkily (is that a word?) quaint! Little quick eats breakfast and lunch joint. Delicious Commonplace Coffee is available, and the best part? You get to choose your own mug from a selection of silly options.  You kind of feel like you're just hanging out in someone's kitchen, not a restaurant. Minimal seating, but I think that's an asset as it gives the location a cozy feel.  Their baked goods are on point. I haven't tried a sandwich yet, but that's next on my list to try. The farm fresh eggs looked to be super yummy and the freshly baked bread is on display for everyone to see.  Definitely try this place out!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ih2nozOyFddo3PGM-VFe6A",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Choose your own mug adventure! A ton of quirky mugs to choose from for your coffee!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ih2nozOyFddo3PGM-VFe6A/o.jpg"
      },
      {
        "img_id": "OIhbTd8yEyVQ3_zFSm3i2Q",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Current menu (11/9) including Pickle the dog!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OIhbTd8yEyVQ3_zFSm3i2Q/o.jpg"
      }
    ],
    "user_id": "Z3f78GereM3pspS5Yqjlqg"
  },
  "-uqLEE860X5rQKaUf4RA0g": {
    "date": "5/2/2018",
    "text": "This simple, thoughtful, playful restaurant has provided me with the best couple meals I've had in Pittsburgh recently.  The space is small, but well laid out with a counter and a couple tables.  Both times I've gone on a weekend before 10 am and didn't have to wait for a seat as a party of 2 or 3.  It's a charming combination of rustic and your weird aunt's kitchen from 1962 that hasn't been updated.  The music has been consistently bumping.  The food: yes, the menu is limited, but I would much rather have 12 phenomenal choices than 50 mediocre ones.  You can tell that each dish is built around its ingredients, which are all top notch and beautifully highlighted by the Chef's balanced preparations.  Whatever the griddle cake is, get it (turnip and carrot were both equally wonderful, like a fat pancake full of tender root veggies.  I know it sounds weird but it works so well).  The smashed potatoes are a vingarey delight.  Every pastry has been a fun surprise: none ever too sweet and always highlighting some flavor other than simply sugary.  The service: On my second visit, I was greeted like a regular.  You can watch the Chef run her efficient line, and just tell that everyone who works there seems to being enjoying each other and the food they're putting out.  There was a slight mix up in our food on my second visit (which just happened to be with my mom who was in from out of town), and we were sent home with a bag of donut holes and a couple other goodies gratis for our wait (which really wasn't much of a wait at all).  MORE OF THIS PLEASE.  Y'ALL ARE AMAZING.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "YMv6hD-8VIPu6ax4XZcEGw"
  },
  "XGM0oBwS-3c-bLcdL18mWg": {
    "date": "10/4/2018",
    "text": "I had the ham soup with fresh greens, super slim-cut carrots and bits of ham, potatoes and other fresh vegetables.  Very rich ham stock, just too salty for me. Also had the tangy apple cabbage salad.  I love what they are doing here and applaud them.  We need more places like this.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "-Ct5EXCvnDOzJKXzgOj8pQ"
  },
  "RHTOrPRbb4e9DxcDOAGVUw": {
    "date": "8/8/2019",
    "text": "There is a reason Bitter Ends Luncheonette was nominated for Bon Appetit's Hot 10...it's amazing!!!  The space has a few indoor tables, some seats at the bar where you can watch your delicious food being made, and they have a few picnic tables outside. You can order your food and drinks to go if you'd like, too.   They have a daily donut along with an ever changing menu using local produce. They bake their own bread. Expect onions and breadcrumbs on most dishes. They have a few drink options and support other local businesses. You can't go wrong with any of Chef Hegarty's creations!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sJC8geHJ0ShyxWT1DEsprA"
  },
  "GNMh6pfnKYcXZD7YB16xOw": {
    "date": "7/17/2019",
    "text": "The sandwiches were very flavorful, but the vegetable soup tasted more of like an herbal tincture.   I would go back for the goat cheese sandwich.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "wp98p-mSc1h8Mj79H-7SmA"
  },
  "2lxY6CSg0LnYHW_r4bda-g": {
    "date": "6/1/2019",
    "text": "If you are vegans or vegetarians, this place is for you. There aren't many meats options on the menu. The price is a little high but it is reasonable from using homemade and fresh ingredients. I ordered veggies hoagies which was amazing. There are tons of vegetables inside and the sauce went well with the hummus.   I like that you can pick your own mug for your tea or coffee and coffee is free refill.   The restaurant is kind of small. Not recommend to bring a big party",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y60RrxzIPtf6y4IozHsnug",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y60RrxzIPtf6y4IozHsnug/o.jpg"
      }
    ],
    "user_id": "VswUoaRCaDcu4D-_hrHuaQ"
  },
  "j5dvsZ63tx3UK6XgsVFPFg": {
    "date": "5/11/2019",
    "text": "Lovely spot for breakfast or lunch! They don't have much seating so try to come at an off-peak time. You order food at the counter and then seat yourselves  Their menu changes regularly, but I think it typically includes a few sandwiches, toasts, and fresh donuts. I had a veggie sandwich, which was good, but not very filling for the price. My friend had the toast with goat cheese and honey, which looked amazing!  I love how you get to choose your own coffee mug, and get unlimited coffee refills. Next time I want to try the iced early grey tea!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "EggsSbOBPC0U2sRECOfDZQ",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Featuring veggie sandwich, sugar donuts, toast with chickpea, and toast with goat cheese and honey",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EggsSbOBPC0U2sRECOfDZQ/o.jpg"
      }
    ],
    "user_id": "YhKdhoEhxD8A7ldxdhPPOw"
  },
  "t1GCxC4KGI73aHJL4I-lDA": {
    "date": "9/18/2019",
    "text": "My favorite place for fresh tasting breakfast in Pittsburgh. Incredible ingredients/options, lovely staff, music selection, donuts, etc! The menu rotates and always an amazing selection of fresh sandwich/salad options. And eggs always cooked to perfection! They brew Passenger coffee which is also a plus for me... love everything about this place, including the option to choose your own unique mug! I have never had a bad experience there, and cant wait to go back.  Go go go, do yourself a favor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cMA14bbG87eJYzr8FHgCCg"
  },
  "q5reoQKRee7RvE5kSdyF5A": {
    "date": "6/30/2019",
    "text": "Bitter ends is a great place to grab a delicious brunch or lunch. They use fresh ingredients and the menu changes often so it's easy to try new things. I'm a big fan of their sandwich options, because they are stuffed with fresh vegetables, perfectly cooked runny eggs, and are on deliciously toasted bread. The bottomless coffee and creative donut flavors also don't hurt!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Mb8rTjAojomyoKbBfFkWsA",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Mb8rTjAojomyoKbBfFkWsA/o.jpg"
      }
    ],
    "user_id": "a2DW6Wq7DcKnm2giGG9IjA"
  },
  "w3mkemy0XkewahSqlHsNqw": {
    "date": "6/2/2019",
    "text": "Have been wanting to try this place for a while! Came for brunch on Friday. My friend and I shared the asparagus, goat cheese, egg sandwich, brie and rhubarb toast, and a strawberry donut! The brie was super creamy and tasted great with the rhubarb. The egg sandwich was also delicious. The tanginess of the goat cheese was great. The donut was yummy as well. Overall, everything was super fresh and simple. Loved the concept of a small menu based on what is fresh for the day! Will definitely be back! Prices were very reasonable as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BWDUzdfHBSDl-txJvir8pg",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Brie and rhubarb toast, asparagus, goat cheese egg sandwich, and donut!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BWDUzdfHBSDl-txJvir8pg/o.jpg"
      },
      {
        "img_id": "-LtY4aNghhXgMvIfLzyKgA",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Strawberry donut, Brie and rhubarb toast, and breakfast sandwich!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-LtY4aNghhXgMvIfLzyKgA/o.jpg"
      }
    ],
    "user_id": "gofnmwo5ptoEnQI47zCBYg"
  },
  "LjmpvAqO645Pl_ul9ChHsA": {
    "date": "1/7/2019",
    "text": "I've had the food several times and boy is it good. I mean really good.  However, the prices can be a little steep. I get it but there are other local, close by places doing the same thing at more affordable prices.  The other thing is that the hours are never consistent. Days/hours they should be there, it's closed. They often run out of food and close early because of that. Not a wise business practice. We've missed out a handful of times because of that.  Still, the food is so damn good.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "urJhnI_mChXjCgXQWHRn-Q",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/urJhnI_mChXjCgXQWHRn-Q/o.jpg"
      }
    ],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "xBlBtF5eej45it98ekrGig": {
    "date": "5/11/2019",
    "text": "Really liked this spot. Everything tasted great, looked great, w/ super fresh and unique ingredients -- will definitely come back again. Staff was also really kind and accommodating.  Everything in the photo (veggie hoagie, sausage/egg sandwich, glazed donut, and 2 coffees) came out to $30. Liked the picnic tables posted up on the sidewalk and find this to be a great place for a nice day. Otherwise there's about 3-4 rectangular tables inside.  Coffee = solid.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yo2Xj0xRfWyt7DP3o4GYGg",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Veggie hoagie, sausage/egg sandwich, glazed donut, and 2 coffees - $30",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yo2Xj0xRfWyt7DP3o4GYGg/o.jpg"
      }
    ],
    "user_id": "xfFUSMfa7r9Ebz3bhFSg3w"
  },
  "0ORaVje9QURn6OtigLp63g": {
    "date": "7/22/2018",
    "text": "Wow. I don't know why it took me so long to come here, but man am I happy I went today.  Was craving some FRESH, veg forward food and decided to stumble over to Bloomfield.  The luncheonette is charming inside, small, and a bit of a blast from the past.  Mismatched antique mugs and plates lines to shelves with fresh vegetables in baskets about the line.   Order at the front and then find your seat.  It gets busy, so was glad to get there early.  The menu is small and simple though, so the wait is not long.   We ordered the zucchini, goat cheese and egg sandwich, both veggie sandwiches and 2 sides of potatoes.  Omg.  Everything we ate was delicious.  The definition of farm to table, simple food done well.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "BnbzRI_iQlEyGFolLbLKwg",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Veggie hoagie... perfect for the vegetarian, each veg was cooked so well",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BnbzRI_iQlEyGFolLbLKwg/o.jpg"
      },
      {
        "img_id": "XKNBHX1CiSTD7wDz51uqtg",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Zucchini, goat cheese and egg sandwich.  The bread is perfect and egg perfectly done!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XKNBHX1CiSTD7wDz51uqtg/o.jpg"
      }
    ],
    "user_id": "cAvlJ-lvBywOjcG1FTC_7A"
  },
  "LFHrL_rDSSR8vbIby0Yyxw": {
    "date": "6/25/2018",
    "text": "What's not to love? There's delicious food made with fresh ingredients, delicious bottomless coffee poured into a mug of your choosing, friendly service, and a cozy atmosphere. The pastries are homemade, the bread is homemade, and the veggies are locally grown.   I treated myself to a whole wheat donut and whoa, I've never tasted anything quite like it. It's been 24 hours but I already need to get my hands on another one. I also tried a veggie sandwich that was piled high with perfectly dressed greens, a perfectly runny egg, and perfectly creamy goat cheese. The baguette was out of this world.   If you're looking for an extensive menu, this isn't your place. But if you're a fan of thoughtfully curated dishes based around farm fresh ingredients, then this will be your jam.   Bitter Ends Luncheonette has everything you need for a solid, yet dare I say elevated(?), diner experience.   Also, whoever is in charge of the music, please let's be friends ok?",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 9,
      "cool": 6
    },
    "photos": [],
    "user_id": "DtzguIRjy-oRbrwVidAxQQ"
  },
  "SCCG8lDxqmgrb0rCP2yv_A": {
    "date": "7/18/2018",
    "text": "What a cool new joint! It really feels like you're swinging into the corner store for a quick meal.   We came here on a hot day to get brunch. My friend and I both got the sausage sandwich and the honey ricotta toast to share. The presentation is \"cool grandma vibes\" and the ingredients are really so fresh. The sandwiches are messy but we mopped up all the egg with the bread crusts leftover. The iced tea was delicious too.   The menu isn't so big so when I wanted a hearty breakfast sandwich there wasn't much variety, but what I got really hit the spot.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "VAGOASLzQ-xAV1kwNXVoOA",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VAGOASLzQ-xAV1kwNXVoOA/o.jpg"
      },
      {
        "img_id": "M8rFypnXDXESfs9QXbA0bg",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/M8rFypnXDXESfs9QXbA0bg/o.jpg"
      }
    ],
    "user_id": "6v-sh-RYXxViJFJAoNjAVQ"
  },
  "WUB7111x14_dSKJ7kEwyLw": {
    "date": "1/13/2019",
    "text": "My wife and I started our Saturday morning with a class at Bloomfield Yoga (which is a nice spot), we decided to stop by Bitter Ends on our walk home. I had stopped by shortly after they opened for some donut holes, and wasn't surprised that every seat was occupied and that there was a bunch of people in the entryway when we talked in.  After waiting a few minutes for some of the crowd to clear out, we placed our orders for a breakfast salad, French toast, a glazed donut, and a coffee. All in with tax and tip, this ended up being $26. Eventually, we were able to grab a couple of seats at the bar- if you come in on a Saturday morning, expect available seating to be sketchy at best.  We split the glazed donut, which was mealy and strange (it might be whole wheat or have some other unusual base?). While my wife was a fan, I was not. Apparently, they make their donuts fresh every day, but I found the texture and taste rather offputting. At $3 for a single donut, I was expecting more. I was able to down a mug of their coffee, which is good, by the time our food was ready. Coffee refills are free.  I was disappointed at the small size of my slice of French toast when it came out. It was crispy on the outside, well-cooked on the inside, and served with a small pat of butter and a light drizzle of maple syrup. Fairly tasty, but I was still hungry afterwards. To be clear, I'm not bemoaning that I didn't receive some enormous helping, but I think that the serving size should be large enough to fill you up. If the price needs to go up to justify a larger serving for them, I'd suggest that.  My wife was pleased with her salad, but also questioned the size of the dish even though she has a rather small appetite.  The staff is friendly and courteous, and the overall vibe is unapologetically hipster. Coffee is served in mismatched mugs presumably bought from a thrift shop, silverware is also mismatched and vintage. I'd prefer utensils from this century, myself.  I would love to have a cool breakfast place in walking distance from my house, and I really want to like Bitter Ends. I'll give it another shot to try one of their sandwiches (which looked pretty good), but I have a feeling I'll walk away again hungry and disappointed. If you're in the neighborhood, it's probably worth trying at least once, as a lot of people seem to like it. I wouldn't pass Pamela's or an old diner by to go to Bitter Ends, though (especially if you're hungry).",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "N_FhZ9rW8LaZGxyZo5c2HQ"
  },
  "HfwzpIfzJlSi_7_b189_2w": {
    "date": "1/10/2019",
    "text": "I can't say enough good things about this place. It's a tiny cute little diner with a couple tables, some outside seating, and an open view of the kitchen. It feels more like walking into your grandma's kitchen...homey, intimate, and comfortable. (BUT be warned it might be hard to find seating when it's busy). You order up front, seat yourself and grab any one of the assortment of cute and various mugs and cups lined up on their shelf.   Their menu changes but you can usually find a good amount of items that are always offered. (tip: follow their instagram for updates on what their serving! @bitterendsgarden)  What i've ordered:  - their donuts (always changes, always delicious) -griddle cake  - veggie hoagie  - goat cheese & honey toast (AMAZING) - sunny eggplant sandwich   I've never been disappointed eating here...truly a hidden gem in Pittsburgh. Good food & great prices!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qQfNqI0gQznZml0BqGk11Q",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Donut &amp;amp; Griddle Cake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qQfNqI0gQznZml0BqGk11Q/o.jpg"
      },
      {
        "img_id": "j67D23tXVozyKW7PPVQLNA",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Veggie Hoagie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/j67D23tXVozyKW7PPVQLNA/o.jpg"
      },
      {
        "img_id": "at_RxMUT6-5hNMCZjlzlRg",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Sunny Eggplant Sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/at_RxMUT6-5hNMCZjlzlRg/o.jpg"
      }
    ],
    "user_id": "eO2cNB2chfDMTZWafeOGHA"
  },
  "uLVw2omhIL5es00A-6RHnA": {
    "date": "1/13/2019",
    "text": "This tiny soup and sandwich joint has some of the tastiest vegetarian lunch dishes I've ever had. The atmosphere, decor, and friendly employees are also exceptional. I came here due a quick weekend lunch with my family and the place was really crowded, but we were able to find a table to eat at by the time our food was ready.   We tried a vegetable/bean soup, the zucchini goat cheese sandwich, and a chicken salad sandwich. The soup was probably my favorite, it had a really yummy broth with lots of ginger flavor. The beans weren't overcooked so the soup was nice and clear, not a big pile of mush. It was very salty but I'm not complaining because the flavor was so so good. Also came with a hefty chunk of bread, which we saw being delivered while we were there!  Similar to the soup, the zucchini sandwich had really stupendous and unusual flavors.  Other cool things about Bitter Ends were the eclectic set of unmatched plates and cups. The whole place looks like it was outfitted entirely with finds from a thrift store, which made it feel really homey (for me at least!).   Downsides are the lack of seating, which limits opportunities for groups of more than one or two people to eat here comfortably. It would be a great place for solo lunch or breakfast. The prices are also pretty steep, especially for the relatively small portions.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q3-Y0zoVvMM8Jr5MB1mBgQ"
  },
  "GeNTFJPdUpwHc-HSV1eYdQ": {
    "date": "11/10/2018",
    "text": "I stopped by here this past Saturday with my wife.  We had already had lunch but I was still a little hungry and so decided that I would like a little more food.  Luckily for me, Bitter Ends Luncheonette was nearby and a place that I had wanted to try and so we stopped in. The inside was a bit tinier than I expected but really did give off that diner type vibe.  There were a few tables which were fairly crammed together and then the lunch counter.   For my snack on this day I decided on the chicken sandwich to go and whenever I ordered it I heard the workers mentioning that there were only two baguettes left after mine.  The menu described it as northern spy slaw, leeks, braised chicken on baguette.  It was ready a lot quicker than I had expected and within 5 minutes of ordering we were out the door.  As soon as I got to our car which was across the street, I dug in.  It was good with the standout portion of this sandwich being the baguette.  It was crispy on the outside and soft on the inside, even whenever it got wet.  The chicken was nice as well as it was moist although the slaw kept it even moister.  That slaw had a good flavor to it but may have actually been a bit too wet for the sandwich.  There was a bunch of it on the butcher paper that it was wrapped in and parts of the sandwich, especially the bread, would have been a lot better without getting soggy.  Overall though it was a good and flavorful sandwich which I am glad that I ordered.  The bottom line for me is that I might stop by here again in the future.  Bitter Ends had a menu that was on the smaller side but I was happy with the food that I had.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "TbFLV6-xLRvAUY7e0vrkKA",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Chicken sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TbFLV6-xLRvAUY7e0vrkKA/o.jpg"
      },
      {
        "img_id": "vahUY8jbfrIWpzrzoe-12g",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. All wrapped up",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vahUY8jbfrIWpzrzoe-12g/o.jpg"
      }
    ],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "77jniYJ4YsKpm9epy4oFQw": {
    "date": "9/15/2018",
    "text": "Loved my sandwich here!   I had the zucchini, goat cheese, and egg sandwich and everything about it was great.  The bread had a great flavor and texture.  The zucchini was cooked, just enough goat cheese, and a perfectly cooked egg with some runny yolk.  The whole thing was topped with some fresh dressed greens - again, perfectly dressed and seasoned.   I missed the note that everything comes with onion and picked most of them off, but they were sliced super-thin and probably would have been ok.  Overall, a great and fresh combo and I was really happy with the sandwich.   The place itself is small and fast casual style.  Not a ton of seating inside, but they have a few tables outside as well.  They serve on mismatched china and jelly jars - cute overall.  You can see them cooking and assembling behind the counter and they look like they are enjoying it.  Bread bakes in an oven in the corner and the dishwasher appears to do it all by hand.  The music mix was good.  Will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 12,
      "cool": 5
    },
    "photos": [],
    "user_id": "h9LPugJk2cpIh0gmQb5LnQ"
  },
  "ewikr16vyw1OjZ7kYAp8BQ": {
    "date": "9/30/2018",
    "text": "Wow. Swung by CW Press and walked past this spot and had to stop. They are doing something really special!  No hiding the secret sauce as the grill is right behind the counter. Choosing your own vintage coffee cup was a fun perk. If you happen to catch a nice weekend, the outdoor seating is perfect.  Now the food. Holy cow. The grilled toast is off the charts and whether you choose an eggplant or sausage sandwich you're going to be happy with the greens that go on it. Don't skip something sweet to finish off your meal.   20 years being picky about breakfast in Pittsburgh and this is now high on my list.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "EOCSQM2be822gdrZCAxTCA",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EOCSQM2be822gdrZCAxTCA/o.jpg"
      }
    ],
    "user_id": "BwI1Lp1k8i8oKpNTOA-k0A"
  },
  "BzQ9AmDKGotpCH-3HMdE2A": {
    "date": "4/19/2019",
    "text": "Had a nice yummy brunch and tea here on a Saturday. The kitchen/place is small, so we sat outside. I do love the inside - feels more like a friend/family is cooking you a meal. Which is refreshing. Ingredients were fresh. Will come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "omOwr0o-WGBz3qovzVuD5A"
  },
  "4fk_lYctsc7mr4e3YBu87Q": {
    "date": "2/4/2018",
    "text": "This is my favorite place! Stopped by for Sunday lunch and was in awe by the vibe and friendliness of the staff. I love love the mugs, glasses, and plates. It speaks to the quirky feel and made you feel at home. We grabbed a coffee and tea (strong and tasty coffee and delightful herbal tea) and ordered a breakfast hoagie and veggie hoagie. The breakfast hoagie is out of this world good!! Hubs got that and the veggies with the egg and potato patty was just amazing. The veggie hoagie was outstanding. The ingredients aren't warm, so keep that in mind if you're looking more for hot food. They bake their own bread and we were both wowed by it. If you come in as a pair and both get hoagies, I'd recommend sharing so that you each get half of one. It's served cut.  The ingredients are fresh and there is a lot of love in prepping. The staff were all in good spirits and that resonated throughout. They really set the tone for the place.   It's small, but the tables do turn pretty quickly. It's aim is for a diner type and it works well.  Hubs says \"it was yummy in my tummy.\"",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "q6h8vJulEn27je--_oXv9Q",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Goat cheese and zucchini, hello summer!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q6h8vJulEn27je--_oXv9Q/o.jpg"
      },
      {
        "img_id": "EgxvoVpYxoUm679B-utmYg",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States. Spring Ricky, one of us was lucky enough to get the baguette",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EgxvoVpYxoUm679B-utmYg/o.jpg"
      },
      {
        "img_id": "jhBOFXedLOn1QXR-254VVQ",
        "caption": "Photo of Bitter Ends Luncheonette - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jhBOFXedLOn1QXR-254VVQ/o.jpg"
      }
    ],
    "user_id": "2i0A5OoKyiwskqvnkGq7cA"
  }
}