{
  "EESaxfhMzf6OPMme-H1sgQ": {
    "date": "8/28/2018",
    "text": "Went with some friends. Great atmosphere, attendant waitstaff. Only con is value for the money. Opted for the $75 fisherman's platter for two and even asked our waitress if there was going to really be enough food for two people. We were promised yes. What we received was a scant portion of old bay cocktail shrimp, regular cocktail shrimp, a small lobster tail, one lobster claw, a few clams, and about a half dozen super small oysters. A fine appetizer but not for $75.  Wine pours are also not generous, to say the least. I wanted to love it. But it just can't beat Muddy Waters.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ip2X6aXWqVmgZymq6sorQ"
  },
  "eDnf4pP62jm8hVhpZvxblQ": {
    "date": "10/30/2017",
    "text": "Such a cool place! Soup and oysters were amazing!! Also have a great beer selection.. we will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "11KQGEtJsJKXuhtNJgAC1w",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/11KQGEtJsJKXuhtNJgAC1w/o.jpg"
      }
    ],
    "user_id": "qMtsKbEifjv4eOirM8e27g"
  },
  "RehwCkZqpGhvi9tUbfz9RQ": {
    "date": "11/26/2017",
    "text": "Review for the bar. Had six drinks and paid $100. Thats what you pay in Vegas not in Lawrencville. Just too expensive to come back again for an oyster bar. It was the first time in Pittsburgh I have done a double take on my drink tab. Recommend Bar Marco in the strip for similar cocktails",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "vw5_mVTImolRIJ-Gb5qJ5Q"
  },
  "7vlUUrTLEK7qaojfY_6PLw": {
    "date": "7/20/2018",
    "text": "Came here to check out the lobster roll and was sadly disappointed. The lobster meat was made up of tiny lumps and chewy, as if it had been reheated in a microwave. It was slathered in the seasoned butter which just made it taste like butter salty lumps. A good lobster roll features the lobster and I couldn't even taste the lobster on most bites. For $23, you expect quality lobster meat that doesn't need to be masked by a ton of distracting flavors. My husband ordered the crab cake sandwich but instead was given the crab grilled cheese, which was decent but not a lot of crab (but a lot of butter).  The oysters were delicious and very fresh, and the caesar salad was really good (dressing was on point). I would come back for oyster happy hour but not the hot mains.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e5cgAyz5AeAZtqFo_0UgNg"
  },
  "x6cJe6qWLuCRE5GIL3WBoA": {
    "date": "2/15/2018",
    "text": "This is a wonderful, cozy place with outstanding fresh seafood, an amazing beer selection and warm, friendly, knowledgeable servers!  Yes, it's not cheap, that's the reality of good seafood. But you get what you pay for and you can always hit happy hour 4-6 or all day on Sunday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4Qi-9yxjNT9DaIqKJkWazg"
  },
  "rY6u7Jr295Ad8Et0Awy53w": {
    "date": "12/26/2017",
    "text": "We have now dined here twice.  The oysters are nice and fresh the chowders are good.  The wait staff does not seem to have tried the oysters and cannot really provide a good explanation of the different options. However, if you know a bit about oysters and their regions you can work with that.  Not an inexpensive meal, but definitely a good place to go if you are looking for some fresh oysters.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "C_6ZFEHDdUPY736bfEOVPg"
  },
  "4x7QES4Py464674S8SK-RQ": {
    "date": "10/18/2017",
    "text": "Expected a lot more. Went on a weekday early evening to beat whatever rush there may have been. I was expecting some sort of oyster happy hour like many places (in here and other cities) commonly do, but every oyster in the place was $3-4 which is extremely high for Pittsburgh and higher than many reputable places I've visited elsewhere.   We ended up getting soup and sandwiches. The $15 bread bowl barely held more than a cups worth of soup. The clam chowder was decent but was extremely heavy on the bacon which had the shape and consistency of spam. This was not on the menu and the server didn't know the differences among the chowder options.   The service was the biggest letdown. Slow and inattentive, many employees just standing around when they could have been bussing tables or running food/drinks, and it took eons for the bill to be split and arrive. Yea this place just opened, but for all the hype I expected much more.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 10,
      "cool": 0
    },
    "photos": [],
    "user_id": "fz0ZxPznltjsXAJNNyzwbQ"
  },
  "J8DBdgAa1YLDpiYtU7f2tg": {
    "date": "7/16/2018",
    "text": "We have been here twice for craft cocktails and the lobster roll which is delicious. This last time we had the RI chowder which was also ver good. Jake at the upstairs bar was friendly and made some great cocktails. Love this place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lZvONF-39y9ldqlQS-qFOQ"
  },
  "NDthg65KEQ9aXOa4SKDvfQ": {
    "date": "8/9/2018",
    "text": "The oysters here are as good as it gets! Big selection of east coast oysters. For an under $50 tab, we had 12 oysters, lobster roll, 3 beers, and split the steamed mussels (during happy hour). Delicious food and cool atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1CDmqVcq3sVSYDCymS6mRA"
  },
  "436DdAAWeMQ4u4ued3hQgg": {
    "date": "6/29/2018",
    "text": "I wasn't going to write a review, but my first and only experience is still sticking with me nearly a month later. I won't be back, and I'm sad about that. I really loved the location and atmosphere. It was great to sit with open windows and people watch. I was so hopeful when my dining experience began. I lived on the coast for 11 years before moving to Pittsburgh. Fresh seafood is what I miss most. And I love oysters. I really like the idea of sampling oysters from different places. It's pricey, but you're landlocked. What upset me was it was my first time in ever (and at happy hour) and I was super excited and wasn't really paying attention to the al a carte menu. I asked for a dozen and half oysters, and the waiter never explained to me the process. As such, he mixed and matched oysters himself and selected some of the most expensive oysters on the menu to upcharge me. $80 for oysters and two drinks at happy hour. Seriously!? It was just super shady because oysters were half off. He never even asked me which oysters I would like or point me to the board. In fact, when someone else from the kitchen brought them out, he identified which oysters were which. When I said, \"Oh, they are all different.\" He looked completely floored. I've worked service industry and tip incredibly well so I was incredibly disappointed to be on the receiving end of bad service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IDjZqSjeXmQnDNT4vfC1ZA"
  },
  "j_KutdTLQJVoKsLRFShH8A": {
    "date": "11/24/2017",
    "text": "Expensive but you get what you pay for. The oysters are super fresh and the service is friendly and knowledgeable. Small but well-curated selection of local brews on draft and as well as other seafood-friendly beverages.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CI6u9auJSQAblZYxgJ-O_Q"
  },
  "abBqvnjZGUqTieJV13WRkQ": {
    "date": "11/1/2017",
    "text": "As someone who rarely eats seafood, I wasn't expecting to be excited about this place.  But I tried the Lobster Roll ($23), and it was quite delicious.  My only complaint is the \"roll\" seems to have the tendency to fall apart.  While I don't eat oysters, there seems to be a good selection to choose from.  Others in my party really enjoyed both their oysters and the Clam Stuffies.  The beer selection is also surprisingly good.  I'd definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LNKa5if-sxtuPisjsZgD7Q"
  },
  "mC1m82fTDpigJ7dbBZlMKw": {
    "date": "10/18/2017",
    "text": "The oysters are amazing, the staff outstanding, and the space well appointed and comfortable! These guys are going to be pretty stiff competition for Muddy Waters! There have been several comments about the price of the oysters but you get what you pay for! My new go to place in Lawrenceville for oysters! Great selection of oysters and a solid menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eYR00lvuCK9tUrHvBoGHgg"
  },
  "jEkgnofcsEd0qG4QtCVFBw": {
    "date": "11/26/2017",
    "text": "Merchant Oyster Company is a nice addition to the Lawrenceville restaurant scene.  The New England Clam Chowder bread bowl was very generous and seasoned perfectly. The bread bowl itself was toasted to perfection and delicious, although I could not finish it for lunch and recommend the smaller bowl if you do not have a large appetite. My girlfriend had the lobster roll, and although it is priced at a hefty $23, it was packed with large pieces of lobster, including a very large piece of claw meat on top. The interior has a clean look while retaining traditional New England charm, with small meaningful details like wall chargers at every bar seat. The service was friendly and fast. High Recommendation.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MZcPbopItgn0P5vS05Cw1A"
  },
  "67jpQnq_K02e0lpAJRiWzA": {
    "date": "11/15/2017",
    "text": "One of new favorite restaurants! I had a celery gimlet, it was better than I could have hoped for. We had the clam stuffies, canned white tuna belly with crackers, one of every oyster for each of us, cocktail shrimp, and tried 2 different soups (New England chowder, and a clear chowder maybe?) Everything was perfect. We couldn't pick a favorite because it was all so different, fresh, and just GOOD. Can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xb9-sVUs7gDjDrnRNPSyag"
  },
  "2FTwhSxrk_7QtGulqaQOng": {
    "date": "11/17/2017",
    "text": "Great place.  Nice oyster selection, helpful bartender.  Wife and I enjoyed and will return.  Only bitch and is the assign bar chairs upstairs.  Dumb! Otherwise very happy.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C8aQkHlrUIZf5Xj95ZU4QA"
  },
  "L5JnuC55kXNYFdNxdKunjA": {
    "date": "10/21/2017",
    "text": "Great vibe and wonderful service!! The oysters are delicious and chowder was perfect on a chilly night.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CLUXQueN3PRNfGMEovS-qA"
  },
  "3GUbZFVoCcpnGof_qqNrvg": {
    "date": "10/29/2017",
    "text": "Restaurant newly opened. Fantastic clam chowders; probably the best tasting crab cake ever.  Great service, highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-o0fhDnT_PNbTHupKEjRiw"
  },
  "dYtdXSvcangyD5EfW9KrRg": {
    "date": "4/6/2018",
    "text": "A friend suggested this spot since he loves oysters and there's a wide variety to choose from.  He raved about them.  We all split a bucket of peel and eat shrimp (ample supply) and split the Popeye and Caesar salads (huge).  Their Cabernet was so good that after my friends sampled mine, they each ordered one.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4ZjIsQUbBlYlYwYPc54cdQ"
  },
  "9Bo31Ko9_P0yIyo8x75XUg": {
    "date": "1/24/2018",
    "text": "I really wanted to like this place, I really did.  I watched them building the place for what seemed to be a year at least.  I've long been on the hunt for a good lobster roll in Pittsburgh.  Unfortunately, after eating here, I'm still on the hunt.  :-(    While the lobster roll is probably the most expensive item on the menu, $24, it was definitely not worth the money.    I went on a Tuesday evening and got my order to go  A clue to my eventual disappointment was the weight of my bag when I got my order.  That told me that the roll was very small.  Upon arriving home, I discovered a very small roll with only a few, small pieces of lobster.  I should say \"purportedly\" lobster because I suspect it was that fake lobster.  There certainly weren't any large chunks of lobster as pictured in one of the pictures.  The lobster was supposedly coated with browned butter sauce and accompanied by Old Bay potato chips.  I am a lobster lover!  Whatever this was, missing was the fresh taste of real lobster.  Missing was the taste of real browned butter.  Think little chunks of \"something\" coated in some dark brown stuff.  The supposed homemade chips were hard and bland.  I added my own Old Bay seasoning just to make it palatable.  Even with that, I threw most of them away.  I ended up thinking yesterday, and today, that I had wasted my money and that I was ripped off.  I can buy a whole lobster at Giant Eagle or even Wholey's for what I paid for this minuscule roll.  Frankly, I could purchase just a tail and cook it at home for less than what I paid.    No more hunting for a good lobster roll in Pittsburgh, I'll just make my own.  (p.s. I know there is a restaurant in the Strip that sells them, but suffice it to say I don't care for extra protein with my meal so that option is out.)",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ZpYSD0icecV3KqgzX0qQA"
  },
  "2ZQ_kHf7G-6oLTBj9WjVGQ": {
    "date": "12/8/2018",
    "text": "One of the best raw oysters I have had. Felt like I was at the beach. We tried two different kinds. The ones from Alaska were our favorite. So much flavor. We also got the muscles. Oh my heavens there were so so good. Made with beer garlic and shallots. Amazing!!!! Also got the peel and eat one lb Old bay seasoned shrimp for my 10 year old it was perfectly seasoned. Not spicy just perfect. It was very tasty and easy to peel. The service was very very friendly from everyone. Very on top of everything. Very cute place. Can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7lVWXS39vUOYvaNnJ0M5Ug"
  },
  "Ivnc2OtlRvgQbDawWa3BCQ": {
    "date": "12/8/2018",
    "text": "Good food.   Fresh oysters, quality stuff.  We will definitely be back.  Thanks for the great service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XHL_txrzWnFyhZW8tV9HZA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Bloody Mary was yummy!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XHL_txrzWnFyhZW8tV9HZA/o.jpg"
      }
    ],
    "user_id": "0F6eAJyT_6mB6Y1qSrOE7g"
  },
  "zvRLjCbx30xrfL2yqb5ODw": {
    "date": "2/14/2018",
    "text": "Place is EXTREMELY OVER PRICED.  Food is average at best.  Had to search for cocktail forks and ask for condiments for oysters.  Drinks and beer were more expensive than places I've been to in NYC.  If I was the owner I would email me and pay for my consultation <a href=\"mailto:sparti1818@hotmail.com\">sparti1818@hotmail.com</a> The bartender was nice, but even admitted that the prices were very high and the check adds up too quick for what and where your dining.  I will not be back and I love oysters and live 3 blocks away.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ix41HnRlvAfDYnJn2YMD2Q"
  },
  "0VY5aPaC4v7PdrOly-B2bg": {
    "date": "10/6/2018",
    "text": "Stopped in late this afternoon for drinks and oysters. It was delightful! Cold beer for my husband and Wine for me.  We selected three types of oysters to make a dozen. They were cold, fresh and delicious!  We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KcnrnXjGE0Cf04vlqPi2cw"
  },
  "vivfaW_6RF-VK3XcsGTqpw": {
    "date": "11/2/2018",
    "text": "The New England clam chowder is homemade & perfect! The crab cake sandwich was tasty.  Old bay peel & eat shrimp was spot on! Service was good, the staff is friendly, knowledgeable & accommodating.   Will be back for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "leMcnqpO4wKgp6Ko6I7_rQ"
  },
  "JOTDjq-i4VOVjXzzIsOMmw": {
    "date": "8/11/2018",
    "text": "Beer and wine was great. However, they were out of salad ? And oysters were just okay- shucked half-ass and multiple shells I kept biting/having to casually spit out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YdoO1JbxXvp1TFRddTPUqg"
  },
  "ppKIIXtH-mc9BlDvt3lH2g": {
    "date": "11/19/2017",
    "text": "I was looking forward to trying this place but was disappointed overall. For a restaurant specializing in oysters, it's important that the wait staff be knowledgeable on the product. The types of oysters are written on a board above the bar, and our waiter asked us if we had any questions after stating we wanted to try a few. I would rather have an informative run down of some, if not all available options, but instead it was like pulling teeth to get oyster descriptions and recommendations. The ones we tried were pretty tasty, but not worth $4/each. It was also disappointing that they are sold by the oyster vs. half dozen or dozen.  The silverware is sloppily thrown into a container on the side of each table, and i couldn't help but question the cleanliness.  My glasses of House wine were $11 a pop. Had I noticed that, i wouldn't have ordered a second. All i ended up having for dinner consisted of 4 oysters and a Caesar salad. My friend had the crab grilled cheese. Both were mediocre. In total, our bill came out to $100 and we left with regret.  TLDR:   Pros: Atmosphere, tasty oysters  Cons: Everything else",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 0
    },
    "photos": [],
    "user_id": "mlQSOIWkSYxvwVuz1ZRsTA"
  },
  "VsFboT3FKiAwnjd5qWrn1g": {
    "date": "6/25/2018",
    "text": "I live close to this restaurant. They are irresponsible with their trash. Thanks to them - my backyard smells like putrid fish.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_j12qfY68UZFOZPrEDg4lQ"
  },
  "1OevZgGoJoQeWh5gke_5aA": {
    "date": "8/4/2018",
    "text": "How can you be out of shrimp on a Saturday at a seafood restaurant??!!  And then have none of the oysters I want at 845 pm??   Won't be back.... it's not even crowded....they were also out of the beer we wanted... and the mussels were TINY for $3 each definitely not worth it. And more thin tiny bread??? Ya never showed up joke of a restaurant  Save your time and money",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iiJjSvHn_IGwZ5vcGZ4plA"
  },
  "znA_ErOqFSkPtLuy_2mJBw": {
    "date": "9/22/2018",
    "text": "Had lunch. Ordered cold lobster roll. Expensive (of course), not clean. Seemed doctored. Has New England Clam Chowder. Chowder was very good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ckd5oA7Zv75xOeSaUlkl7Q"
  },
  "DZ6PVFXHeuhfXGh-jdj__w": {
    "date": "10/22/2017",
    "text": "Nice place that reminds me of some of the little seafood shacks that are along the east coast just a little fancier and no holes in the table for shucking.  There are a bunch of picnic tables outside.  The second floor bar has some rocking chairs.  Started with the Rhode Island Red chowder.  Very tasty chowder.  My Lobster Roll with old bay brown butter and some other herbs was good.  The roll came with some home made old bay chips which were very crisp and tasty.   I did peruse the oyster selection but was more interested in the chowder and roll.  As others have said the oysters seem to be a bit pricey.  We asked for ice tea but there is not any available.  So get a beer.  If you want utensils or straws they are in a little fry bucket on the table or bar including straws that were not covered and some aluminum straws.  My other half was not real fond of this since others could put their fingers on them while taking one.  But they do seem to be trying to be like some of the seafood shacks along the coast.",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 14,
      "cool": 17
    },
    "photos": [
      {
        "img_id": "6liTNmhGT8sPwVgJk8IsqA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Straws in glasses",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6liTNmhGT8sPwVgJk8IsqA/o.jpg"
      },
      {
        "img_id": "RL1OzKyDRpHzIsjXjpdw5A",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Lobster roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RL1OzKyDRpHzIsjXjpdw5A/o.jpg"
      },
      {
        "img_id": "UF_VDwNa981I9oVEcDP9OA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Rhode Island Red chowder",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UF_VDwNa981I9oVEcDP9OA/o.jpg"
      }
    ],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "xXDrxq5sJvk4AbpkFa4UtQ": {
    "date": "5/21/2018",
    "text": "Stopped in on a Monday (early evening) for some oysters and a cocktail with my family. We had a fantastic early dinner. Total bonus, it was happy hour and the oysters were half off (epic deal). Staff was fun and friendly. You can tell it's a well-run place. Food was fresh and delicious (try the lobster roll served cold... it was absolutely worth every penny). Drinks were well-balanced and totally on point. Overall, a great experience. Definitely check it out if you haven't already.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KlDVwjPGoo-FDQunJLch0g"
  },
  "O2h6zgcnaO6AW-NJ0tGASw": {
    "date": "12/29/2017",
    "text": "Started out with 3 different types of Oysters, including a smoke infused one! They were really fresh succulent oysters! Great gentlemen shucker,very knowledgeable of his product! We also enjoyed the chowder! Some of the best I have eaten in years! Great experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3oRkiV-j-JCe2VEjxSL-_A",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3oRkiV-j-JCe2VEjxSL-_A/o.jpg"
      },
      {
        "img_id": "aEQ2mVFdJqhxHKdk8G2UAw",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aEQ2mVFdJqhxHKdk8G2UAw/o.jpg"
      },
      {
        "img_id": "xstKSq2vHjBPsdyhrKphlw",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xstKSq2vHjBPsdyhrKphlw/o.jpg"
      }
    ],
    "user_id": "8r2b5Ym68mnhRjVdGgO3sg"
  },
  "ltIx1Ekrx-3klEvinLsjOQ": {
    "date": "10/22/2017",
    "text": "I see the future of a great addition to the Pittsburgh restaurant scene. There were a few kinks, but they just opened a week ago. Suspend your judgement. The first bite of my lobster roll brought me to memories of some of the best lobster rolls I tried in Boston. I thought the flavor of the lobster roll was amazing, but it should have came with a lemon wedge. We went back and forth about the chowder but I ultimately decided that the flavors were unique and delicious. It's not your typical thick, creamy chowder, but it's thinner with a Smokey, baconey, thinner consistency flavored soup. I really enjoyed it, but it's definitely different. The oysters were tatsty, a little sandy but you know... they're from the ocean. I enjoyed the mignonette and the flavor of the sea. There was no wait and plenty of seats everywhere. I ordered the celery gimlet drink, which lacked celery flavor and should have been a little bit sweeter (or made with gin) like a typical gimlet.  Overall, I'll definitely be back. You can never have too many oyster joints in a city.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SXeurguVgso6QHcag703lA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Cocktail menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SXeurguVgso6QHcag703lA/o.jpg"
      }
    ],
    "user_id": "GTbnKWAYHAgY4Z_62547WA"
  },
  "5AQ8yz3HK4ZBFrKyB4TQTw": {
    "date": "2/3/2019",
    "text": "Walked right in around 3:30 on a Saturday afternoon and got seated right away at a nice table. Ordered 2 different chowders which came out right away. Beers came out right away, but mixed drinks took wayyyy too long. Our table loved all the food. Crab cake sandwich, lobster cuban, lobster roll, and plain grilled cheese were all top notch. Got a whoopie pie for dessert which was also very good. Would definitely come again, but might go somewhere else before or after for drinks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7rVYoh2k4cDVMc8E0fJM3w"
  },
  "SW4MzPjxmyiyro0_xC4qGw": {
    "date": "2/15/2018",
    "text": "A bad experience with a restaurant for which I had high hopes. And no reply to the following private communication I sent on the same day via their Facebook page, which details the problems I and my dining partner encountered.   \"Just wanted to provide some feedback regarding my recent experience at your restaurant. The atmosphere was lovely and the bathrooms were immaculate and nicely appointed. Our server was very friendly and helpful. However, there were a number of problems with our order. After helpfully warning my dining partner that the New England clam chowder contained bacon, our server informed me that the Chowder of the New did not contain bacon. When it arrived, though, it had plenty of bacon. If that was the only mistake, I wouldn't have felt compelled to communicate with you. After asking if I wanted a second glass of wine, another server dropped off a glass of rose when my first glass was white. The wine was fine though and when the server realized his error I told him not to worry about it. Unfortunately when the bill arrived, it included a charge for the more expensive wine that was brought to me in error. While I didn't expect to be comped for the mistake, in principle a customer shouldn't have to pay extra for a server's error. We also (after a decent wait) received the oysters we ordered and found them to be not well-shucked or well-cleaned. For the price, they really should have been better prepared, although to be fair the selection and freshness were on point. Finally, the lobster roll we ordered along with chowder and oysters never arrived. As we had already waited for an hour for oysters and soup, my friend and I elected to grab some food elsewhere. I apologize for the length of this communication but I thought you should be aware that the number of problems we experienced was really more than we expected even considering that the restaurant only recently opened. I hope this comes across as constructive feedback rather than being a \"difficult\" customer.\"",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "gNhQHohfKbWF0vlHNp8rPA"
  },
  "qiJNf5Vfk45yqflJ2R-7xA": {
    "date": "6/25/2018",
    "text": "Stopped in for lunch on Saturday during our bike ride at Open Streets PGH.  Excellent oysters and chowder!  My daughter ordered the all beef foot long and everyone left happy!  Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WVygh7PGTTvIAibKRsSn9w"
  },
  "zGY6Hc1kJvohgCiO6RL8Xw": {
    "date": "3/31/2018",
    "text": "Visiting from Cleveland and stumbled into this place. What a treat. The staff was fantastic, friendly and informative. We had the New England clam chowder which was NOT creamy a plus for me but others may beg to differ. I tried the RI red which was bacon free and delicious. We had some oysters and they were fresh and yummy. The cider in an enormous bottle was super dry and delicious.  We have no complaints and hope they thrive this spring and summer with their outdoor space.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "D0YXykWUuvhUGVODr1nbOA"
  },
  "zxvCy38obR1Z8M3KSFXCFw": {
    "date": "12/27/2017",
    "text": "My wife and I were very excited about a new oyster place in town and we went with a couple of close friends on the first Saturday they were opened.  By the end, we were surprised to be treated the way we were and left.  It isn't easy to write this review because it is 2017 and I have never experienced the type of humiliation that I am about to describe. Nonetheless, I think that it should be made known so that this doesn't happen to anyone else.  My friends and I arrived and it was quite busy on the bottom floor and we were told that it was open seating and we were welcome to find any open seats and we would be taken care of.  We went upstairs to the bar and we found 4 seats at the 10-seat bar. There were two other people at the and the bartender was preparing drinks for them.  To set the stage, the four people in our party are multi-cultural (non-caucasian) and the two people already at the bar were caucasian.   We sat at the bar for about 10 min talking with each other waiting for the bartender to at least provide us with a menu or offer us some waters. During this time the bartender glanced over a few times which we thought meant that they were going to come over to check on us. At about the 15 min mark, we started to find it a bit odd that we hadn't even received a menu and was about to say something when a new party of 4 came up to the bar and sat down next to us (all of them caucasian).    The bartender immediately got 4 menus and went over to that party to welcome them, pour them some waters, and see if they wanted to start with any drinks.    It was quite appalling to be treated like this in 2017 in Pittsburgh and my friends and I looked at each other dumbfounded and left the restaurant. We were very disappointed with the treatment we received.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 10,
      "cool": 0
    },
    "photos": [],
    "user_id": "LzFykDRdrCE6RHl68z8VeA"
  },
  "U1zmTNeENW28rxX71VVuTw": {
    "date": "3/25/2018",
    "text": "We stopped here for dinner last night. Rose on tap, oysters were amazing and Maine mussels were the best I've had. We also shared s Caesar, cup of New England clam chowder, pork roll and crab grilled cheese. No complaints everything was yummy! We'll be back",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "c8paIwto10MS7Zg2YFeDjQ"
  },
  "iUFoPaLhesW_Hctp48FODA": {
    "date": "7/15/2019",
    "text": "Food was great, oysters were fresh and came pretty quickly on a busy Sunday. The half off deal on sundays is great too",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VQfEobCiGyz9brcwowZY2A"
  },
  "iY-kurkhrQB0Wb3un7ODHw": {
    "date": "4/11/2019",
    "text": "Super fresh oysters and perfectly shucked. They have a huge selection that is always changing. I believe they had 12 different kinds the last time I was there. It's worth a trip just for the oysters. They do have a limited menu though and at $4 an oyster it's a bit pricey. Definitely worth the splurge once in awhile though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WiEeBrge57HPpNU_1xKahA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Oyster sampler - 8 different kinds!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WiEeBrge57HPpNU_1xKahA/o.jpg"
      }
    ],
    "user_id": "ziNiwSSpZIovVERDxjPUmA"
  },
  "W7I51wBEKrunTEN-YG0giA": {
    "date": "6/20/2018",
    "text": "Came for happy hour one day after work and went to town on their specials. My co worker and I ordered drinks at half the price along with pot of steamed muscles, 24 oysters, topped off with a grilled cheeses sandwich decorated with crab filling. All for a great price. The oysters here are fantastic as you may be able to gather judging from how many we ended up ordering. The restaurant a dog friendly so my friends adorable pup was able to come join us. This is a top spot to stop for a great time in the summer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "by9WgccrFe3DNxUkwJUkOg"
  },
  "r3F4qSq0UWamNZn947PvwQ": {
    "date": "4/7/2019",
    "text": "I wandered in after a bad experience up the block, and had quite a pleasant lunch. Started with the seafood chowder, and wished I would've got a bowl instead of a cup. Moved on to a lobster roll with chips, which hit the spot paired with a local IPA. The place is kinda small, but that adds to the charm. I would've given 5 stars if it was a bit less pricey. Understandable for dinner, but lunch for one in Pittsburgh should be under $20, not over $30.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w9h0zY2wJdqxMVCsnD-c0Q"
  },
  "Qx_mj3c9XSne13cFYa7h0Q": {
    "date": "6/20/2018",
    "text": "What a great time! Highly recommend this place if you like to be shellfish.   Here we are, landlocked in the grand ole Pgh pa of the 412...  I was able to imbibe in the delicacies of the shore. Happy hour is divine in its savings, more so here than the standards fare. Half off of all oysters clams and mussels. Also alcohol stuff too!  They have four beers AND wines on tap, so there is that. With maybe happy hour specials there too.   Maybe I thought the staff was my favorite type of Goldilocks. Not too much or too little, had to earn that stature-as I'm sure I'm annoying at first.   Great for a date night too! Only because I'm trying to use too two many times. Giggle. Seriously though. Thanks Mara. Thanks Tim. You guys killed it, hands down. Or perhaps golf clapping, not sure the appropriate gesture, cause I'm awkward.   Thank you for a late afternoon that reminded me of growing up next to the ocean, with parents from Maine and Maryland-I'm picky about my seafood. Can't rage enough on it, you guys offer fresh!! And for that I can't thank you enough-no wait- I can thank you.  It was delicious fresh and original.   From peeling the sock from the soft shelled clams to the spot on butter white wine broth for the mussels. We loved it.  But honestly, it's about the freshly shucked oysters.   I would spend hundreds, enjoy every shlurple of delicious filter organism, and want more.   P.S. the freshly shucked oysters  happening in front of our face, beat the kitchen on arriving vs the mussels and clams we ordered too. Now that's real skill. Probably will never happen to you, but it just happened to me and was impressive.   Loved it, give a go. Order the shellfish.   Btw, the clear chowder IS the best. Try that too.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "e2goTuVddLIT9Yz_6X6hCg"
  },
  "SqZ06Ft0apQEsgIUKTEgog": {
    "date": "10/18/2017",
    "text": "I really want to like the Merchant Oyster Company but my first impression was disappointing. I'm hoping to see improvements with age. My second experience felt like I was trying to force a relationship that wasn't there. The only real thing I like is that the location is convenient & they're open on Monday.   To start with everything on the menu is expensive and adds up rather quickly in comparison to the items served in established & award winning restaurants very nearby. Which is a bit baffling. It's overpriced compared to the rest of the neighborhood or established seafood city restaurants. Even the other places to get Hot Dogs  For an establishment that's just open. You can always get a table. Always.  Maybe they'll tweek their menu & prices soon because after the third experience, even as neighbors I just can't bring myself to try to go back again.  Even if other friends really want to try it since they're new. It's just too disappointing.   Food Quality & Drinks   The bar- The oysters are placed into about 3 large baskets at the bar and shucked in front of guests who sit at the bar. The older gentleman who shucked oyster was probably the nicest person working there and the highlight of the establishment! Smiled, made eye contact, - I've never seen someone so quickly work while being enthusiastic about pulling apart an oyster while showing their skill when asked.   The drink selection is decent but in the higher priced side. Each mixed drink or glass of wine was between $11-$15. They were all acceptable. I would have to say wine pours are inconsistent for the price and sometimes a bit on the short side. Which I wouldn't mind of the price was $6. But for their prices is a little annoying. They also don't have the standard mixers most neighborhood & city bars carry which is strange for the this area.  Eh.   Non Alcoholic selections are lacking. They don't carry iced tea. Which is just- weird. The water is already in the table when we sit down. And doesn't come with ice. Which just leaves us feeling compelled to  order something with alcohol from the bar. It feels coerced. Like by proving a crappy non alcohol drink, I've been pushed to get something I didn't originally intend. I hope they improve this with age and start carrying tea & fresher water with ice. It's noticeable that this part of the meal is lacking.   Dinner & Afternoon-  Lunch -  I found my soup & sandwich dull & under spiced. It was rather disappointing.  I expected something amazing like a crusty bread cooked to perfection with awesome insides. It was just. Eh.    The soup is very thin. Not at all what I expect for a restaurant of this caliber.   When I thought about putting salt into my soup I found the salt open to past diner's fingers. Which I found repulsive. The condiments on the table were already crusted over. And the napkin dispensers and tableware were already covered in past diners greasy prints.    My dining partners had the lobster rolls. They did not car for it. They said it was overly salty. And too soggy. Disappointing.   I get that the establishment is looking to have a New England beachside feel BUT since I'm not eating in my bathing suit slathered in sunscreen AND my bill is probably going to be close to $100 after food and drink after each visit then I'd prefer a cleaner experience where I don't have to think of those who sat in my seat before me.   The tables are quirky and cool looking. That also meant that when we sat at a table to eat there was food stuck in the crevices from the past dinners that had not wiped up clean. I wasn't a huge fan of knowing someone else's crumbs and leftovers bits were still in the holes in the table. The tables need vacuumed to get the food stuff out of the little holes between diners. Other people's crumbs are gross to eat above.   This place IS NOT kids friendly. There isn't a sign on the door that says no kids or 21 & over BUT they absolutely don't make anything for kids or have a children's menu. Ok. I get that they're going for being trendy. But this is a neighborhood. Every other restaurant nearby offers a kids selection OR reduced price kids meal. I know. I'm a neighbor whose kid eats at all of them. Trying to take the kiddo felt extremely unwelcome. The lack or kids menu & exorbitant pricing for anything for a child is just laughable and not neighborhood friendly.   So if you want to feel like you're eating beachside, it's authentic.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 17,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "6ilakhX1N-px9ZMQbprXgQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Why is everything so smudged with prints?",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6ilakhX1N-px9ZMQbprXgQ/o.jpg"
      },
      {
        "img_id": "k0PDHx1VflbT3nrF3yhjaQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Where&amp;#39;s the shaker to keep dirty fingers out?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k0PDHx1VflbT3nrF3yhjaQ/o.jpg"
      },
      {
        "img_id": "MkRAUHFl-DHA_pfOkKWTrg",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Cute packaging.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MkRAUHFl-DHA_pfOkKWTrg/o.jpg"
      }
    ],
    "user_id": "Jk0AcqPCVMfc_DTWO3SzwA"
  },
  "IjzeYeOdR17QfMYzhQflVw": {
    "date": "11/19/2017",
    "text": "After a long awaited wait, Merchant Oyster Company is finally open!   We went this morning, and for a Sunday, it was not too busy at all. We seated ourselves. The menu is pretty small, and self explanatory. The oysters are written on a mirror above the bar. From where we were seated, we couldn't see the oyster menu at all, so we had to get up from our table which was kind of awkward.  The waiter was great, and was able to recommend oysters despite us struggling with seeing the oyster menu! We ended up getting 12 oysters (at 3-4 dollars a piece), a pound of peel shrimp ($13, $7 for half a pound), a lobster roll ($23), and blueberry pie ($6).   The oysters were great--some of the cleanest I've had in the city, and the lobster roll that I got was amazing. I opted out of the aioli, so the version that I got was hot and buttery. The lobster and the roll melted in my mouth, which was amazinggggg. I wasn't a huge fan of the old bay chips that came with the lobster roll, but that was a very minor part of the meal.  All in all, glad that we went, and we'll be back. It is rather pricey, as our meal was over $100 for two people, but worth it for good seafood in PGH.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "huSzTZ1bdwVj7gQj1msUYQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Oyster menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/huSzTZ1bdwVj7gQj1msUYQ/o.jpg"
      },
      {
        "img_id": "O3QZnGRwdTJ83puD7v8Nvg",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Blueberry pie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/O3QZnGRwdTJ83puD7v8Nvg/o.jpg"
      },
      {
        "img_id": "Qtz3ceNWGWbrkduDmsRNKw",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Lobster roll sans dill aioli",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Qtz3ceNWGWbrkduDmsRNKw/o.jpg"
      }
    ],
    "user_id": "oWjEjoX_L9HeXnD4bKjw2w"
  },
  "hZQLXtdl-pS9ZVKvL2MzAA": {
    "date": "6/12/2019",
    "text": "Great ambiance! Very cool that you are able to watch the Oysters being prepared. A little pricey for some of the sandwiches. Creative cocktails. Fun ocean theme!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D62J5bXGtPXgXaI_9cO-7A"
  },
  "0wx5hYHT8F77VtpeuFuCbQ": {
    "date": "12/3/2018",
    "text": "Keeping this short.  Mindy and I love this place.  Awesome every time.  Mindy gets the Lobster Roll on every trip.  You should too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x3_WktDd9Xw96-OuKPG-nA"
  },
  "KtmTo8favfPUN0uxPEbcAA": {
    "date": "2/28/2019",
    "text": "Avoid this place like the plague.  Served two dead oysters.  when i complained the server just said sometimes that happens.   Most people can google how to determine an oyster is fresh, perhaps they should include that in their work staff training.   in addition to the oysters i order clam chowder.   i'm still looking for clams and it was more of a watered down version of eat n parks potato soup.   for my entree i had the crab grilled cheese.    crab definitely came out of a can and was certainly not close to the lump meat advertised in the menu.    i certainly do not mind paying top dollar got a good meal but this was a disappointment on all levels.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YYnx1KlpdHfJE7f5_flRTw"
  },
  "NAzk63TiyFrKAX7nDaBk6Q": {
    "date": "5/16/2018",
    "text": "AMAZING! The oysters on the half shell were fresh and delicious. The server was very knowledgeable in helping us pick them out from a wide selection of clams and oysters that ranged from Virginia to Prince Edward Island. We had the steamed mussels next which were SO delicious. And then the lobster roll was the best I've ever had - lobster meat was fresh and sweet, the roll was toasted and buttery. They also had a great drink selection to pair with everything. The pricing wasn't ridiculously expensive, either! Merchant Oyster Co is a little oasis in the city - I totally felt like I was on vacation at the beach! We will definitely become regulars here.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6fdXNC56j1IYm6Mz_3Mxjg"
  },
  "lBd6XqLZ6MofUUnC6qnCXA": {
    "date": "3/22/2018",
    "text": "A bit rough around the edges, but overall a pretty good experience.  I think mostly just 'being new' (ish).    The rough spots...  the upstairs is kinda finished...kinda not.  Large blank walls with oddly incongruent decoration gives it a sort of...\"crap, I forgot to decorate the upstairs, just throw something up\" feel.  But the table itself...old, chipped paint over weather beaten wood blank, was beautiful from a photographic backdrop standpoint.  Across the room, rocking chairs and an old chest.  O...kay...  On the table was a list of the oysters of the day.  At some point the wait staff (upstairs it's the barkeep) grabbed the list and never brought it back.  Just, you know, make two lists next time.  We were still ordering oysters at that point, but said \"surprise\" us, since the list took a powder.  The mignonette was a bit overbearing (hard to get the oyster taste through all the onion) but tasty.   There was hot sauce as well, and I think I recall cocktail sauce.  No other condiments.  I would liked to have seen more variety...horseradish, lemon, other.    The smooth spots...  Wait staff was friendly and accommodating.  The restaurant is nicely decorated overall...casual...an afternoon on the boardwalk.  The oysters were delicious.  And...the celery gimlet?  Divine.  So refreshing I wished it was warmer just so I could cool off.  It may be my new spring drink.  Boyd and Blair Vodka, lime, celery, and Cel-Ray soda, it was a nicely balanced cool drink of water.  That wasn't water.  Or watery.  Find a new metaphor.  Good drink.  I'd go back.  While there might be other oyster-specific spots I'd prefer, at it's worst, it's a nice appetizer and beer pre-function spot, and at it's best...well, I'll need to investigate the menu a bit more.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "DCAKyYwrhKEbxT8XIfPIeQ"
  },
  "8lcBPC8uP0STkNK8lr90HA": {
    "date": "6/7/2018",
    "text": "Came here with friends on a Saturday afternoon and it was very busy but we got seats right away.  There's outdoor seating and indoor seating by giant open windows so the place has a very airy feel. There are also many seats at the bar. They have a nice beer and cocktail selection and a large oyster menu. The oysters ranged in price from $2 to $5 each and the server was very knowledgeable and helpful in making recommendations. I didn't take off any stars for this, but our dozen oysters arrived at our table and within minutes were under water in the ice bath. It was a warm day but not that warm. We were disappointed to lose the brine on most of them but the waitress apologized and gave us a discount on our bill. The chowder was also very good. I'm looking forward to coming back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X1xp5QU9KS-DbK6-csoA4A",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/X1xp5QU9KS-DbK6-csoA4A/o.jpg"
      }
    ],
    "user_id": "E3RCyqHVXIgUFZbUVgr73A"
  },
  "TwBgiAfKfUySnFzVTFwrXQ": {
    "date": "5/22/2018",
    "text": "So much good food!! Lobster roll was amazing with toasted roll that was nice and light rather than dense. Clam stuffies were so good and huge! Great oysters too. And the service, I sat at the bar, was excellent!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7xmeW6anGfORMT5ybHoxvQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Clam stuffies, so good!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7xmeW6anGfORMT5ybHoxvQ/o.jpg"
      },
      {
        "img_id": "XR7ZLQBdANIKfyTTj4W4tA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XR7ZLQBdANIKfyTTj4W4tA/o.jpg"
      }
    ],
    "user_id": "TLfJLNcWTBe7sFou7RVy9g"
  },
  "smVKTnqfcZkJ4MAzXwQy3g": {
    "date": "10/16/2017",
    "text": "Visited Merchant Oyster Co. after a lot of anticipation. It did not disappoint.   Angelo the oyster shucker happily recommended some of the best oysters I have ever had. After some drinks, oysters, and raw clams (didn't know that was a thing), we ordered the clam stuffies. They were delicious and fresh with their house made cocktail sauce.   Cant wait to go back and explore more of the menu. Super impressed with the decor and the employee's hospitality!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w75y7hdLQUsY7nXDV_iVDg",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/w75y7hdLQUsY7nXDV_iVDg/o.jpg"
      },
      {
        "img_id": "6Yncnp7aH6J49jf_0jL-3Q",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6Yncnp7aH6J49jf_0jL-3Q/o.jpg"
      },
      {
        "img_id": "BJrHW0wBV8SUsJU2O440kA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BJrHW0wBV8SUsJU2O440kA/o.jpg"
      }
    ],
    "user_id": "b7Q30AyPifh7jCbdQz3o4w"
  },
  "Pifjk98oJo1V_Bb1DV3n4g": {
    "date": "5/5/2018",
    "text": "Hands down!! The best oysters in Pittsburgh. They had 10 different types of oysters, the holy water cocktail is amazing featuring Local, Maggie's Farm. The hot dog and burger was so tasty and I wanted another one but I was full. Amazing staff! A must for anyone visiting Pitts.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "H4mv2YUtQ3T_gHJO6ofIEQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/H4mv2YUtQ3T_gHJO6ofIEQ/o.jpg"
      },
      {
        "img_id": "Ap0_AUA7gS2rqOfZS3n-Hw",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ap0_AUA7gS2rqOfZS3n-Hw/o.jpg"
      },
      {
        "img_id": "F8eSCWO98wFTQhOVDB2kvQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/F8eSCWO98wFTQhOVDB2kvQ/o.jpg"
      }
    ],
    "user_id": "Md7Y7jhrXXbwycXfGfMf1w"
  },
  "JUKgfGRxk3auz4jFeoZEuQ": {
    "date": "10/16/2018",
    "text": "Great staff- friendly and know the product. Wide variety. Great drink selection and quality. Vibes authentic too- feels just like I'm back in Gansett. Price is the only conflict for me. But out here it all has to travel further I guess. Happy hours the way to go. Even have a Sunday one too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "iJELxrdYsVtHtk_W__PttA"
  },
  "qZeACL8za-lRCOsl8QL4nQ": {
    "date": "9/21/2018",
    "text": "I went there with some friends and we decide to never go back. The food was over priced and it wasn't that good. I had the new England chowder and it was so bland it had not flavor at all. One of my friend order a lobster roll and it was super dry, my order friend got a caesar salad and she said McDonald's had better and cheaper with a source of protein in them.   I won't go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "A4A_l7Hmk_rGWQsT0USVew"
  },
  "TILbTUoxt6I6zIUOM1PaCQ": {
    "date": "11/23/2018",
    "text": "They had a wait but was able to get on the waitlist online. We only had to wait 20 minutes but was able to order appetizers at a standup table which was nice since it was so cold out. Oysters are amazing anyway you get them!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oONJ9ShCman18hYoF_cAOw"
  },
  "uofvhWTtBdfE1CDFeiNVpw": {
    "date": "10/13/2018",
    "text": "One of the BEST places in Pittsburgh! From the staff to the food to the atmosphere, it was such an enjoyable experience! Would recommend to anyone!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UpsgFrYCWwgtWYjaFFuLkQ"
  },
  "_g5TyT92Ju4doMpiDEuxCA": {
    "date": "6/1/2019",
    "text": "Delicious. We split a clam boil and a half Caesar. The salad dressing was amazing!!! Made on site!! Food was delicious - everything in pot was fresh and cooked perfectly and seasoned to perfection. Drinks were delicious and pretty. FANTASTIC servers!  Friendly and treat ya like family!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NW3Q51sPaHGKs-jUcLzl_A",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Drinks.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NW3Q51sPaHGKs-jUcLzl_A/o.jpg"
      }
    ],
    "user_id": "4b09LRGadUhX_xMIjBHPdQ"
  },
  "4olm26EDFAd7qIQAPMS9Gg": {
    "date": "7/26/2019",
    "text": "We went for Happy Hour special. Totally enjoyed sitting outside which was cooler than inside. Got a assortment of oysters...which I totally enjoyed! Our server was very friendly and informed. We will go back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dvsCTaP7QAVadulkwFgZ_w"
  },
  "9Ldi6mwNdFJfYGXvXLJquQ": {
    "date": "6/3/2019",
    "text": "Loved all the food here! Great oysters, crab grilled cheese, and New England clam chowder! The mimosas are excellent here too!  Also the waiter was very friendly and relaxed. Highly recommend coming here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2oBoFwbEH3DT6rTxltFfsQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. New England Clam chowder, the crab grilled cheese, and a mimosa is what&amp;#39;s pictured.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2oBoFwbEH3DT6rTxltFfsQ/o.jpg"
      }
    ],
    "user_id": "9h__EvbrTesmSyLl79yCNw"
  },
  "_BuyWA2tPA0_gj5si5R9Bg": {
    "date": "3/8/2018",
    "text": "Merchant Oyster Company is one of my new favorite restaurants in Lawrenceville. We hit up Merchant on a Wednesday night around 6pm. It was a warm night, so they the windows open and the tables were setup outside.   Luckily, we got a table right away in the front of the restaurant. We shared a table with another couple - but there was plenty of room and we were comfortable.   There were only two waitresses for the whole restaurant at the time - it look a little longer to get our beers, but once we ordered and got the food.. it was delicious.   First, we ordered the New England Clam Chowder - you can either a cup or a bowl. The cup is enough, but if you love clam chowder like I do.. order the bowl! It is amazing!   Next, we ordered 6 oysters- it was my first time eating oysters. The waitress picked out a few different ones for us to try and they were delicious.   For my entree, I ordered the lobster roll and chips. It was delicious - it was such a reasonable portion of lobster meat. It is a little pricey, but for what you get.. it's worth it!   I'll definitely be back to Merchant soon!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "Yrv_2b33oa8C6BiDd8F8Ag",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Yrv_2b33oa8C6BiDd8F8Ag/o.jpg"
      },
      {
        "img_id": "gX1jAK4GBGGm3BaQ7RLrag",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gX1jAK4GBGGm3BaQ7RLrag/o.jpg"
      },
      {
        "img_id": "NTjzdDD8k6qNL2t6v1srbQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NTjzdDD8k6qNL2t6v1srbQ/o.jpg"
      }
    ],
    "user_id": "Lph6pJNcM2Hhrb6_5i3oBw"
  },
  "NLMvhcqPC-FbMMlUXXAbhQ": {
    "date": "4/15/2018",
    "text": "3.5 stars  We all shared oysters-- chefs pick. We were served 4 oysters each and there was a wide variety. They were really good, although slightly pricey.  I had the popeye salad and the red chowder (highly recommended by the waiter over other chowders).  The salad was delicious, and I'd definitely order it again. Very peppery and fresh. Unfortunately the red chowder tasted like a basic vegetable soup. I LOVE clam chowder and was excited to try this place. I would not recommend the red chowder and I don't know why two waiters both recommended it.   My friends had the chowder of the new and the crab grilled cheese and liked them but weren't raving about them.    We sat outside which was really nice on a beautiful spring day! Service was good as well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UxD_GZ9TdxaPv6PjC8hQhw",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Big bowl popeye salad; $12; 5/5 stars",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UxD_GZ9TdxaPv6PjC8hQhw/o.jpg"
      },
      {
        "img_id": "vb8RIDoTL37IuznsPhq_Fw",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Rhode island red; $8, 3/5 stars",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vb8RIDoTL37IuznsPhq_Fw/o.jpg"
      },
      {
        "img_id": "Ec2R8gHBp8tF0f7EmKne8Q",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Crab grilled cheese; $12; 4/5 stars",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ec2R8gHBp8tF0f7EmKne8Q/o.jpg"
      }
    ],
    "user_id": "vekZnPvP0s9LT8lEvGXnKw"
  },
  "efCPWNivdqgTdnwoDB6mwg": {
    "date": "3/9/2019",
    "text": "Do not come here if you are hungry. It is basically a hipster bar that is style over substance. The cutesy \"nautical\" theme (fish-shaped water decanters, welded-chain footrest at the bar, fishing floats and buoys on the bar) is obviously where they spent their money, not on the menu.  The cocktail menu is trendy and spendy. My Bloody Mary was pretty much the only drink I recognized, and came with so much ice it was more like a Bloody Mary Slushie. And came with skewered olives and a quarter slice of lime. Who the hell serves Bloody Marys with olives? Ten bucks for that. My husband ordered a Spuckie Sour, which was made with bourbon, Montenegro (what?) and fennel syrup. \"Oh, look, honey, they have fennel syrup! You love that!\". As if. Nine bucks for that.  We got a dozen tiny oysters from the East Coast. They were shucked right in front of us, but the guy sniffed every one to make sure they weren't bad before placing them on the tray. That was off-putting. $24 for that, and they were the least expensive oysters on the list. The toppings were one wedge of lemon and a little cup of something that might have been a vinaigrette. It had no flavor whatsoever.  We wanted dinner, not a can of \"imported, high quality\" mackerel, for $22, or a can of smoked sardines, for $24. So we split a \"full\" spinach salad for $10, and the Clam Boil for $22. The salad was okay, spinach with about 4 halved cherry tomatoes and a couple of paper-thin onion and fennel shavings. The dressing was supposed to be a lemon vinaigrette, but I had to recheck the menu to be sure. It had no flavor.  The Clam Boil consisted of an ear of corn, boiled to mushiness, half a link of andouille sausage, 10-12 each of small clams and mussels, and a slice of white bread smashed flat and grilled. It was billed on the menu as \"to share\". It would have been a good serving for one, and one of the mussels was filled with sand, to boot.  After spending over $80, we were still hungry. We went across the street to Pesaro's Pizza, and got a couple of huge, New York style foldable pizza slices with mushrooms for $7. We should have gone there from the start. We will never again go to The Merchant Oyster Company, and recommend you don't either.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MtlH132-GnC98kV8W6jKyw"
  },
  "A8uLx5sP0dIrMgCQ4Kn-Xw": {
    "date": "7/16/2019",
    "text": "Nah.  Hipsters put a spin on classic foods and I'm not liking it.  Really sad.  I was excited to try this place. Glad that I went but not going back anytime soon.  I thought about going back sometime for a hotdog at lunch but worried.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K83SsfjYAC-KsDzTVcYEFg"
  },
  "X4IYHlgl4QniPz8Fe7fOKg": {
    "date": "12/30/2017",
    "text": "I'm torn. I think that I really want to like it here but I don't know if I will. I hate to sound like a cheapskate but this restaurant is way too expensive for me to pop in and out of and make it a regular joint. And I just don't understand why the prices are so high.  We walked in and we were able to get a seat right away. We sat near the back at the long table so we shared a table with some other people, totally fine. The other people were actually very lovely and we had a great talk during dinner.  We only came in for a snack. Between the both of us we decided to share a caesar salad and a bread bowl of New England clam chowder. Now the Caesar salad was actually a half of a salad and the bread bowl was labeled as over flowing and crunchy and delicious. I will say that it was crunchy and delicious but it was definitely not enough for both of us. And because of how the bread was it's soaked in a lot of the soup so we were just left with little broth and just chunks of the soup. So my first idea of what the food could have been like or tasted like wasn't real great.  Also I understand the my idea what New England clam chowder is is like a creamy delicious broth with potatoes and clams and some other meats in there. What we got in the bread bowl was kind of clear it wasn't creamy at all. When we asked about it we were sure that's what the New England clam chowder looks like but it's still through me off. I will say though that the bread, once again, was amazing. I even saved the top of the bread bowl to eat for breakfast as toast the next day.  The salad was good but it had a lot of the lighter shades of Romaine that had more of a crunch to them but more of a lackluster flavor. It had tons of Parmesan and a lot of croutons. I could have gone for less of both of those things on my salad and more leafy greens. It wasn't bad but, eh.  Another thing that irritated me was that I kept on having to ask for water. The water was kept in fish shaped jugs on the table and they didn't hold much water, nor were they that cold. I just kept on asking the server to refill it, but I wish that they would have asked me if I needed more. The water jugs are also blue so you can't even see inside to make sure that they are clean, something because I'm a weirdo like to see. Just incase there are any floaters.  I think I want to try to go back and to really try something different in the menu. I really want to like this place because I love seafood but they need to do something about the prices.  Hopefully the next time will be better. I really do have hope for this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "QqYvrtAcFSuOh9KeR1C6Kg",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Bread bowl.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QqYvrtAcFSuOh9KeR1C6Kg/o.jpg"
      },
      {
        "img_id": "LymqD7BcW09LutBhQaPGhg",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Ceasar Salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LymqD7BcW09LutBhQaPGhg/o.jpg"
      },
      {
        "img_id": "bg820wTXQXJVhqpfEIwVLw",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bg820wTXQXJVhqpfEIwVLw/o.jpg"
      }
    ],
    "user_id": "-hietrA8M58asfpyJkCyiA"
  },
  "waAIjbIGIdBVFfTjVrxV-g": {
    "date": "4/8/2019",
    "text": "If you're in Lawrenceville and have a taste for seafood this is a great choice. The beer selection was very nice and the oysters were very fresh. But at $3-$4 each they should be! But there are plenty of other options on the menu. My wife and I elected to go with the seafood platter which if I recall was about $70. We were told that everything on it except the shrimp is raw and when we asked about the lobster that was included we were told that it was served chilled. What we found out was chilled meant raw and I have to say that was a little bit challenging. the  problem is it was not very filling and while it made for a great but expensive appetizer we were still hungry. So we ordered a salad and some soup And when all was said and done the tab for the two of us with 4 beers was around $150. I'm not complaining but we probably wouldn't make the same ordering selections when we go back. Just don't go there hungry and thinking you're going to fill up on oysters and shrimp and raw lobster.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Xu4B5p7fgymC2j4LGjTILQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Xu4B5p7fgymC2j4LGjTILQ/o.jpg"
      },
      {
        "img_id": "yqmNrOdcgiX_j729JYxcPQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yqmNrOdcgiX_j729JYxcPQ/o.jpg"
      },
      {
        "img_id": "6KpQHalz9FVcTzK7EzB3Fg",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6KpQHalz9FVcTzK7EzB3Fg/o.jpg"
      }
    ],
    "user_id": "KglzrviHcRiN0nreA3c_xg"
  },
  "OBXaDTf3O9wItxBgNeAhYg": {
    "date": "11/29/2017",
    "text": "I had been following this new business ever since I read about it in the newspaper so I decided to try it out. It is an off shoot of \"or the Whale\" in downtown Pittsburgh. The restaurant is set on two levels both with bars on each level.  Upon entry you will see the vast array of the freshest oysters picked imported from New England and the Atlantic seaboard. Since I arrived shortly after opening I could sit anywhere so I took a small table in the back.   The lunch menu is small but can be pricey. You can opt for appetizers, salad and chowder pairings or just salads alone. Sandwiches come with kettle cooked chips. I knew that ice tea wasn't on the menu so I had a chance to inquire about that. I was told that they really didn't have enough space for one at the time being but soft drinks are available if you prefer not to go with an alcoholic beverage.  I decided to go with the crab filled grilled swiss cheese and drank water. All of their water servers are in a glass shape of a fish. I got my sandwich panini styled. It wasn't too big but there was lots of cheese in it. I had to look twice to make sure the crab meat was in it and sure enough it was. The manager told me they do use a lot of genuine crab meat in this sandwich. I must admit it was different. Never had crab meat this way but it was indeed very filling and good. My sandwich and chips came to $12.00. A bit high but remember you are paying for the crab meat.  They have a gender neutral restroom which has a light sensor in it. Be aware of that in case you think there was a momentary power loss. My only pet peeve was that there was no purse hook. Again I told the manager about this and she told me that I could lay it on a table nearby. Unfortunately that table she was referring to already had things on it and I didn't want to disturb it. She will see about getting a hook for handbags.  This place has great potential and would like to see them add more items to the menu. I'm not an oyster fan per se but to include more seafood items on the menu would help it along with some more reasonable prices for the lunch time crowd. The restaurant is conveniently located at the corner of 41st and Butler St. Paid metered lot is close by if you are unable to find street parking.",
    "rating": 3,
    "rated": {
      "funny": 7,
      "useful": 17,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "e0qZxW4Neqs4sit0hsfrQA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Upstairs has own bar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/e0qZxW4Neqs4sit0hsfrQA/o.jpg"
      },
      {
        "img_id": "OonjVbrz_i9UXZJ2qw2zJQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. View from upstairs",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OonjVbrz_i9UXZJ2qw2zJQ/o.jpg"
      },
      {
        "img_id": "NyNPgZm2A5fnDWG_JhQhpg",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Here&amp;#39;s the real crab meat!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NyNPgZm2A5fnDWG_JhQhpg/o.jpg"
      }
    ],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "b3AlA9uxt2DhF7Eqqm2i1w": {
    "date": "5/16/2019",
    "text": "My daughter chose this restaurant while we were visiting Pittsburgh. It was a crowded Saturday night, but the waitress made room for us. She was very attentive throughout our visit. We each ordered lobster rolls, which were tasty, but not quite up to my Prince Edward Island standards. The chips were crunchy and fresh. If you can't get to PEI, this place is worth a visit",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xKS0_WX0oRkVi13qTLU_OA"
  },
  "8FuuqMPKd55lFUsUGWPUWA": {
    "date": "6/5/2018",
    "text": "I came here for dinner with some friends. We were able to snag a picnic table outside, which was nice! My one friend got there before the rest of us did and put in an order of peel and eat shrimp. We got there around 10 minutes later. Our waiter must have forgotten to put our order in because it never came out. We had to ask about our appetizer. Our waiter was nice and funny. He explained things to us on the menu and answered our questions. I decided to go with the chowder of the new and a Caesar salad. Our waiter stated that most of their soups have bacon in them. I'm not a fan of bacon in my soups (don't judge! Lol) but I love soup so my options were limited. The chowder of the new that day was a clam chowder with potatoes and spinach. I thought it was going to be a cream based soup, but it was a clear soup with a lot of potatoes and minimal spinach and clams. When i ordered the salad he said i could do a whole or half salad, which isn't on the menu. THEN, he stated that you could get the Caesar salad with white anchovies (which he raced about). So i decided to be a little daring and got the anchovies. The salad was okay, your basic Caesar salad. When my bill came, i noticed there was an extra $4 charge for items i didn't order. When i asked about it, the waiter said those were the anchovies. They are actually a $6 upcharge (what?!) but he only charged me $4. Again, this was printed NOWHERE on the menu and the way the waiter explained it, it sounded like it was a complimentary item that you could add to your salad.   Overall, I think Merchant has some kinks to work out. I don't know if I'll be back for a while... but if you do try it out, just make sure you clarify with your waiter about items that aren't listed on the menu.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7_6k-5XC5Rfy4hNUzuCWFA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Chowder of the new and half Caesar salad with $6 anchovies",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7_6k-5XC5Rfy4hNUzuCWFA/o.jpg"
      }
    ],
    "user_id": "K515IDRsyrZskeKl0ydtYg"
  },
  "REJpLolP32Ignss8OCfbqQ": {
    "date": "11/18/2018",
    "text": "This is one of my favorite places to come on a Sunday afternoon. The food is delicious, the service is good, and the vibe is welcoming and chill. I usually just eat and drink and read by myself and it's great. The lobster roll and pork roll sandwiches are both amazing. The seafood is fresh and the recipes are simple, but delicious. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "N8XXNR8bGMFWF1G4FKVV2g"
  },
  "E__H-bEqJiZ5PIivGFcM-w": {
    "date": "3/26/2019",
    "text": "Living in Florida, I eat my fair share of seafood.  So on a recent visit to Pittsburgh when my parents suggested Merchant Oyster Company, I wasn't expecting anything unusual.  However, it was a great food and hospitality experience.   The happy hour prices on wine and select oysters were a pleasant surprise, but I'll be back for the most delicious clam linguini and some of the best New England clam chowder I've ever had!  The service was great and the atmosphere was lovely.  I'll definitely make it a point to come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yV2OsUGVK8zsEnACOdiKvA"
  },
  "Ky3Mi1xEoXv_hDNFPYGUYw": {
    "date": "5/23/2018",
    "text": "Holy smokes.   Had a late lunch here and was not disappointed. The atmosphere is perfect for first dates, lunches, casual or romantic dinners. The staff was also incredibly friendly and helpful.. it truly felt like walking into a local New England oyster bar.   Shared a few James river oysters, lobster roll, and clam chowder.   The oysters were cool, succulent and tasted like a July afternoon on the coast. Fresh, oceanic and beautifully presented.   The lobster roll was out of this world. Toasty buttery roll, generously stuffed with sweet juicy lobster..and tastefully garnished with fresh citrus zest. Split between two people, this was more than enough.   The clam chowder also did not disappoint. Hot buttery smooth broth. Loaded with perfectly cooked potatoes and umptious lumps of clam.   Would absolutely recommend to a friend and will undoubtedly be back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pw7Q2_DDUXONKqcmuNAu9g",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Lobster roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pw7Q2_DDUXONKqcmuNAu9g/o.jpg"
      },
      {
        "img_id": "XlWUeds0Y1LYNHy34uQFZA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. James river oysters",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XlWUeds0Y1LYNHy34uQFZA/o.jpg"
      }
    ],
    "user_id": "pn87T1Mg9mZ06tMyxLMa8w"
  },
  "440eAzRtsFznT4c9OF9Hag": {
    "date": "7/15/2018",
    "text": "We went here for after dinner drinks and had a wonderful time sitting outside at the picnic tables. This spot is very low-key and great for people watching with it's corner location on Butler Street. Also, the drinks are great and artfully crafted.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BvZUqGzhMKFgFtezNbZ73A",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Seafoam",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BvZUqGzhMKFgFtezNbZ73A/o.jpg"
      }
    ],
    "user_id": "HH65vzWc1HHPFAm6QLEkvw"
  },
  "Hh6aNLYHT2cTW9ecyQXD7A": {
    "date": "6/2/2019",
    "text": "Best and only place to get oysters in Pittsburgh! Great service and food!!! Great atmosphere knowledgeable staff!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9CyMamXw2ssYQjhLa34Wsg",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Oysters",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9CyMamXw2ssYQjhLa34Wsg/o.jpg"
      }
    ],
    "user_id": "Br9jTAQhd-RJwIzXMofMUQ"
  },
  "S7L73k5I1qo7cQFu9vKuwg": {
    "date": "11/12/2018",
    "text": "We came here for my wife's birthday.  My first impression was how cool the decor was - very northeastern nautical.  I did make a reservation and they had a little card with our name on the table.  We got a bottle of wine, a dozen oysters, cups of New England style chowder, and the warm lobster roll.  The wait staff was super friendly and helpful when deciding what oysters to pick and we were very pleased with our selection of 4 each from 3 varieties.  The soup was out of this world delicious!  Creamy, but a nice balance with broth.  The flavor was excellent and it was very clam heavy.  The lobster rolls were also fantastic.  I had never had a warm buttered roll before and it was a great change of pace.  The brown butter really brought out the flavor of the big chunks of lobster.  We were very, very pleased with every aspect of this place.  I didn't mention price because this was a \"splurge\" dinner for us, so that wasn't really a factor. I would absolutely like to go for happy hour to take advantage of their specials.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "abROVDaULElMtcpiCuNBHQ"
  },
  "IawS28nDnG-ocAeSyEoncg": {
    "date": "3/2/2018",
    "text": "Going into this dinner, I was really hoping to add another favorite oyster spot to the list. Esthetically, it's a super quaint nautical themed establishment. After looking at more pictures on yelp I did find out they have an upstairs which is good since it's pretty tiny.   Something that excites me is when oyster restaurants have happy hours. This is something Merchant Oyster Co does from 4-6. You get half off oysters, wines on tap and a hand full of beers. Not too shabby!   I have only ever had cooked oysters so I was very new to the raw oyster game. The bartender gave me a little lesson and offered to let me try 1 of the easy coast and 1 of the west coast to get an idea before I made my selections. Usually, when people say do you want to try something that means it's on the house and well, when I got my bill those two tiny oysters I was given to taste were surely not on the house.   I ended up trying the Chelsea gems (highly recommend if you are new to raw oysters or oysters in general). These are from the west coast and are very light in flavor. The second kind I ordered was the salten rock from the east coast. These had a little more meat to them and like in the name had a higher salt content. The two that I was given to taste were the Kusshi and one from the east coast which I can't remember the name of.   For my dinner I ordered the lobster roll. This is something you can get hot or cold. However, my waiter never asked how I wanted mine prepared I had to mention it to him. The only reason I knew this was because a friend has ordered it both ways and recommended it hot. Another thing my waiter didn't mention was you have a choice of salad or chips. I didn't know this until after I was digging through yelp pictures and I seen someone else have a salad with their sandwich. I would have preferred the salad over the chips.   Anytime I have ever gotten a lobster roll it has been mixed in with a mayo dressing and accompanied by celery. Mine came out missing all of those items. My friend grabbed the menu only to find out the small print read that the Aioli/celery slaw was an extra $2. I've never heard of anyone charging extra for something that is supposed to be included in this dish. The lobster roll is already outrageously priced in my opinion and then there is an additional fee for the mix-ins that should automatically be \"mixed-in\".  Needless to say my bill was more than I like to spend on dinner. Especially when this dinner did not meet my expectations. Also, when our bills were brought to the table my friend caught a mistake on one of the happy hour items. Moral of the story if you come here read every line with a fine tooth comb.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fxNEvQmcBd_cqhjtQg4duQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Bel Air Sour",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fxNEvQmcBd_cqhjtQg4duQ/o.jpg"
      },
      {
        "img_id": "FU0WEx_i43kSO9Z9R7J1QQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Chelsea gem x3, Salten Rock x2",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FU0WEx_i43kSO9Z9R7J1QQ/o.jpg"
      },
      {
        "img_id": "ijW-zulraBgpkg_a1DUyxA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Lobster roll",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ijW-zulraBgpkg_a1DUyxA/o.jpg"
      }
    ],
    "user_id": "mYJW4-M4tcRygSwdT3A6Ww"
  },
  "b_0-21FDpjMxlCvonfZ4pA": {
    "date": "7/21/2019",
    "text": "Menu was good, food was good...service was mediocre to poor and cleanliness was average. Very expensive!!! This is a good restaurant that will fail without better service!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5aGQt51subjg_DCtoF6KOw"
  },
  "1oxNHMv70C5wmrP3_CYyxg": {
    "date": "8/3/2019",
    "text": "Fantastic oyster joint. We had a selection of six different kinds, all were great. Very clean, no grit. Topped off with wonderful cocktails and steamed shrimp. Would absolutely come back.   And every member of the staff was helpful and friendly. Mark begins the bar took great care of us!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kLA_RfeEIUYWtTXTwzdaMA"
  },
  "--vD30KlDMgRxj8HNt3GnA": {
    "date": "7/25/2019",
    "text": "TL;DR food is good. Service by the guy who seems to coordinate sitting is less than acceptable.  We went last week there and we wanted to sit outside. It was full but the lady we talked to told us that she will have a table in 20 min. We the table became available we went to sit and this guy came to tell us that the table is already reserved and we cannot sit there. After 30 min of waiting we left without eating.  This week we went again. This time we made a reservation with the note that we want to sit outside. We arrived there in time. Tables were occupied but 2 became available in no more that 5-7 min. The same guy came to us and he pointed us to a table inside. We told him that we requested a table outside and ... Surprise, surprise... He said that they don't take reservations for the outside tables. (Huh ? What about last week ?) We then asked to sit outside and he said is not possible because is a group in front of us that will sit there. Okay ... What about the other table ? At which point he finally decided to give up so he said we can have it if we wait until they are cleaning it.  With such a service, I prefer to move my business somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ski2mVBPWQvZhz1Jqz4Kw"
  },
  "9fsdbFPKeFXboDIdCB-mRg": {
    "date": "7/2/2019",
    "text": "I popped in here on a Saturday morning by myself just to get a beer and a lobster roll. The bartender was super friendly and quick to provide service, the beer was awesome, and the lobster roll was incredible. At first I was kind of surprised by how small it seemed for the price, but once I dug into it I realized how much they really packed in to the sandwich (you get your money's worth). Manager/supervisor also stopped by to ask how I was liking the lobster roll. Coming from someone who grew up eating seafood on the East Coast, I loved it here! Will definitely be back sometime soon, probably for more raw bar items next time!  Other info - multiple chairs / picnic style tables allowing for outside seating. I believe you are able to call ahead and reserve tables for Saturday or Sunday brunch. Parking is available on either side of the street (pay at meter or via phone app) and a small lot is also available just slightly past the restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "fDV3oqYwVSGy9ZYMmbPrPw",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. fresh oysters",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fDV3oqYwVSGy9ZYMmbPrPw/o.jpg"
      },
      {
        "img_id": "mvKitFXLuoqub-fom2tCsQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. sample beer list",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mvKitFXLuoqub-fom2tCsQ/o.jpg"
      },
      {
        "img_id": "3ZXDv2DGMZ3Dc5l9cGulkQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. cocktails menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3ZXDv2DGMZ3Dc5l9cGulkQ/o.jpg"
      }
    ],
    "user_id": "lXva_LKlJM8Tgn7UXqOHEg"
  },
  "iccM0lVDPHV-aDbf0z98hg": {
    "date": "9/13/2019",
    "text": "Great oysters and it's even better if you stop buy at happy hour when the oysters are half price. Because of the decor and smell you would think you were on the beach at the Ocean. The staff was very nice especially the shucker so if your on Butler street stop in. Plus they have a nice bar",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "hM45gTN9NUThoOaJhIP3ew",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Bar",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hM45gTN9NUThoOaJhIP3ew/o.jpg"
      },
      {
        "img_id": "SzXrzWvDgcrT6H9Y8J04cQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Lots of oysters",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SzXrzWvDgcrT6H9Y8J04cQ/o.jpg"
      },
      {
        "img_id": "qzRoIXpN9ZztW0qQgU1Y0Q",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qzRoIXpN9ZztW0qQgU1Y0Q/o.jpg"
      }
    ],
    "user_id": "3xBFFH866WoySDG7uuwBSQ"
  },
  "qpkqGUI4dLw-23uWJou9jA": {
    "date": "9/14/2019",
    "text": "Let me first preface this review by saying I'm from Maryland... born and raised. I know good seafood. I was pleasantly surprised with Merchant. We stopped in for a late dinner on Friday night. Both of us ordered the CBLT (crab BLT) and it was awesome. I have a food allergy and they handled that appropriately which I really appreciate. The old bay chips could've used more old bay.  I also ordered the Merchant Rose cocktail which left a little to be desired... next time I would probably stick with wine or a beer. Our waitress was really friendly and attentive. Nice atmosphere with options to sit inside or out. I would love to go back for a happy hour or brunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WVEFddGzKKec0Wj9eE9NKg",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WVEFddGzKKec0Wj9eE9NKg/o.jpg"
      }
    ],
    "user_id": "R_1-VxesFgjWv3SduAapiA"
  },
  "yeCO5nSefZsfiCxzm0sesA": {
    "date": "9/14/2019",
    "text": "We couldn't have had a better experience here last night. The wait staff and service was so attentive (in a good way) and friendly. Jake and Whitley behind the bar were spot on, Andrew and Dennis were super personable and helpful. One of our diners is from the NE/Boston area and thought the food was quite authentic. The linguini & clams was excellent. Oyster shooters are a must. Clam chowder (red) and other apps were good. The beer selection is local and great.  Will be back her for sure!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YPHC-iw4V5L0epdbx2WeJQ"
  },
  "gT0KfQhsno75u6kHmNVHKg": {
    "date": "6/12/2019",
    "text": "The food is so tasty and fresh.  We shared the clam boil, which is perfect to share.  Easy atmosphere and knowledgeable staff.  The homemade cocktail sauce is really tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "b68rBk_6X8iwZqICyx8lDw",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b68rBk_6X8iwZqICyx8lDw/o.jpg"
      },
      {
        "img_id": "BxhP0ZoZONUSVGaWw_yuUA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BxhP0ZoZONUSVGaWw_yuUA/o.jpg"
      }
    ],
    "user_id": "_EPzTjxyIths4TOsMogalg"
  },
  "Wn__RtQAu_tnRThpkj9VBQ": {
    "date": "8/14/2019",
    "text": "Omg I love their oysters so much. You can't pass up their oyster happy hour. I tried so many different ones and none of them disappointed. Although I only would come back during the happy special because the rest of the menu is very small and not at all child friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y5SHjnFi5P2BytM5lPBnBQ"
  },
  "TUoTbLH8ZGmxWLMx0tznXA": {
    "date": "12/29/2018",
    "text": "Merchant Oyster is one of my favorite places to go when in Lawrenceville. The place is decorated as if it were a ship. The servers are very upbeat and nice. I got to meet the owner and I can see why it everyone seems to enjoy working there, he was great.   The the oysters were amazing. The new england clam chowder was amazing... BUT LET ME TELL YOU ABOUT THE LOBSTER ROLL. Omg I have never had a better hot lobster! I love it so much I had to get it twice in one sitting. The roll was crisp on the outside and soft on the inside.. The lobster was warmed to a perfect....A PERFECT amount of heat. The butter on lobster had it glistening and made it feel like someone was punching the inside of my mouth with some flavor gloves. POW!   They also do a cool competition call the suck n shuck the first monday of every month...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Auz8javVvugGbz-Tkbvicw",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Auz8javVvugGbz-Tkbvicw/o.jpg"
      },
      {
        "img_id": "mp-GOKpAAU03nbDlahdU1g",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mp-GOKpAAU03nbDlahdU1g/o.jpg"
      }
    ],
    "user_id": "Nnzn3dwE_GQhxdzTFH3DNg"
  },
  "GzITg_7zYswS-whFQ14_oQ": {
    "date": "8/27/2019",
    "text": "Came here with high expectations and left disappointed. Started with the the fishermen's plater the lobster tail and claw was slimy and fishy definitely not enough to split like the menu said and definitely not worth $75. Also had the $25  lobster roll that had really good flavor but lacked what makes a lobster roll a lobster roll LOBSTER! Definitely not worth $270 for 4 people. I wouldn't waste your money. Way better places in the city.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "G3p6CPmlkUU5S26qRoylBQ"
  },
  "s4VkUisJ8BOF4FGS7gTMCg": {
    "date": "6/30/2019",
    "text": "Great happy hour for oysters or drinks! The decor is charming in a New England way, and really makes you feel like you're on vacation. They have a good selection of happy hour oysters as well as regular priced oysters. The service is good and it's a pretty large space with an upstairs section too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LjcURB6OdxTkZVUKuN2G4w"
  },
  "9GRlbgUFq29QX7hMYQwhNg": {
    "date": "9/2/2019",
    "text": "Cool place - would come back during happy hour and try more types of oysters.  Crab and artichoke dip was amazing!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WP4fxh1_O7JycFmeIntw_w"
  },
  "xmejPAfp81hywKPtIrz5_A": {
    "date": "7/17/2019",
    "text": "As so many of the other reviews say... their happy hour is great! I tried a few of the happy hour oysters and loved them. Their new England chowder is less creamy than I am used to, but still pretty good. Very nice seafood place in the burgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9ofvsq_VFSpdLeKrH5CZA"
  },
  "LSFrb4bK5mjmMc8NFvNm4g": {
    "date": "9/22/2018",
    "text": "The ambience and decor of this place is spot on for a seafood restaurant   First off, I don't like oysters so I know it seems weird to go to a restaurant that has oyster in the name!  I started off with the Merchant Rose which was very refreshing - it contained tequila, rose and bubbles. I highly recommend it! It's seemed similar to a French 75. For my entree I got a lobster rolls (warm). It was better than average but didn't wow me!  I also felt like I got a little cheated on lobster meat because I had a lot of bread leftover. The chips were average. We shared the Whoopie Pie for dessert and that was amazing!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yvkDzpok8Wrm_SaGBG3OFg",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yvkDzpok8Wrm_SaGBG3OFg/o.jpg"
      },
      {
        "img_id": "axzOtMKNTEYSvtF96k4FkA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/axzOtMKNTEYSvtF96k4FkA/o.jpg"
      }
    ],
    "user_id": "UJaI94I_fxd4--ngts3gDA"
  },
  "Ub4VY84VWkzaLlZyCpxd8A": {
    "date": "7/16/2019",
    "text": "With the kids and hubby out of town, and the promise of a beautiful day before me, I ventured into the Lawrenceville area of Pittsburgh to explore the promise of an abundance of eateries to start my adventure. While walking down Butler St. I saw a cute corner restaurant called The Merchant Oyster Co. a cute seafood restaurant that was cozy and had a wonderful smell coming from within. The small restaurant had a good crowd and I was told to find a table and seat myself. I ordered the Lobster Scramble which was a savory portion of soft scrambled eggs, lobster, spinach, herbs, served with toast. The portions were just right and the Lobster was tender and there was plenty of it which I really appreciated because I was able to have a little lobster in almost every bite! I also ordered the Grandma Mosa which was a twist on a regular Mimosa with the addition of vodka. Yum!!!! The service was wonderful and my waitress and the staff were all so friendly and accommodating. Definitely a spot you'll want to explore and enjoy for dinner or brunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pRHE4jAaE9JztK4czZLwRw",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Lobster Scramble with plenty of lobster.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pRHE4jAaE9JztK4czZLwRw/o.jpg"
      },
      {
        "img_id": "IUP7dQLGb3rlr5Bq_ChvvQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Grandma Moss and Lobster Scramble for Brunch.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IUP7dQLGb3rlr5Bq_ChvvQ/o.jpg"
      },
      {
        "img_id": "5f-gunNDu9wXLqTSbYD-mQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Adorable and beachy!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5f-gunNDu9wXLqTSbYD-mQ/o.jpg"
      }
    ],
    "user_id": "tq_D5idg5kllCLaFcRlnaQ"
  },
  "Zy1rkjRM_63mzk5Xf3sPfQ": {
    "date": "4/24/2019",
    "text": "My boyfriend and I had a delightful Valentine's Day dinner here two months back, so this review is a bit overdue. We walked in and were seated by a member of the staff. The hosting/seating situation seemed a bit confusing, but since we had reservations I knew we'd have access to a table at least.   Our server was friendly and attentive without being overbearing. He knew the menu well and made good recommendations for me regarding my dairy allergy. We started with cocktails (I loved the Merchant Rose) and a dozen oysters. The oysters were fresh and absolutely delicious, definitely on par with the excellent ones at nearby Muddy Waters.   For dinner I had the burger with bacon, spicy mustard, and a runny egg on top. It was incredible and not overcooked in the slightest. My boyfriend ordered a half portion of linguine and clams as well as the lobster roll. He polished both off very quickly! We've eaten at a lot of wonderful restaurants, but I honestly can't think of a single thing I'd change about our meal. It was a really special experience, and I can't wait to go back once it's a bit warmer so we can sit by the open window.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zPwZQEVmFg9cbmsEwLpA6g"
  },
  "u_LGSTJgt2qg56CHhOMBCA": {
    "date": "7/6/2019",
    "text": "The oysters were great and a good price. I was disappointed in the beer selection but the food was great and waiters/waitresses were pleasant. We want to go back to try the lobster roll.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ltJ6UR7deTWoPMej1AW2jQ"
  },
  "J0i74bkvdW9Wruv-0LKP0Q": {
    "date": "12/30/2018",
    "text": "I stopped by here a couple of Saturdays ago with my wife for lunch.  We had been by Merchant Oyster Company a number of times before but had never gone in.  However during the Joy of Cookies tour this year we ended up looking at the menu and then decided to make it a point to head there the following weekend.  The inside of this place isn't very large with some bar seating, a few tables and then a couple of high top tables.  They have a chalkboard menu with all of the oysters that they have that day and everything is nautical themed.  That means the the foot rest at the bar is made from a chain and then the pitchers of water are actually fish shaped.  For lunch on this day I decided to start off with a cup of the seafood chowder and then ordered the crab grilled cheese for lunch.  Meanwhile my wife ordered the lobster scramble and since we were both happy with what the other person ordered, we decided to split our meals.  In no time at all my cup of chowder was at our table.  It was thick and hearty and I was super impressed with how much seafood was actually inside of it.  After I had finished my soup we waited for a bit before our entrees came out to us.  I wouldn't say that it was a noticeable amount of time but our waiter apologized to us as apparently he forgot to put in the rest of our order.  It was nice of him but unnecessary as his service was good and we honestly didn't think that the service was slow. In any case, once the food got to our table it was easily worth any wait we had for it.  My crab grilled cheese was absolutely loaded with lump crab meat and Swiss and had a nice and crispy exterior.  It tasted great too and I was unable to find any fault in it whatsoever.  My wife's dish ended up being just as good as there was an ample amount of lobster with her eggs and the eggs themselves were light and fluffy.  The herbs that they had put on top of the eggs made the dish taste fresher too!  The bottom line for me is that I would head back here again in the future.  Everything that we tried was fantastic and my wife and I were both impressed by the seafood portions in our meals.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "mrQ_D5Fp3C_DJUIxc4rvPA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Crab Grilled Cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mrQ_D5Fp3C_DJUIxc4rvPA/o.jpg"
      },
      {
        "img_id": "kYMxyiydOaWU6ONOPXZBOA",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Lobster Scramble",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kYMxyiydOaWU6ONOPXZBOA/o.jpg"
      },
      {
        "img_id": "HKwGsRSBW921c-kMZOvFSQ",
        "caption": "Photo of Merchant Oyster Company - Pittsburgh, PA, United States. Seafood Chowder",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HKwGsRSBW921c-kMZOvFSQ/o.jpg"
      }
    ],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "4BeCr_GqocJUS5KMuo4d6A": {
    "date": "12/10/2018",
    "text": "With such an affinity for oysters but an equal disdain for shucking them at home, I always prefer someone else to do it. The oysters here we're without a doubt the star here, and coming on a Sunday luckily meant they were 50% off. But let's face it, I won't pay $3-4 for an oyster that often.  Special kudos on their horseradish which was especially good and a nice mix of Washington and Canadian oysters (which I'll take over Atlantic any day).  I also enjoyed their caesar salad and the draft beer I had. Where they didn't hold up in my opinion we're the final two courses. I didn't particularly enjoy their New England clam chowder and the bread bowl was a let down for me. It might have clouded my judgement a bit, so next time I'd forgo the extra carbs.  For dessert we tried the blueberry pie and apple cake, neither of which impressed me haven't been to New England on numerous occasions. The blueberry pie was a bit burnt and tasted solely like cinnamon. They were unfortunately out of Whoopie Pies (or Gobs as I prefer) as I would've ordered one of them instead.  I look forward to stopping back, but I might just stick to oysters next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dhQOA8-FdpA6D0hNhXEYIw"
  },
  "EXLmc4NeJcvbhQdmD_L6YQ": {
    "date": "6/6/2018",
    "text": "I've been to Merchant on two separate occasions now and I have to say I'm really torn about what rating to give this place. To be clear this more of a 3.5 star rating but I don't have that option.   The first time I came I ordered about 8 oysters since they were half off during happy hour. All of which were delicious and reasonably priced for half off. As my main course I ordered the grilled cheese. It sounded amazing as I read the description but it fell short of my expectations. It just didn't blow my mind or make me wish I could have it again. After that experience I was really on the fence and would have probably only given it a 3 star rating at most.  My second experience I went on a Sunday for half off oysters. I ended up just ordering about 15 oysters and enjoying just that with some rose outside. I love the toppings options they have for heir oysters. It allows you to switch it up so you aren't eating 15 of essentially the same thing. I would have rated this experience a 4/4.5.   If you are looking to get oysters I would definitely suggest going during happy hour or on Sundays. The oysters are pretty expensive so I personally wouldn't have ordered them half off. I would also suggest sticking mainly to oysters. My friend ordered a lobster roll and she wasn't impressed with her meal either. She wasn't asked if she wanted it hot or cold and she wasn't asked if she wanted the mayo. She didn't see that it was extra for mayo on the menu so her roll was pretty bland.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-Y6tXYPYqeVy37-L5p0rMw"
  },
  "ea48pof4Fu-xYwt0uR70TQ": {
    "date": "2/14/2018",
    "text": "I have been to Merchant Oyster twice in the last week, and I am in love.  First, I use to live in Connecticut and I vacation in New England, so I was very excited when MOC opened, so that we could have a bit of the coast back here in Pittsburgh.    My first experience was lunch (with clients) on a very cold afternoon.  We were one of two tables seated, and it was perfect.  The waiter was excellent in explaining the oysters that they had.  We went with a dozen so that we could each try a few and they were as described.  There was an older man who was helping to prepare the oysters, and he brought over olive oil and told us his trick is eat the oysters with a bit of lemon and olive oil.  I used to use hot sauce or vinegar -- I was missing out!  Olive Oil and lemon is the way to go to really taste the flavor of the oyster and brine.  We each got different chowders - the Rhode Island Red was excellent.  I finished up with the crabcake.  It had barely any filler and great flavor - almost too much to finish.  My colleagues had the Rhode Island White chowder and the Crab Grilled Cheese and they loved their food too.    My second experience last week was dinner with my husband.  After lunch, I was so excited to share with my husband that they had Narraganset on draft (just little bits of home).  So, we came out for a Saturday evening date night.  We went with a half dozen of oysters and could have done a dozen more - they are amazing.  My husband went with the traditional clam chowder and I went with the chowder of the new.  Chowder of the New was my favorite of all of the chowders.... claw meat, cod, muscles and clam... very hearty!  Coming from NE and having had many a lobster roll, the price is fair.  You easily pay $25-30 / roll in all of the NE states.  There was less lobster on the roll than what we've gotten on the coast, but also, I can tell you that I've been on docks when they are pulling lobster off of the boat and then making my lobster roll.  You have to adjust for cost and locality.  It's a fair price.  We ended with Blueberry pie.  All in, it was a great date night dinner and it was under $100 (includes two pitchers of Narraganset as well).    We will certainly be back, as long as we can find parking... that is my only con for MOC.  All of the great restaurants are opening up on Butler St. and it is a pain to get a parking spot.     PS - nothing needed salted.  I see the reviews on the salt.  I get it.  But really, everything was seasoned appropriately, so I wouldn't let this deter you.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9fW8gXT3EKP_aNIKtJHZQw"
  },
  "3lQ8Vo_wwTCiVIEchZ4yjw": {
    "date": "1/18/2018",
    "text": "Adelina's review was eerily reminiscent of the experience we had last night. I was actually debating on reviewing because I wanted to like this place so much. The restaurant was pretty empty when we walked in which was surprising since it's so new. I figured it would be packed, but there were only a few people at the bar and one other table. We were greeted by the bartender and sat at a table. The menu is very small and some of the items are pretty pricey. We had quite a few questions which our server gladly answered, though he couldn't tell us much about the different types of raw oysters and said that they were mostly new to the restaurant. A typed or written menu would have been helpful. He told us the soup of the day was a chorizo lobster stew. My boyfriend ordered it and our waiter came back a few minutes later saying the kitchen changed the soup of the day to a  southwest clam and oyster stew. My boyfriend said that was fine and he'd get that instead. Our waiter then came back again a few minutes later saying the new soup wasn't ready so we both got clam chowder. Strange.  A cup is $4 and a bowl was $8, I asked the difference and he said the cup was 8 oz and the bowl was double (16). I made a joke to my boyfriend saying at an awful restaurant I worked at once they used to say the same thing and the bowls were the same size... not double. Well, the same thing is going on here. For $8 we got the same amount of soup that should've been a $4 cost, just in a shallow bowl instead of a tall cup. Regardless, the clam chowder wasn't really a creamy thick soup. The base actually was more like an oyster stew with a cream broth - very runny and thin to the point where I thought we got the wrong soup (but did not say anything). They forgot one of our oysters so we had to request the last one. Our water was only filled when we asked. The clam stuffies we ordered by recommendation I didn't like at all. My boyfriend ate both and seemed to be \"meh\" about them as he thought they were oddly sweet and I thought they were incredibly salty (weird). All in all I think they are  still trying to figure out how to run as a restaurant. The oysters - which they should play up more and really stick to were fresh and tasty. Truly good oysters, especially for the Pittsburgh area. The decor was whimsical but the food was overpriced for what you get and was just ok, the service was confusing based on the kitchen and food items, and the alcohol was WAY overpriced. Think $13 for a specialty cocktail. If Merchant Oyster Co. stuck to what they know - oysters - they'd be WAY more successful. I hope to see them succeed but we both agree that if things don't change, in the area of Lawrencevill they probably will not.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "scXixoPyudQlNi7TJ7WQ5g"
  },
  "1bYFTfsFVIYqnMiIEl8keg": {
    "date": "12/4/2017",
    "text": "If three stars is average, this place is definitely below average. Everything on their menu is expensive and not an adequate amount of food. We ordered a $12 salad. For that price you'd expect some protein and bread to come along with it, but it only was a giant bundle of spinach with a few tomatoes and onions. Are you kidding me?? I left hungry. Also, if you're in the mood for oysters, head over to Muddy Waters in Shadyside. The oysters are $1 cheaper and the the scene is even better with their live music.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "NdQ_t53MJdDJbyVkIELfCA"
  },
  "IoKCKvnN-rQEqPK-CeTCWQ": {
    "date": "2/11/2018",
    "text": "Really great oyster and beer selection. The New England chowder was also the best I've ever had. Very attentive service as well",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hmYwHPV4hugsILugebQ2rA"
  },
  "Zf56P6tfEm8fuyIVJKHDPg": {
    "date": "11/30/2017",
    "text": "Just had lunch here and was very disappointed. If you are going to be a fresh seafood spot and charge high prices then your staff should be knowledgeable and quality high. Was dining with a friend and we both got a bowl of soup. Seafood quality was poor. There was a sandy grit in mine which comes from not cleaning shellfish well enough. Also a ton of bacon pieces for being a seafood soup. Lastly, we shared a crab grilled cheese that was inedible. Really fishy smelling crab. We left it on our plates almost uneaten and the waiter never came by to ask how our meal was and didn't ask why our sandwich was barely eaten. This place needs a lot of improvement.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "pdr67IIu5cwTTWDJrzmZhQ"
  },
  "MyhV50QOCb1URYLucM72ag": {
    "date": "11/3/2017",
    "text": "Pretty overpriced for the quality of food. The canned fish was a strange addition. Lobster roll tasted like salt and butter. This place is seat yourself which makes for some chaos. The best part was the chowder.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "4BBfJpDxMWYJe5DZxLGKLg"
  },
  "MmoSW-nwKtt_wWWeb5nbTA": {
    "date": "10/26/2017",
    "text": "I went to Merchant last night with my friend and sat at the community style table in the back on the first level by the open kitchen. I've been waiting forever for this place to open so my excitement level was high. Unfortunately, my expectations were not met during this first trip. Let me start with the good: we ordered mussels, which were delicious. The broth was just the right amount of garlic with hints of white wine and my palate was pleased. The garlic bread that came with it was perfectly toasted and I definitely wished there was more of that to go around. For our second course, we both opted for a lobster roll. The lobster was cooked just right. That said, when you order a lobster roll- the expectation is that it will come on a thick roll. That wasn't the case here and the lobster came on sandwich type bread that got soggy very fast. I think the execution was just kind of off because of this. The chips that came with the lobster roll were just not for me. The food was not inexpensive. Food overall was a 3/5. Now for the not so good: when I ordered my first glass of wine, it came clearly under poured. I know this because I've bartended for years, not because I just wanted a huge glass of wine. Luckily, when I spoke up, the woman sitting at the end of the community table (who I assume is either the manager or owner) heard me and immediately corrected it. I appreciated her willingness to step in without question. What continued to bother me, though, is that none of the wine is priced under $10 a glass. Further, I'm fairly certain one of their bottles of wine which was priced around $48 dollars is about $32 at Mercurio's in Shadyside. Point being: I will not be coming here for cocktails with a friend again any time soon. Additionally, my dad joined us toward the end of the visit and asked the server for a Makers and ginger ale. The waiter informed us that they don't stock ginger ale and don't plan to. Why, I'm not sure. Ginger ale is a pretty standard drink mixer. But as a new restaurant, if a customer asks for something that you don't have that is so normal at pretty much every other establishment, I'd be sending someone to GetGo to grab a bottle of ginger ale and ensure that my new customer is happy so that they want to repeat business. Maybe that's the sales person in me coming out, but food for thought for the manager and owner. My dad ended up not getting the Makers because they didn't have ginger ale. Our bill after several glasses of wine each ended up coming to around $250, which for two people eating and three people drinking just wine felt extremely high. I could have probably paid less at Ruth Chris downtown. I'll be back for the food, and I am looking forward to trying the oysters (but again, these are priced higher than every place I've seen in pittsburgh) but I won't be spending my money on the alcohol here unless they rethink their pricing.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z86YzzxbbwmKU_ncuo67YQ"
  },
  "UwpbfNrYIAlFm7HV7b0GGw": {
    "date": "10/21/2017",
    "text": "Extremely disappointed, server didn't tske the time to discuss the oysters nor was there a sheet with information  to review. Food was way overpriced.  Grilled cheese didn't really have much cheese on it.  Looked like they sprayed some on. Lobster roll small and overpriced and taste was just ok. Poor service, food and selection.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "hJqqI5dSpW7IZkoENym1Uw"
  },
  "--3_rzdtCKQSq7Hpdhh_5Q": {
    "date": "10/27/2017",
    "text": "Oysters were good, but I ordered a dozen east coast and half were west. Also my wife ordered grilled cheese and they brought grilled cheese with crab. A glass of basil Hayden bourbon was 22 bucks. Same glass at other high end restaurants ranges from 13-15 and is a much heavier pour. Avoid this overpriced hipster haven and spend your money elsewhere. True story.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jy9TiyHZzTdImRpEOqgvCQ"
  },
  "bk_mk2NwUIB6cyL-i7SZ0A": {
    "date": "11/18/2017",
    "text": "In Pittsburgh on business and absolutely loved the place! The oysters and chowder in a bread bowl did not disappoint! I'm glad I got to try this spot.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2JBam09XR2yIbKec-NNM3w"
  },
  "go8wXLDmYRIkAF9wn565Pw": {
    "date": "10/30/2017",
    "text": "Overall, Excellent!  A Good destination point to experience! Best Oysters in Pittsburgh, Cool Menu, Excellent Service and Moderately Priced!  Myself and my Upscale Shadyside Friends will definitely frequent again!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VL7xMswELch0c3hCEXyd1A"
  },
  "bRB8ySeWXkswsJF5-FQWjg": {
    "date": "1/27/2018",
    "text": "too expensive for mediocre food. $80 for lobster bisque bowl, crab sandwich, 1/2 salad. 8 oysters and two sodas. bisque arrived very very hot (microwaved?) with one piece of lobster resting on the bottom. oysters sat on counter while every new group entering leaning over them, inspecting them. we had to ask for them to be brought to the table. crab sand was greasy and flavorless. salad was just a big jumble and appeared to be salted. so meh is a pretty good descriptor. not bad, but not good enough for the price. or to return, unless you come back for the happy hour half off oysters between 4-6, and skip everything besides the oysters (which were good,) altogether. had to take a pic of the oyster menu on my phone, as it could not be seen from our table. silverware was in a cup on the table, and i had to go thru a few before i found one without fingerprints. salt looked like other fingers had dug in it. waiter, vigorously wiping down table stuck his dirty thumb in the SO's glass. also, i am not a fan of pour it yourself tepid water. what is the deal with not offering ginger ale or iced tea? expected apparently to drink our sodas from the bottle. had to request a glass and ice.  waiter didn't give a shit until he presented the check.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "aTgubK2Qfwpogd4tKrchqA"
  },
  "VY-jL6FoIIm8bMrXTbdQzw": {
    "date": "11/11/2017",
    "text": "My daughter loves Oysters. Now we love Merchant Oyster Co. - Angelo was great. Staff was great. Check it out and enjoy one of the only legit New England type spots outside of the actual.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9hP1iACN7yEo2UEpdaEKsQ"
  }
}