{
  "qG7U3jo9nxXyDIPSr3Xw2A": {
    "date": "1/18/2018",
    "text": "My friend and I popped into Needle & Pin late on a Wednesday night and were happy to meet the bartender, Robby, who took great care of us, patiently chatted about cocktails and their ingredients, and scrounged up a snack that was perfect for what we were craving - the English cheeseboard. Love the vibe! They might have made a new regular customer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Em6AV2DXQMrQk0wCio6Yfw"
  },
  "zQ3jGDK1ybau9HX7HALzXg": {
    "date": "5/6/2018",
    "text": "We love Needle and Pin. The cocktails challenge the senses and the food has not disappointed. We've gone to  both brunch and dinner. Scotch eggs are fun. The salads impressive. The menu changes seasonally so I don't want to flag one choice. But what we've had has been delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WQSbofyj-aLOq5NRXaD16A"
  },
  "Dfik5OAyfqIX02bmhIJD1Q": {
    "date": "5/27/2018",
    "text": "If you enjoy great food and amazing cocktails, it's hard to find a better place in the south hills. It's a unique experience with the English/Indian fusion and the food is new an interesting. The presentation is nicely done as well. I feel the big stand out is the fish and chips, which is only available on Friday and Saturday. My favorite aspect are the cocktails. The bartenders work very hard to turn out very well crafted cocktails that are both well presented and delicious. It's also one of the few places I've been to around all of Pittsburgh that I am able to get a Ramos gin fizz. I hope you try them out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9ewjafrcTBkercR1az1Sjg"
  },
  "4kMdKsRNz1ZLiypGjzLecQ": {
    "date": "7/25/2017",
    "text": "Excellent drink selection and knowledgeable bartender/owner.  We just stopped for late night drinks, but the menu looks amazing!  Looking forward to returning for dinner!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ftpTlJ6xSMSHsIwhLpaN0A",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ftpTlJ6xSMSHsIwhLpaN0A/o.jpg"
      }
    ],
    "user_id": "vqgg1BCd0muKw04CCOmgcA"
  },
  "vCE02E2Q6m9Ytv6Lv5PgUg": {
    "date": "1/5/2018",
    "text": "First time to Needle & Pin the other day. The vibe when you walk in is really cool.  The walls are tiled with AstroTurf in between to make it look like gardens.  Sounds weird, but then you see the flower tiles scattered throughout, and it makes adorable sense.  Giant elephant on the wall, red phone booth -- you definitely get the English vibe.  Then the food is where you get the Indian.  Nice!  I got the lamb lollipops.  They were uh-mazing.  I should have gotten the bigger portion, for sure.  My cocktail was good, too.  I had a Gin Ricky.  (Gin is their thing.)  It was good.  It wasn't the best I've had, kind of on the tart side, but it was good.  My friend had the blackberry bramble, and the grilled cheese w/ tomato bisque.  She said both were excellent.  Then we got dessert.  Meh.  They don't have a dessert menu, and they only had one choice.  It was a banana bread with butternut squash ice cream.  It.  Was.  Weird.  It was almost like that weird stuffing you'd get at your obscure relative's house over the holidays when you were a kid.  Like, it had a very, extremely, ridiculously dense texture.  It was moist, but REALLY heavy.  I like light and fluffy, cake-like banana bread.  This was precisely the opposite.  The ice cream, I did not eat.  I don't like squash, so I can't tell you if it was good or not.  If I'd recommend improvements, it would definitely be in the dessert area.  I get that you don't want to be a bakery, but at least have a few good choices.  Also, they could turn the lights up a bit.  I guess hipsters don't need light...?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5nLrG5YTh0s1wbBM3H4NtQ"
  },
  "PYJV_ThbWcjT0_WXHtShgQ": {
    "date": "7/2/2017",
    "text": "The bartender was very attentive and the drinks were incredible! Im not much of a gin drinker but they changed my mind. I had the curried jackfruit for dinner which was also very good, the curry was a nice mild flavor and the portion was generous. Will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zoXQFGjyYZ6gI2Is-_PZWg",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zoXQFGjyYZ6gI2Is-_PZWg/o.jpg"
      },
      {
        "img_id": "Uo8hVfKv0USxVvyETVJU_A",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. I also love that they updated the menu to reflect gluten free options!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Uo8hVfKv0USxVvyETVJU_A/o.jpg"
      },
      {
        "img_id": "01T4LjgnHLDEEVtUIx4LPg",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/01T4LjgnHLDEEVtUIx4LPg/o.jpg"
      }
    ],
    "user_id": "hsZj-KbijKR8r4ytP-iiRQ"
  },
  "1T1HkF-DFSD-ARJ_7BWq4A": {
    "date": "9/24/2017",
    "text": "So, Needle and Pin is awesome! We've been wanting to try it for dinner but ended up at brunch today instead. First off, the restaurant is so beautifully designed it almost took my breath away! The entry way is lovely and bright, and I loved the mosaic glass throughout. So pretty! Now onto the goods, and the mimosa off of the brunch menu may be the best mimosa I've ever had! My husband and I thoroughly enjoyed them. We also both ordered the bangers and mash, and really liked it. We had wonderful service and the chef even came out to take our orders and answer any questions. We are really excited to try it again for dinner and cocktails!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "SJQTqW0Uf4V9MNX1ogtw6g"
  },
  "q0MBbr1vbCVSsMDK6_cQvA": {
    "date": "1/6/2018",
    "text": "Great food. Excellent service. Celiac friendly with separate cooking area for the great selection of GF menu items!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfwOv2ON-UT4GxCXUlM-mQ"
  },
  "6fOQL8m9-uXRUPL_9YvcxQ": {
    "date": "2/12/2018",
    "text": "First time checking this place out on Saturday night and it was delicious ! The drinks were awesome with a great presentation. Very interesting menu and everything we got was great. Looking forward to going back to try more items!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bwjPP2nwL7ucwTWftRJaHw"
  },
  "sNWvco6I6iBX_wCNjgN67g": {
    "date": "7/15/2017",
    "text": "Art everywhere. Superb service. Music deep and lovely. This is a timeless gift. Food delicious, beautiful decor. Super interesting, such a great night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "b76eK6Q1VqBCOEsZMtWAIQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b76eK6Q1VqBCOEsZMtWAIQ/o.jpg"
      }
    ],
    "user_id": "aHkIJQHPuI2F9zcjoaaK1A"
  },
  "ob9lsGAqkCBoAFTiMKoRbw": {
    "date": "8/14/2017",
    "text": "I'll admit, I wasn't expecting much. Though I love a good gin & tonic, I wasn't planning on that for brunch, so when the Sunday Brunch Club headed to Needle & Pin I was hoping (at best) for decent food. Wow. First, the owner gave us a thorough explanation of each menu item. Though the brunch menu is limited, there's definitely something for everyone in your party. The crew split a Bread Board and I'm so glad we did. Have you ever enjoyed a freshly made bagel? I remember visiting Bageland in Squirrel Hill as a kid, and that's the closest I can get to that flavor. Between our group we ordered the Bangers and Mash (looked awesome though on the small side), a Popover (much heartier than expected), Oat Cakes and Overnight Oats (one of the most delicious breakfast items I've tried in my life). When my trio of Oat Cakes arrived it looked good, but I assumed I would demolish it in under 5 minutes. I left with two-thirds of it for what became an oat cake dinner! The bottom line, this version of brunch tapas is heartier than it looks and I left craving nothing but a return trip for dinner. Congratulations Needle & Pin, and welcome to the neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 6
    },
    "photos": [],
    "user_id": "-ARdx8hOcEWlMDjzwLYZ_g"
  },
  "AAfiX9qTYnirciOitT-pFw": {
    "date": "5/6/2018",
    "text": "Service was quick and efficient.  Our server was very friendly and helpful. Food was excellent (yes, the portions are not huge, but the ingredients are clearly top notch).  There is a long history of UK/Celtic/Indian fusion and it clearly has a brilliant expression here.  And above all else, this gin heavy bar (85 varieties) has people who really know how to make a drink- everything from historic and iconic renderings to some very experimental expressions.  The even make a perfect martini! This area may not be the most trendy right now (border of Dormont and Mt Lebanon) but this is a gem that's well worth the trip from wherever you are.  The ultimate compliment-we'll be back with friends and family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ahCTPhTdCBtS9TLFXHG1VA"
  },
  "rIpdTKwALAl9MeJWl34HNQ": {
    "date": "1/26/2018",
    "text": "Great spot all around. They value their customers and take what they are doing seriously. After a previous issue it was clear they made efforts to improve and cared about the experience of a single customer. Really Like the crew here and everything they do.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ND3UnouUykHdEQ1t7x0DvQ"
  },
  "fNuFMC5NPpoVPZCazYAm0w": {
    "date": "6/15/2017",
    "text": "Dined here tonight, had an excellent meal. I got a Bramble Berry cocktail (gin, blackberry jam, and seltzer), it was delicious and not too sweet. For dinner, I had the Tikka Grilled Cheese with Coconut Curry Tomato Bisque. It was creamy, cheesy and quite enjoyable. It's a unique experience at Needle and Pin, with a pleasant atmosphere and interesting food and drink options. I'll definitely return to try their other options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-Oo5XtoB3wBVObt61kGHZw",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-Oo5XtoB3wBVObt61kGHZw/o.jpg"
      }
    ],
    "user_id": "EfS21XgkA6ogWN-J7KFM0g"
  },
  "65xdPcIZu5zR3NpsWOvt3w": {
    "date": "12/5/2017",
    "text": "This is a hot new restaurant that I've been really wanting to try! I love that it offers some Indian dishes, and the GIN! Love the lemon gin drink, but a simple dirty martini wasn't their thing. Dishes can have a kick to them! So ask if spice isn't your thing. Prices were moderate. Parking can be hard to find on the street and I'm not sure if there is a parking lot. Would I go again? Yes. But if it had to be in that area I'd check out somewhere else before going back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0WiKiaHhWPeb2llMLj3-6w"
  },
  "8LwQ4NeYWng7k__Eh35TKg": {
    "date": "1/18/2018",
    "text": "I stopped here for the first time this week and loved it!  Sat at the bar and the bartender Robbie was great.  We wanted a snack and he recommended the english cheese which was fantastic.  My first drink was the blackberry bramble and then Robbie made a couple gin drinks that weren't on the menu, both of which I loved.   This spot has such a cozy environment and ill definitely stop back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rk8OF72UtkLRTMAAI_gWRw"
  },
  "VRwrOIBTIxEA2SE3QLBzJQ": {
    "date": "1/16/2018",
    "text": "Amazing atmosphere, delicious food, and fantastic drinks! Definitely my new go to place whenever I'm in Pittsburgh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qRwL9jK2xz0dGy3xYlQr1Q"
  },
  "Xh5vRb25RV2MtewfaRETKQ": {
    "date": "9/29/2017",
    "text": "Wonderful! This place is seriously so special. I was shocked after receiving delicious food and drink that the restaurant wasn't full and we had no wait. I tried about 8 dishes and didn't have anything I didn't love.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JaECdbp26BEIyaDiImTIIw"
  },
  "ASuWPbnU4Z6dkiEnXqsyYg": {
    "date": "3/17/2018",
    "text": "Excellent, creative cocktails and unusual, delicious food. A great addition to the Dormont/Mount Lebanon metroplex.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cYg4uN2iw-2TSUNluYZ2gQ"
  },
  "DiSUHYwEzuRWmc09cqRang": {
    "date": "1/6/2018",
    "text": "It was a great experience sitting at the bar.  Great service and great drinks.  The bartender prepared drinks from the menu, in addition to drinks from his own repertoire.  Tikki masala was some of the best I have had.  Truly enjoyed the experience. Will be returning without a doubt.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SI7msHrWxLoHRAgLT7Wvaw"
  },
  "FnU0lD32Q369m7JUPlKIkg": {
    "date": "10/30/2018",
    "text": "Great ambiance and food. Fusion of Indian and American/British. Cocktails are hand made and fresh",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IFVDxYez-uw7HUjTzVJV6Q"
  },
  "7TdLchjol8kFQALyDVfmTA": {
    "date": "7/10/2017",
    "text": "Second trip at 11pm: bar food was of the same caliber as dinner - good. Their bartender continued to impress. Hell or High water is quite nice even if you don't care for gin.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x2ROIgouWArj5W3lcuofng"
  },
  "APcwc_QHKmla9esDcR4Gag": {
    "date": "2/7/2018",
    "text": "Drinks are scrumptious, food is delicious, atmosphere is sophisticated. Bring your wallet.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EUABcngdHAS1GqmD_ZJb5w"
  },
  "RngVCEVs16hQIylX8s_7vw": {
    "date": "6/4/2017",
    "text": "As a fan of Winghearts, I've been looking forward to the opening of this new venture.  We grabbed seats at the bar while waiting for our friends. The gin-heavy drink list had two pages of interesting choices and the bartender was happy to make a recommendation. We chatted with the others at the bar, mostly Dormont locals equally excited to see a new option in the neighborhood.    When our friends arrived we decided to stay at the bar & order food there, and it didn't disappoint!  We tried a handful of the appetizers, and the fish and chips, gobi, and Scotch eggs were terrific.  By far my favorite was the beef Wellington bites - the variation on a traditional dish was amazing!  There may be a feeling that it takes longer than usual for drinks - as with any small bar making craft cocktails, the investment of time to hand make the drinks is worth it.  I had my first gin martini (served at a specific temperature and the most delicious olive this olive hater has ever tasted) and I'll be dreaming about it until I return.    Looking forward to my return to try more of the cocktail list and eat a full meal soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ivE_lju8iqkr0EfbZi7Khw"
  },
  "2tbcXfcI9POp8-VzZi1p_g": {
    "date": "6/9/2017",
    "text": "The paneer tasted delicious...but not Indian or English. The bramble was also given to me with no stirrer so the first half was terrible. A cup of gin. Second half was delicious, but I looked like an idiot trying to shake all the jam into my mouth. When I received my food..grilled cheese and lukewarm coconut tomato soup, I had no utensils and had to wait forever to get someone's attention. It took about 4 tries.   The masala flavor in the sandwich was almost non-existent. And the soup was almost cold...and very bland and not exciting at all. I took most of it home.   I got the cheesecake, it was ok, I didn't love it.   My dining partner had the pot pie and seemed to enjoy it, once he was able to get thru the pastry on top. but the texture to me was awful. It was basically shredded chicken mush.   Also super surprised there was no gin menu...since that's your thing?? And no take out bags??!   I'll prob give it some time to sort out the kinks and come back for fish and chips.   Meh",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zuoNOQcSJT8igbbMx89kBg"
  },
  "_C9Meoh2jI_59D-HCI1wLQ": {
    "date": "7/15/2017",
    "text": "Such a wonderful addition to Dormont!! We had the Beef Wellington Bites and several beers and cocktails. Excellent prices for appropriate portions. Food and drink were SO delicious. Sofia provided exceptional service. Can't wait to see her again and have another Bee's Knees. Even the manager, Derek, was incredibly hospitable. Thanks again so, so much for the stellar first experience!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8d8QQ6CYi8Bob6qoz5nUqA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Thanks again!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8d8QQ6CYi8Bob6qoz5nUqA/o.jpg"
      }
    ],
    "user_id": "CHF6cYe48Msore1p9xRX5w"
  },
  "O3jzSRIbFXaMxULUTlDJiQ": {
    "date": "4/6/2018",
    "text": "What a wonderful experience we had at Needle and Pin! Creative dining is important to me! If you are not a brave taste tester, this might not be the culinary experience you are looking for. The atmosphere was cool, service excellent and the food was an incredible fusion of Indian with a contemporary twist!! Loved it!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e_J-x7Cqkh-w9ZObW2E8TA"
  },
  "3RjapWbtHI86Md-Cl36Emw": {
    "date": "1/27/2018",
    "text": "I love gin  They have lots of different drinks for gin lovers. The atmosphere was perfect for a night out with my hubs. We both got the tenderloin and it was sooooooo good. And not a huge portion of others sides that leave you stuffed. It was perfect with the sweet potatoes and micro greens. I also ordered some naan bc I love bread products and it was warm and delicious. Our appetizer was just ok. Not as much flavor as I would have liked. It was the Malai Kofta. But the steak did and that is what mattered most to me. We also got this funny little dessert that looked like a birds nest filled with berries and custard. It was good. Def a mess to eat bc the nest is tricky to get bites of. I want to go back and sit at the bar to watch the bartenders make all of the drinks. They look fancy and I want to see how it's done.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xtpe7A9fFOtslwC9Hp32Rw"
  },
  "kiADVuYkZaGx-37MeBit-A": {
    "date": "1/15/2018",
    "text": "Excellent restaurant!!! Great for the tapas / share size plates. Cocktails are outa this world, a must visit!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gStPUy_BQ4l_vyU91-hUuQ"
  },
  "qXXm2G_b4I_HdL51x9bPsA": {
    "date": "6/10/2017",
    "text": "Stopped in for a quick drink but ended up having 3. Every one was well crafted with fresh ingredients. A lot of different gin drinks plus other cocktails. They make their own tonic which was a pleasant surprise.  Had their version of grilled cheese and tomato soup. Just like the drinks, the food was very solid.  The bartenders were very knowledgeable and did a great job interacting while making the drinks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "31vWyBOQK3jEOa7uI5BItw"
  },
  "fnZRcLiZ776LtdCqNlR83A": {
    "date": "3/12/2018",
    "text": "My friends and I tried Needle and Pin tonight and just loved it.  We had a wonderful meal and are already planning our next visit.  We enjoyed the Malai Kofta - delicious fried sweet and russet potato balls with a delicious Tikka-type sauce.  The Chilli Paneer was lovely - spicy and savory cheese with delicious Naan.  Cooled things down with the Bombay salad - light and refreshing.  For dinners we enjoyed the Tikka Masala (spicy!), Bangers and Mash and Himalayan Pink Salt tenderloin.  All were wonderful.  Rounding out our meal and experience was the service Shana provided.  She was informative and knowledgeable about the menu with great insights and suggestions.  Her enthusiasm for the food made our experience a terrific night out with friends.  We'll look forward to seeing Shana on our next visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oqhsmhIrsGL-YPGutwG7_g",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oqhsmhIrsGL-YPGutwG7_g/o.jpg"
      },
      {
        "img_id": "rhyr7XYLMLrHY0EQArHHhw",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rhyr7XYLMLrHY0EQArHHhw/o.jpg"
      },
      {
        "img_id": "BYGFNwaH9WDSO6fPS9qqlQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BYGFNwaH9WDSO6fPS9qqlQ/o.jpg"
      }
    ],
    "user_id": "5ivWTgXnu7SpusGjago0CA"
  },
  "R86JUV17dGOucqvwG_SXvg": {
    "date": "3/1/2018",
    "text": "The owner and head chef are great here! The hell or high water drink was a fave as was the honeybee and night owl. The chili is amazing! Beef Wellington bites and grilled cheese were great as well. We had a great time and when the owner heard it was my mom's birthday, he sent a delicious apple dessert for us. We will definitely be back- don't be intimidated by the menu- everything is delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KM7mrQn8Z9acsob6vvZtZA"
  },
  "p-2xbpdGfUyLYGZXBcA9Rw": {
    "date": "7/6/2018",
    "text": "Several friends recommended this place for great drinks and food. Gave it a shot and was underwhelmed. The drinks were very good..I'd go back for those. But the food wasn't. Our fried cauliflower was barely warm, my $13 salad was a handful of room temp greens with some things sprinkled on top.  Chicken Tikka MAYBE had a half of a thigh worth of meat and hard underdone rice.  Was told the main chef wasn't there that night so maybe that was the issue.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xmEJM-SvUqabsomvRQTvBQ"
  },
  "x5adg9TL6AYqyqlIvzk_Bg": {
    "date": "8/9/2017",
    "text": "This restaurant definitely hits as a fit for the new \"Dormont is actually kind of cool\" scene.  The food is well above average, eclectic, creative, and tasty.  Some are knock-outs, and some are average.  For example, the sauce with the chick pea dust encrusted cauliflower was top-notch... the chips that went with the fried cod: mediocre at best.  But this imperfection seems inevitable when you are trying to fuse Indian and British pub food.  The real question is--will it continue to get better?  I would call the food overall a solid 7.  (I would like to note here that this is often the case for even the most \"in\" restaurants--inconsistency is everywere).  The drink menu, however, is a 9+.  My guest, and others in the restaurant, were loving the mixed drinks.  $10 for a lot of creativity and kick.  I was driving, so I just had a glass of wine - which was actually quite good itself.    There is also a passion in which the servers, bartender, manager, approach the whole endeavor... I hope it is sustainable.    Decor is nice, and a little odd - just like the food.  I think this one has a pretty good chance, if it continues to evolve and stay edgy and happy.  My advice to the owners would be to view the opening of the restaurant as the beginning, not the end, of the innovations.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O5OJNtE5gDOEDS7nqB-BYg"
  },
  "3jb3pf4DpB6iElmukxOi4Q": {
    "date": "3/11/2018",
    "text": "Good cocktails with a side of meh. They have a solid drink menu and the Hell or High Water was great. The service was quick and friendly. The food presents well but the flavor just isn't there. The majority of the ingredients they tout on the menu disappear into a sea of bland. No depth.  Definitely stop in for drinks but head elsewhere for food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uXv8N4D4hpovROtvvOpeUw"
  },
  "tKMXu3ucvN4UIJUJ2yDPIw": {
    "date": "2/18/2018",
    "text": "The plates are small and it's pretty overpriced for what you get, but everything was delicious. Beef Wellington was soo tender. The grilled cheese and soup was delicious. My least favorite were the sweet potato croquette balls, but they were still good. We spent $50 - didn't order one drink - left hungry.. but if you're prepared to drop $150 you could have a good night!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HMW4rr3dg4nHmMwreXZeGw"
  },
  "YaJN3qHjd7n1KSSJxGy13A": {
    "date": "3/31/2018",
    "text": "Very unique cuisine and cocktails. Great atmosphere, but the limited menu may make it tough for people with food restrictions. Staff is welcoming and attentive. If you like classic cocktails, be sure to try a few of their options. The British/Indian fusion cuisine is excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NgDE0HWy6F1V3xdpuviPBg"
  },
  "xkG08P5NBTQ40FcBpl6QdA": {
    "date": "6/29/2018",
    "text": "Wow. Found a \"needle\" in a haystack;) The flavors here pop off the plate and pair amazingly with the gin creations. Highly recommend the goji Manchurian, lamb lollis, and the heirloom tomatoes. Also, have dessert if they have the macaroon. Yes you'll be full and your date will say no dessert. But, order it anyway. Incredible.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvpSfXcDf7UzYlaomWP9dg"
  },
  "zBWDGSotzta-yyFFm_O5Mw": {
    "date": "12/14/2017",
    "text": "Went here for brunch with a large group.  The staff was very accommodating and the food was great.  We wanted to try everything so we all ordered different things and shared them.  The sweet waffle, curried chicken popover, and pondicherry french toast were my favorites.  Next time I'm in Pittsburgh I'm definitely going back for dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "27qQJjBNZDlpU40y2LmaPw"
  },
  "ACfIDw_6UolnUdhJl_xLoA": {
    "date": "1/6/2018",
    "text": "I ordered take out at the restaurant last night and had a horrible experience with the bar tending staff. While I waited there for my food , ordered a drink . The bar staff maybe he was new was very unwelcoming and not helpful about my take out query. I continue to wait there and was still ignored. Lackluster / poor service . However to be fair the hostess was attentive and so was the manager. Anyway the food was ok , but I don't think I will be going back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YAQspuTor6mbUdgMJK1aiw"
  },
  "lk9OBDwvndUuemN9kW1MPQ": {
    "date": "8/12/2017",
    "text": "We tried this place last weekend for a late night dinner. The service was friendly and attentive. The lighting was a bit dark, I had trouble making out what I was eating. They are a gin bar so I tried a spicy/sweet gin cocktail. It was more sweet than spicy, and pretty tasty.   For dinner, I had the lamb lollipops and the jackfruit curry. The curry came with thin noodles that needed a bit more sauce, fortunately the waitress brought me some extra when I asked. It had actual chunks of coconut and a good flavor. The jackfruit tasted a lot like eggplant. The lamb lollipops were a cooked perfectly to medium rare and came with a great sauce on the side. My friend ordered the spicy fried paneer appetizer, that probably had the best flavor of everything I tried. It was sweet and spicy and the paneer had a pretty strong flavor.   My other friend had the chicken tikka Marsala. The thin noodles were a different twist on the usual tikka. Next time we will have to try the English side of the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jYltiZGn0dLaj6AhDy4hpQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Spicy sweet gin something or another",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jYltiZGn0dLaj6AhDy4hpQ/o.jpg"
      },
      {
        "img_id": "lfzA2PoYLHce2lVgIe52SQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Lamb lollipops with a great sauce!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lfzA2PoYLHce2lVgIe52SQ/o.jpg"
      },
      {
        "img_id": "_9t6Yv8WSAomXHhE9LH7IQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Added sweet potato chips were a great addition!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_9t6Yv8WSAomXHhE9LH7IQ/o.jpg"
      }
    ],
    "user_id": "GTbnKWAYHAgY4Z_62547WA"
  },
  "JI4QP6bF748VLKacMvejXw": {
    "date": "12/14/2017",
    "text": "I want to start off by saying, I only drank at Needle and Pin. I loved the decor. We went at an off hour on a Sunday, so it was not crowded at all. The bartender was SO NICE, letting us discuss the drinks on the menu and helping us decide. He even let us sample a few of the off the wall liqueurs that were in some a the drinks to make sure we were happy with our suggestions. That alone is worth five stars. The menu kind of left a little bit to be desired for my taste, but in some cases less is more. I didn't try any of the food, so who cares what I think. If you are into gin and British Indian food; look no further, my friends!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iCXJ3gO2GhopYHmfmnktfw"
  },
  "o2QhpDIQgP5DaogTGpAR6A": {
    "date": "4/27/2018",
    "text": "We came here for good indian food, but received mediocre british fare. If you are new to indian culture and food, this may be a great option. However, we were highly disappointed despite coming in with an open mind. Our group ordered a variety of dishes and plates from the menu, but were unsatisfied with 4/5 of them due to limited use of authentic ingredients. Furthermore, the waiter told us the vegan bangers and mash was every vegetarians favorite dish BUT it was nasty due to blandness and having bitter ingredients. The potato in it was not even real potatoes. You are paying for presentation when you go here since the plating of the dishes was the best part. However, it is worth noting that Needle and Pin has a good drink selection. The madan mohan drink was awesome since it reminded us of homemade green chutney. Overall though, this place needs to improve a lot.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "g4p_H_Nqwb_WSlkPpFNBGA"
  },
  "x1nMNO4S1gOCltkBlThcMQ": {
    "date": "8/4/2018",
    "text": "The drinks are absolutely amazing. The food is very good but not 'off the chain good'. Somewhat cooler weather type dishes but this is expected since its English and Indian....the Impossible Meat dish is really amazing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LPWSfa9mGf59P7KZg_eOdA"
  },
  "xaNTUmezIzFgLuLIidyjxQ": {
    "date": "6/3/2018",
    "text": "Great vegan options, tasty cocktails, chill atmosphere. Really loved the escarole w chickpeas which was rich and surprisingly flavorful!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P8Nsr6Lix9h13pmwVx2qgw"
  },
  "OEwHJ-s69l0PPrlEaBwPAw": {
    "date": "4/8/2018",
    "text": "The hubz and I tried the dinner menu out over the weekend and were very impressed.  We tried many of the small shared plates since we wanted to get as many things as possible.  We started with the Scotch Eggs.  My hub considers himself a connoisseur of scotch eggs and was happy as a clam with these.  We also go the Gobi Manchurian which was good but a little light on the sauce.  The Chili Paneer was awesome!  One of my favorite dishes was the Curry Chicken Potpie.  So savory!Our main dish was the Bangers and Mash which involved the mash in a puff pastry.  We couldn't finish it all but did bring it home to snack on later.  We'll definitely go back again sometime!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "SCqi8N3vP4qIcF5ezzWzzQ"
  },
  "f48mYk2iClhse-aD2oeTXA": {
    "date": "8/23/2018",
    "text": "Drinks are off the hook, so nice to have a craft cocktail spot close to home! Food is Indian/British style and pretty good, but I really go here for the drinks. Bar service is very friendly and decor is cozy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zKDhAWpCZRJB5r3Nwp96HA"
  },
  "55BUT64VnmGBmrUYs0LUDQ": {
    "date": "11/18/2017",
    "text": "We enjoyed our dinner at Needle and Pin. Definitely make reservations if you are planning on having dinner during the weekend. The place was very busy. One downfall was that even though we had a 7:45pm reservation, they were already out of fish and chips, pani puri, and rabbit Masala. This is understandable but still a bummer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "egRxxzzK8OJc9G4G8vl38w",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Tikka Masala",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/egRxxzzK8OJc9G4G8vl38w/o.jpg"
      }
    ],
    "user_id": "_WZOZE2kAZre4hN_yzojaQ"
  },
  "Ck4avGu6MFsiV_g81BcSzw": {
    "date": "2/16/2018",
    "text": "Great vegan options, cool atmosphere, good music, yummy drinks I love the bangers and mash and bramble!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7VR02j18l5YHexn0g7h7xg"
  },
  "LwVUDlJmEcKK9YxwjAfxag": {
    "date": "4/23/2018",
    "text": "Brilliant all round. Sophisticated decor and great service. No TV's so you can focus all your attention on your guests. Subtle flavors strike a great balance between English and Indian. Drinks menu is Gin focused and for good reason, they are all mixed from scratch and well worth the wait. They offer some beer and wine options to make sure nobody is excluded. We are so glad Needle and Pin is close by as we will be visiting frequently.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sHhu1-vRUpfwz2HM67rDrw"
  },
  "k-OuJBZrL4OsDdGAlne2XA": {
    "date": "3/12/2018",
    "text": "This place is unique. The decor is wonderful. My wife is an artist and she just loved it.  The food is unlike anything else I've tasted in the Pittsburgh area. The chicken pot pie was a bit on the spicy side, but in a good way. It was topped with a puff pastry instead of the traditional crust. We found the lamb medallions a bit on the tough side. The flatbread was excellent.  I found the scallop lemongrass soup tasty but a bit thin.  I do have to give a word of warning, which also will explain my overall rating. Though the food is tasty, the portions are tiny.  The result was that each of our party of four had to order additional food to feel satisfied. This also made the meal more expensive than we expected. Dinner for four with two glasses of wine was over $150 plus tip. Service was excellent. The server really made us feel welcome.   We really liked this place, but we're not sure we can afford to return very often.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "3GLZbeJIOIhoZvjeziRv6A"
  },
  "py1Os-pafXfHupI7YOnuSg": {
    "date": "4/1/2018",
    "text": "Pros -  Nice atmosphere  Food presentation is nice  Cons -  - Service has major room for improvement.  - We're a party of two and they brought our food out separately. (And there's only two other tables in the building)  - The food portions for brunch aren't big enough to consider an actual meal.   We won't be back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u2jHnu5L3uYZgbzgAMqrfQ"
  },
  "034AST28s5FBhmc3zV-s6w": {
    "date": "2/16/2018",
    "text": "Best English-Indian restaurant in Dormont, hands down. JK, I know it's the only one in town but it really is fantastic and you should go, especially if you like cocktails and Indian food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "b4Qy-V6itNQDPqBsAvLOrA"
  },
  "Zs9ZQ-m6Ty8K6QPUkRSXvA": {
    "date": "9/25/2017",
    "text": "An AMAZING gem. This food is a unique blend of British pub Classics and incredible Indian flair. The cocktail list is incredible and inspiring, and after many visits everything we've had on the menu was delicious. The cheeseboard is not to be missed.  The incredible chef took time to check in with us and answer any questions that we had. This was my mother-in-law's third visit, and we will just keep bringing people here. Definitely a wonderful experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zFRyPQkHWyyEKAzFbrqFfw"
  },
  "6BnkrwSxej9bDjq8971XPQ": {
    "date": "12/28/2017",
    "text": "Robbie the bartender was great and personable. He suggested drinks based on our tastes and made everything exceptionally. He always was conscious of our drink levels and made sure to check in on us to make sure we were doing well. I recommend him to all!   Also, if you order a beer he will pour the extra beer into your glass that doesn't fit into the first pour, which not many bartenders do.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PkdXq1FowevVBj33y9FZeg"
  },
  "tX6824AaFqnMeoMLqcPglA": {
    "date": "10/2/2017",
    "text": "First of all I will say that the food was good, but small portions.  We entered and waited for over five minutes before we were greeted. We waited for our food for over an hour (only table there). No paper towel in the bathroom. Something floating in my drink. Definitely need to work out some kinks....but I expect it will be a good restaurant when that happens.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "a83wWQ7h597QIUuJ57ULxw"
  },
  "nf6Nwdpyvaw-kyD14P3LuQ": {
    "date": "6/18/2017",
    "text": "Brunch review. So excited there is a good place for drinks and non-diner food in south hills!  We went for brunch and it was pretty quiet but the drinks and food were delicious. Bread plate was amazing.  I had the curried chicken popover and it was the perfect mix of spice. Poached egg on top was perfection.  My companions ordered scotch eggs and porridge--both raved about them. Cocktails were slow crafted and thoughtful.  I can't wait to go back for dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "dyCpbaZSkcsTMW3AlpGOTA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dyCpbaZSkcsTMW3AlpGOTA/o.jpg"
      },
      {
        "img_id": "M6Qeaa6gOBi1LXFzBGa3NA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Brunch bread board!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/M6Qeaa6gOBi1LXFzBGa3NA/o.jpg"
      }
    ],
    "user_id": "TjfTL_9QxuH4a3fH_xHAmg"
  },
  "yU07__d7d9W6QPPL0HVTRw": {
    "date": "10/10/2018",
    "text": "Fabulous food, incredible gin selection, phenomenal cocktails, and chill ambience. Best thing to happen to my neighborhood in a long time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JAdrzcJlKZZrwmwwW0ywng"
  },
  "-mIBNKa3y7fupQ6T04RpUw": {
    "date": "8/2/2018",
    "text": "Went there tonight at 7 with a group of 8.  Since it was a Thursday, it wasn't very crowded.  However, service was terrible.  Took forever just to get a drink.  I believe there may have been only one waitress who was pleasant just apparently overwhelmed.  The food was overpriced for the portions and just okay.  I won't recommend.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uCS056fNVACnJr651zY4jw"
  },
  "QWlV8qqIwVW0snNhyGcGWQ": {
    "date": "7/16/2017",
    "text": "I want here for brunch with my family, and I must say it was incredible. Upon walking in, I was taken aback by the decor, I've never seen moss murals, but it works well. The lighting is intimate yet quaint. The service was spot on and our requests were met in a timely fashion. But what did it for me was the food. I can not remember the last time I had such a great meal. I had a mimosa and it was delicious, with the freshed squeezed Orange juice, the champagne, and the elderflower paired well together and made for a refreshing drink to start the day.  We started our meal with a bread plate of soda bread, scones and bread pudding, with  a cherry jam and spring onion cream cheese. I'm not usually a fan of cream cheese but these meal changed my mind. I decided on having the bangers and mash. I've never had bangers and mash, so I wanted to try it. I must say, I'm glad I tried it. My sausage was cooked perfectly, the poached egg! I'm out of superlatives for how awesome my meal was. I ate way too much and I'm glad because it was one of the best meals I've had in recent memories. If you have a chance to go here I highly recommend it. If you like Indian and English influenced you'll love it. You'll come out feeling happy and satisfied, my only regret is that the meal ended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IHy7L7mIF27OBNzIWIIm0A",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Bangers and mash",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IHy7L7mIF27OBNzIWIIm0A/o.jpg"
      }
    ],
    "user_id": "vhSZW5hIflGHpC-r0_dZqg"
  },
  "nsMjqhlNB4K2M_LOYfRLog": {
    "date": "3/10/2018",
    "text": "We didn't have a wait to get seated. The atmosphere and service was great. The cocktails were AMAZING. I would give them 5 stars for sure, they're worth the price. The food however is lackluster. We had 3 of their small plates. Everything was lacking flavor and just didn't taste good especially for the price. 3 plates was about $60+ and was not worth that whatsoever. We will likely return for the cocktails but definitely not the food.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "nDnrQ1BFe6ZgBBXSte5MVA"
  },
  "8bBLIVzUpmyPdqk1qvcVrQ": {
    "date": "6/23/2018",
    "text": "This is a great spot that has probably become my favorite for cocktails. I tend to frequent Lawrenceville more, but will make it out here periodically just because I enjoy the drinks so much. They are also probably the most creative cocktails in town at the moment. The bar is gorgeous (with twinkling lights in the counter), but I wish it was bigger. It tends to always be the most packed part of the restaurant.  I think the food is delicious here, but many of the portions are small. There really isn't an item on the menu I have not enjoyed, but the scotch eggs are probably my favorite and the best I've had. Their recent menu change has also added a greater variety of options.  During our last visit, we had some of the most friendly service. Our waiter, Shana, was very pleasant. The sous chef Marcus also greeted us and accommodated a unique request with perfection. Marcus was an absolute delight and checked back frequently to make sure we were satisfied. The kitchen, unfortunately, does not get enough credit for the tasty things they make.  Overall, I highly recommend this place. The biggest reason keeping me from giving them a 5 is that I feel the prices are just a bit too high for the portions. And while I understand paying more for a cocktail with many or unique ingredients, the more basic cocktails are still on the high end for Pittsburgh. If most items on the menu were cut by $2-$3, I think the pricing would be much more reasonable. Until then, I'll be mostly snacking on appetizers and their new happy hour menu, which has a great selection of well priced cocktails and snacks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8dBBQvVexwKUWKF2SGsUSQ"
  },
  "MFUlIQwtWYuxhfXi2l-Kfg": {
    "date": "2/11/2018",
    "text": "I was very excited to try this place for its selection of gin cocktails and it's British pub/Indian style food.  The food was not bad, but as opposed to the interesting mix of traditional pub food with Indian spiced and flavors described in the menu, the dishes i had were just pub food with very little Indian flavoring or pub food with an Indian side sauce.    The unexciting food aside, the service was terrible.  We were a table of two, each ordering an entree and one appetizer to share.  One entree was brought before the appetizer.  When the server was informed that we were expecting an appeziter first, she made it clear this was not her problem nor was she going to address the situation.  So one entree sat on the table getting cold while we waited for the appetizer and the second entree to be server, which was a total of about 30 minutes.  In additional the wait staff was rather inattentive and made few appearances at the table.  Because of this experience I will not be returning to this establishment for a meal.    I would however go back for cocktails at the bar.  The gin cocktail list was unique and the cocktail i ordered was very good.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "PiZITljA7_z4smI411o40Q"
  },
  "H8njqkUDrJcCjvLFlEIOzw": {
    "date": "7/14/2018",
    "text": "I couldn't be happier. We dropped in from a doubleheader baseball game and we are dressed like bums. The staff is all class. Our server Sofia was/is on point. I started with the Up In Smoke Negroni and then had them make me a Hell Or High Water. So perfect.  The food was perfectly prepared, cooked and presented! Thanks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOqmQE9NIhFOx30s2JzqIQ"
  },
  "Bx6SKnzA_rToDulRPljF0w": {
    "date": "2/24/2018",
    "text": "This place would have been a 5 if it weren't for the less than stellar service.  My friend and I sat at the bar, where it took probably a good 7-10 minutes to get acknowledged.  We never received menus and were lucky enough to sit by a couple who let us look at theirs.  I had to ask if i could put in an order, because again we weren't acknowledged.  Same scenario with checks.    On a positive, I had the Bumbleberry drink, which was really good.  My chicken curry pot pie was amazing.    For a small place, i would have expected quality service...considering the prices.  Please fix your customer service and you'll be a great, not just eh, place to go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3_lXZmCkafRHM8jOUrlJEA"
  },
  "D7CWnjKwo45ABpUQG0GDEw": {
    "date": "8/17/2018",
    "text": "Bartender was smug and didn't want to be bothered with questions which was off putting as soon as we walked in. The other staff was really nice but the food just wasn't good. They were out of the charcuterie plate? (Odd item to be out of an hour after they opened). Beef Wellington bites had no flavor, fried ricotta was cold and tasted like tofu rather than cheese. The naan was good but it's naan, not hard to make naan. The duck sliders were just ok. The yuca fries were hard and practically raw. Couldn't finish them. The fried sweet potato Crockette's were drenched in a sweet sauce that didn't help the flavor in anyway. I felt I needed a salt shaker for everything. The drinks were good but that's about all we were impressed with. Go for drinks if you must but don't waste your money on the food",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XHv_nL3Dt_O6qDIVcYDL0w"
  },
  "Jd-R5ZUJeq-AAoDghvS4CA": {
    "date": "8/21/2017",
    "text": "Went over here to celebrate my birthday. Just start we had the scotch eggs and gobi Manchurian.  Both were very delicious. I was here about a month ago and since then the food has improved. For the main course our party of four had the fish and chips, the chicken pot pie, tikka masala, and vegetable curry. All four of us tried each other's dishes and they were all excellent. Two of us tried two Gin cocktails - both were super tasty.  I highly recommend this restaurant.   The decor is really great too.  Definitely worth a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ObDb_651FO5P1PCxCqgvTw",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Fish and chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ObDb_651FO5P1PCxCqgvTw/o.jpg"
      },
      {
        "img_id": "MjRzuR0Oebfr6nziaeRJIg",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Chicken pot pie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MjRzuR0Oebfr6nziaeRJIg/o.jpg"
      },
      {
        "img_id": "RYvPT_o8o6RKayRByI1QyQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Vegetable curry",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RYvPT_o8o6RKayRByI1QyQ/o.jpg"
      }
    ],
    "user_id": "Q2wEIftRYkbw_pCr0VVGiA"
  },
  "-XU4owkTNC7GF9chiYdW4w": {
    "date": "5/17/2018",
    "text": "Oh my!  We tried so many items here; mostly because there are alot of small plates.  Many different foods to try.  I'll start be saying our least favorite was the beef wellington bites believe it or not.  There just wasn't much flavor to them.  Gobi Manchurian (chick pea breaded cauliflower), Tikka grilled cheese w/ tomato bisque (has a nice 'kick' to it), Himalayan pink salt seared tenderloin of beef, & cumin crusted lamb lollipops (super tender!).  The rest was fabulous. Server on point.  The kitchen needs to slow down a bit with having the main dish come out while still dining on the plates.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X7IJhbs7zgTATYs7NgTJdg",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. himalayan pink salt seared tenderloin of beef",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X7IJhbs7zgTATYs7NgTJdg/o.jpg"
      },
      {
        "img_id": "smWm6kjcruUI8Ul5ZYfj1Q",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. gobi manchurian",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/smWm6kjcruUI8Ul5ZYfj1Q/o.jpg"
      },
      {
        "img_id": "vxB7ggQrTc7Rd8NXRi7JsA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. lamb lollipops",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vxB7ggQrTc7Rd8NXRi7JsA/o.jpg"
      }
    ],
    "user_id": "m2uTGkOKcXqQJSmvsYvtMg"
  },
  "Ho8VMq-Q_UmpS6wsz8ARrw": {
    "date": "5/27/2017",
    "text": "Our second trip back I Love the drinks and watching an artist at work. As much as I love the cocktails oh my gosh oh golly the food menu is incredible the chilli Paneer and the Mali Kofta wonderful delicious",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "tZBtUj84JQW_ereG6ZP7yg",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tZBtUj84JQW_ereG6ZP7yg/o.jpg"
      },
      {
        "img_id": "l_rSZKyIlfJ_vaYSFi4jfQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Blackberry Bramble",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l_rSZKyIlfJ_vaYSFi4jfQ/o.jpg"
      },
      {
        "img_id": "oxDReUBmteGRHRcdWP19fA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Aviator",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oxDReUBmteGRHRcdWP19fA/o.jpg"
      }
    ],
    "user_id": "g94Ml1oo2qQe_iGBJL8nAA"
  },
  "0_cYDjLIr_dVC6T5fvd3Tg": {
    "date": "7/9/2017",
    "text": "3.5 actually. Excellent cocktails, friendly, attentive staff. The food was a bit uneven - the scotch eggs are amazing and so is the gobi. The fish in the fish and chips was gummy and the batter was soggy, which was a bummer after how crisp the gobi were. The bangers were good but the mash was more of a potato cake, which was just OK. Lamb lollies were good but a pretty small portion - essentially $12 for what amounted to perhaps two ounces of lamb. Atmosphere cool and stylish, hard to believe how much they've transformed it.   I will return for cocktails and small plates, probably will skip the larger plates though as they just weren't worth the spend. One suggestion I would make is to offer a bit more sauce with some of the menu items - for example, the amount of tartar sauce with the fish and chips (about a rounded teaspoon) was not enough for sharing.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hHqH_E9FCI_B6WubV0jPYA"
  },
  "p9ksvilzb1zi42tW1AiTeA": {
    "date": "7/24/2017",
    "text": "Came here again with co-workers and we had an amazing time! My co-workers were not big fans of gin, but they are now! They tried the apricot bramble, blackberry bramble, hell or high water, and the white lotus. The white lotus was a favorite.   We all enjoyed and shared the grilled cheese, lamb lollipops, scotch eggs, gobi Manchurian, and cheesecake encroute for dessert. Everything was delicious. The grilled cheese is such an amazing sandwich-thick toasted bread, 3 cheeses-white American, Irish Cheddar, and Gruyere...Mmmm. The curried coconut soup is the perfect accompaniment to the grilled cheese and it came out nice and hot. The gobi was also a big hit...the sauces it is served with are outstanding. The sauce is not too spicy, yet has a little bit of a bite to it.  Given the top-notch second experience for myself plus the rave reviews by my co-workers, I'm adding star #5. Can't wait to see what the future holds for this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "b9rkB7U8IH3jSfIZDOUbhA"
  },
  "M6Hbpu9rWWb3trPaPuXN4A": {
    "date": "7/4/2018",
    "text": "I love the restaurant for dinner, and thrilled to  say the brunch is spectacular!  Very creative menu, for meat lovers, vegetarians, vegans, GF, ample choices.  We were a party of 8, and everyone had something different and all loved their dishes.  Best Mimosa in town.  The room is welcoming and beautiful.  Needle and Pin was an excellent choice for our festive event honoring a co-worker/shower.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "w21stkc22-7czEI8nvCjXA"
  },
  "ii8SbCFWSnf6AHq4hikfWg": {
    "date": "6/16/2017",
    "text": "Cocktails are on point, but the food needs a bit of work. I'll definitely give them another shot as it's only been a few weeks since opening. I'm a huge fan of Wingharts and Dormont really needs a non \"bar food\" option, so I'm pulling for them!   Highly recommend Blackberry Bramble!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mEv4tFXqyFRAG10nP-ZEIQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mEv4tFXqyFRAG10nP-ZEIQ/o.jpg"
      },
      {
        "img_id": "D5whA-57FsEQosNt5IBjUQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D5whA-57FsEQosNt5IBjUQ/o.jpg"
      }
    ],
    "user_id": "ro4U2yVsoyh6qhCnspUUGw"
  },
  "VRdosIEwymTDiACiE2kBcg": {
    "date": "7/12/2018",
    "text": "Went for happy hour. Drinks were delicious and the bartender was friendly and helpful. Lots of vegetarian options for small plates, which is great to see. Basically the perfect experience for happy hour at a cocktail bar. Go here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PPwSn3eYtbX7DnjmNDqjlg"
  },
  "WcvzYWIPuQIuoQ2m3IO8Mg": {
    "date": "12/1/2017",
    "text": "We were in Pittsburgh for work and as always, I was looking around for a restaurant that would be distinct to my memory of Pittsburg. We were craving something spicy but in small plates. Mexican could be that, or, even better British Indian Tapas Bar!   Needle and Pin is located in a busier part of the city with roadside parking. Comfortable seating. Romanti, dark, modern. Cocktails ( Rum n Manhattan) were to the point. Decent variety. The food is Magic! Literally!! We got paneer chilli which was top notch, gobi manchurian delicious and malai kofta nutty n creamy! We relished every bite. 10/10.   I am coming back for pani puri ( they were out of), scotch egg and chicken tikka entree.   This is a gem and I can only wish there were many more of such tapas Indian Cocktail Bars. Highly recommended. Cannot miss. Must not miss!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "lSnVB02Re9tDqUI5_6Le-A",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Gobhi manchurian",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lSnVB02Re9tDqUI5_6Le-A/o.jpg"
      },
      {
        "img_id": "wHOM7VAe0WUVn-yfN-_0zA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Malai kofta",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wHOM7VAe0WUVn-yfN-_0zA/o.jpg"
      },
      {
        "img_id": "uNKW-WqdbaAz5WZscABA2Q",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Chilli paneer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uNKW-WqdbaAz5WZscABA2Q/o.jpg"
      }
    ],
    "user_id": "90uizWb-jR-F1YxQsEHSMw"
  },
  "UBFPgvAui3T_acji8Tk-hQ": {
    "date": "10/14/2018",
    "text": "I ordered the chicken tikka masala and was not very impressed. The portion was fairly small and the dish seemed a little bland. The atmosphere was amazing though so I would definitely recommend for cocktails.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9hJVSvv3dY8zUTgWPXCS6g"
  },
  "hD5HTsHREbTGwblZI8qhTA": {
    "date": "8/22/2018",
    "text": "So, so good. More Indian flavors than English but you can definitely see the English influences in the menu. The remodel is beautiful! Love the subtle heat in many things including drinks and the naan. I totally enjoyed the restaurant - definitely a positive addition to Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "0KM4sq0fSLuKk-Vw6wCpbQ"
  },
  "AoG3yKIhoUBdLLKFIIw_GA": {
    "date": "9/21/2018",
    "text": "We went in on a Friday night and sat at a table in the bar area at about 9:00pm. The bar was quite full, but the servers had plenty of time to converse with other patrons at the bar.  I sat for about 10 minutes and two servers walked by to service other tables and we got no greeting or acknowledgment. We ended leaving so I have no other experience other than poor hospitality.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jLF_wCCY-qn_zJh1MMYpag"
  },
  "yNq2rVWMjBh7VjZsRBegLw": {
    "date": "3/4/2018",
    "text": "My friend and I tried this for the first time during brunch. We were really excited to try the mimosa. It was delicious, but I wish the glass was filled up a bit more. It was in a huge $8 wine glass and not even filled up halfway. We did love the aroma of the flower that added a little spunk to our drink! We decided to split the bread board which was two different types of bread, along with a really two yummy dipping sauces and some butter. We both really loved this. I ordered the mini bagels with salmon and a poached egg. This is not something I would normally order, but was glad that I did. It was delicious! The portion sizes weren't big, but decent size for brunch. We also decided to order vodkas and orange juice. These were a cheaper option than the mimosas and tasted great! The bartender clearly knows what he/she is doing. The place is very decorative and cute. Staff is very friendly. Hidden gem in Dormont that we will be returning to!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VO8u_O4moCO3SUA69JQmYw",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VO8u_O4moCO3SUA69JQmYw/o.jpg"
      },
      {
        "img_id": "cUOce1sFhlafEgQbLjTmzw",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cUOce1sFhlafEgQbLjTmzw/o.jpg"
      },
      {
        "img_id": "6cnrNaLWbPJkKrZIjKG08g",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6cnrNaLWbPJkKrZIjKG08g/o.jpg"
      }
    ],
    "user_id": "XVTqV_zHUWC6BOfOsq3nRg"
  },
  "9ljhYpl3dXiB24IuPXaqZQ": {
    "date": "7/28/2018",
    "text": "My whole experience wasn't perfect but the food was very good. Service could be more attentive. This place is ambitious but they pull it off. We will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7VTKTDeBfOXruwKajOlXtg"
  },
  "yG-4d99Xy2QsSl6wcuMd6w": {
    "date": "8/1/2018",
    "text": "This is one of my absolute favorite spots in the Greater Pittsburgh Area! Being from England originally, I love a both English and Indian food... the fusion style of this restaurant is amazing. I also consider myself a gin aficionado and their gin bar has a massive collection to make a number of amazing gin cocktails.   My favorite dish, by far, is the chicken tikka grilled cheese with the tomato bisque.  The Gobi Manchurian is also AMAZING! If you love a good chicken tikka like I do, I don't recommend the chicken tikka here - only because it's a really nontraditional tikka due to the noodles and the sauce isn't too flavorful.   The vibe is very hipster and the restaurant itself is pretty dark - if you're not into that, I recommend trying to get past it to really get a taste of some awesome English-Fusion food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "o_iRK516QddvopdKRTTnCQ"
  },
  "Nlzp6qKAXEU7i_ot7JHGbg": {
    "date": "4/1/2018",
    "text": "BOTTOM LINE: just get the paneer tikka.  **Let's face it no one reads the whole review to get to the bottom line so I've placed it in the beginning to make sure you read it.   I must have passed this place hundreds of times before and never realized it for what it was rather assumed it was a high end tailor shop! So imagine my surprise/excitement when I realized this place existed.  The decor at Needle and Pin is very modernistic and hip. The aura is great and I would easily come here more often if they would transplant themselves to where Tender used to be in Lawrenceville!!! (Although can anything ever replace the amazing-ness that was Tender?) They have a full bar and a great extensive list of drinks which feature a wide selection of *gin* cocktails. Our server was very helpful and nice, even encouraging us to request cocktails made to our liking!   Food wise, I was a little let down. We ordered a few things-the Lamb lollipop, the paneer tikka, beef Wellington and the Scottish Eggs. The lamb had a lamby taste which I didn't enjoy. However, my friend thought they were great and didn't notice the gamey taste at all. I found the beef Wellington very bland and the Scottish eggs had a weird taste--I'm not sure but it tasted like they used chickpea batter to deep fry the eggs and it just didn't taste that great. Honestly, I only liked the paneer tikka because it was the most favorable dish we ordered-BUT also the most non British thing on the menu. Not to get super deep and heavy on a yelp post but I am always unsure how to feel about \"British\" food when so much of it is stolen bits and pieces of my culture during years of oppression and exploitation--I'm not salty about it But so isn't the beef Wellington so maybe don't order that.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "pzr7H5sjUkdR9Y7XjH8txw",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Lamb lollipops",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pzr7H5sjUkdR9Y7XjH8txw/o.jpg"
      },
      {
        "img_id": "UeaZwdzG6-BpzDL14h368w",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Beef Wellington",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UeaZwdzG6-BpzDL14h368w/o.jpg"
      },
      {
        "img_id": "4xS2QK--9SnCZk3DCHh51Q",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Scottish Eggs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4xS2QK--9SnCZk3DCHh51Q/o.jpg"
      }
    ],
    "user_id": "XImR8FdsuTMorIXcmBN4Qg"
  },
  "8rAXoQYS3aucWiTkO_sOvw": {
    "date": "10/19/2018",
    "text": "Needle and pin is great, happy hour specials are wonderful. Reservations recommended for weekend evenings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_Nl47AMaTYWtzr58HroLfQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_Nl47AMaTYWtzr58HroLfQ/o.jpg"
      },
      {
        "img_id": "IcD7XFju5CGUqGXbHEZSrA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IcD7XFju5CGUqGXbHEZSrA/o.jpg"
      },
      {
        "img_id": "9-1CwA8hbrHBnmFoBCe8JA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9-1CwA8hbrHBnmFoBCe8JA/o.jpg"
      }
    ],
    "user_id": "q7kb0GVCWOdORhOrRfkxbw"
  },
  "IoFnryFdbY9-PMBLXISNLw": {
    "date": "2/22/2018",
    "text": "I had been waiting to come here for months. It first opened and I was pregnant and bitter I couldn't partake in their vast gin list. Then I had a newborn and was going crazy with adjusting. Finally, things settled down and the time had come to visit and I'm happy to report I was very happy!   The restaurant itself is gorgeous. I love the design. It's funky and cozy. I was mesmerized by the light up bar. Yes, the bar lights up! But not in a cheesy neon way, you just have to see it for yourself.   The cocktail menu is extensive. There's A LOT of drinks to be drunk. If you're not a gin fan, they do have other alcohol, but clearly the focus is gin. If you're a gin lover, you'll be in heaven! I can never pass up a negroni, and so I tried one of those to start with. It was a nice balance between all ingredients. Then I tried the spicy hell or high water with a spicy chili infused gin. So good!   For dinner we split a handful of things like the lamb lollipops were perfectly cooked, the gobi manchurian (crispy chickpea battered cauliflower) had a fab spicy sauce on top and the malai kofta was solid. We also split the main dish, a tikka masala. It's a hearty helping and really tasty. For my gluten free friends, everything I got was already naturally GF and the only thing I had to leave off was the english biscuit in the tikki masala. They actually brought out the dish with the biscuits and made me a new one, which is super kind!   The service was very friendly and prompt and I'm really looking forward to making this my neighborhood haunt.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 15,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "ijeyHePYQKEnWDN2JmN0cg",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Negroni",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ijeyHePYQKEnWDN2JmN0cg/o.jpg"
      },
      {
        "img_id": "-G1MxoxzMDVnys4bKBhxpw",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Malai Kofta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-G1MxoxzMDVnys4bKBhxpw/o.jpg"
      },
      {
        "img_id": "-_x-UkKQhgWKwdswMsf0NA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. He&amp;#39;ll &amp;amp; Highwater",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-_x-UkKQhgWKwdswMsf0NA/o.jpg"
      }
    ],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "uJY5uhXIDEy-JnlQW0hvWg": {
    "date": "2/1/2018",
    "text": "Was excited to try this new Indian fusion restaurant in Dormont. To start off, my one friend and I split the plate of lamb chops. They were quite overpriced as two  lamb chops were $13.   In addition, my friend had the vegetarian curry and was not impressed. It was a dish, but not substantial at all. He is vegan, so he was really disappointed when he could tell that the meal had been contaminated by oil used in meat. He barely touched it and they didn't even take it back or get another option. After a lot of back and forth, they finally took off the vegetable curry.   I had the tikka masala grilled cheese, which was fine. The grilled cheese was good and the soup had some hints of Indian spices. My friends enjoyed their tikka masala. Throughout the duration of our meal, three of us never even got refills on water. Towards the end our waitress became apparently hostile. Overall, their food is overpriced for the quality and quantity and their management was just not accommodating. Unfortunately, we will not be back.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "gofnmwo5ptoEnQI47zCBYg"
  },
  "3UotJx-koOVTsFA1yz-QzA": {
    "date": "1/5/2018",
    "text": "What a hip little place in Dormont! I really loved every aspect of my visit to Needle and Pin (except maybe the parking situation). We got to try a few items from the menu and honestly, everything was pretty amazing, especially the cocktails and lamb lollipops! Actually, everything we ordered was wonderfully prepared. For the food prices, I think the portions are a little small. However, I left feeling satisfied so I can't complain. Needle and Pin's concept is unlike any other in Pittsburgh, which is fusion of English and Indian Cuisine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "6xkbhVjFL2g4Hc4COU5MLA": {
    "date": "1/28/2018",
    "text": "Visited for brunch, and left very happy. I was really excited by their cocktail menu and wanted to try their brunch experience before committing to having dinner and drinks...and I'm sold!  Their server and bartender both seemed very friendly, and the place has plentiful seating. There's bar seating, booths on the side, and more tables in the back. We got a booth which was really nice, and you could kind of look at all the different bottles they have at the bar from our seat.  Starting with drinks, my friend ordered the Raj Mimosa and I got the Brunch with Rita. I loved my drink so much. I felt like I could have had 5 and not gotten sick of it. Even if you think you don't like tequila, I think you would like this cocktail. My friend also loved their mimosa and said they liked it more than my drink (but I think my drink was better!).   For food, we tried the Curried Chicken Popover and the Miniature Bagel Bites. Both were around 8 or 9 dollars. The bagel bites were basically like a salmon eggs benedict on mini bagels, and was our safe bet order. The popover has curried chicken and vegetables inside with a poached egg on top, and was more of a gamble. I felt like the bagel bites were exactly what we expected (which means it was good), and the popover totally paid off (amazing!). The popover was a lot more flavorful than I imagined, and the curried insides went so well with the flaky and chewy pastry. I really appreciated how they used larger chunks of vegetables. Although it may have been a little salty on its own, it went great with my drink! ;)  I definitely need to come back to try more of both the drink and food menus!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bs5B6IEsOKxOdqEMx8-ptA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Miniature Bagel Bites",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bs5B6IEsOKxOdqEMx8-ptA/o.jpg"
      },
      {
        "img_id": "dDuOLM71IPgOWDbIUlnRPA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Curried Chicken Popover",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dDuOLM71IPgOWDbIUlnRPA/o.jpg"
      },
      {
        "img_id": "DvuR9GRwsAl094HDC5p6UQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Brunch with Rita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DvuR9GRwsAl094HDC5p6UQ/o.jpg"
      }
    ],
    "user_id": "GKlW5tDfCvAtbqnGzBokNw"
  },
  "w9nzkIwgCIJpIYsf3ZfisA": {
    "date": "12/9/2018",
    "text": "So, they closed in November. I guess I wasn't the only one who had a bad experience. I hope their next try is better and that they listen to the public, their customers.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-0Xu57zrI3Rxi8wGZsnWKQ"
  },
  "ArXFZ4v_hDyHTWGkFPEPtA": {
    "date": "8/25/2018",
    "text": "This is a great bar. They specialize in gin mixed drinks as well as Indian fusion food. I tried the impossible paratha which was delicious. Next I had the BBQ jack fruit sliders which were just like BBQ pulled pork and also delicious. Derek the bartender was very fast with the drink and food orders and explained everything about the food and drinks. I will definitely come back here when I come back to the Pittsburgh area.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rqwwAdxzdpENo7oqLQjCmg",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. BBQ Jack Fruit Sliders",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rqwwAdxzdpENo7oqLQjCmg/o.jpg"
      },
      {
        "img_id": "kY7wC-uM1QwERGJ4gkaQiQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Impossible Paratha",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kY7wC-uM1QwERGJ4gkaQiQ/o.jpg"
      }
    ],
    "user_id": "q0oVp-26XuMGz0UapA-QZQ"
  },
  "SCHJfQV7XrdXnktJlRrw2Q": {
    "date": "10/22/2017",
    "text": "Favorite brunch I've had in Pittsburgh. Everything about the meal was fantastic.   The decor is gorgeous (see pics), modern and clean with beautiful mosaics. Very well done.   Their coffee is quality, and oh the food, the fooood. I'm still drooling thinking about it. I ordered the bagel bites with smoked salmon, cream cheese, and poached eggs. Now these aren't just any bagels, these have got to be homemade, freshly made bagels. Soft and just a bit chewy. I can honestly say I've never had a bagel like that before. The portion was perfectly sized for me: two mini bagel halves topped with smoked salmon, cream cheese, cucumber, scallions, and a poached egg on each. Delish. And reasonable at $9 without eggs, $11 with them.  My friend ordered the curry chicken popover, which at $8 was truly the standout of the meal. Too bad I don't eat chicken :( :( but I did try a piece of the phyllo dough and a potato and oh my goodness, amazing and unique and would highly recommend. Apparently the chicken was perfectly cooked too. Very, very good size for the price.  We split the oat cakes topped with banana custard, whipped cream, caramelized banana and nuts. Think pancakes but a teensy but heavier and crisper, with a banana nut taste. Very sweet but yummy. $9.  I was a little afraid to try the brunch given the very few comments on yelp about it, but I'm here to say you. should. absolutely. go!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "p7vmYLjAvz0FQn7rCa2PFA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Brunch spread: mini bagel bites, curry chicken popover, and oat cakes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p7vmYLjAvz0FQn7rCa2PFA/o.jpg"
      },
      {
        "img_id": "fRNc7PB9eQegaG480krraA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Brunch mini bagel bites with poached eggs added",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fRNc7PB9eQegaG480krraA/o.jpg"
      },
      {
        "img_id": "M4kvQX6X772JT2jwqt2DOA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Brunch banana oat cakes (with plain banana on top instead of bacon wrapped banana)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/M4kvQX6X772JT2jwqt2DOA/o.jpg"
      }
    ],
    "user_id": "qjihic1ymkEVGc4d2GNEtQ"
  },
  "MtAVNMJMohTdN4gLOviVOg": {
    "date": "6/27/2017",
    "text": "New establishment in Mount Lebanon opened about a month or two ago. I was sadly not blown away by my experience but I wasn't exactly disappointed either. It wasn't terrible but didn't wow me. We were seated promptly and it server was very nice. She did help explain the menu. Since it is new, the interior is very nice and clean. Bar, table and some lounge seating with a couch.    Numerous cocktails are available but no whiskey list. Small plates and entrees available. I did enjoy the vegetable curry and my drink, the apricot kumquat bramble. The The English cheese and Indian accoutrement board was good but had an unbalanced amount of cheese and crostini to condiments.   Would be willing to come back if someone I knew wanted to try it, but I'm not sure if I'll want to come back on my own.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "8F3d6NmonSOQZUbqVUHFZw",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. English cheese with Indian accoutrement",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8F3d6NmonSOQZUbqVUHFZw/o.jpg"
      },
      {
        "img_id": "HUg6vrUJuYCoOFWeJSKMlw",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Negroni #6",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HUg6vrUJuYCoOFWeJSKMlw/o.jpg"
      },
      {
        "img_id": "9HAJOhb5wNvKEB10IoZctQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9HAJOhb5wNvKEB10IoZctQ/o.jpg"
      }
    ],
    "user_id": "mm9WYrFhiNqvHCyhQKw3Mg"
  },
  "GNCwN6ISoPAcWxQZS4FctA": {
    "date": "7/23/2018",
    "text": "This place is in Dormont. I don't care where you are in Pittsburgh, come here.  First, it's a GReat gin bar.  Like great. Second....yummy food. It's kinda like Indian fusion.   I came here for small plates with my mom one afternoon.  We got three small plates to share. We should have gotten two. The charcuterie plate was off the charts. So fresh, creative and delicious.  We ate everything on the plate.  No one eats everything on a charcuterie plate...but it was just perfect.  We got the yuccas- I would easily skip that- and we got the street something or other.  It was good.   I really enjoyed this place so much and had so many things that I still wanted to try that I came here on a date a week later.   My date got the tiki masala and I got the grilled cheese and soup.  Both were out of this world.  So good.  The soup was A.mazing! And I cant wait to go back and get the tiki masala after a bite of my dates.  Both trips I got a drink and both times I enjoyed their creations.  Very creative.  Pricey but creative.   I will be back soon. You should check it out too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "SHyWxJxb-mKiNgHPUSu3_g"
  },
  "S_orf7NJFhfe091wqWrepw": {
    "date": "7/3/2017",
    "text": "A cool new place for the area! Saw the idea of the British/Indian fusion and found it very interesting! Came with a couple of friends for dinner on Friday and were very pleased. The inside of the restaurant is well lit and well decorated - cool bar areas with lots of different types of gin to choose from. We were seated quickly at a booth and ordered our drinks and dinners. I got the Blackberry Bramble which was super tasty - fruity and refreshing! I also ordered the Tikka Grilled Cheese w/ Curried Coconut Tomato Bisque (such a mouthful) while my two friends both got the Tikka Masala. The food came out quickly and was fresh & hot. The friends enjoyed their Tikka Masala - spiced well and had some heat to it! The grilled cheese & bisque was also very good! The bisque was very heavy, so even though the dish didn't look huge, I was pretty stuffed!  For dessert, the two friends got the cheesecake and bread pudding. Cheesecake came wrapped in a puff pastry thing (we nicknamed it \"The Cheesecake Poof\") and a side of fruit puree. The cheesecake was super soft and delicious and went really well with the puff pasty! The bread pudding was very dense and well spiced! The garnishes of cranberries, raisins, and dates were also a nice touch.   Experience was very good overall! Service was relatively quick and very friendly. The food didn't blow me away but was definitely enjoyable, and I'd be interested in visiting again to try more dishes. A bit more expensive than a casual dinner, but a nice place to go for something a little more special. Given the unique menu, Needle and Pin would also be a great place to bring out of town-ers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6UwjGVnKjF6CV067CEETBg",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Bread pudding! Reassembled the cinnamon &amp;amp; mint leaves into a tree :)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6UwjGVnKjF6CV067CEETBg/o.jpg"
      },
      {
        "img_id": "joWxrZG1C48phRJx0DFvfg",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Tikka Grilled Cheese &amp;amp; Curried Coconut Tomato Bisque (w/ English Tea Biscuit).",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/joWxrZG1C48phRJx0DFvfg/o.jpg"
      },
      {
        "img_id": "vcEUW5grWgSy2J0qOD3tuw",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Tikka Masala (w/ English Tea Biscuit). Very interesting &amp;amp; different with the vermicelli noodles!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vcEUW5grWgSy2J0qOD3tuw/o.jpg"
      }
    ],
    "user_id": "MoFYvOoufOMyVTmUFAhRxQ"
  },
  "h1TvA638gj0DWm9zysHIYw": {
    "date": "2/6/2018",
    "text": "I wish it was possible to give three and a half stars - this place really wasn't bad at all. We LOVED the Scotch Eggs and Cumin Crusted Lamb Lollipops. Tons of flavor and a great size for a small plate.   My husband ordered the beef tenderloin and it was no bigger than the appetizers we'd just eaten. While the sweet potatoes and chili gastritis were both amazing, the beef was slightly underdone and was just far too small to be considered a main entree, especially for the price we paid for it. I understand that it's a recent trend to serve small portions, but this just left him hungry and it was not worth the cost.   I got the seared scallop soup while and the broth and scallops were delicious, my rice was extremely underdone. It wasn't just al dente, it was crunchy and retained no flavor from the amazing broth.   Because we were both starving, we wound up ordering beef Wellington at the end of the meal. While we're always happy to taste our way through a menu, we shouldn't have had to do this out of hunger for the prices we were paying. The Wellington was also underdone and these flavors sadly weren't there. The puff pastry wasn't cooked and left the dish soggy. And the flavor of the cauliflower (in my opinion, you may feel differently) didn't complement the flavor of the beef.   On a positive note, the staff was very friendly and the cocktails were great. It's a Gin bar and neither my husband or I are big gin fans, but i still loved my Hell or High Water and would come back for it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PMWypgn3Nax4Sqp0lplnEA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PMWypgn3Nax4Sqp0lplnEA/o.jpg"
      },
      {
        "img_id": "BuHraJJ3qWPGSArb4s74yQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BuHraJJ3qWPGSArb4s74yQ/o.jpg"
      },
      {
        "img_id": "cWth-T6EiOt1x1FnjTpiqg",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cWth-T6EiOt1x1FnjTpiqg/o.jpg"
      }
    ],
    "user_id": "omNj7MnqLM7-uFLNS6itLQ"
  },
  "s_Xus88sZrjZ0YW63pqw4A": {
    "date": "8/25/2018",
    "text": "GF TOOK ME FOR MY birthday   Great food, delish drinks , and cool atmosphere!  I'm going to try and head there tonight !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GNIc-1Hx9TN-S7iQJRFDuQ"
  },
  "9wJfwgH9-raFF4zEYPHqWw": {
    "date": "8/7/2018",
    "text": "Very cute place with cool vibe inside. Cocktails are excellent. Historic and modern. Can't go wrong here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "_TzczaQXyTUdtLIDeEJLSQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_TzczaQXyTUdtLIDeEJLSQ/o.jpg"
      }
    ],
    "user_id": "wzQRfj5Jlojav3ZHEVB9Gw"
  },
  "apQS26bjZioA04jUDwg_lQ": {
    "date": "7/6/2018",
    "text": "Great happy hour!  Inventive, tasty cocktails and delicious, well prepared, Anglo-Indian food.  The smoked duck on the sliders was so well balanced between the sweet sauce and the smoke on the duck.  Creamy herb raita dressing on the grilled ricotta tied the char and creaminess of the cheese with the arugula salad.  Another little gem here in the South Hills!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tBdr996zx0ZwbMKBMkLf-A",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Smoked duck sliders and seared ricotta chiesi.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tBdr996zx0ZwbMKBMkLf-A/o.jpg"
      },
      {
        "img_id": "Lhbr8syZtlUIcsynrUnXiQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Aviation with seared ricotta.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Lhbr8syZtlUIcsynrUnXiQ/o.jpg"
      }
    ],
    "user_id": "o63Kh_nsxPNyIHOWYQHTZw"
  },
  "y2kLkkf3JIvP9d0Zc_zdgw": {
    "date": "10/26/2017",
    "text": "Needle and Pin proves Victorious when challenged with the Dreaded Double Date!!!      First off, the cocktails here, for me, are the stars of the show. They have an incredible Gin menu, and they definitely know how to use it. If you like a little kick with your libations I would highly recommend the Hell or High-water, it was fantastic.     The food was very good, but there is definitely better Indian cuisine in Pittsburgh, however, I don't know of any other Indian/British restaurants that have the ambiance that Needle and Pin has, so if you're craving Tikka Masala, but also want a craft cocktail than the N&P just might be your spot. The Scotch eggs are delicious, I really enjoyed the Chili paneer with naan, and the Lamb Lollipops were wonderful, although they were served with cold vermicelli and some flaky pastry that were unimpressive. Also, my girlfriend and I Love Gobi Manchurian, but this was probably our least favorite dish of the evening.     Lastly, the biggest flaw of this dining experience was how painfully slow it took to get our food. Our reservation was for 7 and we didn't leave until after 10. Luckily we were really enjoying each others company, but man that could have really sucked if we were with people we didn't like. The restaurant was relatively empty, and they have been open long enough that you'd think they'd have the kinks worked out.     To summarize, if you're really craving great Indian food, I would recommend somewhere more authentic like Tamarind in Green Tree. If you're looking for trendy with great cocktails, this place delivers. Don't go with people you dislike, because you might be here awhile.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "UdXT553cKcW_dwOn_qvTeQ",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. The Aviation and Hell or High Water",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UdXT553cKcW_dwOn_qvTeQ/o.jpg"
      }
    ],
    "user_id": "bleyhN--91eJmPyJpXr9Mw"
  },
  "MEo8UTb462OXCjaZRipuNQ": {
    "date": "1/6/2018",
    "text": "Yknow, I really love the Pittsburgh food scene. Some of the best restaurants I've been to. And Needle And Pin just rose to the top of the ranks. Some of the best fused fusion I have ever had. Everything was perfectly balanced.  The star of the night was definitely the Beef Wellington bites! They were so tender they almost melted when I touched them. The Koftas were great as well, with a hearty Indian sauce. Heavy without being heavy.  My Gin Fizz was also fizzed to perfection. My Wife had a Lotus Blossom. Both drinks were well balanced and both had a flowery taste that was refreshing.  The staff was all smiles. Our waitress, Kristen, was efficient, cheery and knowledgeable about the menu. The entire staff worked together well and created a warm and happy atmosphere.  Thanks, Needle and Pin! We'll be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r_PhikfIA7Rk1N0gf_jh_A",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Malai Kofta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/r_PhikfIA7Rk1N0gf_jh_A/o.jpg"
      },
      {
        "img_id": "XnkrRzgb-4SpOPfEneJYmg",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Gobi Manchurian",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XnkrRzgb-4SpOPfEneJYmg/o.jpg"
      },
      {
        "img_id": "f5ScCQA3VtURPVHoAsleAA",
        "caption": "Photo of Needle and Pin - Pittsburgh, PA, United States. Fish and Chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/f5ScCQA3VtURPVHoAsleAA/o.jpg"
      }
    ],
    "user_id": "jmplhoWKidbyzj8SML3FtA"
  },
  "IBlj2rHHp3y_e3wlLinM-w": {
    "date": "5/29/2018",
    "text": "Holy crap! Mouth orgasm. As a group, we ordered 5 or so dishes and shared amongst ourselves. The brunch dishes were delicious! The only sub par one was the omelette. For having only one other table to service, the food took quite a while.    To deal with our hangriness, we ordered mimosas and boy were they good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t4eXeNeZ_V7uAHwIzH0uwA"
  },
  "31flpsMpnZssZPFe-N7sAA": {
    "date": "12/18/2017",
    "text": "This is my second time here. The first time there were moments of brilliance so I went back for more. The salad was the best ever on the first visit- so fresh and wonderful combination of tastes and textures. Tonight the salad was wilted. The tikka grilled cheese and tomato soup was also a real downer. The soup was first serve and not even warm. They took it back and it came back curdled and bland. The grilled cheese was more like grilled farm bread with a piece of cheese that stayed for a minute. I could go on but why bother. If it is a change of chefs then it doesn't bode well. All I know it will be sometime before I consider going back and spending my hard earned cash",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bb_a7k3Bmkxb5OFKoWwMBg"
  },
  "CeioL5ar3nf678px5b_w0A": {
    "date": "6/11/2017",
    "text": "The gin drinks were great and reasonably priced for Pittsburgh. We tried the kiawano Collins, outskirts of London, and the damn son. Liked them all. For food we wanted the fish and chips but sadly they were out. So we split the chili paneer, beef Wellington, and the grilled cheese. Our favorite was the grilled cheese. The tikka masala gave a great spice to the dish and the cheese was perfect. Our friend had previously raved about the wellingtons, but we weren't impressed. Too much puff pastry so it was mushy and the sauce underneath had an off taste and made everything soggy. The chili paneer was good - spicy but needed to be hotter in temperature. Cold cheese in a lukewarm sauce is not very appealing. I love the concept, some of the food just needs some work. I love gin, so we will come back for drinks and to split an appetizer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UDR3NRyy0o4J5O_I4aBPqA"
  },
  "CNKsbes8cCkltrd2wkwSRw": {
    "date": "6/8/2017",
    "text": "The cocktails were excellent! I got the aviation, which I've had at other restaurants, and this was certainly the best.  At first the concept of the menu was a little difficult to understand but basically it's a tapas bar with 4 entrees. Mostly everything was super tasty! I like the blending of Indian flavors with English dishes. The gobi manchurian.... daaaaaaamn. So good. My only complaint was that we ordered the steak and for 29$ they should've at least cooked it properly. Little over cooked.  Our waitress was very nice and helpful. Attentive without being overbearing.  The atmosphere is a little weird for being in the middle of Dormont so it'll have to grow on us, but the place is nicely designed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DUD1RNP_4wqA013SmGeQyA"
  },
  "SJWLpWweLnbWPf9YLuwQTg": {
    "date": "2/14/2018",
    "text": "Addie was a great server/waitress.   She guided us thru a great experience.   Scotch Eggs and Tomato Curry soup were my favorites.   Beef Wellington bites are great too.   They make s mean Manhattan- cocktails are worth the price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Vv-5d08Cm7ASI6bqB-iEA"
  },
  "bc2eGA_FzFaSZTmN6iQHxw": {
    "date": "7/7/2017",
    "text": "I loved every part of my experience here. The decor is very chic, the staff are so friendly and helpful, the cocktails are unique and delicious, and the food is AMAZING. I highly recommend the lamb lollipops and Outskirts of London cocktail. I will definitely be back in the near future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HiSVyLkKyujBefJ2bXfsiA"
  },
  "3JNLHMAGhXKdghHJVHISfQ": {
    "date": "6/16/2017",
    "text": "This is by far my favorite place to get a classic cocktail in Pittsburgh. Best customer service experience as well took their time with each customer",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7g13LVpfagZ5zEwDjJpLtA"
  },
  "9aJ6EvMLW7SWdGDlF_Ka6w": {
    "date": "6/3/2017",
    "text": "Had the best time with friends here last night! The place has a very welcoming and happy vibe to it. We had drinks at the bar first. I had the very best martini I have ever had - I asked the bartender to make something for me that he would recommend - it was fabulous. I'll have to go back to get another one! I also had the gin and tonic and it was delicious too. The drinks are all made with care and attention to detail. They may take a little longer but the taste is so worth it.   We moved to a table in the back for dinner. The dining room is cozy and I just love the mosaic artwork. It's very unique and pretty. The elephant's face mosaic is really something to see. It's huge - and beautiful.   We decided to get several dishes to share - all were very good. The fish and chips is a great twist on the classic - I asked for more chips because they were so good! Beef wellington bites, bombay greens were all great. The lamb lollipops were very tasty if a little over done.   A great start for a brand new place - which, by the way, is just what Dormont needs. We will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Td2PyG23LO_t_HxUW2OCIg"
  },
  "J13FNCJw3KMe7rpLhpPy5Q": {
    "date": "12/29/2017",
    "text": "We recently stopped in to sit at the bar and have some appetizers and drinks.  The food was awesome (beef Wellington bites and chili paneer). Robbie was a great bartender. Very knowledgeable and great to talk to while sitting at the bar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YncEuCsDXYH2mZRWcwkY2Q"
  },
  "b3kG4xRhnbrM9HUCjFK3Dg": {
    "date": "12/13/2017",
    "text": "You must give this place a try if you love cocktails! We tried 3 different ones, and all were amazing.  The tomato soup with tikka grilled cheese was really good.  My husband ordered the tikka masala and thought it was too sweet.  That is the only reason I gave it 4 stars instead of 5.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vUQYV3KaEZqW4HRuTi_cNw"
  },
  "2vvndIuM3fQ3SX_XiEC_cw": {
    "date": "5/27/2017",
    "text": "Ok, so this place just opened this weekend,  so take this into consideration.  My friends and I went here for drinks around 10 on Friday.  The cocktail menu had a lot of variety.  There weren't many people in there, but it took a really long time to get our drinks.  When we got them, the person that brought then was confused about what he had, but they turned out to be right.  They were pretty good...I had an Aviation and it tasted right.  We ordered a second round and by that time it was just us and it still took forever to get our drinks.  The atmosphere was kind of plain.  I guess I was just expecting more from a place that has such a unique concept.  The food menu looked really good, but we didn't eat.  I would definitely like to come back and eat and see what this place is like after they get a little more experience, so take this review with a grain of salt, I may change my rating after trying thus place again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "dlYWvO6H80qteMucEVPeKg"
  },
  "IDFIAw1kfkVF7NvZOErO7A": {
    "date": "6/1/2017",
    "text": "Came out of curiosity and was absolutely blown away by the results. Cocktail menu is full of gin cocktails, while also catering to people of other palettes (whiskey, wine, etc). I just returned from yet another trip in NYC and this place rivals, if not tops most. Classic Bees Knees was just the right amount of smooth and sweet without overdoing it. I also asked for a drink on the bartenders opinion which did not disappoint. Possibly the smoothest martini I have tasted. Since there are 80+ bottles of gin here we will have to return to explore them and the wonderful food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2M9KBOwUnR0stPbwVNasoQ"
  },
  "a9b1vBG6uiaSXiV0HbT6RA": {
    "date": "9/24/2017",
    "text": "This place gets most things right--great service, expertly-made delicate cocktails, a unique and well-executed menu, great music and ambiance. There really isn't much more, right? I'm a Dormont resident and am happy to a very good business like this roll in. Many people will drive by this place and say to themselves, if they recognize it as 1) a bar/restaurant and 2) open,  \"whoa, that place looks fancy for Dormont.\" They're absolutely right. Those driving by on their way in or out of Mt. Lebanon or Upper St. Clair should certainly take note of this place and plan a visit as soon as possible. You can't usually find this type of place outside the city limits. It also bares the prices of it's equal in the city. Nothing wrong with that,  just plan for it. If there's one thing I'd say as merely an observation, it's that it should be aware of and embrace it's place and importance in Dormont, not be the antithesis of Dormont's more \"traditional\" bar/restaurant scene. Not that they should go out, buy a TV and slap up some Steelers memorabilia, but rather try some twists on hometown specials (curry fries or masala perogies) or something that offers a palatable bridge to the new, unique kid on the block might offer some value and comfort to residents. In the meantime, they might have already tried...canned beer is a good start!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jm_rOB-P3w1_EOhvE2yQtg"
  },
  "1G98Mmw_bVHtTRkoZ-ReAg": {
    "date": "9/22/2017",
    "text": "The bartender is a genius! Aviation is a great one--and cool shade of lavender, also loved the negroni spaticella?? Nice to have interesting veggie options. The jackfruit curry was good, the malai kofta yum, and the star of the show--the grilled cheese. Wait staff were nice and helpful as well--the note about the G and T was appreciated--it is definitely not your typical tonic. Really herbal and unusual. Hope they keep bringing out new veggie options as the cocktails will bring us back here for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "emHfTOT1Ps7WgBmac9i15w"
  },
  "uwLcx9nQUpoczO8jnXG3hA": {
    "date": "6/3/2017",
    "text": "Visited on a Friday evening. The apps were delicious-particularly the fish and chips (which were actually pieces of naan!), lamb lollies and cheese platter. Had the filet as my main course and it was AMAZING.  It could hold its owns against any steakhouse in the Burgh. As for the drinks, I'm generally not a gin person but I am a believer after my visit to N&P.  The cocktails were meticulously crafted and looked as good as they tasted.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HWXWaxpmtwe_1ooJVfNi9w"
  },
  "kM3aw92qx3tUKRt_962LXw": {
    "date": "6/29/2017",
    "text": "I have now been to Needle & Pin twice and have been thrilled both times.  The drinks and food are excellent and the service has been fantastic.  I look forward to my next visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X8RMnt2TNdJYGyqFj5dLBw"
  },
  "mYHDrE0op3bjcEcrWtF40A": {
    "date": "6/3/2017",
    "text": "Excellent drinks and great small plates. Make sure you try the Scotch eggs, best I've ever had",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Baid-tLMdKiIIDUof7RDWA"
  },
  "iwS0GrjJJaE5UzFju3hBJw": {
    "date": "7/3/2017",
    "text": "bartender was an absolute jerk. i don't drink gin and his response was essentially to tell me that i am an idiot and that he would make me like it. instead, i ordered a diet soda but was told they didn't have any. what bar does not have diet soda?  then i asked for a water but instead of pouring me a normal water, he made a show of it and poured water into a fancy rocks glass garnished with a flower in a gesture of smartassery. i will never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gHyePV7DI2TGkSJJCOad4w"
  },
  "GkbOw8kyjYwqIGYyF8IkcQ": {
    "date": "7/3/2018",
    "text": "The food is really delicious! Cocktails were amazing and flavorful. Only complaint is that is was pretty expensive. Bill for three shared appetizers and three cocktails came to a little over $80 before tip. That seems like too much to me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VOXmTT6yhAcfWjEOi2Ax2g"
  },
  "A8ECBft_stB_L1eA_WPrGg": {
    "date": "11/16/2017",
    "text": "Our company held a corporate holiday party at Needle & Pen.  Atmosphere, food, drinks and staff were absolutely amazing.  Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iEs5imb_tV5e7zVIdzJ2XQ"
  },
  "i7AbEZCHK5zcMvjsYntKaw": {
    "date": "6/3/2017",
    "text": "Let me preface this by saying that I work in the service industry. I totally get having kinks when a restaurant first opens. But there were so many problems all across the board that I am not sure it's possible to right this ship.  Normally, I write a narrative review. That would take up too much time for both of us, so I'm going to list the problems that my group and I had:  1) Service. It was terrible.They apologized and said that they were short staffed. But there was ZERO urgency on behalf of the staff. None. Our waiter, who was doubling as host, seemed to just amble around, not doing much of either task. It took us about 10 minutes to get water. 10 minutes for him to come back to take our drink orders. When the drinks came out after about another 10 minutes, he didn't bring mine. I figured he was on his way back to grab it. NOPE, He returned after about 10 MORE minutes to see if we were ready to order food. At that point, I mentioned my drink. Which he then went back to grab, It was a bramble. There was no stirrer, no straw. So it was gin on the top, blackberry at the bottom. Also, the waiter blamed me not getting my entree on the POS system (er...don't you enter it into the system). Eveyrone was done eating before they got it out to me (really? How long does it take to make grilled cheese....especially since the forgotten order should have been bumped up to first on the list, as it is in EVERY RESTAURANT IN WHICH I'VE WORKED). We ended up asking them to forget it.  2) Food: Neither Anglo, nor Indian. Everything was so sweet. Except for the Curry Pot Pie, which was nearly inedible due to saltiness. The Chilli Paneer was not bad, but was Thai in flavor profile. Foodwise, our meal was one gigantic disappointment.   3) Drinks: There is no gin menu. Repeat. NO GIN MENU. They tout carrying 80 gins, but can't be bothered with providing a menu for the patrons. This is something that takes 2 minutes to create as, ostensibly, they have a list of their gins on their inventory sheet. Cocktails sounded interesting, but were mediocre at best. And, again - served with no stirrers.  4) Bleach - If you still dare to go here, sit in the dining room. The tables to the side of the bar kept getting hit with nostril burning bleach waves from the bar sink.   5) Ambiance. Meh  We expressed our disappointment to the staff. At no time did a manager come over to speak with us.   I would love for Needle & Pin to turn this around. But it's so much more than just first week kinks. Bad food. Mediocre Drinks. It doesn't bode well.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "SUN2c4Nh84GrTtWxt7WYLQ"
  },
  "eHvq4x2NQmb_adgNsPUUeA": {
    "date": "10/26/2017",
    "text": "We have tried this place a couple of time. Once for full on dinner and once for drinks and apps. The beef Wellington bites were amazing. My husband isn't a gin drinker so opted for a beer, but was wowed when he tried my gin cocktail ... yummy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MH3WhxGbzCKWT10aeHHfFQ"
  },
  "s1HzQYVoGSjr8wMb3u2yMg": {
    "date": "6/16/2017",
    "text": "We visited Needle and Pin for the first time tonight (Friday). There were 6 of us, and as it is a new place, we ended up waiting for a little less than an hour.  (Standing near the bar) The drinks were really good. I only drank wine, but I tried my husband's Bees Knees  and it was tasty. Our dinner companions enjoyed their cocktails as well. When we were finally seated, the server came reasonably quickly. I asked for a Diet Coke and they had no diet soda, only coke in a bottle. What? No soda at the bar? Everyone needs something other than alcohol. So that is my first negative. The appetizers were tasty, and my husband had the grilled cheese which was quite good. I had the Wellington bites. I do not recommend them. They weren't bad, they just tasted like A1 and it overwhelmed the dish. It also was definitely not a full meal IMO. I don't need a huge portion, but I have a decent appetite and it didn't fully satisfy.  So I give 2 stars because the drinks and apps were good. I would not choose it for dinner, but if you want to go out and have a few cocktails with friends it would be a good place.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ynQWcEUSahZ9uegM9kE9Qw"
  },
  "kR0_sPjFlDPhTGo0TDdqWg": {
    "date": "4/14/2018",
    "text": "Nice date night spot. Sharing small plates or a full meal available. If you order small plates order one at a time. Otherwise they all come out at once. You can tell the servers care about the success of this place and the people who work there like it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yIvShW4vhyraSeUAvbBCSg"
  },
  "bx-FRApbyJjLjPDdf-e75A": {
    "date": "10/24/2017",
    "text": "First time guests, my wife and I shared 5 dishes from the menu and 4 specialty cocktails (classic and contemporary). Everything was outta sight! We love this place. The environment was intimate and current without pretension. We might go back tomorrow. They have a new menu rolling out soon and we would like to try everything on this one, before it goes. We are from a large food forward city and believe Pittsburgh needs a lot more places like this.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bQEgLSrldvu55QC8FFF2EQ"
  },
  "pbRATggpEmfM6u8qCJidWg": {
    "date": "6/9/2017",
    "text": "Needle&Pin was great! It's an excellent mix of English and Indian food  Colin did an outstanding job with the interior and ambiance.   The food is top notch-- standouts were the Chilli Paneer and the grilled cheese/coconut tomato soup. The chilli paneer had great heat and was a generous portion. The grilled cheese was made with custom bread that was to die for (so light and fluffy!) and an aged gruyere cheese. Honorable mention to the Wellington bites and tikka masala. Tons of great shareable dishes   It's a gin bar but the manhattans were A++   This is a great addition to the South Hills... I can't wait to try more cocktails and other items on the menu soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "69tnv4pzbJmZXH7IjfoAog"
  },
  "8GCT0orhSxf6rvmhTO-vdg": {
    "date": "6/29/2017",
    "text": "I was very excited about this place, especially i thought a great add to Dormont...but a big letdown.  Gave it a chance food-wise and drink-wise and it was a big disappointment. The customer service was not that friendly by any means.   Average over-priced drinks and food. I usually give things many chances but the experience was so bad that I won't return.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "79MxP4BVLfpmWqDilznLMg"
  },
  "LclddwavTwdTwxCgSfmNGg": {
    "date": "10/14/2017",
    "text": "Tried Needle and Pin on a friend's recommendation.  I am not very \"adventurous\" with food but tried a few dishes and enjoyed each of them! Am also not a gin drinker, but may be one now as I thoroughly enjoyed both drinks I tried.   Loved the atmosphere, the team there is friendly and knowledgeable and appreciated a brief visit with the chef!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vOqZu9KjGgGmxTz5U3vN8Q"
  },
  "29NowHISpXmS-9G3Q-ohag": {
    "date": "10/25/2017",
    "text": "I live right down the street, and this is my first time coming here. I've been missing out. The drinks.... I think we tried 8 of them... I can't say a bad thing about them. They were perfection. The atmosphere was great and the food was super good too! Between the both of us, we split 3 \"plates\", and 1 entree- it was a good amount of food, but a wonderful combo of everything. Will. Definitely. Be. Back. !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CpYGSdVhq1pi9HkH5CbjPQ"
  },
  "4xoL6yvLHrzLNXX8vvkGhw": {
    "date": "1/29/2018",
    "text": "I've gone here a few different times and each time I have the same experience. I absolutely love the drinks and the atmosphere and that's about where my love ends. Each time our server seems like they don't want to be there, and as a server I understand that some days are hard, but you need to put a smile on and attend to your tables and they never come around to check on us. I've sat for about 15-20 minutes waiting for another drink before they finally come around and ask. But I really do love the drinks and atmosphere and I always go with great company so I always have a good time here but if the service could be more friendly and attentive it'd be 4.5-5 stars!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VP-xrKK2GDjloyG95qKgtw"
  },
  "pizI8ALzjQCnHP8US_SIzg": {
    "date": "7/2/2017",
    "text": "Awesome place! Very creative menu, both with food and drinks. We tried several of the drinks and many of the items on the menu and it was great for sharing. The tikka masala with noodles was a really cool twist and absolutely delicious. Friendly staff and fun atmosphere. Highly recommend this place and can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wXNQa8Er2PoumGvUotdeRg"
  },
  "pNC4sXpKrj1ylhhB91AZVQ": {
    "date": "6/23/2017",
    "text": "Sat at bar and had a few cocktails which were fabulous. I even tested the owner's skills by ordering an off menu cocktail which is not all that common...he knew it, made it, and it was perfect. I'm not going to say what the cocktail is called b/c it's a chore to make:) Atmosphere is pretty cool with a bar that twinkles at night (no...it wasn't too many drinks...). The business looks west so we watched a nice sunset before ordering the Gobi (cauliflower) appetizer. It was excellent. I was super hungry so I was a little disappointed in the amount. Not that I look for Pittsburgh portions, but it really was not enough for my wife + I. I wanted to order the fish + chips, but alas they were out. Disappointing big time, but it gives me an excuse to go back. Which I will. Great addition to the Mt. Lebanon/Dormont borderlands.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mIyOekSeriEs7kZ9UHGF6Q"
  },
  "-rah2qLIjlBkJjMP_VzW5g": {
    "date": "6/23/2017",
    "text": "Last night my bride suggested that we try Needle and Pin, obviously I married a smart woman! Addy was our server and she was outstanding. The food reminded us of when we lived in the Washington DC area. We started with the scotch eggs and chicken curry pot pie. It was the best scotch eggs that I've ever had, they were amazing. We continued with beef wellington bites and the roasted vegetable and jackfruit curry. Everything was perfectly prepared. We are thrilled to have a restaurant of this quality in our neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cUKXCDWut80gT1y2Z-4wTQ"
  },
  "mEVGuKXGu1Ph8ZZASRubQw": {
    "date": "6/21/2018",
    "text": "It was my one year anniversary with my wife and was utterly amazed by the extent they went through to accommodate our reservation. The newly featured food menu had choices that not only met my love of food, but especially to my wife who is vegetarian. I absolutely recommend this restaurant to anyone and everyone. I also can't forget to mention the cocktail menu. Now this being said from someone who highly enjoys bourbon and scotch served net when it comes to liquor. Their mixologist/bartender has a very diverse knowledge of gin. A spirit that has been on my \"I want to try, but haven't really had a reason\" list. Well now because of the very very wide selection of gin varietals available at Needle and Pin, I am fully open to discovering a new found respect for gin and the variations of cocktails it can be utilized for with their creations. I know my wife and I highly loved and appreciated our one year anniversary and the many many more to come, but we will definitely be going back to Needle and Pin at a moment's notice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qu8Y4COgSfkPe_mVfkrH-Q"
  },
  "MsVkQLA3vAk19aAyXKw8iw": {
    "date": "7/22/2017",
    "text": "Had a fantastic time here, scotch eggs are just like home and bartenders make it feel like a proper speakeasy from back in the day. Cocktails are hard and creatively pulled together and the Chicken Tikka was surprisingly awesome considering the twist of it being served with noodles. Funky place, cool atmosphere. Get there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9us19qLv73dgNjBPLcXcTg"
  },
  "6cEIhjN3n1gLZfGaUUEilQ": {
    "date": "7/15/2017",
    "text": "We enjoyed our experience at Needle and Pin. As others noted, they did a great job of decorating. The location provides excellent sunset lighting. The bar is really cool and the back area is very inviting.   The drinks were awesome. I never liked gin until I drank a few here. The food was okay. It might be my taste for Indian food that makes it harder for me to enjoy it. The biggest issue for most people will be that portions are very small. They describe the menu as shareable items. I recommend getting about 4 shareable items for a full meal. For pricing, you're looking at about $10 a drink and about $9-14 a plate. Think of it as a tapas experience.  Overall, we would definitely come back and would recommend it. Like I said before, the drinks were sessions and easy to love even if you don't care for gin.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nOherNG9vm7B7RnpiwzHLw"
  },
  "nX5f3LrutgXMHHS61wjb_g": {
    "date": "7/14/2017",
    "text": "Thankful for this addition to the south hills.  Small plates, so two plates per person, shared amongst, and we had happy bellies!  Food was great and unique for the area.  The maila kofta and the tikka grilled cheese were our favorites, soooo flavorful!  The vegetable curry was our least favorite, still good, but it was a little bland.  Lots of creative gin cocktails, the \"hell or high water\" was superb.  Look forward to coming back here soon, wish them success!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wy1ln3DFkADijBr1FPmYGA"
  },
  "8WGnIwUtVDX3ahU_coQ2tA": {
    "date": "5/28/2017",
    "text": "This is a great addition to the neighborhood. Delicious cocktails and delicious small plates. We sat at the bar and watched some really lovely looking drinks being crafted; gave me some ideas for what I want to try next.  Despite being busy, bartenders were friendly and kind enough to answer questions about what they were making.  (Seriously, there were some really pretty gin concoctions coming out of that bar.) The blackberry bramble was a nice sip. To eat, we had the malai kofta, which had an unexpectedly kicky (in a good way) sauce and the gobi Manchurian, which was light and crispy.  Next time, we'll do full dinner and I'll come back here and hopefully drop that fifth star.  Everything was reasonably priced and well executed.  Happy to have Needle and Pin in in my backyard; looking forward to a second trip.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "amIZAs1U-ooyHYLdobV-UA"
  }
}