{
  "sK9k7jX0mzaQob7uyTckoA": {
    "date": "3/13/2015",
    "text": "This is my first review ever. While at work, we've tried a lot of places in Oakland. This has been my favorite pizza place in the 8 years I've worked here! We ordered hushpuppies, the BBQ chicken pizza and the Bianco pizza. The food was phenomenal, the delivery was fast and friendly. We will continue to order from here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9sD6cJN2MX7X_qFfG4z-Rw"
  },
  "4f7xI_NZcD_Eh56mbi1cQw": {
    "date": "7/28/2016",
    "text": "First time I tried this place and was great. Quick, quality, and wholesome food in Oakland area. Try the chicken sharmola, will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C06Uza9tUSh10sl1bDeWeg"
  },
  "g8tD9k57R34GGdZ3w3GtXQ": {
    "date": "7/23/2015",
    "text": "Honestly wanted this place to be good since I work close by, but the food here has been disappointing. Service is friendly but the food doesn't cut it. Very heavy kabobs and meat when ordering sandwiches/wraps from the menu.  Disappointing as you expect kabobs to be tender.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "l44tgWB_Kl0CCmfEfZgeZA"
  },
  "uZLckP3XZlfolRnLGEd08Q": {
    "date": "3/1/2015",
    "text": "This place is awesome! Almost everyday for lunch I've been working my way through the menu and have loved everything so far!! These are a good group of people! Always happy to interact and make the customers satisfied! And the late night delivery is sweet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Hy3HVxFJATCQlxBXVTxgQ"
  },
  "qkAvAVxJsugl0nRaiAHQtA": {
    "date": "2/23/2016",
    "text": "Food really tasty! You should stop by and order a sandwich or a panini. I tried them both. Very delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iv6oFt-s7GWu0Q6lGYQaTg"
  },
  "oSaIC7Z1kCWyLq93tXRK4Q": {
    "date": "12/9/2016",
    "text": "I randomly stopped here while passing through Oakland. I noticed it was a new place and heard pretty good things about it. I ordered the kabob panini and it was pretty good! The portion size was just okay for the price, but it did come with fries. The sandwich was hot and fresh. The fries were well-seasoned. The service was good and the restaurant was relatively clean for a south Oakland establishment lol. I'll definitely return to try their pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j6N0QiGD-siPajYRt7dFCA"
  },
  "cHav6mmW1NMyghvK47JT6Q": {
    "date": "3/31/2017",
    "text": "It's late night that ends at Beta Bites is ALWAYS a legendary night. Fantastic food, fantastic vibe, always a great choice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MGObVGeTdDz9dlO-rkjNFg"
  },
  "WDTT2ECmqe3wALhA2Iq1tw": {
    "date": "7/25/2016",
    "text": "Beta Bites adds Moroccan style spices to many of their dishes, providing for a unique twist on the typical French fries, sandwiches and wings of a collegetown joint. Open quite late on weekends, nothing beats a chicken sharmola sandwich with fries after a night out. Ask about their loyalty card.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nx_htQFv1Ck4iCCyfJl7_g"
  },
  "azbWL3CLbaYVcllNvKiw9w": {
    "date": "7/27/2015",
    "text": "Very clean ristoront come over to test the morocans food like cocos on Friday emmmmm ya me!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WUMjuOuYeohlhQSIMkoSiA",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WUMjuOuYeohlhQSIMkoSiA/o.jpg"
      },
      {
        "img_id": "Giq4qAC3p8tkyfF5_q9bHA",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Giq4qAC3p8tkyfF5_q9bHA/o.jpg"
      }
    ],
    "user_id": "PfSQmZ9Lg5XfHtgAzLFm1A"
  },
  "0Zyzn_iu-T8Xbq3fZYocOQ": {
    "date": "1/2/2017",
    "text": "Best pizza take out / delivery in the east end; not the quickest, but the highest quality. Great pizza and fries. Falafel was decent too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nKOmsB7JOc00Io37M0VbYQ"
  },
  "EcOh0JOqjoaDPHnMtHb8pw": {
    "date": "1/31/2017",
    "text": "Not happy with my experience.  It took 1 hour 45 min for my food to be delivered.  when it said 45 min - 1 hour.  Also when i got my food it was not warm at all by that point.  I ORDERED a personal pizza came with 3 wings and a drink, and cheesy bread.  Pizza was ok but cold, and they gave me the wrong drink, and i got mozzarella sticks instead of cheesy bread.  I would order here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6m-qLc8A5iggauGeoh06Gw"
  },
  "uzQUFLH0oy92ANIUK7OxDQ": {
    "date": "8/20/2016",
    "text": "I ordered this today for delivery. Absolutely delicious. Took about an hour from order until they got to my door. I live about 15-20 minutes away so I think that's pretty reasonable!!!! Highly recommend you try this food out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UGlFoOB1CkJlS9AkaBPVDg"
  },
  "fljcLiJbt_3pomVaKQ2pIA": {
    "date": "9/18/2017",
    "text": "Great food and service with a large menu and fresh food. Homemade feel, nice pictures. The guy offered me a bottle of water for free. Very nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FxqvpWMAFj8ki1R8ETKhlw"
  },
  "5rhe_cUYc7Z-rSAKV59vPw": {
    "date": "3/31/2017",
    "text": "I've ordered delivery from Beta a few times and they've always come quickly with no issues. The delivery people are always really nice as well. Really good french fries, wings and chicken panini.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UcwzDDDK4dElIwBLTH4UwQ"
  },
  "uzokkvdhKj-1s-f3mOeoGQ": {
    "date": "3/26/2017",
    "text": "The food here is amazing. Excellent service and very friendly staff. Highly recommend this place. It's the best food I have had in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y3JT5e7s-96LMf34MxxxUg"
  },
  "69mXhzLjs-Nk5Po7VkW23A": {
    "date": "2/29/2016",
    "text": "Chicken sharmola (I think that's what it's called) is EXCELLENT. From the seasoning on the chicken to the homemade sauce. Food was hot upon arrival and the prices were what I would expect in Oakland. Wish I lived closer! I would order from them on a weekly basis!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IXD-jdycm7m34b_Nliy82g"
  },
  "ifAlKLZ1l5KPyfmdQpmPpQ": {
    "date": "3/11/2017",
    "text": "We got three subs and a falafel salad to-go. It wasn't until we got home and opened the bag that I realized that the dressing was missing from my salad. So although the rest of my family enjoyed their subs, sadly my meal was lacking and the falafels tasted dry without the dressing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kPSNU42dOaU3dEBNiS57kg"
  },
  "2loAGpi-jydkR8ILAVSBCw": {
    "date": "6/21/2015",
    "text": "They messed up my order and took forever to deliver two panini sandwiches. Not to mention, the chicken panini and meat panini were both dry and lacked sauce. I only ordered once from here. That will be my first and last time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "759GK1G6gond8HNM6slo1g"
  },
  "muR6JtFFZl_EWO3SKrkVBw": {
    "date": "3/15/2016",
    "text": "The chicken tagines are so yummy! My kids love the pizzas. We really love the different options that we can't get anywhere else. We always call in ahead and pick it up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pUxD4oca3e4lGcn6-H9GcQ"
  },
  "nmIm2MzLzI7xFkdIvTwbkw": {
    "date": "2/29/2016",
    "text": "This place is amazing! The fries are probably the best I've had in Pittsburgh so far. They also take a lot of care with every order and make sure the customer gets exactly what they want! This is my first positive Yelp review so I obviously really enjoyed my first couple visits here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9dmzh4GsH8IXPc4otY9YXw"
  },
  "8TdvS-G0y5BpWNfKtzkG2w": {
    "date": "2/24/2016",
    "text": "Beta bites has amazing food, lots of choices and the hot bar is always amazing! They deliver all over and the prices are great! Perfect for office meetings or anytime. It's also a nice place to meet friends and hang out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LYBBXGYSCXP_RM54zx3kpA"
  },
  "RioL40esK-hjq-YHoWPvqw": {
    "date": "3/29/2015",
    "text": "I ordered from Beta Bites through EatStreet since the Yelp reviews were good and I had a coupon.  Worst mistake ever.   Right from the beginning, the order was a disaster - the delivery guy made me walk across the block because he refused to get out of the car. It was freezing cold and all I had on were socks. He handed me the pizza through the passenger window and drove away without even an apology.  I ordered their verdure (veggie) pizza which is supposed to be topped with \"marinara sauce, spinach, mushrooms, tomatoes, banana peppers, roasted red peppers, mozzarella and provolone.\" There were maybe 6 slices of tomatoes and a minimal scattering of spinach, banana peppers, and red peppers. I think there were all of 5 mushrooms on the entire medium pizza.  On top of the lack of veggies, the pizza was awfully greasy. Even after patting down each slice with a napkin, I had difficulties getting through all of the oil.   And the cheese - besides being tasteless - would not stay on the slice. I found myself picking up oily globs of cheese that had fallen off the soggy crust.  Probably the worst pizza I've ever had in Pittsburgh.  For the price, this place's pizza is DEFINITELY not worth it - you're better off going to pretty much any other place in Oakland.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kPcRDFDZUte3Dokart6NsQ"
  },
  "K0HnLdyf6GEy00g9v9sX3w": {
    "date": "3/28/2015",
    "text": "I have lived in this city for 4 years and am generally unimpressed with the restaurant located in Oakland.  However, Beta Bites has overcome this feeling and is one of my favorite locations in all of Pittsburgh.  I highly recommend anything with chicken as their marinade is to die for.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-b7oApf6EKpAwEa6LW07FQ"
  },
  "y732-4sfnBojX9lpOm_SVg": {
    "date": "4/29/2015",
    "text": "I ducked in for a quick takeaway lunch on a rainy Monday this week. I was the only customer in the store the entire time my meal was prepared. After ordering and paying for the \"Beta Kabob Sub,\" I stood watching Rachael Ray's talk show for 15 minutes while the cashier and an older gentleman tinkered around the kitchen and adjusted fixtures above the stove with the tongs they would use to cook my food on the grill.  Finally, the cashier threw some chunks of meat on the cooking surface.  The result was a decent piece of bread filled with a handful of dry, chewy nuggets of sinewy meat.  Fries are included with the \"Beta Kabob Sub,\" so I figured the cashier had slipped them into the frier during a particularly riveting sequence on Rachael Ray's talk show. No. He waited until putting together my entire sub, slicing, and wrapping it, before asking whether I wanted the fries that are included with the meal. This added some additional unwanted time to an already ridiculously long wait. They did not have any bags for me to carry out my sub in, but they did try to mitigate the terrible service by offering a napkin.  Wait time for a single overcooked Beta Kabob Sub: 30 minutes.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c0yct4VoLIjlveUdtNeW7Q"
  },
  "JNo4g1sk6fd-ierulTr1Zg": {
    "date": "5/11/2015",
    "text": "This place is one of my favorites for delivery! Their pizza crust has a great flavor and is cooked perfectly. The pizza has yet to be greasy at all. I also like their salads alot. I was worried their garden salad was going to be a container of iceberg lettuce as you often get at pizza places, but it actually had vegetables on it and was green lettuce, not iceberg! The only reason I give them 4 stars and not 5, is there are limited choices and when ordering a salad you do not get a choice of dressing, although the dressing that came was great! I highly recommend this place for great delivery!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LPpE9nBQ3pfahbhzqQJQ5w"
  },
  "cKBY8Y33LlvKJL50umHhgw": {
    "date": "12/7/2016",
    "text": "This was the worst pizza I have tried to eat in a while.  I ordered the Buffalo Kafta Pizza.  First, if it was prepared correctly, it would still be disgusting.  They take what I assume is Frank's Red Hot and put it on top of bread with cheese on top of that.  I thought they would have a regular pizza with the toppings dipped in a butter/hot sauce, not the straight stuff out of the bottle.  Needless to say I could barely stomach a few bites.  THEN I noticed that the cheese was not even melted.  Please see the picture I uploaded here...you can see the raw cheese in the slice I pulled up.  Bread, hotsauce, un-melted cheese = nastiness.  To top things off they were out of mozzarella sticks so they had to call me.  They wanted to substitute instead of refund because I ordered via Grubhub so I went with the hummus.  This too was disgusting and oily.  One and done with this place, I will never order from here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tpDFI1Q4ZjlVn2BN2VrK0g",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Uncooked pizza with raw cheese on top of hot sauce bread...simply horrible.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tpDFI1Q4ZjlVn2BN2VrK0g/o.jpg"
      }
    ],
    "user_id": "FIt6aTdK_iWsxoBqGVHaFg"
  },
  "ofw06QgFPXBf8HJsLZynbQ": {
    "date": "12/9/2016",
    "text": "Every time, i visit this establishment, actually before i visit, i get the excitement of what i would be trying this time. The customer service is absolutely friendly, the chefs are outstanding. A Fusion of Moroccan, Italian and American cuisines, the result is a mouth watering dishes, salads, sandwiches....    You name it! The prices are extremely reasonable and the portions are very generous. I will be  back, with the same excitement for sure ;-) .",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tgSX8-UtlTuUSglNnhpCAA"
  },
  "bKyGqpJ50rCRJOuhCY5_jQ": {
    "date": "7/2/2018",
    "text": "I order delivery from beta bites often. While delivery times usually always take an hour or longer (for fried food, it seems long) and I only live 1 mile away, the food is usually good. Today I discovered to my disappointment that the shrimp was completely undercooked, and there was no seasoning on anything. :(",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zYPYYbdeRb8sLBqrUAfIwQ"
  },
  "EdScWdhaxLuvrulXml3mDA": {
    "date": "7/1/2018",
    "text": "The chicken tenders were over cooked and tasted terrible. The chicken for the chicken plate was great. It had flavor and was moist. The hush puppies were just right. I was not expecting the crab cakes to be fried, that was a disappointment. Once inside the crab was terrific. Just wish they were not fried. It would be better if in the description it mentioned that they were fried. Food arrived on time. Food was still hot once it arrived. I would recommend Beta Bites, I just think they need to add more to description of how food is prepared. I highly recommend the chicken plate and would order that again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YjPOp-9HgJZ0L6tLNjtQ0Q"
  },
  "OrVX1Zur8RrOFxLouiXWuQ": {
    "date": "11/10/2017",
    "text": "This place is reaaally good. I was a little unsure because some of the food didn't sound familiar, but it all ended up being tasty. I got the steak panini with pepperjack which was excellent. Husband got the same thing and loved it. I got a side of mac & cheese which was pretty good, not the best, but still good. Husband got french fries as his side and they were better than average restaurant fries. They had something extra on the outside that made them more crunchy. We got delivery through grubhub and it was very quick considering we live in South Hills, and the food was still hot. OH, and other notes about the steak panini since I'm super picky. It had that really thin shaved steak, like you'd get on a cheesesteak. Really nice, no fat or gristle or anything funky. The onions were sauteed, so no need to worry about raw onions. The pesto + dressing ended up tasting kind of like chipotle/spicy mayo with the pesto as a twist.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f3fTRZolbPsbEDb9A59UiA"
  },
  "4eLZ8hXgTkjfN9MlJ8IESQ": {
    "date": "11/24/2016",
    "text": "I ordered the chicken, shrimp and french fries to this place since they were still open when I wanted a late night bite. The woman delivered my food even after they had closed. I had heard that the food had a \"moroccan\" influence to it which I had never tasted before Everything was delicious! I can't exactly describe the flavor, but the shrimp and french fries were amazingly flavorful and crispy. The chicken planks were huge. And for the money that I paid for this trio, I was very pleased. Beta Bites is officially on my list of late night bites!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UyXqGEKod-veD6m6Hq0EDw"
  },
  "dR647gX2fhbIxGyrJEwxkQ": {
    "date": "8/8/2016",
    "text": "Whenever I usually have a restaurant to recommend to a friend in Oakland, I usually say Beta Bites. It's location on S. Bouquet Street seems to cause it to fall under the radar for most people who are used to more well known South Oakland eating establishments like Antoon's, Sorrento's, Campus Deli, Spice Island, Las Palmas, etc. Personally, I think it's one of Oakland's best kept secrets that you accidentally stumble upon after a long night of debauchery on the weekends, especially if you have no idea how you got to that part of S. Bouquet Street in the first place. Asides from the mystique of the place, the food is excellent (special shout out to their French Fries and Kufta Panini).   The food may take a while to serve since usually 1-2 people are working there at a time, but it's so worth the wait. Enjoy and tell all of your friends about this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "wNq95203ea2x148dqEeASg"
  },
  "_d7h-onLeHBGUkOd2bCjyw": {
    "date": "9/28/2016",
    "text": "My boyfriend and I's favorite pizza place re-did their menu and no longer has pizza. Saddened, we went on a search for a new go-to place and were very happy to find Beta Bites. I called and ordered a large pizza (wow, was it large!) and while the delivery did take a while, it was well worth the wait and understandable as it was prime Oakland dinner time. I had ordered roasted red peppers and they called back to tell me they were out of them and offered for me to pick two toppings for the price of one to make up for it. So nice!  After reading the reviews though, I'll have to rethink just considering this a pizza place. All of the sandwiches and Moroccan inspired dishes sound great right now.   I do have a question for the owner though, and seeing that he often replies, I'm hoping he can answer. I see that you have a Groupon offer. Is this valid for takeout? I often have friends over to my home for dinner and would like to use the Groupon to order takeout for us instead of cooking :) I just want to make sure that the limitation isn't for dine-in only. Thanks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ALhdDmsknP0edE7WUFuo0w"
  },
  "mWUI9xPfK9xNNlTgydHrcA": {
    "date": "4/1/2016",
    "text": "The hot bar, specifically the lamb, makes for a pretty amazing meal. I can't speak for the chicken or meatballs, but for $10 you get a huge lamb shank plus rice and sides. Not only are the portions huge, but the meat is super soft and full of flavor, and the bone comes apart with ease. Clearly, they've been stewing that stuff for hours. Plus, you get a couple sides to go along with the meal. This is definitely a good option for something different in Oakland, and if you come in between 2 and 4p they discount the meal by another $2.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "huuWbCNTm3qSngQdfJmejA",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Lamb and rice meal",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/huuWbCNTm3qSngQdfJmejA/o.jpg"
      }
    ],
    "user_id": "H7pj7sbXY3N-WSEwa-JfpA"
  },
  "R6Wo80XozkjIHpKzSNdYRA": {
    "date": "8/14/2016",
    "text": "Ordered from these guys several times. Delivery takes awhile so I'm always prepared to wait at least an hour before getting to chow down. The food is really decent compared to other take away places. I'm a fan of the panini sandwiches and salads. Everything is always warm upon arrival. Of course the salads aren't warm, they come chilled nicely with crisp and fresh vegetables. Nice selection of sides too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "hua2hoWqgU71CfYJydiHfw": {
    "date": "6/20/2017",
    "text": "I loved this place but they just got hit with a consumer alertafter an inspection turned up more than a dozen serious food safety violations. Today is June 20, 2017.  Details linked here from the Post-Gazette and are available from the Health Dept. so you have to decide for yourself. <a href=\"/redir?url=http%3A%2F%2Fwww.post-gazette.com%2Fbusiness%2Fhealthcare-business%2F2017%2F06%2F20%2FBeta-Bites-inspection-consumer-alert%2Fstories%2F201706200107&s=3d15b3fbab9bf83cf0cd06f9f2dbc92246837c32b06ce1204355c45c77d7db30\" target=\"_blank\" rel=\"nofollow\">post-gazette.com/busines...</a>  I'm rooting for them - I hope they pull it back together.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8nsRsdm3mS-B8pAjqj-dTQ"
  },
  "5dAigS-XQRLWAuwmIPuirg": {
    "date": "7/22/2016",
    "text": "Beta Bites has the best fries I've ever had. I tell everyone and I've gotten so many people addicted to them. Also their paninis are perfect, their sauces are amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zw_V_Hd-2bDCymvfII-8uQ"
  },
  "7jLPhUwLUAqXnaRgANEsSQ": {
    "date": "5/10/2018",
    "text": "Honestly, I am really hard to please when it comes to food.. ESPECIALLY pizza. I have absolutely NOT ONE BAD THING to say about this pizza. It is absolutely delicious!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3ji85aKAmk6KvsCGIcr1A"
  },
  "mg-MaivoN8z2ZYNm6RE4cg": {
    "date": "4/17/2016",
    "text": "We ordered delivery from Beta Bites at around midnight after my husband had gotten home late from work and I had taken too long to decide what I wanted. This was the only non-pizza place delivering to us in Bloomfield that late, so with regards to other reviews, we both had chicken sharmola subs and fries. For only $20, including our $5 tip, we got 2 large subs and fries. A great deal.  And absolutely delicious! Our food came with some sort of orange sauce that kind of tasted like thousand island dressing but way better, as well as a green sauce that was kind of basil and garlicky. The fries were some of the best I've had, and the sandwich wasn't spicy but very flavorful.  We will definitely be late night ordering from Beta Bites again!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ZpeUpUGSb4nHXeXWQGSdA"
  },
  "dT_HKv_5pioH4J5pxVAolg": {
    "date": "6/16/2015",
    "text": "I've only ordered delivery from this place -- and I'm judging it as it compares to other Pittsburgh delivery food (which I sometimes have to order, but is generally disappointing or even gross).  For a positive review this will sound slightly harsh, but I'm trying to make the distinction between real food (fresh, whole ingredients) and other things (like delivery tends to be), so I won't generally say that delivery is the best thing ever.  Ok, on with it...  Everything I've gotten from here has been pretty good.  The sandwiches (subs) are actually edible -- and if you like the filling, the panini is way better.  The subs/panini have more 'whole' ingredients, and I like the Kufta quite a bit!  Most places get their appetizers from some 'make your own pizza restaurant' frozen food service, and I think these guys do too (onion rings, okra, etc).  But, the food generally arrives less greasy and still crispy.  The pizza crust tastes less like a bunch of spongy preservatives, and more like food.  It's on the thinner side, by the way, and I think their sauce is good too.  Love getting pizza and a Moroccan sandwich in one place!  I also have to think that the people that work here are awesome, because both delivery guys I've met have been super nice!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0qucGOQ52CsBxo_wxfIU_g",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Beta Kufta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0qucGOQ52CsBxo_wxfIU_g/o.jpg"
      },
      {
        "img_id": "4hhaLkMzXf-rcb_kOQm8Eg",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Okra",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4hhaLkMzXf-rcb_kOQm8Eg/o.jpg"
      },
      {
        "img_id": "0Ote6SKJ3AtK1rFBNoJjTw",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Hushpuppies",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0Ote6SKJ3AtK1rFBNoJjTw/o.jpg"
      }
    ],
    "user_id": "YXuU5yyUy2q61WdF1O_76g"
  },
  "-4cDD6n_2AUK9DJXlwhceg": {
    "date": "6/1/2016",
    "text": "I cant recommend this place to anyone since the food is prepared by amateur cooks who dont mind serving leftovers for the next day nor are they very aware and acquanited with food safety handling regulations. The thing that caused a friend of mine to get food poising and diahrrea after ordering a kefta sandwitch.  Not ordering from there again! And we reallly missed the previous owner 'Salems halal' who moved to the strip district.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a1llS39SqkECOccZMoB0ZA"
  },
  "xTajDGkTMhcwQkb1AV4DQQ": {
    "date": "3/18/2016",
    "text": "Very glad Yelp recommended this place to me. I came on a Friday evening at 6 PM and ordered a chicken sharmola sub for $8.55 after tax, which came with fries. Wait for food took about 13 minutes, a very reasonable time given the 1-2 customers before me.  As for the food, all I can say is wow. The chicken was so, so tender and had a nice coating of spice. The bread was fresh and soft and packed with vegetables. The special beta bites dressing tasted like a variation of thousand island dressing perhaps mixed with curry and a touch of vinegar, and the slightly sour taste added a wonderful flavor to the sub. Also, the sub was huge - about 7-8 inches I'd say - as well as thick, so very filling  The fries were also hot and seasoned well with salt and pepper, seemingly before cooked.  I will definitely be back to try more items on the menu! I'm very impressed considering I usually never order subs since a lot of places only offer plain, boring options like turkey. This place had so many options that I could never get tired  Young workers there are also very friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uEG9thqwIK7CmWjLmeckdg",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Huge chicken sharmola sub",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uEG9thqwIK7CmWjLmeckdg/o.jpg"
      }
    ],
    "user_id": "k4rXLpIAZFNwxmgK2WcGxw"
  },
  "nEXw9REw8fuqlfhAJK0b8Q": {
    "date": "12/8/2016",
    "text": "Terrible Delivery Service. Manager and worker seems to not understand what the customer is saying and just had a rude attitude throughout.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C06OAM-Ew9gR8f6JrzMDYg"
  },
  "wyF0aevn0ve_zazH3UEueg": {
    "date": "12/8/2016",
    "text": "Had lamb with rice, lentils and loubia beans. It was obviously homemade and outstanding!  The owners are very friendly and love to cook their traditional moroccon foods. Well worth a try. You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P0ibqNxkPQFKQ8WVV-J14w"
  },
  "URWGtuH-_-kFQYpP9LSVmg": {
    "date": "1/7/2017",
    "text": "This place might very well be my favorite restaurant in Oakland. Ever single item on their menu is great. Their chicken tenders are homemade, the subs are incredible and the fries are the best I've ever had. I go here at least once a week and I confidently can say they are the best. They actually care about the food they make and their customers. 10/10 would recommend to everyone I know",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jHSsvLGM-DibBCVc5gtKbg",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Buffalo chicken pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jHSsvLGM-DibBCVc5gtKbg/o.jpg"
      }
    ],
    "user_id": "YX0BDEA_aRqFW9AI8rEsPw"
  },
  "3jikyOaiaPoX90sy5HxjqQ": {
    "date": "3/31/2018",
    "text": "I LOVE THIS PLACE!   I order from them a lot more than I'd like to admit.   Their food is ALWAYS always delicious.  They have the best customer service too!   Any time there was a problem, or they had a question they immediately called me to clarify.   They even called me once for an opinion since I ordered so regularly.   I recommend this place to everyone. Even my room mates have jumped on the bandwagon.   Definitely check this place out, you will not be disappointed!!   (I highly recommend their chicken panini!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yGM6xTPofmA-QrAnu1PZkA"
  },
  "yXJeoEn_6Lg6ISm3MHaklA": {
    "date": "6/25/2018",
    "text": "Went in for lunch and it was great!! Cute small place. Excellent and friendly service and the food was great. The falafel burrito was well made. Loved the consistency of the falafel and the way the burrito was grilled. It came with fries too which was a nice surprise. Definitely worth the price. Will go again and try the panini next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wofPlHy91N-7O38nUwyJ4g"
  },
  "fxcsaZ_TnYwU7c0ofaOI4Q": {
    "date": "12/10/2017",
    "text": "It was our first order from Beta Bite. I ordered a chicken pannini and my husband ordered a 10\" pepperoni pizza. The delivery was somehow fast and the quality was average. based on the reviews, I expected fries with my sandwich, but no fries! Also, my husband's pizza was small and oily. Surprisingly, there was also a chicken bone in my sandwich! In overall, average quality and expensive with respect to the small portions.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AzLEK_iZaeviqNZ4kGrzlg",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AzLEK_iZaeviqNZ4kGrzlg/o.jpg"
      }
    ],
    "user_id": "ZNtTwd6J74_zar1Ac6GqBQ"
  },
  "tD-63yaCZaQW62eqMZh0VQ": {
    "date": "3/5/2019",
    "text": "I discovered this place last week and ordered for a second time today. Delivery was on time. The staff was very friendly. The food was fantastic. The lamb kabob hoagie was perfect - fresh bread meat cooked to perfection, awsome sauce. I had mine with spinach and olives, which turned out to be a great combination. Try them...I think that you will be impressed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9_VTmP8ce_6ECneJOGqrhQ"
  },
  "uPSEkMwZuwgWWVxh3GdX5w": {
    "date": "8/7/2018",
    "text": "ordered 20 whole fried wings for my family and was pleasantly pleased with those crunchy pieces of pleasure.  I will definitely be ordering again real soon......like maybe tomorrow lol",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yXZ1J30dvl6uK3ojU-zvYA"
  },
  "AtUFUS0nY0Q1JRcCWV9loA": {
    "date": "10/29/2016",
    "text": "Pros: Delicious food for a decent prize   Open till relatively late   Very friendly customer service   Will work with you to custom order your food.   Halal (if you eat halal).  Cons: I didn't find any yet! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "e5buRsXHw-xzVCh6j6D_yg"
  },
  "3aNXYElsdao3u8VPy7doHQ": {
    "date": "1/8/2017",
    "text": "We got the steak burrito and falafel sub. Both were really good but the burrito is very small in comparison to the sub. The fries were also amazing. Delivery was also pretty fast, and it took around an hour to arrive.   We will definitely be coming back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5Nmrvlx-775MC_jDjKI7jw",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Onion rings are a little overpriced-- these cost $3",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5Nmrvlx-775MC_jDjKI7jw/o.jpg"
      },
      {
        "img_id": "9GqORFvFZf-hoz0OS0bTSA",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Falafel sub",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9GqORFvFZf-hoz0OS0bTSA/o.jpg"
      }
    ],
    "user_id": "3EN4rQgpR8cR1NxuJNzi9Q"
  },
  "6anSXccnLP-ESmaA8-hpBg": {
    "date": "7/25/2016",
    "text": "First off, I wish I saw the 30% off deal (per the Yelp page) for calling in the order! I'm a little bummed about that since I ordered via eat24 (owned by Yelp). Oh well!  I am not from the area, so I looked around on Yelp and Eat24 before settling on Beta Bites for dinner while staying near the Convention Center. I ordered the chicken sandwich, side of okra, and a Gatorade. I didn't know that the sandwich came with fries, so it ended up being a lot more food than I expected! Everything was great- my only complaint would be the bread to chicken/veggies ratio (lots of bread, not much in the sandwich). The fries and okra were delicious, as were the sauces on the side. I just couldn't finish everything.  Food came on time, delivery man was friendly, and everything was under $20! I would definitely order from them again if I'm back in the city!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lrka1Tcm9XWztOO-eM87Mg",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Okra was cooked perfectly!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lrka1Tcm9XWztOO-eM87Mg/o.jpg"
      },
      {
        "img_id": "4dvZzyR3mxmJ83TOUMa0zA",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Chicken sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4dvZzyR3mxmJ83TOUMa0zA/o.jpg"
      },
      {
        "img_id": "zi0iuiLHZ2taBybSTKE4MQ",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Delicious fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zi0iuiLHZ2taBybSTKE4MQ/o.jpg"
      }
    ],
    "user_id": "_vgG4XF8NCZBmZzP-5CTLQ"
  },
  "ePq32Z80VR8KMzRD1jbD6A": {
    "date": "9/26/2017",
    "text": "Definitely don't come here if you're expecting traditional Moroccan dishes. However, if you're looking for a good sub on-the-go, would recommend this place. Other yelpers mentioned getting the Chicken Sharmola, and I'd have to echo their recommendation. The sub came in a good-sized portion - couldn't even finish the entire thing actually. The chicken was not dry at all, and was covered in just the right amount of dressing that gave it a delicious savory flavor that kept you coming back for more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oZgQCWptnHoDxAg3KRuLvQ"
  },
  "Bv1TThHSCvMD1zLuiH4bXg": {
    "date": "4/19/2016",
    "text": "I stopped by last Fri. for lunch with a friend.  Those of you who follow my reviews know my general disdain for the pathetic lunch options available in Oakland, but occasionally, the need to have lunch at a local establishment arises, this being one of those times.  For those occasions, I keep a list of bookmarks of local lunch spots I haven't tried handy, and Beta Bites was the next such bookmark on my list.  For lunch, I ordered the chicken sharmola sandwich (I think it was a little over $7), and my friend ordered the salad with Moroccan chicken.  The sandwich came with fries and was quite large for the price (about a foot long, I believe), such that I could only finish half of it at one sitting.  It consisted of chicken, greens, bell peppers, and some kind of sauce similar to Thousand Island dressing.  While the chicken was nicely seasoned and the sauce added some flavor, I didn't find the sub super flavorful.  Upon eating the other half the next day, the addition of some whole grain mustard upped the flavor ante, improving it.  While I didn't try my friend's salad, the chicken appeared to be similarly seasoned, and the salad itself was quite large.  It came with a yogurt-based dressing that was green in color, which the cashier informed us was due to the inclusion of fresh parsley.  My friend said it was one of the best salads she's had recently, and she enjoyed it very much.  Unlike many local establishments that do most of their business via delivery, counter service was friendly and attentive, which was nice.  Prices were very reasonable, esp. given portion sizes, which is important for any eatery where a high proportion of customers are college students.  While I felt that the sub could have been more flavorful, I'm giving them the benefit of the doubt with a 4 star rating due to my friend's assessment of the salad, the service, the price:portion ratio, and the relative uniqueness for the area. Check it out and see what you think!",
    "rating": 4,
    "rated": {
      "funny": 11,
      "useful": 19,
      "cool": 20
    },
    "photos": [
      {
        "img_id": "ogRtvDFR6v63mkz43YHphA",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Chicken sharmola sub",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ogRtvDFR6v63mkz43YHphA/o.jpg"
      },
      {
        "img_id": "repIHito30V2I_e4C2QFOw",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Salad w/ chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/repIHito30V2I_e4C2QFOw/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "Kl2W0t1oaPqX15ZKOPYSqA": {
    "date": "3/27/2018",
    "text": "My fav neighborhood spot, literally located inside my residential neighborhood!! Everything I've tried on the menu so far is excellent--fried fish, shrimp, and chicken wings; kabob salad; steak Moroccan burrito (yes they put Moroccan salad on the burritos and it's amazing!!) The Beta Bites sauce is the best thing about this place, but it's highly coveted and dispensed in small doses. Highly recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MFsxkJN7VjNxbsH9EzmZxg"
  },
  "33UZRQqZ1DFM7Gs4l3c7vQ": {
    "date": "7/12/2017",
    "text": "Used to be Saleems so I stopped by. I had the chicken sharmola sandwich which was a good size and filled with well seasoned well-cooked chicken. The side fries were also my favorite, crispy and crunchy absolutely delicious. Don't let appearances fool you, Beta Bites is perfect for a quick lunch or ordering out.   I should mention the staff was so friendly and asked if my food was good and if I needed anything multiple times when I sat in for lunch this week. Lovely local Mediterranean joint.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "H5U7NJWU7pA3-xLQg70OFw"
  },
  "9FSCnGXUjmP6BCL-aNXSKQ": {
    "date": "11/6/2018",
    "text": "Amazing flavors and prices! Also I think they're the only place in Oakland that has FULL wings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZdMCpo-D-1-i5X4l8Mb2Eg"
  },
  "pBp7EbQIthAEpAj-Eh7zTQ": {
    "date": "5/3/2018",
    "text": "Terrible service. It took me 30 minutes to receive my to-go order. The person working there kept going to the back while my order was being made and in the end she ended up messing up my order. It made me very angry and wasn't even given an apology. Will not be returning",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_k5Fkhardd0CyeuCpYV_EQ"
  },
  "OKgWfbyTMLCGqXAfVwQF5g": {
    "date": "5/2/2018",
    "text": "One of my favorite places in Pittsburgh, the beta combo is a very tasty meal and the portions are really big. A very friendly team. It definitely deserves 5 stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4BkwcCg6bZFWTWUAcQMKtg"
  },
  "33WrUMU-D8b0YJAY3e7-eA": {
    "date": "10/24/2018",
    "text": "Delicious food and friendly staff! Eating in or taking out are great options, and delivery is always fast and accurate. The combination of more traditional Moroccan flavors and quick American favorites is awesome! The amount of food for the price is great for students and anyone on a budget.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OpIPKWkDuK6JRSYogutvPw"
  },
  "drnKD5SV5JMW8rUCWEvxFA": {
    "date": "10/19/2017",
    "text": "Yelp was pushing me to order through the app, so after a quick search I came across Beta Bites, the food looked delicious and they offer options I can't find commonly (Okra!)  The delivery wait was as expected from a place in the busy end of town (and big props for downtown delivery!), and the food was top notch. The Okra was delicious, the lamb panini was flavorful, and even the Mac & cheese tasted great. Def. on my go to list in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kupY6kAxBPmFyDVjjkqD-g"
  },
  "HcGMRbEUqcUWnmWSuLgBmg": {
    "date": "8/21/2018",
    "text": "There is no doubt that this place has great food. Their falafel is amazing, and they have some of the best pizza and fries I've ever had. It's surprising to me how underrated it is! The only downside is that every time I've tried to order delivery, they've either been unavailable, or said they weren't delivering at the time. Takeout is usually more efficient when ordering from here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QiKx7uHY4g4Xp0X2YmL73Q"
  },
  "931r639uW3tGLsPTaKxFHg": {
    "date": "10/13/2015",
    "text": "I am going to refer to this as a hidden gem in the Oakland area.  Especially when you take into account how similar most other places are in the area.  This has definitely earned it's place on my short list to get some food from when I am looking for a quick order in a sea of similarity.  If it wasn't for Yelp, I wouldn't have been able to have found this place.  Prior to my search I had not heard of this place from any of my friends or coworkers, nor had I seen a menu from this place.  Luckily for me they have a menu listed on their Yelp page and the prices/specials are accurate.  As soon as I told my coworkers I was going to order from there, they were eager enough to join me.  We ended up ordering an array of items and after consumption our overall consensus of this place is that it is some good eats.  I had decided to order the three cheese Panini and was blown away by this.  Consisting of cheddar, mozzarella, and provolone cheeses all perfectly melted with fresh tomato and spinach.  I'm not completely sure about this, as it was not in the description of the item, but I swear there was pesto on this and it was heavenly.  The Panini came with a side order of fries which were seasoned nicely.  Total for this meal, $8.  For the size of the Panini itself (read that as big) it was well worth every penny.  My one coworker decided to get the special of the day.  We ordered on a Friday which meant that you get 12 wings and a can of soda for $10.  That to me is a great deal.  These aren't those wing dings that other places try to pass off as wings, these were honest to goodness wings.  Lightly dusted and fried to perfection, or at least I think that's what my coworker was saying through a full mouth of food.  Other things to check out here, pepperoni pizza, hush puppies and their BIG fish sandwich.  If you order wings other than the special they come with a side of fries as well.  Prices are great for the amount of food you get.  To say that it is filling is kind of an understatement.  *Delivery available*",
    "rating": 4,
    "rated": {
      "funny": 11,
      "useful": 20,
      "cool": 13
    },
    "photos": [],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "DtVGV2zjOlrXc-GI0IDHPg": {
    "date": "11/11/2015",
    "text": "We ordered delivery dinner for four from Beta Bites. The order was placed online via the restaurant's website. I liked that one could select individual toppings for sandwiches, just as if one were there in person. The order arrived within an hour, the stated time, and all items were correct and hot.  I ordered a Beta Kufta Sandwich. Kufta is a Moroccan take on the Mediterranean kofta. Mine was made with rolled ground beef, with toppings such as lettuce, tomato, and onions. The Moroccan spices were delicious! Extra sauce provided, too. The sandwich came with French fries, equally good. All of our party enjoyed their meal. Definitely a successful ordering in experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_JmStiIqqG_CWc3PRPh1OQ"
  },
  "OjOYPlSb2uPA29jETbYVOw": {
    "date": "4/18/2019",
    "text": "Beta Bites's falafel panini is awesome! It is nice and warm, and the flavors are unique and delicious. The fries are also seasoned really well and are slightly tangy, which I love. Beta bites also has some zucchini fries that are pretty good.   The employees/owners are really nice. The only downside is that it can take a while to wait for your food, so it's best if you order ahead of time. Portion sizes are also a tad small (the falafel panini is a little bit small for the price in my opinion) but I love this place and will keep coming back! Definitely my favorite late-night grab and go food in Oakland.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uEpfN2yQ2DMI8k6DW73GWg"
  },
  "WP_7eG73MNL5VRZGxaHbiA": {
    "date": "6/25/2019",
    "text": "Food was not fresh, there were piles already cooked meat. And the meat is handled with bare hands, and my debit card/transaction was completed with those same hands.  I got the \"Beta Combo\", one of the most expensive items on the menu. The portion size was laughable compared to almost any other establishment in Oakland. The \"salad\" was the same amount of vegetables as toppings on a taco.   The tahini.. was practically fermented. It was sour and effervescent. So wrong.  Don't make my mistake. I wish I was exaggerating.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EO5xbz1Cd1qZ89og26p59Q"
  },
  "h-bx_o-hQYv5-isd1gmtZw": {
    "date": "12/10/2018",
    "text": "Currently going through all of my favorite delivery sports, to show some love! Beta Bites is great for pizza alternatives. I actually have not had the pizza because I've been too happy with the chicken plate. Rice, a boat-load of perfectly seasoned chicken, and salada! I adore it! Plus, they give you a side of tahini to tie it all together! It's definitely two meals worth and definitely satisfying!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "OWtzJMlqA7cY559O80nqQg"
  },
  "Eu7mxjGiOdvIYmr7RDezoA": {
    "date": "9/26/2018",
    "text": "There is nothing I like better during a day stuck at work for breakfast, lunch and dinner than to figure out where to order food delivery. Dinner delivery options in Pittsburgh has gotten so advanced, it's easy to explore beyond the realms of traditional pizza and Chinese with the advent of Yelp, Grubhub and Postmates.   I had ordered a quick work lunch from Beta Bites before and had eaten their falafel panini and fries with a couple wings. I loved their falafel taste but didn't love the panini compression of the sandwich. I would definitely order something falafel from them again, just not that. The fries were crispy and well seasoned, the wings crispy and good and served with ranch dressing. I had to add seasoning and hot sauce to the wings but the base flavor was good. Their food was good enough for me to order from them again.   What had interested me about Beta was that they offer a lamb and rice meal that looked pretty darn tasty in their thumbnail pic. I wasn't hungry enough to commit to that order though previously. Fortunately, I had a chance the other night to order the lamb and rice. It was pretty epic for food delivery. I don't know too many places that deliver an authentic Mediterranean lamb dinner. The lamb was deliciously braised and tender and the rice was a surprising star of its own. Very well seasoned the lamb and rice. It came with the choice of two sides; I had lentils  and salad with their Beta house dressing.   The lamb and rice was large enough to share, which was awesome, because I got to split and share their Kafta Morrito. Beta has a line of Moroccan themed burritos called \"morritos\"(?) Is that a thing? Oh my goodness, their Kafta (middle eastern seasoned meatball) is crave-worthy. I. highly recommend the Kafta Morrito, the lamb and rice dinner  and anything falafel for food delivery. Though they offer standard wings, fries and pizza for the college neighborhood in which they're based, I think their strength is in their mediterranean fare. Their prices are super reasonable too.  Sorry no pictures. I was too hungry.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 7
    },
    "photos": [],
    "user_id": "X315dgV7z031K70VD13uOg"
  },
  "ZqzDoQ2Ua2AJmRWXEmKXpQ": {
    "date": "7/26/2019",
    "text": "Chicken morrito was amazing (unique flavor) & filling. Reasonable price. Planning to come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xzPE3e9g6l_BEu21fRd46Q"
  },
  "5NpkioHqZowtq6-17PcSbw": {
    "date": "4/10/2019",
    "text": "Ordered a delivery through Grubhub, as I was in a semi hurry. They quoted a 1 hour delivery and I agreed and ordered. At the 1 hour mark, I received a call from Beta Bites stating their driver delivered my food to another house (not sure I believe that) and that they were willing, yes willing, to make me a new order and send it out. I stated that I could not wait and please refund my credit card. The gentleman suggested I call Grubhub, or he could call. I called, only to be told I could wait up to five days for a refund. HAHAHA. Never again! The shame is.... I liked Grubhub and used them quite often. Really guys, get it together, a little customer service may go a long way. Try it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UJxQRqYGTZTEKK6Pf4Wzzw"
  },
  "0yNtEQBcr17qZ3WzTBOL7Q": {
    "date": "7/6/2018",
    "text": "Beta Bites is an awesome place because 1) it was literally 100 ft away from my apartment, and 2) they have really tasty, affordable food. They service is great and they have a diverse menu. My favorite thing to order is the chicken sharmola with their bomb fries. The chicken is always juicy and tender, and the bread is always fresh. I've ordered this multiple times and its always been consistent!   My roommates and I love their fries, and sometimes order their fries to split when we need a quick carb-fix. I've heard their fried okra is good, but I have yet to try them. I've only ordered for pickup, so I can't comment on their delivery service, but they have a cheap delivery fee compared to other places in the Oakland area. Definitely check this place out if you want cheap and delicious food!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "SoItWLyIQUKtp8_SvQRMFg"
  },
  "K_p2zObCTnGB4GTaNEXEMg": {
    "date": "6/20/2018",
    "text": "Came here during lunchtime after stopping by the post office across the street. I ordered a lamb kabob sub and was pleasantly surprised by how good it turned out to be. Idk about the other reviews but the lamb was definitely good quality meat and their service was fast and reliable (~10 min to make the sandwich).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "7MW4pEkiqRvSwWIj8XwCog"
  },
  "Oa29tN8kamMRhegbd3oHDA": {
    "date": "12/10/2017",
    "text": "[Original Review - 2stars ] I ordered a 10 inches pepperoni pizza. Delivery was fast and pizza was still hot. The problem starts when i open the box and see a cheese pizza with four pieces of pepperoni (see picture). It was also super oilly and had a wierd taste. I wouldn't order pizza again from this place.  [Update] The owner messaged me after this review and apologized for what happened and said they had a very busy night. I appreciated the guestur and the fact that they care about their customers so i changed the rating.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "FRS5tIKKw1YIj_qt2k03aw",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Looks like anything but pepperoni pizza!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FRS5tIKKw1YIj_qt2k03aw/o.jpg"
      }
    ],
    "user_id": "_TCTRrCucniUT0z_mzxqnQ"
  },
  "3ceesXz8i5CQVqO-EZfbdg": {
    "date": "1/31/2017",
    "text": "Had been wanting to try this place for a while but did not want to venture into south Oakland. It kind of just pops out of no where on south bouquet street. There is some seating, but I opted for take out. I came for lunch and it was pretty empty. I ordered the lamb kufta panini and then waited about 10-15 minutes. I didn't mind because at least then I knew it was fresh.   Once I got home and opened it though I realized that they had given me a chicken panini instead of lamb. I guess the person taking the order didn't quite understand since English was not his first language. The chicken was alright nothing special had some type of seasoning on it. The panini was pretty good with the star being the beta bites dressing. It's a creamy dressing made with garlic and cilantro. The fries were also fine but pretty oily.   Overall, a mediocre place to grab a bite but nothing special. Very greasy so did not feel great after.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2DhrIQL9jWZlAe-IhHhy5Q",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Order area",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2DhrIQL9jWZlAe-IhHhy5Q/o.jpg"
      },
      {
        "img_id": "QzYju1fpGfkMJ3dbslNT1A",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Chicken panini",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QzYju1fpGfkMJ3dbslNT1A/o.jpg"
      }
    ],
    "user_id": "gofnmwo5ptoEnQI47zCBYg"
  },
  "4GBMaNLkv0We7CLeU7FshQ": {
    "date": "12/26/2017",
    "text": "I was excited to try this place because of the 4 stars but this place doesn't deserve that. Not really sure why it has that many stars, but to each their own. I ordered the lamb plate with four wings to try since I love wings. The wing plate also came with fries. The lamb was not good. Like. Not good at all. It didn't even taste like lamb and it was actually gray. I'm kind of irritated about it because it was a huge piece and got wasted because I couldn't eat it. It was stringy and just tasted terrible. That is not how lamb should taste or look. However, the basmati rice and the Mac and cheese were good that came with it.   Move onto the wings, they were good except they put salt all over the wings. You could literally see the salt on these wings. Super unnecessary and over powering on my lips. The size of the wings were nice and the fries were good, though. Maybe they should just stick to fries and rice. Will not be eating from here again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vRHUVyLn6uzShnF8uG4Qcg"
  },
  "-1rXggWI8A-fGY1EtOWb3g": {
    "date": "2/10/2019",
    "text": "I was rather excited to order from here and placed an order through Grubhub. They told me it would take about an hour. After an hour of waiting, I ended up having to wait another half hour. I wouldn't have been as agitated had they let me know it was going to be delayed. The chicken wings are awesome though. So I may order from here again. The delivery driver was also very polite and pleasant. If they could just work on their delivery timeliness, I would make this a five star review to be perfectly honest.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S6CU5gXs9sbxmkNQJdR6Fg"
  },
  "u-9r6mAK9efvjP5fgjlt4Q": {
    "date": "3/21/2018",
    "text": "First time in PA. It's so cool that it's snowing. I haven't seen snow since I was a young one. I flew in from California for a conference and I definitely wanted to try something different- so I decided, hey, let's order some Moroccan food. I placed my order, paid cash, tipped the driver, and so far I am pleased with the experience. The driver was very friendly and nice. I ordered quite a bit of things this evening including: Falafel salad, Falafel Morrito Burrito, Falafel Panini, and fries. I'm sampling everything right now and I'm so pleased with the food. Thanks Beta Bites for my first Moroccan food experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fJwtLYkHfuy7RpDY4IfSSg",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Delicious",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fJwtLYkHfuy7RpDY4IfSSg/o.jpg"
      },
      {
        "img_id": "axzXj54bqu5dm39q6a8S2w",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. French Fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/axzXj54bqu5dm39q6a8S2w/o.jpg"
      },
      {
        "img_id": "sW_pvtpteXY8OVoZ6NCLXA",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Falafel Falafel Morrito Burrito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sW_pvtpteXY8OVoZ6NCLXA/o.jpg"
      }
    ],
    "user_id": "6ZP4VyEkncJcyQ540S-KRw"
  },
  "J6C2QdS2K5WtiXiFLOEe3A": {
    "date": "5/4/2018",
    "text": "Excellent couscous Probably the only place in the 'burgh that offers it.  Available only on Friday.  A large piece of lamb with couscous and 3 or 4 boiled vegetables:  zucchini, squash, carrots, onions.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YolhhMbAEk6PD5opLYQ3hg",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Store Front",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YolhhMbAEk6PD5opLYQ3hg/o.jpg"
      },
      {
        "img_id": "XoQLL2zUlIaEZ-PxfW8sIQ",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. chef",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XoQLL2zUlIaEZ-PxfW8sIQ/o.jpg"
      },
      {
        "img_id": "4CfsUOpWhs5WBGrfy652GA",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Couscous",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4CfsUOpWhs5WBGrfy652GA/o.jpg"
      }
    ],
    "user_id": "mn1i8cZrRPzHzhLZ0mhIDg"
  },
  "0A-o9Z5lxZUVBGphNr4HBg": {
    "date": "8/24/2016",
    "text": "I'm so sad this place didn't work out for me as the employee I interacted with was very nice. I ordered a falafel panini and side of mac and cheese to go.  It was ready when I arrived but they forgot my mac and cheese so I had to wait in the non-AC building on a 90% humidity day. But... I didn't have to wait that long because I am 99.999% sure the mac and cheese is actually Stouffers. Stouffers mac & cheese has an iconic flavor to it, pretty hard to duplicate, and is just something you recognize when it hits your lips.   The falafel panini came with pesto. I should have realized that those two flavor profiles would not be complimentary. Ugh. I couldn't finish it.   The only redeeming parts were their french fries and price point.... The fries were flavored well with a food consistency.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Bfzz9eiqtlhu2Vu2MQ6BLA",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Bfzz9eiqtlhu2Vu2MQ6BLA/o.jpg"
      },
      {
        "img_id": "0rFlvdYyRnLAI4yhk2hh4g",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0rFlvdYyRnLAI4yhk2hh4g/o.jpg"
      },
      {
        "img_id": "dKCUhlqJUiRAilH-yEC_OQ",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Falafel panini fries and Mac and chees",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dKCUhlqJUiRAilH-yEC_OQ/o.jpg"
      }
    ],
    "user_id": "XYCIjBLP7VAJTIr5Ig0uwA"
  },
  "pVLvZV4EEMTpGQ_xgez2Ug": {
    "date": "10/11/2018",
    "text": "By far easily one of my top 3 places to order in from. Today I went though GrubHub and I had passed out before they got here. I understand I shouldn't have fallen asleep but it's based on a sickness. What I don't understand is why they can't leave it at the door that had ordered and paid for it? Thankfully Grubhub gave me a discount cause they're a great company, I'm just confused about all the work that it takes to drop off food at the door that bought it? I assume there's some kinda legal reason the drivers can't? Someone enlighten me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UnSTozhpGIwVJD0Y3N_8EA"
  },
  "fk_A4i1sioSwksJphhgUog": {
    "date": "10/21/2018",
    "text": "I think their food is hit or miss, for example, their pizza is like a frozen pizza you get at a supermarket - it's awful. Their fries are very good though",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-kfgS_ghCvdTYCwoUShlPg"
  },
  "HYRNsesDEsV_Z3Use5XqLQ": {
    "date": "3/16/2017",
    "text": "On of my campus favorites, I usually get either the falafel panini or the 3 cheese panini both are delicious. Their fries are exquisite, they are breaded and seasoned adding a nice flavor to it. I like to ask for the beta bites dressing on the side as well because the sauce is very flavorful and a perfect pairing to dip your fries in.   Only issue I've had here is that there is a $0.75 charge if you pay with credit card, but this can be compensated if you are a Pocket Points user and you redeem a 20% off menu item coupon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Fkl7urho1zLoI_lii769Lw",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. falafel panini and fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Fkl7urho1zLoI_lii769Lw/o.jpg"
      },
      {
        "img_id": "a3GKVW7DutPagy5FRo8J7w",
        "caption": "Photo of Beta Bites - Pittsburgh, PA, United States. Falafel panini",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/a3GKVW7DutPagy5FRo8J7w/o.jpg"
      }
    ],
    "user_id": "ufqLH9r2iZOuDUxTIieudw"
  },
  "4uNHuaf1iWxz35S6m7p51w": {
    "date": "6/4/2018",
    "text": "My husband and I came here to have a casual and quick dinner this evening - we really liked it! We ordered a chicken panini with fries and a beta combo, and we shared both. The portions were good - we were pretty hungry so finished almost everything. While both orders were good, the chicken panini was my favorite, and I definitely plan on getting it again next time. Also, the employees were very friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ySq-gVgm0gxmllf0ZFz-mA"
  },
  "ONtI-npDnRnHb0h5fLFy8Q": {
    "date": "6/22/2018",
    "text": "Good food, good customer service, open late, what more can you ask for. I had the chicken sharmola real good flavor. Worth stopping by.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "y00E97r-1OdMgwm7T1rnMQ"
  }
}