{
  "CoQU58yGWZf0txVddjBopA": {
    "date": "12/28/2014",
    "text": "Quiet semi-formal place for a good meal.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DsidhXXLstBBz8qaKEqeCQ"
  },
  "kNmMqjZjkkmoH1esPMxFfg": {
    "date": "11/27/2011",
    "text": "This place ok. Good food at a good price. Nothing special. The one thing that did always bug me about this place it won a best of reads award from the local paper when it was reopened like one week. Huh??? Looks like that award was bought and paid for.  For those of you unfamiliar the place was open a long time ago but closed and sat empty for yrs. Someone bought it fixed it up and reopened.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KfcifZdN-_X3qFYHtvUTzw"
  },
  "N4zCz4-WPOSn8h6BLojIRw": {
    "date": "5/24/2013",
    "text": "Wow! I have not been here in years! What a fabulous place!  The new ownership really does a great job. The food was delicious!  The chef and staff are great. Love the updated atmospher. What a step up! Bravo!  If you are anywhere near West Miffln you need to be here. Star was a delightful waitress. Everyone was professional, well informed and friendly! We will be back with friends!  Yum!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-eOFKYF-uO37XmP43fx-vw"
  },
  "IeqO50xhKCDbjrYwpuWP-g": {
    "date": "12/19/2010",
    "text": "I used to frequent Skyvue years ago but it fell on hard times and closed. So I was pleased to see it reopen. A group of 8 visited on a Friday might. Service was excellent and the menu was diverse enough that everyone found something of interest. It is nice to see a local restaurant come back from the dead.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EFrzjT58__1pvsh2v6jueQ"
  },
  "68GDIKOfdTy7zZ4UCdktaQ": {
    "date": "8/29/2014",
    "text": "This place is really good. First, the atmosphere inside is very nice. It's right across from the Allegheny County Airport, so of course the place has model airplanes, airplane pictures, and  other neat stuff like that tactfully place throughout.  The food is worth the visit. I had a steak, garlic potatoes, and veggies...cooked to perfection. My wife had chicken parm which she liked a lot (it wasn't Jioio's, but very tasty).  Try this place. Yinz will love it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cAMoUeJZol-thQmk2QKK-g"
  },
  "VCX5c-GlglMwA0eQydn-Rg": {
    "date": "2/5/2016",
    "text": "Back in the day....1999 and earlier this place was a great place to visit. good times, good friends, good food. However, I think it is worn out...location is bad, food not that great, the management is a disaster. not a fan favorite. As with this restaurant or any restaurant prior to visiting ,please go to Allegheny county Health Department for inspection reports. <a href=\"/redir?url=http%3A%2F%2Fwebapps.achd.net%2FRestaurant%2FRestaurantSearch.aspx&s=9cae0e4bbb77dfd693e4ed7b8c6c60d05b29f3b0f8cd093964198f27b838f346\" target=\"_blank\" rel=\"nofollow\">webapps.achd.net/Restaur...</a>.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hL2WRXhhRoK2IpZQv5sbbA"
  },
  "uNSUZWhu9-_q61egMv3sPA": {
    "date": "4/9/2014",
    "text": "Total surprise... Was staying in the area and was recommended by the hotel staff.  Really nice wait staff, and had a really good meal (pasta angel hair diablo chicken) with a Caesar salad.. Fair prices as well. Good stuff",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "4Dr9sU3zb3cNl4-YOA4crg"
  },
  "jiGmRbDdCxgiIUZgGR4QJA": {
    "date": "8/5/2016",
    "text": "This is my first Yelp review. Decided to stop for dinner with my wife and youngest daughter this evening. We have not been there for over 10 years. It was great!!! My meal of Chicken Romano, baked potato and sauteed zucchini was perfect. I really can't remember a better all around meal in a really long time. My wife chose Chicken Parmigiana and my daughter got a grilled chicken salad. Both enjoyed their meals a lot.  Our waitress was very friendly and did an awesome job. We never had to wait for her for anything. Service was fast and meals were ready in a very short time. If you are on the fence about trying this place.... It gets my highest recommendation!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UtGA1DY2qQr3RXiM6L4VAQ"
  },
  "Y9XnQZnKAeYNyNKpJbmGqA": {
    "date": "8/17/2016",
    "text": "Stopped here for lunch for he first time. Ordered the Blackened swordfish sandwich which was awesome. Good food . Great atmosphere. I will be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dCKxJFWjnFUjMEi3Or8ejA"
  },
  "-KYX4LkpUBtiRJpZWKtsAg": {
    "date": "4/6/2016",
    "text": "Great food option within walking distance of holiday inn. The service and hospitality was excellent. The food far exceeded my expectations, with a home cooked feel and high quality restaurant preparation and presentation for what I expected. The fried ice cream stood out with our desserts. Would go back for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Mx-GKKSX4E1jrfqcDVz6XQ"
  },
  "xz_2catMiDIqWEZc2yKlKg": {
    "date": "10/31/2014",
    "text": "Five stars because for what this place is it's perfect. No, the steak isn't like Ruth's Cris, but it's priced fairly and the beer taps are cold. Nice people and clean too. Come here get a big pasta dish or a steak and a beer and be happy. Neighborhood restaurant and bar with warm and welcoming staff. Sit at the bar and be a local if only for a night. Our hotel recommended Skyvue and glad they did. Not pretentious or stuffy. Just good and reliable. Perfect place to take refuge from the cold winds and rain.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xpSsUisWntjKLVRT2z-PhQ",
        "caption": "Photo of Skyvue Restaurant - West Mifflin, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xpSsUisWntjKLVRT2z-PhQ/o.jpg"
      }
    ],
    "user_id": "_v7pf2-SI5w22ENb6eVjMg"
  },
  "ZN6gN2-Wv1SrXSpWb6LBRg": {
    "date": "5/22/2016",
    "text": "I was very skeptical when the hotel we were staying at recommended this place.  We arrived at 8:30 in the evening on a Friday. Walking into the dining room it reminded me of a room a wedding would be held in.  Don't let that put you off.  I ordered Pasta Diablo and my wife a steak.  I read that service was slow but this wasn't the case with our server, a young, thin, rather tall young lady with a sense of humor.   The food was excellent.  The pasta was loaded with chunks of chicken and was spicy as advertised...and as I like. The peppers on top were perfect neither under or over cooked.  My wife's steak was fork tender and very delicious.  She also had a baked potato that she claimed was the best that she had had in a long time.  I would definitely  go back there when in the area again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tExnDQdIGwyYCvHA8gu-JQ"
  },
  "6Pr6zKx8-FQWy1QaygYYoQ": {
    "date": "5/1/2015",
    "text": "Might be some of the worst service I have ever experienced. Large party, maybe 40 people. Two waitresses. Empty drinks, over and hour for appetizers (cold vegetable trays ordered weeks in advance). Our family and friends were walking around with pitchers refilling drinks. The wait staff and the owners were both rude and inappropriate. Never again. This restaurant is not what it used to be.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zr5FdfAqgZ41Q9BKji9ELA"
  },
  "Vd64HZ9lbU0FI-aV8mls-A": {
    "date": "1/14/2017",
    "text": "The wait staff and food are okay. It is first and foremost a bar. If that is your expectation you will not be disappointed. They do not have to be fast but they should be attentive and they fail miserably on this point. We just spent over one and a half hours waiting for our meal because they had a \"large party\" which took precedence over us and all the other customers except for what appeared to be regulars because they ate and left while we and others were still waiting. When we finally got the food is was luke warm. It is no the first time this happened because the kitchen and staff is so small but it is definitely the last. Save your time and money, pick a real restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cfXc4eDsIHSTDrz8H-hGrw"
  },
  "f8180yGANkzPd_6DgaAD1Q": {
    "date": "8/7/2015",
    "text": "We have eaten here a few times with poor results and thought we would give the Skyvue one more chance. This time was the absolute worst. I had the veal Parmesan and the veal was a nice portion with good taste. The marinara sauce was like tomato paste straight from the can. It had no spice and did not taste fresh. The pasta crumbled with a fork and tasted like it was cooked days before. A new order of pasta was brought 2 times and all was way over cooked. We were one of three tables seated at dinner time and it took 45 minutes to get food. The staff was friendly but slow.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tT26igDkoaQj2SHg0j-v0Q"
  },
  "gGZZoYtnyAFK44Z-yBICDw": {
    "date": "10/18/2015",
    "text": "I got wet chicken. I vowed I'd never come back. I did. I ordered pasta and they gave me red sauce instead of white. I'm never coming back. Good fries, though",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tB3uVcZTsUwLtY7KXjVLYQ"
  },
  "54-8tuOi97jbs0QJUKeZ4g": {
    "date": "6/10/2014",
    "text": "Pleasantly surprised to say the least. Looked dismal from the outside but the food is excellent. Sword fish is grilled perfectly. I firmly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SB6jdby6V-5C75vIT7cPww"
  },
  "O8oQzDzmMz7QnranrKZCZQ": {
    "date": "11/2/2013",
    "text": "Stopped in for lunch after a soccer game. Not being from the area, we checked the yelp ap and this great little place popped up. We were seated in the bar because of a private party, and ended up having a great time. The staff was warm and friendly. The food was incredible. The owner came over several times and chatted up our son, she even gave him a Halloween swag bag.  The french onion soup was really good. A good slab of bread covered in lots of gooey cheese with a rich beef broth. The wedding soup had plenty of meatballs, that were really really good. Our son had a bacon cheeseburger, perfectly cooked with crisp bacon. The chicken quesadilla is large enough to share and filled edge to edge with well seasoned chicken and peppers. The crab stuffed mushroom had a lot of lump crab and very little filler.  Our drinks were always full, and plates cleared promptly. The food was reasonably priced, and not over salted. The restaurant is spotless. The other patrons were really friendly, and everyone chatted back and forth. It was a nice place to hang out for a while. Wish we lived closer, but we usually have 4 or 5 games a year in the area, so we'll definitely be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "U0XH9auOPoH7HOGeaZH4UQ"
  },
  "DtQH0E23hXnHcKGDz6XsqQ": {
    "date": "1/14/2015",
    "text": "Great local place!! Nice Change from a chain restaurant. Friendly staff and great home made food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xa-2Ph8mG4YNECxf7CJf0w"
  },
  "fn-6rO1L1WR2Q_-d5EWayQ": {
    "date": "10/26/2013",
    "text": "Darren had been dying to come here for some reason. It's near the Wal-Mart we go to, so I said why not? lol. The decor inside is neat and centered around airplanes since it's near an airport. The service was off, though, and the food wasn't that great. The Parmesan Crusted Artichoke Hearts were really good, but things went downhill from there. The Chicken Cordon Bleu was bland and rubbery. Dessert was a flavorless chocolate cake. Some people walked out while we were dining since the hostess wasn't around to seat them. Heh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7AGLlj5YzqdBfCPiZCa1mQ"
  },
  "yX-efxA7_30JfjJJC6us5g": {
    "date": "8/29/2013",
    "text": "The food is decent but the bar service sucks. I've been here for 20 minutes and still no appetizer. It was the same way last time I stopped.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5THzZ6za92ePQVWDKlWKBA"
  },
  "5QigXdbpBsuNU4HVzxlJXQ": {
    "date": "10/23/2014",
    "text": "From the beginning dealing with this place was a disaster however, being as though we had booked it for a bridal shower, sent out invites & the whole 9 yards we decided to stick it out. Before I knock the customer service & the \"planner\" (hardly) Debbi  morrow I will say the food was excellent & the place is updated & clean. The food & the atmosphere will not be enough to make me come back. Debbi had repeatedly not returned phone calls, everyone working there gave different information regarding questions about seating, how food would be served, linens, You name it. I won't even begin to say what a disaster the shower was & the how the \"planner\" sat at the bar the whole time with her husband or whoever the other owner is. Debbi, you ruined our experience & made a joke of your restaurant when they heard you screaming from the bar area. Needless to say I will never, ever come back & I'm sure I can speak for the other shower guests when I say they won't either. Maybe this place needs to rethink there \"planning\" staff.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "HyEEyEU6CN3d6Qk9zol8nQ"
  },
  "FfxCeKpFzJx9TP695xl_WQ": {
    "date": "3/4/2013",
    "text": "We were spending the week in West Mifflin and Skyvue was recommended by our hotel. We ended up eating there every night. The food,service,drinks and price were all fantastic. It was very clean and they treated you like family. Loved the fish sandwich, salmon and the GB margaritas!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0doJv9YEy6_ZURTHAtDliA"
  },
  "4UuRoOtzjWMu1KvfHmNejw": {
    "date": "2/11/2015",
    "text": "Have driven by here for years , finally decided to try it a year or so ago. Pleasantly surprised. Been back a half dozen times. Food is always quite good, service can be hit or miss - never bad , just sometimes slow. The other night there were new waiters right on top of things. Place is nicely decorated, and even the kitchen is spotlessly clean. Have kept this on my list and have crossed off a couple of my usual chain places with mass prepared food in favor of freshly made meals here. Give it a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "rHVnrwPzTvn0uDtDIbtkIw"
  },
  "L3DmwSxlRwMh73dv1CMvQw": {
    "date": "8/6/2019",
    "text": "Very friendly, very fresh food, and great...friendly service...Pretzel Crusted chicken was great! We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kqytC4gk1EPGq6LoIYIoiA"
  },
  "f9t5p_WZUz1-u7EHfzTt0A": {
    "date": "8/30/2019",
    "text": "The food is good. No doubt about that. BUT they started implementing unfriendly practices. If you use a credit card you pay an additional 4%. For small orders that might not be difficult but if you have a larger order or a large group it makes it very difficult. But this next one is a terrible policy. Neither my mother (88) nor I can eat a lot of food at one sitting. So rather than buy two dinners and take home leftovers we share a dinner in the restaurant and we take a dinner home. So two people are still buying two dinners. But they stated that they would charge us a $2 charge because we were sharing the dinner even though we were buying a second dinner. we didn't even want them to split it as we could do that for ourselves. That is a deal-breaker for me. What I've noticed over the last year or two is that management has gotten very unfriendly toward the guests. The waitresses are still very nice but the policies and the management seem to be anti guest.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nnclh3akvjWdQ9VNJ8u1qw"
  },
  "EYiZkQ7Jf0Q4OkseoN00sQ": {
    "date": "1/5/2019",
    "text": "The service is always excellent! Food is made to order, so expect a bit of time to make your food, but no more than other restaurants that also make food to order. It is well worth the time. Not heat and serve foods. Chicken parm, chicken piccata are wonderful. Their house dressing, I refer to as liquid gold, is a mixture of garlic, feta, olive oil and spices. OMG! It is fantastic!! This restaurant has THE BEST fish. We  frequent this restaurant alot during Lent for fish. Panko breading...YUM! The portion is huge! The fish sandwich is like getting fish to eat us a fish sandwich. Highly recommend! Their hamburgers are delicious! You have to try the fried portabella mushrooms. They are breaded in panko. OMG they are fantastic!! The prices are reasonable too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TCd3L7CM-nGUKH1Y6F1h3g"
  },
  "JCtEN--gdNaFoa2cFh5cDg": {
    "date": "4/22/2019",
    "text": "WOW!!! First I must say, everything is so expensive now and to get a little extra to go out and enjoy a meal is a special treat. I am a member to a very nice and respectful motorcycle group. We all ride very expensive bikes. We booked a brunch buffet to have a meeting to discuss club agenda and to enjoy a meal before a ride. The employees were late to work . 25 customers waiting in the parking lot for the restaurant to open. Many of our members are from very far distances away. It was a major inconvenience to wait for a ignorant arrogant person to come to work. When he arrived there was no explanation and no apology. Tiffany our waitress was trying so hard to cover for her lazy co worker. The buffet was not prepared for therefore it was suggested we order from the menu. The service was very slow and unorganized. Tiffany had no help. She was running from room to room trying to get drinks and orders in. The food took over an hour to start to trickle out to our group. We arrived at 11 and left at 2. This is unacceptable it should never take that long for sandwiches and salads. Tiffany wrote our orders down and forgot just about everything that was requested. For example water,ranch sides etc.. At the end of this pathetic visit we were handed one bill about a foot long for 25 people to try to figure out what they needed to pay. It was really one of the worst restaurant visits to date.  As our group travels around to different restaurants each month  we never have a problem with separate checks. We are a very patient and respectful group. This restaurant should learn from this and try to improve service. We wont be back and I am getting really tired of piss poor service OK food and dirty bathrooms. I don't expect many restaurants with service like this to stay in business.  Yelp is our voice to stand up to this kind of ignorance. The customer is your boss, is your paycheck! If you want return visit clean the bathrooms and put out a wonderful delicious meal and hire people who care. Pay them and train them is the basic policy. Everyone is after the almighty dollar but earning it seems to be lacking everywhere these days.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cn3SA7lal0as_Brx6nwzgg"
  },
  "OP58JXG9F1ApsZSZ2k-A0w": {
    "date": "4/22/2019",
    "text": "We booked a lunch buffet for our club for 25-30 people. for Saturday at 11:00 am. The staff didn't even show up to open the doors until 11:20.This was the first sign if things to go bad. A waitress took our order about 12:00 noon. We were told there wasn't going to be any buffet, we could just order off the menu. It took 45 minutes to just get a water, that I had to ask for 3 times. Our food didn't start coming out to us until 1:30. The person next to me was done eating 20 minutes before I got my food. I guess that's what happens when you try to run a restaurant with one cook and one waitress. When we ordered we told the waitress who would be on which checks and she said she could split it up however we wanted to. However when we got the check we were told they didn't know how to split it up and gave us one big long check that was almost 2 feet long. That's when the chaos ensued. 30 people trying to figure out what they ordered and how much it cost. Most of the people just left some money on the table and left. I'm sure none of us will be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h0Bjr6OULQcobNzbkmEI4g"
  },
  "QuNRowD5acCQtK_dgl33Zw": {
    "date": "7/5/2018",
    "text": "I've eaten here several times. I have to say that they're Glazed Salmon IS TO DIE FOR!! Seriously, if this was my last meal, I'd go in peace!! Plus, make sure you try the Pretzel!! Ugh, food heaven!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P3_rVhBmhSPoojmHaRibpA",
        "caption": "Photo of Skyvue Restaurant - West Mifflin, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P3_rVhBmhSPoojmHaRibpA/o.jpg"
      }
    ],
    "user_id": "hY-GhUnbHZWfs2ZTKvseNg"
  },
  "KetOlXSCeYlPcfYj_-AA3w": {
    "date": "3/22/2019",
    "text": "Beware of this restaurant if you pay by credit card.  They charge you an additional 4% without letting you know.  I won't ever go there again or recommend it to anyone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2eXwbC5UHeW5vXo4kTxUtA"
  },
  "P8RhkIVoQ-Bas4Rv3srPJg": {
    "date": "2/1/2017",
    "text": "The food is decent for a small diner type \"family restaurant\". The interior of the restaurant is actually much better than you would expect from the outside.   Service, and the kitchen, can be slow if there is a large group or if they're really busy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "E5DnuX91UreL587Ny3q5zA"
  },
  "ilmSxKUOwxo4crse_kpnfA": {
    "date": "3/12/2019",
    "text": "Have eaten at the Skyvue many times. It never disappoints. Usually order steak, which is always excellent, or some kind of fish. My husband loves the Mahi Mahi. Today, we had lunch. The special was a meatball sandwich. It was excellent, more of a hoagie than a sandwich, but very tasty meatballs. My husband had the ham and swiss with a cup of vegetable soup. No complaints. Always clean and good service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jinH5QmMXcnUYXDM1CUbWQ"
  },
  "9-xrmCA-qBFCAKbFmX_kQw": {
    "date": "12/28/2016",
    "text": "Customer Service: 2 Value: 1 Food Quality: 2  This place receives a customer service rating of 2 due to the fact that our waitress (probably in her mid-late 50's) provided ZERO help with recommendations or would even smile or interact with any of my group when trying this place out for lunch.   Here 6 people are with corporate credit cards that do not have limits for meal purchases, and thanks to this waitress we will not step foot in this place again!   We started off with each one of us ordering a different appetizer so all of us could try out the variety. \"Fried Green Tomatoes\" are pretty self explanatory right? Well why do \"Red Tomatoes\" show up in place of green ones? Kitchen thought they were gonna try and trick the customer? Who really wins in the long run in these situations?   The sandwiches were respectable, but whatever the \"Spicy Beef Sandwich\" is supposed to be doing, it isn't... This thing was nothing but an overpriced Sloppy Joe with no flavor but Hot Pepper flavor.   Due to the low quality of food we received during our visit, the waitress that could care less whether we were there or not, and the kitchen trying to send out food that doesn't match what the menu says it is, I can't recommend this place to anyone or care to go back to it.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDi9iq5zV4cvb8MrWXAZ-w"
  },
  "yhfUZME537ogpRQgcvN79A": {
    "date": "7/19/2017",
    "text": "The restaurant has a great menu and service. The server writes her name on the paper tablecloth as a nice touch. Requests for substitutions are readily handled.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tElA2GwYeF3g1OR79kuuBQ"
  },
  "cC18elZu_O6AEbjXQHci4g": {
    "date": "9/5/2017",
    "text": "We went to dinner there after an appointment.   We were greeted by Dawn who was also our server.  The restaurant looked immaculate.  We were offered beverages and given menus. I ordered cordon bleu  and my husband ordered flounder almondine..  evervthing was hot and delicious.   We really enjoyed our meals  and the price was right.  We will be back.  The server was pleasant and attentive.   Thanks Dawn.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bFtw4CMdF2-rYB9m6hhMJw"
  },
  "CMz3DXwKuWUeYUBNabI9LA": {
    "date": "8/3/2017",
    "text": "Absolutely the worst dining experience!  There are many horrible ways I can describe the treatment we received at SkyVue Restaurant, but let me limit it one: We felt like we were on one of those prank gameshows; the service was such a JOKE!!  Let me start off by saying we were frequent customers of SkyVue up until this experience, this evening out totally ruined it for our family.  After arriving, we were greeted by the rudest wait-staff I've ever met working there (Greg). Note: The restaurant is a family establishment (maybe 15-18 small dining tables), so even on their busiest day they may have 5 tables per waitress/waiter.  On the evening we went out (on a Wednesday) there were approx. 8 other tables.  We were sat and ignored (the waiter walked past us many times), until about 10-15mins in. He took our drink order in a hurry and was gone again, another long period of time passed until our waters and iced tea were delivered to the table (still waiting on our bar drinks).  Finally back to the table with our bar drinks, he set them down and dashed off again not even taking our order (mind you, we've been there 25mins already). At this point we were getting a bit upset and started to notice another table getting neglected was well. We didn't let it get to us and tried to make the best of it.  The neglect continued; our order was taken incorrectly, drinks were NEVER filled up (honestly not even once), appetizer was unsatisfactory, soup/salad was never delivered.. And about time the food came, this was only the 4th time we had spoken to the waiter in an hours time.  When he dropped off the food, we made one comment \"can you please make sure to take the food we never received off the bill?\". His response was nothing we would have ever expected! \"You know, you can leave!\" as he turned and walked away, then mumbling so we could still hear \"and I wish you would\".  We immediately stood up and walked over to the bar where the manager appeared to be. Walking past the kitchen area where our waiter was, I made a comment to the bus-boy asking if the man at the bar was the manager. To my surprise our waiter was in the kitchen running his mouth about how he just \"told his table off\" and poked his head around the corner and made another comment to me, stating \"you look cute when you're mad\". ---Seriously how can someone in this business be SO DISRESPECTFUL!   We then spoke with the manager and shared all of the concerns of what occurred. He responded calmly that he'd pay for our meals and we could watch him go \"tell our waiter off\". Such a joke, he seemed so careless of everything we shared. We left, very disgusted with the entire experience!  This absolutely ruined our evening and opinion of SkyVue; It left me and my family seething due to the unnecessary disrespect shown to customers.  WE WILL NEVER VISIT THIS RESTAURANT AGAIN! & I will share this story of such horrible service with everyone I know.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vvp-JWSrXMawPzJuXhnr9g"
  },
  "wL4UtqhJpyF_DSUbUbnjbg": {
    "date": "4/4/2017",
    "text": "Second time here in 2 weeks. Had the Mediterranean Quesadilla last week, we are still talking about it. Today we had the Zucchini Parm over angel hair! Delicious! We may be here again next week.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "duaJxYWc5pxKuYll6L7sOg"
  },
  "adadjTl86ouW1XRT0h2I0A": {
    "date": "10/13/2013",
    "text": "Man, my late grandfather, an aviation buff, would have loved this place for the theme alone...  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DbXPEBFKWp3M&s=8e64c19fc3f9b2de2495375e61933aeca231219bd9f12818dec1233554e14975\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=bXPE...</a>  Located near the Allegheny County Airport, The Skyvue, a West Mifflin mainstay that is currently celebrating its 75th anniversary, was fairly recently renovated after having been closed for several years.   The small bar was well-attended by what surely were regulars. That dining room, however, was gorgeously and unexpectedly appointed with its bright, hardwood floors, model airplanes, propellers, jukebox, and old, framed photographs. Hit songs from the 1950's played continuously. Kay and I were the only ones not bellying up for beer. A local food critic who goes by the pseudonym  \"Munch\" gave Skyvue a favorable write-up as well as a glimpse into its backstory. What...could go...wrong?   After being ignored for 5 minutes  we were told by an apologetic and cheery barmaid to \"Just sit anywhere.\" Hmph. We coulda done that on our own.   Sleuthing their menu online before visiting this past Monday night en route to Wal-Mart (ugh), I already knew which entree I wanted: Swordfish! It had been a good while since I had some! No burgers tonight!   It wasn't until I was halfway finished with the slab of fierce sea creature that Kay slipped a Reader's Digest-worthy factoid into my glass 'o Pepsi.   \"Hon, you should never order fish at a restaurant on a Monday unless they specialize in it. It's probably not fresh. I would think you'd know that, Mr. Foodie.\"  \"I did not know that,\" I responded, channeling Johnny Carson. Hence the uneven nature of my blackened filet. Some morsels were arid and tough. Others were juicy, fatty, and flavorsome. A stunning remoulade sauce and a tasteful presentation almost made up for the lackluster hunk of oceanic protein. Almost.   Seconding my fish was a dish of unseasoned, drab garlic mashed potatoes and a colorful, buttery, tasty, and all too brief medley of red bell peppers and zucchini.   A hopeful appetizer consisting of parmesan-encrusted, deep-fried artichoke hearts complete with a side of horseradish mayonnaise only furthered my disappointment with the main course. I had seen Bobby Flay eat these on Food Network special program on carnival food and had hankered for them since then. Apparently, anything can be plunged in hot fat after having been battered, and these fleshy nuggets were indeed a treat.   A garden salad came close to winning me over as well, its bold, snappy honey-mustard dressing proving delightful.   Dessert for moi was a humble pecan ball in an elegant goblet. A mound of piped on (real?) whipped cream topped the cold, golden, caramel-laced vanilla spheroid. 'Twas nothing to salivate nor vomit o'er.   Dessert for Her was an absolute floozy of a chocolate cake cut. Kay refused to finish it, so I intervened, and found its lack of personality striking. The icing tasted like chocolate vegetable shortening, and the cake itself was akin to a dry sponge. Her turn-ons? Greasy hair, barbed wire tats, expensive stuff married men buy for her, reality TV, lonely old millionaires, plastic surgery, and juiceheads. Turn-offs? Reading, thinking, working, and other women. At least she looked good, though. A gal like that needs to make the fellas rubberneck.  Also forcing me to reduce my appraisal was the inexcusably poor service. I have to reiterate that The Skyvue's dining area was empty when we arrived, and not only were we disregarded for a time, but so was another couple who became annoyed and left unbeknownst to the staff! One more party of 2 came in while Kay and I ate, and not only did they eventually seat themselves, but the barkeep waited on them herself.   Our actual server, a sweet, pretty young lass, barely handled one group (that's us!) competently and had to enlist the reserves. To be fair, the bartender sort of had enough to deal with. Conversely, the waitress had what any other person in her field would consider a dead night.   Moreover, our dishes took much too long to arrive at our table, and we had to remind our server for refills constantly.   Crud, did I want to like eating here, especially after motoring past it uncounted times.   Well, I kinda did, anyway. I guess I should have ordered a Bacon Cheeseburger like Munch did, and like I do far too often.  P.S. Am I being lenient here? Our meal before tip cost $60! And no, I only left a gratuity of 15%. As you may know, I usually give around 20.",
    "rating": 3,
    "rated": {
      "funny": 10,
      "useful": 12,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "HomNOsbmMUlogL12Q9rliQ",
        "caption": "Photo of Skyvue Restaurant - West Mifflin, PA, United States. Pecan ball",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HomNOsbmMUlogL12Q9rliQ/o.jpg"
      },
      {
        "img_id": "4sRBJXmjfLN_m7SjGfNPTA",
        "caption": "Photo of Skyvue Restaurant - West Mifflin, PA, United States. Grilled swordfish",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4sRBJXmjfLN_m7SjGfNPTA/o.jpg"
      },
      {
        "img_id": "R9zO3Tu5yqZYQxULmWBxCQ",
        "caption": "Photo of Skyvue Restaurant - West Mifflin, PA, United States. deep fried artichokes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/R9zO3Tu5yqZYQxULmWBxCQ/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "dP2nnU9jkGtgqIjcsz4u6w": {
    "date": "1/17/2018",
    "text": "Every time we eat there the food is excellent. Great service too. The mushroom soup is the best I've ever had.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7KKlXxIJcWpxPNgRhD1dg"
  },
  "gihmXd56Wc-obRu9E_091g": {
    "date": "4/6/2017",
    "text": "My favorite dinner spot when traveling to this area of Pittsburgh.   The roast beef dishes are the bomb.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YfHsHUxwT0kd4MYb0OtSDw"
  },
  "JR0zYvXmxVx1c-52Yb1YyA": {
    "date": "3/13/2015",
    "text": "I don't often feel the need to update reviews but alas I am compelled. I came here last Saturday with Bry and the boy. Walking in it was smokey. Maybe the ventilation in the kitchen wasn't working right. Anyways we were seated right away and our waitress showed up and took our drink orders. After she returned with our drinks we were ready to order. I went with the coconut crusted mahi mahi and the boy got a cheeseburger.   This is where the issues start. So I checked in right after ordering. So 20 min go by and our waitress is nowhere to be seen. My water is empty and my easily served soup is also nowhere to be found along with the table bread. Bry and I are looking at each other like did she leave? Several min later Bryan's soup comes out which is weird because he ordered French onion which goes under a broiler to melt the cheese on top and I ordered a house soup that only had to be put into a bowl. Well 5 min later my soup and the house bread come out. The waitress refills drinks finally as well. The food here has never disappointed and the soup was no exception. Once done with soup we waited and waited. Finally our waitress comes over and says she's so sorry and the kitchen is backed up and asks if there's anything she could get us. So I say yes a Moscow mule. My favorite drink at the moment. Well 15 min later after my son has asked any waitress walking by where his food is. Finally a server showed up with our food. I ask about my drink and she says let me check. 10 more min go by before our waitress shows up and asks how everything is. The food is great but where's my drink. A few min later she comes back and says they are out of ginger beer. Great so I've been waiting 30 min for a drink that you can't make. So I said I'll have an appletini. By the time my drink came out I was already done with my meal and ready to go home. So I pounded the drink and asked for the check. Well check was full price they didn't even take my drink off. So a meal that maybe should have been an hour lasted 2 hours with horrible service and a slow kitchen. I do like the food here. It's fresh and it's very good I just can't get over the horrible service and the wait.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "43es_H5XlNzo0cWG24dCug",
        "caption": "Photo of Skyvue Restaurant - West Mifflin, PA, United States. Chicken florentine soup.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/43es_H5XlNzo0cWG24dCug/o.jpg"
      },
      {
        "img_id": "-gnnFzOJXUG6u9u75LE0yA",
        "caption": "Photo of Skyvue Restaurant - West Mifflin, PA, United States. Coconut mahi mahi.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-gnnFzOJXUG6u9u75LE0yA/o.jpg"
      },
      {
        "img_id": "HlSwKqLiXAmpZZJZlNl6ug",
        "caption": "Photo of Skyvue Restaurant - West Mifflin, PA, United States. Appletini",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HlSwKqLiXAmpZZJZlNl6ug/o.jpg"
      }
    ],
    "user_id": "U92V-gp13uMZL-sl_naTHA"
  },
  "rznmKIRkZCMN5yw0tIrWmg": {
    "date": "8/29/2016",
    "text": "I've always enjoyed myself here. Everything I've tried from the menu was great. Fresh and homemade tasting. Friendly staff and a fun, slightly older crowd.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RFFmAqgTPR0_kQLhhkjBPA"
  },
  "ucw5AFU0Pd_RJ8U2kFpECA": {
    "date": "10/23/2017",
    "text": "My family has eaten here a few times and haven't enjoyed any of them.  The food is below par and bland.  The servers that we have had weren't very good either.  Disappointed...",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7wPSf6pdDDdZwikRZx5u-g"
  }
}